["Sharjah-based Hend bint Faisal Al Qasimi, Emirati princess of Al Qasimi family, claimed that right-wing propaganda website OpIndia published an article which said that climate activist Greta Thunberg’s real name is ‘Ghazala Bhat’.", "Don’t believe the news. It is written by those that are paid to have you agree with whatever they are told to make you believe. Do the right thing always, no matter how small- that is true religion. To be a good person is more important than to be an extremist. #GretaThunberg pic.twitter.com/c1Zd7gFRtv", "— Hend F Q (@LadyVelvet_HFQ) February 5, 2021", "She supported her claim by sharing a screenshot of a purported OpIndia story that shows Thunberg in a hijab and reads, “The real face of Greta Thunberg. Her real name is Ghazala Bhat she is daughter of Kashmiri Bussinessmen Hilal Bhat who married to Swedish mother Anna Björklund converted to Islam became Aafia. Her parents got killed into car accident. She became orphan later adopted by Svante Thunberg. [sic]”", "CEO of Khalsa Aid International Ravinder Singh too shared the screenshot on Instagram where it drew close to 40,000 likes.", "A post shared by Ravi Singh (@ravisinghka)", "The screenshot was also shared by singer Caralisa Monteiro and Pakistan-based journalist Omar Quraishi. Monteiro later took it down. An archived link can be accessed here.", "It is massively widespread on Facebook, with users criticising OpIndia.", "OpIndia has not published any article that claims Greta Thunberg’s real name is ‘Ghazala Bhatt’. Moreover, the screenshot does not have the same interface as OpIndia’s website. The font size and style are different and OpIndia stories are not centre-justified.", "The viral image has been created by morphing a screenshot from OpIndia’s website. Everything below the orange and black borders has been removed and morphed with a fictional paragraph and Thunberg’s image.", "OpIndia editor Nupur Sharma also tweeted that the screenshot is fake.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]