["About this rating", "The United States Treasury announced an adjustment on sanctions against the FSB that would allow technology goods to be imported to Russian consumers.", "The move was a routine update to the Obama administration's sanctions meant to ease the effects on American companies, not a \"gift\" to Putin.", "On 2 February 2017, a public notification of an OFAC general license published by the United States Treasury Department noting that sanctions against the Russian security agency Federalnaya Sluzhba Bezopasnosti would be tweaked to ease the burden on U.S. tech companies selling goods inside Russia caused some (including House Minority Leader Nancy Pelosi) to sound the alarm that President Donald Trump had \"eased\" sanctions against Russia.  Some appeared to assume the move was a sign that favor curried by Russian President Vladimir Putin with the new U.S. president had paid off. Pelosi released a statement that reads:", "U.S. intelligence agencies have thoroughly detailed the Russian security services’ brazen assault on American democracy in support of candidate Donald Trump. Less than two weeks after walking into the White House, President Trump lifts sanctions on the Russian Security Service. Vladimir Putin’s thugs meddle with an American election, and President Trump gives them a thank you present.", "That statement and others similar to it are not based in fact, according to foreign affairs and trade experts. The Treasury authorization reads:", "Requesting, receiving, utilizing, paying for, or dealing in licenses, permits, certifications, or notifications issued or registered by the Federal Security Service (a.k.a. Federalnaya Sluzhba Bezopasnosti) (a.k.a. FSB) for the importation, distribution, or use of information technology products in the Russian Federation, provided that (i) the exportation, reexportation, or provision of any goods or technology that are subject to the Export Administration Regulations, 15 CFR parts 730 through 774, is licensed or otherwise authorized by the Department of Commerce and (ii) the payment of any fees to the Federal Security Service for such licenses, permits, certifications, or notifications does not exceed $5,000 in any calendar year;", "Note to paragraph (a)(l): Except for the limited purposes described in paragraph (a)(l), this paragraph does not authorize the exportation, reexportation, or provision of goods or technology to or on behalf of the Federal Security Service.", "While President Trump's friendly overtures toward Putin and reports that Russian hacking had influenced the presidential election had raised fears about foreign intervention in the latter part of 2016, the recent activity by the U.S Treasury Department was only a tweak to allow American companies to continue commerce in Russia unharmed, not a sign of nefarious activity.", "Doug Jacobson, an attorney with Jacobson Burton Kelley PLLC, a Washington, DC-based law firm that advises companies on international trade law, explained that it is meant to allow American companies \"to obtain licenses and approvals from FSB to import certain software and IT equipment containing encryption into Russia\" — but it does not mean they are now allowed to sell directly to the FSB nor does it represent a lifting or easing of sanctions:", "When the government takes an action such as adding a party like the FSB to these very restrictive lists, banks have to block their funds. Then [U.S.-based] industry figures out, 'This could impact us, because we have to deal with the FSB to import U.S. goods into Russia' ... They are not the target of the restrictions -- it’s to penalize FSB, not U.S. companies. This doesn’t allow sales to the FSB, that’s still prohibited. It removes this impediment that would restrict U.S. companies from transporting products to otherwise unsanctioned parties in Russia... This was no gift to Putin.", "Ankit Panda, a foreign affairs analyst who edits at The Diplomat, told us the move was a routine update to the sanctions that was planned by Trump's predecessor, President Barack Obama, in response to U.S. industry concerns raised after sanctions were put in place in retribution for hacking:", "It's a limited $5,000 sanctions relief ceiling that allows the United States to pay the FSB for certain export licenses for American products into Russia. It's a technical form of relief that was planned under the Obama administration.", "The fear generated by the announcement, he said, was a \"signal-noise\" problem created by the current political environment, although the Treasury action was \"something that's quite normal that's getting blown out of proportion given the poor timing/optics of 'sanctions relief' for Russia.\" He noted that the hysteria was a result of anxiety hanging over from the 2016 election, coupled with recent news of a friendly phone call between presidents Trump and Putin and a spike in military violence between Russia and Ukraine.", "The Russian government pounced on the opportunity to further misinformation and politicize the routine Treasury move, with Russian government-owned media boasting:", "By easing sanctions against Russia’s Federal Security Service (FSB), Washington paves the way to setting up an anti-terrorism coalition, member of the State Duma, former director of the Federal Security Service (FSB) Nikolai Kovalyov told TASS.", "\"This shows that actual joint work on establishing an anti-terrorism coalition is about to begin,\" Kovalyov said. \"This is the first step on the way leading to cooperation in the war on terror.\"", "\"Without easing these sanctions it would have been impossible to take the next step,\" the lawmaker said. \"These practical actions indicate that US President Donald Trump has been consistent,\" he stressed.", "As Reuters reported, this is a misrepresentation, and the Treasury action was more on behalf of U.S. business interests than anything else:", "Sanctions experts and former Obama administration officials stressed the exceptions do not signal a broader shift in Russia policy. They said the license was designed to fix an unintended consequence caused by December's sanctioning of the FSB...", "Beyond its intelligence function, the FSB also regulates the importation of software and hardware that contains cryptography. Companies need FSB approval even to import broadly available commercial products such as cell phones and printers if they contain encryption.", "Harrell said tech companies had complained. \"I don't think when they sanctioned FSB they were intending to complicate the sale of cell phones and tablets,\" Harrell said.", "Sam Cutler, a senior analyst at Horizon Client Access, told us that the misplaced outrage is not helping with sober discussion of a weighty and complicated issue:", "[A] productive discussion of U.S. sanctions policy requires that we ensure the public debate accurately reflects the law as written. Preemptive and misplaced outrage not only is counterproductive, it negatively impacts Treasury’s ability to make future necessary regulatory changes for fear that they will be misinterpreted. There are valid reasons to be concerned about the new administration's intentions vis-a-vis Russia sanctions, but this is not one of them.", "We have not yet received a response from the U.S. Treasury Department or from Pelosi.", "U.S. Department of Treasury.   \"Publication of Cyber-related General License.\"\r\n    2 February 2017.", "Rep. Pelosi, Nancy.   \"Statement on Trump Lifting Sanctions on Putin’s Intelligence Thugs\r\n    2 February 2017.", "TASS.   \"Former FSB Head Says Easing of US Sanctions Paves Way for Setting Up Anti-Terror Coalition.\"\r\n    2 February 2017.", "Schectman, Joel, and Dustin Volz.   \"U.S. Makes Limited Exceptions to Sanctions on Russian Spy Agency.\"\r\n    Reuters.   2 February 2017.", "U.S. Treasury Department.   \"Authorizing Certain Transactions with the Federal Security Service.\"\r\n    2 February 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]