["About this rating", "Pop songstress Taylor Swift made waves in early October 2018 by announcing she would vote for a Democratic senatorial candidate in Tennessee's upcoming midterm election, breaking her longstanding silence on political issues, according to multiple press reports.", "The move earned Swift both kudos and jeers from the public. Predictably, it also inspired junk news purveyors to fabricate stories related to her foray into politics.", "A report that appeared on America's Last Line of Defense (LLOD) (and was reposted on at least two other websites) proclaimed that Swift was \"busted\" on a date with former NFL quarterback Colin Kaepernick, who is best known for protesting racial injustice by kneeling during renditions of the national anthem:", "Taylor Swift destroyed her career yesterday by coming out to back the Democrat party of losers. Nobody could understand why. Her post on Instagram looked like a leftist cult member wrote it. Freedom of choice and the gays are all well and good, but they don’t belong in your job.", "Today, the truth has come out. A photographer snapped 14 pictures of Taylor Swift and Colin Kaepernick last night at Klub Karl in downtown San Fransisco [sic]. The club is a known socialist hangout. The photographer was spotted and searched and his camera was destroyed but he was able to get a headshot of Swift with his phone, proving she was at the infamous club. The wall behind her is unmistakable.", "Swift and Kaepernick arrived and left at different times, but people inside the club have confirmed that they acted like a couple. Security officers at the building across from Swift’s hotel said that Swift and Colin Kaepernick arrived together and he never left.", "Despite the claim that a photographer documented Swift's presence outside an \"infamous club\" and \"known socialist hangout\" called \"Klub Karl\" in San Francisco, the only image accompanying the article appeared to show her instead standing outside Alice Tully Hall in New York's Lincoln Center.", "There is, in fact, no \"Klub Karl\" in San Francisco.", "America's Last Line of Defense is part of a network of websites and social media accounts notorious for publishing so-called \"satirical\" content with clickbait headlines aimed at ridiculing conservative viewpoints. A disclaimer on the site warns:", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places and events are purely coincidental and all images should be considered altered and satirical.", "Two other websites that reposted the same spurious article verbatim (astepaheadofeveryone.live and phoenixnews5.site) bore no such disclaimer.", "Associated Press.   \"Taylor Swift Breaks Political Silence, Backs Tennessee Democrats.\"\r\n   7 October 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]