["About this rating", "In mid-August 2019, some social media users encountered a screenshot purportedly showing an article published on CNN entitled: \"Should Women be allowed to breastfeed on the battlefield?\"", "While the problematic premise of this headline was apparent to most viewers (wouldn't this require babies to be on the battlefield?), some social media users were less sure if this was a genuine question posed by CNN.", "This is not a genuine CNN article.", "This image was created by digitally editing a fake headline and unrelated photograph onto a genuine screenshot from CNN's website. Suspicions may have been raised by the fact that this headline contains some nonsensical capitalization, such as the word \"Women.\" Additionally, if CNN were to write an article about breastfeeding in the military, they would probably use an image of an actual female soldier, not Jessica Simpson from the movie \"Private Valentine: Blonde & Dangerous.\"", "The bylines below this headline give us a clue about the original CNN article. Chuck Johnston, Jamiel Lynch, and Dakin Andone did co-write an article published on Feb. 22, 2018. That article, however, was entitled \"Armed school resource officer stayed outside as Florida shooting unfolded, sheriff says,\" not \"Should Women be allowed to breastfeed on the battlefield?\":", "Here's a look at the fake headline (left) and the genuine article (right)", "This image appears to have been created by Twitter user @NekoSouth. It was originally shared on Aug. 21, 2019, along with the accompanying text: \"Tactical milkers. Yes pls.\"", "@NekoSouth likely shared this image in jest, as the account responded humorously to comments and expressed amazement that this image had received more than 100 retweets:", "Johnston, Chuck.   \"Armed School Resource Officer Stayed Outside as Florida Shooting Unfolded, Sheriff Says.\"\r\n    CNN.   22 February 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]