["About this rating", "On 2 January 2018, satire site The Last Line of Defense published a hoax article appearing to report that two Christian bakers in Oregon had a stunning reversal in fortune — according to the claim, the couple had won a $3 million lottery payout shortly after being fined for declining to bake a cake for a same-sex wedding:", "Melissa Morgan and her husband, Ben, have seen way too much bad news with their names on it. After being sued by a gay couple they refused to bake a cake for so they wouldn’t go to hell, they suffered loss after loss at the hands of the courts.", "That streak of bad luck came to an end this morning when the Morgans learned they had won more than $3 million playing Oregon’s State Lottery.", "A spokeswoman for the Sweet Cakes shop told our reporter:", "“Melissa and Ben are thrilled that God has come through for them. They had no idea how they would pay the $165K in ’emotional damages’ they legally owe a pair of fairies for having their feels hurt. It’s been a BS, overblown nightmare and they’re happy it’s over.”", "The only smidgen of truth in this story is that a bakery in Oregon called \"Sweet Cakes by Melissa\" was indeed fined after they declined to bake a cake for a same-sex wedding. However, this fake news article incorrectly identified the owners of the shop, misreported the amount that they were fined, and completely fabricated the story about them winning the lottery. The Christian owners of this bakery are actually named Aaron and Melissa Klein, not Melissa and Ben Morgan, and they were fined $135,000, not $165,000.", "The Last Line of Defense bills itself as a \"satire\" web site, and carries a disclaimer labeling all of its content as fiction. This web site has a long history of publishing misinformation.", "We reached out to the real Melissa Klein to find out if there was any truth to the story; she promptly e-mailed us:", "Wrong names totally wrong information and we don't play the lottery. Only the picture is us.", "We also double-checked the Oregon State Lottery page and found no record of an Aaron or Melissa Klein winning a $3 million lottery in January 2018. Though the site only lists its winners by first name, no one named Melissa or Aaron won that sum, according to the site's search.", "A few days before this hoax article was published, Oregon Live reported that an appellate court had upheld the penalty against Melissa and Aaron Klein:", "The Oregon Court of Appeals on Thursday upheld a decision by Oregon's labor commissioner that forced two Gresham bakers to pay $135,000 to a lesbian couple for whom the bakers refused to make a wedding cake.", "Melissa and Aaron Klein made national headlines in 2013 when they refused to bake a cake for Rachel and Laurel Bowman-Cryer, citing their Christian beliefs. The Bowman-Cryers complained to the Oregon Bureau of Labor and Industries, saying they had been refused service because of their sexual orientation.", "An administrative law judge ruled that the Kleins' bakery, Sweetcakes by Melissa, violated a law that bans discrimination based on sexual orientation in places that serve the public. Brad Avakian, the state labor commissioner, affirmed heavy damages against the Kleins for the Bowman-Cryer's emotional and mental distress.", "Friedman, Gordon.   \"Appeals Court Upholds Fine Against Christian Bakers Who Refused to Make Same-Sex Wedding Cake.\"\r\n    Oregon Live.   27 December 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]