["In defending controversial statements by the Republican Party’s candidate for lieutenant governor, State Sen. Steve Martin made some of his own.", "Martin, R-Chesterfield, attended a May 23 fundraiser for E.W. Jackson, the GOP nominee for the No. 2 spot. A Richmond Times-Dispatch reporter asked Martin to weigh in on a video from last fall in which Jackson denounced the the Democratic Party, the Ku Klux Klan and Planned Parenthood in the same breath.", "\"The fact is that both the KKK and Planned Parenthood are creations of the Democratic Party,\" Martin said.", "We recently gave a False rating to Martin’s claim that the Democratic Party started the KKK.", "In this Truth-O-Meter, we’ll look at his contention that the party started Planned Parenthood.", "Planned Parenthood founder Margaret Sanger  began her crusade for birth control access through a magazine called \"The Woman Rebel\" that she started in 1914.", "Sanger was subsequently arrested and charged with mailing obscene materials because the magazine championed birth control, which was illegal, and published information on sex. But the Democratic Party was not involved in her trials nor her opening of clinics in Brownsville, N.Y., in 1916 or in Harlem in 1923, according to the book \"Margaret Sanger: A Life of Passion.\"", "The book’s author, Jean H. Baker, sent us an email saying Sanger \"abstained from any political commitments.\"", "The book says Sanger was angered by politicians from both parties who refused to back birth control programs, including Democratic Presidents Franklin Roosevelt and John Kennedy. Baker attributed the opposition to the doctrine and power of the Catholic Church rather than any political party creed.", "Sanger founded the American Birth Control League in 1921. Members during its first decade were typically upper-middle-class women of childbearing age, according to the book \"Woman of Valor: Margaret Sanger and the Birth Control Movement in America.\"  The author, Ellen Chesler, wrote that of the members of the league willing to to list their party affiliation, \"just over half said they were Republicans, while 8 percent identified themselves as Socialists, reflecting the movement’s, and Margaret’s own, idiosyncratic histories.\"", "Sanger resigned in 1928 as president of the league, which became the Planned Parenthood Federation of America in 1940.", "Is there any evidence the Democratic Party created Planned Parenthood? When we asked Martin, he told us he phrased his claim poorly and should have said the Democratic Party has  \"sustained\" Planned Parenthood. Soon after our conversation, Martin released a statement saying he \"regretted the carelessness and inaccuracy\" of his comments.\"", "Although it’s not the purpose of this article to examine whether the Democratic Party has \"sustained\" Planned Parenthood, we should note that Martin’s substitute claim needs qualification. Congress did not start funding birth control efforts until 1967 -- 46 years after Sanger founded the organization that would become Planned Parenthood. For a long time afterwards, there was strong bipartisan support for funding birth control organizations.", "Only in 2011, with abortion debate heating up, were there partisan floor votes in which the GOP sought to strip federal money from Planned Parenthood and the Democrats insisted on preserving it. House Republicans have introduced another bill this year to end taxpayer funding for the organization.", "Planned Parenthood reported receiving $524 million from the U.S. government in grants and payments during the fiscal year that ended last Sept. 30 -- roughly 45 percent of the organization’s revenues.", "Our ruling", "Martin said that Planned Parenthood was created by the Democratic Party. There’s no evidence to support that claim. Biographers of Margaret Sanger, the founder of Planned Parenthood, say she shunned political commitments and was critical of presidents from both parties.", "Recognizing that Martin has since expressed regret for his words, we rate his statement False.", "Richmond Times-Dispatch, \"Jackson defends controversial comments,\" May 24, 2013.", "Richmond Times-Dispatch, \"Martin stands by controversial comments on Planned Parenthood,\" May 30, 2013.", "Interview with Martin, May 24, 2013.", "Emails from Steve Martin, May 29 and ??, 2013.", "Jean Baker, Margaret Sanger: A Life of Passion, 2011.", "Emails with Jean Baker, author and history professor at Goucher College, June 4, 2013.", "Ellen Chesler, Woman of Valor: Margaret Sanger and the Birth Control Movement in America, 1992.", "Congressional Quarterly Almanac, 1970.", "The American Presidency Project, President Nixon’s Special Message on Population, accessed June 4, 2013.", "Slate.com, \"America Used to Agree on Public Funding for Family Planning. What Happened?\" Feb. 22, 2011.", "National Right to Life Committee, \"The complete text of the current Hyde Amendment,\" accessed June 4, 2013.", "ABCNews, \"Obama Overturns ‘Mexico City Policy’ Implemented by Reagan,\" Jan. 23, 2009.", "POLITICO, \"House votes to defund Planned Parenthood,\" Feb. 18, 2011.", "Huffington Post, \"Marsha Blackburn, Diane Black Offer Dueling Bills to Defund Planned Parenthood,\" Jan. 8, 2013.", "LifeNews.com, \"Planned Parenthood Abortion Business Gets Enough Money, Time to De-Fund It,\" July 23, 2009.", "Baptist Press, \"Effort to defund Planned Parenthood fails,\" July 24, 2009.", "Digital Journal, \"Black Pastors Want Candidates To Refuse Funding From Planned Parenthood,\" June 26, 2008.", "The American Presidency Project, \"2012 Democratic Party Platform,\" Sept. 3, 2012.", "The American Presidency Project, Republican Party Platforms from 1988, 1992, 1996, 2000, 2004, 2008 and 2012, accessed June 4, 2013.", "Email from Susan Cohen, director of government affairs for the Guttmacher Institute, through spokeswoman Rebecca Wind, June 5, 2013.", "PolitiFact Virginia, \"In Context: E.W. Jackson’s statement on the Democratic Party,\" May 30, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]