["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump’s decision to send National Guard troops to the U.S.-Mexico border has drawn a mixed response. Arizona Gov. Doug Ducey welcomed the move, while California Gov. Jerry Brown’s National Guard said it would \"review\" the request.", "Rep. Ruben Gallego, D-Ariz., had a specific complaint: He said it was a poor use of tax dollars.", "\"Using the National Guard to do border security is very expensive,\" Gallego tweeted April 3. \"For what it would cost the Guard to make just TWO arrests at the border, we could give a homeless veteran permanent housing for an entire year.\"", "Using the National Guard to do border security is very expensive. For what it would cost the Guard to make just TWO arrests at the border, we could give a homeless veteran permanent housing for an entire year.", "Gallego’s office said they had the numbers to back that up and pointed to several news articles.", "We went to government reports and filings for the data, and with a caveat about who actually makes arrests at the border, the statement checks out.", "In 2012, the U.S. Government Accountability Office examined the costs and benefits of deploying National Guard troops at the border. The auditing arm of Congress had two examples to study.", "Operation Jump Start ran from June 2006 to July 2008 under President George W. Bush. President Barack Obama initiated Operation Phalanx between July 2010 and September 2011. There were slight differences in the Guard’s activities. For example, Operation Jump Start involved aviation while Operation Phalanx did not. But by and large, they operated under the same rules.", "The guardsmen helped spot illegal border crossers, while Customs and Border Patrol officers made the actual arrests.", "So, to be clear, while Gallego referred to arrests, the National Guardsmen arrested no one.", "The Defense Department told the GAO that the combined cost of both operations for the National Guard was $1.35 billion. CBP officials reported that the National Guard assisted in the apprehension of 186,814 undocumented aliens under Jump Start, and the apprehension of 17,887 under Phalanx. (Technically, the National Guard operated under Title 32 of the U.S. code. The Defense Department provided assistance separately under Title 10 status. The spending figures reflect the distinction.)", "The cost per apprehension was $6,595.", "Trump’s memorandum called for the Secretary of Defense to request the use of the Guard under Title 32.", "In September 2017, the U.S. Department of Housing and Urban Development announced the latest round of funding to provide veterans with housing vouchers. It offered about $40 million to \"support approximately 5,500 units.\"", "That comes to nearly $7,300 per unit.", "The advocacy group National Coalition for Homeless Veterans uses a higher estimate.", "\"The cost of providing permanent supportive housing and case management for a homeless veteran tends to average around $10,000 per person per year,\" said coalition spokesman Randy Brown.", "Brown said the price tag would vary from place to place and cited a 2014 report from Central Florida Commission on Homelessness that said housing and support services for any chronically homeless person would cost $10,051 per year.", "The Trump administration has provided too few details on the proposed deployment to allow a precise cost estimate. But based on past experience, the cost of two apprehensions with National Guard assistance would be $13,190.", "That is about 30 percent more than the higher estimate to provide permanent housing used by the National Coalition for Homeless Veterans.", "If we use the government funding level of $7,300 for housing, the apprehension price tag rises to 80 percent more than housing a homeless veteran for a year.", "It’s possible that the Trump administration could reduce costs, although a few pieces would need to fall into place. As the Government Accountability Office noted, the National Guardsman were not allowed to arrest people, which increased the number of people needed to apprehend a border crosser. In theory, that could change.", "\"Under Title 32, the governors of those states can authorize troops to perform civil law enforcement, such as apprehending and arresting people,\" said Leigh M. Winstead with the Veterans and Servicemembers Legal Clinic at George Mason University.", "Some governors might take that step, but others might not. Winstead said precedent likely allows the president to overrule a governor who refuses, but there could be a legal challenge.", "In short, while we have credible financial information from the past, the cost of the proposed operation remains unknown.", "Gallego said that the cost of using the National Guard to arrest two people at the border would cover the expense of providing permanent housing to a homeless veteran for a year.", "Based on past experience, government reports back up Gallego’s comparison. Using data gathered by the Government Accounting Office, National Guard-assisted apprehensions cost $6,595 on average, or about $13,000 for two.", "According to a homeless vet advocacy group, the cost of providing a home to a veteran is about $10,000, although the government uses a lower figure of $7,300.", "It is unclear whether the proposed operation would allow the National Guard to make arrests, and whether that would significantly lower the cost per apprehension. However, that effect would need to be large to overcome the gap based on the historic figures.", "With the caveat about who makes the arrests, we rate this claim Mostly True.", "Ruben Gallego, tweet, April 3, 2018", "U.S. Government Accountability Office, Observations on Costs, Benefits, and Challenges of a Department of Defense Role in Helping to Secure the Southwest Land Border, April 17, 2012", "U.S. Department of Housing and Urban Development, Registration of Interest for HUD-VASH Vouchers, Sept. 1, 2017", "CNN, Trump's memo ordering National Guard troops to the border, April 4, 2018", "Congressional Research Service, Veterans and Homelessness, Nov. 6, 2015", "U.S. Department of Housing and Urban Development, Set-Aside Funding Availability for Project-Basing HUD-VASH Vouchers, July 1, 2016", "U.S. Department of Housing and Urban Development, HUD-VASH Vouchers, accessed April 5, 2018", "U.S. Department of Veterans Affairs, HUD, VA to Provide Permanent Housing, Case Management to Nearly 700 Homeless Veterans, June 13, 2011", "Central Florida Commission on Homelessness, The cost of long-term homelessness in Central Florida, 2014", "Interview, Randy Brown, director of communications, National Coalition for Homeless Veterans, April 5, 2018", "Interview, Leigh M. Winstead, managing attorney, Mason Veterans and Servicemembers Legal Clinic, Antonin Scalia Law School, George Mason University, April 5, 2018", "Email interview, Christina Carr, communications director, Office of Rep. Ruben Gallego, April 5, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]