["By Angelo Fichera", "Posted on October 31, 2019", "Social media posts distort the facts around an 11-year-old, dismissed DUI charge against Rep. Matt Gaetz. They also leave the false impression that he “stole from dying people.”", "Posts about Rep. Matt Gaetz circulating on social media in recent days bend the facts to argue that the Florida Republican is part of the so-called “swamp.”", "“Republican Matt Gaetz has had numerous DUIs and his dad got him off each time,” read the Facebook posts, accompanied by a mugshot of Gaetz. “He was part of a company that had to pay 75 million in hospice fraud. They stole from dying people. He is the swamp.”", "Like many claims that gain traction on social media, the posts have some factual basis but are muddied by misrepresentation, exaggeration and speculation. We’ll start with the first part.", "Court records and press reports show that Gaetz was arrested once, in 2008, on charges that he was driving while intoxicated — but the case was later dismissed, the Okaloosa County court docket shows. In other words, he was never convicted.", "The posts offer no evidence that Gaetz has “had numerous DUIs,” or that his father, Don, a Florida state senator from 2006 to 2016, “got him off each time.”", "Here’s what we know about the 2008 case: Gaetz, 26 at the time, was arrested in October 2008 while driving home from a nightclub — ironically, called the Swamp — on Florida’s Okaloosa Island, according to the Tampa Bay Times. In reviewing the matter in 2014, the newspaper wrote:", "Tampa Bay Times, Feb. 18, 2014: Near midnight, Okaloosa County Deputy Chris Anglin clocked Gaetz going 48 in a 35 mph zone. Anglin later reported that Gaetz fumbled for his license and registration, his eyes were watery and bloodshot, and he swayed and staggered when he got out of the car.", "Smelling alcohol, Anglin asked Gaetz if he had been drinking. Gaetz replied no. Minutes later, he admitted he had consumed two beers. Twice, Anglin conducted an eye test. Twice, Gaetz’s eyes didn’t follow the prompt.", "Gaetz, who had recently begun practicing law, declined any field sobriety tests. He was arrested and refused the breath test.", "Weeks after the arrest, Anglin, the officer who arrested Gaetz, reportedly resigned amid several alleged infractions, including that he used excessive force against another DUI suspect soon after Gaetz’s arrest.", "After Anglin quit, “the prosecutor asked to be taken off the case, because his stepson was friends with Gaetz. Then-Gov. Charlie Crist’s office assigned the case to Steve Meadows, the state attorney for the neighboring circuit,” according to the Tampa Bay Times.", "Gaetz’s defense attorney, Drew Pinkerton, filed a motion to dismiss the case that December. According to a report at the time from the Northwest Florida Daily News, the defense claimed that Gaetz had answered “no” to the officer’s question about whether he had too much to drink — not to whether he had anything to drink. Gaetz also claimed in an interview with that newspaper that he was not swerving and that the officer had said threatening things to him.", "The 2014 Tampa Bay Times report continued:", "Tampa Bay Times, Feb. 18, 2014: Less than a week later, Gaetz had his driver’s license reinstated. A field officer for the Department of Highway Safety and Motor Vehicles declared there was no evidence that Gaetz refused a breath test. Yet the refusal was clearly documented in Anglin’s affidavit and arrest report.", "It even was documented in Pinkerton’s Dec. 18 motion to dismiss charges against Gaetz.", "This three-page document, which Gaetz signed, states there was no evidence that he had been impaired. There was no mention of many of Anglin’s observations suggesting that Gaetz was impaired.", "It added a new detail: “A civilian witness drove by who knew (Gaetz) and observed no indication of impairment.”", "Yet the witness was not named, either in Pinkerton’s document or other case records at the Okaloosa County Clerk’s Office. Still, this anonymous testimony is all that contradicted Anglin’s conclusion that there was probable cause to arrest Gaetz on DUI.", "Meadows accepted Pinkerton’s motion and agreed to drop the case on Dec. 22, 2008.", "So, in short, we know that after the arresting officer quit amid internal allegations of improprieties and after the initial prosecutor transferred the case to avoid a conflict of interest, the new prosecutor dropped the case. There has been no evidence put forward to substantiate the claim that Gaetz’s “dad got him off.”", "And while we found numerous traffic violations, such as speeding tickets, against Gaetz in Okaloosa County, we did not find any other cases in which Gaetz was charged with a DUI to support the contention that he has had “numerous DUIs.”", "A spokesperson for Gaetz told FactCheck.org that it was “categorically false” to say the congressman had “multiple” DUI arrests, adding that Gaetz had “never been convicted of a DUI.”", "Gaetz has acknowledged the arrest in public before: In 2014, while chairing a criminal justice subcommittee in the Florida House of Representatives, he talked about his booking photo’s presence online.", "“If anyone Googles my name, the first image that will appear is my mugshot from my arrest,” he said. “And I’m of the view that that is part of who I am. I made bad decisions and [that] resulted in arrest and that is sort of something that we all live with.”", "Following the unsubstantiated claim of “numerous DUIs,” the social media posts continue: “He was part of a company that had to pay 75 million in hospice fraud. They stole from dying people.” As the post is structured, readers may interpret “he” to reference Gaetz. In reality, the claim relates to a company his father founded and later sold.", "In 2017, Chemed Corporation and “various wholly-owned subsidiaries, including Vitas Hospice Services LLC and Vitas Healthcare Corporation” agreed to pay $75 million to settle federal charges that the companies submitted false claims for hospice services to Medicare, according to the U.S. Department of Justice.", "Vitas — which the Justice Department identified as “the largest for-profit hospice chain” in the U.S. — was co-founded by Don Gaetz. Rep. Matt Gaetz’s spokesperson said the congressman was never employed by Vitas.", "Federal prosecutors claimed that “between 2002 and 2013 Vitas knowingly submitted or caused to be submitted false claims to Medicare for services to hospice patients who were not terminally ill.” (Although the posts say “they stole from dying people,” the company was accused of defrauding Medicare.)", "The lawsuit against the company was filed in 2013 — nine years after Don Gaetz sold the company to Chemed in 2004. It’s true that at least some of the instances were alleged to have occurred before that sale date (dating back to 2002), but it’s worth noting that Don Gaetz was not a party to the lawsuit. At the time of the lawsuit’s filing, he denied that the matters in the complaint related to his work with Vitas.", "The elder Gaetz told the Northwest Florida Daily News that he was active in management until 2000. “I told my partners I was interested in becoming superintendent of schools, and when I got elected I said I was stepping back,” he said. “I gave up all management responsibilities in 2000, though I continued as a shareholder and attended about four board meetings a year.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“2008 CT 003553 S – State of Florida vs. Gaetz, Matthew Louis.” Okaloosa County Court Records. Accessed 30 Oct 2019.", "Brooks, Robbyn. “DUI charge dropped against Matthew Gaetz.” Northwest Florida Daily News. 24 Dec 2008.", "“Chemed Corp. and Vitas Hospice Services Agree to Pay $75 Million to Resolve False Claims Act Allegations Relating to Billing for Ineligible Patients and Inflated Levels of Care.” Press release, U.S. Department of Justice. 30 Oct 2017.", "“Criminal Justice Subcommittee – February 12, 2014.” Florida House of Representatives. Accessed 30 Oct 2019.", "McLaughlin, Tom. “Justice Department sues hospice care service co-founded by Don Gaetz.” Northwest Florida Daily News. 9 May 2013.", "Van Sickler, Michael. “Lawmaker’s talk of mug shot raises questions about DUI arrest.” Tampa Bay Times. 18 Nov 2014.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]