["The news networks may be focusing on protests in Ferguson, Mo., the rise of the extremist group ISIS in Iraq and the spread of the Ebola virus in west Africa. But on television screens in the heartland, the fiscal future of Social Security is attracting significant notice, at least where campaign ads are concerned.", "We recently checked claims by a Democratic House candidate and a Republican-aligned advocacy group that told less than the full story about where members of Congress stand on the question of raising the retirement age for receiving Social Security.", "Now we’re looking at a claim in Iowa’s highly competitive open-seat Senate race, where the Democratic Senatorial Campaign Committee -- the party’s Senate-campaign arm -- has opened up a new front against Republican nominee Joni Ernst.", "The ad opens by spotlighting Ernst’s endorsement from (and grateful words for) former Alaska Gov. Sarah Palin, who has become an icon for some conservative Republicans but a polarizing figure for many Democrats.", "\"Joni Ernst would be another tea party vote in the Senate,\" the ad says in part. \"Ernst would privatize Social Security. ... Palin, Ernst: Too extreme for Iowa.\"", "We wondered: Is the ad correct that Ernst \"would privatize Social Security\"? We decided to take a closer look.", "A primer on privatization", "First, some background about Social Security privatization.", "Currently, Social Security benefits for today’s recipients are paid from the proceeds of payroll taxes paid by younger and middle-aged workers. But over the years, some conservatives have advocated turning Social Security into a system where workers invest at least a portion of their money to provide for retirement.", "The upside, supporters argue, is that retirement nest eggs could be much higher, given that historical rates of return from private investments are higher than those for Social Security.", "The downside is the possibility of market losses. Even though Social Security funds would likely be invested more conservatively than many private investments, doing so would still carry risk that the beneficiary could lose value or, in a worst-case scenario, see their savings wiped out entirely. Neither is possible under the current Social Security program.", "One of the most high-profile proposals along these lines came in 2005, when President George W. Bush floated a plan to allow workers under 55 to invest a portion of their Social Security taxes into \"personal retirement accounts.\" Even though Republicans controlled Congress at the time, the idea never gathered much steam, and it died without even being introduced as legislation.", "A few years after that, Rep. Paul Ryan, R-Wis. -- who would in 2012 become the running mate for GOP presidential nominee Mitt Romney -- offered a similar proposal, allowing workers under 55 to begin investing a portion of their Social Security taxes in a series of funds managed by the government. This idea also went nowhere in Congress.", "These two failures reinforced the longstanding conventional wisdom -- that changing the way Social Security operates is the \"third rail\" of politics (that is, touch it and you die). This opposition to change is particularly strong among older voters, who are both reliant on Social Security and who tend to vote at higher-than-average rates.", "For this reason, Social Security-themed attack ads have been prevalent over the years, often aired by Democrats, though sometimes by Republicans. Attacks against plans such as Bush’s and Ryan’s have often played up the term \"privatization\" as a scary concept -- so much so that supporters of this type of proposal have taken pains to distance their plans from that terminology.", "What Ernst said", "The visuals in the DSCC ad offer a footnote to support its claim about Ernst -- a primary debate aired on KCCI, the CBS affiliate in Des Moines. Here’s the full text of what Ernst said during that debate in response to a question about the future of Social Security:", "\"I do think we have to keep the promises that are made to today's seniors, absolutely. So to do this, we do have to reform Medicare, Medicaid and Social Security. And the way we do that with Social Security is by looking at transitioning our younger workers onto individual plans or individual savings accounts, whether that’s tied to the market, whether it’s based on interest rates -- however we want to do that, we can have that discussion. But the way we are protecting our seniors is by transitioning our younger workers. And we can do that, but we have to keep our promises to seniors.\"", "This passage makes clear that Ernst is open to the idea of a \"market\"-based Social Security overhaul. However, there’s reason to believe the ad goes too far in how it describes Ernst’s stance.", "Where the ad goes too far", "One stretch in the ad involves the words \"would\" and \"privatize.\" Ernst was vague about specifics, relying on phrases like, \"however we want to do that\" and \"we can have that discussion.\"", "The issues page on her campaign website is similarly vague. \"Joni believes strongly that Social Security and Medicare must be preserved and protected for our seniors of today and tomorrow. She opposes any efforts to change the promised benefits for today’s seniors. At the same time she supports reforms that will strengthen both Social Security and Medicare to ensure the long-term health of both programs for her daughters and grandchildren and their generations.\"", "Would she make private investments optional and valid for only a portion of the taxes paid into the system, as was the case under both the Bush and Ryan plans? Based on Ernst’s public comments, it’s impossible to know.", "Ernst’s decision to avoid the term \"privatization\" and keep under wraps whatever roadmap she favors may amount to a dodge, but it’s what she’s advocating, and the ad ignores that nuance.", "Meanwhile, the second problem is that Ernst specifically limited her proposed reforms to \"younger workers,\" emphasizing that \"we have to keep the promises that are made to today's seniors.\" The ad doesn’t note that limitation -- an omission that’s only exaggerated by the fact that the ad uses an image of a senior citizen, rather than a younger worker.", "Our ruling", "The DSCC said Ernst \"would privatize Social Security.\"", "In the KCCI debate, Ernst did say pretty clearly that she supports \"reform\" for Social Security in order to keep it fiscally sound over the long term. However, by using the word \"privatization,\" the ad overstates the degree of clarity in the policy changes Ernst says she supports, while also glossing over the fact that she limited her proposed changes to \"younger workers.\"", "The statement is partially accurate but leaves out important details, so we rate it Half True.", "Democratic Senatorial Campaign Committee, \"Team\" (ad), Aug. 18, 2014", "KCCI-TV (Des Moines, Iowa), Senate Republican primary debate, May 29, 2014", "Joni Ernst, issues page from campaign website, accessed Aug. 21, 2014", "PolitiFact, \"In Arkansas Senate race, Crossroads GPS accuses Mark Pryor of wanting to raise the retirement age,\" Aug. 20, 2014", "PolitiFact Florida, \"David Jolly 'supports privatizing Social Security,' Democrats say,\" Feb. 17, 2014", "PolitiFact, \"Barack Obama claims Republican leaders plan to privatize Social Security,\" Aug. 18, 2010", "PolitiFact, \"Joe Sestak says Pat Toomey 'still supports privatizing Social Security,'\" Oct. 20, 2010", "PolitiFact New Hampshire, \"Ann McLane Kuster accused Charlie Bass of wanting to privatize Social Security,\" Oct. 22, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]