["By D'Angelo Gore", "Posted on August 31, 2020", "Republican ads aimed at Facebook users in Montana make the unsubstantiated claim that Gov. Steve Bullock “steered 14.3 million Montana dollars to his brother’s company.”", "William Bullock sold his shares in Pioneer Technical Services four years before his brother became governor in 2013, the company’s CEO told us.", "Also, a spokesperson for Montana’s Department of Administration told FactCheck.org that the governor had “no involvement” in state contracts awarded to the Butte-based firm. The company’s CEO said it has consistently been selected for state work in Montana, dating back long before Steve Bullock became governor.  Those contracts with the state go back to 1992, he said, a year after the company was co-founded by William Bullock.", "Since Aug. 1, though, the National Republican Senatorial Committee has spent thousands of dollars running six-second ads on Facebook that give a different impression.", "“Bullock steered 14.3 million Montana dollars to his brother’s company. Shady Steve Bullock. Wrong for the U.S. Senate,” the ads say. Bullock, a Democrat, is running to unseat Republican incumbent Steve Daines in one of this year’s closest Senate races.", "According to ad tracking firm Advertising Analytics, the NRSC spent almost $500,000 to run a TV ad that made a similar claim about Bullock. That ad, which aired in Montana TV markets over 1,900 times from Aug. 14 to Aug. 22, said: “What’s behind that Steve Bullock smile? An ambitious governor who exploits Montana taxpayers. Like the $14 million in state contracts paid to his brother’s company.”", "The ads cite data from the state’s online checkbook portal for fiscal years 2013 to 2019.", "Pioneer Technical Services — an engineering and environmental services firm — has been paid more than $14 million by the state since 2013, according to data provided to us by the state. But the NRSC’s evidence that the contracts financially benefited William Bullock is thin, and disputed by the company.", "In late July, Brad Archibald, the CEO of Pioneer Technical Services, and Karl Englund, a lawyer for the firm, asked Montana TV stations to stop broadcasting other NRSC ads that referred to state money that went to the company.", "“To imply any sort of nepotism at play is not only offensive but downright false,” Archibald wrote in his July 24 letter to station managers. In a follow-up letter three days later, Englund said: “The contracts [Pioneer] has to perform work for Montana were awarded through the normal state competitive process because of Pioneer’s track record of excellent work and its sterling reputation.”", "Both Archibald and Englund said William Bullock resigned as CEO of Pioneer in 2004 and sold all of his shares in 2009.", "In response, the NRSC has pointed to a 2015 corporate filing in Alaska that indicated Bullock still owned 0.5% of the company. Archibald, however, told us that was a mistake.", "“Paperwork has been submitted to the State of Alaska to correct an error in previous filings with respect to William Bullock,” he said in an email. “He is not a shareholder or a vice-president of Pioneer Technical Services. I cannot tell you why he was incorrectly listed that way, but it appears to be an error that first occurred after he sold his shares in 2009 and has been perpetuated since.”", "In a phone interview, Archibald told us that Bullock is not an employee of the firm, which has been 100% employee-owned since 2009, but has remained a member of its board of directors and became the board’s chairman in 2017. He said that in 2018 the company began paying board members $1,500 per board meeting to cover time and expenses. Those meetings are held about four times a year, and that’s the only compensation Bullock receives, he said.", "Archibald also argued that Pioneer has consistently been selected for state work in Montana since 1992, a year after the company was founded. The company has done environmental cleanup work and engineering work on construction projects for the state, for example.", "The Department of Administration was able to provide us with data on state payments to Pioneer going back to fiscal year 2007. The data show the company was paid more than $29 million by the state from Aug. 4, 2006, through Aug. 13, 2020. More than $7 million of that was paid before Steve Bullock was sworn in on Jan. 7, 2013.", "He had no say in awarding state contracts the company received, officials told us.", "“The Governor has no involvement in the procurement or contracting process for the State of Montana,” Amber Conger, communications director for the Department of Administration, told us in an email. “That authority is granted by statute to the Department of Administration. There are no circumstances where the Governor has or would have any involvement.”", "Conger explained that state laws and rules require contracts of certain amounts to be competitively bid, and prohibit state departments from being partial or showing favoritism in granting awards or contracts.", "The NRSC argued that Steve Bullock technically has authority because Montana’s Constitution states that “the governor has full powers of supervision, approval, direction, and appointment” over state agencies, including those that contracted with Pioneer Technical Services. An NRSC press release about one of its TV ads also said that a post on the website of the Montana Department of Justice that says “the Governor makes all final decisions on all restoration plans and associated funding.”", "While the press secretary for the governor’s office, Erin Loranger, acknowledged that the governor does approve restoration plans, she told us that is done before state contracts are offered or awarded.", "“Governors in Montana are required to sign off on restoration plans developed through settlement monies to restore natural resources acting as the trustee under federal and state superfund laws. The governor’s formal approval of a restoration plan occurs well before any competitive bidding or state contract process begins,” she said in an email.", "Bullock campaign spokesman Sean Manning also pushed back on the NRSC’s allegation, noting that William Bullock had resigned and sold his shares in the company years before Steve Bullock became governor. “It is absolutely false that the Governor ‘steered’ contracts to this Montana business — all contracts are issued in compliance with state procurement laws,” Manning said.", "In short, the NRSC has provided no actual proof that Pioneer received state business because Steve and William Bullock are brothers, or that Steve Bullock directed over $14 million in state money to the company after he became governor.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]