["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This post is an unsubstantiated warning. There’s no proof that white vans with external locks are the vehicle of choice for sex traffickers.", "Nonprofit organizations working to combat human trafficking said they have not identified white vans with external locks as a trend among sex traffickers.", "Trafficking is not always physical or between strangers.", "Since late 2019, social media users have been sharing posts urging people to call 911 at the sight of a white van with external locks on its doors and hatches.", "\"If you see any vans like this call 911,\" says a Nov. 22 Facebook post, which shows an image of a white van with external locks on its side door and hatch. \"This is utilized for sex trafficking.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Human trafficking is a legitimate threat that affects millions of people. But while it’s possible that some human traffickers have used white vans to kidnap their victims, there’s generally no way to predict what type of vehicle a trafficker or other criminal would drive.", "More to the point, there’s no evidence that white vans with external locks are an especially common getaway ride for kidnappers. Like a pair of similar hoaxes we debunked related to zip ties and sex trafficking, this post seems alarmist.", "A screenshot of a viral Facebook post warning that white vans with external locks are used by sex traffickers.​", "When we searched news archives, we didn’t find a swarm of reports about human traffickers who used external locks to trap people inside their white vans and drive away.", "Instead, we found a number of reports — from fact-checkers as well as local and national news outlets — that debunked viral Facebook posts that were fooling people into believing most white vans belonged to sex traffickers.", "Some outlets, like Lead Stories, knocked down posts claiming white vans with external locks are the vehicle of choice for sex traffickers, noting that such locks are widely available for sale online and commonly used by workers who use expensive tools on the job.", "Others dealt with similar posts that warned about white vans more generally. These posts reportedly took off after Baltimore Mayor Jack Young issued a warning about white vans that he claimed, without evidence, were \"trying to snatch up young girls for human trafficking.\"", "Young said he got word of such incidents from Facebook rather than from the Baltimore Police Department, which later told reporters it had no reports of actual incidents that involved sex traffickers driving white vans with external locks.", "A number of white-van owners have reported being harassed since posts associating their vehicles with sex trafficking have cropped up, according to Business Insider.", "The FBI declined to comment when we asked if incidents involving white vans were frequent or if white vans with external locks presented any particular reason for concern.", "But Robert Lowery, vice president of the National Center for Missing and Exploited Children, told Yahoo News that \"of the 420,000 missing children last year, there were around 30 or 40 physical abductions that involved, for example, grabbing them in public.\"", "\"Although that’s too many and it does happen, these scenarios are rare,\" he said.", "In a statement to PolitiFact, the Polaris Project, a nonprofit organization that works to combat human trafficking, said it hasn’t identified white vans with external locks as a trend.", "Human trafficking often occurs between people that know each other, rather than complete strangers, and people being trafficked aren’t always physically restrained, locked away or held against their will, the group said.", "\"By far the most pervasive myth about human trafficking is that it always — or often — involves kidnapping or otherwise physically forcing someone into a situation,\" the Polaris Project said in its statement. \"In reality, most human traffickers use psychological means such as tricking, defrauding, manipulating or threatening victims.\"", "Shared Hope International, a nonprofit Christian organization with a similar mission, told us that \"trafficking victims are generally not kidnapped or taken away from their families abruptly.\"", "\"Many people don’t realize sex trafficking exists in their community, but it impacts people everywhere,\" the organization said. \"Those who are concerned about sex trafficking and want to prevent people from being exploited should start by educating themselves and getting the facts.\"", "It’s important to stay aware of your surroundings, and should you want to report or seek services related to a case of human trafficking, you can contact the National Human Trafficking Hotline at 1-888-373-7888 or email [email protected].", "But the Facebook post about white vans with external locks seems like an example of an alarmist and unsubstantiated warning. So we rate it False.", "Facebook post, Nov. 22, 2019", "WKYC, \"VERIFY: Are those viral posts about human traffickers using zip ties and vans to abduct women real?\" Jan. 8, 2020", "Toronto Sun, \"Rumour of men in white vans abducting women goes viral on Facebook,\" Dec. 25, 2019", "Snopes, \"Are White Vans Being Used in Coordinated Human Trafficking Abductions?\" Dec. 9, 2019", "Yahoo News, \"Terrifying rumors about white vans are circulating Facebook. What’s behind them?\" Dec. 6, 2019", "Newsweek, \"Facebook Cracking Down on Posts About White Vans Used for Trafficking Rumor,\" Dec. 5, 2019", "Business Insider, \"Unfounded rumors about suspicious white vans are going viral on Facebook and putting drivers' lives at risk,\" Dec. 5, 2019", "CNN, \"A Facebook rumor about white vans is spreading fear across America,\" Dec. 4, 2019", "WBALTV, \"Young warns of white vans abducting women, BPD confirms no reports,\" Dec. 3, 2019", "Lead Stories, \"Fake News: Do NOT Call 911 Just Because You Spot A Van With External Locks,\" Nov. 21, 2019", "Statement from the Polaris Project, Feb. 28, 2020", "Statement from Shared Hope International, Feb. 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]