["President Donald Trump accepted his party’s nomination in a speech filled with familiar falsehoods.", "By Brooks Jackson, Eugene Kiely, Lori Robertson, Robert Farley, Jessica McDonald, D'Angelo Gore, Rem Rieder and Saranac Hale Spencer", "Posted on August 28, 2020", "At the close of the Republican National Convention, the president distorted the facts on the economy, COVID-19, health care, the military, immigration, policing and foreign affairs:", "Not the “greatest” in history: The president repeated the empty boast that he made the U.S. economy the “strongest” and “greatest” in world history — before this year’s pandemic-induced collapse.", "Trump, Aug. 27: Within three short years, we built the strongest economy in the history of the world.", "Trump, Aug. 27: In a new term as president, we will again build the greatest economy in history.", "It’s true that the U.S. economy is still the largest in the world — but that was true under all recent presidents, and as far back as 1871 by some accounts. But “biggest” isn’t the same as “strongest” or “greatest.”", "By other measures, the U.S. economy has been better under other presidents before Trump.", "‘Record’ job gain?: Trump claimed a “record” gain in jobs recently — failing to mention the much larger, record loss that preceded it.", "Trump, Aug. 27: Over the past three months, we have gained over 9 million jobs and that’s a record in the history of our country.", "That’s true as far as it goes — the gain for the last three months is actually nearly 9.3 million.", "But to be truthful, Trump should have said those jobs were re-gained. They amount to less than half the nearly 22.2 million jobs lost — also a record — in February and March as a result of the pandemic.", "Furthermore, the job recovery has lately lost momentum. The number of recovered jobs was 4.8 million in June but less than 1.8 million in July. At July’s rate, it will be February of 2021 before employment gets back to the peak level reached last February.", "Taxes: Trump said Biden “has pledged a $4 trillion tax hike on almost all American families.” Biden’s plan does not call for any direct tax increases for anyone making less than $400,000. But independent tax analysts say Biden’s plan to raise corporate taxes will indirectly affect employees due to lower investment returns or lower wages over time.", "As a result, most Americans would see a reduction in after-tax income, but “[t]he change would be small for most of those middle- and lower-income households—on average, only a fraction of a percent of their after-tax income—and we estimate that 80 percent of the new tax revenue would come from the top 1 percent by income,” according to John Ricco, a senior tax analyst at the Penn Wharton Budget Model. That analysis was the basis for a claim by Eric Trump on the second night of the convention that under Biden’s tax plan, “82% of Americans will see their taxes go up significantly.”", "Biden’s tax plan includes provisions such as imposing a payroll tax on earnings over $400,000, restoring a top income tax rate of 39.6% for income above $400,000, and increasing the top corporate tax rate from 21% to 28%.", "Ricco said that “[v]ery few families would be sending larger checks to the IRS (or having more money withheld from their paychecks) under Biden’s proposal.”", "“If you’re looking only at individual income taxes and payroll taxes, we find that about 2 percent of all families would see their taxes go up directly under the Biden plan — almost all of them in the top 5 percent by income,” Ricco told us via email.", "But when you include Biden’s plan to increase corporate taxes, the Penn Wharton Budget Model analysis found that “the tax plan will affect 82 percent of families,” Ricco said. “But instead of seeing their taxes go up directly, those additional families are paying the corporate tax hikes in the form of lower investment returns or lower wages over time.”", "According to the Penn Wharton Budget Model — which estimates the Biden tax plan would raise between $3.1 trillion and $3.7 trillion over 10 years  — middle-income earners would see their after-tax income decline by 0.4%, or $180, on average.", "“To explain a bit more: because the corporate income tax is remitted by corporations and not people, economists have to make some assumptions about which people ultimately bear the burden of that tax,” Ricco said. “We assume that, in the long run, a quarter of the corporate income tax falls on workers in the form of lower wages. … So while those workers wouldn’t literally be remitting more in taxes, over time they would end up shouldering some of the burden of the tax increase.”", "Garrett Watson, a senior policy analyst at the Tax Foundation, told us via email, that “it’s more precise to say that Biden’s plan would lower the incomes of 82 percent of Americans as a result of the tax changes, but not that it would generate a larger direct tax bill for those Americans.”", "Trump claimed that his administration will “further reduce the cost of prescription drugs and health insurance premiums,” adding: “They’re coming way down.” But insurance premiums for those with employer-based plans — where nearly half of Americans get their coverage — have gone up, as they normally do.", "And while there’s not one standard measure of total prescription drug costs, the metric Trump has pointed to in the past as evidence of a decrease now shows a year-over-year increase.", "Premiums: The Kaiser Family Foundation’s latest annual Employer Health Benefits Survey found premiums for single coverage went up 4% from 2018 to 2019 and family coverage premiums rose 5%. That’s for employer-sponsored insurance, which covers 49% of the population.", "Insurance premiums usually do go up. Figure 1.10 in the KFF report show they’ve risen each year dating back to at least 1999.", "For those who buy their own coverage on what’s called the individual market — 6% of the U.S. population — the story in the past few years has been different. On the Affordable Care Act exchanges, where those who qualify can get tax credits to help cover the cost, premiums experienced “huge swings” due to “considerable turmoil” in 2018 and 2019, as an Urban Institute report put it.", "Those premiums on average have gone down in 2020 (by 3.5% for the lowest-cost “silver” level premium) and 2019 (by 0.4%), but that was after a double-digit increase for 2018 plans (up 29.7%), driven by the Trump administration’s elimination of cost-sharing subsidies on the marketplaces and insurer uncertainty over the ACA’s future. When insurers set marketplace premiums for 2019, the Urban Institute’s January report said, “it became clear that many of them had overreacted to the tumult and uncertainty” in pricing 2018 plans. So, those premiums, which do “vary considerably across states,” the report noted, have now dropped.", "Prescription drugs: Trump has been using the Bureau of Labor Statistics’ consumer price index for prescription drugs to claim drug prices decreased “last year.” But that talking point, as we’ve explained, is now outdated. The BLS metric — a measure of drug price inflation that aims to capture what consumers, along with their insurance companies or other payers, are paying for a basket of retail prescriptions — now shows a year-over-year increase for 10 months straight.", "The president also touted recent executive orders he signed concerning drug prices, saying they “will massively lower the cost of your prescription drugs.” But it’s uncertain what the impact of those orders will be, as we’ve written.", "The orders, which largely revive past administration proposals, require the Health and Human Services secretary to take various actions, such as moving through the federal rule-making process. Two of the orders pertain only to Medicare beneficiaries, one of which is still subject to negotiation with pharmaceutical companies and pertains to only a certain class of drugs.", "Preexisting conditions: Trump also proclaimed: “We will always and very strongly protect patients with preexisting conditions, and that is a pledge from the entire Republican Party.” It’s worth noting Trump in 2017 backed Republican plans that would have weakened the preexisting condition protections in the Affordable Care Act.", "Travel restrictions: In the space of two sentences, the president made five false or misleading claims about what he wrongly called his “travel ban” on flights from China and Europe.", "Trump, Aug. 27: When I took bold action to issue a travel ban on China, very early indeed, Joe Biden called it hysterical and xenophobic. And then I introduced the ban on Europe very early, again.", "The travel restrictions on flights from China that Trump put in place on Feb. 2 were not a “ban.” There were exceptions for U.S. citizens, permanent residents and the immediate family members of both. And he did not impose the restrictions on flights from China “very early indeed.” As we have reported, 36 countries imposed travel restrictions by Feb. 2.", "Similarly, the travel restrictions on flights from Europe were not a ban. According to the Department of Homeland Security, the travel policy applied only to “the entry of most foreign nationals who have been in certain European countries,” and also did not apply to U.S. citizens and permanent residents, and their immediate family members. (The emphasis is ours.)", "The travel restrictions on Europe also weren’t “very early.” In fact, a CDC study found that those restrictions were implemented too late to mitigate the introduction of the virus. They were implemented on March 13; by March 15, the CDC report says, “community transmission was widespread in New York City.”", "It is also a matter of dispute as to whether Biden described the travel restrictions on flights from China as “xenophobic.” At a campaign event, Biden did use the term “xenophobia” on the day the White House announced the travel restrictions, but he did not mention the travel restrictions in that speech. The Biden campaign says Biden’s “reference to xenophobia was about Trump’s long record of scapegoating others at a time when the virus was emerging from China,” and that he was not talking about the travel ban.", "About two months after the travel restrictions took effect, Biden’s campaign said its candidate supported Trump’s decision to impose travel restrictions on flights from China.", "Testing: As he has before, Trump bragged about America’s ability to test and diagnose coronavirus infections.", "“We developed, from scratch, the largest and most advanced testing system anywhere in the world,” he said. “America has tested more than every country in Europe put together, and more than every nation in the Western Hemisphere combined, think of that. We have conducted 40 million more tests than the next closest nation, which is India.”", "According to Worldometer, the U.S. has performed more than 79 million coronavirus tests as of Aug. 28, which is more than Europe’s collective total of 78 million (excluding Russia) as well as the rest of the Western hemisphere (35 million). China, however, purports to have done the most tests, with 90 million.", "Trump’s focus on total tests obscures the fact that the U.S. has tested far fewer people than other nations given the size of the American epidemic. On the number of tests performed per confirmed COVID-19 case — a better metric for understanding how well a country is doing in testing — the U.S. lags behind much of the world, per data from Oxford University’s Our World in Data.", "As of Aug. 25, or around that date, the U.S. has done only 13 tests per confirmed case, which is well below many countries that have received plaudits for their testing, such as New Zealand (530), Australia (233), Taiwan (177), South Korea (99) and Iceland (42). It’s also below the level of Denmark (137), Norway (73), Finland (61), Canada (41), Germany (45), the U.K. (39), Russia (37), Italy (19) and Spain (15), among others.", "On a per capita basis, the U.S. also doesn’t lead on testing, as Bahrain, Denmark, Iceland, Russia, Australia and Lithuania all have done more tests given the size of their populations than the U.S.", "Testing itself is also not enough to control an epidemic — it depends on how that information is used, including whether contact tracing efforts can prevent further spread of the disease, which has been hampered by testing delays.", "Treatments: The president proceeded to boast about progress on finding therapeutics for COVID-19, inaccurately claiming there are many treatment options that have been shown to be effective — and prematurely concluding that convalescent plasma would save many lives.", "“We developed a wide array of effective treatments, including a powerful antibody treatment known as convalescent plasma,” he said. “You saw that on Sunday night when we announced it, that will save thousands and thousands of lives.”", "In fact, there are no Food and Drug Administration-approved drugs to treat COVID-19, although physicians can provide supportive care and two drugs have shown benefits in randomized controlled trials in particular patients.", "An antiviral drug, remdesivir, was found to reduce the recovery time, compared with a placebo, in patients who required supplemental oxygen but were not ventilated. The steroid dexamethasone was shown in a U.K. trial to improve survival, but only in patients who were sick enough to need supplemental oxygen.", "Contrary to the president’s claim, convalescent plasma has not yet been shown to be beneficial in a randomized controlled trial, although observational studies suggest it may reduce mortality.", "As we have written, Trump made the same error during an Aug. 23 briefing announcing that the FDA was issuing an emergency use authorization for the treatment. Citing the results from a Mayo Clinic study, Trump incorrectly said that plasma had been “proven to reduce mortality by 35%” — even though those results did not come from a randomized controlled trial and did not compare plasma against a placebo.", "Mortality: Trump has long been preoccupied with the U.S.’s COVID-19 mortality statistics and how they compare with other nations. But as he has done in the past, he overstated how well the U.S. has done to prevent deaths from the coronavirus.", "“The United States has among the lowest case fatality rates of any major country anywhere in the world,” he said, referring to the proportion of people who die out of those who are known to be infected. “The European Union’s case fatality rate is nearly three times higher than ours. But you don’t hear that, they don’t write about that, they don’t want to write about that, they don’t want you to know those things.”", "“Altogether, the nations of Europe have experienced a 30% greater increase in excess mortality than the United States,” he continued. “Think of that.”", "Our World in Data shows that the European Union’s case fatality rate is 7.8%, which is about 2.5 times higher than the U.S.’s 3.1% rate. But that doesn’t mean the U.S. is leading the world.", "Although it’s not known how the president is defining a “major country,” the U.S. has the 11th highest case fatality rate out of the 20 countries currently most affected by COVID-19, and the 51st highest case fatality rate out of 169 countries, according to Johns Hopkins University.", "That’s better than many European countries, but worse than Austria, Greece, Norway, Australia, South Africa, Japan, India, Russia, South Korea and Israel.", "Notably, the U.S. fares much worse on deaths per capita, since the case fatality rate depends on testing and favors countries such as the U.S. that were hit later and have ongoing pandemics.", "Trump is also wrong that Europe has 30% more excess mortality than the U.S. He has said this before using other percentages — first it was 40%, then 33% — but even with the further lowered number, it’s still groundless.", "As we wrote, the latest figures for estimates of excess mortality may show that Europe has more excess deaths in total, but when accounting for population or how much mortality is elevated above normal, it’s the U.S. — not Europe — that does worse.", "In our analysis using data from the Human Mortality Database, we found U.S. mortality to be 13.3% higher than normal for the year, versus 10.1% for Europe.", "Experts also told us that comparing the U.S. to Europe on excess mortality was both premature and misguided, given that the virus arrived in America later, the U.S. has a younger, less dense population and the U.S. epidemic is still ongoing.", "University of Oxford economists Janine Aron and John Muellbauer said a better comparison would be to pit the Northeastern U.S. against the worst-affected European countries. In their analysis of that matchup, they found the U.S. to be “substantially worse” than Europe on all plausible measures of excess mortality.", "ISIS caliphate: Trump took too much credit for recapturing territory controlled by ISIS in Syria and Iraq when he said “we obliterated 100% of the ISIS caliphate.”", "As we have written before, the analytics and consultancy firm IHS Markit estimated that the ISIS caliphate in Iraq and Syria covered about 35,000 square miles near its height in January 2015. By the time Trump took office in January 2017, ISIS-controlled territory had shrunk to about 23,300 square miles.", "At the end of Trump’s first year in office, Brett McGurk, who at the time was the special presidential envoy for the global coalition to counter ISIS, said that about 98% of the land had been recaptured by coalition forces. “And significantly,” McGurk said, “50 percent of all the territory that ISIS has lost, they have lost in the last 11 months, since January.”", "So, the Trump administration was clearly not responsible for taking back all of the ISIS-controlled territory.", "Military spending and pay: As he has in the past, the president falsely claimed that his administration has “spent nearly $2.5 trillion on completely rebuilding our military, which was very badly depleted when I took office.”", "Trump’s $2.5 trillion figure roughly refers to the total amount of Defense Department budgets from 2017 to 2020 — which actually totaled $2.9 trillion in inflation-adjusted dollars. Procurement of new equipment made up 20.3% of those 2017-2020 defense budgets, or $590.7 billion. That’s 5.8% lower than the 2009-2012 budgets, which covered President Barack Obama’s first term in office.", "Trump also boasted, once again, about providing “three separate pay raises for our great warriors” in the military. But basic military pay raises are set by a statutory formula, which is “linked to the increase in private-sector wages, as measured by the Employment Cost Index,” as the Defense Department website says.", "Trump has asked Congress to provide the amounts set by that formula in three of his four budgets, according to the Congressional Research Service and the White House fiscal 2021 budget proposal. In his first budget, Trump proposed an increase of 2.1% — less than the 2.4% level set by the statutory formula for fiscal year 2018. Congress overrode Trump and provided the full military pay hike, according to CRS.", "NATO: The president got several things wrong when talking about defense spending by countries in the North Atlantic Treaty Organization.", "“Our NATO partners, as an example, were very far behind in their defense payments. But at my strong urging, they agreed to pay $130 billion more a year. The first time in over 20 years that they upped their payments,” he said. “And this $130 billion will ultimately go to $400 billion a year.”", "Trump has long mischaracterized what alliance members spend on their own defense spending as a “payment” to NATO; it’s not. Nor are the majority of NATO countries required to spend 2% of their gross domestic product on defense spending in the first place.", "In 2006, NATO members agreed to try to spend at least that percentage of their economic output on defense spending, and in 2014, they agreed again to aim to meet that standard by 2024. For most countries, it’s a “guideline” — not a mandate.", "It’s not true that Canada and European NATO allies agreed to increase their defense spending by $130 billion more a year. NATO Secretary General Jens Stoltenberg has said that’s an estimate of how much more those countries would collectively spend on defense from 2016 to 2020 — not per year. And those nations together are projected to spend $400 billion more on defense by the end of 2024 — not annually.", "It’s also not the case that defense spending by other NATO members hasn’t been “upped” in two decades. After years of decreases, combined defense spending by non-U.S. NATO members has increased every year since 2015 — two years before Trump assumed office.", "Biden on Osama bin Laden mission: Trump said that Biden “voted for the Iraq War” and “opposed the mission to take out Osama bin Laden.” Biden’s position on going to war with Iraq was complex and nuanced, though Biden did vote in favor of an authorization of military force, a vote he later said was a mistake. As for the mission to target bin Laden, Biden said he opposed the timing of the operation, and suggested that the raid should be delayed in order to take further steps to confirm bin Laden was at the compound in Pakistan.", "As chairman of the Senate Foreign Relations Committee, Biden voted in 2002 to authorize the use of military force against Iraq. As we wrote when Biden wrongly claimed in September 2019 that he opposed the Iraq war from “the moment” it began, Biden was a consistent critic of the way the Bush administration handled the war. Some of his comments proved to be quite prescient, including his warnings about the likely higher-than-expected cost and length of the war, and the complexity of “winning the peace” once Iraqi leader Saddam Hussein’s regime was toppled.", "In the days and weeks before and after the war started, Biden said that while the hope was that the use of force resolution could be used to leverage further inspections, he also acknowledged it was a vote for the possibility of war.", "We should note that while Trump has repeatedly claimed that he publicly opposed the Iraq War before the March 19, 2003, invasion, we could find no evidence that he ever did. In a 2002 radio interview with Howard Stern, Trump said “I guess so” when asked if he supported going to war.", "As for Trump’s Osama bin Laden claim, as we wrote when Vice President Mike Pence made the same claim, Biden said he suggested that the raid should be delayed, not scrapped altogether.", "Back in January, we looked into various — and sometimes conflicting — accounts that Biden has provided about his advice to Obama about whether to move forward with the raid to kill bin Laden.", "Several weeks after the raid, at a time when Obama was gearing up for a reelection campaign, the New York Times on May 26, 2011, reported that Biden said at a Democratic fundraiser in late May 2011 “that he and others had counseled Mr. Obama to be more careful and cautious about the raid” and that he told Obama to “wait another seven days for information.”", "At a House Democrats’ annual retreat in January 2012, Biden said that at the April 2011 national security team meeting, he told Obama “my suggestion is, don’t go. We have to do two more things to see if he’s there.”", "In May 2012, during an appearance on NBC’s “Meet the Press,” Biden added a new twist to his account, saying that after the team meeting, he privately told Obama, “’Follow your instincts, Mr. President. Your instincts have been close to unerring. Follow your instincts.’ I wanted him to take one more day to do one more test to see if he was there.” Three years later, in 2015, Biden said he privately told Obama, “that I thought he should go, but follow his own instincts.”", "We can’t confirm what Biden may have told Obama privately. But even the opinion he gave at the security team meeting — that Obama should wait (a version that was corroborated by others at the meeting) — is not the same as opposing the operation outright.", "Trump baselessly said that a Biden administration would mean “defund[ed] police departments all across America” and a country in which “no one” would be safe. But Biden has said that he opposes “defunding the police,” and Trump has presented no evidence to suggest life under Biden would be more dangerous.", "Trump, Aug. 27: The most dangerous aspect of the Biden platform is the attack on public safety. … When asked if he supports cutting police funding, Joe Biden replied, “Yes, absolutely.” … Make no mistake, if you give power to Joe Biden, the radical left will defund police departments all across America. They will pass federal legislation to reduce law enforcement nationwide. … No one will be safe in Biden’s America.", "Trump also said, “the Republican Party condemns the rioting, looting, arson and violence we have seen in Democrat-run cities like Kenosha, Minneapolis, Portland, Chicago, and New York,” and his campaign ads have suggested such mayhem would be prevalent should Biden make it to the White House. But it’s important to remember that the violence, often in the aftermath of police shootings of African Americans, is occurring on Donald Trump’s watch, not Joe Biden’s.", "As we have written, Trump and his campaign have repeatedly and falsely claimed that a Biden administration would eviscerate law enforcement, with Americans subjected to mayhem in the streets and unanswered", "Biden has said on a number of occasions that he is opposed to defunding the police, and a Biden spokesman told us the Democratic nominee supports more funding for police for some functions, such as initiatives to strengthen community relationships and for body-worn cameras.", "Biden wrote in an op-ed in USA Today on June 10, “While I do not believe federal dollars should go to police departments violating people’s rights or turning to violence as the first resort, I do not support defunding police. The better answer is to give police departments the resources they need to implement meaningful reforms, and to condition other federal dollars on completing those reforms.”", "It’s worth noting the federal government pays a small percentage of law enforcement expenses. According to a backgrounder by the Urban Institute, 86% of police funding in 2017 was from local governments, with additional money ponied up by state governments.", "The “Yes, absolutely” comment was also cited by Vice President Mike Pence in his address at the convention on Aug. 26. Here is the context for that remark.", "In a July 8 interview with progressive activist Ady Barkan about police reforms, Biden was asked about shifting some funding from police to social service agencies for tasks that could be better handled by the latter. “Yes, absolutely,” Biden responded. But as we said, he would support additional funding in some categories.", "In a segment of the interview that didn’t appear on YouTube, Biden said he supports reforms, but “that’s not the same as getting rid of or defunding all the police.”(The Washington Post Fact Checker obtained audio of the full conversation.)", "Both Biden and Trump have expressed support for the idea of social workers and mental health personnel joining forces with police in some cases, as we’ve explained.", "As we’ve written, there is no agreed upon definition for the term “defund the police.” Some critics of the police really do want to abolish police forces as we know them and replace them with other forms of community safety entities. Others advocate shifting some money and functions away from police departments to social service agencies. But in campaign ads and verbal attacks on Biden, Republicans generally use the term to mean devastating budget cuts for law enforcement, something Biden clearly opposes.", "Trump’s border wall. Trump falsely said that Biden is “even talking about taking the wall down” along the border between the United States and Mexico that the president has so vigorously championed.", "That is not the case. As we have written, both a Biden campaign position paper and a list of recommendations drafted by allies of Biden and his vanquished rival Sen. Bernie Sanders call for getting rid of the “national emergency” designation that allows the use of Defense Department funds for the fencing that the Trump administration is erecting. But neither document says anything about tearing down what has already been built.", "A wall on the Mexican border to keep out immigrants trying to illegally cross was a major campaign issue in 2016 for Trump and a frequent rallying cry since.", "Trump also gave a misleading statistic for how much of the wall has been built. “We have already built 300 miles of border wall,” he said. But as we have written, very few of those miles are new construction.", "According to an Aug. 7 story in the San Antonio Express-News, only five miles of new fencing have been constructed. The paper said 260 miles of replacement and secondary walls have been built. The border is about 2,000 miles. The paper said its story was based on data from U.S. Customs and Border Protection.", "Refugees: In blasting the Democrats’ approach to immigration, Trump said that Biden had “pledged to increase refugee admissions by 700%.”", "But that doesn’t account for the fact that Trump has slashed the number of refugees allowed into the country since he took office.", "The last refugee cap set by Obama was for fiscal year 2017 — it allowed for 110,000 refugees to enter the country. The following year, Trump cut the number by more than half, to 45,000. In fiscal year 2019 he cut it further, to 30,000, and, finally, in fiscal year 2020 he set the ceiling at 18,000.", "That’s the lowest number since the U.S. refugee admissions program began in 1980.", "So, it’s true that Biden’s platform calling for an initial cap of 125,000 is an increase — it’s actually about 600% higher than the current cap — but it’s only about 14% higher than the number set before Trump took office.", "Pledge of Allegiance: Trump repeated a misleading claim he first made on Twitter shortly after the Democratic National Convention. He told the crowd gathered at the White House, “During the Democrat Convention, the words ‘Under God’ were removed from the Pledge of Allegiance – not once, but twice.”", "Actually, the pledge was recited in full each night of the convention.", "The words “under God” were omitted at the start of daytime meetings for two caucuses, though. That appears to be the source of the claim.", "Interestingly, the president got it right on the first day of his party’s convention, when he said, “I can promise you a few things, number one, we will not be taking the word ‘God’ out of the Pledge of Allegiance, like they did a number of times at their caucuses.”", "But on Aug. 27, Trump reverted to the misleading version of the claim in a night heavy with cultural references.", "Abortion: Repeating a version of a claim made by several GOP convention speakers, Trump said: “Joe Biden claims he has empathy for the vulnerable, yet the party he leads supports the extreme late-term abortion of defenseless babies right up until the moment of birth.”", "As we’ve already written this week, many Democrats, including Biden, call for codifying into federal law the Supreme Court’s 1973 ruling in Roe v. Wade. That decision says that states cannot interfere with a woman’s right to an abortion before the end of the first trimester, but can regulate or prohibit abortions once a fetus becomes viable outside the womb.", "Most states ban abortion at a certain point in the pregnancy, with exceptions to protect the mother’s life. In 2016, the most recent data available, only 1.2% of abortions were done after 21 weeks.", "Condemning rioters: Trump misleadingly claimed that “Biden and his supporters” only began to condemn rioters after the Democratic convention “because their poll numbers are going down like a rock in water. It’s too late, Joe.” Although he did not mention it in his convention speech, Biden repeatedly condemned violent protests prior to the convention.", "Trump, Aug. 27: During their convention, Joe Biden and his supporters remained completely silent about the rioters and criminals spreading mayhem in Democrat-run cities. They never even mentioned it during their entire convention. Never once mentioned. Now they’re starting to mention it because their poll numbers are going down like a rock in water. It’s too late, Joe.", "Trump appeared to be referring to a video Biden posted on Twitter on Aug. 26 in which the Democratic presidential nominee responded to the Aug. 23 shooting of Jacob Blake by police in Kenosha, Wisconsin. The shooting sparked chaotic and at times violent protests. That all unfolded after Biden spoke at the Democratic convention.", "“You know, as I said after George Floyd’s murder, protesting brutality is a right and absolutely necessary,” Biden said. “But burning down communities is not protest, it’s needless violence, violence that endangers lives, violence that guts businesses and shutters businesses that serve the community. That’s wrong.”", "That was not the first time Biden has spoken out against rioters. After the police killing of George Floyd on May 25 and the ensuing protests in cities around the country — some of which turned violent or involved looting — Biden did condemn violent protests.", "“I say they have a right to be in fact angry and frustrated,” Biden said in an interview on CNN on May 29. “And more violence, hurting more people, isn’t going to answer the question.”", "Biden also released a statement, widely reported in the media, in which he said, “Protesting such brutality is right and necessary. It’s an utterly American response. But burning down communities and needless destruction is not. Violence that endangers lives is not. Violence that guts and shutters businesses that serve the community is not. The act of protesting should never be allowed to overshadow the reason we protest. It should not drive people away from the just cause that protest is meant to advance.”", "In remarks on racial economic equity on July 28, Biden reiterated that message.", "“I’ve said from the outset of the recent protests that there is no place for violence or the destruction of property,” Biden said. “Peaceful protesters should be protected — but arsonists and anarchists should be prosecuted — and local law enforcement can do that.”", "School choice: Trump wrongly claimed Biden “vowed to oppose school choice and close all charter schools, ripping away the ladder of opportunity for Black and Hispanic children.”", "As we have written, Biden opposes federal funding going to “for-profit charter schools,” but schools managed by for-profit companies make up only a fraction of charter schools — about 10%, according to a researcher for the National Alliance for Public Charter Schools.", "And while Biden opposes vouchers for private school tuition — the ultimate in school choice for some — he does not oppose students choosing between public schools, magnet schools and high-performing charter schools.", "According to a statement provided by a Biden campaign official to FactCheck.org in July, “VP Biden will do everything he can to help traditional public schools, which is what most students attend. As president, he will ban for-profit charter schools from receiving federal funds. He will also make sure that we stop funding charter schools that don’t provide results.” The campaign added that Biden “does not oppose districts letting parents choose to send their children to … high-performing public charters.”", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Robertson, Lori et. al. “FactChecking Trump’s Weekend Press Briefings.” FactCheck.org. 10 Aug 2020.", "Kiely, Eugene et. al. “FactChecking Trump’s ‘Fox News Sunday’ Interview.” FactCheck.org. 20 Jul 2020.", "Robertson, Lori and Kiely, Eugene. “Testing, By the Numbers.” FactCheck.org. 12 May 2020.", "“COVID-19 Coronavirus Pandemic.” Worldometer. Accessed 28 Aug 2020.", "McDonald, Jessica. “How Many COVID-19 Tests Are ‘Needed’ to Reopen?” FactCheck.org. 8 May 2020.", "“Coronavirus Pandemic Data Explorer.” Our World in Data. Accessed 28 Aug 2020.", "Ducharme, Jamie. “Patients Are Waiting Weeks for COVID-19 Test Results. Here’s Why That’s a Huge Problem.” Time. 22 July 2020.", "“COVID-19 Frequently Asked Questions.” U.S. Food & Drug Administration. Accessed 28 Aug 2020.", "“Remdesivir.” NIH COVID-19 Treatment Guidelines. Last updated 24 Jul 2020.", "“Corticosteroids.” NIH COVID-19 Treatment Guidelines. Last updated 27 Aug 2020.", "McDonald, Jessica. “Trump, Hahn Mischaracterize Data on COVID-19 Convalescent Plasma.” FactCheck.org. 26 Aug 2020.", "Kiely, Eugene et. al. “Trump’s Talking Points.” FactCheck.org. 24 Aug 2020.", "“Mortality Analyses.” Johns Hopkins University & Medicine Coronavirus Resource Center. Last updated 27 Aug 2020.", "McDonald, Jessica. “Trump Touts Misleading and Flawed Excess Mortality Statistic.” FactCheck.org. 24 Aug 2020.", "Aron, Janine, et. al. “A pandemic primer on excess mortality statistics and their comparability across countries.” Our World in Data. 29 June 2020.", "Aron, Janine and John Muellbauer. “Transatlantic excess mortality comparisons in the pandemic.” 25 Aug 2020.", "Trump, Donald (@realDonaldTrump). “The Democrats took the word GOD out of the Pledge of Allegiance at the Democrat National Convention. At first I thought they made a mistake, but it wasn’t. It was done on purpose. Remember Evangelical Christians, and ALL, this is where they are coming from-it’s done. Vote Nov 3!” Twitter. 22 Aug 2020.", "Fichera, Angelo. “Misleading Claim Swirls Over Pledge of Allegiance at DNC.” FactCheck.org. 26 Aug 2020.", "“Speech: Donald Trump Addresses the Republican National Convention in Charlotte – August 24, 2020.” Factbase Videos. YouTube. 24 Aug 2020.", "“2019 Employer Health Benefits Survey.” Kaiser Family Foundation. 25 Sep 2019.", "Holahan, John , et. al. “Marketplace Premiums and Insurer Participation: 2017 – 2020.” Urban Institute. Jan 2020.", "Robertson, Lori. “Bloomberg, Trump Spar on Preexisting Conditions.” FactCheck.org. 14 Jan 2020.", "Robertson, Lori. “Trump’s Executive Orders on Prescription Drugs.” FactCheck.org. 31 Jul 2020.", "Kiely, Eugene, et al. “Trump’s False Claims at NATO.” FactCheck.org. 12 Jul 2018.", "Gore, D’Angelo. “Trump Still Distorting NATO Spending.” FactCheck.org. 9 Jul 2018.", "NATO. “Funding NATO.” Nato.int. 5 May 2020, accessed 28 Aug 2020.", "NATO. “Defence Expenditure of NATO Countries (2013-2019).” 29 Nov 2019.", "Guttmacher Institute. “State Bans on Abortion Throughout Pregnancy, As of August 1, 2020.” Accessed 27 Aug 2020.", "Centers for Disease Control and Prevention. “Abortion Surveillance — United States, 2015.” 23 Nov 2018.", "Obama, Barack. Presidential Determination — Refugee Admissions for Fiscal Year 2017. 28 Sep 2016.", "Trump, Donald. Presidential Determination on Refugee Admissions for Fiscal Year 2020. 1 Nov 2019.", "“Refugee Admissions and Resettlement Policy.” Congressional Research Service. 18 Dec 2018.", "Biden-Sanders Unity Task Force Recommendations. Joebiden.com. Accessed 28 Aug 2020.", "Rieder, Rem. “Trump’s False, Recurring Claim About Biden’s Stance on Police.” FactCheck.org. 21 Jul 2020.", "Rieder, Rem. “Trump’s Deceptive Ad on Biden and Defunding the Police.“ FactCheck.org. 12 Jun 2020.", "“Police and Corrections Expenditures.” Urban Institute. accessed 26 Aug 2020.", "Biden, Joe. “We must urgently root out systemic racism, from policing to housing to opportunity.” USA Today. 11 Jun 2020.", "“Biden says federal aid to police should be based on meeting ‘basic standards of decency.'” cbsnews.com 9 Jun 2020.", "Jackson, Brooks et. al. “Republican Convention Night 3.” FactCheck.org. 26 Aug 2020.", "“Joe Biden’s Emotional Conversation with Activist Ady Barkan.” YouTube.com. 8 Jul 2020.", "“The Biden Plan for Strengthening America’s Commitment to Justice,” joebiden.com. accessed 27 Aug 2020.", "“Executive Order on Safe Policing for Safe Communities.” whitehouse.gov. 16 Jun 2020.", "Rieder, Rem et. al. “Trump Distorts Biden’s Immigration Plans.” FactCheck.org. 15 Jul 2020.", "“The Biden Plan for Securing Our Values as a Nation of Immigrants.” joebiden.com. accessed 28 Aug 2020.", "“Biden-Sanders Unity Task Force Recommendations.”  joebiden.com. accessed 28 Aug 2020", "Foster-Frau, Silvia. “Border wall: Hundreds of miles funded, 5 new miles built.” San Antonio Express-News. 7 Aug 2020.", "White House. “Press Briefing by Members of the President’s Coronavirus Task Force.” 31 Jan 2020.", "Farley, Robert. “Trump, Biden Spin China Travel Restrictions.” FactCheck.org. 6 Apr 2020.", "Department of Homeland Security. “Homeland Security Acting Secretary Chad F. Wolf’s Statement on Presidential Proclamation To Protect the Homeland from Travel-Related Coronavirus Spread.” Press release. 11 Mar 2020.", "Centers for Disease Control and Prevention. “Detection and Genetic Characterization of Community-Based SARS-CoV-2 Infections — New York City, March 2020.” 17 Jul 2020.", "Hunnicutt, Trevor. “Biden slams Trump for cutting health programs before coronavirus outbreak.” Reuters. 31 Jan 2020.", "Tapper, Jake. “Biden campaign says he backs Trump’s China travel ban.” CNN. 3 Apr 2020.", "“Islamic State Territory Down 60 Percent and Revenue Down 80 Percent on Caliphate’s Third Anniversary, IHS Markit Says.” Press release. IHS Markit. 29 Jun 2017.", "Department of State. “Update on D-ISIS Campaign.” Transcript. 21 Dec 2017.", "Robertson, Lori. “Trump’s False Military Equipment Claim.” FactCheck.org 2 Jul 2020.", "Department of Defense. “National Defense Budget Estimates for FY 2021.” Apr 2020.", "Department of Defense. “Annual Pay Adjustment.” Undated, accessed 28 Aug 2020.", "Kapp, Lawrence. “Defense Primer: Military Pay Raise.” Congressional Research Service. 6 Jan 2020.", "Department of Defense. “Defense Budget Overview.” 13 May 2020.", "World Bank. “GDP (current US$).” Data accessed 28 Aug 2020.", "Silver, Caleb. “The Top 20 Economies in the World.” Investopedia. 18 Mar 2020.", "Bureau of Labor Statistics. “Employment, Hours, and Earnings from the Current Employment Statistics survey (National); Total Nonfarm Employment, Seasonally Adjusted.” Data extracted 28 Aug 2020.", "U.S. Bureau of Economic Analysis. “Table 1.1.1. Percent Change From Preceding Period in Real Gross Domestic Product.” Interactive data extracted 28 Aug 2020.", "Bureau of Labor Statistics. “Labor Force Statistics from the Current Population Survey; Unemployment Rate, Seasonally Adjusted.” Data extracted 28 Aug 2020.", "Farley, Robert. “Trump Twists Biden’s Position on School Choice/Charter Schools.” FactCheck.org. 21 Jul 2020.", "National Alliance for Public Charter Schools. “CMO and EMO Public Charter Schools: A Growing Phenomenon in the Charter School Sector Public Charter Schools Dashboard Data from 2007-08, 2008-09, and 2009-10.”", "Manchester, Julia. “Biden: ISIS leader killed despite Trump’s ‘ineptitude’ as commander in chief.” The Hill. 28 Oct 2019.", "Farley, Robert. “Biden’s Position on Osama bin Laden Raid.” FactCheck.org. 08 Jan 2020.", "NBC News. Transcripts on May 6: Joe Biden, Kelly Ayotte, Diane Swonk, Tom Brokaw, Chuck Todd. 06 May 2012.", "CNN. Transcript: The Situation Room. 29 May 2020.", "Biden/Harris campaign website. “Remarks by Joe Biden on George Floyd and the Unfolding Situation in Minnesota.” 29 May 2020.", "Larsen, Emily. “Protesting is ‘necessary’ but ‘needless destruction is not’: Biden condemns violence around country.” Washington Examiner. 31 May 2020.", "Balluck, Kyle. “Biden: ‘We are a nation in pain, but we must not allow this pain to destroy us’.” The Hill. 31 May 2020.", "Biden/Harris campaign website. “Remarks from Joe Biden on Racial Economic Equity.” 28 Jul 2020.", "Farley, Robert. “Trump Distorts Biden’s Tax Plan.” FactCheck.org. 13 May 2020.", "Penn Wharton Budget Model. “The Updated Biden Tax Plan: Budgetary, Distributional, and Economic Effects.” 10 Mar 2020.", "Li, Huaqun, Watson, Garrett, and LaJoie, Taylor. “Details and Analysis of Former Vice President Biden’s Tax Proposals.” Tax Foundation. 29 Apr 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]