["About this rating", "During a Feb. 28, 2020, campaign rally in South Carolina, President Donald Trump likened the Democrats' criticism of his administration's response to the new coronavirus outbreak to their efforts to impeach him, saying \"this is their new hoax.\" During the speech he also seemed to downplay the severity of the outbreak, comparing it to the common flu.", "Despite creating some confusion with his remarks, Trump did not call the coronavirus itself a hoax.", "On the last Friday of February 2020, U.S. President Donald Trump held a campaign rally in South Carolina and made comments during a speech in which he accused Democrats of \"politicizing\" the coronavirus outbreak that left many with the impression that he had referred to the virus itself as a \"hoax.\"", "Various news media outlets and personalities reported that he did so, including syndicated columnist Dana Milbank, who tweeted:", "Likewise, Politico ran a story headlined \"Trump rallies his base to treat coronavirus as a ‘hoax.'\" And in an article headlined \"Trump calls coronavirus Democrats' 'new hoax,'\" NBC News correspondent Lauren Egan wrote: \"President Donald Trump accused Democrats of 'politicizing' the deadly coronavirus during a campaign rally here on Friday, claiming that the outbreak is 'their new hoax' as he continued to downplay the risk in the U.S.\"", "These prompted inquiries from Snopes readers who asked us to verify the accuracy of the claim.", "Trump held the rally on Feb. 28 on the eve of the South Carolina Democratic primary, which former Vice President Joe Biden ultimately won. During his roughly one-hour, 20-minute commentary, Trump hit back at his political opponents in the Democratic Party for their critiques of his administration's handling of a potential pandemic.", "Here are Trump's exact words on the topic at the South Carolina rally:", "Now the Democrats are politicizing the coronavirus. You know that, right? Coronavirus. They're politicizing it. We did one of the great jobs. You say, 'How's President Trump doing?' They go, 'Oh, not good, not good.' They have no clue. They don't have any clue. They can't even count their votes in Iowa, they can't even count. No they can't. They can't count their votes.", "One of my people came up to me and said, 'Mr. President, they tried to beat you on Russia, Russia, Russia. That didn't work out too well. They couldn't do it. They tried the impeachment hoax. That was on a perfect conversation. They tried anything, they tried it over and over, they've been doing it since you got in. It's all turning, they lost, it's all turning. Think of it. Think of it. And this is their new hoax. But you know, we did something that's been pretty amazing. We're 15 people [cases of coronavirus infection] in this massive country. And because of the fact that we went early, we went early, we could have had a lot more than that.", "In context, Trump did not say in the passage above that the virus itself was a hoax. He instead said that Democrats' criticism of his administration's response to it was a hoax. He muddied the waters a few minutes later, however, by comparing the number of coronavirus fatalities in the U.S. (none, at that point in time) to the number of fatalities during an average flu season, and accusing the press of being in \"hysteria mode\":", "So a number that nobody heard of that I heard of recently and I was shocked to hear it, 35,000 people on average die each year from the flu. Did anyone know that? 35,000. That's a lot of people. It could go to 100,000, it could be 27,000, they say usually a minimum of 27, it goes up to 100,000 people a year who die, and so far we have lost nobody to coronavirus in the United States. Nobody. And it doesn't mean we won't, and we are totally prepared, it doesn't mean we won't. But think of it. You hear 35 and 40,000 people, and we've lost nobody, and you wonder, the press is in hysteria mode.", "For his part, Trump later defended his comments by stating he was indeed calling out the Democrats' efforts to blame him and his administration for what they have characterized as an inadequate response \"because we’ve done such a good job.”", "Trump did however downplay the scale of the virus and the danger it posed to the public. At the time he made his remarks, the U.S. had 57 confirmed coronavirus cases, 40 of which came from the Diamond Princess cruise ship, which experienced an outbreak of the virus. And health officials were warning that the spread of the virus domestically was \"inevitable.\"", "The novel coronavirus infection has been a fast-moving crisis. Just hours after Trump's rally in South Carolina, the U.S. had its first coronavirus death. As of this writing (at the beginning of March 2020), six people in the U.S. have died from the COVID-19, the disease caused by coronavirus. Globally, more than 80,000 cases have been identified and 3,000 people have died, while experts have warned the outbreak of the virus could become a pandemic.", "Although Trump made a reference to seasonal flu death rates, COVID-19, which was first detected in the winter of 2019 in Wuhan, China, appears so far to be more lethal. And because the virus is new, no vaccine or treatment exists for it.", "Armus, Teo, et al. \"Live Updates: Washington State Announces 4 More Coronavirus Deaths, Bringing Virus Death Toll in U.S. to 6, Officials Say.\"\r\n  The Washington Post. 2 March 2020.", "Gregorian, Dareh. \"Democratic Candidates Hit Trump's Coronavirus 'Hoax' Claim.\"\r\n  NBC News. 29 February 2020.", "Sheikh, Knvul, et al. \"How Bad Will the Coronavirus Outbreak Get? Here Are 6 Key Factors.\"\r\n  The New York Times. 28 February 2020.", "Werner, Erica, et al. \"Spread of Coronavirus in U.S. Appears Inevitable, Health Officials Warn, as Trump Defends Response.\"\r\n  The Washington Post. 25 February 2020.", "Bekiempis, Victoria, et al. \"Trump Fends Off Criticism of 'Hoax' Remark After First U.S. Coronavirus Death.\"\r\n  The Guardian. 29 February 2020.", "Cook, Nancy and Choi, Matthew. \"Trump Rallies His Base to Treat Coronavirus as a 'Hoax.'\"\r\n   Politico. 28 February 2020.", "Egan, Lauren. \"Trump Calls Coronavirus Democrats' 'New Hoax.'\"\r\n   NBC News. 28 February 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]