["The post’s caption begins as a news alert and asks Facebook users to “share this and help us reunite them with their families.”", "Translated from Amharic, the post describes the bus crash in detail, claiming it happened this year (which is 2013, in terms of the Ethiopian calendar). “A lion city bus with registration number A 68377, which was carrying 58 people from Shiro Meda to Kasanchis, collided with another Code 3 private black vehicle today, January 8, 2013 under a bridge near Stephen Church.”", "The central image shows a bus being lifted onto a bridge by a crane, while one of two secondary images displays what appears to be an official identification card.", "The post was published from a private account on January 16, 2021, on the timeline of a group called “Sincere hearts”, which has nearly 600,000 members.", "It claimed that “27 people were killed and 15 others were seriously injured”, adding that identification cards belonging to the victims were found at the scene and were available for collection by contacting the author on instant messaging network Telegram, using a link in the post.", "Although the image is real and depicts an actual bus crash in Addis Ababa, the incident happened in 2019, with fewer fatalities than claimed.", "By running a reverse image search, AFP Fact Check found news reports describing the crash at the time.", "Deutsche Welle Amharic (DW) reported that two people were killed and 31 injured when a bus collided head-on with another vehicle on September 20, 2019. The accident was also reported here and shared on Facebook here.", "Although some of the information shared in the false Facebook post was correct, the date and death toll were changed.", "The first time this post emerged online was on January 15, 2021, and the claim was debunked by PesaCheck. The post was then deleted and republished the next day.", "There was no information found concerning the purported identification cards on the Facebook page’s corresponding Telegram channel, an account responsible for publishing sensational stories designed to lure new readers.", "AFP Fact Check has previously debunked similar scams that try to attract more followers on social media.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]