["In a spectacle that has confounded viewers, a video has been shared widely on social media which shows a tree that has supposedly grown through a car.", "France me raato-raat car me Tree AAGAYA ,ye sab kaise huwa kisi ko kuch nahi malum", "Posted by Jaykishan Borhade on Tuesday, 26 November 2019", "According to the above post, the video is from France, a tree supposedly grew through the vehicle overnight with the trunk piercing the roof of the car. The video is 1:45 minutes long, and shows passersby staring in amazement. The video has also gone viral with text which reads, “कार झाड़ में घुसी है या झाड़ कार में गुस्सा है” (Is it the tree piercing the car or the car piercing the tree- translation).", "The video has also been uploaded on YouTube with the claim that it is from Nantes, France.", "Alt News’s fact-check found this anomaly is indeed from France, but it is a work of art. With the use of relevant keywords, Alt News found a news report by a French website Ouest France, titled, ‘Nantes. With his tree in the middle of a car, Royal de Luxe is a sensation in Bellevue’ (translated from French). According to the report of November 19, 2019, it is the handiwork of the Royal de Luxe, a local theatre group known to install logic-defying street art. The installation has been placed on the outskirts of the city of Nantes in Western France.", "The same was posted by Royal de Luxe on its official Facebook page on November 18.", "En ce moment de la saison Mémé Rodéo range des voitures un peu n’importe où. Elle plante une graine sur le…", "Posted by Royal de Luxe on Monday, November 18, 2019", "In another instance, the local street theatre company had installed a giant fork piercing through the roof and windshield of a car.", "It may thus be noted that the video showing a tree growing through a car is a work of street art, installed in Nantes, France.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]