["Democratic gubernatorial nominee Terry McAuliffe says Ken Cuccinelli, his Republican rival, is no friend to public education.", "\"On education, he’d take money away from public schools to fund private schools,\" the McAuliffe campaign says in a TV ad that began airing Oct. 16.", "The claim -- according to Josh Schwerin, a McAuliffe spokesman -- centers on Cuccinelli’s plan to empower parents whose children attend what the state deems to be a failing school. Under the proposal, a majority of parents could vote to change the leadership of such a school, close it, transform it to a charter school, or put their children in their choice of public or private schools.", "Cuccinelli would have the state compensate parents for additional costs they incurred by changing their child’s school. He would establish a scholarship fund for children who switched public schools. And he would seek legislation allowing Virginia to provide the parents with tax credits to defray tuition at nonsectarian, private schools.", "Cuccinelli also wants to offer the tax credits to failing-school parents who want to send their children to religious academies. This would require voters to approve what he called a \"narrowly drafted\" amendment to the state constitution, which bans state aid for K-12 sectarian education.", "Cuccinelli has not put a pricetag on the tax break. Anna Nix, a spokeswoman for the campaign, said the total cost would vary based on how many parents opt for the tax credit choice and how much it costs to educate a child in those private venues.", "McAuliffe's ad says the plan would force localities to raise property taxes to compensate for lost state aid to public schools.", "Seeking a bottom line, we came up with our own estimate of the cost of the tax credit.", "Cuccinelli would define a failing school as one that was denied state accreditation because of chronically low student achievement. There are six such schools this year: three in Norfolk, two in Petersburg and one in Alexandria.", "According to state Department of Education figures, total enrollment at those schools was 3,335 last school year. Based on per-pupil allocations to each of the cities housing a failing school, the state spent $16.9 million educating those students.", "So the maximum cost of the tax credit -- assuming every student at every failing school would up being privately educated -- would be about $16.9 million this year. That’s about three-tenths of 1 percent of the nearly $5.2 billion in general funds the state will spend on public education.", "Nix said Cuccinelli \"will not touch education\" to pay for the tax credit. But Democrats have long argued that it’s impossible to cut income taxes without affecting the long-term money available to public schools. That’s because income taxes are the largest revenue source for the state’s general fund -- now at $17.4 billion -- which pays for education, health programs and public safety. About 30 percent of the general fund is traditionally allocated for public education.", "Our ruling", "McAuliffe says Cuccinelli would \"take away money from public schools to pay for private schools.\"", "Cuccinelli’s K-12 plan opens that possibility by proposing tax credits for the parents of children in failing public schools to defray their cost of switching to private education. The program, if passed by the General Assembly, would have enormous symbolic meaning because it would crack Virginia’s tradition of not directly aiding private schools.", "McAuliffe’s statement, however, lacks perspective. It doesn’t note that Cuccinelli’s program would be very small. This year, only six of Virginia’s 1,828 public schools are failing. They are attended by 3,335 of the state’s 1.27 million students.", "In the unlikely scenario that every failing-school parent switched their children to private schools, Cuccinelli’s tax credit would have cost about $16.9 million this year -- one-third of 1 percent of the state’s public education budget.", "Cuccinelli says he would not cut the K-12 budget to pay for his plan. But in the long run under other governors, the revenues available to fund public education would be reduced -- very marginally -- to support the private school tax break.", "So there’s a sliver of accuracy to McAuliffe’s statement, but it creates a misleading impression of Cuccinelli’s education platform. We rate the claim Mostly False.", "McAuliffe, \"Radical Plans\" ad on YouTube, Oct. 16, 2013.", "Emails from Josh Schwerin, spokesman for McAuliffe, Oct. 16 and 25, 2013.", "Patch, \"Cuccinelli Education Proposal Would Free Up Public Money for Private Schools,\" Aug. 18, 2013.", "Emails from Anna Nix, Cuccinelli spokeswoman, Oct. 20, 26 and 29, 2013.", "Phone call with Nix, Oct. 30, 2013.", "The Virginian-Pilot, \"Cuccinelli says he has answers for students in need,\" Aug. 13, 2013.", "Richmond Times-Dispatch, \"Bourne: McAuliffe’s schools plan is the better choice,\" Sept. 24, 2013.", "Cuccinelli.com, \"Ken Cuccinelli’s K-12 Education Plan: Putting Our Children First,\" Aug. 13, 2013.", "Email from Anna Nix, Cuccinelli spokeswoman, Oct. 20, 2013.", "The News and Advance, \"In Lynchburg, McAuliffe calls for reform of SOL tests,\" Sept. 4, 2013.", "Richmond Times-Dispatch, \"Cuccinelli won’t defend McDonnell’s school-takeover law,\" Sept. 4, 2013.", "Virginia Department of Education, \"New College- and Career-Ready SOLs Impact 2013-2014 School Accreditation Ratings,\" Sept. 20, 2013.", "Virginia Department of Education, \"School, School Division and State Report Cards,\" 2012-13.", "Virginia Department of Education, \"Superintendent's Annual Report,\" table 15, 2001-12.", "Virginia Senate Finance Committee, Education Budget Summary 2013-14, March 2013.", "Legislative Information System, 2012-14 budget bill, accessed Oct. 29, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]