["President Donald Trump isn’t going to London any time soon. Planning was under way for a February visit, when it was thought Trump would officially open the new U.S. embassy in London.", "Trump scuttled those plans in no uncertain terms.", "\"Reason I canceled my trip to London is that I am not a big fan of the Obama Administration having sold perhaps the best located and finest embassy in London for ‘peanuts,’ only to build a new one in an off location for 1.2 billion dollars,\" Trump tweeted Jan. 11. \"Bad deal. Wanted me to cut ribbon-NO!\"", "Reason I canceled my trip to London is that I am not a big fan of the Obama Administration having sold perhaps the best located and finest embassy in London for “peanuts,” only to build a new one in an off location for 1.2 billion dollars. Bad deal. Wanted me to cut ribbon-NO!", "Whether the new embassy is in a good or bad location is matter of opinion. But Trump was off the mark in putting this deal on the shoulders of the Obama administration. The wheels started turning early in the second term of President George W. Bush, and the deal on a new location was announced Oct. 2, 2008, before Bush left office.", "With an eye on thwarting terrorist attacks, the State Department’s Bureau of Overseas Buildings Operations under Bush aimed to harden America’s diplomatic facilities. The embassy in London dated from 1960 and in 2006, the bureau estimated that it would take $550 million and seven years to improve it, and even then it would not meet security needs.", "In October 2008, then-Ambassador Robert Tuttle, who led the search for a new site, announced the move to a site on the other side of the Thames River from the old location.", "\"We looked at all our options, including renovation of our current building on Grosvenor Square,\" Tuttle said. \"In the end, we realized that the goal of a modern, secure and environmentally sustainable embassy could best be met by constructing a new facility.\"", "The State Department announced that the United States had signed a preliminary contract for the new location, contingent on the sale of the existing chancery.", "The project had a budget of $1.02 billion. When the plan was announced, officials said the entire cost would be financed by the sale of three State Department properties in London -- the Navy Annex, the existing chancery, and the Marine Security Guard quarters.", "In 2015, the head of the State Department’s bureau, Lydia Muniz, told lawmakers the building was on time and on budget.", "Money from the sale of the old embassy (technically, the sale of the 999-year lease the United States held on the property) came in August 2013, during the Obama administration. The final terms were not public, but a BBC report estimated the value at somewhere between £300 million and £500 million, or about $400 million to $680 million. A Qatari real estate group bought the lease with plans to turn the property into a hotel.", "Trump said Obama sold the otherwise fine American embassy in London and relocated at a cost of $1.2 billion.", "Actually, the Bush administration put the plan in place after concluding that the existing embassy could not meet security requirements. The cost was about $200 million less than Trump said, $1.02 billion rather than $1.2 billion, and was financed through the sale of the old embassy and two other State Department properties in London.", "While he is correct that the sale occurred on Obama’s watch, the wheels were turning and preliminary contracts had been signed earlier.", "Trump’s tweet blows past those key details. We rate this claim Mostly False.", "Donald Trump, tweet, Jan. 11, 2018", "U.S. State Department, U.S. Takes First Steps Toward Embassy Relocation, Oct. 2, 2008", "U.S. State Department, The New London Embassy, Feb. 3, 2015", "U.S. State Department, Testimony of Lydia Muniz, Dec. 8, 2015", "U.S. Dep’t of State, Office of Inspector General, Audit of the Construction Contract Award and Security Evaluation of the New Embassy Compound London, July 2015", "University College London, The Reconstruction of Nine Elms, accessed Jan. 12, 2018", "Committee on Oversight and Government Reform, Over-budget overseas: The State Department’s failure to protect our diplomats, Dec. 6, 2016", "Guardian,  Donald Trump cancels London visit amid protest fears, Jan. 12, 2018", "BBC News, Trump UK visit: who really sold the US embassy?, Jan. 12, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]