["Highlighting the impact of gold mining, a researcher claimed that some villages in Zamfara had recorded lead poisoning among children", "The Nigerian government is now championing gold mining as it seeks to become less dependent on oil exports.", "Between 2010 and 2013, the mortality rate of children under the age of five rose sharply in the northern state of Zamfara, linked to lead poisoning from unregulated small-scale gold mining.", "Experts warn even low levels of lead poisoning, significantly lower than levels recorded in Zamfara, can have dire public health consequences.", "In June 2020 Nigeria’s president Muhammadu Buhari was presented with gold bars produced through the government’s small-scale gold mining development programme.", "The project is part of efforts to bring small- scale miners into the economy. The government estimates this could create more than 250,000 jobs and earn it more than US$500 million in revenue every year, while reducing illegal mining and smuggling.", "But in a national newspaper Tosin Abdulsalam, an environmental researcher based at Friedrich Schiller University in Germany, savaged the plan saying it posed serious health and environmental hazards.", "“Digging out such metals obviously will let out many other harmful metals that are hazardous to us humans, to animals, plants and the entire ecosystem,” he said, likening it to the harmful effects of oil spills in the country’s Niger Delta region.", "In the article titled Nigeria digging for gold with no lesson learnt, Abdulsalam cited a major lead poisoning incident in the northwestern state of Zamfara in 2010, which he linked to the mining of gold.", "“Reports as recent as 2017 reported 92% prevalence of blood lead poisoning in children from some villages in Zamfara state,” he said. Is this startling claim about such high poisoning levels in the state correct?", "Abdulsalam directed us to a 2013 study of 307 children below age six as the likely source of his claim. He said he may have mistaken this as being in 2017.", "The study focused on a village in the Kawaye area of Anka local council in Zamfara. It recruited the children through random sampling to reduce bias. The researchers, who included the Ahmadu Bello University and the national and state health ministries,  found a 92.5% prevalence of lead poisoning, the same proportion as Abdulsalam’s claim. (Note: Prevalence refers to the share of a population with an illness or condition at a specified time.)", "The study based its definition of childhood lead poisoning on US Centers for Disease Control and Prevention (CDC) guidelines, which give this as blood lead levels of 5 micrograms per deciliter or more.", "Some 34 of the children had elevated blood lead levels of up to 45 micrograms per deciliter.", "Other studies also show high child lead poisoning levels in the state. In 2010, a deadly lead poisoning outbreak was reported in some areas of Zamfara. The state holds many of the gold mining leases in Nigeria.", "In two of the most affected villages, 25% of children under age five had died in the past year. One of the first studies into the outbreak, done in mid-2010, found that as many as  eight in 10 of them had convulsions before death.", "At high blood lead levels, lead can cause convulsions, coma and deaths, noted the study, which was supported by the country’s health ministry and involved international organisations such as the WHO and Médecins Sans Frontières,", "The researchers tested 204 children below age 5 in the two villages. All had lead levels higher or equal to 10 micrograms per decilitre, with 97% of them having levels higher or equal to 45 micrograms per decilitre.", "An amount of more than five micrograms per deciliter in children is the reference level at which the CDC recommends starting public health action, according to 2018 guidelines.", "The study eventually identified 131 villages of interest in the state through a chain-referral approach. It visited 74, taking blood and soil samples from 70.", "The majority of the villages – 50 – had either childhood lead poisoning, lead contamination or both. The researchers said due to time constraints, they could not sample all villages of interest. They were also only able to survey five children in each village, which they said suggested they may have underestimated the extent.", "The researchers also found two-thirds of households surveyed processed gold ore inside their family compounds, with activities like breaking, drying, separating and washing ore associated with the deaths. The majority of gold mining activities in the state had started in the preceding year.", "The outbreak was eventually linked to unsafe gold mining by artisanal and small-scale miners.", "Another study done in 2010 in the state also linked gold ore processing to the lead poisoning outbreak.", "How gold mining can cause lead poisoning", "Gold is not found alone and usually occurs with a number of other minerals, such as lead, zinc and copper, Silas Dada, professor of geology at the Al-Hikmah University in Ilorin state, Nigeria, told Africa Check.", "Poisoning can happen at the mining site where rocks are dug up and then broken down to find gold particles. In the process other associated minerals, including lead, are discarded.", "“The lead contaminates the soil and can be absorbed by plants that humans eventually eat. But more serious lead exposure happens with the contamination of drinking water and the ground where children play.", "Children under five are most susceptible as they are more likely to inhale dust or ingest sand from a contaminated environment. High exposure to lead causes acute symptomatic poisoning.", "This is “characterised by colic, anaemia, and depression of the central nervous system that may result in coma, convulsions and death,” according to the World Health Organization, or WHO.", "Lead should be completely avoided because it is dangerous even at its lowest levels, especially for children and the elderly, Prof Francis Udoh, a specialist in biochemical pharmacology and toxicology at the University of Calabar in southern Nigeria, told Africa Check.", "“No matter how little, lead affects the body adversely. It becomes fatal at high levels,” Udoh said.", "In 2010, the WHO published a document on childhood lead poisoning. This listed major sources of exposure as petrol and industrial activities, such as mining and lead-based paints.", "“Blood lead levels that were considered previously to be safe are now understood to compromise health and injure multiple organs, even in the absence of overt symptoms,” the WHO said.", "Even at low levels of 10 micrograms per deciliter or less, the immune, reproductive and cardiovascular systems of people are compromised by lead poisoning. In June 2010, a guideline value of an intake of 1 microgram per deciliter for lead was withdrawn after experts from the WHO and the Food and Agriculture Organization of the United Nations found it inadequate to protect against diminished intelligence.", "Prof Udoh, the pharmacology and toxicology expert from the University of Calabar, agreed that based on this revised standard, the lead levels found in the blood of all the children tested during the 2010 study were harmful.", "Dada of Al-Hikmah University said that before the government's new gold rush, it needed to ensure miners strictly follow safety standards.", "Others have urged that because mining provides an important income, safe mining areas are identified and public health messages shared with communities .", "To highlight the dangers of gold mining, an environmental researcher claimed that some villages in the northwestern Nigerian state of Zamfara had recorded a lead poisoning prevalence of as high as 92% among children.", "Nigeria is looking to ramp up gold mining to diversify its economy from gold, but  Friedrich Schiller University environmental researcher Tosin Abdulsalam argued it had a poor environmental record when extracting minerals.", "Available studies done on the state show consistently high lead poisoning among children in the state, which were linked to unsafe mining.", "Experts say it is important that designated mining areas are identified and safety standards observed as communities are increasingly reliant on the precious metal.", "Additional reading:", "https://africacheck.org/reports/digging-up-the-numbers-on-informal-mining-in-nigeria/", "https://africacheck.org/reports/does-nigerias-kaduna-state-have-more-gold-than-south-africa/", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]