["About this rating", "Multiple reports of burns sustained from leaking glitter iPhone cases in 2016 prompted one manufacturer to recall nearly 275,000 of the cases in August 2017.", "The recall affected only one brand of phone cases, not all manufacturers of glitter cases.", "In January 2016, Karly Retter of Ware, England posted the following photograph to Facebook, saying that her daughter's leg was badly burned by the contents of her leaking cell phone case, which contained glitter suspended in a gel:", "Retter wrote in her post (now removed):", "Olivia is not supposed to have her phone in her bedroom at night, but she sneaked it in and had it in her bed, so she fell asleep with it touching her leg.", "She woke up in the middle of the night and came into my room and said her leg was hurting - I just thought she was being silly and sent her back to bed.", "Then in the morning I saw this awful burn on her leg — I was so shocked a phone case could do that. Doctors have said it is a severe chemical burn and she will be scarred for life. I can't believe it — she will have a scar in the shape of a phone on her leg.", "New Look, the company that distributed the phone case, said they would investigate the complaint(s) and have removed the product from their inventory. Claims of chemical burns from such phone cases is not unprecedented however: For example, in November 2015, New Zealand woman Erin Nelson reported that she, too, was burned by a mysterious liquid that leaked from her iPhone case, this one purchased from the store Forever New:", "Hi, last week I brought an iPhone 5 case of you guys, the one with the glitter that moves around anyway on Saturday...", "Posted by Erin Nelson on Sunday, November 15, 2015", "This phone case, said Nelson, was a \"Sophia\" model, which also contained glitter suspended in a gel.", "Claimants have been coming forward with similar stories for at least a year, and all of their injuries seem to be linked to phone cases containin glitter suspended in gel, but the cases carry no warnings that they contain potentially dangerous chemicals. We reached out to the phone cases' manufacturers for comment.", "On 2 August 2017, news outlets reported that manufacturer MixBin Electronics recalled approximately a quarter of a million phone cases with suspended glitter after 24 reports of leakage and burns were lodged:", "Nearly 275,000 iPhone cases that contain glitter suspended in liquid are being recalled after reports of leakage that caused burns and skin irritation.", "MixBin Electronics sold the cases designed for iPhone 6, 6s and 7 through Amazon, Henri Bendel, Nordstrom Rack, Tory Burch, Victoria's Secret and GetMixBin.com.", "The company announced the recall after 24 reports worldwide of skin irritation or chemical burns. Nineteen of the reports came from the United States, according to the US Consumer Product Safety Commission.", "Consumers in possession of a smartphone case with glitter suspended in liquid can visit a recall web site to learn if their item was among those recalled by MixBin Electronics.", "Park, Madison.   \"Liquid-Filled iPhone Cases Recalled After Reports of Chemical Burns.\"\r\n    CNN.   2 August 2017.", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]