["The graphic was shared here on Facebook on March 11, 2021.", "The Korean-language text superimposed to the image translates to English as: \"Austria, a 49-year-old female nurse died after receiving AZ vaccine. Halted vaccination and destroyed all vaccines.\"", "The claim was shared alongside an image that appears to show an AstraZeneca vaccine and a medical worker wearing a mask, with overlaid text reading: “Austria Suspends COVID shots. 49-Year-Old Nurse DEAD. 35-year-old Nurse Develops a pulmonary embolism.”", "The posts started to circulate after Austria on March 8 suspended distribution of one batch of the AstraZeneca’s vaccine following the death of a 49-year-old nurse.", "Identical misleading graphics have been shared on Facebook here, here and here alongside similar claims.", "However, the claim omits important context. Austria stopped using AstraZeneca's ABV 5300 batch, not all the company's Covid-19 vaccines; the country resumed the distribution of such batch on March 19, 2021, after the EMA's report to confirm that there was no evidence of a problem related to specific batches of the vaccine or to particular manufacturing sites.", "Specific batch halted", "Austria’s Federal Office for Safety in Health Care (BASG) announced on March 7, 2021, that it had received two reports in connection with a vaccination from the ABV 5300 batch of the AstraZeneca Covid-19 vaccine in the district of Zwettl.", "The BASG office said a 49-year-old woman died as a result of severe coagulation disorders and another 35-year-old woman who developed a pulmonary embolism was on the way to recovery.", "The announcement states that there is no evidence of a causal relationship with vaccination but the remaining stocks of “the affected vaccine batch” would not be distributed.", "“At present, all necessary investigations involving the respective experts are running at full speed in order to be able to completely exclude a possible connection. To be on the safe side, the remaining stocks of the affected vaccine batch will no longer be distributed and vaccinated,” said the office.", "Separately, the South Korean Embassy in Austria said on March 9, 2021, that the Austrian authorities decided to halt use of 6,000 AstraZeneca doses batch number ABV 5300, but was still distributing other batches of the company's vaccine inoculate people.", "The country resumed the distribution of such batch on March 19, 2021, after the EMA's report to confirm that there was no evidence of a problem related to specific batches of the vaccine or to particular manufacturing sites.", "“The Austrian Federal Office for Safety in Health Care [BASG] informs that the temporarily put on hold batch ABV 5300 of AstraZeneca's COVID 19 vaccine has been released again and can be vaccinated,” reads BASG’s statement.", "EMA review", "EMA released the conclusion of preliminary review on March 18, 2021, suggesting benefits of AstraZeneca Covid-19 vaccine still outweigh the risks despite possible link to rare blood clots with low blood platelets.", "EMA’s said “the benefits of the vaccine in combating the still widespread threat of Covid-19 continue to outweigh the risk of side effects” and “the vaccine is not associated with an increase in the overall risk of blood clots in those who receive it.”", "It also noted “there is no evidence of a problem related to specific batches of the vaccine or to particular manufacturing sites,” however, “the vaccine may be associated with very rare cases of blood clots associated with thrombocytopenia.”", "EMA earlier said in preliminary review on March 10, 2021, there was no indication that vaccination caused conditions that were reported in Austria, which are not listed as side effects with AstraZeneca vaccine.", "Keyword searches online found no credible reports about Austria destroying all Covid-19 vaccines.", "Medical staff photo unrelated", "An analysis of the photo of a female medical staff seen in the misleading Facebook post found it has nothing to with these two cases reported in Austria.", "A reverse image search of that medical staff photo on Yandex, a Russian online search engine, found the original picture published here in a photo-sharing website Depositphotos on May 15, 2020.", "The caption of the photo reads: “Doctor wear face mask in hospital protect from coronavirus disease or COVID-19. Medical staff are high risk people to receive infection from coronavirus disease or COVID-19.”", "Below is a screenshot comparison between the photo seen in the misleading Facebook post (L) and the image on Depositphotos (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]