["By Angelo Fichera", "Posted on July 2, 2020", "A viral video questions the safety of face masks by using a gas detector to purportedly show that masks result in dangerous oxygen levels for the wearer. But experts — and the company that makes the gas detector — say the video’s test is scientifically flawed.", "In a popular video swirling on Facebook, a local official in Pennsylvania casts doubt on the safety of face masks by arguing that a test he performs on camera shows that masks prevent people from breathing “the required oxygen level.”", "But the viral video’s test is scientifically flawed and its conclusions wrong, according to multiple experts.", "The video by Jeff Neff — a firefighter and president of the borough council in Sewickley, Pennsylvania — was uploaded June 27 and has racked up more than 11,000 shares and more than 260,000 views. It’s one of many recent dubious claims about face masks, which the Centers for Disease Control and Prevention recommends be used to help limit the spread of COVID-19.", "The CDC advises the general public to use cloth masks in public settings, especially when it is hard to maintain physical distancing. Experts, including those at the American Lung Association, have said masks do not cause low oxygen levels.", "Neff, who unsuccessfully ran in the Republican primary in the state’s 37th senatorial district in June, begins with some correct statements about normal oxygen levels in air and federal workplace safety rules. The air is comprised of 21% oxygen, according to NASA, and the Occupational Safety and Health Administration, or OSHA, defines an “oxygen deficient atmosphere” — and therefore dangerous to life or health — as one in which oxygen falls below 19.5% by volume.", "The central claims that follow, however, rest on an unsound test.", "In the video, Neff uses a device for detecting gas levels to suggest that four different face masks deprive wearers of appropriate oxygen level intakes because the detector readings drop below 19.5% for oxygen. He concludes: “No matter what you choose — head sock, neoprene type fancy mask, cheap mask, N95, the best available — none of them allow you to breathe in the required oxygen level, which should be close to 21%.”", "Experts we contacted disputed his methodology and findings.", "“He’s really misinformed and ill-qualified” to be conducting such a test, said Thomas Fuller, an associate professor of health sciences at Illinois State University and member of the American Industrial Hygiene Association, who reviewed the video for FactCheck.org.", "Fuller, a certified industrial hygienist, said the main issue with Neff’s test is that the meter, placed underneath the various masks, is picking up Neff’s own exhaled breath — which contains about 16% oxygen and includes other gases, such as carbon dioxide and nitrogen. “What he’s measuring is what he’s breathing out — it’s the gases that are taking up the concentration in that enclosed space,” Fuller said.", "Fuller said oxygen molecules are small enough to pass through such masks when the wearer inhales.", "MSA Safety, the manufacturer of the device used by Neff — an ALTAIR 5X Multigas Detector — also told us that there are issues with using the device for such a test.", "“Although the ALTAIR 5X detects the ambient levels of oxygen, carbon monoxide and other gases, it is not designed for the use shown,” Samantha D’Uva, a spokeswoman for the company, said in an email. “It is a portable gas detector designed for applications where there is a need to detect potentially hazardous or combustible atmospheres in factories, rooms, work areas, and confined spaces much larger than the area inside a face covering.”", "D’Uva continued: “When used to sample the air behind a face mask, the wearer’s exhaled breath would displace oxygen and subsequently put the ALTAIR 5X into oxygen alarm. The same thing would happen if you simply exhaled into the sample line. Due to the response and recovery time of the oxygen sensor, combined with the small space inside of the mask, the readings would not have time to reset before the next exhalation, resulting in a continuous alarm.”", "Kirsten Koehler, an associate professor of environmental health and engineering at Johns Hopkins Bloomberg School of Public Health, offered similar observations based on her viewing of the video.", "“Exhaled breath is only about 16% oxygen,” she said in an email. “When you exhale in the mask, some small volume of air will be left in the mask (in the small space between the mask and your face) with this lower concentration at the end of an exhalation. As you inhale, that air is rapidly replaced with fresh air from the room filling your lungs (a much larger volume) with air at normal oxygen conditions.”", "“The sensor is trying to respond to these rapidly changing conditions,” Koehler added. “However, sensors cannot respond instantaneously to changes in concentration. It might take them, say 10 seconds to respond to a change in concentration, but your breathing rate is faster than that. So likely what is happening is that the sensor ends up with an intermediate value of 17-18%-ish that you typically see on his meter. You can also tell that the sensors don’t immediately respond to the change in concentration because they keep alarming after he takes the tube out of the mask.”", "Koehler said such sensors can also have “sharp responses to rapid changes” in temperature and humidity — which could also affect the readings.", "In a phone interview, Neff said he stood by his experiment and that he is planning to post another video that shows the detector doesn’t clear even when he holds his breath while wearing a mask.", "“I’ve had multiple people contact me — from doctors to gas detector companies all contact me and say, I believe what your results are,” Neff said.", "Neff said he had nothing to gain by doing the video and that he did it to test what another online video had claimed. (Similar claims involving gas detectors have been pushed in other viral videos, including one debunked by the fact-checking website Lead Stories.)", "Fuller said it’s true that “people will notice they have to use more force to breathe in and out when they put [masks] on” and said people with asthma or other conditions could struggle with wearing masks. (The CDC makes note of this, too).", "“It’s the resistance of pulling [the air] through the fiber that makes it harder,” Fuller said. “The air you’re pulling in has the same amount of oxygen.”", "N95 respirators — tight-fitting masks that create a seal on the face and include a specialized filter that captures at least 95% of the airborne particles that pass through it — in particular can make it harder to breathe. The Food and Drug Administration notes that “people with chronic respiratory, cardiac, or other medical conditions that make breathing difficult should check with their health care provider before using an N95 respirator because the N95 respirator can make it more difficult for the wearer to breathe.”", "That said, federal health officials do not recommend N95s be worn by the general public; they advise the respirators be reserved for health care professionals and first responders.", "A spokesperson for the U.S. Department of Labor, of which OSHA is a part, said OSHA hasn’t made any determination on face masks and oxygen levels and declined to comment on the video.", "OSHA’s website says the agency “generally recommends that employers encourage workers to wear face coverings at work. Face coverings are intended to prevent wearers who have Coronavirus Disease 2019 (COVID-19) without knowing it (i.e., those who are asymptomatic or pre-symptomatic) from spreading potentially infectious respiratory droplets to others. This is known as source control.”", "The agency advises employers to consider health and safety factors of masks for employees in cases such as performing laborious tasks, working with chemicals and wearing masks for long periods, the spokesperson said — also noting that cloth masks are not considered a replacement for personal protective equipment.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Centers for Disease Control and Prevention. “Considerations for Wearing Cloth Face Coverings.” 28 Jun 2020.", "Centers for Disease Control and Prevention. “Proper N95 Respirator Use for Respiratory Protection Preparedness.” 16 Mar 2020.", "Cohen, Howard. Professor emeritus of occupational safety and health management, University of New Haven. Email to FactCheck.org. 1 Jul 2020.", "D’Uva, Samantha. Global Manager of product public relations and influencer engagement, MSA Safety. Email to FactCheck.org. 2 Jul 2020.", "Food and Drug Administration. “N95 Respirators, Surgical Masks, and Face Masks.” 7 Jun 2020.", "Fuller, Thomas. Associate professor of health sciences, Illinois State University. Phone interview with FactCheck.org. 1 Jul 2020.", "Hill, David G. “From the Frontlines: The Truth About Masks and COVID-19.” American Lung Association. 18 Jun 2020.", "Holohan, Meghan. “Can masks lower oxygen levels? Experts discuss popular myths about masks?” TODAY. 26 Jun 2020.", "Koehler, Kirsten. Associate professor of environmental health and engineering, Johns Hopkins Bloomberg School of Public Health. Email to FactCheck.org. 1 Jul 2020.", "Neff, Jeff. Borough council president, Sewickley, Pennsylvania. Phone interview with FactCheck.org. 2 Jul 2020.", "Occupational Safety and Health Administration. “1910.134 – Respiratory Protection.” Accessed 2 Jul 2020.", "Occupational Safety and Health Administration. “COVID-19 Frequently Asked Questions.” Accessed 2 Jul 2020.", "“Pennsylvania Elections – Office Results | Statewide.” Pennsylvania Department of State. Accessed 1 Jul 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]