["“पीएम मोदी मिलने पहुंचे माँ से तो देखिये क्या हुआ वहां (See what happened when PM Modi went to visit his mom),” read the caption of a video posted by Facebook page MODI VS RAHUL. The video was shared on the afternoon of May 23 and within barely five hours, it garnered over one lakh views and 1,700 shares. In the video, PM Modi can be seen spending leisure time with his mother. Social media users claimed that the video was shot after BJP’s massive victory in the 2019 Lok Sabha elections.", "At the time of writing this article, the video was viewed by more than 119,000 people from the page सब जन की खबर . The video bears the logo of ShareChat, thus, hinting that it was earlier circulated on the social networking application.", "Alt News found that the video was not recently shot, but is from 2014. When we searched for the video using the keywords “PM modi with his mother”, we were unable to locate any recent clips. Upon scrolling a little further, we found that the same video was uploaded by ABP News in 2014.", "According to the report, PM Modi visited his mother before going to Delhi after he had become the Prime Minister for the first time in the 2014 general elections. PM Modi’s clothes match the one in the video currently viral.", "We also found that the original video was flipped and circulated online. In the viral clip, PM Modi can be seen sitting on his mother’s right. However, in the 2014 ABP News footage, the Prime Minister is seated on his mother’s left. The distinction is depicted in the photo montage posted below.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]