["This post has been shared more than 4,000 times since it was published to a Facebook page with more than 200,000 followers on September 26, 2019.", "The post carries a photo that purports to show Pakistani Prime Minister Imran Khan sitting between US President Donald Trump and his Turkish counterpart Recep Tayyip Erdogan, while Turkish Foreign Minister Mevlut Cavusoglu can be seen standing behind Erdogan.", "The caption of the post states: “Picture of the year. Proud moment for every Pakistani.", "“Indian may use Burnol for this pic”.", "Burnol is a burns cream.", "Below is a screenshot of the misleading Facebook post:", "The same photo has been shared here and here on Facebook and here, here and here on Twitter alongside a similar claim.", "Some Facebook users who commented on the misleading post appeared to acknowledge that the photo had been doctored to include Khan, but others appeared to believe that the image was genuine.", "Below is a screenshot of some of the comments from Facebook users who appeared to believe the misleading post:", "The claim is false; the photo has been doctored to add Khan to the space between Trump and Erdogan.", "A reverse image search on Google led to a very similar photo published here on the website for Getty Images, a photo news agency, with credit to Turkish news agency Anadolu Agency.", "The caption of the photo says: “G20 Leaders' Summit in Hamburg.\"", "“President of Turkey Recep Tayyip Erdogan (R) talks with US President Donald Trump (L), accompanied by Foreign Affairs Minister of Turkey Mevlut Cavusoglu (2nd R), during the first working session named; 'Global Growth and Trade' of G20 Leaders' Summit held in Hamburg, Germany on July 07, 2017. Germany is hosting leaders from the worlds 20 largest economies at the Hamburg summit on July 7-8, set to focus on the global economy, trade, climate change, and the fight against international terrorism. (Photo by Kayhan Ozer/Anadolu Agency/Getty Images)”.", "The photograph shows an empty chair in the position where Khan is seen in the photo in the misleading post.", "Below is a side-by-side comparison of the doctored photo (L) and the photo taken by Anadolu Agency (R):", "Pakistan is not a G20 member country, nor was Imran Khan included in this “family photo” taken by AFP at the 2017 edition of the summit.", "The caption of the image reads: “GERMANY-G20-SUMMIT-FAMILY-PHOTO", "“Participants of the G20 summit in Hamburg, northern Germany, pose for a family photo on July 7, 2017. Leaders of the world's top economies will gather from July 7 to 8, 2017 in Germany for likely the stormiest G20 summit in years, with disagreements ranging from wars to climate change and global trade. (Photo credit should read LUDOVIC MARIN/AFP/Getty Images)”.", "Below is a screenshot of the AFP photo:", "The doctored photo was also debunked by Indian newspaper The Times of India in a report published here on September 30, 2019.", "The original image taken by Anadolu Agency has been previously manipulated to add a photo of Russian President Vladimir Putin into the empty chair, as debunked here by Business Insider in 2017.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]