["The video has been viewed over 31,000 times since it was published on Facebook here on June 10, 2020.", "The post’s caption reads: “#Flash: Indian Air Force Plane Crashed Near Karachi Inside Indian Territory. Confirmation Awaited!”", "The video was published as reports of Indian fighter jets flying over Karachi spread widely online, as reported by Pakistani media here and here. Asia News International, a leading Indian news agency, reported on the speculation here and cited anonymous Indian Air Force sources who denied involvement.", "The footage of the crashing fighter plane was also shared alongside similar claims on Facebook here, here and here.", "However, the claim is false.", "In the last three seconds of the video, onlookers using Italian expletives can be heard.", "Subsequent keyword Google searches found that the footage in fact shows a Italian Air Force Eurofighter plane crashing off the Italian coast in 2017.", "The same footage was published on YouTube here on April 28, 2020. The video’s caption reads: “EuroFighter Crashes Into Sea 2017 Italy”.", "The clip shared in the misleading Facebook post can be seen from 4:57 to 5:19 in the YouTube video.", "Further searches found that the fatal crash occurred during an Italian Air Force airshow on September 24, 2017.", "Several other videos from the airshow showing the same crash from different angles were also published online, for example here and here.", "On September 25, 2017, the Italian Air Force confirmed it was investigating the cause of the crash and offered condolences to the pilot’s family in Twitter statements here and here.", "The fatal accident was also widely reported on in international media; for example the Indian television channel NDTV here and the UK newspaper The Telegraph here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]