["About this rating", "Fire officials are blaming a house fire in a home on an unexpected culprit: a crystal ball.", "On March 8, 2021, around 4 p.m. in Delton, Wisconsin, the owner came home to find heavy smoke billowing through the house and called 911. First responders quickly put out the fire, which they said was restricted to the home’s living room.", "A statement from the Delton Fire Department said the source of the fire was a crystal ball in the living room, and the estimated cost of the damage to the house was $250,000. It is not known if the homeowners had insurance. Neither of the occupants of the home, nor the responders, were injured in the blaze.", "Fire officials posted details of what occurred on their official Facebook page. According to the department:", "An investigation determined the fire started on a couch in the living room and the cause of the fire was determined to be from a glass \"crystal ball\" ornament. The crystal ball had been located on a table near the couch and in direct sunlight. When sunshine came through a large set of windows and through the glass ball, it ignited the couch.", "Homeowners should keep items such as crystals, mirrors, glass ornaments, and even bottles away from direct sunlight and particularly away from anything flammable. These items can act just like a magnifying glass and focus sunlight so that the energy, which would normally be spread out over a wide area, is delivered to a much smaller point.", "The full statement:", "The statement also included pictures of what appeared to be a largely intact crystal ball surrounded by the wreckage of a burned living room.", "Given that the source of the fire was confirmed by the fire department in an official statement, along with a warning of how to protect against similar fires from occurring, we rate this claim as “True.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]