["The attack on the veterinarian in Hyderabad is the latest rape-murder case to attract nationwide attention and prompt widespread anger across India. AFP reported on the killing here.", "The 30-second video purporting to show the victim's funeral was published here on December 2, 2019, on Facebook.", "The English-language caption names the rape victim. In accordance with an Indian Supreme Court ruling barring the naming of rape victims, AFP has redacted the woman's name.", "The caption says: “Last ritual of [victim’s name]... Plz forgive us sister…”", "The same video has been viewed more than a million times alongside similar claims in posts on Facebook, Twitter, and YouTube.", "Below is a screenshot of the misleading Facebook post, with the victim's name redacted:", "The claim is false; the footage actually shows the funeral of an India soldier that was held one day before the attack in Hyderabad in a different part of India.", "A Google reverse image search using video keyframes extracted with InVID, a digital verification tool, found a similar video published on YouTube here on November 26, a day before the killing in Hyderabad.", "The Hindi-language title of the video translates into English as: ‘Funeral of martyr Peera Ram.", "Below is a screenshot comparison of multiple frames in the misleading Facebook post (L) and YouTube video (R):", "A Google search with the keywords “martyr Peera Ram” led to multiple news reports on the soldier, who died in an accident while serving in Kashmir on November 24, for example here and here.", "The Indian Army posted a condolence message on its official Twitter account here on November 25, 2019.", "General Bipin Rawat #COAS and all ranks salute the supreme sacrifice of Naik Peera Ram and offer deepest condolences to the family. https://t.co/bpryHSe6o6", "Local media also reported here and here that Ram’s funeral took place on November 26.", "The ceremony was held in his native village of Barmer in Rajasthan, a state in west India that is approximately 1,600 kilometers north of Hyderabad.", "Below is a screenshot of the burning pyre from the media report:", "The Facebook page ‘Rajasthan Rise’ also streamed a live video here of the November 26, 2019, funeral.", "The funeral for the 27-year-old Hyderabad victim took place on November 28, according to ETV news. The television network published a video from the funeral on YouTube here.", "The video's caption reads: “Disha Last Rites Completed | at Puranapul.”", "Disha is a pseudonym given to the victim by Indian media. for example, The Hindu, a major Indian newspaper, also reported on Disha here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]