["The one-minute 22 second video was published in this Facebook post on July 1, 2019.", "It has been viewed more than 1.4 million times and shared more than 28,000 times.", "Below is a screenshot of the misleading post:", "The post's Spanish language caption translates to English as: “In Dubai last week the temperature reached 63 degrees celsius. That’s the highest temperature ever recorded worldwide. Trees started burning on their own. It’s forecast that by mid-July it could rise to 68 degrees. Climate change is already here.”", "The same claim has also been shared thousands of times with the same video on social media in English language posts, such as here on Youtube with 68,000 views, here on Facebook and here on Twitter.", "It has also been posted here on a multilingual Indian news website.", "The claim is false; the footage shows two separate incidents in Kuwait and Saudi Arabia, both in 2017.", "Burning bushes", "The first 15 seconds of the video in the misleading posts shows two tall buildings in the background, which AFP located in Kuwait.", "A reverse image search for a keyframe of the video found this corresponding photo tagged at the location of Kuwait's Liberation Tower.", "Below is a screenshot comparison of the misleading video (L) to the Google user image tagged at Kuwait's Liberation Tower on Google Maps (R):", "A keyword search found a photo very similar to the video screenshot published by Kuwaiti news portal, Al Rai in this Arabic-language report. The article states the fire occurred in Al Shaheed Park on July 29, 2017. It states the cause of the fire was \"unknown\". Al Shaheed Park is located about three kilometres from Liberation Tower -- as shown here on Google Maps.", "This video published on YouTube on July 29, 2017 is identical to first 15 seconds of footage in the misleading posts. It also states the fire happened in Al Shaheed Park.", "Palm tree ablaze", "The second section of the video in the misleading posts is one minute and seven seconds in length. It shows a palm tree on fire next to a road.", "A reverse image search on Google found this article published on August 1, 2017 on Saudi media site alweeam.com, with the same footage.", "Below is a screenshot comparison of the video from the misleading post (L) and the clip on alweeam.com (R).", "The alweeam.com article states the fire, in the Saudi Arabian city of Medina, was likely caused by lightning.", "An Arabic speaking journalist in AFP's Hong Kong bureau analysed the video. The voice of a man can be heard stating a tree in Sultana road, near to the Mushaa'bi area of Medina, was set alight by a lightning strike.", "The audio translates to English in part as: “Look, this tree got struck by a lightning today, lightning hit the tree and set it on fire, people look at this! This lightning was today, today at 6:30 look how it is burning, this is happening in Sultana road, near to Mushaa'bi area, look how lightning burnt the palm tree down, right in front of us, and it immediately caught fire just now, we witnessed this just now, it has happened right in front of us, it has burnt it!\"", "One week before the misleading posts were published, temperatures in Dubai reached a high of 44 degrees celsius, according to this data published by data site Wolfram Alpha.", "The Guinness World Record for the highest temperature ever recorded on Earth is 56.7 degrees celsius in Death Valley, California.", "The same video has been previously debunked by AFP in Spanish language here and also by Snopes in English here and by Rappler in English here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]