["One Facebook post from January 8, 2019 garnered over 1,700 reactions, 646 comments and 504 shares in less than four hours.", "A similar narrative can be found posted here by another mainstream publication, but the article reiterates that the unverified account and cannot be confirmed as hers.", "The suspicious Twitter account was only set up this month, describing its supposed owner as @MrsConcoZuma, \"A graduate in journalism, VumaFm employee and lastly but not least I'm Jacob Zuma youngest wife\".", "The authenticity of Conco's Twitter account appeared doubtful already when compared with her established Instagram account. The Instagram account has many personal pictures while the Twitter account had a different tone and posted a few old pictures that had already appeared in the media.", "The Instagram account dates back to a post from April 2, 2017 but Conco has been tagged in pictures as far back as June 2015.", "AFP contacted Conco via an Instagram post where she labelled one of the tweets as fake and she confirmed she does not own the account.", "A post shared by Nonkanyiso Conco (@_laconco) on Jan 8, 2019 at 4:09am PST", "“It’s fake...That’s why I posted this. I do not have Twitter,” posted Conco.", "Conco has 50 posts and 3,688 followers on Instagram - one of those followers is an actress with a following of 23,867. A post and comments point to the Instagram account’s authenticity.", "The same actress responded on Twitter to one of the tweets, saying it was not Conco.", "lol nope. Defs not her. https://t.co/6AgS9kRFse", "Zuma himself joined Twitter less than a month ago, launching with a video saying: \"Hello everyone, I have decided to move with the times to join this important area of conversation.”", "The mainstream publication has since amended the article about Conco's Twitter and included information from her Instagram post. However, Zuma has now requested a retraction of the story via his Twitter account.", "Shouldn’t you have asked her first before spewing your lies? @Sesona_Ngqaks @News24 there is nothing to clarify, why have you not retracted the story and issued an apology?https://t.co/2t5ozjSjOo", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]