["One man attending an April 18, 2020, rally in Brookfield, Wis., to protest coronavirus stay-at-home orders carried a Don't Tread on Me flag and a Confederate flag. (Milwaukee Journal Sentinel)", "A Milwaukee Journal Sentinel photo showed one protester carrying two flags, including the Confederate flag.", "Analyses show the photo was not doctored.", "Conspiracies about mainstream news media are flourishing amid the government response to the COVID-19 pandemic.", "\"What a bunch of BS,\" screamed a Facebook post about a news photo from a Wisconsin rally against stay-at-home orders.", "Sharing two images from the demonstration, the post essentially claims the Milwaukee Journal Sentinel doctored a photo to put a Confederate Battle Flag in the hands of one protester.", "But the Milwaukee Journal Sentinel did not alter its photo.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Here’s what happened.", "The Journal Sentinel, which publishes PolitiFact Wisconsin, posted a news story about the April 18 rally in Brookfield, a Milwaukee suburb. Nearly 1,000 people packed the sidewalk adjacent to a busy thoroughfare, most shoulder to shoulder, to protest Gov. Tony Evers’ decision to extend Wisconsin’s safer-at-home order until May 26.", "The Facebook post shows two photographs from the rally side by side — one from the Journal Sentinel and one said to be taken by the poster’s daughter.", "The Journal Sentinel photo shows a man wearing a plaid shirt and jeans among a group of people and holding two flags — a Confederate flag and just above it, a yellow flag that is harder to make out.", "The other photo with the post shows a man, also in a plaid shirt and jeans, who is not so close to other people. He is clearly holding only a yellow flag.", "The implication is that in its photo, the Journal Sentinel added the Confederate flag into the man’s hands.", "The two-flag photo is one of 13 images in a photo gallery that accompanied the Journal Sentinel’s news story about the protest.", "After Facebook posts appeared making the specious claim, the Journal Sentinel published an article denying that its photo was doctored. The article explained what happened:", "On April 18, the reporter who wrote the news story sent the photo in question from his iPhone to an editor who loaded it directly into the Journal Sentinel's publishing system.", "The photo shows the man holding a yellow Don't Tread on Me flag and a Confederate flag together on one pole.", "On April 19, a Journal Sentinel photo editor examined the photo and determined it was never edited in Photoshop, even to receive the basic color-toning for reproduction.", "The article also pointed out that other images taken at the rally, including two videos posted on social media, show a man with the two flags.", "it has gotten much larger pic.twitter.com/vaOtRMrnxf", "(Confederate flag is visible at the 9-second mark in this tweeted video.)", "One video shows a man wearing a plaid shirt and baseball cap, holding just a Don't Tread on Me flag, a few feet away from the man holding the Don’t Tread on Me and the Confederate flags.", "Another video also shows a Confederate flag flying below a Don't Tread on Me flag, with another Don't Tread on Me flag nearby.", "The Journal Sentinel reporter on the scene also captured an image in which both men can be seen. The photos are time-stamped at 11:40 and 11:41 a.m.", "PolitiFact did an Error Level Analysis on the image in question, using FotoForensics, and found that the flags and the people were part of the same JPEG compression. The photo’s metadata also does not show that Photoshop was used.", "In English: There’s no forensic evidence that the image was doctored.", "A Facebook post showing two photographs from a rally that protested coronavirus stay-at-home orders suggests that one of the photos, taken by the Milwaukee Journal Sentinel, was doctored.", "Our analysis found the photo, which shows one man holding a Don’t Tread on Me flag and a Confederate flag, was not altered. The person is visible in several other posts we found that were not from the newspaper.", "We rate the statement Pants on Fire.", "Facebook, post, April 18, 2020", "Milwaukee Journal Sentinel, \"No, a Journal Sentinel image of Confederate flag at Brookfield rally was not doctored, as false accusations on Facebook claim,\" April 19, 2020", "Milwaukee Journal Sentinel, \"Hundreds in Brookfield protest Evers' extension of safer-at-home order,\" April 20, 2020", "PolitiFact, analysis of Error Level Analysis on the image in question, using FotoForensics", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]