["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Centers for Disease Control and Prevention logo at the agency's federal headquarters in Atlanta on Nov. 19, 2013. (AP/file)", "The CDC now says that people who were exposed to the virus and are unable to quarantine a full 14 days can instead quarantine seven or 10 days and still largely reduce risk of transmission.", "But they didn’t say their 14-day quarantine recommendation was wrong. In fact, it’s still recommended that you quarantine 14 days if you can.", "The Centers for Disease Control and Prevention announced a change in guidance on coronavirus quarantines earlier this week, which could ease the strain on people who are exposed to the virus but need to get back to work or other responsibilities.", "In the updated guidance, released Dec. 2, the CDC said an exposed person who lives in a community with adequate testing can quarantine seven days instead of 14 provided they test negative for the virus at some point in the last two days of their quarantine.", "Quarantine could end after 10 days without a test if the person watches for symptoms of the virus and has none, the guidance adds. The person is expected to continue symptom-monitoring and wearing a mask for the full two-week stretch.", "It sounds like good news, but state Sen. Duey Stroebel, R-Cedarburg, didn’t seem to take it that way.", "\"CDC admits old ‘science’ was wrong, says new ‘science’ is only a 7-day quarantine after close contact followed by no symptoms and negative test, 10-day quarantine w/o testing and no symptoms,\" Stroebel tweeted Dec. 3, along with a link to the new information.", "But it’s actually the senator who is wrong. Here’s why.", "The move came as the CDC acknowledged that a 14-day quarantine is tough on some Americans, particularly those who need to get back to work in-person. Experts say a shorter quarantine may make people more likely to comply with staying home and more willing to work with public health employees to identify their close contacts so transmission can be cut off.", "It also hones in on the period in which a person would be most capable of passing the virus on if they’d become infected. John Brooks, chief medical officer for the CDC’s coronavirus response, said people who quit quarantine after seven days carry just about a 5% risk of still passing the virus on, and those who stop after 10 days bear just 1% risk.", "So the agency isn’t saying their previous guidance was wrong. In fact, their recommendation to quarantine for 14 days if it’s possible is still in effect. The new guidance simply provides two alternatives for people who are unable to wait.", "\"Any option to shorten quarantine risks being less effective than the currently recommended 14-day quarantine,\" the guidance states.", "Like others who have sought to downplay the seriousness of the virus, Stroebel is undermining scientific evidence by criticizing a change in what experts are saying.", "While it certainly would have saved lives if we knew everything about COVID-19 as soon as it emerged, that’s just not how science works.", "The world had never seen SARS-CoV-2 before early last year, so there’s a lot to learn about it. That means guidelines will change to keep us safest in accordance with what we’re learning.", "Some examples:", "Scientists determined early-on that masks help keep you from giving the virus to others. In November, the CDC released a bulletin saying for the first time that they may protect the wearer, too. This change is expected — it signals research progress being made.", "In July, the World Health Organization announced that the virus may linger in the air in indoor spaces, a form of transmission it had previously called doubtful. Again, new scientific evidence helped bring this revelation to light.", "Inside hospitals, health care workers discovered that proning, a technique where patients lay on their stomachs to promote better lung expansion, can sometimes alleviate the need to put a patient on a ventilator, which was initially thought to be one of the most critical tools for a seriously ill coronavirus patient. Once again, this was a product of learning more about the virus.", "This is how scientific research works all over the world. The Ebola virus, for example, was discovered in 1976, and scientists and public health officials were still studying and making changes to their approach when an outbreak arose in West Africa nearly 40 years later. It is extremely likely, if not inevitable, that we’ll still be learning about the novel coronavirus four decades from now, too.", "In response to an email asking for backup to the senator’s claim, policy director Brian Sikma said Stroebel believes public health recommendations should continue to be revised as more research and data add to our understanding of the virus.", "\"Because science never stops questioning itself, public health officials and policymakers should be transparent in their recommendations and avoid broad, absolute statements when actual knowledge is still evolving,\" Sikma wrote.", "That reflects an acknowledgement of the scientific process that Stroebel’s claim did not. But it also provides no evidence of his claim.", "Stroebel claimed the CDC admitted it was wrong about its previous recommendation that people who were exposed to the virus should quarantine for 14 days.", "But they adjusted the guidance because scientists learned more about its contagious period, and because they wanted to make it easier for people to stay home. A 14-day quarantine is still their recommended route, if people can make it work.", "The CDC guidance remains in place, so it wasn’t \"wrong,\" and there was no admission.", "We rate Stroebel’s claim False.", "Centers for Disease Control and Prevention, Options to Reduce Quarantine for Contacts of Persons with SARS-CoV-2 Infection Using Symptom Monitoring and Diagnostic Testing, Dec. 2, 2020", "Tweet from Sen. Duey Stroebel, Dec. 3, 2020", "Washington Post, \"CDC says 2-week coronavirus quarantines can be cut to 10 or 7 days,\" Dec. 2, 2020", "Politifact Wisconsin, \"Wisconsin GOP lawmaker wrong that masks have been \"proven ineffective\" against COVID-19,\" July 30, 2020", "Centers for Disease Control and Prevention, Scientific Brief: Community Use of Cloth Masks to Control the Spread of SARS-CoV-2, Nov. 20, 2020", "New York Times, \"The Coronavirus Can Be Airborne Indoors, W.H.O. Says,\" July 9, 2020", "Milwaukee Journal Sentinel, \"Less-invasive breathing therapies could keep 'significant number' of patients off ventilators,\" April 27, 2020", "Centers for Disease Control and Prevention, History of Ebola virus disease, updated Sept. 18, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]