["About this rating", "In January 2021, news reports surfaced alleging that Facebook removed posts on its site that mentioned Plymouth Hoe — a landmark in the southwest English coastal city of Plymouth — for containing offensive language.", "\"Facebook has found itself in hot water after challenging some posts from local people who innocently mentioned the Hoe, mistakenly thinking they were using a misogynist term,\" The Guardian reported on Jan. 27.", "The underlying claim was true. Facebook erroneously removed posts with the name of the park, citing rules governing harassment and bullying, and then later apologized for the error, according to multiple reputable news outlets.", "Dawn Lapthorn, who created a Facebook group titled \"Don't Dump It, Plymouth And Surrounding Areas,\" told BBC the site asked her to remove comments that mentioned the landmark's shorthand, \"Hoe,\" and at least one member was banned from commenting on group posts for using the site's name. Other people had posts taken down, the news outlet reported.", "“Just a quick post to say anyone living Plymouth h o e, please don’t write it as one word,” read a warning post in the group, according to The Guardian. “Facebook are saying it’s harassment and muting people and giving them a Facebook ban. It’s not us doing that.”", "A Snopes reporter submitted a request to join the Facebook group, and will update this report when or if the potential fulfillment of that request leads to new and relevant information.", "An unnamed Facebook representative told BBC and The Guardian that site administrators were investigating why, or under what circumstances, the harmless posts were flagged as offensive.", "\"These posts were removed in error and we apologize to those who were affected,\" the spokesperson said. \"We're looking into what happened and will take steps to rectify the error.\"", "According to a website that advertises tourism in Plymouth and Historic England, a government-sponsored educational agency, the landmark's name — \"Plymouth Hoe\" — was derived from old English and appropriately meant \"high ground.\"", "In sum, considering the Facebook spokesperson's reported comments that acknowledged and apologized for the mistake, we rate this claim \"True.\"", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]