["About this rating", "On July 29, 2019, a tweet ostensibly quoting U.S. Rep. Jim Jordan (R-Ohio) as asserting that former President Barack Obama and his vice president, Joe Biden, had been \"cowering in fear on Air Force 1\" in the aftermath of the 9/11 terrorist attacks on the U.S., while Donald Trump was \"on the ground with first responders searching for survivors and pulling people to safety,\" achieved viral status:", "GOP rallies around Trump 9/11 role. “While Obama and Biden were cowering in fear on Air Force 1, Mr. Trump was on the ground with first responders searching for survivors and pulling people to safety,” Jim Jordan says. “I remember seeing him on TV, running toward the danger.” pic.twitter.com/P7ol4wycoF", "— Dan Lyons (@realdanlyons) July 29, 2019", "This tweet prompted outraged responses from people who took it at face value, most of them vociferously pointing out that George W. Bush was president at the time of the 9/11 attacks in 2001, and Obama was not elected to that office until more than seven years later:", "This quote attributed to Jim Jordan about Obama and Biden on Air Force One can't POSSIBLY be true.", "1. Obama and Biden weren't in office during 9/11.", "2. Cadet Bonespurs can barely walk, let alone run towards danger.", "3. Jim Jordan saw something and said something? Nope. https://t.co/55oSBDv8lA", "— BrooklynDad_Defiant! (@mmpadellan) July 30, 2019", "Does this dumbasss know that Obama and Biden weren’t even President & VP when 9/11 happened? This kind of uneducated stupidity is why we have Trump instead of Clinton. https://t.co/x0NtDnqeby", "— David Leavitt (@David_Leavitt) July 30, 2019", "This is a complete lie. Already proven to be a lie. But it fits the character of Gym Jordan to push a lie. https://t.co/fURisnr5G0", "— Steven Cohn (@spcohn) July 30, 2019", "But the tweet was just a spoof mocking President Trump and his Republican supporters by playing on a controversial comment Trump had made the previous day about his presence among first responders who were searching for survivors in Lower Manhattan immediately after the 9/11 attacks: \"I was down there also, but I'm not considering myself a first responder. But I was down there. I spent a lot of time down there with you.\"", "The purported quote from Rep. Jim Jordan was a fabricated one created by Dan Lyons, a journalist and writer for the HBO comedy series \"Silicon Valley.\" Lyons told Newsweek that \"You wouldn't be surprised if those guys said something that ridiculous. I kind of thought people would know it's a joke, but I guess I should stamp it. That's always the risk with satire.\"", "Lyons later tweeted about the virality his previous tweet had achieved:", "There should be a word (probably in German) for when you pull a prank and you are laughing but also scared at the same time. Angstenfreude? pic.twitter.com/GBlJut3VrZ", "— Dan Lyons (@realdanlyons) July 30, 2019", "Cillizza, Chris.   \"You'll Never Believe What Donald Trump Just Said About 9/11.\"\r\n    CNN.   30 July 2019.", "Hutzler, Alexandra.   \"'Obama and Biden' Trend After Satirical Jim Jordan Quote About Trump, 9/11 Goes Viral.\"\r\n    Newsweek.   30 July 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]