["By Saranac Hale Spencer", "Posted on September 21, 2020", "Facebook posts claim that Sen. Kamala Harris said, “I like taking the guns early.” She didn’t say that, but President Donald Trump did.", "Dozens of conservative Facebook pages have been sharing a picture of Sen. Kamala Harris with a quote that says, in part, “I like taking the guns early.”", "But the quote isn’t from Harris, who is the Democratic nominee for vice president. It’s from President Donald Trump.", "Trump said it during a Feb. 28, 2018 meeting on gun violence, two weeks after 17 people were shot dead at a high school in Parkland, Florida.", "Vice President Mike Pence, seated across from Trump in the televised White House meeting, had explained one legislative option states can use for disarming potentially dangerous shooters. If family members or law enforcement officers are concerned that someone is a risk to himself or others, they can go to court and get an order — sometimes called risk protection orders or gun violence restraining orders — to confiscate that person’s weapons, Pence said.", "Trump responded, saying: “Or, Mike, take the firearms first and then go to court. Because that’s another system, because a lot of times, by the time you go to court, it takes so long to go to court, to get the due process procedures. I like taking the guns early. Like in this crazy man’s case that just took place in Florida, he had a lot of firearms — they saw everything — to go to court would have taken a long time, so you could do exactly what you’re saying, but take the guns first, go through due process second.”", "The parts of that quote in bold are what appear in the Harris meme. Similar text has also appeared with a picture of Democratic Rep. Alexandria Ocasio-Cortez, a frequent target of false memes.", "When Harris was the attorney general in California, she supported the creation of a gun violence restraining order law of the sort that Pence described. But we could find no record of her making the suggestion that due process should be ignored.", "As we said, though, Trump has made that suggestion. The video showing his remarks is below:", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "White House Meeting on Community and School Safety. C-SPAN. 28 Feb 2018.", "American Bar Association. Standing Committee on Gun Violence. Resolution – 17A118B. 15 Apr 2020.", "California State Senate. Senate Rules Committee. Gun violence restraining orders bill analysis. 22 Aug 2014.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]