["A 30-second video that shows two men shooting another man in public has been widely shared across social media platforms. Several Twitter and Facebook users have shared this video with the text, “Today, shootout of colonel from Saudi Arabia who was involved in the killing of journalist Adnan Khashoggi in Saudi Consulate in Turkey.”", "Twitter user @MissdOportunity, @Kashmirkikali3, @Satpal55616886 and @chandan_stp were among those who tweeted the video.", "Today Shootout of colonel from Saudi Arabia who was involved in Killing of Journalist Adnan Khashoggi in Saudi Consulate in Turkey#saudia #Turkey pic.twitter.com/3bBfzzJt0a", "— chandan. 🏹 (@chandan_stp) October 13, 2020", "It was also shared by Pakistani users including Voice of Pakistan and Fida Muhammad Khan.", "Today, shootout of colonel from Saudi Arabia who was involved in killing of journalist Jamal Khashoggi in Saudi Consulate in Turkey. pic.twitter.com/Co0zNLXCww", "— Voice of Pakistan™ (@VoVictims) October 13, 2020", "Alt News received multiple verification requests on our WhatsApp helpline (+917600011160) and official Android application.", "This slideshow requires JavaScript.", "Jamal Khashoggi was a journalist from Saudi Arabia who was murdered inside the country’s consulate in Istanbul on October 2, 2018. He was critical of the Saudi government and was in a self-imposed exile in the US since 2017. Saudi officials said that he was assassinated by a team of agents who wanted his return to the Kingdom while Turkey claimed that the ‘rogue operation’ was carried on the orders from the highest level of the Saudi government.", "Eight unidentified people were convicted of the murder and according to BBC, one of the accused “spent two years working in London, with a source describing him as a colonel in Saudi intelligence to US news network CNN.”", "However, the viral video is unrelated to Khashoggi’s case.", "We performed a Google reverse image search using InVID and the search engine threw results with preselected keywords — “jorge fernando lino macas.”", "Using this as a clue we performed a keyword search on Twitter and found that Revista Vistazo, an Ecuadorian news website, tweeted a still from the viral video and wrote in Spanish, “Jorge Fernando Lino Macas, a former policeman and singer, nicknamed “Vanilla”, was killed with at least 15 shots on the night of Thursday, January 2, 2020.” The same was reported by Ecuador-based daily El Universo.", "#ACTUALIDAD | Jorge Fernando Lino Macas, un expolicía y cantante, apodado como “Vanilla”, fue asesinado con al menos 15 disparos la noche del pasado jueves 2 de enero del 2020. ¿QUÉ PASÓ? https://t.co/OrkkyfRJum pic.twitter.com/RYeqNtquhk", "— Revista Vistazo (@revistavistazo) January 3, 2020", "As per El Universo, the incident happened in Guayaquil. Lino had a long criminal history and was prosecuted for drug trafficking, murder and illicit association.", "This video was also viral in March with the claim that the incident happened at an outdoor restaurant in the coastal South African city of Durban. It was debunked by AFP.", "Thus the social media claim associated with the viral video is false. It doesn’t show one of the men accused of Jamal Khashoggi’s assassination being killed but pertains to the murder of a former Ecuadorian cop Jorge Fernando Lino Macas.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]