["Moms Demand Action for Gun Sense in America offered this comparison -- \"Little Red Riding Hood\" has been banned in the U.S., but not assault weapons. We look at whether it's a solid comparison.", "The image created by a pro-gun control group and widely shared on social media is designed to be provocative. Two youngsters sit in a children’s section of a library, one holding a fairy tale book and the other holding an AR-15 semi-automatic rifle. The caption: \"One child is holding something that's been banned in America to protect them. Guess which one.\"", "The ad was created by Grey Group, an international ad agency, on behalf of Moms Demand Action for Gun Sense in America. Moms Demand Action was founded in the wake of the 2012 mass shooting at Sandy Hook Elementary School in Newtown, Conn., by Shannon Watts, a 42-year-old Indiana mother who has worked as a communications executive. The group claims tens of thousands of members and more than 75 local chapters, and it has been active in organizing on gun policy through social media.", "A reader forwarded us the ad with the two children, asking us to take a closer look. We decided to check whether Little Red Riding Hood, the book held by the child, is something \"that’s been banned in America,\" and whether assault weapons haven’t been.", "We will start by noting that Watts, who did not respond to a request from PolitiFact, acknowledges that the ads are designed to be provocative.", "She told Yahoo! earlier this year that the ad is \"obviously meant to make a point and create discussion. The (National Rifle Association) has been very, very good at creating fear among their members that their rights are going to be taken away or somehow the government is going to turn against them. We're trying to create debate and discussion about the facts.\"", "Still, we don’t think being provocative exempts the ad from being scrutinized for accuracy.", "'Little Red Riding Hood'", "The Little Red Riding Hood shown in the image has indeed been banned before. The version of the 17th century fairy tale was adapted by the late, Caldecott Medal-winning illustrator Trina Schart Hyman and was originally published in 1987. According to media accounts, the volume became a target because one image showed a bottle of wine in the girl’s basket, a detail that had been included in the original version of the fairy tale.", "An Associated Press article quoted Culver City, Calif., assistant superintendent for instruction Vera Jashni saying that the inclusion of wine in the book \"gives the younger ones the wrong impression about alcohol. If they should refrain, why give them a story saying it's okay?'' Jashni told the AP that she was worried about lines in the book that said, \"The grandmother drank some of the wine, and ... after a while, the grandmother felt quite strong and healthy, and began to clean up the mess that the wolf had left in the cottage.''", "So the Moms Demand Action ad has a point that the Hyman edition of Little Red Riding Hood has been banned before. Still, it’s worth noting some additional context. For more background, we contacted the American Library Association, the leading authority for tracking books that have been banned or challenged by parents in schools and libraries across the United States.", "It turns out that the only recorded examples of Little Red Riding Hood being banned took place in 1990 -- 23 years ago -- and occurred in just two California school districts, Culver City and Empire Union. When we asked the Culver City school district if the ban is still in place, they said it has been reversed.", "The American Library Association recorded three additional cases involving the volume, in Florida’s Bradford, Clay and Levy counties in 1990 and 1991. (One of the complaints in Bradford was that the wolf was too scary.) In these cases, parents or teachers challenged the books but administrators took no action to ban them.", "Indeed, Little Red Riding Hood doesn’t appear on any of the library association’s lists of most frequently banned books. The list of frequently banned and challenged \"classic\" books includes The Great Gatsby by F. Scott Fitzgerald, The Catcher in the Rye by J.D. Salinger, The Grapes of Wrath by John Steinbeck, To Kill a Mockingbird by Harper Lee and The Color Purple by Alice Walker. Frequently banned kids’ books include the Harry Potter series by J.K. Rowling and the Captain Underpants series by Dav Pilkey.", "So while the ad has a point that one version of Little Red Riding Hood has been banned in the past, there’s no evidence of it being banned during the past 23 years, and there’s no evidence of any bans outside of two school districts.", "Assault weapons", "The ad also has a point that there is currently no national assault-weapon ban. Such a ban was in force from 1994 to 2004, but it expired, and opposition from gun-rights advocates has kept it from being revived by Congress.", "However, a fact that somewhat undercuts the ad’s stark contrast is that seven states do ban assault weapons -- California, Connecticut, Hawaii (assault pistols only), Maryland, Massachusetts, New Jersey and New York, plus the District of Columbia. Collectively, these states account for about 27 percent of the nation’s population.", "In other words, it’s inaccurate to suggest that assault weapons haven’t been banned anywhere in America. States also typically ban the sale of firearms to the elementary schoolers pictured in the ad.", "Of course, supporters of tighter gun laws note that state bans aren’t especially useful in the absence of a national law, since assault weapons can easily be carried across state borders.", "Our ruling", "Moms Demand Action for Gun Sense in America’s ad said that Little Red Riding Hood is something \"that’s been banned in America,\" but assault weapons haven’t been. We understand what the ad is trying to do, but its black-and-white language obscures that the \"bans\" being compared are not so clear-cut.", "Little Red Riding Hood was banned only in two school districts and nearly a quarter century ago; many books have been banned much more recently, and much more frequently, than that. In the meantime, there’s no national assault-weapons ban, but more than a quarter of Americans live in states that have banned assault weapons.", "The claim contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Yahoo! \"Little Red Riding Hood and AR-15s? New Ads Contrast School Bans and Gun Regulations,\" Apr 15, 2013", "Law Center to Prevent Gun Violence, \"Assault Weapons Policy Summary,\" accessed Aug. 27, 2013", "American Library Association, \"Top 100 Banned/Challenged Books: 2000-2009,\" accessed Aug. 27, 2013", "American Library Association, \"Banned & Challenged Classics,\" accessed Aug. 27, 2013", "Associated Press, \"Calif. Elementary School Bans Little Red Riding Hood,\" May 19, 1990", "Email interview with Rebecca Williams, executive assistant to the superintendent at the Culver City Unified School District, Aug. 27, 2013", "Email interview with Owen Dougherty, chief communications officer for Grey Group, Aug. 26, 2013", "Email interview with Jen Fuson, spokeswoman for the Brady Campaign to Prevent Gun VIolence, Aug. 27, 2013", "Email interview with Macey Morales, media relations manager with the American Library Association, Aug. 27, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]