["About this rating", "Amid a national controversy over immigration in July 2019, internet trolls and political partisans shared an image of an \"elderly couple\" sleeping on pavement, alongside claims that the image was taken in California and was indicative of Democrats who \"might actually care about their well-being\" if \"only they were illegals.\"", "Here is a homeless, elderly couple from California sleeping on concrete with no water from a toilet or even a toilet at all. If only they were illegals, the Democrats might actually care about their well-being pic.twitter.com/hbq78NkhJG", "— derek schwartz (@derek_mafs) July 13, 2019", "Because we were unable to locate the original source of the photograph using both Google and Yandex reverse-image searches, we don't currently have enough information to confirm whether the image was taken in California, nor do we know the identity of the couple pictured or what their back story is. Furthermore, without knowing their identity, we cannot presume to know what their citizenship status is simply by looking at them.", "The earliest version of this image that we were able to locate online was posted on the trolling platform Gab on July 1, 2019, with a similar anti-immigrant message. In that version of the post, those sharing it claimed the image was taken in Australia.", "It seems unlikely, however, that the picture was taken in Australia because Australians drive on the left side of the road, while the arrows on the pavement in the image indicate drivers use the right side.", "Other posts claimed the image was taken in Dana Point, an affluent beach city in Orange County, California.", "Regardless of where the image was taken, the frame it presents is misleading. It not only conflates two separate issues (immigration and homelessness), but it offers a false dilemma that if you care about the plight of immigrants, you can't also care about homeless people.", "The posts play off the political melee at the national level between U.S. President Donald Trump and his supporters, and his Democratic opponents. Democrats have vocally criticized Trump's immigration policies as overly harsh and panned his administration's handling of a recent surge of asylum seekers from Central America, many of whom are families and children.", "But homelessness and immigration generally are handled separately by different government agencies. And while the federal government handles newly arrived migrants, homelessness is an issue primarily dealt with by local governments because each locality has its own unique homeless population. For example, in 2017 voters in Los Angeles County approved a half-cent sales tax increase to help get people into permanent housing.", "California, and Los Angeles in particular, are favorite targets of ire for right-leaning critics because both the state and city are heavily dominated by Democratic legislators. While homelessness is a longstanding problem in many major U.S. cities, it is most notable in expensive regions like the Los Angeles metropolitan area, where the issue is highly visible. L.A. County has the nation's second-largest unhoused population, behind New York, with a total of 55,188. Although the city of L.A. proper is home to Skid Row in downtown, its far-reaching suburbs in wealthy south Orange County are hardly exempt from the problem.", "Rising homelessness is a phenomenon occurring in metro regions all over the country, according to a 2018 report published by Harvard's Joint Center for Housing Studies. The problem largely is driven not by immigration, but by the skyrocketing cost of housing versus stagnant wages. (Despite the prevalence of news stories about newly arrived Central American migrants to the U.S., overall unauthorized immigration has been on a declining trend since 2007, according to Pew Research Center figures.)", "A dire 2019 report by the National Low Income Housing Coalition found that, \"In no state, metropolitan area, or county in the U.S. can a worker earning the federal or prevailing state minimum wage afford a modest two-bedroom rental home at fair market rent by working a standard 40-hour work week. In only 28 counties out of more than 3,000 counties nationwide can a full-time minimum-wage worker afford a one-bedroom rental home at fair market rent.\"", "In sum, it may well be the case that the photograph depicts an elderly couple forced into homelessness by high housing costs and/or other circumstances, but in the absence of any verifiable details, we are unable to confirm those or any other specific claims people have made about it.", "Cowan, Jill. \"Homeless Populations Are Surging in Los Angeles. Here’s Why.\"\r\n  The New York Times. 5 June 2019.", "Joint Center for Housing Studies of Harvard University. \"The State of the Nation's Housing.\"\r\n  2018.", "National Low Income Housing Coalition. \"Out of Reach.\"\r\n  2019.", "Zillow. \"Homelessness Rate Increases Faster in Least Affordable Rental Markets.\"\r\n  11 December 2018.", "Gonzalez-Barrera, Anna, and Krogstad, Jens Manuel. \"What We Know About Illegal Immigration From Mexico.\"\r\n  Pew Research Center. 28 June 2019.", "City News Service. \"Measure H Helped 10,000 Homeless People Into Permanent Housing, Officials Say.\"\r\n  26 November 2018.", "Editorial board. \"Work as One State to Fight Homelessness – and NIMBYism.\"\r\n  Orange County Register. 29 November 2018.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]