["By Eugene Kiely", "Posted on July 19, 2016 | Updated on July 21, 2016", "New Jersey Gov. Chris Christie says there is “no way that Melania Trump was plagiarizing Michelle Obama’s speech.” Paul Manafort, Donald Trump’s campaign manager, called the allegation “absurd.”", "We were reluctant to join the pack in pointing out the obvious when the two convention speeches are compared. Melania Trump is the spouse of the Republican candidate, is not running for office, and likely read from a script that was handed to her, even though she earlier had taken credit for writing the speech “with as little help as possible.”", "But Manafort, who made his comments on CNN, and Christie, who spoke about it on CNN and NBC, are political pros spinning the facts.", "Manafort flatly denied that there was any plagiarism of Obama’s 2008 convention speech by Trump’s speech writers.", "Manafort, July 19: There’s no cribbing of Michelle Obama’s speech. These were common words and values. She cares about her family. Things like that. I mean, she was speaking in front of 35 million people last night. She knew that. To think that she would be cribbing Michelle Obama’s words is crazy.", "Christie, a former prosecutor, told Matt Lauer on NBC’s “Today Show” that 93 percent of Melania’s speech was “completely different.” He also told CNN’s Jamie Gangel it isn’t plagiarism “if we’re talking about 7 percent of a speech.”", "“There’s no way that Melania Trump was plagiarizing Michelle Obama’s speech,” Christie told Gangel.", "Here is one section from the speeches of Michelle Obama and Melania Trump. We’ve bolded the identical and nearly identical language.", "Michelle Obama, Aug. 25, 2008: Barack and I were raised with so many of the same values: that you work hard for what you want in life; that your word is your bond and you do what you say you’re going to do; that you treat people with dignity and respect, even if you don’t know them, and even if you don’t agree with them.", "And Barack and I set out to build lives guided by these values, and pass them on to the next generation. Because we want our children — and all children in this nation — to know that the only limit to the height of your achievements is the reach of your dreams and your willingness to work for them.", "And here is Trump:", "Melania Trump, July 18, 2016: From a young age, my parents impressed on me the values that you work hard for what you want in life, that your word is your bond and you do what you say and keep your promise, that you treat people with respect.", "They taught and showed me values and morals in their daily lives. That is a lesson that I continue to pass along to our son. And we need to pass those lessons on to the many generations to follow. Because we want our children in this nation to know that the only limit to your achievements is the strength of your dreams and your willingness to work for them.", "We get that both speakers are expressing common values — as both Manafort and Christie pointed out. But the language is mostly identical in these passages, and for Manafort, in particular, to deny the obvious is — to use his word — “absurd.”", "Update, July 20: Meredith McIver, a writer for the Trump Organization, said she wrote the passages that mirrored the language of Michelle Obama’s speech. In a statement issued by the campaign, McIver apologized and offered an explanation of what happened.", "During a phone call, McIver said Melania Trump “read me some passages from Michelle Obama’s speech” as examples of what she wanted to say. “I wrote them down and later included some of the phrasing in the draft that ultimately became the final speech,” McIver said. “I did not check Mrs. Obama’s speeches. This was my mistake.”", "Update, July 21: Manafort, Trump’s campaign manager, said at a July 21 press conference that he did not know McIver was involved in writing Melania Trump’s speech until after he had denied the allegations of plagiarism. “When she came forward, we immediately put forward the statement,” he said.", "https://www.sharethefacts.co/share/d03ecb7c-0272-4f67-b8a3-57f44352f5ea", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]