["The Facebook posts, for example this July 24, 2019 one which has been shared more than 2,500 times, contain a photo of a black and white animal that they claim is a panda.", "The Malaysian-language caption translates as: “How badly our forests have been flattened, after a tiger and a bear, this time it’s a panda found wandering among the residential area.”", "Below is a screenshot of the misleading post:", "The photo was posted here, here and here, with a similar claim.", "The animal in all of the pictures is actually a Malayan tapir -- a four-legged mammal with a trunk-like nose and distinctive white and black colouring.", "Shown below is a comparison of the animal from the misleading Facebook post (L) and the Malayan tapir shown on the website of the International Union for Conservation of Nature’s Red List (R).", "According to the IUCN, the Malayan tapir is an endangered species native to Indonesia (Sumatera), Malaysia, Myanmar and Thailand.", "Local media Utusan Online reported on the incident here on July 23, 2019, using the same photo as seen in the Facebook post.", "The title of the article, in Malaysian language, reads: “Tapir lost in residential area.”", "The first paragraph, translated to English, reads:", "“Residents in the residential area of Lavender Heights in Senawang, near here (Seremban) today was shocked by the presence of a tapir that is believed to have got lost from the nearby forest area.", "“An officer of the Regional Civil Defence (PPAD), Captain Md. Fadir Md. Nor said the incident happened at about 12.30, when the animal went into the residents’ yard.”", "Below is a screenshot of the Utusan Online report:", "Pandas are native to China and are not found in the wild in Malaysia.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]