["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump blamed Democratic states for the demise of his voter fraud commission.", "\"Many mostly Democrat States refused to hand over data from the 2016 Election to the Commission On Voter Fraud,\" Trump tweeted Jan. 4. \"They fought hard that the Commission not see their records or methods because they know that many people are voting illegally. System is rigged, must go to Voter I.D.\"", "Many mostly Democrat States refused to hand over data from the 2016 Election to the Commission On Voter Fraud. They fought hard that the Commission not see their records or methods because they know that many people are voting illegally. System is rigged, must go to Voter I.D.", "Trump disbanded the Presidential Advisory Commission on Election Integrity on Jan. 3 and asked the Department of Homeland Security to review its initial findings and determine next courses of action. The commission was plagued by infighting, multiple lawsuits and pushback from many states.", "We will fact-check whether it was mostly Democratic states that refused to hand over the data.", "In May 2017, Trump issued an executive order establishing the voter fraud commission headed up by Vice President Mike Pence and Kansas Secretary of State Kris Kobach. Trump had made repeated misleading claims about massive voter fraud and election rigging during and after the election. While some instances of voter fraud have occurred, national experts have said fraud is isolated and rare.", "The commission in June asked state election officials for information that included voters' names, registration status, political party affiliation, voting history, partial Social Security numbers.", "Many of states did agree to provide some data to the commission, although many required that the commission meet certain criteria, such as paying a fee. Still, the commission didn’t get all the data it wanted, even from the states that agreed to comply.", "The AP found that states that agreed to comply did withhold some details that the commission had sought, such as only releasing information considered public under state law. (Even Kobach said that his state of Kansas couldn’t provide Social Security information because it wasn’t available under state law.)", "According to the AP as of Oct. 22, the states that denied the request were: California, Connecticut, Delaware, District of Columbia, Kentucky, Maine, Maryland, Massachusetts, Minnesota, New Mexico, North Dakota, South Carolina, Tennessee, Vermont, Virginia and Wyoming. Arizona and Illinois were categorized as undecided.", "There are several holes in Trump’s argument that is was mostly Democratic states.", "Some states that denied or didn’t comply with the commission’s request ultimately voted for Trump. Arizona, Kentucky, North Dakota, South Carolina, Tennessee and Wyoming all voted for Trump. That undercuts Trump’s portrayal of Democratic states being the only ones fighting the commission.", "Some states don’t fall neatly into one partisan category. In Illinois, the bipartisan state board of elections sent a letter to the commission raising concerns and seeking more information. Illinois is generally thought of as a blue state and voted for Clinton, but the board that acted on the Trump commission request includes both Democrats and Republicans.", "Kentucky, which reliably votes for Republicans in presidential elections and went overwhelmingly for Trump, has an elected Democratic Secretary of State, Alison Lundergan-Grimes. She was the one who officially rejected the commission’s request.", "Some Republican officials rejected or didn’t comply with the commission’s request. This includes Arizona, North Dakota, Tennessee and Wyoming. Ed Murray, the Republican secretary of state in Wyoming, said in July, \"I am going to safeguard the privacy of Wyoming’s voters because of my strong belief in a citizen’s right of privacy.\" He said that elections are the responsibility of the states and the request could lead to federal overreach. North Dakota also does not have voter registration and state law forbids the state from releasing details about voters.", "In Arizona, Republican Secretary of State Michele Reagan called the commission's request a \"hastily organized experiment.\"", "Even the states that agreed to comply didn’t provide everything the commission requested. The AP found that states that agreed to comply still withheld some details the commission had sought and only released information considered public under state law. Even Kobach’s own state, Kansas, didn’t allow for the release of Social Security data.", "Florida Secretary of State Ken Detzner, a Republican, said he would only disclose public records and not Social Security or driver’s license numbers.", "\"We absolutely will not provide any information that is not already publicly available,\" he said in July. \"The responsibility for the accuracy and fairness of our elections process in Florida lies with us, not with the federal government in Washington, D.C.\"", "A final note on the part of Trump’s tweet that said states that didn’t comply did so \"because they know that many people are voting illegally.\"", "PolitiFact has repeatedly found no evidence of widespread national voter fraud.", "While we were working on this item the Washington Post’s The Fact Checker published their own analysis and used a different methodology but reached similar conclusions.", "Trump tweeted that \"mostly Democrat states refused to hand over data.\"", "While there are multiple ways to define states as Democratic -- and the White House didn’t explain the definition Trump was using -- he has a point that a variety of predominantly Democratic states were among the states that went the furthest in opposing the commission’s request. They include California, Connecticut, Delaware, District of Columbia, Illinois, Maine, Maryland, Massachusetts, Minnesota, New Mexico and Vermont.", "However, six states won by Trump -- Kentucky, North Dakota, South Carolina, Tennessee, Wyoming and Arizona -- didn’t comply with the commission’s request, and other Republican states complied only in part with the commission’s request.", "We rate this claim Half True.", "'", "President Donald Trump, Tweet, Jan. 4, 2018", "White House, Statement by the Press Secretary on the Presidential Advisory Commission on Election Integrity, Jan. 3, 2017", "Brennan Center, \"Responses to the \"Voter Fraud\" Commission's Voter File Data Request,\" Oct. 5, 2017", "National Association of secretaries of State, Roster of Secretaries of State/Lieutenant Governors, Accessed Jan. 4, 2018", "Wyoming Secretary of State, Media release, July 3, 2017", "Arizona Secretary of State Michele Reagan, Letter, July 3, 2017", "AP, \"More than a dozen states still refuse to release voter data,\" Oct 22, 2017", "AP, \"Trump disbands voter fraud commission amid fights, lawsuits,\" Jan. 4, 2017", "Washington Post, \"Panel studying alleged voter fraud is dismantled,\" Jan. 4, 2017", "Washington Post, \"Almost every state resists Trump's voter fraud commission,\" July 5, 2017", "Washington Post, \"Kris Kobach says he can't comply with Kris Kobach's voter data request\" June 30, 2017", "Washington Post The Fact Checker, \"President Trump's claim that 'mostly Democratic states' refused to provide voter data,\" Jan. 5, 2018", "Post and Courier, \"South Carolina officials receive voter data request from Donald trump’s election fraud commission,\" (Accessed in Nexis) July 4, 2017", "Bismarck Tribune, \"State unable to provide voter info,\" Sept. 8, 2017", "New York Times, Election results Kentucky, Nov. 2016", "Miami Herald, \"Florida will comply with part of Trump commission’s voter data request,\" July 6, 2017", "PolitiFact, \"Trump's commission vice chair Kris Kobach says immigration data not bounced against voter rolls,\" May 23, 2017", "PolitiFact, \"Donald Trump's Pants on Fire claim of 'large scale voter fraud,'\" Oct. 17, 2016", "PolitiFact, \"Following Trump voter fraud allegations, claim that 5.7 million noncitizens voted is wrong,\" June 22, 2017", "Interview, Will Dinneen, Wyoming secretary of state spokesman, Jan. 4, 2018", "Interview, Matt Roberts, Arizona Secretary of State spokesman, Jan. 4, 2017", "Interview, Matt Dietrich, Illinois State Board of Elections spokesman, Jan. 4, 2017", "Interview, Rudy Mehrbani, senior counsel for  Brennan Center for Justice at the New York University law school, Jan. 4, 2017", "Interview, Chris Whitmire, South Carolina State Election Commission spokesman, Jan. 5, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]