["About this rating", "In a July 2016 interview, Julian Assange (founder of WikiLeaks) contended that leaked  e-mails painted a \"rich picture\" of Hillary Clinton's hawkish tendencies with respect to the Libyan intervention and referenced ISIS as the eventual beneficiary of weapons provided for that intervention.", "No WikiLeaks e-mails confirm that Hillary Clinton directly and knowingly \"sold weapons to ISIS.\"", "Over the course of 2016, the WikiLeaks web site has published at least three archives containing leaked e-mails from high-ranking Democrats, and four Democratic National Committee (DNC) staffers were eventually fired over material contained in those leaked messages, including DNC chair Debbie Wasserman Schultz. But the format in which WikiLeak publishes their data has led to frequent second- or third-hand reporting on what the leaks actually contain, with few readers actually examining the content directly.", "On 12 October 2016, WikiLeaks published a set of files dubbed \"The Podesta Emails,\" communications sent to and from Hillary Clinton campaign manager John Podesta:", "RELEASE: The Podesta Emails Part 4 (1193 new emails) #HillaryClinton #PodestaEmails #PodestaEmails4 https://t.co/rxnQMEuKmd pic.twitter.com/FCJ6qqYSyj", "— WikiLeaks (@wikileaks) October 12, 2016", "As demonstrated in the tweet reproduced in the Example section above, a number of social media users asserted that the newest e-mail leak proved Hillary Clinton had \"sold weapons to ISIS.\"   But finding exactly which e-mails in the dump established that Hillary Clinton had done such a thing proved elusive to those who went looking for them, such as one Quora user:", "Where is Hillary Clinton's new scandal WikiLeaks just revealed about her implication in selling weapons to ISIS and how it was covered up by Obama?", "This morning I learned on Russian TV about the Libyan scandal in which Hillary is involved, yet when I search on the internet about her, none of the results in the news section talk about this issue. Why is that, and how will it impact the presidential race?", "The confusion stemmed from at least one undated article boasting a headline of \"WikiLeaks CONFIRMS Hillary Sold Weapons to ISIS,\" which had been published well before the \"Podesta Emails\" dump was released by WikiLeaks:", "Julian Assange, the founder of WikiLeaks, is a controversial character. But there’s no denying the emails he has picked up from inside the Democrat Party are real, and he’s willing to expose Hillary Clinton.", "Now, he’s announcing that Hillary Clinton and her State Department were actively arming Islamic jihadists, which includes the Islamic State (ISIS) in Syria.", "Clinton has repeatedly denied these claims, including during multiple statements while under oath in front of the United States Senate.", "WikiLeaks is about to prove Hillary Clinton deserves to be arrested[.]", "But the wording of the article didn't say that any e-mails demonstrated that Hillary Clinton had sold weapons to ISIS; rather, it conveyed WikiLeaks founder Julian Assange's belief that \"Hillary Clinton and her State Department were actively arming Islamic jihadists.\"  That information came from a 25 July 2015 Assange interview with Democracy Now! journalist Juan González, during which Assange referenced earlier e-mail leaks:", "Q: Why did you do this, and what’s the importance, from your perspective, of being able to create a searchable base?", "A: Well, WikiLeaks has become the rebel library of Alexandria. It is the single most significant collection of information that doesn’t exist elsewhere, in a searchable, accessible, citable form, about how modern institutions actually behave. And it’s gone on to set people free from prison, where documents have been used in their court cases; hold the CIA accountable for renditions programs; feed into election cycles, which have resulted in the termination of, in some case — or contributed to the termination of governments, in some cases, taken the heads of intelligence agencies, ministers of defense and so on. So, you know, our civilization can only be as good as our knowledge of what our civilization is. We can’t possibly hope to reform that which we do not understand.", "So, those Hillary Clinton emails, they connect together with the cables that we have published of Hillary Clinton, creating a rich picture of how Hillary Clinton performs in office, but, more broadly, how the U.S. Department of State operates. So, for example, the disastrous, absolutely disastrous intervention in Libya, the destruction of the Gaddafi government, which led to the occupation of ISIS of large segments of that country, weapons flows going over to Syria, being pushed by Hillary Clinton, into jihadists within Syria, including ISIS, that’s there in those emails. There’s more than 1,700 emails in Hillary Clinton’s collection, that we have released, just about Libya alone.", "Assange appears to have been asserting that leaked e-mails and cables showed that various actions undertaken by Hillary Clinton and others at the U.S. State Department had resulted in \"weapons flows\" to \"jihadists within Syria, including ISIS.\" One could certainly make the case (from material published by WikiLeaks and elsewhere) that during Hillary Clinton's tenure as secretary of state, the U.S. provided weapons (either directly or indirectly) to various factions in Libya and Syria, that some of those weapons might have ended up in the hands of groups such as the Muslim Brotherhood, al-Qaeda, and ISIS, and that the latter was a foreseeable outcome of the former.", "But Assange did not say, nor have any revealed e-mails documented, that Hillary Clinton \"sold weapons to ISIS\" — that is, that Clinton deliberately and knowingly arranged for the United States to sell weapons to the jihadist militant group known as ISIS.  Perhaps her role in shaping the United States' actions regarding the Libyan intervention and the ongoing Syrian civil war negligently allowed arms to fall into the hands of \"jihadists,\" but that's not the same thing as \"selling weapons to ISIS.\"", "Becker, Jo and Scott Shane.   \"Hillary Clinton, ‘Smart Power’ and a Dictator’s Fall.\"\r\n    The New York Times.   27 February 2016.", "Democracy Now!.   \"Assange: Why I Created WikiLeaks' Searchable Database of 30,000 Emails from Clinton's Private Server.\"\r\n    25 July 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]