["About this rating", "The details behind some arrests are so grotesque that they prompt our readers to ask us if the allegations are real. The February 2019 arrest of Timothy Hauschultz, Tina McKeever-Hauschultz, and their 15-year-old son, Damian Hauschultz, fits that description.", "The three suspects face various charges in connection with the death of 7-year-old Ethan Hauschultz in Newton, Wisconsin, in April 2018, in what authorities described as a death brought on by physical abuse.", "According to authorities, the victim died from multiple blunt force injuries as well as hypothermia. A statement from the Manitowoc County Sheriff's Office read in part:", "Ethan had been performing punishment ordered by Timothy which required Ethan to carry a heavy wooden log, weighing approximately two-thirds his body weight, while being monitored by Timothy's 15-year-old son. Over the course of 1-1.5 hours, the 15-year-old hit, kicked, struck and poked Ethan numerous times. He repeatedly shoved Ethan to the ground and rolled the heavy log across Ethan's chest. He stood on his body and head while Ethan was face-down in a puddle. He ultimately buried Ethan completely in snow.", "The couple had reportedly been court-appointed to serve as guardians for the victim as well as two other siblings in 2017. Timothy Hauschultz has been listed as the victim's great-uncle, although the circumstances leading to Ethan and his siblings' being placed under the man's supervision are unclear. Various news outlets reported -- citing the criminal complaint against the suspects -- that the physical abuse against Ethan antedated his 20 April 2018 death.", "Damian Hauschultz reportedly told police that carrying the 45-pound log was Ethan's punishment for \"not knowing 13 Bible verses\" well enough for Timothy Hauschultz's satisfaction, and that Timothy had ordered Damian to make sure Ethan fulfilled that mandate. The victim's two siblings, who have not been identified, also told investigators that both they and Ethan had been punished the week of his death by being forced to carry logs every day for two hours a day.", "We contacted the Manitowoc County Sheriff's Office seeking confirmation of this report, including the motive for the crime, but did not hear back prior to publication.", "Damian Hauschultz reportedly told police that by his estimation, he hit Ethan around 100 times -- sometimes with a belt or a stick -- on the day of the victim's death, on top of burying him in what he called \"a little coffin of snow\" despite Ethan's not having a coat or boots on. Ethan Hauschultz died at a local medical facility after initially being found \"unresponsive\" at the residence.  Attorneys for Timothy Hauschultz have said that he was not home at the time of the abuse.", "Damian was charged with reckless homicide in connection with Ethan's death, as well as intentionally causing bodily harm to a child and substantial battery against the victim and his two siblings, who have been removed from their former guardians' care.", "Timothy Hauschultz was charged with felony murder for being party to Ethan's death as well as intentionally contributing to the delinquency of a child as a party to a crime, intentionally causing bodily harm to a child as a party to a crime, and misdemeanor battery. Tina McKeever-Hauschultz was charged with failure to act to prevent bodily harm to a child as a party to a crime, intentionally contributing to the delinquency of a child felony as a party to a crime, and intentionally contributing to the delinquency of a child death as a party to a crime.", "Cash bail was set for each of the three defendants at a 4 February 2019 hearing. Timothy Hauschultz's bail was set at $100,000; Damian Hauschultz's bail at $150,000; and Tina McKeever-Hauschultz's bail at $75,000.", "All three suspects are due back in court on 11 February 2019.", "Reid, Brandon M.   \"Manitowoc Sheriff Arrests 3 in April 2018 Death of 7-Year-Old Ethan Hauschultz of Newton.\"\r\n    Manitowoc Herald Times.   1 February 2019.", "Schafer, Alisa M.   \"Bail Set at $150,000 for 15-Year-Old Boy on Charges Related to Death of 7-Year-Old Child.\"\r\n    Manitowoc Herald Times.   4 February 2019.", "WLUK-TV.   \"Guardians, Teen Charged in Death of 7-Year-Old Manitowoc Co. Boy.\"\r\n    1 February 2019.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]