["About this rating", "New York election law prohibits wearing candidate shirts or hats within 100 feet of polling places; primary voting in some counties has historically been shorter than for general election voting.", "Voters wearing shirts endorsing any candidates will be denied the right to vote; poll hours were cut anywhere in the state.", "New York's 2016 primary election was rife with rumors, due in part because New York's primaries are closed, and also because an early change-of-party deadline had already created a good deal of confusion in an already complicated system.  One claim that emerged from the rumors warned Bernie Sanders voters not to wear shirts or hats with his name on them to polling places:", "Anybody voting for Bernie in New York, *please* google the phrase \"passive electioneering.\" New York is one of six states that has laws against passive electioneering. While it's not always enforced, wearing Bernie pins/stickers/hats/shirts will give you trouble once you go to vote. At best, you'll just be asked to remove the item, but at worst you could be barred from entering your polling place. Wear literally ANYTHING ELSE.", "It is true that New York State voting laws contain a provision concerning \"passive electioneering\", and rumors about voter suppression due to such laws circulated in 2008 as well.  However, there is no reason that enforcement of it would affect only those who were casting ballots for any particular candidate.", "At the same time, New York State's Board of Elections was inundated with calls from worried voters about being turned away on a technicality. In a 2008 article, spokesman Bob Brehm was one of several parties who spoke to the Huffington Post about rumors concerning that law:", "“No one will be thrown in jail over a shirt at the polls,” said state Board of Elections spokesman Bob Brehm, whose office has been bombarded by calls and emails from worried voters.", "But Brehm noted that anyone wearing a campaign button or T-shirt will be asked to remove the item.", "Jason Weingartner, executive director of the New York Republican County Committee, said the law is a good one - as long as it’s consistently applied. “It doesn’t put undue pressure on individual voters who are exercising their constitutional rights,” he said.", "City Councilman Charles Barron (D-Brooklyn) agreed, but added that in his experience the law “isn’t as strictly enforced as it should be.”", "Palyn Hung, a NYCLU staff attorney, said her group is including warnings about the law on its voters’ rights cards.", "“We’re not saying you’re absolutely prohibited (from wearing campaign paraphernalia), but we’re advising people that they might not be allowed to go in” to the polls, she said.", "By law, no form of electioneering (passive or otherwise) can occur within 100 feet of a polling place:", "While the polls are open no person shall do any electioneering within the polling place, or in any public street, within a one hundred foot radial measured from the entrances designated by the inspectors of election, to such polling place or within such distance in any place in a public manner;  and no political banner, button, poster or placard shall be allowed in or upon the polling place or within such one hundred foot radial.", "We contacted the Suffolk County Board of Elections to ask whether voters would be denied the right to participate in the state's primary if they wore a shirt supporting any particular candidate. They told us that in a worst-case scenario, the voter would be asked to turn the shirt inside out, but would still be able to vote without interruption otherwise.", "We asked about another rumor, specifically whether it was true that in some districts, polls would be opening at noon rather than 6 in the morning (which would prevent many from casting ballots before work).  The Board of Elections worker said that the rumor was false for all of Long Island, and that all polling places in Nassau and Suffolk Counties were opening at 6am.", "It is true, however, that polling hours are shorter for primaries than general elections in some regions of the state:", "It is a certainty of Primary Day, just as some dejected voters will call their elections boards demanding to know why their polling station hours were changed only to be told that, in fact, they weren't.", "Unlike for general elections, when polls are open from 6 a.m. to 9 p.m. everywhere in New York, state law cuts short voting times in primary elections by six hours in upstate, central and much of western New York, where polls are open from 12 to 9 p.m.", "Exceptions are New York City, and the counties of Nassau, Suffolk, Westchester, Rockland, Orange, Putnam and Erie, where polls open at 6 a.m. and close at 9 p.m. like they do for all elections everywhere.", "Despite rumors to the contrary, the shorter hours were not a new attempt at suppressing votes. This particular primary election clause has been in place in New York state for decades [PDF]:", "Polls shall be open for voting during the following hours: a primary election from twelve o’clock noon until nine o’clock in the evening, except in the city of New York and the counties of Nassau, Suffolk, Westchester, Rockland, Orange, Putnam and Erie, and in such city or county from six o’clock in the morning until nine o’clock in the evening; the general election from six o’clock in the morning until nine o’clock in the evening; a special election called by the governor pursuant to the public officers law, and, except as otherwise provided by law, every other election, from six o’clock in the morning until nine o’clock in the evening.", "According to that law, the noon provision was in effect as early as 1976. A challenge to the law in 1982 was initially successful, but overturned on appeal.", "There were grains of truth to the rumors circulating among voters ahead of New York's primaries. Voters were not allowed to engage in \"passive electioneering\" via shirts, hats, or buttons within 100 feet of a polling place on election Day. However, no one would lose the right to vote, and the law was typically described as \"rarely enforced.\" A voter might be asked to turn their shirt inside out or leave a hat in the car, but would not be denied at the voting booth. Also, it was false that any counties had primary hours cut; the law dictating a shorter voting window throughout the state of New York was in effect before 1982, and had nothing to do with the 2016 primaries.", "Andreatta, David.   \"Why Can't We Vote Before Work On Primary Day?\"\r\nRochester Democrat & Chronicle.   16 April 2016.", "Singla, Vinita and Megan McGibney.   \"No Obama Tees! Obscure Laws Banning Electioneering May Cause Hassles At the Polls For Voters.\"\r\nHuffington Post.   26 October 2008.", "New York State Supreme Court, Special Term, Albany County.   \"Corning V. Board of Elections.\"\r\n2 September 1982.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]