["About this rating", "Fourteen varieties of the brand were recalled in February 2017, a warning inaccurately resurrected with a clickbait title several months later.", "Sargento cheese was not recalled in May, August, or September 2017, or in 2018.", "On 9 May 2017, a large number of Facebook users shared an alarming link about Sargento (\"America's Most Popular Cheese\") harboring bacteria with the potential to \"kill your family\":", "America Flash News reported that in early May 2017, Sargento cheeses were part of a \"massive recall\":", "It’s time to check your fridges. Sargento Foods Inc. has just issued a massive recall of seven cheeses due to a potential contamination from listeria monocytogenes. The company confirms no illnesses have been reported yet.", "Listeriosis is a serious infection contracted by eating food contaminated with bacteria. An estimated 1,600 people get infected each year—and about 260 die. The bacteria is most harmful to pregnant women, newborns, adults aged 65 or older, and people with weakened immune systems.", "Sargento is continuing to closely monitor and gather information from their supplier, based in Middlebury, Ind. The supplier reportedly notified Sargento Food Inc. that a specialty Longhorn Colby cheese it supplied had potentially been contaminated and needed to be recalled.", "A date of 9 May 2017 was clearly visible on the report, and on Sargento's Facebook page, concerned users asked about circulating recall rumors. The brand's Facebook team responded to one such comment:", "Hi Brooke - Select products were recalled in February. If you have recently purchased Sargento cheese, it isn’t affected by the recall. To see a full list of recalled products, you can visit info.sargento.com and search by UPC or sell-by date. Both UPC and sell-by date must match for your product to be affected.", "A 10 February 2017 Food and Drug Administration (FDA) recall notice announced what was then a current recall — but it was not in effect in May 2017:", "Deutsch Kase Haus, LLC of Middlebury, Ind. has notified Sargento Foods Inc. that a specialty Longhorn Colby cheese they supplied to Sargento must be recalled due to a potential contamination of Listeria monocytogenes. No illnesses have been reported.", "The affected retail products are Sargento Ultra Thin Sliced Longhorn Colby, 6.84 oz., UPC 4610000228, with “Sell By” dates of “12APR17B” and “10MAY17B” and Sargento Chef Blends Shredded Nacho & Taco Cheese, 8 oz., UPC 4610040041, with “Sell By” dates of “H14JUN17” and “H12JUL17.” These products were packaged at the Sargento Plymouth, Wis. facility.", "Sargento's web site reiterates that the recall occurred in February 2017, not three months later. In May 2017, representatives for the brand clarified that no recall is currently in effect, and it is unclear why the information recirculated as if it was new. The \"zombie recall\" warning is far from the first of its kind, as a similar web site caused a February 2017 scare by resurrecting outdated news of a baby wipes recall. In August and September 2017, multiple items with titles such as \"Breaking: America’s Most Popular Cheese Recalled … Immediately Throw It Away, This Can Kill Your Family\" circulated on Facebook about the same outdated recall.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]