["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Jonco Industries in Milwaukee is shown with a system of 1,980 solar panels on its roof in 2016. Such a system at Foxconn could cost $250 million to $500 million, an expert says. (Michael Sears/Milwaukee Journal Sentinel)", "Saying Wisconsin made a \"bad deal\" to bring Foxconn to the state, Democratic gubernatorial candidate Tony Evers argues Wisconsin should force the company to be the best corporate citizens in the state.", "He suggested the state put Foxconn’s \"feet to the fire\" to make the company provide high wages and benefits, as well as transportation for workers who do not live close to the Racine County plant. Then Evers took it one step further.", "\"We could compel Foxconn to put solar panels on the roof, and there'd be enough electricity generated to serve 33,000 homes in southeast Wisconsin,\" Evers said in an April 22, 2018, interview on UpFront with Mike Gousha on WISN-TV (Channel 12).", "Evers said he thinks Foxconn — which has begun work on a $10 billion facility that is to employ up to 13,000 in Racine County — is \"all in,\" so renegotiating shouldn’t jeopardize the deal.", "Can the state force such an action at this point? And, if it forced the solar panels, could the panels really power more than 30,000 homes?", "Let’s take a look.", "Asked to back up the claim, Evers spokeswoman Maggie Gau said he was drawing from a Wisconsin State Journal column from August 2017. In the piece, John Imes, executive director for the Madison-based Wisconsin Environmental Initiative, presented the idea as a hypothetical.", "\"Imagine if … all of the roofs on those facilities were covered with the latest solar panel technology?\" Imes wrote. \"The buildings would generate over 200 (megawatt-hours) of electricity each year, enough to power almost 33,000 homes.\"", "But experts say a solar system with the kind of capacity Evers describes would have to be several hundred megawatts -- unprecedented for a rooftop solar array.", "A handful of U.S. solar farms — in places like Arizona and California — have this capacity, but those are dedicated, ground-based units. PV Magazine, a solar industry publication, says the largest rooftop system now is less than 20 megawatts, though Tesla has begun work on one around 70 megawatts.", "Such a system at Foxconn could cost $250 million to $500 million, said David Feldman, an economic and financial analysis researcher with the National Renewable Energy Laboratory.", "Experts disagree on whether a system that size would be enough to power 33,000 homes.", "The planned Foxconn campus will cover about 22 million square feet, though a company spokesman declined to specify how much roof square footage will be involved (multi-story buildings would obviously reduce the available roof space).", "Two of the three solar experts we talked with said a roof around that size could feasibly provide enough power.", "Cara Marcy, renewable electricity analyst with the U.S. Energy Information Administration, said a roof at 22 million square feet -- based on the typical sunshine in Mount Pleasant -- could generate about 430,000 megawatt-hours of electricity annually.", "That’s above the roughly 300,000 megawatt-hours that 33,000 homes would need, based on the typical energy usage in Wisconsin.", "Ben Zientara, lead researcher and policy analyst for Solar Power Rocks, said a solar array could be enough to power 33,000 homes at 13 million square feet, well below the size of Foxconn. However, that would require flat-mounted arrays, which would be more susceptible to snow buildup.", "But calculations by the Wisconsin Public Service Commission, which regulates public utilities in the state, showed solar panels on 22 million square feet of roof would only generate enough electricity for about 24,000 homes, said spokesman Matthew Spencer.", "All calculations required some assumptions or approximations based on the type of solar panels — fixed or movable on one or two axes to tilt with the sun — and the space between panels. Experts also noted not all of the roof space would be usable for solar panels.", "The size of such a project means it is much more than a math problem, however.", "Marcy said it’s not realistic to describe generators in terms of homes powered because solar power is so inconsistent. It is obviously not available at night, or for long stretches of winter.", "\"The solar facilities are not necessarily generating electricity at the same time electricity is needed by the system consumer, so from that perspective I think it’s inaccurate to say it's meeting the electricity of these homes,\" she said.", "A typical solar array has a maximum capacity around 20%, meaning there is enough sunshine to generate electricity about one-fifth of the time, experts say. The National Renewable Energy Laboratory’s solar resource calculator assumes 16%, but Wisconsin would face a challenge typical high-use solar states would not — snow removal.", "Spencer, whose agency is run by three commissioners appointed by Gov. Scott Walker, said companies that install solar arrays typically use the electricity for themselves first, then sell any unused power back to the grid. Spencer said it is likely not legal for Foxconn to provide electricity directly to the public — as the claim suggests  — without going through the agency to become certified as a public utility.", "This brings us to where Evers’ claim started – whether Wisconsin \"could compel\" Foxconn to build such a thing.", "Requirements like installing solar panels could be fair game as part of negotiating an incentive package for a company like Foxconn. But for Foxconn, those negotiations are already over.", "\"Any discussions about what could have been included in that contract are hypothetical and moot at this point since the state already has an executed contract in place,\" said Mark Maley, spokesman for the Wisconsin Economic Development Corp.", "The agency is run by a 12-member board of Republican appointees, though it includes two Democratic party representatives. Maley said contracts do change in some cases, such as if the agreed-upon number of new jobs changes. That would open up a new negotiating window where changes to the agreement itself could theoretically happen.", "Jack Huddleston, emeritus professor of urban and regional planning at the University of Wisconsin-Madison, said trying to re-open negotiations now would be \"pretty risky\" for the state.", "\"The Development Agreement (DA) that was agreed to by all involved parties was a result of trade-offs made by each party,\" he said in an email. \"If Foxconn, for example, agrees to renegotiate, it may demand new requirements to compensate for the loss of previously agreed to components.\"", "Gau, the Evers spokeswoman, noted Foxconn has made investments in renewable power in other countries.", "\"If they are doing this there, why not here?\" she said in an email. \"Companies can be compelled to follow certain hiring practices like wages and employing workers from certain geographic areas, why not renewable energy for on-site sustainability or surrounding homes?\"", "Evers says the state \"could compel\" Foxconn to install solar panels, and those would have enough capacity to power 33,000 homes.", "Experts say the quoted capacity is theoretically possible, though it would be extremely expensive and vastly larger than anything put on a roof in the world to date. And the logistical issues are many.", "Meanwhile, Foxconn construction is underway and incentive agreements have been signed, so the state doesn’t appear to have a route to force such action unless outside factors lead to reopened negotiations.", "We rate Evers’ claim Mostly False.", "UpFront with Mike Gousha, WISN-12 TV, 'UPFRONT' recap: Tony Evers says he's leading field of Dems running for governor (6:50 mark), April 22, 2018", "Wisconsin State Journal, John Imes: Foxconn should take the high road, Aug. 3, 2017", "Email exchange with Matthew Spencer, spokesman for Public Service Commission of Wisconsin, May 15-30, 2018", "Email exchange with Jack Huddleston, emeritus professor of urban and regional planning, University of Wisconsin-Madison, May 17, 2018", "Email exchange with Mark Maley, spokesman for Wisconsin Economic Development Corp., May 15-17, 2018", "Email exchange with Ben Zientara, lead researcher and policy analyst for Solar Power Rocks, May 29-30, 2018", "Email exchange with Cara Marcy, renewable electricity analyst, U.S. Energy Information Administration, May 29-30, 2018", "Email exchange with David Feldman, economic/financial analysis researcher, National Renewable Energy Laboratory, May 30-31, 2018", "PV Magazine, Tesla begins installation of world’s largest rooftop PV system, March 2, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]