["Farmers across the country have been protesting against the centre’s new agricultural laws for nearly two months now. Thousands of Punjab farmers are now marching to the national capital as part of their ‘Dilli Chalo’ protest. Strong barricading, police and security forces have been deployed at the Delhi border to prevent the protestors from reaching the capital. Since the early hours of November 26, farmers tried to continue their march, tearing down the barricades at the Patiala-Ambala highway and braving rounds of water cannons and tear gas. The Indian Youth Congress shared a few pictures claiming they represent the ongoing police action on farmers. (Archive link)", "India can never forgive the govt who treats those who feed this nation like terrorists.#FarmersProtest pic.twitter.com/uMObiNtYgh", "— Youth Congress (@IYC) November 26, 2020", "Congress leader and poet Imran Pratapgarhi also tweeted a few such pictures. (Archive link)", "ये मेरे प्यारे देश की तस्वीर नहीं है, हरियाणा की सरहद है ये कश्मीर नहीं है । रोकेगा भला कौन किसानों को आने से, दिल्ली किसी के बाप की जागीर नहीं है । ~इमरान प्रतापगढ़ी pic.twitter.com/6HU6Ky0kpT", "— Imran Pratapgarhi (@ShayarImran) November 26, 2020", "Journalist Prashant Kanojia tweeted one of the photos and later took it down (archive link.) Apart from him, Congress leaders Saral Patel, Archana Dalmia, and Manish Tiwari also used similar photos in their tweets about the current farmers’ protest. Actor and singer Diljit Dosanjh also tweeted two images, one of which shows police personnel firing water cannons (archive link).", "This slideshow requires JavaScript.", "Alt News found that at least three of the photographs being shared as current are actually a few years old and taken during previous farmer rallies.", "First photo", "Alt News performed a simple reverse image search and found the photo in a number of 2018 news reports. An article in The Hindu, published on October 2, 2018, states that farmers were trying to break through the barricades at the UP-Delhi border of Ghaziabad. This prompted the police to use tear gas and water cannons to disperse the crowd. These farmers were marching in the Kisan Kranti Padyatra, which started from Haridwar on September 23, 2018. They were supposed to reach Delhi’s Kisan Ghat but were not allowed to enter the city. On October 2, 2018, NDTV reported that the farmers had gathered at the border of the state with a 15-point list of demands, including the implementation of the Swaminathan Commission report, loan waivers, and the payment of pending sugarcane dues.", "Second photo", "Another such image people are claiming is recent is actually from 2018’s Kisan Kranti Padyatra. It was taken from a different angle as farmers were trying to tear down the barricades and police were using water cannons to stop them. It was also published in Deccan Herald on October 3, 2018.", "Third photo", "An India TV report from October 2, 2018, said that this picture too represents the same protest.", "Therefore, Congress leaders falsely shared images from the farmers’ protests in 2018 as the recent march to New Delhi. This was despite the availability of several pictures from the recent protest where water cannon and tear gas were used to stop farmers from crossing Delhi border.", "Farmers brave water cannons, tear gas in march towards Delhi", "See more pictures here: https://t.co/DTohYgUxKM pic.twitter.com/3Bnfw5X6KT", "— The Indian Express (@IndianExpress) November 26, 2020", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]