["The claim was made in this report by Taiwanese news site CredereMedia. The article has been viewed almost 150,000 times on Facebook after it was published on February 21, 2020, according to statistics from social media monitoring tool CrowdTangle.", "The article's traditional Chinese-language headline translates to English as: “The first official confirmation in the world: Russian Ministry of Health says Wuhan pneumonia is caused by a man-made virus”.", "The photo in the article is captioned: “Russian health minister Mikhail Murashko (pictured left) signs a document confirming the source of the Wuhan pneumonia is a man-made recombinant virus.\"", "The article reports on Russia's measures to combat the novel coronavirus, as well as on China's denials that the virus was created as a biological weapon.", "Below is a screenshot of the misleading post alongside CrowdTangle statistics:", "The claim was also shared in Facebook groups with hundreds of thousands of followers, such as here, here, here and here. It has also circulated on Twitter here, here, here and here as well as on Instagram here and here.", "The claim is misleading.", "“The Russian Ministry of Health has never indicated that the virus was of artificial origin in its recommendations on the prevention, diagnosis and treatment of the new coronavirus,” a Ministry of Health spokesperson told AFP by email on February 27, 2020.", "Regarding the alleged document, the misleading posts refer to a report “published late January by the Russian Ministry of Health”.", "A search for “coronavirus” on the ministry’s website found the “Temporary guidelines for the prevention, diagnosis, and treatment of the new 2019-nCoV coronavirus infection”, which was published on January 30, 2020.", "“Coronavirus 20190nCov is presumably a recombinant virus, between a bat coronavirus and a coronavirus whose origin is unknown,” part of the Russian report reads in English.", "Professor William Robert Fleischmann Jr., an expert on viruses and immunology, noted in his co-authored academic book “Medical Microbiology” that recombinant viruses can form naturally.", "“Viruses are continuously changing as a result of genetic selection. They undergo subtle genetic changes through mutation and major genetic changes through recombination,” the book stated. “Mutation occurs when an error is incorporated in the viral genome. Recombination occurs when coinfecting viruses exchange genetic information, creating a novel virus.”", "A research paper published here in January 2020 in the Journal of Medical Virology also explains how recombination can be a natural process.", "The report, which is titled “Cross‐species transmission of the newly identified coronavirus 2019‐nCoV”, states that the coronavirus “may appear to be a recombinant virus between the bat coronavirus and an origin‐unknown coronavirus.”", "A claim that the deadly virus was created in a laboratory, and specifically by the US Centers for Disease Control and Prevention, was previously debunked by AFP here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]