["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump blames Hillary Clinton for the United States getting beaten by China on trade.", "\"Hillary Clinton surged the trade deficit with China 40% as Secretary of State, costing Americans millions of jobs,\" he tweeted on June 21, 2016.", "He said something similar during a speech the following day -- that \"our trade deficit with China soared 40 percent during Hillary Clinton’s time as Secretary of State -- a disgraceful performance for which she should not be congratulated, but rather scorned.\"", "To analyze Trump’s assertion, we looked at two key questions. First, did the trade deficit with China go up by 40 percent during President Barack Obama’s first term -- the period when Clinton was serving as secretary of state? And second, given how directly Trump blamed Clinton, how much responsibility does she have for the rising trade deficit?", "We found that Trump’s 40-percent figure is somewhat valid, though it depends on when you start the clock running. Where he goes wrong is saying that it’s Clinton’s fault.", "Did the trade deficit with China go up by 40 percent during Obama’s first term?", "The trade deficit with China did go up during Obama’s first term, and one can argue that the increase was as high as 40 percent.", "Here are recent statistics for the trade deficit with China as compiled by the nonpartisan Congressional Research Service:", "The rise between 2008, the last year before Obama took office, and 2012, the final year of his first term, amounted to 18.4 percent, which is less than half as big as Trump said.", "Looking instead at the period 2009 through 2013 does produce a 40 percent increase, however, and that’s in line with what Trump said. It’s worth noting that this time frame uses 2009 as the baseline year. That was the worst point of the recession, which means that the baseline that year was artificially low.", "Incidentally, the evidence for the loss of \"millions of jobs\" is somewhat mixed. The strongest support comes from an Economic Policy Institute study that found that between 2001 and 2013, the trade deficit with China \"eliminated or displaced 3.2 million U.S. jobs,\" of which 2.4 million were in manufacturing. But it’s worth noting that the Economic Policy Institute is a think tank with backing from labor unions, which are often skeptical of free-trade policies.", "Other analysts who take a more free-market orientation, such as the conservative American Enterprise Institute, argue that the connection between trade deficits and job losses is much less direct than the Economic Policy Institute study suggests.", "All told, Trump’s 40 percent figure is credible, though it’s important to note that the number is somewhat cherry-picked.", "How much responsibility does Clinton have for the rising trade deficit?", "The support for this part of Trump’s tweet is weaker.", "First off, the State Department has a voice in trade policy, but it is not the most important one.", "\"The secretary of state is only slightly involved with trade policy,\" said Joel P. Trachtman, a professor of international law at Tufts University’s Fletcher School of Law and Diplomacy. \"Trade policy is set at the presidential level, and the U.S. Trade Representative’s office otherwise has the greatest role in negotiations and agenda setting. So, among U.S. government officials, the secretary of state has a minor effect.\"", "Gary Clyde Hufbauer, a senior fellow at the Peterson Institute for International Economics, agreed. \"The secretary of state has little if any influence over trade deficits,\" he said.", "But what if Trump was saying that Clinton was part of the Obama administration, and that Obama is to blame for China’s growing trade deficit? That’s not the case, either.", "For starters, the trend lines go back long before Obama took office.", "\"The United States has been running a trade deficit since 1996, with the big drop coming after the bursting of the ‘tech bubble’ in 2001 under George W. Bush,\" said Timothy J. Sturgeon, a senior researcher at the Massachusetts Institute of Technology’s Industrial Performance Center. The statement, he said, \"is extremely misleading.\"", "Indeed, broader economic forces -- more so than an administration’s policy decisions -- tend to determine the size of trade deficits, experts said.", "\"Trade deficits are the product of three macro forces over which the secretary of state has no control -- the trade-weighted dollar exchange rate; the state of the world economy outside the United States; and the state of the U.S. economy,\" Hufbauer said.", "Other trends also complicate an easy assignment of \"blame\" for trade deficits with China, experts added.", "Martin Baily, a Brookings Institution economist, previously told us that some manufacturing job losses stem from trade, but not all. \"Part of what has happened is that there has been consolidation in the industry to take advantage of larger scale production,\" Baily said. \"Manufacturing is changing because of technology and trade, and that inevitably will lead to plant closures.\"", "Alternately, economists Robert Z. Lawrence and  Lawrence Edwards have written in the Harvard Business Review that a lack of demand led to manufacturing job losses. American factories grew to be too efficient, and therefore needed fewer workers to meet the needs of consumers, they argued.", "Finally, as we saw earlier with the data quirks around 2009, the Great Recession likely played a role in how the deficit grew during Obama’s first term.", "\"This economic expansion would be expected to expand imports more than exports would expand, and thus the trade deficit would be expected to widen, holding other things constant,\" Lawrence J. White, a professor at New York University’s Stern School of Business. \"This surely is the overwhelming reason for any expansion of the the U.S.-China trade deficit during this period.\"", "Our ruling", "Trump tweeted, \"Hillary Clinton surged the trade deficit with China 40% as Secretary of State, costing Americans millions of jobs.\"", "Trump is largely accurate about the 40 percent bump, though that number is somewhat cherry-picked, and he has a point that some -- though not all -- estimates suggest that trade with China has resulted in millions of job losses.", "However, Trump’s strong words of blame for Clinton overplays the role she had in this process. Not only do other administration players have a bigger role in setting trade policy, but the growth in the trade deficit predates the Obama administration and has a lot to do with factors that any administration would have little control over. We rate the statement Mostly False.", "Donald Trump, tweet, Jun 21, 2016", "Congressional Research Service, \"China-U.S. Trade Issues,\" Dec. 15, 2015", "American Enterprise Institute, \"Fixing US-China Trade and Investment,\" April 2016", "Economic Policy Institute, \"China Trade, Outsourcing and Jobs: Growing U.S. trade deficit with China cost 3.2 million jobs between 2001 and 2013, with job losses in every state,\" Dec. 11, 2014", "Avraham Ebenstein, Margaret McMillan, Yaohui Zhao and Chanchuan Zhang, \"Understanding the Role of China in the 'Decline' of US Manufacturing,* November 2011", "Harvard Business Review, Shattering the Myths About U.S. Trade Policy, March 2012", "PunditFact, \"MSNBC's Ed Schultz: Trade deals closed 50,000 factories,\" April 23, 2015", "PolitiFact, \"Ted Cruz pins too much blame for outflow of jobs on Barack Obama,\" March 13, 2016", "Email interview with Joel P. Trachtman, professor of international law at Tufts University’s Fletcher School of Law and Diplomacy, June 28, 2016", "Email interview with Gary Clyde Hufbauer, a senior fellow at the Peterson Institute for International Economics", "Email interview with Timothy J. Sturgeon, senior researcher at the Massachusetts Institute of Technology’s Industrial Performance Center, June 28, 2016", "Email interview with Lawrence J. White, professor at New York University’s Stern School of Business, June 28, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]