["By Lori Robertson and Robert Farley", "Posted on September 14, 2020 | Updated on September 14, 2020", "In campaign rallies in Nevada, President Donald Trump twisted remarks made by Democratic presidential nominee Joe Biden and gave a disputed description of comments by Biden’s former chief of staff.", "Trump made his claims in campaign rallies in Nevada on Sept. 12 and 13.", "Trump distorted Biden’s quote on law enforcement. The former vice president’s full comments show he was talking about the perception of law enforcement in a community if police show up in military armored vehicles.", "Here are Biden’s comments in a July 8 interview with activist Ady Barkan. Biden rattled off several policing initiatives he supported and actions taken by the Obama administration when Biden was vice president, and he said:", "Biden, July 8: Surplus military equipment for law enforcement: they don’t need that. The last thing you need is an up-armored Humvee coming into a neighborhood; it’s like the military invading. They don’t know anybody; they become the enemy. They’re supposed to be protecting these people.", "In 2015, the Obama administration adopted the recommendations of a working group to limit surplus military equipment and supplies that are provided for free to state and local law enforcement agencies under what’s called the 1033 program. Items under a “prohibited equipment list” — which included tracked armored vehicles, weaponized aircraft, grenade launchers, bayonets and firearms/ammunition of .50 caliber and above — could no longer be obtained by local law enforcement.", "Items on a “controlled equipment list” — including wheeled armored vehicles, riot shields and helmets, and explosives — could still be obtained, if police departments provided justification for them and proper training. Other items weren’t on any list and faced no new restrictions.", "In 2017, one of the authors of a study on military aid to police told us the vast majority of the military equipment provided to police departments wasn’t affected by the Obama administration’s limits.", "On Aug. 28, 2017, Trump issued an executive order rescinding those limits.", "Now, Trump is distorting Biden’s remarks on this issue, claiming in a Sept. 12 campaign rally in Minden, Nevada: “Biden called law enforcement the enemy.”", "The next day, at a rally in Henderson, Nevada, Trump repeated the claim, saying: “He even called law enforcement the enemy recently. You saw that? The enemy, until his polls started dropping. Then all of a sudden, he said, ‘No, we love law enforcement.’”", "On Twitter a day after Biden’s July interview, Vice President Mike Pence and White House Press Secretary Kayleigh McEnany similarly took Biden’s words out of context. McEnany claimed that Biden “says police have ‘become the ENEMY.'”", "But it’s clear from Biden’s full remarks that he was talking about communities perceiving police who arrive in “an up-armored Humvee” as the enemy. It wasn’t a comment about police generally.", "Update, Sept. 14: Biden campaign spokesperson Rosemary Boeglin told us in a statement: “For years, Biden has opposed providing police with equipment that only belongs in war zones — and was remarking that doing so can create and deepen divides between communities and the officers who serve them. That’s why Biden has long advocated for community policing strategies that strengthen relationships and foster trust.”", "Biden’s former chief of staff, Ron Klain, said Trump is taking out of context comments he made in 2019 that the Obama administration “did every possible thing wrong” during the 2009 H1N1 “swine flu” outbreak. Klain told us he was talking specifically about delays in the rollout of the vaccine, not the overall administration response.", "During his Sept. 12 Nevada rally, Trump cited the Klain quote as evidence that Biden “was a complete disaster on the swine flu,” which the CDC estimates killed more than 12,000 people in the U.S.", "Trump, Sept. 12: When Biden was vice president, he was a complete disaster on the swine flu, which was a much easier thing to handle. Joe Biden’s own chief of staff said that when Biden managed swine flu in 2009, they quote, “Did every possible thing wrong.” This is the guy that worked for him in charge of the swine flu. And 60 million Americans got H1N1 in a period of time. … He said it was just, we were lucky. He said, “It’s just lucky that there weren’t great mass casualties.” Different kind of a disease, a little bit. And what he said is amazing. He said we did nothing right.", "Trump is referring to Klain’s comments at a May 14, 2019, Pandemic and Biosecurity Policy Summit. When the H1N1 “swine flu” pandemic hit the U.S. in 2009, Klain was serving as the vice president’s chief of staff. He said he was not directly involved in the H1N1 response, but had a good view of it as a White House staffer.", "May 14, 2019: What I will say about it is a bunch of really talented, really great people working on it and we did every possible thing wrong. And it’s, you know, 60 million Americans got H1N1 in that period of time, and it’s just purely a fortuity that this isn’t one of the great mass-casualty events in American history. [It] had nothing to do with us doing anything right; just had to do with luck. And so, if anyone thinks that this can’t happen again, they don’t have to go back to 1918. They just have go back to 2009, 2010. Imagine a virus with a different lethality, and you can just do the math on that.", "Klain, a Biden campaign adviser, told us via email that Trump is continuing “to selective quote and take my words out of context.”", "“I was talking about the vaccine, not the overall approach,” Klain said. “The vaccine got delayed. The administration got testing up and going well, and a general public health response going well.”", "Dissemination of a vaccine for the H1N1 virus was slowed in the fall of 2009 due to manufacturing delays, CNN reported at the time, and the vaccine was not available when it would have been most effective. According to the Centers for Disease Control and Prevention, while a vaccine was produced, “it was not available in large quantities until late November—after the peak of illness during the second wave had come and gone in the United States.”", "Klain’s comments following his assessment that “we did every possible thing wrong” focused solely on the rollout of vaccines.", "“What did that [the experience in 2009] tell us? It told us that the vaccine will arrive late,” Klain said at the pandemic policy summit. “It told us that if it’s not prepared in advance, it will arrive late. We don’t have the answer before, we’re not going to get the answer in time. And it told us that our systems for deciding how to distribute and administer a vaccine at a time of crisis are going to be badly, badly tested.”", "“It also told us one other thing,” Klain said,” that we really lack a global policy mechanism for dealing with these untested vaccines in an emergency situation.”", "In worldwide distribution, he said, who would be liable if people got sick from the vaccine, and who would own intellectual property for the results from a vaccine?", "“The vaccine didn’t arrive for us in time,” Klain said. “It got in time to Europe, and then there’s a big controversy over whether or not it could be administered. What was the regulatory approvals, so on and so forth? I mean, this has been a life or death situation. … The absence of policy would have killed people. … One thing we know for sure is, if we have to deal with it in the moment, it’s going to be very bad.”", "Those comments – which immediately followed the quotes cited by Trump and focused on rollout of a vaccine — lend credence to Klain saying his comments that “we did every possible thing wrong” were about the vaccine.", "In an May article in Politico, Klain said his comments were only about difficulties in manufacturing enough of a vaccine to match demand. “The Obama team, he says, quickly adapted to the situation, making choices that were starkly different from those the Trump administration would make 11 years later, such as quickly distributing emergency equipment from the federal stockpile, deferring to public health experts and having them take the lead on messaging,” Politico reported.", "Klain has been extremely critical of Trump’s response to the coronavirus pandemic.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]