["BJP Mahila Morcha national in-charge of social media, Priti Gandhi, tweeted a photograph of the former Pakistani cricket team offering namaz. She wrote, “Picture of Pakistan cricket team during Inzamam-ul-Haq’s captaincy. Hindu Danish Kaneria & Christian Yousuf Youhana were asked to offer Namaz. #IndiaSupportsCAA“", "Picture of Pakistan cricket team during Inzamam-ul-Haq’s captaincy. Hindu Danish Kaneria & Christian Yousuf Youhana were asked to offer Namaz. #IndiaSupportsCAA pic.twitter.com/FEYXPD0wVo", "— Priti Gandhi (@MrsGandhi) December 27, 2019", "The above image is being shared in the backdrop of a statement given by former Pakistani cricketer Shoaib Akhtar who claimed that his former Hindu teammate Danish Kaneria was discriminated by team members on the basis of his religion. Several other teammates of the ex-Pakistan cricket team refuted the allegation including former captain Inzamam-ul-Haq. Gandhi has linked the alleged discrimination faced by Kaneria with the recent row over the newly constituted Citizenship Amendment Act (2019) which grants citizenship to Hindus, Sikhs, Christians, Jains, Buddhist and Parsis from Pakistan, Bangladesh and Afghanistan.", "The picture includes (from left to right): Abdul Rauf, Inzamam-ul-Haq, Mohammad Yousuf (formerly Yousuf Youhana), Kamran Akmal and Umar Gul. Danish Kaneria, contrary to Gandhi’s claim, is not seen in the picture.", "Abdul Rauf was the then physiotherapist for the Pakistani cricket team. His facebook profile can be found here. He works at Pain Free Centre, Lahore.", "A reverse image revealed that the image shared by Gandhi is a Getty Images photo. The picture was clicked before the net practice of a Natwest International Twenty20 match at Bristol on August 27, 2006. Yousuf had announced his conversion from Christianity to Islam in September 2005 and officially changed his name from Yousuf Youhana to Mohammad Yousuf. Hence, this picture was clicked after Mohammad Yousuf’s conversion to Islam.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]