["The image was shared here, here, here and here. News websites also picked up the story and you can see archived links to their coverage here, here and here. All of them published the picture below, showing a white rocket with the Ethiopian flag near the top and on the launch platform beneath the burners. “Ethiopia” is inscribed about midway up the rocket.", "The rocket is, in fact, Chinese and was launched in 2016. A different type of Chinese rocket was used to put Ethiopia’s satellite into space.", "Deputy Prime Minister Demeke Mekonnen also shared the wrong image on his official Facebook page after attending a live broadcast of the satellite launch, which took place on 20 December 2019 in China, about 7,000km (4,350 miles) away.", "Mekonnen and other dignitaries from both countries watched from the Ethiopian space control center outside Addis Ababa, as described in this AFP report, which also contains details of the rocket that was used.", "A rough translation from Mekonnen’s Facebook post reads: “The launch of our first satellite into space is a historical step that shows that we, Ethiopians, are not afraid of the darkness but rather thirsty for brightness.”", "Beza Tesfay, general manager at the Ethiopian Space and Science Society (ESSS), downplayed the deputy prime minister’s rocket gaffe.", "In an email to AFP, she said: “It is obvious that the rocket is not ours [Ethiopia's], I took it as a reflection or expression of people's hope and dreams for the future Ethiopian space program. I don't think whoever did it wanted to claim the rocket is Ethiopian.”", "This YouTube video, with a screenshot below, shows the real rocket taking Ethiopia’s satellite into orbit.", "It is a Long March 4B rocket and took off from the Taiyuan space base, unlike the Long March 5 or Changzheng 5 in the doctored image, which is launched from Wengchang, located on the island of Hannan in south-west China.", "AFP ran a Yandex image search of the manipulated picture and found the original rocket with the Chinese flag.", "Another clue that something is amiss is the two-dimensional appearance of the Ethiopian flag. The letters spelling out Ethiopia also look flattened compared to the original Chinese inscription", "Incidentally, 2018 news reports announcing Ethiopia’s first satellite launch, archived here and here, included a different falsified image (see screenshots below).", "We ran a Yandex search and found not only is the Ethiopian flag once again added to the picture, but the “satellite” in shot is, in fact, the Russian spacecraft Soyuz TMA-7, which was launched on 1 October 2005.", "The picture was taken from the International Space Station (ISS).", "Soyuz TMA-7 was a transport mission to the International Space Station carrying two astronauts -- ISS Commander William McArthur and ISS Flight Engineer Valery Tokarev, along with Gregory Olson, an entrepreneur who fully funded his visit to space with the help of space tourism company, Space Adventures.", "The real satellite, pictured below, is called ETRSS-1 and will be controlled from the Entoto Observatory and Research Center, located in Ethiopia’s highlands north of the capital Addis Ababa.", "The observatory was opened in 2015, with most of the project funded by Ethiopian billionaire, Sheik Mohammed Al Amoudi. It made Ethiopia the only east-African nation to have developed its own observatory.", "A year later, the country became the 11th African nation to establish a space program under the banner of the Ethiopia Space Science & Technology Institute (ESSTI).", "According to AFP’s report, the 70-kilogram (154-pound) satellite was developed by the Chinese Academy of Space Technology, along with 21 Ethiopian scientists for the purpose of gathering data on the environment and weather patterns in the Horn of Africa.", "Tesfay, from the ESSS, said the satellite will have a great impact on “creating a capacity to develop a capability to transform our country's developmental sectors such as agriculture to yield better production using timely and relevant data acquired from the satellite”", "“Also, it will serve as a base, a starting point for future satellite project development.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]