["“Please do this as a preventive measures (sic) in respect of CORONAVIRUS”, reads a post on a Nigerian Facebook page shared more than 4,000 times since March 31, 2020.", "“What I am going to tell you is extremely important, which has shared to be (sic) by my Chinese business partner who lives in City near Wuhan,” explains a similar post from an account in the Philippines.", "The posts recommend several ways to “control” COVID-19, the disease caused by the most recently discovered coronavirus.", "The posts recommend drinking “hot liquids” such as tea and coffee. “Drink as much hot water as possible,” they say. “This will take the thick mucus into our stomach where … gastric juices will destroy it.”", "While health experts recommend staying hydrated, there is no evidence that drinking hot or cold water can prevent COVID-19.", "Contacted by AFP, Brandon Brown, a professor at the University of California Riverside’s Center for Healthy Communities, said there was “no need to change the temperature of your drinking water”.", "“Drinking water is always important, not just for coronavirus prevention,” he told AFP by email.", "Similarly, Jayaruwan Bandara, director of the Sri Lanka Medical Research Institute, said there was no proof that drinking tea could ward off the virus. “While drinking tea can be beneficial for one’s health, it cannot be touted as a preventive measure or a treatment in the case of COVID-19,” he told AFP by phone.", "He said the “only way” to minimise the risk of infection was to follow official advice, including washing of hands and social distancing.", "The posts also advise gargling “salt, turmeric, or any oral antiseptic” to prevent COVID-19. While gargling salt water is a common treatment for a sore throat, there is no proof that it can prevent infection from coronavirus.", "According to the World Health Organization (WHO)’s website, some traditional or home remedies can “alleviate symptoms” of COVID-19, although “there is no evidence that current medicine can prevent or cure the disease”.", "The WHO’s recommendations, as well as those of health authorities in the United States, Canada, the UK and Australia, do not list gargling as a way to prevent COVID-19.", "Be aware of #CoronaVirusFacts\n\n\t\tQ: Can gargling mouthwash protect you from infection with #coronavirus?\n\n\t\tA: No. There is no evidence that using mouthwash will protect you from infection with the new #2019_nCov pic.twitter.com/9z8K07sBqM", "AFP previously debunked similar claims that gargling salt water and vinegar could prevent the virus.", "The posts recommend boosting vitamin C consumption, for example eating citrus fruits, to “strengthen your immunity”. Although vitamin C has many health benefits, there is no evidence it can prevent COVID-19.", "Henry Chenal, director of the Integrated Bioclinical Research Centre (CIRBA) in Abidjan, Ivory Coast, told AFP that consuming a high amount of vitamin C “has never proved effective against coronavirus”.", "AFP has debunked similar claims that drinking water with lemon could prevent the disease.", "“If you touch any metallic substance the virus stays active on it for 9 hours,” the posts claim. They advise using an alcohol-based product to disinfect such surfaces.", "The World Health Organization's website says that the virus seems to behave like other coronaviruses, which survive on surfaces \"for a few hours or up to several days\", depending on factors such as the type of surface.", "AFP reported on a US study that suggested that the new coronavirus was detectable for up to two to three days on plastic and stainless steel, and for up to 24 hours on cardboard.", "The Centers for Disease Control and Prevention (CDC)’s website recommends cleaning dirty surfaces with soap and water or another detergent, then using a household disinfectant.", "“Don’t take any thing cold, is not good for your system in preventive measure against CORONAVIRUS (sic),” the posts say. They advise against consuming cold food and drink, such as ice cream.", "AFP previously debunked claims that the United Nations’ children’s fund UNICEF advised the public to avoid cold foods. The organisation rejected the rumours in a statement.", "“A recent erroneous online message circulating in several languages around the world and purporting to be a UNICEF communication appears to indicate, among other things, that avoiding ice cream and other cold foods can help prevent the onset of the disease,” it said. “This is, of course, wholly untrue.”", "To keep ourselves and our loved ones safe from #coronavirus, it is critical to seek accurate information from verified sources, such as @UNICEF or @WHO, government health officials and trusted healthcare professionals. https://t.co/eC0ODBbWYP", "COVID-19 spreads when droplets from the nose or mouth of an infected person land on another person or on a surface. The World Health Organization recommends washing your hands regularly, avoiding touching your face and keeping a distance from people who are sick.", "There is currently no vaccine or treatment for COVID-19, which has claimed more than 46,000 lives as of April 2, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]