["A video massively viral across social media channels is being shared with the recurring claim that individuals protesting against the Citizenship Amendment Act (CAA) are being paid to agitate. From a Facebook group ‘We Support Narendra Modi’, the post has received 64,000 shares. Several people commenting on the video have called for the murder of ‘such protestors’. Many others have used filthy language targeting the Muslim community.", "Amit Bajaj, the person who shared the video on the group, wrote, “This is the proof. They are being paid for rioting and stone-pelting. (ये रहा सबुत दंगा भडकाने,पत्थर मारणे के लिये दिये गये पैसे.)” The video is viral with the same message on Facebook.", "Asianet News penned an article on the video, claiming that protesters in Shaheen Bagh distributed money to women.", "Several users have also shared the video with the ‘Shaheen Bagh’ claim. This included Tarek Fatah and BJP Delhi general secretary Kuljeet Singh Chahal.", "This video from #ShaheenBagh in Delhi speaks for itself. pic.twitter.com/qBOsJutGfF", "— Tarek Fatah (@TarekFatah) February 29, 2020", "भई कोई बतायेगा ये कहाँ के लिए , क्यों पैसे बाँटे जा रहे हैं । pic.twitter.com/S0zCowZ9yL", "— Kuljeet Singh Chahal (@kuljeetschahal) February 29, 2020", "Alt News found that Chennai-based activist Chandra Mohan went to the same location and recorded a video debunking social media claims. “On that day, this was on [February] 28th, this place is basically called Babu Nagar, A block, Gali number 9. A lot of people from Shiv Vihar – the victims affected in Shiv Vihar – have come over here. A lot of them are staying here because they have lost their homes. So the people here magnanimously opened their heart and homes, and they’re all [the victims] are staying in different homes here.”", "Remember the video circulated claiming people were paid money to go to Shaheen Bagh protest. Well I’m conclusively proving it as a lie, by shooting from the same location and with the person who gave the money and explaining for what reason, with corroborative video evidences. So watch it share it and please stop sharing fake news. Thanks a lot.", "Posted by Chandra Mohan on Monday, 2 March 2020", "Chandra Mohan subsequently introduced a man named Shahzad Malik: “He is the one you saw in the video distributing cash. Mr Malik is right here. In fact, we asked him to wear the same dress so that you know we’re telling the truth.” Chandra Mohan claimed that Malik provided ration to victims but it was eventually exhausted due to the large number of victims. “This man has a big heart. He gave Rs 70,000 of his own money. He gave Rs 500 to each person…People who cannot see good in anything, because they can’t do good, they spread lies,” said Chandra Mohan.", "Below Alt News has visually compared the location as seen in the viral video and Chandra Mohan’s video. The similarities have been colour-coded.", "A broken helmet on a pile of garbage near the drain is also visible in both videos.", "Speaking with Alt News, Chandra Mohan said, “This place is in Old Mustafabad. It is called Babu Nagar, Gali number 9. I’m a social and political activist from Chennai. I came to Delhi five days ago so that I could do some relief and rescue work. I connected with some youngsters from trade unions who have been doing this work. So I joined them, we just shifted to old Mustafabad which is right next to Shiv Vihar – one of the worst affected areas. A lot of victims who lost their homes came here for refuge. We set up a relief base here. Yesterday was the first time I saw the video so I asked locals around here and one of them said they know the person who distributed the money. Since this was in the same locality where we set up our base, it wasn’t difficult for us [to debunk the video].”", "Chandra Mohan also said that Shahzad Malik, the man who was seen handing out money, has original videos of the relief work. Below is an extended version of the viral video where women can be seen standing in a queue to collect cash. In the background, women can be heard taking Shahzad’s name and the people distributing cash can be heard saying – “only those who need help.”", "We have also attached a video of ration being distributed.", "Alt News spoke with Shahzad Malik as well. He has been highlighted in red below. “I have a business of car polish. There are a lot of people here who lost their homes in the fire. Some ration was arranged from outside to be distributed to these people but there were some 100-150 women who had nothing. Some of them also had children. I could not see their plight. I went home, got money and distributed Rs 500 each. Now someone has shot the video and circulated it with a false claim. This video was shot on February 28. Only 30 seconds have been put out on social media. My video is of 3 minutes and I am also saying in the video that only the neediest should take help. But they have edited this out,” he informed.", "The misinformation that anti-CAA protesters are being paid money to agitate is repeatedly promoted on social media. This time around a video of a person giving cash to victims of Delhi riots as part of relief work was misused to propagate the same. Earlier, a video amplified by Amit Malviya – alleging that Shaheen Bagh women are receiving Rs 500 and biryani to protest – was debunked in a joint effort by Alt News and Newslaundry.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]