["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Medicaid expansion in Missouri continues to be a major item of partisan contention within the state legislature, and now, candidates for governor have begun weighing in on the issue.", "Missouri Attorney General Chris Koster, a Democratic gubernatorial candidate, recently tweeted: \"A single mother of two can’t qualify for basic healthcare through Medicaid if she makes more than $3,504 dollars a year.\"", "Koster’s statistic seemed pretty low, and we decided to take a closer look at the state’s Medicaid eligibility requirements.", "Qualifying for Medicaid in Missouri", "Across the country, eligibility for Medicaid is determined by a person's or family's yearly income compared to the Federal Poverty Level. Each state gets to decide how poor a household must be in order to qualify.", "Missouri covers children newborn to age 1 at 196 percent of the poverty level, meaning babies qualify as long as their families make just less than $40,000 dollars a year. For children 1 to 18 years old, Missouri covers them at 150 percent of the poverty level, or a yearly family income of about $30,000 dollars, according to Medicaid.gov. However, their parents are only covered if they make less than about 18 percent of the Federal Poverty Level, or about $3,600 dollars per year.", "The Missouri Department of Social Services charts income guidelines for parents to qualify for Medicaid; it shows the maximum income to qualify for a family of three is $301 dollars per month, or $3,612 dollars per year. We reached out to Koster’s campaign, but did not get a response as to where he got the number he tweeted ($3,504).", "Carolyn Orbann, associate professor of health sciences at MU, said it’s important to note that because Missouri has not expanded Medicaid, childless adults are not covered regardless of their poverty level. That’s not the case in 32 other states. \"The states that have expanded Medicaid qualify adults without children who make 138 percent of the poverty level — in some states, even those who make more than that,\" Orbann said.", "In other words, a woman without children in Illinois or Arkansas could make around $16,000 dollars per year and be covered by Medicaid, but a woman in Missouri with two children making above $3,600 would not.", "Even among states that have not expanded Medicaid, only Texas and Alabama had lower maximum income caps for parents on Medicaid than Missouri, according to the Kaiser Family Foundation, a nonpartisan information source on health issues. Kansas, which also has not expanded Medicaid, covers parents at 38 percent of the poverty level — more than double Missouri’s 18 percent of the poverty level standard.", "Our Ruling", "Koster may be off by a little more than $100 when it comes to the maximum income a single mother of two can have and still qualify for Medicaid. But his point that Missouri’s maximum yearly income for parents on Medicaid is one of the lowest in the nation is on target.", "The statement is accurate but benefits from additional context.We rate this claim Mostly True.", "Chris Koster, tweet memehttps://pbs.twimg.com/media/CZNVm9TWkAELhw4.jpg:large", "In-person interview with Carolyn Orbann, assistant teaching professor of health sciences at the University of Missouri", "Medicaid.gov, \"Medicaid and CHIP Eligibility Levels\"", "https://www.medicaid.gov/medicaid-chip-program-information/by-state/missouri.html", "Kaiser Family Foundation, \"Where are the states today? Medicaid and CHIP\" http://kff.org/medicaid/fact-sheet/where-are-states-today-medicaid-and-chip/", "Healthcare.gov, \"Federal Poverty Level\"", "https://www.healthcare.gov/glossary/federal-poverty-level-FPL/", "Missouri Department of Social Services, \"MO HealthNet for Families\"", "http://dss.mo.gov/fsd/health-care/mohealthnet-for-families.htm", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]