["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gubernatorial candidate Mary Burke has tied state budget cuts by Gov. Scott Walker to an increase in violent crime in Wisconsin.", "Compared to jobs, crime has earned scant attention in the weeks leading up to Wisconsin’s Nov. 4, 2014 gubernatorial election.", "That is, until challenger Mary Burke made a striking statistical claim on Oct. 17, 2014, during her second and final debate with Gov. Scott Walker.", "\"He cut shared revenue to municipalities, which really strained their budgets in terms of providing police and fire and local services,\" Burke said.", "\"And in fact, according to the latest FBI reports, we have seen an increase in violent crimes that's second in the Midwest. So, out of 10 Midwestern states, the second largest increase in violent crime. So, we are not doing enough.\"", "Is Burke right that funding cuts to local units of government contributed to such an increase?", "Similar claim", "Earlier this month, we rated Mostly False a similar but broader claim by the Wisconsin Professional Police Association. The union, which has endorsed Burke, said Wisconsin \"has become less safe than it was when\" Walker took office.", "As Burke did, the union cited Walker’s reduction of shared revenue -- which is general state aid to local governments not tied to a specific purpose -- by $76 million, or 9 percent. That move, made in Walker’s first state budget, was the largest such cut in at least a decade. Walker also put strict limits on how much local governments could raise property taxes.", "At the same time, Walker’s Act 10 collective bargaining reform law helped many local governments absorb at least some of the shared revenue cuts by forcing most public employees to pay more for their health and pension benefits. And Walker’s campaign argued that the state has taken other anti-crime measures, such as increased funding to fight domestic violence.", "And ultimately, local governments, using local as well as state funds, decide how much to spend on law enforcement.", "So, Burke is correct that Walker cut shared revenue to local governments. But she doesn’t provide evidence that led to significant cuts in law enforcement agencies.", "The size of Milwaukee’s police force, in fact, has remained steady, as we found in an August 2014 factcheck. There were 1,362 officers in 2010, the year before Walker took office; a dip to 1,348 in 2011, then an increase to 1,384 in 2012.", "Crime data", "As for the statistical part of Burke’s claim, the FBI includes four offenses in its count of violent crimes: murder and nonnegligent manslaughter, forcible rape, robbery and aggravated assault. The latest available figures are for 2012.", "We checked FBI figures for Wisconsin and the nine other states Burke has cited when she has made comparisons on how the state ranks in the Midwest. We found that Wisconsin’s violent crime rate in 2012 was higher than in 2010, the year before Walker took office, and higher than in 2011, his first year in office.", "State", "2010 violent crimes per 100,000 residents", "2011 violent crimes per 100,000 residents", "2012 violent crimes per 100,000 residents", "Percentage change 2010 to 2012", "Percentage change 2011 to 2012", "Illinois", "435.2", "429.3", "414.8", "-5%", "-3%", "Indiana", "314.5", "331.8", "345.7", "10%", "4%", "Iowa", "273.5", "255.6", "263.9", "-4%", "3%", "Michigan", "490.3", "445.3", "454.5", "-7%", "2%", "Minnesota", "236", "221.2", "230.9", "-2%", "4%", "Nebraska", "279.5", "253.2", "259.4", "-7%", "2%", "North Dakota", "225", "247", "244.7", "9%", "-1%", "Ohio", "315.2", "307.4", "299.7", "-5%", "-3%", "South Dakota", "268.5", "254.1", "321.8", "20%", "27%", "Wisconsin", "248.7", "236.9", "280.5", "13%", "18%", "So, whether comparing 2012 to 2010, or 2012 to 2011, the increase in Wisconsin’s violent crime rate was the second-highest among 10 Midwestern states, behind South Dakota.", "Although it isn’t part of Burke’s claim, we also found a slight increase in property crimes -- such as burglaries -- in Wisconsin in that period. The rate was 2,453.8 per 100,000 residents in 2012, the year Walker’s budget moves affecting local government took effect, up from 2,432.7 in 2011.", "As we noted in rating the police union claim, many factors -- demographics, rates of incarceration, even police misreporting offenses -- can contribute to fluctuations in the incidence of crime, which is typically viewed more as a local issue than a statewide one.", "At the same time, there is evidence that more police can be correlated with a reduction in violent crime.", "Researchers at the University of California, Berkeley, studied police departments and crime in medium and large cities from 1960 through 2010. The data suggested cities \"employ too few police\" and \"confirm a controversial finding from the previous literature that police reduce violent crime more so than property crime.\"", "Our rating", "Burke said Walker cut funding to local governments in Wisconsin, contributing to the \"second-largest increase in violent crime\" in the Midwest.", "Walker did significantly reduce general-purpose shared revenue, which local governments use to help pay for a variety of functions, including law enforcement. And the increase in Wisconsin’s 2012 violent crime compared to the previous two years was higher than all but one other Midwestern state.", "But Burke doesn’t provide evidence that the shared revenue cuts significantly reduced funding for local law enforcement, nor evidence that funding reductions necessarily lead to an increase in violent crime.", "For a statement that is partially accurate but needs more information, our rating is Half True.", "To comment on this item, go to the Milwaukee Journal Sentinel’s web page.", "C-SPAN, debate video (quote at 42:37) and transcript, Oct. 17, 2014", "Twitter, Mary Burke campaign spokeswoman Stephanie Wilson tweet, Oct. 17, 2014", "Email interview, Mary Burke campaign spokeswoman Stephanie Wilson, Oct. 20, 2014", "Email interview, Gov. Scott Walker campaign spokeswoman Alleigh Marre, Oct. 20, 2014", "PolitiFact Wisconsin, \"Violent crime in Wisconsin higher under Scott Walker actions, police union says,\" Oct. 2, 2014", "FBI, Uniform Crime Reports for states, 2010", "FBI, Uniform Crime Reports for states, 2011", "FBI, Uniform Crime Reports for states, 2012", "PolitiFact Wisconsin, \"Bob Donovan says no net gain in police officers under Milwaukee Mayor Tom Barrett,\" Aug. 18, 2014", "University of California, Berkeley, \"The effect of police on crime: New evidence from U.S. cities, 1960-2010,\" Nov. 11, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]