["Hidden amid the several hundred pages of the Cannabis Act, the short name for the bill that legalized cannabis in Canada, there is a clause that decriminalizes possession of small amounts of marijuana for minors. Although it is still technically illegal, those between the ages of 12 and 17 will not risk criminal charges if they have less than five grams of cannabis in their possession.", "According to Caryma Sa’d, a youth lawyer in Toronto who regularly deals with cannabis-related cases, clause 8.1(c) of the act is “a recognition that despite the law, there will be youth who will have cannabis in their possession, so instead of making it criminal, it’s more likely to be dealt with via a fine at the discretion of the officer.”", "The fine will vary depending on provincial or municipal bylaws. In Quebec, a young person with less than five grams of cannabis in their possession will face a $100 fine, but will not have any charges on their criminal record. Before legalization, possession could lead to a trial in youth court, and result in community service or probation.", "“Most people wouldn’t get jail time for possession, but the sentences often were harsher for minors, like one year of community service instead of three months,” Emily Chan, acting executive director of Justice for Children and Youth, a nonprofit, told AFP.", "Minors caught with more than five grams, or found sharing cannabis with another minor, will still be charged under the Youth Criminal Justice Act, which covers the prosecution of young people for criminal offences.", "It is still illegal for youth aged 12  to 17 to carry any amount of cannabis, but unlike prior to the Cannabis Act, the offence has been decriminalized.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]