["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "During a Texas Tribune Festival discussion, state Rep. Joaquin Castro suggested Texas ranks No. 1 in a dubious category for Democrats.\n\nThe San Antonio Democrat, nominated this year for a U.S. House seat, said: \"We are the state that has now gone the longest without electing a Democrat statewide. It has been since 1994 that a Democrat has been elected in Texas.\" The claim was noted for us by University of Texas journalism student Joshua Fechter.\n\nThe last Democrats were elected statewide in 1994. Those victors included Lt. Gov. Bob Bullock, Attorney General Dan Morales and State Comptroller John Sharp. In the year's marquee race, Republican George W. Bush denied Gov. Ann Richards a second term.\n\nAnd have Texas Democrats been shut out of statewide office longer than Democrats elsewhere?\n\nWe left Castro a message seeking backup information, then recalled that the Associated Press said in a July 30, 2012, news article: \"Texas Democrats have the longest losing streak in the nation in statewide elections.\" The story suggested the party’s July 31 runoff for its U.S. Senate nomination would indicate if Democrats had hopes of changing that record this year.\n\nTo gauge whether Texas has the nation’s longest current stretch of statewide Democratic also-rans, we looked first at which states have Democratic governors.Twenty states have Democratic governors, according to the National Governors Association, while Rhode Island has an Independent chief executive and the others are led by Republicans.\n\nOf the 28 states outside Texas with Republican governors, 15 have at least one Democratic senator, the Senate roster shows, as does Rhode Island. Each of these senators would have last won election in 2006 or later.\n\nThis got us down to 13 red-hued states: Alabama, Arizona, Georgia, Idaho, Indiana, Kansas, Maine, Mississippi, Oklahoma, South Carolina, Tennessee, Utah and Wyoming. But 10 of them saw Democrats elected governor later than 1995, according to information kept by the governors association.\n\nThis result left us with three states potentially more long-lastingly difficult for Democrats running statewide than Texas: Idaho, South Carolina and Utah.\n\nScratch South Carolina; Democratic Sen. Ernest \"Fritz\" Holliings won his last term in 1998, four years after the latest Texas Democrats won statewide. Hollings did not seek re-election in 2004.\n\nSimilarly, interviews confirmed, voters in Idaho and Utah elected Democrats statewide after 1994.\n\nLike Texas, Idaho last had a Democratic governor, Cecil Andrus, through 1994. But Democrat Marilyn Howard was elected superintendent of public instruction in 1998 and re-elected in 2002, serving through 2006, according to Dean Ferguson, communications director for the Idaho Democratic Party.\n\nIn Utah, lawyer and Democrat Jan Graham won her second term as attorney general in 1996, serving to 2001, according to a biographical entry on her law firm’s website. \"Graham is the only woman in Utah’s history to be elected to a statewide office,\" the entry says.\n\nAs we completed this look, Castro spokesman Cary Clack said he didn’t know how Castro learned of, or determined, this factoid.\n\nOur ruling\n\nTexas voters have not elected a Democrat to statewide office for longer than voters in any other state. Castro’s statement rates as True.", "The Associated Press, news article, \"5 things to watch for in the Texas runoffs,\" July 30, 2012 (on the Houston Chronicle website)\n\nU.S. Senate, web page, \"Senators of the 112th Congress\" (accessed Sept. 24, 2012)\n\nNational Governors Association, web pages, \"Current Governors,\" \"Former Governors’ Bios\" (accessed Sept. 24, 2012)\n\nAlabama Department of Archives and History, web page, \"Alabama Governors\" (accessed Sept. 24, 2012)\n\nState of Idaho, web page, \"Past Governors (1890 through present),\" (accessed Sept. 24, 2012)\n\nIndianapolis Star, web page, \"List of Indiana governors\" (accessed Sept. 24, 2012)\n\nU.S. Congress, web page, \"Biographical Directory of the United States Congress, Ernest Frederick Hollings\" (accessed Sept. 24, 2012)\n\nTelephone interview, Matt Lyon, executive director, Utah Democratic Party, Salt Lake City, Sept. 24, 2012\n\nTelephone interview, Matt Greene, political director, Idaho Democratic Party, Sept. 24, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]