["In the wake of the May 21, 2014 shooting on a Milwaukee playground that left a 10-year-old girl gravely wounded, a familiar debate rekindled: Are there enough cops are on the street?", "In a May 30, 2014 appearance on WTMJ-AM radio, state Assembly Speaker Robin Vos told host Charlie Sykes that \"systemic problems\" led to such incidents, including the use of plea bargains, lenient judges and diverting resources from controlling crime.", "Vos also argued Mayor Tom Barrett and Police Chief Ed Flynn should be held accountable:", "\"Remember, in the city of Milwaukee we’ve still got a mayor and a police chief who are furloughing police officers at a time when we have violence all across the city.\"", "So is Vos right? Are cops being kept off the street?", "When we asked Vos for backup, his office cited news accounts, city budget documents and testimony from Milwaukee Police Association president Michael Crivello at a Sept. 19, 2013 meeting of the city Fire and Police Commission.", "Under Barrett, the city began using the unpaid days off for all staffers in 2009 to address budget issues. Police officers have been involved, to varying degrees, since the practice began. City officials maintain that furloughs have been used selectively, at least when they come to cops.", "For instance, in the first year \"only a limited number of MPD sworn staff was required to have furloughs,\" said Mark Nicolini, the city’s budget director.", "Furloughs expanded to all officers in 2010. There were no furlough days for sworn staff in 2011 or 2012. Furloughs returned in 2013, when all police department staff took three days.", "The same number was included in the 2014 budget.", "To be sure, the furloughs are not a product of the mayor and police chief alone.", "The Fire and Police Commission unanimously approved the 2014 plan at a Sept. 19, 2013 meeting.", "And the Common Council voted 15-0 in favor of the furloughs, which for the police would save a projected $1.75 million, according to the city’s budget office. Savings from all city employees is expected to be $3.3 million.", "Furloughs and safety", "According to the Barrett administration and Police Department, the furloughs have little impact.", "Here’s what the city’s furlough policy says: \"Furloughs for furlough-eligible personnel in the Fire and Police Departments are to be scheduled in a manner designed to minimize the disruption to department operations and public safety.\"", "Flynn’s spokesman, Lt. Mark Stanmeyer, said in an email: \"Furloughs have no impact on the minimum staffing levels set and maintained by MPD.\"", "\"The operational impact of furloughs is that it becomes slightly more difficult for an officer to receive permission to use a compensatory day, vacation day, holiday or other contractually accrued leave time.  In order to mitigate this impact, furloughs are scheduled throughout the entire year.\"", "Crivello, the union president, told the commission that he opposes furloughs \"due to public safety, police safety, morale, and lack of documentation illustrating other means of budgetary relief.\"", "Asked in an interview about the city’s claim that furloughs don’t affect minimum staffing, Crivello did some basic math.", "With about 1,600 cops forced to take three days off, \"that’s 4,800 man days we’re losing to furloughs,\" he said. \"That means that every day there are 13 to 14 officers that are not on the street.\"", "He said the furloughs affect officer safety because they contribute to fewer two-man squad cars, and reduce response time for when officers call for backup assistance.", "Crivello also said furloughs also hurt morale.", "Our rating", "Vos said the mayor and police chief were furloughing police officers.", "But Vos places the blame for them solely on Barrett and Flynn, when the responsibility is shared by the council and Fire and Police Commission.  What’s more, it’s a longstanding practice to deal with budget issues and steps have been taken to mitigate the impact on public safety.", "We rate the claim Mostly True.", "Robin Vos interview, Charlie Sykes show, May 30, 2014", "Fox6.com, \"Police Association looking to halt proposal calling for police furlough days,\" Oct. 1, 2012", "Emails, Kit Beyer, communications assistant, Rep. Robin Vos, June 4, 2014", "Emails, Mark Nicolini, City of Milwaukee budget and management director, June 2, 3 and 5, 2014", "Interview, Michael Crivello, president, Milwaukee Police Association, June 5, 2014", "Milwaukee Journal Sentinel, \"How Mayor Tom Barrett’s proposed budget will affect you,\" Sept. 23, 2013", "Milwaukee Police Department 2014 Furlough Policy", "Milwaukee Fire and Police Commission meeting minutes, Sept. 19, 2013", "City of Milwaukee, Legislative Research Center, Nov. 1, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]