["Richmond Mayor Dwight Jones says the development deal that brought the Washington Redskins’ summer training camp to the city has paid off in a big way.", "\"The plan generated $40 million in new private investment in the city,\" he said in his Jan. 30 State of the City Address.", "We wondered whether Jones’ figure is correct.", "The deal, signed at the close of 2012, set up a series of agreements between the city, the Redskins and Bon Secours Richmond Health Systems involving three properties.", "The Redskins camp opened last summer on a 17-acre parcel on West Leigh Street that the city’s Economic Development Authority is leasing from the state. The city shelled out $10 million for construction of a two-story office building and practice fields.", "Bon Secours agreed to pay the city $3.2 million for the naming rights to the facility, and that’s why it’s officially called The Bon Secours Washington Redskins Training Center. The hospital system also is leasing the first floor of the new building for use as a men’s health center when the Redskins are not in their three-week training camp, a deal that could generate another $3.1 million for Richmond over six years.", "So Bon Secours will invest as much as $6.3 million in the training facility over the next six years. The city is hoping to generate more money by finding tenants for the vacant second floor of the building.", "In exchange for being the major sponsor of the Redskins camp, Bon Secours was given a 60-year lease to the city-owned Westhampton School site on Patterson Avenue to house its School of Nursing and School of Imaging.", "The final part of the deal calls for Bon Secours to expand Richmond Community Hospital in the city’s East End, which needs medical facilities.", "Jones’ claim that the plan has generated $40 million in private investment \"is based on taxable improvements\" from the development of the three properties, according to Tammy Hawley, the mayor’s press secretary.", "The figure comes from adding the projected construction prices for the improvements on each site:", "That comes to a total of $42.5 million.", "Jones spoke in the past tense, as if the investments already have been made. But in fact, very little private money has been spent so far. Construction at the Westhampton School and Richmond Community Hospital has not begun. Both projects are in planning stages with no firm dates set for start or completion, according to Charlotte Perkins, performance management officer for Bon Secours.", "In addition, the contracts for these two projects can be voided. Bon Secours can pull out of the Richmond Community Hospital expansion if it is unable to acquire needed properties. It would have to pay a $2.5 million penalty to the city over 10 years. Bon Secours can withdraw from the Westhampton School project if it is unable to meet zoning requirements.", "As for the Redskins camp, the $10 million construction cost was paid by the city, not private investors. Jones, in his speech, said Richmond has largely recouped that money through selling naming rights and leasing office space in the building to Bon Secours.", "But by the end of March, the city is due to have received only about $1.82 million. According to contracts, Bon Secours will have paid seven months rent totaling $160,400 and made the first two of four annual installments of $831,250 for the naming rights.", "We’ll mention again that Bon Secours could be obligated to make as much as $6.3 million in total rent and naming rights payments to the city through the summer of 2019. Richmond is hoping to add to its take by leasing the vacant second floor of the building at the training site. The Redskins do not pay rent for use of the building and fields during their summer training.", "If the Westhampton School project pans out, the city will receive $5,000 in annual lease payments from Bon Secours over 60 years. That comes to a total of $300,000. In addition, the hospital system has agreed to pay the city $1 million over 10 years to help public schools.", "Our ruling", "Jones said the three-part development deal that brought the Redskins training camp to Richmond \"generated $40 million in new private investment in the city.\"", "The mayor offered a solid estimate of the total construction costs. But he spoke in past tense, as if the money already has been spent. For the most part, it hasn’t.", "No start dates have been established for two of the projects totaling $32.5 million: Bon Secours’ expansion of Richmond Community Hospital and its redevelopment of Westhampton School. Important contractual conditions first must be fulfilled.", "The Redskins training facility, which opened last summer, was built with $10 million of city money. Richmond, at the end of March, will have recovered $1.82 million of that money through the sale of naming rights and the leasing of office space at the facility to Bon Secours. That number could grow to as much as $6.3 million over the next five years.", "No doubt, the three projects have the potential to generate $40 million in private investment. But the mayor is counting the checks before they’ve been written. We rate his statement Half True.", "Richmond Mayor Dwight Jones, \"2014 State of the City Address,\" Jan. 31, 2014.", "Richmond Virginia, \"Mayor Dwight C. Jones’ prepared remarks for the 2014 State of the City Address,\" Jan. 31, 2014.", "Emails from Tammy Hawley, press secretary for Mayor Jones, Feb. 4, 20 and 24, 2014.", "Resolutions and cooperation agreements on the training camp deal, resolutions 2012-236-220 and 2012-235-219, from Nov. 26 and Dec. 17, 2012.", "Richmond Times-Dispatch, \"West End school site to get new life,\" Dec. 2013.", "Richmond Times-Dispatch, \"Skins camp support split,\" October 2013.", "Richmond Times-Dispatch, \"SMG likely to take over Washington Redskins training camp,\" July 29, 2013.", "Richmond Times-Dispatch, \"Redskins deal passes after last-minute negotiations,\" Nov. 27, 2012.", "Richmond Times-Dispatch, \"Richmond council takes final steps toward Redskins training camp,\" Dec. 27, 2012.", "Richmond Times-Dispatch, \"City, hospital work to sell ‘Skins deal,\" Nov. 21, 2012.", "Interviews with James Hester, city assessor, Feb. 5 and Feb. 19, 2014.", "Legislative Information System, State Code: 58.1-3203. Taxation of certain leasehold interests; concessions, accessed Feb. 5, 2014.", "Interview with Charlotte Perkins, performance management officer for Bon Secours, Feb. 14,", "Deed of Lease, Bon Secours Washington Redskins Training Center, July 8, 2013.", "Performance Agreement, Richmond Economic Development Authority and Bon Secours, July 8, 2013.", "Naming Rights Agreement, July 8, 2013.", "Leigh Street Development Cooperation Agreement, July 3, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]