["Sen. Mitt Romney, R-Utah, cast the lone Republican vote to convict President Donald Trump in the Senate impeachment trial. (Associated Press)", "British publisher Robert Maxwell was among the early investors in Romney’s first investment fund at Bain.", "Romney had already established himself in business by the time Robert Maxwell gave him money — and Maxwell’s investment was not the first in the fund.", "Robert Maxwell died before his daughter began working with Epstein. So any alleged connection between Romney and Epstein lacks evidence.", "Before Sen. Mitt Romney made history as the lone Republican to vote to convict President Donald Trump at Trump’s impeachment trial, he became the target of social media smears.", "One attack linked the Utah senator to Ghislaine Maxwell, the woman who allegedly recruited girls and young women for Jeffrey Epstein to sexually abuse.", "The Jan. 29 post is a screengrab of what appears to be a news story or blog post featuring a photo of Maxwell. It reads, in all-caps:", "\"Epstein’s recruiter Ghislaine Maxwell’s father Robert Maxwell gave Mitt Romney his first $2M investment and started him in business.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The claim has an element of truth, but is misleading.", "The body of Robert Maxwell, a British publishing baron, was found floating in the Atlantic after he went missing off his private yacht in November 1991 and the circumstances have remained mysterious. He was an early investor in Romney’s first investment fund at the Bain Capital firm, which was pivotal in Romney’s later political career.", "But Romney had already established himself in business by the time Robert Maxwell gave him money — and Maxwell’s investment was not the first in the fund.", "Epstein, a disgraced financier, was accused of sexually abusing and trafficking underage girls. He committed suicide by hanging himself in a New York City jail cell Aug. 10.", "Ghislaine Maxwell, a British socialite, is the Oxford-educated daughter of Robert Maxwell. Her father's business empire collapsed following his death, according to ABC News, which did a series on Epstein. Ghislaine Maxwell moved to New York and became Epstein’s girlfriend. Her whereabouts are unknown.", "Ghislaine Maxwell allegedly helped recruit girls for Epstein and is being sued, along with Epstein’s estate, by three women who say they were among the victims.", "The post we’re checking shows a headline from an article on JohnBWellsNews.com, whose slogan is \"Making The News Great Again.\" That article links to a July 2012 article in The Telegraph, a London-based news organization.", "The Telegraph reported that after Romney set up the Boston consulting firm Bain Capital in 1984, Robert Maxwell invested $2 million in Romney's first private equity fund, a fund that \"launched (Romney’s) controversial career in finance.\"", "The same day, the Los Angeles Times reported that the fund had been seeded with $12 million from Bain partners and that Maxwell’s $2 million was one of the early, but certainly not the first, outside investments. After Maxwell’s death, investigators discovered Maxwell had stolen hundreds of millions of dollars from his company's pension funds.", "Romney’s fund was invested in startup companies and leveraged buyouts. It paid out an average of 173% in average annual returns over a decade and was the \"start of the private equity powerhouse that ultimately fueled Romney’s political career,\" the Times said.", "Romney was established in business before starting the fund. He worked for two years at the Boston Consulting Group and six years at the Bain & Company consulting firm before co-founding the new firm-within-a-firm, Bain Capital, in 1984.", "A Facebook post claims that Robert Maxwell — the father of the woman who allegedly recruited girls and young women for sexual exploitation by Jeffrey Epstein — gave Mitt Romney \"his first $2 million investment and got him started in business.\"", "The $2 million from Maxwell did not start Romney in business. Romney had eight years of business experience before co-founding the Bain Capital investment firm.", "Moreover, Romney’s first fund at the firm was seeded by $12 million from Bain partners, although Maxwell was one of the early outside investors.", "This statement contains an element of truth but ignores critical details that would give a different impression. We rate this Mostly False.", "Facebook, post, Jan. 28, 2020", "JohnBWellsNews.com, \"Epstein’s recruiter Ghislaine Maxwell’s father Robert Maxwell gave Mitt Romney his first $2M investment and got him started in business,\" Dec. 18, 2019", "The Telegraph, \"US Election 2012: Mitt Romney fortune built with help from Robert Maxwell and Jack Lyons,\" July 19, 2012", "ABC News, \"Victims allege Ghislaine Maxwell is purposefully evading justice system,\" Jan. 30, 2020", "Los Angeles Times, \"Bain Capital started with help of offshore investors,\" July 19, 2012", "Rolling Stone, \"Greed and Debt: The True Story of Mitt Romney and Bain Capital,\" Aug 29, 2012", "CNBC, \"Mitt Romney,\" accessed Feb. 8, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]