["On May 16, former Congress president Rahul Gandhi met a few migrant labourers near Delhi’s Sukhdev Vihar flyover. According to media reports, he interacted with them and arranged for their travel. Soon after, two images from the interaction started circulating on social media. In both the pictures, a woman is being highlighted to claim, “Where do you find labourers who travel in Innova?” The claim implies that the whole affairs was a photo-op and this woman was not a labourer but brought to the spot in a car.", "The images were also shared on a Facebook group with the same claim.", "Alt News was requested by several users on its official Android application to fact check the claim.", "With a reverse search of the image on Google, we found a set of images tweeted by the Uttar Pradesh Congress Committee President Ajay Kumar Lallu on May 16, the day Rahul Gandhi met migrant workers. In three of the four images, the woman, who is being highlighted in the images shared on social media, can be seen. Ajay Lallu said that Rahul Gandhi met migrant labourers who were walking towards Madhya Pradesh and Uttar Pradesh in Delhi’s Ashram area. “[He] stayed there for some time to understand their pain. All of these people were sent to their homes. (translated),” reads Ajay Kumar Lallu’s tweet. In two of the pictures, one can see that some people are sitting inside the car.", "दिल्ली के आश्रम इलाकें में मप्र और उप्र की ओर पैदल चल रहे प्रवासी मजदूरों से अचानक मिलने पुहंचे श्री राहुल गांधी जी।", "कुछ देर उनके साथ रुककर उनके दर्द को समझा।", "इन सभी को इनके घर भेज दिया गया है। pic.twitter.com/QZ4jENs2ZC", "— Ajay Kumar Lallu (@AjayLalluINC) May 16, 2020", "Several media outlets reported on Rahul Gandhi’s meeting with migrants. On May 16, news agency ANI also tweeted images of the meeting. While the first showed Gandhi interacting with migrants, the rest of the three images showed migrants travelling in a car. In the second picture from the left, the same woman in a green sari can be spotted. In the tweet posted below, ANI has quoted a statement from a labourer saying, “Coming from Haryana, have to go to Jhansi”. It further stated that Congress party volunteers had later arranged vehicles for the migrants to take them to their homes.", "Delhi: Congress leader Rahul Gandhi interacted with migrant labourers who were walking near Sukhdev Vihar flyover to return to their home states. Party volunteers later arranged vehicles to take them to their homes. A labourer, Monu says “Coming from Haryana,have to go to Jhansi” pic.twitter.com/SMbnejiZpK", "— ANI (@ANI) May 16, 2020", "A video report posted by Jansatta said that Rahul Gandhi had arranged cars for 25 migrants labourers to drop them home. At 1:45 minutes in Jansatt’s video report, the same woman can be seen getting inside the car. Further, migrant labourers can be heard saying that Rahul Gandhi came to meet them sometime back and that he booked a car for them which will take them to their homes. The migrants also said that they were given food, water and masks.", "Therefore, images of some migrant labourers, for whom cars were arranged to drop them home, was shared with misleading claims on social media.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]