["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An image circulating online of an overcrowded New York City subway car is legitimate. It was taken on March 30 during evening rush hour.", "New York continues to be the epicenter of the novel coronavirus in the United States, with the lion's share of cases coming from, or around, New York City.", "The city’s residents have been warned to stay home for weeks, with Gov. Andrew Cuomo formally signing a state-wide \"stay-at-home\" order on March 20 that banned all non-essential businesses from conducting in-office work and stopped all \"non-essential gatherings of individuals of any size for any reason.\"", "Yet a photo shared on Facebook April 2 showed an overcrowded NYC subway car along with a caption that seemed almost unbelievable during a time of extreme social distancing:", "\"This is NYC#2 train this afternoon!!!! And their mayor and governor wants to blame trump!!!! Damn what a disgrace!!!! Spread this far and wide!!!!\"", "The image was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "In this case, the post isn’t far off – the image is real and was taken just three days earlier, during rush hour on a Bronx-bound train on March 30.", "The photo was posted that evening on Twitter by user Hiam Abbas, who wrote:", "\"4:30 PM today, #2 BX bound train. Trains are infrequent. All cars were this crowded. Social distancing? Containment? Essential workers are at risk.\"", "4:30 PM today, #2 BX bound train. Trains are infrequent. All cars were this crowded. Social distancing? Containment? Essential workers are at risk. @NYCTSubway @WajahatAli @NYCMayor @NYGovCuomo @Gothamist @NY1 @nyc311 @nytimes @JumaaneWilliams @AOC @shaunking @NewYorker @ABC7NY https://t.co/IEx8B9KdyM pic.twitter.com/Wp7Kj5Ca8i", "Abbas’ post  includes another photo of an overcrowded train, this one heading into Manhattan during the morning commute.", "With ridership plummeting and fewer crew members working, New York’s Metropolitan Transportation Authority announced implementation of its \"essential service plan,\" which aims to  to help move healthcare workers, first responders and essential personnel while scaling back train and bus service overall; some lines are running on modified schedules and others aren’t running at all.", "But public transit is a commuting lifeline for many essential workers, and the reduction in service can make it difficult to maintain the social distancing that health officials recommend.", "The MTA responded to Abbas’ photo on Twitter, saying it would be \"escalated to supervision for investigation.\"", "In an interview with the news channel New York 1 that same day, Mayor Bill de Blasio said fewer people are riding the subway, so this kind of problem isn’t typical. He said subway cars can get overcrowded sometimes due to a train breaking down or a service delay, but he also concluded that crowding on trains was \"not acceptable.\"", "\"I understand people are trying to get somewhere, but no one should be getting on a crowded train,\" de Blasio said. \"Spread out throughout the train. Wait for the next train.\"", "According to a report by the New York Times, although overall subway ridership is down 87%, the steepest declines have occurred in richer neighborhoods.", "Manhattan, which has a median income around $80,000, saw a 75% decrease in ridership, the Times reports, while the Bronx, where the median household income is about $38,000, saw only a 55% decrease.", "The post is off on the date of the photo, but only by a few days; it was taken well into New York’s stay-at-home order. We rate it True.", "Facebook post, April 2, 2020", "Twitter Photo, March 30, 2020", "MTA, MTA Implements \"NY Essential Service Plan\" to Move Healthcare Workers, First Responders and Other Essential Personnel on Frontlines of the COVID-19 Crisis, March 24, 2020", "MTA, MTA Essential Service During the Coronavirus Pandemic, Updated April 6, 2020", "New York Times, They Can’t Afford to Quarantine. So They Brave the Subway, March 30, 2020", "Gothamist, Subway & Bus Riders Face Dangerously Crowded Conditions As MTA Reduces Service, March 30, 2020", "NYC.Gov, NY 1 Transcript: Mayor de Blasio, March 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]