["The posts, including this on Facebook from February 17, 2019, laud the man for heroism, claiming he is returning to fight militants after getting injured in the attack.", "Below is the screenshot of the misleading post.", "The caption of the post in Hindi translates as: “This is an injured army soldier coming out to fight after knowing that India has been given a free hand after Pulwama attack. He got up in middle of his treatment, came out of hospital. This is the spirit of our army, salute.\"", "At least 41 Indian soldiers were killed in the attack, on February 14, 2019. Here is an AFP report published two days after the attack.", "There are obvious signs that the photo in the misleading is not from India, including the soldier's features and those of the other men in the background.", "A reverse image search quickly confirms this, leading to many photos of the soldier indicating it was taken during a school siege in Russia's Beslan in 2004.", "Below is a screenshot from the initial reverse image search.", "AFP conducted its fact-check after Indian media outlets debunked the misleading use of the photo, and those results also showed up in the reverse image search.", "One of the fact-checks was this one by India Today.", "AFP continued to conduct its own investigation to confirm the origin of the photo.", "A search with keywords ‘Beslan school siege' and Razumovksy’ found that a New York Times article  which reported that his name was Dmitry Razumovsky.", "The report stated he was one of 11 Russian special forces who died on September 3, 2004, as they tried to rescue dozens of hostages from Chechen rebels in the southern Russian town of Beslan.", "Here is another article about him in the Russian press stating that Dmitry Razumovsky was a Russian serviceman and Lieutenant Colonel. Thirteen years ago, on 3 September 2004, he was involved in the assault on school in Beslan that was captured by terrorists. The Hero of Russia title was conferred upon him posthumously.", "Below is a screenshot of the article.", "A search on Yandex with keywords ‘Dmitry Razumovsky’ shows the same photo of him in Russian media.", "Below is the screenshot of the Yandex search results.", "There is a monument in Russia to him.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]