["A video of a dhol procession on the street was shared by Bharatiya Janata Yuva Morcha (BJYM) Telangana spokesperson Roop Darak. BJYM is the youth wing of the BJP. Darak claimed that the procession was taken out by Indians in Spain ahead of the construction of Ram Mandir in Ayodhya. His tweet drew 10,000 likes and over 77,000 views.", "Indians have already started * celebrations * in Spain on this occasion of building Rama’s temple in ram land in Ayodhya. pic.twitter.com/5RBfM238f3", "— Roop Darak BHARTIYA (@iRupND) July 28, 2020", "The foundation stone for Ram Mandir may be laid on August 5 and the event is said to have Prime Minister Narendra Modi’s attendance.", "Twitter user @RenukaJain6 who is followed by PM Modi also shared the video and claimed the same in Hindi, “स्पेन मे राम मंदिर के निमार्ण के समर्थन पर हिन्दुस्तानी लोगो द्धारा निकाला गया ढोल – नगाडे के साथ एक छोटा सा जुलूस.”", "*🚩 हर घर भगवा छायेगा – फिर से राम राज्य आयेगा…*", "स्पेन मे राम मंदिर के निमार्ण के समर्थन पर हिन्दुस्तानी लोगो द्धारा निकाला गया ढोल – नगाडे के साथ एक छोटा सा जुलूस…", "*🚩 जय श्रीराम – भारत माता की जय 🇮🇳* pic.twitter.com/3lHUN0pMAE", "— #RenukaJain (@RenukaJain6) July 27, 2020", "Facebook page ‘RSS(राष्ट्रीय स्वयंसेवक संघ)’ shared this video on July 29. Apart from this, another page ‘Gyan Sagar‘ shared the video but later took it down. However, the video had received 600 shared before it was deleted.", "The video is widely circulating on Facebook and Twitter. Alt News has also received verification requests on its mobile application.", "A keyword search on YouTube led us to the channel ‘Swargandhar Dhol Tasha Pathak’ which had uploaded the same video on October 16, 2018.", "Swargandhar is Dhol Tasha Pathak group from Mumbai. The group had uploaded a video of its Spain tour in November 2018 where the viral clip can be watched onward 14:45 minutes.", "According to a June 2018 article in Mid-Day, the group performed at the “IX International Festival Of Folklore in Lloret de Mar (June 25 to 30), a UNESCO-partnered folk music festival.” The article further said, “The group, which has departed for Spain, will give a 20-minute performance comprising traditional beats of the Powada, Puneri and yuva dhol, on two days at the festival this week. The strength of the group is 140 members, of which 30 will be performing in Spain. The group had applied to perform at this festival (they were selected for other European folk festivals too) via their website, and successfully received an invite.”", "Therefore, a video of a Mumbai-based Dhol Tasha group performing in Spain in 2018 was shared as Indians in Span celebrating the scheduled construction of Ram Mandir.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]