["About this rating", "Leaders of both parties announced that the recesses of both houses of Congress would be extended an additional two weeks due to the COVID-19 outbreak, but that legislators would continue to work remotely and would return to the Capitol sooner if needed to vote on emergency pandemic-related legislation.", "Nancy Pelosi did not unilaterally declare that Congress would be out of session during a pandemic \"unless there is an emergency.\"", "In April 2020, as much of the U.S. economy was at a standstill while the federal and state governments scrambled to deal with the COVID-19 coronavirus disease pandemic, a meme circulated via social media held that U.S. House Speaker Nancy Pelosi had declared Congress would be out of session until the following month unless an \"emergency\" arose:", "This meme was a gross distortion of what actually took place, which was not that Pelosi took it upon herself to decide no current emergency required lawmakers' attention and to adjourn Congress until the following month (a power she does not possess).", "Rather, bipartisan statements from the majority leaders of both houses of Congress — Republican Mitch McConnell for the Senate and Democrat Steny Hoyer for the House of Representatives — announced that Congress would be extending its current recess by an additional two weeks due to the COVID-19 outbreak, but legislators would continue to work remotely until May 4 unless they needed to return to Washington, D.C., earlier than that to pass emergency measures related to the pandemic.", "For example, CNBC reported the following of the House Majority Leader's statement on scheduling:", "The House will not come back to Washington until at least May 4 unless it needs to pass emergency measures to respond to the coronavirus pandemic, Majority Leader Steny Hoyer’s office told representatives.", "The chamber previously expected lawmakers to return on April 20 after an extended absence.", "House members, most of whom have been in their districts for all of April as Covid-19 spreads, will not have to travel to Washington before May 4 “absent an emergency,” the Maryland Democrat’s office said. It added that lawmakers would get “sufficient notice” if they have to travel to Washington to vote on coronavirus legislation.", "Similarly, NPR reported the following of the Senate Majority Leader's statement on scheduling:", "Senate Majority Leader Mitch McConnell announced the full Senate will not plan to return to the Capitol before May 4 -- a delay from a planned return [on April 20].", "McConnell said the decision to change the schedule was made \"following the advice of health experts\" and in consultation with Senate Minority Leader Chuck Schumer.", "McConnell, R-Ky., stressed that Congress continues to work remotely to respond to the economic impact of the coronavirus.", "\"As Senators continue working together from our home states, we must stay totally focused on fighting this pandemic and strengthening our nation. The coronavirus does not take days off and the United States Senate must not either, wherever we are,\" McConnell said in a written statement.", "The move follows a similar announcement a day earlier from House Majority Leader Steny Hoyer, D-Md., informing members the House would not return until May 4.", "Both leaders indicated that if Congress needed to act quickly on something, members would be given at least 24 hours' notice.", "Here is the full announcement issued by U.S. Senate Majority Leader McConnell on April 14, 2020, regarding scheduling:", "Since the Senate passed the historic CARES Act in late March, Senators have been working around the country to monitor its implementation and help our states and nation attack this pandemic.", "As the country continues working together to flatten the curve, following the advice of health experts, the full Senate is not expected to travel back to Washington D.C. sooner than Monday, May 4th. All members will receive at least 24 hours’ notice if this changes. This bipartisan decision reflects consultation with Leader Schumer and my colleagues in Senate leadership.", "As Senators continue working together from our home states, we must stay totally focused on fighting this pandemic and strengthening our nation. The coronavirus does not take days off and the United States Senate must not either, wherever we are.", "For example, the crucial Paycheck Protection Program (PPP), which is literally saving millions of American jobs, will run dry this week if we do not pass more funding. While other CARES Act programs such as hospital funding and assistance for state governments are just beginning to push out money, 70% of the PPP’s funding has been already allotted in just a week and a half.", "President Trump, Secretary Mnuchin, and Senate and House Republicans simply want to add more funding for this job-saving program that both parties designed together. There is no time to insist on sweeping renegotiations or ultimatums about other policies that passed both houses unanimously.", "Clean funding for worker pay in a crisis should not be controversial. I hope our Democratic colleagues will let Congress act this week. American workers deserve paychecks, not pink slips caused by political games.", "And here is the scheduling announcement issued by U.S. House Majority Leader Hoyer:", "Members are advised that absent an emergency, the House is not expected to meet prior to Monday, May 4, 2020.", "Members are further advised that if the House is required to take action on critical legislation related to the coronavirus response or other legislative priorities, Members will be given sufficient notice to return to Washington, DC.", "Further information will be provided as it becomes available.", "Congressional leaders also left open the possibility that members might return sooner than May 4 if pandemic-related legislation was ready to be voted upon:", "Pramuk, Jacob.   \"House Will Not Return to Washington Until May 4 Unless It Has to Pass ‘Emergency’ Bill.\"\r\n    CNBC.   13 April 2020.", "Walsh, Deirdre.   \"Congress Won't Return Until May, As Talks Appear yo Stall on Small Business Aid.\"\r\n    NPR.   13 April 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]