["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Reckless claims that a California law would register undocumented immigrants to vote spread online in January 2018.", "In April 2018, a new law will allow Californians to automatically register to vote when they renew their driver’s license.", "It’s intended to bolster registration in a state where voter turnout has lagged.", "A slew of conservative websites, however, have seized on the law, dubbed the California New Motor Voter Program, to make the claim this week that it will register undocumented immigrants to vote.", "They cite a separate law, AB 60, that allows undocumented Californians to apply for and obtain a state driver’s license, as alleged proof.", "This World Net Daily headline on Jan. 21, 2018 sparked the recent claims: \"California To Register Illegal Aliens To Vote – Automatically.\"", "Shortly after it was published, similar allegations were made by The New American, FoxNews.com and conservative commentators Ann Coulter and Rush Limbaugh.", "This isn’t the first wave of commentary on the topic. Similar statements were made when California passed the Motor Voter program in 2015.", "But because the claims popped up again this week, it’s time to take another look at the California laws in question and the safeguards state officials say are in place.", "We’ll also place a rating on the claim by World Net Daily.", "Background on the laws", "Democratic Gov. Jerry Brown signed AB 60 in 2013, making California the 10th state to allow driver licenses for people in the country illegally. The goal was to increase public safety and reduce penalties for undocumented immigrants who drive. As of June 2017, the state Department of Motor Vehicles had issued more than 900,000 of the licenses.", "In 2015, Brown signed the New Motor Voter law. By April, it will automatically register DMV customers to vote when they renew or obtain a driver’s license or fill out change of address forms, unless the customer opts-out.", "Under the law, the DMV would electronically send information for those eligible to register to vote -- which does not include undocumented residents -- to the California Secretary of State’s Office. That office would, in turn, verify name and citizenship information. A spokesman for that office did not respond to requests for comment this week.", "In the past, however, Secretary of State Alex Padilla has pledged the new system will be an improvement over the existing one.", "\"Automated voter registration is actually a more secure way of doing things,\" Padilla told the Huffington Post in 2015. Potential voters \"have to demonstrate proof of age, the vast majority of time people are showing a birth certificate or a passport, which also reflects citizenship. That’s arguably more secure than someone checking a box under penalty of perjury.\"", "\"Completely inaccurate\" claims", "Jessica Gonzalez, spokeswoman with the California DMV, said she’s contacted several of the websites making what she called \"completely inaccurate\" claims and asked for corrections. One, the Daily Mail, had pulled down its story, another updated its article, while she said Fox News did not immediately correct its article.", "\"Undocumented Californians are not eligible to register to vote at the DMV,\" Gonzalez told PolitiFact California. \"And we have programming measures in place to prevent that from occurring.\"", "At DMV field offices, Gonzalez said, technicians will not be able to key in any voting information for undocumented customers seeking AB 60 license renewals.", "As soon as a technician types in AB 60, the voter information section automatically gets \"greyed out\" and can’t be typed into and can’t be bypassed, the spokeswoman said. She added that the same safeguards are in place for online and mail renewals.", "\"The (mail) form won’t even have the voter information questions on it, so they won’t be able to register to vote,\" Gonzalez said.", "\"It’s really interesting how quickly false information spreads,\" she continued, \"and how difficult it is to get the correct information out there to Californians that really need to know this information.\"", "A representative for World Net Daily could not be reached for comment.", "Several fact-checking websites, from Snopes.com to The Weekly Standard, a conservative publication, examined the topic this week.", "The Weekly Standard concluded \"there is zero evidence to support that ludicrous claim.\"", "Our ruling", "Conservative news websites and commentators claimed California plans to register undocumented immigrants to vote.", "This isn’t the first time such unsubstantiated claims have been made. But the recent spat was sparked by the World Net Daily headline: \"California To Register Illegal Aliens To Vote – Automatically.\"", "In reality, the California law that goes into effect in April 2018 will automatically register only those eligible to vote when they renew or obtain a driver’s license. Undocumented immigrants are excluded. The law does nothing to change the federal requirement that one must be a U.S. citizen to register to vote.", "State officials said safeguards are already in place to prevent state DMV workers from typing in any voter information for AB 60 license holders. The state allows unauthorized immigrants to obtain a driver’s license, but explicitly excludes that group from the automatic voter registration.", "The allegations on this topic are recycled. And they’re still blatantly untrue.", "We rate World Net Daily’s claim Pants On Fire.", "PANTS ON FIRE – The statement is not accurate and makes a ridiculous claim.", "UPDATE: After we published our fact check, World Net Daily published a separate  article saying a spokeswoman for the California Department of Motor Vehicles \"cleared up an inaccuracy in WND’s initial report.\" It said the spokeswoman explained that California’s licenses for undocumented immigrants \"are not eligible for the new voter registration system.\" As of Jan. 29, 2018, World Net Daily had not updated its original report with this information.", "WorldNetDaily.com, California To Register Illegal Aliens To Vote – Automatically, Jan. 21, 2018", "World Net Daily, California: Illegals Can’t Exploit Automatic Vote Registration, Jan. 25, 2018", "NewAmerican.com,New California Law Will Automatically Register Illegal Aliens to Vote, Jan. 22, 2018", "Truth Uncensored, California Will Automatically Register All Illegal Aliens to Vote, Jan. 21, 2018", "Jessica Gonzalez, assistant deputy director, California Department of Motor Vehicles", "FoxNews.com, New California policy opens door to illegal immigrant voting, Jan. 23, 2018", "HuffingtonPost.com, Jerry Brown Signs Automatic Voter Registration In California, Oct. 10, 2015", "Los Angeles Times, Here's how California's new voter registration law will work, Oct. 16, 2015", "Snopes.com, Did California Pass a Law Allowing Undocumented Immigrants to Vote in Federal Elections?, Jan. 22, 2018", "The Weekly Standard, Fact Check: Is California Registering Illegal Aliens as Democratic Voters?, Jan. 23, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]