["• Archived versions of President Donald Trump’s Facebook page show the “political candidate” designation has been used for months.", "• Facebook did not change the designation after Trump lost the election.", "• The page still says Trump is the “45th President of the United States.”", "The election has been called for his opponent, but supporters of President Donald Trump want it acknowledged that he will remain the president right up until inauguration day — especially by major social media sites.", "After Trump lost the election to President-elect Joe Biden, some social media users have claimed that Facebook engaged in behavior that demonstrates bias against Trump", "\"This is disturbing,\" one Nov. 13 post reads. \"Facebook removed the title of ‘President’ from Donald Trump and designated him as ‘Political Candidate.’ Trump is still president and, no matter what happens, will remain so until Inauguration Day.\"", "A screenshot of the verified Donald J. Trump Facebook page — which does list Trump as a \"Political Candidate\" — accompanies the post.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The claim is inaccurate. Facebook did not change Trump’s \"President\" designation after he lost the general election.", "Archived versions of the page from several months before the election — including Jan. 15, April 1, and Sept. 29 — all show that the page has described Trump as a \"political candidate\" for some time.", "Currently, the page’s \"about\" section says Trump is the \"45th President of the United States.\" The page transparency section also indicates that Trump’s campaign committee, \"Donald J. Trump For President, Inc.\" is responsible for the page.", "A spokesperson for Facebook told PolitiFact that the designations such as \"political candidate\" aren’t determined by Facebook. It’s determined by whoever manages the page, meaning someone from Trump’s campaign committee selected that designation themselves.", "A post claims, \"Facebook removed the title of ‘President’ from Donald Trump and designated him as ‘Political Candidate.’\"", "Archived versions of the Facebook page show that Trump has had a ‘political candidate’ designation for months, as far back as at least Jan. 15, 2020. Facebook did not change the designation after Biden won the election.", "We rate this claim False.", "Facebook post, Nov. 13, 2020", "Internet Archive Wayback Machine, Donald J. Trump Facebook page, Jan. 15, 2020", "Internet Archive Wayback Machine, Donald J. Trump Facebook page, April 1, 2020", "Internet Archive Wayback Machine, Donald J. Trump Facebook page, Sept. 29, 2020", "Donald J. Trump Facebook page, Nov. 13, 2020", "Interview with Andy Stone, spokesperson for Facebook, Nov. 13, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]