["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Americans for Tax Reform says President Barack Obama has proposed 442 tax hikes since taking office.", "President Barack Obama is no stranger to the charge that he likes to raise taxes. But a new report from an anti-tax group says he’s actually proposed raising taxes more than 400 times.", "\"Obama has proposed 442 tax hikes since taking office,\" said Americans for Tax Reform in an April 14 press release.", "\"History tells us what Obama was able to do. This list reminds us of what Obama wanted to do,’\" said Grover Norquist, president of Americans for Tax Reform, in the statement.", "The group released a list of 442 measures the group considered a tax increase, divided into sections for each fiscal year’s budget from 2010 to 2015. The report is based on an analysis of the budgets the Obama administration has proposed since taking the White House.", "Americans for Tax Reform is well known for opposing tax increases. The group promotes a famous pledge, which says politicians will oppose \"any and all efforts\" to increase income taxes and will also oppose \"any net reduction or elimination of deductions and credits, unless matched dollar for dollar by further reducing tax rates.\" That means they don’t support any measure that brings more revenue into the government.", "We wondered if the group was accurate in how it was counting up Obama’s proposals. We’ve tracked Obama’s campaign promises on taxes, and while he has definitely proposed new taxes, we were suspicious that it was 442 separate tax increases. (Indeed, we track 24 campaign promises from Obama on the topic of taxes, a group that includes proposed tax hikes as well as proposed tax breaks.)", "So we decided to put Americans for Tax Reform’s number to our Truth-O-Meter.", "The list", "We started out with a close examination of the long list of proposals on their 15-page press release. Each fiscal year budget has its own section, stating the year of the proposal and the total number of measures for each year.", "The release does not elaborate on the specifics of each measure beyond briefly stating its purpose.", "We found there are plenty of measures on the list that would increase taxes. One example: Obama’s pledge to impose a so-called \"Buffett Rule,\" which would set a minimum tax rate of approximately 30 percent on millionaires.", "Also included on the list are several tax increases on the oil and gas industry, either by eliminating existing credits for oil companies or through entirely new taxes, another pledge Obama made during his presidential campaigns.", "Many items on the list, though, struck us as either double-counted or not a tax at all. Here’s a summary of some of the problems we found.", "The list counts the same proposals multiple times. Americans for Tax Reform listed a measure each time it appeared in one of Obama’s budgets. As a result, 276 of the proposals on the list have at least one match somewhere else in the document. (We didn’t include proposals that have a similar but not identical wording to others on the list.)", "Obama did propose these measures multiple times, but it is misleading to count each time he included a measure in his budget as a newly proposed tax increase.", "For example, Obama has long proposed ending a special tax category, known as \"carried interest,\" that allows hedge fund managers and other financial investors to claim lower tax rates than ordinary workers. But Congress has never signed off on getting rid of the special category. Americans for Tax Reform counts Obama’s idea four times on its list, because it has appeared in four budget proposals. But it’s really the same proposal.", "Removing duplicates eliminates about 159 of the proposals, cutting the total down to 283 proposed tax hikes.", "Americans for Tax Reform said it didn’t see these as duplicates, since Obama specifically proposed them each year in his budgets.", "\"If President Obama proposes tax increases several times in several different budgets, he deserves full credit for doing so,\" said Ryan Ellis, the group’s tax policy director, via email.", "Some items aren’t tax increases. We noticed that the list includes several administrative changes to the tax code that aren’t tax increases.  Here are a few examples:", "Require greater electronic filing of returns;", "Index all tax penalties to inflation;", "Make repeated willful failure to file a tax return a felony;", "Require e-filing by certain large organizations.", "Oddly, we found that a few measures included on the list were actually tax decreases, such as the proposal  from the president’s 2015 budget to eliminate the telephone excise tax.", "We flagged 34 of the proposals on the list as ones that either wouldn’t raise taxes or would only do so through a penalty for failing to comply with the proposal.", "Americans for Tax Reform agreed that four of the items we found were not tax increases, including the repeal of the telephone excise tax. Ellis said they would adjust their total accordingly.", "But they did feel that 11 items, including indexing tax penalties for inflation, were tax increases because they would increase revenue to the government. The other items \"fall into an area where reasonable minds can draw different conclusions,\" he said.", "The Americans for Tax Reform list also failed to account for other tax cuts that are part of Obama’s record, including nearly $220 billion in tax cuts that were part of the federal stimulus.", "We ran our findings by Eric Toder, co-director of the Urban-Brookings Tax Policy Center, and an expert on federal tax policy. He said it wasn’t useful to count tax proposals without any consideration for what’s in the proposal.", "\"This whole matter of the number of tax hikes he proposed is silly,\" Toder said via email. \"If someone raised my taxes 442 times by 1 cent each time or one time by $100,000, I think I would prefer the former to the latter.\"", "Our ruling", "Americans for Tax Reform said that \"Obama has proposed 442 tax hikes since taking office.\"", "While the list accompanying the claim does contain some proposals that would have increased taxes, it overstates the total number by a significant amount. Our analysis suggests about 200 items should be knocked off this list, because it includes the same items Obama proposed in multiple budgets and some proposals that cannot be considered tax increases. We rate this Mostly False.", "Americans for Tax Reform, Obama has Proposed 442 Tax Hikes Since Taking Office, April 14, 2014 (pdf of all proposals)", "U.S. Department of the Treasury \"General Explanations of the Administration’s Revenue Proposals,\" Fiscal Years 2013-2015", "Andrew Lundeen, \"President Obama’s Budget would raise taxes by $1.3 Trillion,\" (Taxfoundation.org article), March 7, 2014", "Tax Policy Center, \"2013 Budget Tax Proposals\"", "Tax Policy Center, \"2012 Budget Tax Proposals\"", "Rick Cohen, \"President Obama Unfurls a new Place-Based Program: Promise Zones\" (Nonprofit Quarterly article), Jan. 10, 2014", "Treasury Inspector General for Tax Administration, \"Further efforts are needed to ensure the Internal Revenue Service Prisoner File is Accurate and Complete,\" Dec. 18, 2012", "Email interview with John Kartch of Americans for Tax Reform, April 18 and 21, 2014", "Email interview with Ryan Ellis of Americans for Tax Reform, April 21, 2014", "Email interview with Eric Toder of the Urban-Brookings Tax Policy Center, April 17, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]