["The purported photos dead or affected animals have been published on multiple Facebook posts here, here and here. They have since been published thousands of times.", "Below is a screenshot of the posts:", "The captions read in part: “Huge wildfire in Australia has resulted in deaths of more than 480 milion animals.”", "Another image of two marsupials embracing, published here, here and here on Facebook, has collectively been shared tens of thousands of times.", "It is captioned: “This image sums up what's going on in Australia.  'animals with too much fear'”.", "Below is a screenshot of one of the posts:", "At least one billion animals are estimated to have died in the bushfires, which have ripped through most of southeast Australia since September last year in an unprecedented scale and intensity, AFP reported here on January 10, 2020.", "However, these photos, all of which claim to show animals impacted by the 2019-2020 bushfires in Australia, are being shared in a misleading context.", "1. Sheep burnt to death in 2013 Australian bushfires", "AFP found the photo of burnt sheep carcasses piled on a paddock on the Australian Associated Press (AAP) website here, dated January 9, 2013.", "The photo’s caption reads: “Dead sheep that were burned during a bushfire lay in a paddock near Bookham outside of Yass in New South Wales, Wednesday, Jan. 9, 2013. An estimated 10,000 sheep have died in the New South Wales bushfires.”", "Below is a screenshot comparison of the photo in the misleading Facebook post (L) and the photo on the AAP website (R):", "2. Livestock killed in 2014 South Australia bushfires", "AFP traced the photo of dead animals on a scorched field back to this ABC News report on the 2014 bushfires in South Australia.", "The photo’s caption reads: “Dead animals in a scorched field after the Bangor fire on Monday. The total damage across the state has been estimated at $10 million.”", "Below is a screenshot comparison of the photo in the misleading Facebook post (L) and the photo on the ABC News website (R):", "According to the South Australia Country Fire Service, the Bangor fire burned more than more than 35,000 hectares for 31 days, before being declared contained on February 14, 2014.", "3. Horse led away from smoke in 2019 California wildfires", "The photo of a horse being pulled away from smoke and scorched land was traced backed to this entry on the Shutterstock website, which lists the location as “Simi Valley, USA”.", "Below is a screenshot comparison of the photo in the misleading Facebook post (L) and the photo on the Shutterstock website (R):", "4. Dead cow in Australia in 2013", "This photo of a dead cow near a fence was taken in 2013 by photographer Jay Cronan on a farm in Jugiong, a village in New South Wales, Australia.", "It was published in the local newspaper, The Canberra Times, on January 9, 2013 with the caption: “Dead stock on a property near Jugiong in NSW. Photo: JAY CRONAN”.", "Below is a screenshot comparison of the photo in the misleading Facebook post (L) and the photo on The Canberra Times website (R):", "5. Emu escaping 2016 California wildfires", "The photo of an emu running through scorching trees was published here on the Reuters news agency website.", "The photo’s caption reads: “An emu runs to escape an approaching wildfire as it burns near Potrero, California, U.S. June 20, 2016.”", "Below is a screenshot comparison of the photo in the misleading Facebook post (L) and the photo on the Reuters website (R):", "Reuters has published additional, similar photos of the emu here.", "6. Indonesian officials destroy stuffed tiger by fire in 2012", "Two photos of burning animals actually show various stuffed endangered animals being burnt by Indonesian authorities after being seized in Jakarta in 2012.", "The photos can be found here and here on the website of Shutterstock photo agency, with the dateline November 12, 2012.", "Below are screenshot comparisons of the photos in the misleading Facebook posts and photos on the Shutterstock website:", "AFP previously debunked misleading claims linking the same photo to the Australian bushfires here.", "7. Rabbit suffers burns during the 2018 California wildfires", "A photo of a burnt rabbit was traced back to this entry on the website of Alamy photo agency, which states the photo was taken in California in Novermber 2018.", "The caption reads: “Malibu, California, USA. 12th Nov, 2018. A rabbit suffering from burns struggles to find safety, as the Woolsey fire continues to burn.”", "Below is a screenshot comparison of the photo in the misleading Facebook posts and photos on the Alamy website:", "8. Kangaroos embrace after being rescued from the 2009 Australian bushfires", "The photo of two young kangaroos appearing to hug was taken in 2009 by photographer Stella Reid, according to this report on the Museums Victoria website.", "The caption states: “Young kangaroos at the Wildhaven Wildlife Shelter on 13 October 2009. All of the animals at Wildhaven perished on Black Saturday, 7 February, 2009. These kangaroos were the first wildlife brought to Wildhaven following the fires.”", "Below is a screenshot comparison of the photo in the misleading Facebook posts and photos on the Museums Victoria website:", "This photo was also debunked by the AFP Factual team here, in Spanish.", "A photo showing the burnt carcass of a kangaroo joey was taken in the Adelaide Hills area of South Australia in January 2020.", "The photo was published in the local newspaper, The Advertiser, and here on the website of Newspix photo agency.", "Below is a screenshot comparison of the photo in the Facebook post (L) and the Newspix website (R):", "10. Cow killed in 2020 Australian bushfires", "A photo of a dead cow lying on its side was taken on a property in Coolagolite, New South Wales, in January 2020.", "The photo was published here by news agency Australian Associated Press.", "The caption reads: “A number of Steve Shipton's cows lay dead after being killed in his paddock during a bushfire in Coolagolite, NSW, Wednesday, January 1, 2020. Several bushfire-ravaged communities in NSW have greeted the new year under immediate threat.”", "Below is a screenshot comparison of the photo in the Facebook post (L) and the Australian Associated Press website (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]