["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A protest sign greets Gov. Rick Scott and state Sen. Joe Negron before they tour part of the St. Lucie River near Stuart,Fla, Tuesday, Aug. 20, 2013, to access the environmental impact of water being released from Lake Okeechobee. (AP Photo/J Pat Carter)", "Did Florida Gov. Rick Scott slash funding for the state’s water management oversight?", "That’s what a recent tweet by the Florida Democratic Party claimed.", "\"Rolled back safeguards and septic-tank inspections. Cut $700 million from water management. Appointed cronies who act on behalf of polluters. Banned the term ‘climate change.’\"", "\"This water crisis has a name, and it’s Rick Scott,\" it concludes. Scott, who is term-limited as governor, is challenging Democratic U.S. Sen. Bill Nelson.", "☣️ Rolled back safeguards and septic-tank inspections☣️ Cut $700 million from water management☣️ Appointed cronies who act on behalf of polluters☣️ Banned the term \"climate change\"This water crisis has a name, and it's Rick Scott. #FlaPol https://t.co/i1V93SWoge", "We’ve taken a look at some claims regarding Scott’s record on the environment before. With fears about algae blooms and red tide recently hitting the headlines, we were especially curious if Scott had actually \"cut $700 million from water management.\"", "Scott did cut $700 million in funding from water management in 2011. He also implemented changes to how water management districts are funded that affect their finances in the long-term.", "Counting up the cuts", "We began by reaching out to the Florida Democratic Party about its evidence for the claim. A party spokesperson sent us a 2018 Miami Herald column by Fabiola Santiago blaming Scott for dirty beaches, as well as a Palm Beach Post news article from 2011, near the end of Scott’s first year in office.", "That Palm Beach Post story begins with the line, \"The state's five water management districts have slashed their budgets by more than $700 million -- about 40 percent -- but Gov. Rick Scott, who initiated the cuts, wants a little more.\"", "The state’s five districts have a variety of responsibilities, from water supply and quality management to flood and natural systems management. All five districts release their budgets on their websites annually.", "The districts release data for each financial year, which runs from Oct. 1 of the previous year to Sept. 30 of the named year.", "The first budgets that Scott had a say in came in the 2012 fiscal year, from Oct. 1, 2011, to Sept. 30, 2012.", "From the 2011 to 2012 fiscal years, the budgets of all five districts were cut across the board.", "The South Florida district suffered the most in cuts. Its FY 2011 budget was $1.07 billion while its FY 2012 budget was $576.1 million. That’s a reduction of $493.9 million, or 49 percent.", "Meanwhile, the Southwest Florida district’s budget was slashed by $124.3 million in FY 2012. Combined with the $13.9 million, $35 million, and $14 million cuts to the budgets of the Suwannee River district, St. Johns River district, and Northwest Florida district, respectively, those numbers add up to just over the $700 million.", "However, since 2012, the overall budget of the five districts has risen by almost $300 million. So the difference between pre-Scott cut budgets and the current budgets is now not $700 million, but rather closer to $400 million.", "Whose responsibility is it, anyway?", "We reached out to Scott’s press secretary for comment. Lauren Schenone told PolitiFact, \"Water management districts independently create their own budgets. Their budgetary decisions, including tax and revenue collection, are ultimately made by the board of each water management district — not the governor, so they are completely wrong on this.\"", "Districts do begin the budget process themselves by creating a preliminary budget independently of the governor. But their budgets pass through a complex adoption process. They need to eventually be approved by many groups, including the Florida Senate president, the Florida House speaker, and each water management district’s governing board, whose members are appointed by the governor.", "According to section 373.536(5)(a) of the Florida Statutes, the governor has the final say \"to approve or disapprove water management district budgets in whole or in part.\" So if the governor doesn’t like a specific item in a district’s budget, he or she can veto it.", "Scott has claimed responsibility for the water management district budget cuts in the past, such as in this radio address from August 2011.", "\"I took action on the proposed budgets of Florida’s five water management districts,\" Scott said. \"All together, these budgets reflect a reduction of more than $700 million over last year.\"", "Scott also restricted how much revenue districts could collect.", "A large part of district budgets comes from revenue collected through property taxes. In 2011, Scott signed a bill into law that placed a limit on the maximum amount of property tax the districts could levy.", "That bill lowered district property tax revenues by 30 percent, or $210 million.", "\"Those (property tax) revenues have not been restored to their pre-Gov. Scott levels,\" said Aliki Moncrief, executive director of Florida Conservation Voters. \"Assuming the taxable value of Florida property stayed the same from 2011-2019, we are talking about at least $1.7 billion in lost revenue for water management districts (over the course of eight years).\"", "Scott took responsibility for those revenue cuts, too. In a June 2011 press release, he said, \"This property tax cut allows families and businesses to use more of their hard-earned money in the way they see best, rather than having to send it to a government agency.\"", "Our ruling", "The Florida Democratic Party tweeted that Scott \"cut $700 million from water management.\"", "The budgets of Florida’s five water management districts were collectively cut by over $700 million about a year into Scott’s first term. Since the governor has the final say over the water management districts’ budgets, the tweet is largely accurate.", "However, in the years since 2012, the districts’ budgets have started to rise again. The overall budget of the five districts is no longer $700 million less than the pre-Scott budget.", "We rate this statement Mostly True.", "Tweet from Florida Democrats, August 5, 2018", "Email exchange with Caroline Rowland, Communications Director, Florida Democratic Party, August 6, 2018", "Email exchange with Lauren Schenone, Press Secretary, Rick Scott for Florida, August 6, 2018", "Email exchange and phone interview with Jonathan Webber and Aliki Moncrief, Florida Conservation Voters, August 7 and 9, 2018", "Email exchange with Frank Jackalone, Diana Umpierre, and Dave Cullen, Sierra Club in Florida, August 7, 2018", "Email exchange with Katelyn Potter, Communications Director, Suwannee River Water Management District, August 8-9, 2018", "Email exchange with Sandy Bertram, District Clerk, St. Johns River Water Management District, August 8, 2018", "Email exchange with Jim Lamar, Director of Communications, Northwest Florida Water Management District, August 8, 2018", "Phone interview with Brett Cyphers, Executive Director, Northwest Florida Water Management District, August 9, 2018", "The 2018 Florida Statutes, Section 373.536: District budget and hearing thereon", "Governor Rick Scott, Weekly Radio Address, August 26, 2011", "Northwest Florida Water Management District, \"District Budget,\" accessed August 8, 2018", "Suwannee River Water Management District, \"Document Center,\" accessed August 8, 2018", "St. Johns River Water Management District, \"Financial statements,\" accessed August 8, 2018", "South Florida Water Management District, \"Budget in brief FY2010-11\"", "South Florida Water Management District, \"Budget in brief FY2011-12\"", "Southwest Florida Water Management District, \"District Approves Millage Rate and Budget,\" September 27, 2011", "Florida Department of Environmental Protection, \"Water Management Districts,\" August 30, 2017", "Florida Department of Environmental Protection, \"Water Management District Budgets,\" August 30, 2017", "Miami Herald, \"Red tide and green water? Florida beaches have a problem, and its name is Rick Scott,\" August 2, 2018", "Palm Beach Post, \"After $700M in water district cuts, Florida governor wants $2.4M more,\" December 6, 2011", "PolitiFact, \"Rick Scott touts 'record funding' for environmental protection in State of the State speech,\" March 6, 2014", "PolitiFact, \"Rick Scott says we have ‘record funding’ for the environment in Florida,\" June 8, 2015", "Florida House of Representatives, \"House of Representatives: Final Bill Analysis, SB 2142,\" May 26, 2011", "Rick Scott, Press Release: \"$210.5-Million Tax Cut: Governor Scott Signs Property Tax Relief Bill,\" June 22, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]