["About this rating", "In June 2019, a number of social media users started sharing an old satirical article from the website \"There is News\" about a trapeze artist with diarrhea who reportedly defecated on 23 people at a circus in Spain:", "“The wonderful Belgian Circus has arrived, full of magic, illusion, laughter, show, fun, with tamers and our brave trapeze artists” was the presentation of the circus, this Friday, in Valencia (Spain).", "What was not expected by the audience, children, adults and old people, is that in the middle of the show, and when it was the turn of the trapeze artists, the athletic girl suffered a fateful irreversible intestinal problem. “It’s raining shit, let’s get out of here, run away!”, were the words of the people who were under the trapeze artist, after noticing the unexpected rain. At least, 23 spectators were splashed with shit.", "This was not a genuine news story.", "This story was originally published by There Is News, a website that carries the tagline \"Not Real, but So Funny,\" in March 2019. A disclaimer on the website explains that There Is News \"is a humor site whose purpose is entertainment\" and that the content on the website is \"fiction and does not correspond to reality.\"", "The image featured in this article also doesn't show the \"Belgian Circus.\" It is available via Wikipedia where it is presented as if it shows \"Trapecistas en Circo Americano.\" The image available via Wikipedia does not blur the faces of these trapeze artists (most likely because they weren't involved in an embarrassing diarrhea-related incident):", "This isn't the first time we've encountered feces-focused satire. In October 2014, we addressed a photograph that supposedly showed a cheerleader suffering an embarrassing accident as she was thrown into the air.", "There Is News.   \"Trapeze Artist with Diarrhea Shits on 23 People.\"\r\n    4 March 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]