["At least two Facebook posts with identical wording, shared in the United States, Canada and Australia, claim to provide advice on “how to legally decline a vaccine.”", "The posts suggest that patients wishing to avoid vaccination should ask about the possibility of a “iatrogenic reaction,” or a complication caused by the vaccine.", "If the vaccine has a risk, they should play on the fact that medical doctors must abide by the Hippocratic Oath, a code of ethics for the profession that includes a pledge to refrain from causing harm.", "The posts also advise patients to ask doctors whether a vaccine contains MRC-5, which they claim are “aborted fetal cells and other DNA” contained in all vaccines.", "This series of advice is circulating as scientists around the world rush to develop a COVID-19 vaccine in a bid to counter a disease that has claimed more than 180,000 lives. There are now around 150 development projects worldwide, though only 5 have reached the stage of clinical trials.", "However, these claims are false. Vaccine legislation in these countries include legal ways to decline vaccination, but not those mentioned in the posts.", "Vaccination in Canada is only mandatory for students in Ontario, the country’s most populous province, and in the Atlantic province of New Brunswick. Nationwide, it is highly recommended.", "However, legislation in both provinces include exemption clauses based on medical, religious, or moral grounds. Neither law mentions the Hippocratic Oath or exceptions rooted in the “do no harm” doctrine.", "Increasing vaccination coverage remains a goal for Canada outlined in the National Immunization Strategy.", "The United States has the strictest immunization policy of the three countries AFP examined, with legislation in all 50 states requiring vaccination for students and permanent residency applicants.", "However, all states allow exemptions for medical reasons -- if a child is allergic to a vaccine, for instance. The District of Columbia and 45 states grant exemptions on religious grounds, and 15 states allow philosophical exemptions for personal, moral, or other beliefs, according to the National Conference of State Legislatures, a body that compiles legislation from across the country.", "Some states and employers also have vaccination requirements, particularly for doctors and nurses, according to Richard Quarterone, a spokesman for the US Centers for Disease Control and Prevention (CDC).", "State laws make no mention of avoiding vaccination by asking specific questions about MRC-5 cells or adverse reactions. Statistics on the number of exemptions granted per state can be found here.", "In Australia, the National Immunisation Program Schedule provides free vaccination for all citizens, but is not compulsory.", "In 2017, the state of New South Wales made vaccination a mandatory condition for access to childcare facilities. This amendment to the Public Health Act only allows medical exemptions.", "In the southern state of Victoria, parents must provide an Immunisation History Statement in order to enrol their children in primary schools. This law leaves schools with the option of excluding unvaccinated children in case of an outbreak.", "“While the Government supports immunisation, it is not compulsory and people maintain the right to choose whether to receive a vaccination,” a spokesperson for the Australian ministry of Health told AFP in an email.", "The posts claim that “all vaccines” contain MRC-5 cells, and describes them as “aborted fetal cells.” This is false.", "MRC-5, or Medical Research Council cell strain 5, are cells used to grow various types of vaccines in labs. MRC-5 originally came from fetal cells after their discovery in the 1960s, but have since been grown without recourse to fetal tissue.", "The History of Vaccines, an educational tool from the College of Physicians of Philadelphia, notes that “in total only two fetuses, both obtained from abortions done by maternal choice, have given rise to the human cell strains used in vaccine development.”", "MRC-5 are used in some vaccines, though not all. AFP Fact Check found nine vaccines containing MRC-5 authorized in the United States, 14 in Canada, and six in Australia.", "The posts also mention that there is always a possibility of an iatrogenic reaction to a vaccine.", "This is true of vaccines as much as of other treatments.", "“Any medication or medical procedure comes with a risk of side effects or complications,” Quarterone told AFP, suggesting those concerned about risks should weigh them in comparison to the risks associated with not immunizing a child.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]