["By Robert Farley", "Posted on November 1, 2017", "President Donald Trump criticized Sen. Chuck Schumer for helping to create the Diversity Immigrant Visa Program used by an Uzbekistan-born immigrant charged with killing eight people in New York City.", "In 1990, Schumer was instrumental in helping to create the program, which ultimately established a lottery to provide visas to qualified applicants from countries with low immigration rates. The bill that created it was supported by a bipartisan group of legislators and signed by President George H.W. Bush.", "Schumer, the Democratic leader in the Senate, also was part of the bipartisan Gang of Eight in 2013 that sponsored an immigration overhaul that would have done away with the diversity visa program.", "In a series of tweets, Trump raised the issue of the diversity visa program less than a day after the New York City terrorist attack by Sayfullo Habibullaevic Saipov, 29, an Uzbekistan native who came to the U.S. legally in 2010 through the program, according to the Department of Homeland Security.", "The terrorist came into our country through what is called the \"Diversity Visa Lottery Program,\" a Chuck Schumer beauty. I want merit based.", "— Donald J. Trump (@realDonaldTrump) November 1, 2017", "We are fighting hard for Merit Based immigration, no more Democrat Lottery Systems. We must get MUCH tougher (and smarter).  @foxandfriends", "— Donald J. Trump (@realDonaldTrump) November 1, 2017", "\"Senator Chuck Schumer helping to import Europes problems\" said Col.Tony Shaffer. We will stop this craziness!  @foxandfriends", "— Donald J. Trump (@realDonaldTrump) November 1, 2017", "Later in the day, Trump called on Congress to end the diversity visa program.", "The Diversity Immigrant Visa Program, or DV program, uses a computer lottery system to randomly issue up to 50,000 immigrant visas each year to applicants from countries with low rates of immigration to the United States. Millions of applicants annually apply for the diversity visas.", "For example, there were nearly 9.4 million qualified entries in the lottery in 2015. Visas that year were offered to residents of 182 different countries, including for 4,368 people from Uzbekistan, which had the seventh highest number from any eligible country.", "Excluded are those from countries with high rates of immigration to the U.S. In 2015, that included 19 countries, such as Mexico, India, the Philippines, China, Canada and the United Kingdom.", "The program has not been without controversy. A 2007 Government Accountability Office report warned that it was “particularly vulnerable to manipulation” and fraud risk, even though researchers had found “no documented evidence of DV immigrants from state sponsors of terrorism committing terrorist acts.” The authors note that the State Department, then under President George W. Bush, “was disappointed with the report’s findings and did not agree with the recommendations” and rejected them.", "A 2011 Congressional Research Service report similarly said that “[c]ritics of the diversity lottery warn that it is vulnerable to fraud and misuse and is potentially an avenue for terrorists, citing the difficulties of performing background checks in many of the countries eligible for the diversity lottery. Supporters respond that background checks for criminal and national security matters are performed on all prospective immigrants seeking to come to the United States, including those winning diversity visas.”", "The diversity visa program has its roots in the Immigration Act of 1990, a bipartisan bill passed in late 1990 that sought to increase and restructure immigration into the U.S.", "Earlier that year, Schumer, then serving on the House immigration subcommittee, introduced the Employment-Related Immigration Act of 1990. Part of that bill called for a special category of visas to be offered annually to “diversity immigrants” from “low-admission regions.”", "Some of that bill was later folded into the Family Unity and Employment Opportunity Immigration Act of 1990. According to the bill summary, it “[p]rovides for preference allocation systems for admission of family-sponsored, employment-based, and diversity immigrants, respectively. Bases diversity immigration on identification of low-admission states and regions.”", "The bill — which had 32 co-sponsors, including Schumer and seven Republicans — passed the House 231-192 with a majority of Democrats voting for it, and a majority of Republicans against it.", "The Senate version of the bill, the Immigration Act of 1990, sponsored by Sen. Ted Kennedy, included similar provisions for “Diversity Immigrants.” Under the bill, diversity visa applicants were required to have a high school education or its equivalent or “two years of work experience in an occupation requiring at least two years of training or experience.” It passed the Senate overwhelmingly, 89-8. The bill received wide Republican support, including from Sen. Mitch McConnell, now the Senate majority leader. It was signed into law by Republican President George H.W. Bush.", "In remarks on the Immigration Act on Oct. 26, 1990, just prior to its passage, Schumer explained his support, and his role in helping to craft portions of the bill.", "“There are certain countries that have been left out,” Schumer said. “It’s wrong that countries like Ireland or Poland or Nigeria can’t get almost any immigrants into this country, simply because the people who came from those countries came a long time ago and aren’t brothers and sisters but are rather second and third cousins.”", "Schumer said he was “proud to help put together a major portion of the bill that is going to say to Irish, to Poles, to Nigerians, ‘You’re not going to be excluded anymore.'” (See C-SPAN video at the 17:20 mark.)", "So it can rightly be said that Schumer had a hand in creating the diversity visa program. But it’s also the case that Schumer was part of the bipartisan Gang of Eight that in 2013 proposed a sweeping immigration overhaul that would have repealed the diversity visa program (see Sec. 2303).", "It’s a point that Sen. Jeff Flake, a Republican co-sponsor of the bill who has publicly repudiated Trump, made via Twitter.", "Actually, the Gang of 8, including @SenSchumer, did away with the Diversity Visa Program as part of broader reforms. I know, I was there https://t.co/QQFJzPyRzC", "— Jeff Flake (@JeffFlake) November 1, 2017", "In fact, had the Senate Gang of 8 bill passed the House, it would have ended the Visa Lottery Program AND increased merit based visas. https://t.co/o3qJHHAv1C", "— Jeff Flake (@JeffFlake) November 1, 2017", "The bill, S. 744, Border Security, Economic Opportunity, and Immigration Modernization Act, passed the Senate 68-32, but was never brought up for a vote in the House. And so the diversity visa program continued.", "During the presidential campaign, Trump repeatedly denounced the Gang of Eight bill as amnesty. In August, Trump threw his support behind the RAISE Act, a bill that seeks to halve legal immigration into the U.S. by reducing the number who gain entry based on family ties, capping the yearly number of refugees admitted and emphasizing a “merit-based” immigration system. It, too, would do away with the Diversity Immigrant Visa Program.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]