["“Robbery Gang Caught With 7, 486, 300 After Invading Two Banks In Osogbo (sic),” reads the caption on this Facebook post with 150 shares.", "Osogbo is the capital of Osun state in southwest Nigeria.", "The post, published on February 19, 2021, claims that the news report is an “exclusive” from two days earlier.", "“The Commissioner of Police in a press conference in Osogbo reported a robbery gang that was caught with a large sum of money and guns”, the post reads.", "The same image was also shared by this Facebook account, alongside a similar claim. The post suggests that the suspects are members of a “WA ZO BIA... Robbery squad”.", "Wazobia is a popular expression comprised of three separate words that all translate to “come” in English but are interpreted in Yoruba as “Wa”; in Hausa, “Zo”; and in Igbo, “Bia” – Nigeria’s three largest ethnolinguistic groups. The post is thus suggesting that the suspects hail from these three groups.", "AFP Fact Check conducted a Google search using keywords from the viral posts and found that the details mentioned in the misleading posts, including the names of the accused and the amount of money in their possession, match those in reports published by Nigeria’s daily newspapers Daily Trust and The Nation in February 2016. The Daily Trust article features the same photo shared on Facebook, while The Nation ran another photo from the scene in which the suspects are facing the camera.", "“The Commissioner of Police in Osun State, Mr Kola Sodipo has confirmed the armed robbers that attacked branches of First Bank, Skye Bank and Union bank in Ikirun, Osun State on Friday killed two policemen and two bankers before police overpowered them and killed four of them”, the report reads.", "Three of the suspects were later sentenced to death by hanging in 2020, as reported by Nigerian newspapers The Guardian and The Punch. AFP Fact Check was not able to establish the fourth suspect’s fate.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]