["About this rating", "New USCIS guidance regarding citizenship for children of U.S. service members and government employees will affect a relatively small number of cases involving non-U.S. citizen parents or adopted foreign-born children.", "The new USCIS guidance does not eliminate ordinary birthright citizenship for children of U.S. service members and government employees who are born outside the U.S.", "On Aug. 28, 2019, a tweet from the San Francisco Chonicle's Tal Kopan reported that newly issued guidance from the United States Citizenship and Immigration Services (USCIS) meant that children born to U.S. service members stationed outside the United States would not automatically be considered U.S. citizens:", "Today USCIS issued guidance that DHS \"no longer considers children of U.S. government employees and U.S. armed forces members residing outside the United States as 'residing in the United States' for purposes of acquiring citizenship” --https://t.co/IRNR21Qm4P", "— Tal Kopan (@TalKopan) August 28, 2019", "This story was picked up by other news outlets, such as Task and Purpose, which reported it as fact:", "Children of US troops born overseas will no longer get automatic American citizenship, Trump administration says", "Children born to U.S. service members and government employees overseas will no longer be automatically considered citizens of the United States, according to policy alert issued by U.S. Citizenship and Immigration Services (USCIS).", "Previously, children born to U.S. citizen parents were considered to be \"residing in the United States,\" and therefore would be automatically granted citizenship under Immigration and Nationality Act 320. Now, children born to U.S. service members and government employees, such as those born in U.S. military hospitals or diplomatic facilities, will not be considered as residing in the U.S., changing the way that they potentially receive citizenship.", "However, some outlets such as NBC then tweeted corrections and said the new policy only applied to children adopted by service members stationed overseas:", "Correction: Experts who have looked at new USCIS policy say it applies if a service member adopts a child overseas, but children born to service members on deployment would still automatically get citizenship. I deleted tweets with the incorrect info. https://t.co/xeu8I3zrkJ", "— Ken Dilanian (@KenDilanianNBC) August 28, 2019", "NBC News' subsequent update noted that the changes would not in fact apply to the majority of children born to U.S. two citizens serving abroad, but primarily to children born to non-citizen parents:", "The new rules apply to children who were not born as citizens — such as those who were born to non-citizens and later adopted by U.S. citizens serving abroad, or in cases where parents who were not citizens at the time of the child's birth but were later naturalized.", "In such cases, the agency will not automatically grant the residency status needed for citizenship to those children. Instead, those parents will have to apply for their children's citizenship and prove that they meet the legal requirements. Children of U.S. citizens who do not meet technical residency requirements would also be affected.", "Nonetheless, because the wording of the changes were not easy to grasp, the new guidance, which came in different stages through the day and had to be clarified by the agency, caused widespread confusion and criticism as word of the change spread through social media.", "The Military Times reported that the policy change would affect children born to persons who are serving in the U.S. military but are not themselves U.S. citizens:", "This policy update does not affect anyone who is born a U.S. citizen, period,\" Ken Cuccinelli, acting director of U.S. Citizenship and Immigrant Services, said in a statement.", "“This only affects children who were born outside the United States and were not U.S. citizens.”", "Examples of that situation include:", "o A U.S. service member and partner, or a dual-military couple, stationed in South Korea, who adopt a local South Korean child; or,", "o A non-citizen U.S. service member and partner, or non-citizen dual-military couple, who have a child while serving in Germany.", "The policy won’t affect children born to U.S. citizens serving abroad. Those children are still entitled to automatic citizenship, officials said.", "But the new policy places an unfair burden on children born to non-citizen service members, according to a spokesman for a D.C.-based federal employment and military law firm.", "“If both parents are U.S. citizens, their children have derivative citizenship regardless, so this is a penalty placed upon those who would serve their country and who do not have a say where they are stationed,” Shaun May of the Federal Practice Groups told Military Times in a statement.", "An Associated Press report observed that the policy change would likely \"affect between 20 and 25 people per year\":", "There is a policy change and it will affect between 20 and 25 people per year, officials said.", "The change is a residency requirement shift and affects U.S. service members or government employees who are green cardholders and have a child while on duty overseas or adopt a child who is not a citizen or are the stepparent of a foreign-born child.", "Previously, the agency essentially waived U.S. residency requirements for those people to apply for a passport for their child, but the officials said the State Department would then decline the application for not fitting the requirements.", "On Aug. 29, the USCIS released a graphic explaining precisely who will be affected by the policy change, and how:", "Courtesy of U.S. Citizenship and Immigration Services", "Gamboa, Suzanne.   \"Trump Administration Policy Change on Children's Citizenship Causes Widespread Confusion.\"\r\n    NBC News.   28 August 2019.", "Myers, Meghann.   \"New Immigration Policy Withholds Automatic Citizenship for Some Children of Troops Overseas, But Not All.\"\r\n    Military Times.   28 August 2019.", "Long, Colleen.   \"US Military Kids Rule Doesn’t Change Birthright Citizenship.\"\r\n    Associated Press.   29 August 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]