["About this rating", "Judge William H. Pryor of the 11th Circuit U.S. Court of Appeals has been in the news lately, both because his name reportedly appeared on President-Elect Donald Trump's definitive list of potential Supreme Court nominees, and because while serving as Alabama's attorney general Pryor filed an amicus brief in support of a Texas anti-sodomy law.", "It was with some sense of irony, then, that in November 2016, an old image purportedly showing William Pryor posing nude for a gay porn magazine as a young man was recirculated online in November 2016:", "Over 50,000 shares, 450+ comments and one Ellen Page mention later, it’s clear you folks are really responding to our original Bill Pryor story. (Quick Recap: William H. Pryor Jr., one of Trump’s prospective Supreme Court nominees, issued a legal brief in 2003 that upheld a Texas law criminalizing consensual LGBT sex, which he compared to “polygamy, incest, pedophilia, prostitution, and adultery”. What’s more, he argued that states should be able to prosecute gay people as criminals. According to Pryor then, LGBT people as a group were not protected by the Constitution.)", "Well it’s been little more than 24 hours and already new reports have sprung up about Donald Trump’s prospective Supreme Court nominee. Pryor is rumored to have appeared in a nudie magazine in the ‘80s, a claim he has vehemently denied.", "The rumor that Pryor once posed nude for a gay porn magazine originated with a web site called \"Legal Schnauzer\" back in 2013. That web site claimed that the photograph \"likely appeared in at least one print publication in the 1980s\" and was later published by the web site Badpuppy.com in 1997. However, the former reference is too vague to verify, and we were unable to find the image on Badpuppy. (Legal Schnauzer claims the image was removed from Badpuppy, but not before the Alabama Bureau of Investigations managed to capture a screenshot of it.)", "The only copy of the photograph we could find unconnected to Legal Schnauzer's posting appeared on the web site p-gay.com in a gallery of black and white nude images:", "The assertion that the above-displayed photograph is a picture of Judge William Pryor is based on three factors: a supposed headshot of the model appears next to the name \"Bill Pryor,\" colleagues of the judge reportedly saw the photograph and exclaimed that it looked like him, and that the model and Pryor both allegedly have \"strabismus\" (i.e., crossed-eyes):", "Is there doubt about the photographs' authenticity? Well, a major Republican political figure in Alabama was shown the pictures in the late '90s and immediately exclaimed, \"Holy Cow, That's Bill Pryor!\" A former female political journalist at a Birmingham news outlet was shown the photos and reportedly guffawed and semi-fainted at the same time. Did either of those insiders express any doubt that it was Bill Pryor in the photo? Nope.", "It should be noted that the young man in the nude photos clearly has a condition called strabismus, which is a crossing of the eyes. The condition is apparent in recent photos of Pryor, although it appears he's had treatment (likely surgery) to improve the condition.", "Whatever the evidence provided by Legal Schnauzer, the alleged opinion of two unidentified officials isn't proof of anything. Furthermore, while whoever posed for the photograph may resemble Pryor at first glance, a side-by-side comparison shows that certain features (such as the nose) seemingly don't match:", "—\nBut perhaps the most unbelievable aspect of this claim is simply that this photograph, which the Alabama Bureau of Investigations (ABI) and public officials have allegedly known about since the 1990s, has never been directly linked to Pryor. The judge, who was nominated to the Eleventh Circuit by President George W. Bush in 2003, told the Justice Integrity Project in 2013 that:", "I have been smeared by a widely discredited blogger with a political agenda. His allegations have now been picked up by other bloggers. The person in the unsourced, undated photographs is not me, and I deny these allegations. I have been twice vetted by the FBI, including as recently as this past year; I have won two contested statewide elections; and I have been in the public eye for almost twenty years. I will not dignify these disgraceful accusations with any further comment.", "Kreig, Andrew.   \"Famed Conservative Federal Judge Accused of Posing Nude as a Young Man.\"\r\n    Justice-Integrity.org.   23 September 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]