["About this rating", "In November 2018, Florida undertook a full state-wide recount in several extraordinarily close election races, including the high-profile U.S. Senate contest between Democratic incumbent Bill Nelson and Republican Governor Rick Scott, as well as the contest to succeed Scott as the state's chief executive that pitted Republican former U.S. Representative Ron DeSantis against Democratic mayor of Tallahassee Andrew Gillum.", "Against the background of a complicated and intensely-scrutinized recount in a crucial swing state, allegations emerged that perceived liberal election officials in Florida were engaged in politically-motivated voter fraud.", "A particular target of criticism (not exclusively from conservatives) was Brenda Snipes, Supervisor of Elections for Broward County, whose voting machines were at the center of the 2000 presidential election recount in Florida, one of the most notorious political controversies in modern American history.", "In the first days of the 2018 recount, right-wing internet users began to share one particularly striking statistical claim, which was intended to provide evidence of electoral fraud in Broward County: \"As of 9/30/18, Broward County Florida had 1,167,982 registered voters. They turned in 1,284,780 ballots. That's 110% participation.\"", "The claim was widely repeated and shared on Facebook and Twitter, with most users explicitly citing the figures as proof of electoral fraud perpetrated by Democrats:", "We have a crises in Broward County voting. There's 1,167,982 registered voters, and 1,284,780 votes have been turned in. That's 116798 more than registered votes. If this isn't voter fraud, what it? @POTUS @VP @FoxNews", "— ??լᎥภᎠᕱ ꂅᏉᕱภᏕ?? (@Justsaytruth18) November 11, 2018", "In reality, the claim that more ballots were cast than voters registered in Broward County in the 2018 elections is false, according to official data available on 12 November 2018.", "It is accurate that as of 30 September 2018 1,167,982 active registered voters were on record in Broward County, as shown in official data published by the Florida Division of Elections (DOE). However, the number of registered voters rose in the five weeks before Election Day on 6 November. According to the web site of the Broward Supervisor of Elections, 1,182,736 registered voters (an additional 14,754) had been tallied in that county as of 12 November, and according to DOE figures, some 1,175,328 voters (an additional 7,346) had registered by Election Day.", "So, the first figure presented in the meme (1,167,982 registered voters on 30 September) was accurate but outdated. In an evaluation of voter turnout (as presented in the meme), the only relevant figures are the number of registered voters as of Election Day and the number of ballots cast.", "This second component of the meme is false. According to DOE figures, the number of ballots cast in Broward County in the November elections was 714,859 -- drastically fewer than the 1,284,780 claimed in the meme. It's not clear what the source was for the figure of \"1,284,780 ballots\" in Broward County.", "Rather than rendering \"110% participation,\" as some versions of the meme claimed, these official figures actually document a Broward County turnout rate of 60.82 percent, which was actually slightly lower than the statewide turnout rate of 62.5 percent.", "The Division of Elections data come from the relevant state-wide authority but are preliminary as of 12 November. This is because the figures do not take into account one very specific type of vote: ballots cast by overseas voters under a 10-day extension.", "This provision allows U.S. citizens registered to vote in Florida but located outside of the United States on Election Day to mail in their ballots, provided they are postmarked no later than Election Day. This cohort of ballots will then be counted 10 days later, which in the case of 2018 will be 16 November.", "The figures published on the DOE web site do not take these ballots into account and are therefore incomplete. However, the number of \"10-day\" overseas ballots is vastly unlikely to make any more than a tiny impact on the overall rate of voter turnout in Florida (and by extension, in Broward County).", "We know this because an official 2017 report by the Florida Department of State showed that in the 2016 election, Floridians overseas mailed in 77,802 valid ballots, which comprised 0.81 percent of the total of 9.6 million ballots cast throughout the state that year.", "Likewise, the recount under way on 12 November could well add somewhat to the voter turnout rate, but election officials would have to suddenly discover 578,000 uncounted ballots in order to achieve the \"110% participation\" claimed in the meme. We are willing to rule this out as a possibility.", "The claim contained in the viral meme that more votes were cast than voters registered in Broward County in November 2018 is baseless and contradicted by the best evidence available.", "Robles, Frances and Patricia Mazzei.   \"Florida Begins Vote Recounts in Senate and Governor's Races.\"\r\n    The New York Times.   10 November 2018.", "Sweeney, Dan.   \"A Look at Broward Elections Chief Brenda Snipes' Long History of Trouble.\"\r\n     The Sun-Sentinel.   9 November 2018.", "Swenson, Kyle.   \"After Trump and Scott Cry 'Fraud,' Critics Pounce on Broward County's Troubled Election History.\"\r\n    The Washington Post.   9 November 2018.", "Florida Department of State.  \"Report By the Military and Overseas Voting Assistance Task Force to the Governor, President of the Florida Senate, and the Speaker of the Florida House of Representatives.\"\r\n    June 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]