["A video of a group of men beating two police personnel is being shared in the backdrop of protests against the Citizenship Amendment Act (CAA) 2019 across the country. The group, which includes men wearing skull caps, can be heard hurling expletives. The caption shared along with video on Facebook reads, “पुलिस द्वारा चालान काटने पर मुसलमानो ने उनकी पिटाई की । जो कानून को चुनौती है । यह विडियो बताता है कि आगे हिन्दुस्तान मे क्या क्या होगा। कौन देश चलायेगा । और सबका भविष्य क्या होगा । कडवा सच यह है कि देश को बाहर से ज्यादा अन्दर से बहुत ज्यादा खतरा है । दोस्तों ईनसानीयत के नाते आपसे हाथ जोड़कर विनती है की यह विड़ीयो हर एक ग्रुप में भेजना है । कल शाम तक हर एक न्यूज़ चैनल में आना चाहिए ।”", "[Translation: Muslims beat police for issuing a challan to them. It’s an open challenge to the law and order. This video tells what is going to happen henceforth in India; who will run the country and what will be everyone’s future. The bitter truth is that the country is jeopardy from within more than outside. Friend’s for humanity’s sake, I beg you, to please send this video to every group. This should be on the news channels by tomorrow evening.]", "पुलिस द्वारा चालान काटने पर मुसलमानो ने उनकी पिटाई की । जो कानून को चुनौती है । यह विडियो बताता है कि आगे हिन्दुस्तान मे क्या क्या होगा। कौन देश चलायेगा । और सबका भविष्य क्या होगा । कडवा सच यह है कि देश को बाहर से ज्यादा अन्दर से बहुत ज्यादा खतरा है । दोस्तों ईनसानीयत के नाते आपसे हाथ जोड़कर विनती है की यह विड़ीयो हर एक ग्रुप में भेजना है । कल शाम तक हर एक न्यूज़ चैनल में आना चाहिए ।", "Posted by टीम भगवामय रामगढ शेखावाटी on Thursday, 9 January 2020", "Facebook user Nikhil Kumar posted the same video with the identical narrative on January 11. The post has garnered close to 9,200 shares and over 1 lakh views.", "Many other people on Facebook and Twitter shared the same video with the identical narrative.", "With a keyword search on YouTube, Alt News found a video report by NDTV India published on July 14, 2015. The video is over four years old and from Delhi’s Gokulpuri area.“Two traffic police cops were beaten up by a crowd in northeast Delhi’s Gokulpuri after they flagged down three men on a bike for not wearing helmets and riding triple,” reads the description posted along with the video.", "According to reports, the men in the video were stopped by the Delhi traffic police personnel for riding triple seat on a two-wheeler. An argument over issuing a challan for breaking traffic rules led to a scuffle between the offenders and the police. Later, a case was registered against three people. While two were arrested, the age of the third accused, who is believed to be a juvenile, was being investigated. The video was earlier fact-checked by Boom.", "Amidst the ongoing protest against the newly-amended Citizenship Act, a five-year-old video of men beating Delhi traffic personnel was shared with a communal narrative.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]