["In a scrum with reporters outside the U.N. General Assembly hall, President Donald Trump was asked why he held up at least $250 million in military aid to Ukraine shortly before his July phone call with Ukraine’s president that has now triggered a House impeachment inquiry.", "\"My complaint has always been — and I’d withhold again, and I’ll continue to withhold until such time as Europe and other nations contribute to Ukraine,\" Trump said Sept. 24. \"Because they’re not doing it. Just the United States. We’re putting up the bulk of the money. And I’m asking, why is that.\"", "Have Europe and other countries failed to contribute to Ukraine?", "No. While the United States has taken the lead on military aid, the Europeans, Japan and Canada have borne the brunt of economic and government restructuring aid to bolster Ukraine.", "After 2014, the European Union and its financial assistance agencies put together $15 billion mainly in loans but also in direct grants to Ukraine. Spokeswoman Maja Kocijancic told PolitiFact in statement that described it as \"the largest support package in the history of the European Union.\"", "The package includes over 2 billion euros in grants, 49 million euros to monitor the truce in Eastern Ukraine, and a 3.5 billion euros loan package to develop and restore the county’s banking, agriculture and transportation systems.", "Organization for Economic Cooperation and Development data shows that in 2016-2017, the European Union provided $425 million in development aid, with the United States spending $204 million, Germany $189 million and Japan $180 million.", "\"The Europeans did a whole lot more than the United States in terms of actual cash put into the Ukrainian budget,\" said Samuel Charap, a Ukraine analyst with RAND, a nonprofit research organization.", "In contrast, the United States has done the heavy lifting on military aid.", "In the past five years, Security Assistance Monitor, a nonprofit group, has tracked nearly $1.5 billion in defense aid to Ukraine.", "Steven Pifer, a former U.S. ambassador to Ukraine and who served in the State Department in the George W. Bush years, described a de facto division of labor.", "\"The United States provides more military assistance, while Europe provides significant reform assistance,\" Pifer said. \"Both are necessary to bolster the country’s security.\"", "Individual European nations have done some work on the military side.", "Charap noted that the United Kingdom, Canada, Poland and other countries have sent military supplies and hundreds of trainers. Chiefly, though, he said, they have worked through NATO. In 2014, at the Welsh Summit, NATO member states established five new trust funds to help Ukraine’s military, with a budget of 10 million Euros. It later created a sixth fund.", "Generally, Charap said, Europe has been cautious with direct military aid.", "\"The Europeans and particularly the Germans did not want to get involved in a proxy war,\" he said.", "Charap also said it was easier for Europe to bolster Ukraine’s civilian institutions.", "\"The Europeans have more mechanisms for nonmilitary assistance through their extensive development work in Ukraine,\" Charap said.", "Trump said the Europeans are not contributing to Ukraine and that only the United States is. In terms of military aid, the statement overlooks that NATO and individual European nations have spent over 10 million euros on equipment and training to help Ukraine’s military. However, the United States has provided the lion’s share of military aid.", "Where the statement strays widely from the facts is on the nonmilitary side. There, the countries of Europe, individually and through multilateral European bodies, have done much more for Ukraine than the United States. The foreign policy experts we reached said both kinds of aid are necessary for Ukraine’s security.", "We rate this claim Mostly False.", "RELATED STORY: Trump’s Ukraine call, a whistleblower and the Bidens: What we know, what we don’t", "RELATED STORY: Read the declassified whistleblower complaint on Ukraine, Biden and Trump", "Donald Trump, Remarks by President Trump Upon Arriving at the U.N. General Assembly, Sept. 24, 2019", "European Union, EU-Ukraine relations - factsheet, July 5, 2019", "European Commission, EU releases €250 million of grants to support Ukraine, June 13, 2014", "Mission of Ukraine to the European Union, EU's assistance to Ukraine, accessed Sept. 25, 2019", "Organization for Economic Cooperation and Development, Ukraine, accessed Sept. 25, 2019", "German Foreign Office, Ukraine, Jan. 4, 2019", "Security Assistance Monitor, Ukraine, Aug. 29, 2019", "European Council on Foreign Relations, After Crimea: Does NATO have the means to defend Europe?, April 2, 2019", "Independent, British Government extends military training for Ukrainian troops 'in face of a more belligerent Russia', Dec. 18, 2016", "Foreign Policy Research Institute, The Ukrainian military: From degradation to renewal, Aug. 17, 2018", "Correspondent, We are fighting for our own. How the West helps the Ukrainian army, Sept. 22, 2017", "Washington Post, Trump ordered hold on military aid days before calling Ukrainian president, officials say, Sept. 23, 2019", "Email exchange, Press Office for Foreign Affairs and Security Policy, European Commission. Sept. 25, 2019", "Interview, Samuel Charap, senior political scientist, RAND, Sept. 25, 2019", "Email exchange, Steven Pifer, senior fellow, Brookings Institution, Sept. 24, 2019", "Email exchange, Jim Townsend, adjunct senior fellow, Center for a New American Security, Sept. 24, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]