["About this rating", "In March 2018, a café in Oakland, California became the focus of national attention after one of its owners refused to serve a uniformed police officer.", "Hasta Muerte, a \"collectively run, worker-owned\" coffee shop in the Oakland neighborhood of Fruitvale, confirmed the policy in a 22 February Instagram post:", "Last Friday February 16th a police (OPD) entered our shop and was told by one of our worker-owners that “we have a policy of asking police to leave for the physical and emotional safety of our customers and ourselves.” Since then, cop supporters are trying to publicly shame us online with low reviews because this particular police visitor was Latino. He broadcasted to his network that he was “refused service” at a local business and now the rumblings are spreading.", "The café owners added, \"we need the support of the actual community to keep this place safe, not police.\"", "The image accompanying the post read: \"Habla con tus vecinxs no con la policia,\" which means \"Talk with your neighbors, not with police.\"", "According to local reports, the would-be customer on 16 February 2018 was Sgt. Robert Trevino, who is president of the Alameda County branch of the Latino Peace Officers Association and a former homicide investigator who now patrols the Fruitvale district. A few days after the incident, Oakland Police Officers Association President Barry Donelan wrote to the café's owners, expressing concern and requesting clarification of their policy:", "This past weekend, I received a telephone call from an Oakland Police Sergeant, who advised that when he presented himself at your establishment to introduce himself as the district Sergeant and buy a cup of coffee, he was refused service. Hasta Muerta Coffee staff advised him that your establishment does not serve the Police.", "Obviously, this is both a surprise and a matter of concern for all Oakland Police Officers. Oakland Police Officers work tirelessly every day to serve the residents of our City. I have never heard of Police Officers being refused service by an Oakland business. Therefore, I write to you to clarify your business policy on serving, or indeed not serving, Oakland police officers.", "Donelan also offered to meet in person with the owners of Hasta Muerta Coffee, but he told us that there had been no response from the café.", "The Hasta Muerte café is located on Fruitvale Avenue in Oakland, a mile north of the Fruitvale train station, where a transit police officer shot and killed Oscar Grant on New Year's Day 2009. Grant's killing became a landmark case of police brutality, prompting widespread protests and contributing to what would later become known as the Black Lives Matter movement.", "On Instagram, Hasta Muerta café wrote:", "We know in our experience working on campaigns against police brutality that we are not alone saying that police presence compromises our feeling of physical & emotional safety...[Oakland Police Department's] recent attempts to enlist officers of color and its short term touting of fewer officer involved shootings does not reverse or mend its history of corruption, mismanagement, and scandal, nor a legacy of blatant repression.", "The facts are that [people of color], women, and queer police are complicit in upholding the same law and order that routinely criminalizes and terrorizes black and brown and poor folks, especially youth, trans, and houseless folks.", "For these reasons and so many more, we need the support of the actual community to keep this place safe, not police.", "We asked the owners of Hasta Muerte whether the ban applied only to uniformed police and if it also extends to other law enforcement and public safety officers, but we did not receive a reply in time for publication.", "Vera, Amir.  \"Oakland Coffee Shop Says It's Keeping the Peace by Not Serving Cops.\"\r\n  CNN.  9 March 2018.", "Cerullo, Megan.  \"California Coffee Shop Defends Policy of Not Serving Cops.\"\r\n  New York Daily News.  10 March 2018.", "Joyce, Kathleen.  \"Coffee Shop Under Fire for Refusing to Serve Uniformed Police Officers.\"\r\n  Fox News.  10 March 2018.", "Ruggiero, Angela.  \"Police Sergeant Refused Coffee at East Oakland Café is Head of Latino Organization.\"\r\n  East Bay Times.  9 March 2018.", "Veklerov, Kimberly.  \"Oakland Coffee Shop Refuses to Serve Police Officers -- and Cops Say It's a Teaching Moment.\"\r\n  San Francisco Gate.  9 March 2018.", "Leonard, Jack; Sewell, Abby; La Ganga, Maria L.  \"Former BART Officer Johannes Mehserle Gets 2 Years in Oscar Grant Killing.\"\r\n  Los Angeles Times.  6 November 2010.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]