["About this rating", "In September 2020, the website ObamaWatcher published an article positing that former President Barack Obama said that legally, an impeached president can't appoint judges:", "Obama : ‘Legally, An Impeached President Can’t Appoint Judges’", "In his legal standing, former President Barack Obama is more or less the foremost Constitutional law authority in the United States. This weekend, he may have brought up a devastating wrinkle to President Trump’s outgoing plans for the Supreme Court as well as all of the lower jurisdictions.", "According to an interview with Joe Barron of the Washington periodical Impeached Embarrassments Monthly, Trump lost his constitutional permission to assign or appoint any person to any legislative body of any kind after he was permanently and forever impeached in the course of his first and soon to be only term in office. Obama made the statement clear by citing code within the Constitution referring to the penalties of being a failed and disgraced commander in chief.", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical.", "The spoof appears to have fooled a number of left-leaning Twitter users, some of whom shared it with comments echoing statements from the article, such as: \"According to Obama... US Constitution Article 11, Section 5 denies any person elected to the Presidency and then consequently legally impeached by the Congress, all power of appointment.\"", "The U.S. Constitution only has seven articles.", "For background, here is why we sometimes write about satire/humor.", "ObamaWatcher.   \"Obama : 'Legally, An Impeached President Can’t Appoint Judges.'\"\r\n   September 2020.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]