["The claim was shared here on Twitter on March 11, 2021, alongside two images.", "The text on the tweet reads: “Why are the media silent?”", "The first image is a screenshot of a media statement by the Australian Health Minister Greg Hunt, issued on March 10, 2021, in relation to a diagnosis of cellulitis in his leg.", "The second image is of a suspected adverse reactions (ADR) report from the AstraZeneca vaccine, published weekly by the UK government as part of its Yellow Card scheme. In the image, the row for “cellulitis” on the document is highlighted in yellow.", "The Yellow Card Scheme, operated by the Medicines and Healthcare products Regulatory Agency (MHRA), is designed to collect and monitor information on safety concerns such as suspected side effects or adverse incidents involving medicines and medical devices.", "A similar claim has been shared more than 260 times after appearing on Facebook here, here and here.", "Hunt received the AstraZeneca jab on March 7, 2021, according to this interview transcript published by his office.", "The vaccine was administered in his arm, as seen here on 10 News First and here on Sky News Australia.", "However, the claim is false.", "MHRA noted a suspected adverse reaction report “does not necessarily mean that it was caused by the vaccine, only that the reporter has a suspicion it may have”.", "“Underlying or previously undiagnosed illness unrelated to vaccination can also be factors in such reports,” the UK agency added.", "The AstraZeneca vaccine is injected into the deltoid muscle, as per guidance from the Australian Technical Advisory Group on Immunisation (ATAGI), Victoria Health, and product information published by AstraZeneca.", "Hunt was diagnosed as having cellulitis on his leg on March 10, 2021, a day after the minister’s office announced that he had been admitted to hospital with a suspected infection.", "Marc Pellegrini, professor at the infectious diseases and immune defence division at the Walter and Eliza Hall Institute of Medical Research in Melbourne, said that Hunt’s cellulitis is unrelated to the vaccination.", "“Cellulitis is a skin infection. As Minister Hunt had the vaccine in his arm and the skin condition was in his leg, the two events are unrelated,” Pellegrini said in an email to AFP on March 14, 2021.", "According to the website ofAustralian virtual health services provider Healthdirect here, cellulitis is a “spreading inflammation of the skin and the tissues directly beneath it”.", "The website reads in part: “Cellulitis often affects the lower leg, but can occur on any part of the body including the face. The infection may occur when bacteria enter the skin through an ulcer, cut or a scratch or an insect bite. However, it can occur without any visible damage to the skin.”", "Hunt was discharged from hospital on March 13, 2021, after receiving treatment for the cellulitis located on his upper right leg and accompanying fever.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]