["About this rating", "The charity ranking site CharityWatch grades the Clinton Foundation as an \"A\" and the Red Cross as an \"A-.\"", "The larger and more highly regarded Charity Navigator stopped evaluating the Clinton Foundation after an early 2015 dispute over bad press and allegations of a lack of transparency, then on 1 September 2016  reinstated the Foundation's rating.", "On 28 August 2016, a popular tweet initiated a rumor that as a charity, the Clinton Foundation scored higher in efficiency than the well-known aid-providing Red Cross organization:", "today's fun fact: CharityWatch gives the Clinton Foundation a higher rating (A) than it gives the Red Cross (A-). #discuss", "— Eric Boehlert (@EricBoehlert) August 28, 2016", "As seen in the example field above, the claim caused some skepticism among social media among users who were unable to independently corroborate the claim. That phenomenon likely stemmed from confusion \"CharityWatch\" and \"Charity Navigator,\" two similarly-named charity evaluation services. The former ranked the Clinton Foundation (A) slightly higher than the Red Cross (A-), while the latter doesn't rank the Clinton Foundation at all.", "How much credence one should afford these rankings is debatable, however. Charity Navigator is the much larger and more highly regarded site, while the smaller CharityWatch's Wikipedia entry shows that organization to employ a ranking methodology that has generated a large \"Criticism\" section.", "A 2011 ranking of charity watchdogs contrasted the two sites:", "Charity Navigator (charitynavigator.org): Evaluates about 5,500 nonprofits with starred reviews and helpful, graphic-heavy reports that now include evaluations of transparency and links to similar charities. Reports are based largely on self-reported data. In coming years, Charity Navigator aims to add information on charitable program results. People interested in specific categories can find several Top 10 lists of the best and worst charities. Some aspects of the site are free to all users, while others require registration. The site is supported through charitable donations from large donors and individual users.", "CharityWatch (charityWatch.org): Formerly called the American Institute of Philanthropy, this 20-year-old organization performs in-depth analysis of about 550 charities. Questions addressed include possible fraudulent valuation of donations, inappropriate categorizations of program expenses and legitimate reasons for seeming financial inefficiency. Lists of top-rated charities can be viewed free, but the group’s full thrice-yearly reports — which feature updates and investigations into wrongdoing in the industry — require a $3 payment for the first sample and then a $40 to $200 yearly membership fee after that. CharityWatch’s work is supported by individual donations.", "With respect to the original tweet, it was true that CharityWatch gave the Bill, Hillary & Chelsea Clinton Foundation an \"A\" rating by CharityWatch in April 2016, while by contrast they assigned an \"A-\" grade to the American Red Cross of August 2016. While the Red Cross achieved a higher \"Program Percentage\" (share of monies allocated to services) than the Clinton Foundation at 90% percent vs. 88%, the Red Cross was less efficient because they spent more money to raise money ($30 per $100) than the Clinton Foundation ($3 per $100) did, according to CharityWatch.", "However, the comparison arguably constitutes cherry picking, in that CharityWatch is a far smaller, atypical arbiter of charity ratings. Most news outlets turn to Charity Navigator when seeking out figures for any one charity organization's effectiveness, but no such claim was proffered about the comparative rankings of the American Red Cross and the Clinton Foundation by Charity Navigator. That's likely because while the American Red Cross has achieved an overall Charity Navigator rating of 85% (80% for financial organization and 93% for accountability & transparency), Charity Navigator maintains no rating for the Clinton Foundation at all.", "The page for the Clinton Foundation on the Charity Navigator site includes a brief explanation stating that the Clinton Foundation was at one time evaluated and included in Charity Navigator rankings, but that Charity Navigator subsequently determined the Clinton Foundation didn't meet their rating criteria:", "Why isn't this organization rated?", "We had previously evaluated this organization, but have since determined that this charity's atypical business model can not be accurately captured in our current rating methodology. Our removal of The Clinton Foundation from our site is neither a condemnation nor an endorsement of this charity. We reserve the right to reinstate a rating for The Clinton Foundation as soon as we identify a rating methodology that appropriately captures its business model.", "What does it mean that this organization isn’t rated?", "It simply means that the organization doesn't meet our criteria. A lack of a rating does not indicate a positive or negative assessment by Charity Navigator.", "Charity Navigator includes extensive clips and links to news coverage of the Clinton Foundation on their page, adding that:", "In accordance with our policy for removing charities from the CN Watchlist, Charity Navigator removed the Bill, Hillary & Chelsea Clinton Foundation from the Watchlist in December 2015 because the charity provided publicly accessible information regarding their amended tax Forms for 2010, 2011, 2012 and 2013. This information, along with the public memorandum submitted addressing the other issues raised in the Watchlist entry, meets our requirements for removal.", "On 10 May 2015, the Daily Intelligencer published an in-depth article about the Clinton Foundation's dispute with Charity Navigator and the Foundation's attempts to reinstate their standing in early 2015:", "The Clinton Foundation scandal cycle is already spinning off new complications. A case in point: After being the subject of a spate of negative newspaper accounts about potential conflicts of interest and management dysfunction this winter — long before Clinton Cash — the Clinton Foundation wound up on a “watch list” maintained by the Charity Navigator, the New Jersey–based nonprofit watchdog. The Navigator, dubbed the “most prominent” nonprofit watchdog by the Chronicle of Philanthropy, is a powerful and feared player in the nonprofit world. Founded in 2002, it ranks more than 8,000 charities and is known for its independence. For a while, the Clinton Foundation was happy to promote Charity Navigator’s work (back when they were awarded its highest ranking). In September 2014, in fact, the Navigator’s then-CEO, Ken Berger, was invited to speak at the Clinton Global Initiative. Of course that was before the Foundation was placed on a list with scandal-plagued charities like Al Sharpton’s National Action Network and the Red Cross.", "Since March, the Foundation has embarked on an aggressive behind-the-scenes campaign to get removed from the list. Clinton Foundation officials accuse the Navigator of unfairly targeting them, lacking credible evidence of wrongdoing, and blowing off numerous requests for a meeting to present their case. “They’re not only punishing us for being transparent but are not being transparent themselves,” Maura Pally, the Foundation’s acting CEO, told me by phone from Morocco. “Charity Navigator doesn’t disclose its donors, but we do and yet that means we’re suffering the consequences.”", "Navigator executives counter that the Foundation has demanded they extend the Clintons special treatment. They also allege the Foundation attempted to strong-arm them by calling a Navigator board member. “They felt they were of such importance that we should deviate from our normal process. They were irritated by that,” says Berger.", "The feud is a microcosm of all that is exhausting about the Clintons’ endless public battles. Generally, it goes like this: bad press about their lack of transparency sparks some real-world consequence or censure, the Clintons complain that they’re being held to an unfair standard while their critics contend that they expect to be able to write their own rules, and the resulting flare-up leads to more bad press.", "The trouble with Navigator started on Wednesday morning, March 11. Foundation officials became alarmed when they received an anonymous email from the watchdog’s Donor Advisory committee informing them they would be added to the list on Friday, March 13, unless they could provide answers to questions raised in newspaper accounts. Among the press controversies the Navigator cited: A Wall Street Journal  report that noted “at least 60 companies that lobbied the State Department during [Hillary Clinton’s] tenure donated a total of more than $26 million to the Clinton Foundation.” Politico, meanwhile, revealed that the Foundation failed to report to the State Department a $500,000 donation from the Algerian government, a violation of the ethics agreement the Clintons had arranged with the Obama White House. Politico also reported that the Foundation’s former CEO, Eric Braverman, quit after a “power struggle” with “the coterie of Clinton loyalists who have surrounded the former president for decades.”", "With the publication of Clinton Cash on the horizon, Clintonworld surely knew landing on the Navigator’s watch list would be a public-relations debacle. By early March, Clinton campaign officials were holding regular war-room meetings to orchestrate their defense against the book. Over the next few days, Foundation officials desperately attempted to contact Navigator executives to rebut their claims but, inexplicably, couldn’t get through to anyone on the phone. On the evening of Friday, March 13, Pally sent a detailed email rebuttal. “All of the other organizations on your watch list have had substantiated allegations of financial, fiscal or other impropriety,” she wrote, according to an email the Foundation provided to New York. “The stories you cite about the Clinton Foundation merely point to donations, or gossip around our operations, none of which constitute any wrongdoing.”", "It didn’t work. During a tense phone conversation on the afternoon of March 17, Pally and Berger argued over the merits of the media’s claims about the Foundation. Pally said they were without substance; Berger insisted that since the newspapers published the articles, they were relevant. \"Our whole thing is, if major media outlets say there’s something here that you should be aware of, we’re not going to be judge and jury on what the media says,\" Berger later told me. \"We felt there had been enough questions.\" As a matter of practice, the Navigator doesn’t conduct its own investigations. On its website, they state: “Charity Navigator … takes no position on allegations made or issues raised by third parties, nor does Charity Navigator seek to confirm or verify the accuracy of allegations made or the merits of issues raised by third parties that may be referred to in the CN Watchlist.”", "The Navigator invited the Foundation to respond publicly on their website. Instead, Pally asked Berger to meet and review confidential copies of the Foundation’s handbook, “Global Code of Conduct,” and board bylaws. Berger declined, feeling it was another effort of backroom dealing and spin. “We were not opposed to having a sit-down meeting. The point was, what is it that we’re going to cover? We’ve already been around the block. What’s the value of this?”", "Last week, after I contacted the Foundation about being on the watch list, Pally rekindled talks with the Navigator. “I remain at a loss as to what information we can provide to address Charity Navigator’s concerns and be removed from the Watchlist,” she wrote Tim Gamory, the Navigator’s acting CEO. (Berger left the group last month to start his own consulting business.)", "Unfortunately for Hillary’s campaign, the Navigator’s policy is that charities that land on the list stay there for a minimum of six months. Sandra Miniutti, the Navigator’s spokesperson, told me that, in order to get off the list, the Clintons need to publicly address each of the controversies raised by the media with a convincing response.", "Although it is true that the Clinton Foundation earned an \"A\" versus the Red Cross' \"A-\" in CharityWatch's rankings, that claim elides the former organization's documented and acrimonious feud with the standard bearer of charity ranking organizations, Charity Navigator. The Clinton Foundation's \"atypical\" management prompted Charity Navigator to remove that organization from their list of ranked charities in March 2015.", "UPDATE: On 1 September 2016, Charity Navigator responded to \"unprecedented demand\" by reinstating the Clinton Foundation's rating:", "A charity watchdog with an ongoing relationship with the Clinton Foundation gave the former first family's nonprofit high marks Thursday, after an evaluation prompted by the heightened interest in the organization.", "The Clinton Foundation received four out of four stars — the highest rating that Charity Navigator gives after a close look at a charity's finances. The rating is based on annual federal tax documents. It was not intended to reflect whether Hillary Clinton kept donors to her family's foundation at appropriate arm's length or provided favored access as secretary of state ... Charity Navigator's president, Michael Thatcher, told The Associated Press that the Clinton campaign did not influence the rating.", "The four-star badge comes at a time when the Clinton Foundation is under intense scrutiny about whether Clinton granted donors access at the State Department. An AP analysis found that of 154 people outside government with private interests who met or spoke to Clinton by phone, 85 had contributed either personally or through their organizations to the foundation. The Clinton campaign said Clinton would have met with the donors, anyway, in her role as secretary of state.", "The watchdog had previously rated the Clinton Foundation with four stars in 2007, and in 2012 downgraded it to three stars due to changes in its methodology. Its original four-star rating was based on the foundation's financial health and performance. In 2012, it also evaluated the charity on accountability and transparency. Charity Navigator requires five independent board members, but the foundation had only three during the 2009 fiscal year, Thatcher said. The downgrade came the same year that Charity Navigator was a member of the Clinton Global Initiative.", "The Clinton Global Initiative waived its membership fees for Charity Navigator, as it does for nonprofits, nongovernment organizations and social entrepreneurs. Charity Navigator treated the $20,000 waiver as an in-kind donation. Thatcher said his group joined Clinton's to mingle with world leaders and promote its ratings.", "He said the new rating was unrelated to Charity Navigator's relationship with the foundation. \"The numbers speak for themselves,\" he said.", "According to its 2014 consolidated tax report, the Clinton Foundation spends about 12 percent of its budget on running the foundation. Another charity watchdog, Charity Watch, previously gave the Clinton Foundation an \"A'' rating on a scale of A-F. Charity Watch has no connection to the Clinton Foundation, said its president, Daniel Borochoff. \"We don't want money from charities we rate, because we believe in being an independent charity watchdog,\" he said.", "Charity Navigator stopped rating the Clinton Foundation entirely in 2014 because it said changes in the foundation's business structure were incompatible with the way Charity Navigator calculates its ratings. After what Thatcher described as \"unprecedented demand\" for a rating for the Clinton Foundation, Charity Navigator asked the foundation to consolidate its tax forms in a way the watchdog could evaluate it. That led to Thursday's four-star rating.", "Eng, Monica.   \"Watchdogging the Charity Watchdogs.\"\r\n    The Seattle Times.   29 December 2011.", "Sherman, Gabriel.   \"The Clinton Foundation’s Behind-the-Scenes Battle with a Charity Watchdog Group.\"\r\n    Daily Intelligencer.   10 May 2015.", "Associated Press.   \"Charity Watchdog Gives Perfect Rating To Clinton Foundation, But ....\"\r\n    1 September 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]