["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Tebow was known for kneeling in prayer, particularly after his team scored. It became known as “Tebowing.”", "The image accompanying the post was taken in 2011, before a game, and not during the national anthem.", "No media reports, or video or photo evidence exists to show Tebow kneeling during the national anthem in 2012, and Tebow has said he did not kneel during the anthem.", "President Donald Trump is continuing to stand firm in his opposition to anyone kneeling for the national anthem, saying he \"won’t be watching\" if athletes decide to take a knee on gameday.", "\"OLD GLORY is to be revered, cherished, and flown high,\" Trump posted on Twitter. \"We should be standing up straight and tall, ideally with a salute, or a hand on heart. There are other things you can protest, but not our Great American Flag - NO KNEELING!\"", "Trump has gone as far as to call for NFL players who kneel to be fired by NFL owners. But a post on social media cries hypocrisy, saying Trump and others have targeted their criticism at African American players like Colin Kaepernick, while giving a white player who did the same thing, Tim Tebow, a pass.", "Tebow \"kneeled in protest of abortion during the National Anthem in 2012. He was praised by fans as being a ‘model American,’\" one post claims, accompanied by a picture of Tebow kneeling while he was a member of the Denver Broncos.", "Tebow, an evangelical Christian, notably participated in an anti-abortion television advertisement that aired during the Super Bowl in 2010. Did he take his advocacy a step further, as this post claims?", "No, this claim is bogus.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. Versions have been on social media since at least 2018. (Read more about our partnership with Facebook.)", "The image in the photo is not from 2012, and it’s not from Tebow kneeling during the national anthem.", "We found the image in the photo archives from the Associated Press. It was taken by photographer Julie Jacobson. Here’s the original photo:", "The accompanying caption says the photo was taken Dec. 11, 2011, before the start of an NFL football game against the Chicago Bears, in Denver", "Tebow was known for kneeling in prayer during parts of the game, particularly after his team scored. It actually took on a name, \"Tebowing,\" which the University of Florida Heisman Trophy winner went on to trademark. \"It's something I do that's prayer for me, and then it got hyped up as Tebowing. So I think (it's) just to control how it's used, as well. Make sure it's used in the right way.\"", "The Broncos’ 2011 season ended with a playoff loss in January 2012. During the  2012 season, Tebow was on the New York Jets.", "There is no evidence he kneeled during the national anthem. It doesn’t appear in media reports from the season, nor is there any video or photographic evidence that we could locate.", "Tebow has denied that he kneeled during the National Anthem.", "\"Sometimes people will just try to create something that had zero truth,\" Tebow said in 2018. I never did anything during a national anthem but stand and support my country. And then stories can get written and they can get put out of proportion, so that you believe one thing when you’re asking me a question that was nothing that was part of the truth.\"", "Tebow has avoided criticizing those athletes who kneel during the national anthem, saying, \"I think when people believe in something and they stand for that, I don’t knock them for that.’’", "Posts say Tebow \"kneeled in protest of abortion during the National Anthem in 2012. He was praised by fans as being a ‘model American’.\"", "The post includes an image of Tebow kneeling in prayer in 2011 before a game, but not during the national anthem. There is no evidence Tebow kneeled during the anthem before a game in 2012. Tebow has said he didn’t.", "We rate this post False.", "Facebook post, June 12,", "AP photo, Dec. 11, 2011", "USA Today, \"Tim Tebow not happy about 'Tebowing' being brought into national anthem protests debate,\" June 8, 2018", "USA Today, \"Tim Tebow prevails in trademarking 'Tebowing',\" Oct. 19, 2012", "Twitter, post by Donald Trump, June 5, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]