["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Vice President Mike Pence speaks at the State Department on Jan. 16, 2019. (AP)", "Vice President Mike Pence took something of a victory lap for the administration on countering ISIS, the terrorist group that set out to establish an Islamic caliphate in portions of Iraq and Syria starting in 2014.", "\"Thanks to the leadership of this commander in chief and the courage and sacrifice of our armed forces, we’re now actually able to begin to hand off the fight against ISIS in Syria to our coalition partners, and we’re bringing our troops home,\" Pence said to the Global Chiefs of Mission Conference at the State Department. \"The caliphate has crumbled, and ISIS has been defeated.\"", "On the same day, ISIS claimed responsibility for a suicide blast in Manbij, Syria, that killed four Americans — two service members, a defense contractor and a civilian working for the Defense Department, CNN reported. Three other U.S. service members were injured, according to the U.S. Central Command.", "The attack showed clear flaws in Pence’s assessment. (In a statement released later the same day, after the attack, he avoided similar phrasing, saying, \"The American people can be assured, for the sake of our soldiers, their families, and our nation, we will never allow the remnants of ISIS to reestablish their evil and murderous caliphate – not now, not ever.\")", "We wondered about the basis for Pence’s claim in his State Department speech.", "Pence’s office didn’t respond to an inquiry. However, we found wide agreement among a half-dozen experts who study terrorism and foreign policy: ISIS land holdings have shrunk dramatically, but even before the Manbij attack, the group could in no way have been described as \"defeated.\"", "In terms of reclaiming ISIS territory, there has been success — and noteworthy spillover effects.", "A report by the consulting firm IHS Markit released in June 2017 concluded that ISIS had lost \"more than 60 percent of its territory and 80 percent of its revenue\" by that point.", "That included \"a steady decline in all of the group’s financial streams: oil production and smuggling, taxation and confiscation, and other illicit activities.\" In addition, IHS Markit said, \"the group’s video productions have declined in frequency, suggesting that it is less capable of disseminating its messages.\"", "A few months later, in a Dec. 21, 2017, State Department briefing, Brett McGurk — then the special presidential envoy for the global coalition to counter ISIS — offered an even higher figure: 98 percent of land lost. McGurk added that \"7.7 million people (who) used to be living under ISIS are no longer living under ISIS.\"", "A year later, McGurk effectively upped that to 99 percent, saying in a State Department briefing, \"We really are now down to the last 1 percent of the physical territory.\"", "McGurk later resigned in protest of President Donald Trump’s announcement that he would be withdrawing troops from Syria — troops that many credited with helping keep ISIS in check.", "This map, published by the nonpartisan Congressional Research Service, shows the extent of ISIS’ land losses through August 2018:", "At the same time, however, these losses of territory \"are driving the Islamic State to intensify its campaign of terrorist attacks abroad to compensate,\" the IHS Markit report said.", "And ISIS still has members available to carry out those attacks, like the one it claimed in Manbij.", "The number of remaining ISIS members is estimated at 30,000.", "For context, \"that is the equivalent of two U.S. Army divisions, and is many times the ‘thousand’ fighters al-Qaeda had before 9/11,\" said John Pike, director of globalsecurity.org.", "And those ISIS fighters are far from impotent, experts said.", "\"I don’t know of any credible analysis that agrees with the idea that ISIS has been defeated,\" said Daveed Gartenstein-Ross, a terrorism specialist with the Foundation for the Defense of Democracies who tracks ISIS for his consulting group, Valens Global.", "The attack in Manbij \"was one in a sequence of a wide variety of attacks in both Syria and Iraq that suggest that ISIS is coming back as an insurgent movement,\" Gartenstein-Ross said.", "For instance, the Institute for the Study of War, which has tracked ISIS’ activity, recently wrote that ISIS is \"intensifying its campaign to destabilize\" Raqqa, its former capital. ISIS detonated a car bomb there on Nov. 4, 2018 -- the first such attack since the city was seized by the U.S.-led alliance against ISIS.", "ISIS also \"retains a support zone in the rural desert of Central Syria\" and appears to maintain \"access to the Syrian-Jordanian and Syrian-Iraqi border, as well as the key crossroads town of Palmyra in Central Syria,\" according to the Institute for the Study of War. The group has also used \"a dense network of caves and tunnels\" to avoid detection.", "Terrorism experts contacted by PolitiFact were universal in their agreement that Pence’s \"defeated\" comment was wrong.", "• \"In no way has it been defeated,\" said Michael O’Hanlon, a foreign-policy specialist at the Brookings Institution.", "• \"The caliphate has collapsed, but the terrorist threat from the Islamic State is very much alive and dangerous,\" said Bruce Riedel, director of Brookings’ intelligence project.", "• \"ISIS is not what it was between 2014 and 2016, but it is not defeated,\" said Mark Hamm, an Indiana State University criminologist who specializes in terrorism.", "• Not only is \"defeated\" inaccurate, said Bruce Hoffman, a professor at Georgetown University’s Edmund A. Walsh School of Foreign Service, but it suggests \"a misunderstanding of terrorism as a phenomenon that can be ‘defeated’ in conventional military terms.\"", "McGurk said as much the same during his 2017 and 2018 briefings. Less than a month before Pence’s speech, McGurk said, \"Even as the end of the physical caliphate is clearly now coming into sight, the end of ISIS will be a much more long-term initiative. ... Nobody is declaring a mission accomplished. Defeating a physical caliphate is one phase of a much longer-term campaign.\"", "Even the White House acknowledged this in its National Strategy for Counterterrorism, released in October 2018.", "ISIS’ \"global reach remains robust, with eight official branches and more than two dozen networks regularly conducting terrorist and insurgent operations across Africa, Asia, Europe, and the Middle East,\" the report said. \"Despite many setbacks, ISIS maintains a sophisticated and durable media and online presence that allows it to encourage and enable sympathizers worldwide to conduct dozens of attacks within target countries, including the United States. The increase in attacks by persons mobilized to violence in the United States underscores the ability of ISIS to inspire terrorist attacks.\"", "Pence said, \"The caliphate has crumbled and ISIS has been defeated.\"", "Experts agree that ISIS caliphate is essentially gone. However, the crumbled caliphate does not mean that ISIS has been \"defeated,\" not by a long shot. Even the White House itself acknowledged that reality just three months ago.", "We rate the statement Mostly False.", "Mike Pence, remarks to the Global Chiefs of Mission Conference at the State Department, Jan. 16, 2019", "White House, \"Statement by Vice President Mike Pence on the terrorist attack in Syria,\" Jan. 16, 2019", "CNN, \"4 Americans among those killed in Syria attack claimed by ISIS,\" Jan. 17, 2019", "White House, National Strategy for Counterterrorism, October 2018", "State Department, briefing by Brett McGurk, Dec. 21, 2017", "State Department, briefing by Brett McGurk, Dec. 11, 2018", "State Department, \"Background Information on Designated Foreign Terrorist Organizations,\" May 21, 2002", "IHS Markit, \"Islamic State Territory Down 60 Percent and Revenue Down 80 Percent on Caliphate’s Third Anniversary,\" June 29, 2017", "Congressional Research Service, \"The Islamic State and U.S. Policy,\" Sept. 25, 2018", "Institute for the Study of War, \"ISIS's Second Resurgence,\" Oct. 2, 2018", "Institute for the Study of War, \"ISIS Threat Update - December 2018,\" Dec. 19, 2018", "FactCheck.org, \"Pence’s Claim that ISIS ‘Has Been Defeated’\" Jan. 16, 2019", "Time, \"Top U.S. Envoy to Anti-ISIS Coalition Has Resigned in Protest to President Trump's Syria Decision,\" Dec. 23, 2018", "Email interview with Maseh Zarif, director of external relations at the Institute for the Study of War, Jan. 16, 2019", "Email interview with Bruce Riedel, director of Brookings’ intelligence project, Jan. 17, 2019", "Email interview with Bruce Hoffman, professor at Georgetown University’s Edmund A. Walsh School of Foreign Service, Jan. 17, 2019", "Email interview with Mark Hamm, Indiana State University criminologist, Jan. 17, 2019", "Email interview with Michael O’Hanlon, foreign-policy specialist at the Brookings Institution, Jan. 17, 2019", "Email interview with John Pike, director of globalsecurity.org, Jan. 17, 2019", "Interview with Daveed Gartenstein-Ross, terrorism specialist with the Foundation for the Defense of Democracies, Jan. 17, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]