["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Then-President-elect Donald Trump and Kanye West pose for a picture in the lobby of Trump Tower in New York on Dec. 13, 2016 (AP Photo/Seth Wenig).", "President Donald Trump, in the midst of a controversial bromance with Kanye West, told a crowd at the National Rifle Association convention that the rapper’s praise had doubled his support among African-Americans in a week.", "Social media pleasantries between the two men began when West professed his love for Trump in an April 25 tweet in which he referred to the 45th president as his \"brother.\"", "\"We are both dragon energy,\" West wrote. \"He is my brother.\"", "You don't have to agree with trump but the mob can't make me not love him. We are both dragon energy. He is my brother. I love everyone. I don't agree with everything anyone does. That's what makes us individuals. And we have the right to independent thought.", "West later tweeted a photo of himself wearing a Make America Great Again hat bearing Trump’s signature.", "we got love pic.twitter.com/Edk0WGscp6", "While addressing the NRA convention on May 4, Trump’s remarks veered toward his support among black Americans.", "\"Kanye West must have some power because you probably saw, I doubled my African-American poll numbers,\" Trump told the audience in Dallas. \"We went from 11 to 22 in one week. Thank you, Kanye, thank you.\"", "We decided to take a closer look at the numbers. It turns out Trump garbled the results of a real survey that showed a much more nuanced picture.", "Trump appears to have been referencing a Reuters weekly poll that showed his approval rating among black men going from 11 percent for the week ending April 22 to 22 percent for the week ending April 29.", "So even if you take the Reuters poll at face value, Trump misstated the results. The poll showed Trump’s support doubled among African-American men only, not African-Americans in general. (The poll showed that his approval rating among black Americans overall went from 8.9 percent to 16.5 percent over the same period.)", "But there’s reason to be wary of concluding, based on this poll, that Trump is enjoying a favorable shift in public opinion among black men.", "First, the sample size is small. Generally speaking, the smaller a poll’s sample size, the more prone it is to error. And the two weekly polls in question looked only at small slices: The surveys were based, respectively, on feedback from 118 and 171 respondents.", "According to Reuters’ own polling editor, the sample sizes for this particular poll \"were too small to reliably suggest any shift in public opinion.\" Chris Kahn, Reuters U.S. political polling editor, said the \"credibility interval\" (which is similar to the more familiar margin of error) was +/- 9 percentage points.", "So while Trump claimed his approval rating among black men for the week ending April 22 was 11 percent, realistically it could have anywhere from 2 percent to 20 percent. His approval rating the following week for this group was anywhere from 13 percent to 31 percent.", "In other words, according to Kahn, the polling \"leaves open the possibility that his approval also could have dropped in this time frame.\"", "Karlyn Bowman, a polling expert at the American Enterprise Institute, said news consumers should heed the Reuters polling editor’s cautionary notes.", "\"Most polls do not have a large sample of African Americans, and so we have to be very careful in interpreting the results of any single survey. The margin of error is high,\" Bowman said. \"I would also not rely on a single survey to suggest that something new was occurring.\"", "We were unable to find other polls that measured Trump's African-American support on a weekly basis.", "Another issue with the poll’s reliability concerns how it was conducted. Rather than calling randomly generated phone numbers, this poll allowed online respondents to opt-in to the survey.", "In polling terminology, this survey used \"a non-probability online sample.\" As CNN’s director of polling Jennifer Agiesta explained, \"those who participated signed up to take the poll rather than being randomly selected,\" meaning \"there could be bias in the sample.\"", "Charles Wheelan, a professor at Dartmouth who has written extensively about statistics and public policy, cautioned that online polls are highly vulnerable to \"selection bias,\" whereby the sample of respondents does not accurately reflect a population writ large.", "\"It’s very difficult, if not impossible, to get an accurate cross-section using online tools because they are so biased by who is likely to be online and respond to a survey,\" Wheelan said.", "Trump said, \"I doubled my African-American poll numbers. We went from 11 to 22 in one week.\"", "Even if you take the Reuters poll at face value, Trump misstated the results. The poll showed Trump’s support doubled among African-American men only, not African-Americans of both sexes.", "In terms of the poll’s accuracy, Reuters’ own polling chief said the sample size was too small to reliably indicate Trump is enjoying a favorable shift in public opinion among black men.", "The poll’s reliability is also questionable given online respondents opted-in to the survey, which is less reliable than using a randomly-generated sample.", "We rate this Mostly False.", "Remarks by President Donald Trump, NRA convention, May 4, 2018", "Reuters poll, April 29, 2018", "CNN, \"How Trump's false claim about African American support happened,\" May 6, 2018", "Email interview with Charles Wheelan, a professor at Dartmouth, May 7, 2018", "Email interview with Karlyn Bowman, a polling expert at the American Enterprise Institute, May 7, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]