["The Beaverton, a Canadian satirical media site that also broadcasts on a TV comedy channel, reported on August 22 that the summer wildfires in British Columbia had been praised by several members of the government and oil company executives for the money they would save in the building of the Trans Mountain Pipeline.", "The article was shared more than 6,000 times on Facebook, and although many internet users acknowledged the satirical and absurd tone of the article, others did not seem to realize that the article was a joke.", "According to CrowdTangle, a social media monitoring platform, the article most notably provoked the ire of members of Facebook groups linked to the Standing Rock demonstrations, which oppose the Dakota Access Pipeline in the US.", "Members of another group named “Exposing the Matrix of Lies” seemingly also fell for the satire piece.", "Others, like the Sierra Club’s local BC chapter, appreciated the humorous take on two more serious topics.", "#ICYMI: more excellent satire from @TheBeaverton https://t.co/oo4juU8TJK", "Although all of the public figures quoted in the article do exist, none of the words attributed to them were ever uttered. The Beaverton’s disclaimer page explains, “When public figures are mentioned by name, the corresponding story details are invented.”", "Moreover, a quick look at the official map of the fires raging in British Columbia shows that the major fire centers of the upper Fraser Plateau do not align with the planned route for the Trans Mountain Pipeline.", "This is not the first time that articles from The Beaverton have been taken seriously in and outside of Canada.", "In 2016, local Ontario newspaper The Hamilton Spectator had reported that New Democratic Party MPs arrived at Parliament with fake bandages and casts. But the event never happened and was based on a satirical interpretation of “elbowgate”, when Justin Trudeau accidentally hit an NDP MP in the House of Commons.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]