["On February 26, Uttar-Pradesh Chief Minister Yogi Adityanath tweeted in Hindi, “Despite the global economic recession due to the pandemic, Uttar Pradesh has become the second-largest state in India in terms of Gross State Domestic Product (GSDP). This success is due to the honourable Prime Minister’s skilled guidance and the hard work of all the people of the state. Heartiest congratulations to all.”", "वैश्विक महामारी कोरोना जनित आर्थिक मंदी के उपरांत भी उत्तर प्रदेश, सकल राज्य घरेलू उत्पाद (GSDP) के मामले में भारत का दूसरा सबसे बड़ा राज्य बन गया है।", "यह आदरणीय प्रधानमंत्री जी के कुशल मार्गदर्शन एवं समस्त प्रदेशवासियों के परिश्रम का सुफल है।", "सभी को हार्दिक बधाई।", "— Yogi Adityanath (@myogiadityanath) February 26, 2021", "Shortly after The Times Of India (TOI) reported, “Despite Covid-induced slowdown in economies across the world, Uttar Pradesh has become the second-largest state of India in terms of Gross State Domestic Product (GSDP), surging ahead of even industrialised states like Gujarat and Tamil Nadu. The finance department data, accessed by TOI, reveals that the state’s GSDP in the 2020-2021 financial year has crossed Rs 19.48 lakh crore, equivalent to $268 billion, and UP has climbed to the second spot from number five in 2019-2020.” The same was reported by The New Indian Express and Swarajya.", "TOI also stated, “Maharashtra continues to lead from the top position while UP moved up three ranks past Tamil Nadu, Gujarat and Karnataka… Tamil Nadu was second and Gujarat third last fiscal [2019-20] while Karnataka was at the fourth slot.”", "TOI’s report was shared by OpIndia columnist @AbhishBanerj, Prayagraj MP Rita Bahuguna Joshi, BJP supporter Shehzad Poonawala, Swarajya columnist Aashish Chandorkar, and Ashwini Mahajan national co-convener of RRS-affiliate Swadeshi Jagaran Manch.", "This slideshow requires JavaScript.", "CM Adityanath’s tweet and media reports give the impression that Uttar Pradesh (UP) attaining the second-highest Gross State Domestic Product is a new achievement. The Times of India touted this growth as a quick rise.", "Alt News studied the historic data published by the Ministry of Statistics and Programme Implementation (MOSPI) on Gross State Domestic Product (current prices) from financial year (FY) 2004-05 to FY 2019-20 (view spreadsheet). This data was also published by the Reserve Bank of India (RB) in October 2020 and Economic Survey 2020-21.", "As per MOSPI, the latest GSDP data available is for the financial year 2019-20. However, in this FY, the GSDP of several states including Maharashtra and Gujarat is not available. Therefore, The Times of India’s claim that UP’s GSDP rank fell to fifth in FY 2019-20 and is back to the second cannot be ascertained based on the lastest available data in the public domain. Alt News spoke to journalists who reported on the matter. They said that FY 2020-21 data was presented by the UP finance department. Alt News has reached out to the state government and will update the article if we are able to access the data.", "However, what can be ascertained is the fact-check that UP’s GSDP was second or third highest between the financial years 2004-05 and 2018-19.", "As per MOSPI data, UP had the second-highest GSDP from the financial year (FY) 2004-05 to 2013-14. In the FY 2014-15, UP’s GSDP was third-highest just behind Tamil Nadu. Maharashtra had the highest GSDP between 2004 and 2015. MOSPI set FY 2004-05 as the base year. (view PDF)", "As for the data beyond FY 2014-15, the base year was FY 2011-12. As a result, UP’s GSDP rank changed from second to the third spot between FYs 2011-18. But in FY 2018-19, UP’s GSDP rose back to the second spot. Readers should note that CM Adiyanath was sworn in as the chief minister on March 19, 2017.", "The following graph shows the comparison of the GSDP (current price) between the top five states in India — Maharashtra, Tamil Nadu, Uttar Pradesh, Karnataka and Gujarat — from FY 2011-12 to FY 2019-20.", "Analysis of the graph", "Data by the Ministry of Statistics and Programme Implementation makes it evident that UP’s GSDP has been second-highest or third highest from FY 2004-05 to FY 2018-19. Barring FY 2019-20, where the GSDP data is missing for several states, and FY 2020-21 which isn’t in the public domain yet, UP’s GSDP has always been higher than that of Gujarat and Karnataka. The headline, “UP surges to the second spot on GSDP…” is misleading as it creates an impression that it’s a new achievement under CM Adityanath.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]