["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A widespread Facebook post wrongly claims that a video of body bags being dumped in a ditch shows the “situation in Italy” due to the novel coronavirus.", "The video is actually a scene from the 2007 TV miniseries, “Pandemic.”", "A video viewed thousands of times on Facebook wrongly claims that footage of body bags being dumped in a ditch shows the \"situation in Italy\" due to the novel coronavirus.", "The footage is stolen from a 2007 TV miniseries called \"Pandemic,\" a fictional show about the spread of a deadly virus infecting residents of Los Angeles.", "The video, which appeared first on TikTok but was shared widely on Facebook, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "In the video, body bags roll down the slope of a hill and into a ditch. A voice is heard talking about \"information from a knowledgeable source\" before that audio is drowned out by edited-in music from the song \"Can We Kiss Forever?\"", "Fact-checkers in India and France matched the visual of the body bags and the audio of the voice in the clip to a scene from \"Pandemic.\"", "The actual scene from \"Pandemic\" shows a fictional reporter broadcasting about the so-called \"riptide virus\" as the body bags are seen tumbling. Here’s what the reporter says:", "\"Though unsubstantiated by state and city authorities, we now have information from a knowledgeable source that tells us that the city's temporary morgues are filled beyond capacity. Mass graves have been dug for the incineration and burial of the dead. The current death toll due to the riptide virus is now in the thousands and growing.\"", "You can watch the full clip from \"Pandemic\" here.", "Italy has seen a high death toll as a result of the coronavirus, which was first detected in Wuhan, China, in December 2019. According to the World Health Organization, the country had recorded 139,422 confirmed cases and 17,669 deaths from COVID-19 as of April 9.", "But the clip passed off by Facebook users as footage of the \"situation in Italy\" is lifted from a 2007 TV series about a fictional pandemic.", "We rate this Facebook post False.", "Facebook post, March 27, 2020", "The World Health Organization, \"Coronavirus disease 2019 (COVID-19) Situation Report – 80,\" April 9, 2020", "Amazon, \"Pandemic,\" 2007", "Movie Central on YouTube, \"Pandemic | Coronavirus Movie | PART 2,\" Feb. 14, 2020", "AFP Fact Check, \"This clip is a scene from the 2007 US television series Pandemic,\" April 1, 2020", "Boom, \"Scene From Mini-Series Pandemic Peddled As Coronavirus Mass Grave,\" March 27, 2020", "India Today, \"Fact Check: This viral video of mass graves is not from Italy but from a TV series,\" March 26, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]