["About this rating", "Many nutritionists and botanists consider the food a fruit based on its genetic structure and function.", "However, that's not the only word on the matter. Other nutritionists, the U.S. Supreme Court, the USDA, and culinary experts have classified tomatoes as vegetables based on flavor and their role in recipes.", "As the basis of ketchup, many salsas, and numerous spaghetti sauce recipes, tomatoes have long blurred the line between fruit and vegetable in popular discussion.", "“Tomatoes have such an outlandish history,” said George Ball, the chief executive at the seed company Burpee, to The Washington Post in 2017. “Most people hear it and are bewildered for life.”", "In early 2021, Snopes came across multiple social media posts seeking to answer the question once and for all: To which basic food group, exactly, do tomatoes belong? Fruit or vegetable?", "The answer depends on whom you ask.", "Fruits are defined, in part, as edible foods that are the reproductive body of a seed plant. And since tomatoes indeed grow from ripened flower ovaries and contain seeds -- matching the definition of a fruit -- many nutritionists consider them part of the fruit food group that also includes apples, kiwis, melons, cherries, as well as cucumbers, peppers, and avocados, according to Encyclopedia Britannica and Merriam-Webster dictionary.", "But in many cultures people tend to only serve vegetables, not fruits, as part of main dishes or side plates, while sweet fruits make up snacks or desserts, the encyclopedia adds. As a result, another group of nutritionists refers to certain botanical fruits -- including green beans, pumpkins, and tomatoes -- as vegetables, despite their genetic traits.", "\"There is no hard-and-fast rule that clearly designates a botanical fruit as a vegetable, but, given that tomatoes are generally not used in desserts and are closely related to other fruit-vegetables (e.g., eggplants and peppers), it is not too counterintuitive for tomatoes to be classified as vegetables,\" the encyclopedia said.", "Vegetables cover a wide range of plants with parts that are both edible and herbaceous, like stems, roots, and leaves, according to the dictionary. Merriam-Webster wrote in a blog post:", "This meaning neatly distinguishes recognizable vegetables like broccoli and carrots and kale from the things that grow on trees, like apples and pears. At first glance it might appear to also allow for the tomato of our truculent pill friend to be classified as a vegetable as well, but it does not in fact quite do that.", "Though a tomato plant is indeed herbaceous—its parts are not woody, and it grows for only one season—a vegetable is by our definition only the plant itself or the edible part of such a plant. Meanwhile the thing a tomato plant produces isn't a part of the plant itself, any more than the egg a chicken lays is part of the chicken, or the apple is part of the tree on which it grew.", "In other words, as Healthline described, there are two ways of categorizing tomatoes: by its botanical description based on the plant food's structure and function (fruit) or its culinary classification derived from how it makes flavors and people use it in recipes (vegetable).", "Legally speaking, however, there's a more definitive answer. While ruling in the 1893 court case Nix v. Hedden (read the full case here), the U.S. Supreme Court turned down an argument by a Manhattan wholesaler -- John Nix & Co. -- that attempted to convince the court tomatoes were fruits, not vegetables, in order to avoid paying 10% tariff on imported vegetables.", "“Botanically speaking, tomatoes are the fruit of a vine, just as are cucumbers, squashes, beans, and peas,” wrote Justice Horace Gray in his 1893 opinion. “But in the common language of the people, whether sellers or consumers of provisions, all these are vegetables.”", "After that, the U.S. Department of Agriculture (USDA) subsequently classified tomatoes as vegetables, too. A page on the federal agency's website states, as of this writing, that while botanists consider some foods (tomatoes, avocados, cucumbers, etc.) fruits, \"for nutritional and culinary purposes, these foods are considered to be vegetables rather than fruits.\"", "The Washington Post reported:", "That doesn’t mean the question is settled. Several states have rebelled: Tennessee and Ohio have named the tomato their state fruit — although New Jersey has made it the state vegetable, specifically citing Nix v. Hedden.", "To further complicate matters, the European Union issued a directive in December 2001 classifying tomatoes as fruit — along with rhubarb, carrots, sweet potatoes, cucumbers, pumpkins and melons", "In sum, although tomatoes have the genetic components of fruits, their culinary use and flavor make them vegetables by some cooks and nutritionists' standards. Additionally, the USDA and Supreme Court have classified the food a vegetable. For those reasons, we rate this claim a \"mixture\" of true and false information.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]