["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "None of these states have a statewide mask mandate, but cities and counties in each have orders requiring face coverings.", "As Americans continue to argue over wearing face masks as an effort to curb the spread of COVID-19, popular posts on Facebook are inaccurately claiming that Florida, Georgia, Idaho, South Dakota and Tennessee are now all \"mask free.\"", "None of those states has a statewide mask mandate, but municipalities in each do have mask requirements.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The Centers for Disease Control and Prevention recommends that people wash their hands frequently and practice social distancing when possible to mitigate the spread of the virus. The health agency also says most children and adults should \"wear a mask in public settings and when around people who don’t live in your household, especially when other social distancing measures are difficult to maintain.\"", "As of Oct. 1, 33 states and the District of Columbia require people to wear face coverings in public. One state, Mississippi, has lifted its mandate.", "Florida doesn’t have a statewide mask order, but several cities and large counties, including Miami-Dade, Palm Beach, Pinellas and Hillsborough, have mask requirements.", "In Georgia, Gov. Brian Kemp revised his coronavirus health order on Aug. 15 to allow local governments to impose local mask requirements, as Atlanta and others have done, reversing a month-old ban. Cities and counties that have 100 or more confirmed COVID-19 cases per 100,000 people in the state can enforce mask requirements on public property.", "Idaho's capital and largest city, Boise, requires masks in public, as do several other cities in the state.", "South Dakota’s fourth-largest city, Brookings City, approved an indoor public face covering ordinance and businesses in tourist areas, like Rapid City, are enforcing mask policies.", "In Tennessee, an executive order from Gov. Bill Lee urges residents to \"wear face coverings in public places.\" Knox County, Shelby County, Memphis and Nashville, which make up a large chunk of the state’s population, have all enacted mask mandates.", "None of the states in the post has a statewide order requiring people to wear masks, but local governments in all have enacted some sort of face covering policy, and businesses have the right to enforce mask-wearing.", "We rate this Mostly False.", "Facebook post, Sept. 27, 2020", "Centers for Disease and Prevention, Considerations for Wearing Masks, Aug. 7, 2020", "AARP, State-by-State Guide to Face Mask Requirements, Oct. 1, 2020", "Axios, The states where face coverings are mandatory, Aug. 4, 2020", "Factcheck.org, Viral Posts Don’t Give Full Picture of Mask Mandates in States, Oct. 5, 2020", "Florida Dept. of Health, Public Health Advisory, June 22, 2020", "Georgia executive order, Aug. 15, 2020", "Atlanta executive order, July 8, 2020", "Dakota News Now, Brookings the first South Dakota city to implement mask mandate, Sept. 9, 2020", "City of Boise, Public Health Emergency Order 20-10, July 2, 2020", "Idaho Statesman, More Idaho counties require face coverings in public after spike in COVID-19 cases, Aug. 11, 2020", "Associated Press, Knox and Shelby join Nashville, Memphis in mask mandate, July 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]