["About this rating", "What’s the toughest split in bowling? Surely, it must be the infamous 7-10 split, right? After all, the 7-10 split is practically the definition of an impossible task. The two pins are as far apart as it is possible for two pins to be on the bowling lane. The 7-10’s image adorns many a bowling shirt and mug, often accompanied by the phrase “Splits Happen” – a deliberate modification of the well-known phrase “shit happens.”", "However, according to science, there are other splits that are tougher.", "But first, let’s back up a bit for the non-bowler. In bowling, the bowler aims his ball at a set of ten pins arranged 60 feet down the lane. The pins are set in a triangle formation with the leading edge of the triangle facing the bowler – much like a rack of billiard balls facing the billiards player. The pins are numbered, with the #1 pin closest to the bowler. The next row of pins are (from left to right) the #2 and #3 pins, and so on, like this:", "The bowler gets two tries (called a frame) to knock down all ten pins. If he or she knocks all ten pins down with the first ball, it’s called a strike. If it takes two balls to knock down all ten pins, that’s called a spare. Most of the time, if there are pins remaining standing after the first ball, they sit next to each other and can easily be picked up with the second ball, such as this 3-5-6 combination:", "Since the ball is slightly wider than the gap between the pins, picking up this spare simply requires the bowler to aim the ball at a slight angle between the 3-5 pins or 3-6 pins (or straight on at the 3 pin.)", "A split occurs when the pins are too far apart for the ball to hit all of them at the same time. In order to “convert” a split to a spare, the bowler has to hit the forward pin on the side and attempt to slide it into the remaining pin. For example, in the 4-7-9 split shown below, the bowler would aim to hit the 4-7 pins so far over on the left that the 4 pin would slide to the right and knock out the 9 pin, too:", "In the 4-7-9 split, it’s possible to convert the split because the 4 pin is slightly forward of the 7 and 9 pins. There’s also some wood remaining on the lane to the left of the 4 pin so the ball doesn’t fall into the gutter. As the bowler hits the 4 pin on the left side, it has room to slide to the right and whack the 9 pin.", "But what do you do with a 7-10 split? The pins are as far apart as they can physically be on a bowling lane. If the bowler tries to hit one pin so far over on the side that it even has the potential to slide over to the other side, the ball is likely to fall in the gutter first. We’ll reveal the technique later. Now, however, let’s find out what could possibly be harder than a 7-10 split.", "Anyone who has walked into a bowling center within the last thirty years or so has seen that manual paper-and-pencil scorekeeping is a thing of the past. Virtually all tenpin bowling houses now have automatic mechanical scoring systems. This allows computer records to be kept of what pins are left after the first ball and how often bowlers pick up their spares.", "In 2015, writer Ben Blatt examined 447,000 frames from the Professional Bowling Association (PBA) dating back to 2003. After eliminating the strikes, he still had 180,000 frames to analyze. So that the statistics would be meaningful, Blatt also eliminated any spare combinations that occurred less than 50 times. Blatt found that although the 7-10 split was difficult, it wasn’t the most difficult shot in bowling.", "An amateur bowler will likely never convert the 7-10 split in his/her lifetime, but a pro bowler manages to do so roughly once out of every 145 tries, or 0.7% of the time. How? It was described as “a good pocket shot.” As one left-handed pro bowler explained it, “I’d aim to hit the 7 pin on the left side so that it would hit the back wall and bounce back to get the 10 pin.” (A right-hander would likely do the reverse.)", "Although what’s in back of the pins looks like a yawning black hole to most bowlers, there is a back wall and it is possible for a pin to bounce off that back wall and then bounce forward again to hit any pins still standing. It happens so rarely, though, that most amateur bowlers have never seen it.", "Two splits were converted even less often than the 7-10 split. The first was the 4-6-7 or 4-6-10 split. These two splits are mirror images of each other, with two forward pins and one in the back. It’s tough to slide a pin straight sideways across the lane. Even combining the two mirror images into one statistic, pro bowlers convert these splits only 0.66% of the time.", "According to Blatt’s analysis, however, the absolute toughest split in bowling is the “Greek Church.” That’s the 4-6-7-9-10 split, named the Greek Church because it supposedly looks like an old-fashioned cathedral with spires:", "(This photo is of St. Andrew’s Cathedral in Patras, Greece.)", "Pro bowlers only pick up this split 0.2% of the time, or once in 390 attempts. Even when combined with its mirror image, the 4-6-7-8-10, the success rate is only 0.4%. Other tough combinations were the 3-7-9, with a 0.8% conversion rate. Its mirror twin, the 2-8-10, had a slightly better success rate at 1.6%. Since the majority of bowlers are right-handers, it’s common for the mirror image combinations to have different success rates. The well-known “Big Four”, or 4-6-7-10 split (this author’s least favorite) has a 1.0% success rate among pro bowlers.", "Rounding out the Top Ten of bowling’s toughest strikes are the 4-6 split and the 7-9 split, with success rates of 1.8% and 2.6%, respectively.", "The 4-6-7-10 \"Big Four\" split", "Blatt, Ben \"What's the Hardest Shot in Bowling?\"\r\n\r\nSlate.  18 February 2015.", "Text message exchange with pro bowler Chris Rose, December 3, 2015.", "Stephanie Larsen is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]