["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Fox started its wall-to-wall coverage of Super Bowl XLVIII on Fox News Sunday, with host Chris Wallace interviewing NFL commissioner Roger Goodell live from MetLife Stadium.", "Goodell talked about the weather, and how it appears conditions will be fine for the Denver Broncos and the Seattle Seahawks. He addressed a proposal to eliminate extra points, saying they’re almost automatic (as we previously reported, they are).", "And he discussed the health of NFL players amid concern that the sport is too violent.", "Goodell offered a defense that we hadn’t heard before.", "\"Our players are living, on average, longer than the average male,\" Goodell said.", "After serious talk about concussions in the NFL and some prominent suicides in the sport, we wondered about Goodell’s claim. It’s accurate, it turns out, but requires some additional explanation.", "The National Institute for Occupational Safety and Health (NIOSH), a government research agency within the Centers for Disease Control and Prevention, studied the mortality rates of former NFL football players in a report released in 2012.", "The study included nearly all NFL players who played in the league for five or more years from 1959 to 1988 -- a pool of 3,439 men. Researchers said based on current mortality rates, they expected 625 players to be deceased. But by the end of 2007, only 334 were.", "\"We found the players in our study had a much lower rate of death overall compared to men in the general population,\" researchers wrote to the NFL players in a March 2012 letter. \"This means that, on average, NFL players are actually living longer than men in the general  population.\"", "The former NFL players also had lower rates of heart disease and cancer compared to average males, the report found.", "There are a few important caveats to point out.", "NFL players aren't like your average male in a number of ways. They are professional athletes, many of whom might be wealthy, and they are likely to have access to quality health care.", "The report also raised red flags.", "Researchers found that men who were considered obese, those with a Body Mass Index of 30 or more when they played, had twice the risk of death from heart disease than other players. African-American players also had a higher heart disease risk than Caucasian players, the report found.", "Another important note: Because the study excludes modern-day players, it fails to account for the changing physique of today’s football player.", "Of the 3,439 men in the NIOSH study, only 1 percent had a Body Mass Index of 35 or more when they played, and 33 percent had a Body Mass Index between 30 and 35.", "Today’s NFL players are much bigger.", "To create an example, we looked at the current 53-man roster of the Denver Broncos and calculated each player’s Body Mass Index using a calculator from the National Institutes of Health. Of 53 Broncos players, 13 have a Body Index above 35 (24.5 percent) and another 14 have a Body Mass Index between 30 and 35 (26.4 percent).", "That’s an important distinction that may affect the results of future studies.", "Our ruling", "Goodell said that NFL \"players are living, on average, longer than the average male.\" His claim is backed up by a government study that examined former NFL players who played from 1959 to 1988.", "But the study, which was released in 2012, did conclude that bigger players had an increased risk of dying from heart disease and did not evaluate more modern-day players. Modern-day players are bigger.", "We rate Goodell’s statement Mostly True.", "Fox News Sunday, interview with Roger Goodell, Feb. 2, 2014", "NIOSH, \"Heart health concerns for NFL Players,\" accessed Feb. 2, 2014", "New York Times, \"N.F.L. Players Live Longer Than Other Men, Study Says,\" May 8, 2012", "Denver Broncos roster, accessed Feb. 2, 2014", "The Big Lead, \"Breaking Down the Study on NFL Life Expectancy,\" May 9, 2012", "The American Journal of Cardiology, \"Body Mass Index, Playing Position, Race, and the Cardiovascular Mortality of Retired Professional Football Players,\" Jan. 27, 2012", "National Institutes of Health, Body Mass Index calculator, accessed Feb. 2, 2014", "Email interview with Greg Aiello and Brian McCarthy, spokesmen for the NFL, Feb. 2, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]