["An image of a Vermont mansion is being mislabeled as belonging to Sen. Bernie Sanders", "Sanders owns three homes, but this property is not one of them.", "A viral image of a sprawling Vermont estate is going around social media alongside the claim that the home is owned by Sen. Bernie Sanders.", "Text above the photo says, \"This is Bernie Sanders home, one of three in fact, in Vermont. How does a public servant afford opulence like this. This needs to be shared far and wide!!!!", "The photo is mislabeled. Sanders doesn’t own the property.", "The image was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "A reverse-image search shows that the estate is located in Stowe, Vt, which is about 25 miles away from Burlington, where Sanders served as mayor until 1989.", "The Democratic presidential candidate does own three properties, as the post states, but this is not one of them.", "The estate in the image was last sold for almost $3 million in 2017, and Sanders is not listed as the owner.", "We reached out to Sanders’ campaign about the photo but did not hear back in time of publication.", "As other news outlets have reported, the Sanders family owns two homes in Vermont and one residence in Washington D.C.", "The family owns a home in Burlington that was purchased for $405,000 in 2009; a summer residence in North Hero, Vt, that was bought for $575,000 in 2016 and a townhouse in Washington D.C., that Sanders purchased after he was elected to the United States Senate in 2007 for $488,999.", "Sanders earns a $174,000 salary as a senator and has made around $1.7 million in book royalties since 2016.", "But he doesn’t own the $3 million estate in the image. We rate it False.", "Facebook post, March 2, 2020", "Google, reverse-image search, March 6, 2020", "Zillow, Vermont home details, Accessed March 6, 2020", "Heavy.com, Bernie Sanders Has Three Houses: See Photos of the Latest, June 2019", "Snopes, Bernie Sanders Buys $575,000 Summer Home, Prompting Controversy, Aug. 10, 2016", "New York Post, The million-dollar property listings of Bernie Sanders and Mike Bloomberg, Feb. 21, 2020", "Business Insider, Bernie Sanders has made $1.75 million in book royalties since 2016 — but he's still one of the least wealthy US senators. Here's what we know about his finances and assets, Feb. 19, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]