["Several Facebook and Twitter users shared a 45-second video of a vegetable vendor beaten up by another man who is accompanied by at least three other persons. He asks the vendor for an identity card and his name. The vendor responded that he does not have an ID card at the moment and his name is Mohammad Saleem. Thereafter, Saleem was abused and hit with a stick. The man hitting Saleem said, “You people are doing jihad.” All the men in the video, including Saleem, are wearing masks.", "From the Facebook page FekuExpress2.0, the video has received 1,200 shares and over 30,00 views.", "Muslims are attacked for spreading", "This happening with Muslims across the India.", "This man asked ID Card and name of this vendor, when he said “Mohammad Saleem” he was abused and beaten up brutally.", "Anti-Muslim propaganda run by Media has consequences on ground.", "Muslims are attacked for spreading #Covid_19 .", "Posted by FekuExpress2.0 on Saturday, 11 April 2020", "Several people on social media have claimed, “This man asked ID Card and name of this vendor, when he said “Mohammad Saleem” he was abused and beaten up brutally.” Alt News has also received several requests to fact-check this on WhatsApp (+91 76000 11160) and on our official Android application.", "Alt News did a keyframe analysis of the video and spotted the number plate of a bike at the two-second mark. We looked up DL 9S BX 9250 on the national motor registry and found that the vehicle’s registration is from New Delhi.", "At the 47-second mark, we spotted an advertisement for a spoken English centre along with the phone number 98715 42848 on the wall on the right-hand side. Using this as a clue, Alt News performed a keyword search on Google and found English Mania in Badarpur, South East Delhi.", "On April 11, Aam Aadmi Party MLA Somnath Bharti quote-tweeted the video, tagged Commissioner of Police, Delhi, Shri S. N. Shrivastava and asked, “If your police can bring back stolen purse of niece of PM within 1-2 days, I am sure that this shameless creature can be traced by you. Plz do justice with him and assure Delhi that any and every attempt to divide Delhi on religious lines will be dealt with iron hands.”", "DCP South East Delhi responded to Bharti via quote-tweet and said, “Cognizance of the incident has already been taken.FIR has been #registered under appropriate sections of law & the perpetrator of crime has been #arrested.Such incidents shall not be tolerated at any cost & law will take its own course against such persons. @DelhiPolice”", "Cognizance of the incident has already been taken.FIR has been #registered under appropriate sections of law & the perpetrator of crime has been #arrested.Such incidents shall not be tolerated at any cost & law will take its own course against such persons. @DelhiPolice https://t.co/aLNwkpeLeJ", "— DCP South East Delhi (@DCPSEastDelhi) April 13, 2020", "Alt News spoke to RP Meena, DCP South East Delhi. He shared the press note addressing the viral video. According to the Delhi Police press note on April 13, the incident took place on April 11 at Tajpur road, Badarpur. Delhi Police looked into the matter after the Cyber Cell shared the viral video posted on Twitter.", "The statement added that an enquiry was made after identifying that the bike DL 9S BX9250 belonged to Sudhanshu from Molarband, New Delhi. Sudhanshu informed that this incident happened at Tajpur Road and he identified the man who hit the vegetable seller as Praveen Babbar resident of Badarpur. Babbar has been arrested and an FIR has been filed under India Penal Code Sections 153 (Wantonly giving provocation with intent to cause riot—if rioting be committed—if not committed), 355 (Assault or criminal force with intent to dishonour person, otherwise than on grave provocation), 298 (Uttering, words, etc., with deliberate intent to wound the religious feelings of any person) and 323 (Punishment for voluntarily causing hurt) at Badarpur police station.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]