["The claim has been shared more than 400 times since it was published on Facebook here on January 17, 2019.", "The lengthy Thai-language caption reads, in part: “Bitter melon has cancer prevention properties, which can effectively cure cancer. Hot bitter melon has an effect on cyst and tumour and is proven to cure all types of cancer.", "“The treatment with bitter melon extract will only destroy cancer cells, and does not affect the healthy cells.”", "Similar claims about bitter melon were shared online in 2009 here and more recently on Facebook here, here, here and here and on Twitter here. It was also published in 2015 here by Health Info in Thailand, a public interest website that reports health information and statistics.", "The claim is misleading, according to medical experts.", "Thailand’s National Cancer Institute maintains that while bitter melon does contain healthy antioxidants, the fruit is not an effective treatment or cure for cancer.", "The agency published its assessment here on May 28, 2020, in a report in Thai Cancer News, a website dedicated to information on cancer. The Thai-language headline translates to English as: “Fake news, don't share! Hot Bitter Melon Affects Cysts and Tumours, and Can Cure all Types of Cancer.”", "“A research report at the cellular level in the laboratory found that bitter melon contains antioxidants that may help fight cancer cells. However, drinking hot bitter gourd is not associated with cancer treatment and cannot be treated for cancer,” the report reads.", "The National News Bureau of Thailand also refuted the claim in a report published here on June 22, 2020. The article is titled “National Cancer Institute warns about fake news: Hot Bitter Melon Affects Cysts and Tumours, and Can Cure all Types of Cancer.”", "The Sure and Share Centre, a Thai fact-checking organisation, debunked the same claim about bitter melon in this video report posted to YouTube on January 30, 2019.", "AFP has debunked multiple other claims about false cancer treatments, such as drinking cold water and eating a no sugar diet.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]