["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Is President Donald Trump sending chain mail? A recent Facebook post says he’s \"asking everyone to forward this email.\"", "\"In three days, most people in the United States will have this message,\" continues the Sept. 25 post. \"This is an idea that should be passed around, regardless of political party. The TRUMP Rules: Congressional Reform Act of 2017 1. No tenure/no pension. A Congressman/woman collects a salary while in office and receives no pay when they’re out of office. And, no more perks go with them.\"", "Other rules described in the post include requiring congressional representatives to participate in Social Security, purchase their own retirement plans, and buy health care through the same system as the citizens they represent. They also prohibit Congress from voting to increase representatives’ pay.", "This post, which has been shared more than 75,000 times, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Someone might be spamming you about this phony legislation, but it’s not the president.", "Virtually identical versions of this post have appeared online as early as 2009. That year it was supposedly Warren Buffett asking people to forward the email about a proposed constitutional amendment to a minimum of 20 people on their address list.", "In 2011, it was called the \"Congressional Reform Act of 2011\" and it didn’t mention Trump. (FactCheck.org debunked several of the message’s claims back then and revisited the topic again as it resurfaced with the president’s name attached.)", "In 2012, Warren Buffett was at it again!", "In 2018, the message appeared as a petition for the Congressional Reform Act of 2018 posted on ipetitions.com.", "And now, in 2019, we’re here to say that if you forward this rebooted chain letter, you’ll have seven years of bad luck.", "We rate this Facebook post Pants on Fire!", "Facebook post, Sept. 25, 2019", "Snopes, The 28th Amendment, Dec. 10, 2009", "FactCheck.org, Congressional Reform Act, March 18, 2011", "FactCheck.org, Posts resurface made-up \"Congressional Reform\" bill, Oct. 23, 2019", "U.S. News & World Report, Warren Buffett and the mythical \"Congressional Reform Act,\" March 13, 2012", "Ipetitions.com, Congressional Reform Act of 2018, visited Oct. 24, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]