["About this rating", "A ban prohibiting prison visitors in Virginia from wearing tampons was announced in September 2018 and would have taken effect on 6 October 2018.", "After public criticism by activist groups, the ban was \"suspended\" and has gone unenforced.", "In September 2018, corrections officials in Virginia briefly implemented new limits on female visitors to prisons, citing concerns over incoming contraband. But after activist groups highlighted the policy, it was dropped before it actually went into effect.", "David Robinson, chief of operations for the state Department of Corrections (DOC), announced the controversial policy on 17 September 2018, telling staffers in a memo that \"As a result of recent inquiries about feminine hygiene products being an ideal way to conceal contraband ... offender visitors shall be notified that the use of tampons or menstrual cup products are no longer permitted to be worn during visitation.\"", "On 22 September 2018, the activist group the Prison Reform Movement brought the change to light, posting a similar memo to employees of the Nottoway Correctional Center issued by warden David Call:", "VA is now NOT allowing visitors to wear a tampon or menstrual cup during visits....this is way over the line..... pic.twitter.com/9JxzWrT6cS", "— PrisonReformMovement (@PrisonReformMvt) September 23, 2018", "DOC spokesperson Lisa Kinney said at the time that employees would be exempt from the ban, which was to have taken effect on 6 October 2018. According to Kinney, prison visitors accounted for 58 of 62 instances of contraband smuggling between 1 February 2018 and 31 August 2018, and the policy change would cut down on prisoner overdoses.", "\"There have been many instances in which visitors have attempted to smuggle drugs into our prisons by concealing those drugs in a body cavity, including the vagina,\" Kinney said.", "Besides the Prison Reform Movement, the American Civil Liberties Union of Virginia also condemned the policy. The latter group's executive director, Claire Gastañega, said in a statement that:", "Helping people who are housed in jail or prison stay connected to friends, families, and communities is critical to rehabilitation and eventual, successful re-entry to society. Any policy that discourages visitors is, therefore, one that should be subject to the most exacting and careful review. In addition, a policy like this one that requires those who wish to visit people who are incarcerated to set aside their dignity and health is simply unacceptable.", "On 25 September 2018, Secretary of Public Safety Brian Moran announced that he would suspend the ban \"until a more thorough review of its implementation and potential consequences are considered.\"", "Green, Frank.   \"Virginia Prison Visitors to Be Barred from Wearing Tampons; Contraband Concern Cited.\"\r\n    Richmond Times-Dispatch.   24 September 2018.", "Jackman, Tom. \"Update: Va. Suspends Ban on Tampons in Prison.\"\r\n    The Washington Post.   25 September 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]