["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "One part of former Florida Gov. Jeb Bush’s resume sets him apart from many of the other potential Republican presidential contenders: a longstanding focus on education policy.", "As he travels around the country giving speeches -- and titillating political journalists and donors -- Bush has highlighted some of the education policies he advocated during his gubernatorial tenure, which relied heavily on achievement benchmarks, and chastised those who resisted.", "Bush likes to remind audiences how far Florida came on education benchmarks and how far the nation still has to go to raise its standards.", "During a May 12 speech at the Manhattan Institute for Policy Research, a conservative think-tank, Bush said the U.S. lags behind other countries -- including some unexpected nations -- on some key educational measures.", "\"There is nothing more critical to our long-term economic security than a wholesale transformation of our education system,\" Bush said. \"The latest results from the Program for International Student Assessment, better known as PISA, only confirm the urgency of our charge.\"", "He continued, \"U.S. teenagers have now fallen behind their counterparts in Ireland, Poland and even Vietnam in math and science. Between 2003 and 2012, the United States flatlined its results, but many other countries have made a command focus on this. ... There have been more resources placed in this, and they have higher expectations of their children, and they have gotten a better result. So for those that think … poverty is the reason why we haven’t had the educational gains, I guess we should really look to the wealthy countries like Vietnam to determine whether we should be successful. Come on!\"", "We thought we’d check whether Bush was correct that teenagers in Ireland, Poland and Vietnam rank higher than their U.S. counterparts in math and science.", "International comparison data", "Bush cited the 2012 Program for International Student Assessment, or PISA, which includes every member country of the Organization for Economic Cooperation and Development -- a group of advanced industrialized nations -- as well as some non-member countries. In the United States, PISA is conducted by the federal government’s National Center for Education Statistics. The United States sampled schools nationwide. For the United States and the countries Bush cited, the data includes students at both public and private schools.", "PISA compares 15-year-olds from more than 60 countries in math, science and reading every three years. The study rates students’ levels of proficiency between 1 and 6 -- with 6 being the highest.", "Nine percent of U.S. teenagers achieved the PISA math proficiency level 5 or higher, while in Poland it was 17 percent, Vietnam 13 percent and Ireland 11 percent.", "In science, 7 percent of U.S. teenagers achieved the PISA science proficiency level 5 or higher. In Poland and Ireland, 11 percent of teenagers hit that mark. In Vietnam, however, the percent hitting that proficiency level was 8. That’s just one point above the United States, a level that’s not considered \"measurably different,\" according to a research analyst at NCES.", "Education experts weigh in on PISA", "We sent Bush’s claim to a few education experts and asked whether they had any concerns about the PISA evaluations or Bush’s interpretations of the data.", "\"Unfortunately (for the country), he is dead right,\" said Eric Hanushek, a senior fellow at Stanford University and co-author of a book that includes a discussion of how such international test results are related to economic growth. \"I am convinced that it is a good index of important skills, particularly the math and science scores.\"", "Jason Amos, a spokesman for the Alliance for Excellent Education, a policy organization that focuses on at-risk high school students, said Bush \"is citing PISA correctly.\"", "University of Iowa education professor David Bills said, \"The big question for me is that the distribution in the U.S. is so different than the countries we’re being compared with. The U.S. just tolerates a lot of really low achievement, overwhelmingly among poorer kids.\" While top American students are internationally competitive, \"relative to other countries we badly underinvest in poor kids,\" Bills said. \"That tends to bring the overall mean down, mainly because U.S. scores are just much more skewed than they are elsewhere.\"", "Like any educational assessment, PISA does have its critics, and much of the criticism has focused on either a general backlash against the \"escalation of testing\" or debate about whether PISA’s No. 1 ranking of China stems from its focus on Shanghai, a comparatively wealthy city.", "Yong Zhao, University of Oregon education professor, has written several blog posts critical of PISA, saying the comparison \"glorifies educational authoritarianism.\"", "Zhao told PolitiFact that the statistics cited by Bush are correct. However, he said that his statement that U.S. teenagers \"have now fallen behind\" counterparts in Ireland, Poland and Vietnam is misleading.", "\"The U.S. PISA rankings were below Ireland and Poland in 2003, and Vietnam did not participate until 2012. So the U.S. has not fallen behind. ... in terms of international test scores, the U.S. has always had poor performance, behind many countries. So there is no \"falling behind.\" (You can read more about his argument in his \"Numbers can lie\"  blog.)", "Our ruling", "Bush said that \"U.S. teenagers have now fallen behind their counterparts in Ireland, Poland and even Vietnam in math and science.\"", "Bush correctly cites data from PISA showing the United States trails the three countries in question. But it’s not so much that the United States has \"fallen behind\" -- the U.S. has been behind Ireland and Poland for years, and Vietnam was first tested in 2012.", "On balance, we rate the claim Mostly True.", "Manhattan Institute, Speech by former Gov. Jeb Bush, May 12, 2014", "U.S. Department of Education National Center for Education Statistics,  Program for International Student Assessment and math proficiency and science proficiency, 2012", "The Guardian, \"OECD and Pisa tests are damaging education worldwide - academics,\" May 5, 2014", "Yong Zhao, \"How does PISA put the world at risk,\" April 2014", "Brookings Institution Brown Center Blackboard blog by Tom Loveless, \"PISA’s China problem continues: response to Schleicher, Zhang, and Tucker,\" Jan. 8, 2014", "Education Week, \"Response to Brookings Institution attack on PISA,\" Dec. 26, 2013", "PolitiFact, \"Jeb Bush touts education gains in Wall Street Journal piece,\" Jan. 3, 2011", "Interview, Jaryn Emhof, spokeswoman for former Gov. Jeb Bush, May 14, 2014", "Interview, Eric Hanushek, Paul and Jean Hanna Senior Fellow at the Hoover Institution of Stanford University and co-author of Endangering prosperity: A global view of the American school. Washington, D.C.: Brookings Institution Press, May 14, 2014", "Interview, Jason Amos, spokesman Alliance for Excellent Education, May 14, 2014", "Interview, Yong Zhao, education professor University of Oregon, May 14, 2014", "Interview, Patrick Gonzales, education research analyst National Center for Education Statistics, May 14, 2014", "Interview, David Bills, education professor University of Iowa, May 15, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]