["By Angelo Fichera", "Posted on July 18, 2018 | Updated on May 23, 2019 | Corrected on July 21, 2018", "Q: Is joining antifa now illegal and “punishable by 15 years in prison”?", "A: No. A headline on a website known for distorting news incorrectly describes a House bill. It has not become law and it would not make joining antifa illegal.", "Legislation introduced in the U.S. House of Representatives in recent weeks would crack down on the aggressive activities associated with the group antifa — a loosely organized network of “anti-fascists.” But there has been no action on the bill since its June 8 introduction.", "That’s a far cry from the false headline on the website neonnettle.com, which has repeatedly published stories that distort the facts. In this case, it inaccurately describes the proposal as a law, claiming: “Joining ‘Soros Funded’ Antifa Is Now Illegal, Punishable By 15 Years In Prison.”", "The headline also misrepresents what it would do. If it became law, the bill wouldn’t make “joining” the group “illegal.”", "Beyond the headline, the July 12 story goes on to accurately refer to the legislation — called the Unmasking Antifa Act of 2018 — as a bill, not a law, and correctly quotes excerpts from the bill.", "The legislation, introduced by New York Republican Rep. Daniel M. Donovan Jr., would punish any individual “in disguise, including while wearing a mask” who “injures, oppresses, threatens, or intimidates” any person that is exercising “any right or privilege secured to him by the Constitution or laws of the United States.” They would be fined, imprisoned for up to 15 years, or both.", "Antifa members sometimes wear masks during demonstrations and are known for employing aggressive tactics. While there is no official leadership, those who identify with the group often combat racism and have denounced capitalism. They have confronted far-right groups in the streets, like at the 2017 rally of white nationalists in Charlottesville, Virginia. Some have dubbed the group the “violent left.”", "But nothing claimed in the headline on neonnettle.com has happened. The bill is still awaiting a hearing by the House Judiciary Committee.", "Correction, July 21: Our original story misstated the maximum possible prison sentence. We updated the story to say the proposed bill carries a penalty of up to 15 years.", "Update, April 29, 2019: Months after our story was published, neonnettle.com posted a correction to its article noting, in part, that “a previous version of this article stated that joining Antifa had been made illegal but this is incorrect. The bill was proposed but never made law and the measure was aimed at cracking down on the aggressive activities associated with the group Antifa, but not joining it.” The story’s false headline, however, remains intact — which the site’s director said is due to technical issues.", "Update, May 23, 2019: Nearly a year after posting its story, Neonnettle.com updated the headline, which now reads, “Bill Proposes Crackdown on Activities Associated with Antifa.” We should note, however, that the story is now outdated. The bill in question expired at the end of the 115th Congress, and has not been reintroduced. Its sponsor, New York Rep. Dan Donovan, lost reelection in 2018.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "Hayden, Michael Edison. “Explaining antifa protests in the wake of Charlottesville.” ABC News. 24 Aug 2017.", "Newton, Daniel. “Joining ‘Soros Funded’ Antifa Is Now Illegal, Punishable By 15 Years In Prison.” Neonnettle.com. 12 Jul 2018.", "Stanglin, Doug. “What is antifa and what does the movement want?” USA Today. 23 Aug 2017.", "U.S. House. “H.R.6054, Unmasking Antifa Act of 2018.” (as introduced 8 Jun 2018.)", "“Who are the Antifa?” Anti-Defamation League. Accessed 17 Jul 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]