["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In an ongoing campaign to sow doubt about the validity of the 2020 presidential election, hardcore supporters of outgoing U.S. President Donald Trump and related QAnon conspiracy theorists have suggested a corrupt connection between U.S. Attorney General Bill Barr and the company Dominion Voting Systems. Dominion has been a subject of myriad debunked conspiracy theories regarding \"flipped votes,\" and in late November 2020 Barr became the target of Trumpist scorn after he stated he had seen no evidence of widespread voter fraud:", "The allegation is that Barr was appointed to serve on, and currently is a member of, the board of directors for Dominion. This is flawed for several reasons, but a fairly central problem is that a news release that accompanied the above tweet refers to the Virginia-based Energy behemoth Dominion Energy Services, Inc., which has nothing whatsoever to do with the company Dominion Voting Services.", "It is true that Barr was elected to serve on the board of directors of Dominion Energy. This occurred over a decade ago, in December 2009. In February 2019, when Barr was confirmed as Trump's attorney general, he resigned that position, as noted in a company news release:", "The company ... announced the resignation from the board of William P. Barr, effective Feb. 12, 2019. Barr was nominated by President Donald Trump in December to be U.S. Attorney General, and he was confirmed today. Barr joined Dominion Energy's board in 2009 and chaired the Compensation, Governance and Nominating Committee at the time of his resignation.", "It is not true, however, that Dominion Energy is related to Dominion Voting. An attempt at making this connection focused on the false assertion that Dominion Voting Services is or was one of the \"over 240\" subsidiaries of Dominion Energy. Indeed, Dominion Energy, Inc. owns several subsidiaries, but Dominion Voting Services — or any election-related company — is not one of them, according to their most recent SEC filings.", "As there is no connection outside of the shared use of the word \"Dominion\" in their company's name, there is also no connection — even an out-of-date one — between Barr and Dominion Voting Systems. The claim therefore is \"False.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]