["About this rating", "In July 2019, news reports announced that Halle Bailey, half of the sister duo Chloe x Halle, would be starring as Ariel in an upcoming live-action remake of Disney's version of \"The Little Mermaid.\" That news was met in some quarters, Emma Teitel wrote, with \"an avalanche of hateful, racist comments from white people who cannot abide a Black Ariel; white people who are livid that anyone other than a Caucasian red-head was cast in the role.\"", "This brouhaha was soon followed by an article whose headline declared that conservative political commentator Tomi Lahren had responded to the controversy by defiantly proclaiming, “Everyone knows mermaids are white, just like Santa and Jesus!\":", "“This is just a crock of liberal, hippy-dippy, uber-PC, social Marxism bullcrap, and everyone knows it,” LastCallForAlcohol said emphatically. “Because anyone who’s educated even the slightest in mermology knows that merpeople are all white. Because they’re made in God’s image but crossed with a fish. And um, sorry libs, God’s white, and we know he’s white because his son, Jesus, was white too!”", "Disney is “blackwashing mermaids just like liberals tried to blackwash Jesus” according to Ms. LolipopGuild.", "“Everyone knows mermaids are white, just like Santa and Jesus,” Tillamook said, “and all the blackwashing and fictional white character genocide in the world can’t cover-up the truth! They might have the fact-based truth, but we have the truth that’s in our hearts.", "Although the racial depictions of figures such as Jesus and Santa Claus have sometimes been the subjects of contention, many viewers who queried us about this article apparently didn't read past its headline or social media lead, because its over-the-top style and its publication on a website called Alternative Facts were obvious clues to its nature as a piece of satire rather than news reporting.", "Alternative Facts (whose slogan is \"YOUR OWN OPINIONS. YOUR OWN FACTS. YOUR OWN REALITY.\") notes in a footer that all its \"material is satirical in nature,\" and the Tomi Lahren piece was penned by writer/comedian James Schlarmann and tagged as \"satire\" and \"political satire.\"", "Schlarmann, James.   \"Tomi Lahren: 'Everyone Knows Mermaids Are White, Just Like Santa and Jesus!'\"\r\n    Alternative Facts.   5 July 2019.", "Teitel, Emma.   \"Debate Over Little Mermaid’s Skin Reveals the Colour of People’s Prejudice.\"\r\n    The [Toronto] Star.   4 July 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]