["To test for the new coronavirus, take a deep breath and hold for more than 10 seconds. If you complete it successfully without coughing, discomfort, stuffiness or tightness it proves there is no fibrosis in the lungs, basically indicating no infection.", "There is no evidence to suggest this test can show if you have the new coronavirus.", "If the new coronavirus gets into your mouth, drinking water or other liquids will wash them down through the oesophagus. Once they’re in the stomach, the acid will kill the virus. If you don't drink enough water more regularly, the virus can enter your windpipes and into the lungs.", "This is incorrect. Drinking water does not prevent an infection.", "If you have a runny nose and sputum, you have a common cold, not Covid-19.", "These are the symptoms for the common cold, but they don’t rule out Covid-19.", "Coronavirus pneumonia is a dry cough with no runny nose.", "Some Covid-19 patients do get pneumonia, and one of the symptoms is a dry cough. A runny nose doesn’t rule out Covid-19.", "This new virus is not heat-resistant and will be killed by a temperature of just 26/27 degrees. It hates the Sun.", "There’s no evidence for this. There’s evidence that similar viruses transmit less well in the heat, but many countries with reported Covid-19 cases are experiencing temperatures higher than this.", "If someone with the new coronavirus sneezes, it travels about 10 feet before it drops to the ground and is no longer airborne.", "How far the droplets spread from a sneeze depends on environmental factors, but it is likely to be several metres.", "If it drops on a metal surface it will live for at least 12 hours - so if you come into contact with any metal surface - wash your hands as soon as you can with a bacterial soap.", "We don’t know how long the virus survives on surfaces yet—it may be between hours and days.", "On fabric it can survive for 6-12 hours. normal laundry detergent will kill it.", "There’s no evidence yet that the virus can survive in clothing and be transmitted this way. Any soiled clothing should be thoroughly washed.", "Drinking warm water is effective for all viruses. Try not to drink liquids with ice.", "There’s no evidence that the temperature of liquids consumed can either protect you from or cure diseases caused by viruses.", "Wash your hands frequently as the virus can only live on your hands for 5-10 minutes.", "We don’t know how long the virus can last on the skin, especially not down to the minute. But you should regularly wash your hands.", "You should also gargle as a prevention. A simple solution of salt in warm water will suffice.", "There’s no evidence that this works as a preventative or a cure for the virus.", "The symptoms of Covid-19 are a sore throat lasting 3 or 4 days. The virus then blends into nasal fluid, enters the trachea and then the lungs causing pneumonia. With pneumonia comes high fever and difficulty breathing. The nasal congestion feels like you're drowning", "This is a roughly accurate description of the most common symptoms, although not everyone with Covid-19 gets pneumonia, and the symptoms may not come in this exact order or at these times. The NHS does not mention nasal congestion that ‘feels like drowning’ as a specific symptom for Covid-19.", "Update: official UK guidance on how to avoid catching or spreading the new coronavirus has changed since we first wrote this article. You can read the latest advice on the NHS website here.A number of posts that make the same claims about the symptoms and prevention of the new coronavirus (that causes Covid-19) have been shared on Facebook.", "The same text, claiming to be from a member of the Stanford hospital board, has also been shared. Stanford University has since announced that it was not the source of the misinformation.", "The claims are a mixture of accurate and inaccurate. While the post does include some basic advice that is worth following, it also makes claims which could lead people to mis-diagnose themselves, and suggests ways of preventing infection that won’t work.", "Honesty in public debate matters", "You can help us take action – and get our regular free email", "I’m in", "The post claims that by the time you’re likely to be hospitalised with Covid-19 your lungs are likely to be “50% fibrosis” and recommends a test attributed to Japanese doctors. It says to hold your breath for 10 seconds to see if you have the new coronavirus (the post claims that if you can’t hold your breath that long then you know you have the virus.)", "There is no evidence to suggest that holding your breath for 10 seconds can show if you have the new coronavirus.", "Lung fibrosis, which is scarring in the lungs, is a potential outcome in severe cases of Covid-19. Professor Ben Neuman, Chair of Biological Sciences at Texas A&M University-Texarkana, told Full Fact that while it is true that the infection could cause fibrosis, holding your breath would not necessarily diagnose if you have this.", "In addition, the post claims that sipping water regularly will prevent infection by driving the virus into your stomach where it will be killed by the acid.", "This is incorrect. Sipping water regularly does not prevent infection and there have been cases of the virus passing into people’s intestines and affecting them.", "We have written about both these claims in more detail before.", "We have written about these in more detail here.", "The first two claims are about potential symptoms of Covid-19:", "“1. If you have a runny nose and sputum, you have a common cold", "2. Coronavirus pneumonia is a dry cough with no runny nose.”", "A runny nose and sputum (phlegm coughed up from the lungs) are not as common as other symptoms of Covid-19, such as a high temperature and a new, continuous cough. But having a runny nose and sputum doesn’t rule out having Covid-19.", "The term pneumonia describes the swelling of lung tissue. It’s usually caused by a bacterial infection, and has been seen in Covid-19 patients. One of the most common symptoms of Covid-19 is a dry cough. But as we’ve already said, having a runny nose doesn’t rule out Covid-19.", "Other claims relate to factors that may affect the survival of the new coronavirus:", "“3. This new virus is not heat-resistant and will be killed by a temperature of just 26/27 degrees. It hates the Sun.”", "Because the virus is relatively new to us, there’s a lot we don’t know about it, like the exact temperatures it can withstand (although there have been cases recorded in countries that often have temperatures above 27 degrees). We’ve written about this claim in more detail before.", "“4. If someone sneezes with it, it takes about 10 feet before it drops to the ground and is no longer airborne.”", "The evidence suggests that the new virus, similar to other coronaviruses, is transmitted by droplets produced by coughs and sneezes. How far droplets spread when you sneeze depends on a range of factors, including humidity and temperature, but can be as far as several meters.", "The NHS says you should cover your mouth and nose with a tissue or sleeve, but not your hands, when you sneeze, and put used tissues in the bin and wash your hands afterwards.", "“5. If it drops on a metal surface it will live for at least 12 hours - so if you come into contact with any metal surface - wash your hands as soon as you can with a bacterial soap.”", "We don’t know how long it can survive on surfaces, although we’ve written more about that here. Washing your hands well with soap is good advice to prevent you picking up germs from surfaces. Cleaning advice from the UK government for people staying at home because of suspected Covid-19 symptoms can be found here.", "“6. On fabric it can survive for 6-12 hours. normal laundry detergent will kill it.”", "We haven’t found any reliable source saying exactly how long the virus can survive on fabric. For households with suspected Covid-19, Public Health England has advised that laundry items can still be washed together and according to manufacturer's instructions, but warned against shaking dirty laundry “to minimise the possibility of dispersing virus through the air”.", "The post makes four more claims about how to prevent catching the virus, including warnings to drink warm not cold liquids, that the virus can live on hands for 5-10 minutes, and that gargling with salt water will prevent Covid 19.", "We can’t find any scientific evidence that warm water can cure or prevent diseases caused by viruses, although hot drinks can be a comfort to those suffering with coughs and colds. Washing your hands thoroughly, and often, is also good advice. It’s not clear exactly how long the virus can ‘survive’ on your hands, especially not down to the minute. But the post is right to mention that rubbing your eyes, mouth or nose is problematic if you haven’t washed your hands, because these areas are a prime entry point for viruses and bacteria.", "Gargling with salt water is recommended by the NHS for adults who have a sore throat, but only to relieve symptoms once you have caught it, not as a preventative measure. The World Health Organisation says that there’s no evidence saline can prevent Covid-19. We have written more about this claim here.", "“1. It will first infect the throat, so you'll have a sore throat lasting 3/4 days", "2. The virus then blends into a nasal fluid that enters the trachea and then the lungs, causing pneumonia. This takes about 5/6 days further.", "3. With the pneumonia comes high fever and difficulty in breathing.", "4. The nasal congestion is not like the normal kind. You feel like you're drowning. It's imperative you then seek immediate attention.”", "These are a roughly accurate description of the common symptoms of Covid-19, although some patients may experience other symptoms and the timing of those symptoms may differ.", "The CDC says that a sore throat has been reported “in some patients”. More commonly, symptoms include fever, a cough, muscle pain or fatigue and shortness of breath. In more severe cases Covid-19 can cause pneumonia. The NHS does not mention nasal congestion that ‘feels like drowning’ as a specific symptom for Covid-19.", "If you experience either of the two major symptoms of Covid-19 the NHS says to look out for (a high temperature or a continuous cough) you should stay at home for seven days and you do not need to contact their 111 service. If your fever is gone after seven days you can return to your normal routine (even if you still have a cough), but if you still have a fever remain at home until your temperature returns to normal levels.", "New advice published on 18 May now says that anyone experiencing loss of taste or smell (known as 'anosmia') should also self-isolate.", "If these symptoms don’t go away after seven days, if you can’t cope with them at home or if you get worse then use the NHS online 111 coronavirus service. If you can’t get the help you need there then you should call the 111 phone service.", "If you have a medical emergency, you should still call 999 as you would normally.", "Update 18 May 2020", "This article was updated to reflect new government guidance about symptoms including a loss of taste or smell.", "Update 30 July 2020", "We've updated this article to reflect the latest advice from the government.", "This article is part of our work fact checking potentially false pictures, videos and stories on Facebook. You can read more about this—and find out how to report Facebook content—here.\n\n        For the purposes of that scheme, we’ve rated this claim as partly false\n            because it makes a number of claims about the symptoms of and ways to prevent Covid-19, and some are false.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]