["About this rating", "As millions of Americans went to the polls to vote in the U.S. midterm elections in November 2018, propagandists took to social media to spread disinformation. Twitter user Real Dan Jordan, for instance, posted a video which reportedly showed CNN anchor Don Lemon laughing as Democrats celebrated a \"blue wave\" by burning U.S. flags.", "The video has since been deleted, but a screenshot from the post continued to circulate thanks to Facebook pages such as \"Trump Crusaders\":", "Desecration of the American flag is an insult to the soldiers who died for our great country and died for our freedoms that we have and use every day and people are so selfish with these actions it's sickening. #DonLemon of #CNN laughing at the burning of our #AmericanFlag. #disgusting behavior FROM THE LEFT!", "Several other images purportedly showing Lemon laughing at a burning flag were also shared on social media:", "This item is a hoax: the images were not taken from a genuine CNN broadcast, Don Lemon did not laugh at a series of burning U.S. flags, CNN did not run the chyron \"Dems Celebrate 'Blue Wave' Burning Flags on Election Day,\" nor were the pictured flags burned during the 2018 midterm elections.", "The images of Lemon laughing were taken from a February 2018 broadcast and show the CNN anchor giggling about a joke concerning Omarosa Manigault:", "The images of burning flags came from a variety of incidents, none of which occurred at the time of the midterm elections. The image on the top left of the collage was shot in July 2015, and the one directly below that came from January 2017.. The image on the top right was taken in October 2016, and the one directly below that appeared to be the same flag that was burned in Honduras in October 2018 (this flag was also used in another hoax to malign a caravan of asylum seekers heading to the United States). The two images at the bottom of the collage were both been taken in June 2015 in Denver, Colorado.", "Jaquiss, Nigel.   \"Black Lives Matter Protesters Burn Bundy Supporter's American Flag in Front of Portland Justice Center.\" \r\n    Willamette Week.   28 October 2016.", "Darcy, Oliver.   \"Activists Planned to Burn U.S. Flag in NYC Park — When They Showed Up, These Guys Were Waiting.\" \r\n    The Blaze.   1 July 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]