["The nine-second video was published here in a Facebook group with more than 5,200 members on April 13, 2020.", "It has been shared more than 3,200 times.", "Below is a screenshot of the misleading Facebook post:", "The post’s traditional Chinese-language caption translates to English as: “A video showing the double standard of US human rights”.", "The same video has also been viewed hundreds of thousands of times after being shared here, here and here on Twitter, and here and here on Weibo alongside a similar claim.", "The claim is false.", "A reverse image search of screenshots extracted from the video in the misleading posts found this report published by the Canadian television network Global News on April 12, 2020. The headline reads: “Video appears to show Toronto police cruiser running over suspect reportedly carrying knife”.", "Below is a screenshot of the article:", "It states, in part: “Video posted on social media appears to show a Toronto police cruiser driving over a suspect reportedly carrying a knife as he was being pursued on foot by officers.", "“The police service initially posted an update on one of its Twitter accounts before 6:45 p.m. on Sunday advising there were reports of a man with a knife in the area of Bathurst Street and King Street West.", "“The update said the man was found with a knife and taken into custody.”", "The report was published alongside a video which includes sections of the video in the misleading post, at its 37-second mark and the 46-second mark.", "Below are screenshot comparisons of keyframes from the video in the misleading Facebook post (L) and the Global News video (R):", "The report also features two tweets by Toronto Police on the incident, published here and here on April 13, 2020, alongside a link to a police statement here.", "PERSON W/A KNIFE:\n\t\tBathurst St & King St W\n\t\t- reports of a man with a knife\n\t\t- officers o/s\n\t\t- located man with the knife\n\t\t- 1 person in custody\n\t\t- ongoing investigation#GO708877\n\t\t^al", "The statement reads, in part: “On Sunday, April 12, 2020, at 6:09 p.m., police responded to reports of a knife point robbery in the area of Bathurst Street and King Street West. Officers located a man on scene wielding a knife who was subsequently arrested. The man and an officer were taken to hospital with injuries. The Special Investigations Unit was notified and have now invoked their mandate.”", "The location seen in the video corresponds with Google Street View imagery here.", "The arrest was also reported by other local Canadian news outlets, including the television network CTV News here, and daily newspaper Toronto Star here.", "The same video was also debunked by Hong Kong fact checker Kauyim Media here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]