["The post has been viewed over 1.3 million times on Facebook since it was posted on April 16, 2020. It has been shared numerous times in South Africa, India and the United States.", "The video features Stig Severinsen from Denmark who holds two Guinness World Records for holding his breath while swimming under ice. He also once claimed the record for the “longest time breath held voluntarily” by a male underwater at 22 minutes. (His record has since been beaten by Spaniard Aleix Segura Vendrell).", "Known as the \"Human Dolphin\", Severinsen is also a four-time freediving world champion and teaches breathing techniques.", "The video caption reads: “3 things about masks from Human Dolphin. Stig is the first man to hold his breath under water for over 20 minutes. He's also a 4x Free diving world champion. He shares his wisdom and is giving his training & book for free to help out (sic)”.", "Articles here and here say Severinsen holds a Masters degree in biology and a PhD in medicine from the University of Aarhus, Denmark.", "\"First of all, it doesn't matter whether you use the P95 medical, if you use the surgical masks, whatever mask -- it's just a physical barrier, so it will not prevent coronavirus. Many people get this wrong,\" Severinsen  says in the video.", "But experts say this is misleading.", "Wolfgang Preiser, head of Stellenbosch University's medical virology division in South Africa, told AFP in an email there were three types of masks serving different purposes.", "“N95 (FFP2) masks for when exposed to aerosols (very fine particles), e.g., when caring for COVID patients who are intubated (those who wear them need to undergo training and the fit of the mask needs to be tested); surgical masks that mainly protect others and the environment from you; and cloth = non-medical masks that may protect, to some degree, others and the environment from the bearer,” Preiser wrote.", "He said the purpose of non-medical masks was to slow down the spread of the virus in the community.", "Dr. Benjamin Neuman, an expert in coronaviruses who chairs the Biological Sciences department at Texas A&M University-Texarkana, said Severinsen’s statement “seems to be confused on some points”.", "“An N95 or P95 mask is a filter that has been certified to catch most particles of a specific size, but only if it is fit-tested to make sure there is a good seal with your face,” Neuman told AFP in an email.", "He said physical barriers were the main idea behind all medical personal protective equipment, and work “fantastically” if used correctly and precaution is taken when taking off potentially contaminated equipment.", "“But you don't necessarily need an N95 mask outside a lab or hospital,” Neuman added.", "“Any kind of barrier over the mouth and nose including a homemade mask will prevent most of those droplets from coming out or in, and that is how ordinary masks can prevent infection.”", "Karine Le Roch, a professor of cell biology at the University of California, echoed Neuman's views.", "“Wearing a mask will decrease, significantly, the chance to transmit the virus to others. It is not a perfect protection but it can decrease the amount of large droplets by 80 percent,” Le Roch wrote in an email.", "The US Centers for Disease Control and Prevention (CDC) recommends wearing a cloth face mask in public settings “where other social distancing measures are difficult to maintain especially in areas of significant community-based transmission”.", "The CDC also advises that the use of cloth face masks slows the spread of COVID-19 and helps people who may have the virus and do not know it from transmitting it to others.", "In his video, Severinsen says: \"Second of all, when you have a mask on, breathe in and out, what do you think is happening? A lot of moisture is sitting around here (gestures around the mouth). Who loves moisture? Viruses, bacteria, fungus, it's all a big party -- I'm not saying avoid the mask, I'm saying follow the guidelines but think for yourself.\"", "But Preiser said Severinsen was sharing a misconception.", "“A virus is not a bacterium or fungus. Moist environments tend to favour bacterial and fungal replication which is why it is recommended to wash and/or iron cloth masks at least once daily,” he told AFP. “Viruses need live cells to replicate so whether dry or moist, they cannot become more once outside the body.”", "He said it was also worth remembering that these would be the mask wearer’s own viruses -- the ones that they breathe out.", "“So it would not matter as long as the fine droplets that we produce when talking, coughing, sneezing get caught in the mask and not in someone else’s face, nose or eyes.”", "Neuman also pointed out that viruses weren't capable of appearing out of thin air.", "“They are small, mobile but otherwise rather ordinary bits of biological machinery. Viruses are also quite specific, and rather needy -- viruses rely on dozens to hundreds of processes in a cell going just right, otherwise the virus will have difficulty growing.”", "While breathing in and out does generate moisture, Le Roch said this did not change the fact that wearing a mask still decreases the amount of droplets or virus you release in the air. A mask should be changed regularly.", "“When wearing a mask, you are not protecting yourself from your own virus but you are protecting others,” Le Roch said.", "In his third and final claim, Severinsen says: “When you breathe with this [mask] on in and out, you get the same stuff in, you can't go out like here and breathe fresh air.  When you use your nose, it is cleaning the air, it is taking up nitrogen oxide from the sinuses that is antiviral, antibacterial and antifungal and opens up the alveoli, meaning it opens the blood vessels in your lungs, giving you more oxygen.”", "Neuman said the concept of “fresh” air “being healthful is rooted in the psychology of what seems nice, not microbiology”.", "“Noses and mucous membranes in general do provide some protection against microbes, but if they were really effective, COVID-19 would not be the problem that it is,” he said. “Masks are porous to allow gas exchange -- they are filters, not simple air-tight barriers.”", "According to Neuman, Severinsen’s referral to \"nitrogen oxide\" could refer to “nitric oxide, a free radical chemical secreted by the immune system that works by forming a molecular bond with the first molecule it bumps into, or perhaps to the anaesthetic laughing gas.  Breathing in either of those outside a controlled medical setting would be very unusual and dangerous.”", "Le Roche said that while it was better to breathe fresh air in a clean open space than breathe through a mask when you're alone, the rest of the claim doesn’t hold up.", "“When you breathe, you actually breathe oxygen not nitrogen oxides. Nitrogen oxides are toxic to the upper respiratory tract and lungs even at low concentrations.”", "Le Roch said if breathing naturally was “antiviral, antibacterial and antifungal” like the video claims, “you would not be able to get infected by any virus and bacteria ever!”", "According to an AFP tally, as of May 20, 2020, at least 4,904,717 people globally have tested positive for COVID-19, with 323,137 deaths, and 1,808,014 people have recovered.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]