["This Facebook post and others like it were shared in Canada from February 7, 2020 and spread as news broke that the Royal Canadian Mounted Police (RCMP), Canada’s federal law enforcement agency, had moved onto an activist camp blocking the construction site for a natural gas pipeline in northern BC, on Canada’s west coast.", "The posts claim that the arrests of blockaders on February 6 led to a subsequent attempt to apprehend their children at school in the nearby town of Smithers.", "“Yesterday in Smithers BC, the public school went into lockdown when RCMP arrived intending to apprehend the children of the people who were arrested on unceded Wet’suwet’en territory.”", "However, the story is false.", "Matthew Monkman, assistant superintendent for British Columbia’s school district 54, which includes Smithers, told AFP: “No school was put into lockdown. This appears to be completely fabricated.”", "“Reports that the RCMP in Smithers entered a public school there to apprehend the children of people arrested at the Wet’suwet’en camp nearby are absolutely not correct,” Janelle Shoihet, a spokeswoman for the BC RCMP, told AFP in an email.", "“I personally haven’t heard anything to the effect of that rumor,” Trevor Hewitt, a reporter for the local Interior News who has been covering the Wet’suwet’en blockade, also told AFP.", "The pipeline is planned to cross traditional territory of the Wet’suwet’en nation in order to move natural gas from northeastern BC to Canada’s west coast for export.", "Indigenous elected officials have approved an amended route proposed by pipeline owner Coastal Gaslink. However, hereditary chiefs, who are not elected but draw authority from traditional Wet’suwet’en law, oppose the project, leading activists to block pipeline workers from accessing the Morice West Forest Service road, near Houston, BC.", "In late December 2019, the BC Supreme Court gave Coastal Gaslink an injunction against protesters interfering with the pipeline’s construction, which the Mounties enforced on February 6. Six people were arrested and an exclusion zone was established around the activist camps that same day.", "News of the RCMP dismantling the activist camps led to several solidarity protests throughout Canada and in the United States on February 8 and 9, notably with blockades of Canadian National Railway tracks.", "Opponents of the pipeline reported on February 10 that several hereditary chiefs and other activists were arrested by the RCMP. An RCMP news release the same day reported that the police operation would soon be over.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]