["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Marco Rubio of Florida defended a 2013 vote not to authorize President Barack Obama to use military force in Syria by saying the strategy wasn’t worth risking American lives.", "During a presidential debate in Simi Valley, Calif., on Sept. 16, 2015, radio talk show host Hugh Hewitt asked Donald Trump if he thought three senators — Rubio, Ted Cruz of Texas and Rand Paul of Kentucky — who opposed intervention against Syrian President Bashar Assad were now responsible for the current Syrian refugee crisis. Rubio defended his stance after Trump said he thought they were partly to blame.", "\"We have zero responsibility, because let’s remember what the president said,\" Rubio said. \"He said the attack that he was going to conduct was going to be a pinprick. Well, the United States military was not built to conduct pinprick attacks.\"", "Rubio went on to say he wanted a strategy that would put \"men and women in a position where they can win.\"", "Obama’s Syria policy has been a target for Republicans during the campaign, but did Obama refer to potential strikes against Assad as \"a pinprick\" attack?", "Pinning down strategy", "We didn’t hear back from Rubio’s campaign when we contacted them, but the crux of his reference is Obama’s response to Assad’s chemical weapons attack against civilians in 2013.", "While initially planning a military response against the Syrian government, Obama suddenly switched gears on Aug. 31. He announced he would first ask Congress to authorize intervention, likely starting with surgical missile strikes from Navy destroyers — an approach that faced questionable results, according to a July 2013 report from the Institute for the Study of War.", "Involving Congress was widely seen as a political gamble to bring lawmakers into the decision to move against Syria. Prior to that, Obama had struggled with whether to act unilaterally, without support from the American public, Congress, the United Nations or U.S. allies.", "Obama did use the term \"pinprick\" several times, but he used the word to say that's what he was not doing.", "Take, for example, an interview blitz on Sept. 9. Obama told Savannah Guthrie on the Today show that day that \"the U.S. does not do pinpricks. Our military is the greatest the world has ever known. And when we take even limited strikes, it has an impact on a country like Syria.\"", "Michael O’Hanlon, a Brookings Institution senior fellow and co-director of the institution’s Center for 21st Century Security and Intelligence, told us the term \"pinprick\" certainly is not a technical description of any kind of military strike. But in his experience, when the word is used, \"it is always pejorative.\"", "Sen. John McCain, R-Ariz., who favored military action in Syria, questioned Obama’s commitment to using force. McCain said on Face the Nation on Sept. 1 that he had wondered whether surgical strikes are \"just a pinprick that somehow Bashar Assad can trumpet that he defeated the United States of America.\"", "By Sept. 4, Rubio and Paul voted against a Senate Foreign Relations Committee resolution allowing Obama to use limited force against Assad’s regime. (Cruz, who was not on the committee, made it clear he would have opposed the resolution.) It passed by a 10-7 vote and was sent to the Senate.", "Meanwhile, during a hearing for the House Foreign Affairs Committee on strategy in Syria on Sept. 4, then-Defense Secretary Chuck Hagel tried to dispel notions Obama wasn’t planning an effective response.", "\"The president has said ... this would not be a pinprick. Those were his words. This would be a significant strike that would in fact degrade his capability,\" Hagel said.", "Now, Obama’s case wasn’t necessarily helped when then-Secretary of State John Kerry gave the opposite message on Sept. 9, saying during a meeting in Britain that the United States planned an \"unbelievably small, limited kind of effort.\"", "But the strikes, pinpricks or not, never happened. Facing shaky support in the Senate, Obama asked majority leader Harry Reid to pull the measure.", "On Sept. 10, Obama said in an address to the nation from the White House that he would postpone a military solution, but was committed to his stance that future intervention was a possibility.", "\"As some members of Congress have said, there's no point in simply doing a pinprick strike in Syria,\" Obama said. \"Let me make something clear: The United States military doesn't do pinpricks.\"", "A year later, Rubio voted in favor of arming Syrian rebels, which Paul and Cruz opposed.", "Our ruling", "Rubio claimed Obama said an attack on Syria \"was going to be a pinprick.\"", "In reality, Obama said the exact opposite of that, stating several times that a U.S. military response to Syria’s use of chemical weapons on its citizens would involve a significant show of force. While the president’s full strategy was somewhat unclear, at the debate Rubio echoed Obama’s own past statements that the U.S. military was not built for small-scale engagements that could be characterized as \"pinpricks.\"", "We can pop Rubio’s talking point here. We rate his statement False.", "YouTube, \"Rubio rips Trump: We don't authorize force if you're not putting troops in position to win,\" Sept. 16, 2015", "Institute for the Study of War, \"Required Sorties and Weapons to Degrade Syrian Air Force Excluding Integrated Air Defense System (IADS),\" July 31, 2013", "New York Times, \"Confident Syria Used Chemicals, U.S. Mulls Action,\" Aug. 25, 2013", "CBS News, \"U.S. preps for possible cruise missile attack on Syrian gov't forces,\" Aug. 23, 2013", "Washington Post, \"Obama, advisers weigh response to Syrian attack as military assets are repositioned,\" Aug. 24, 2013", "Foreign Policy, \"Architect of Syria War Plan Doubts Surgical Strikes Will Work,\" Aug. 26, 2013", "New York Times, \"Obama Seeks Approval by Congress for Strike in Syria,\" Aug. 31, 2013", "CNN, \"White House pushes Congress on Syria after Obama's recoil,\" Sept. 1, 2013", "Washington Post, \"Senators strike deal on wording for new resolution authorizing force against Syria,\" Sept. 3, 2013", "Washington Post, \"Senators strike deal on wording for new resolution authorizing force against Syria,\" Sept. 3, 2013", "Washington Post, \"Senate committee approves resolution authorizing U.S. strike on Syria,\" Sept. 4, 2013", "New York Times, \"Split Senate Panel Approves Giving Obama Limited Authority on Syria,\" Sept. 4, 2015", "Sen. Marco Rubio, \"Rubio: My Vote Against Military Action in Syria,\" Sept. 4, 2015", "Washington Post, \"Breaking down the Senate Foreign Relations Committee Syria vote,\" Sept. 4, 2013", "Reuters, \"U.S. defense chief says attack on Syria would not be 'pin prick',\" Sept. 4, 2015", "New Yorker, \"Six interviews later, a way out for Obama on Syria?,\" Sept. 9, 2013", "MSNBC, \"WATCH Obama: ‘It’s fair to say that I haven’t decided’,\" Sept. 9, 2013", "Washington Post, \"Kerry: Military action in Syria would be ‘unbelievably small’,\" Sept. 9, 2013", "PolitiFact, \"Fact-checking claims about military strikes against Syria,\" Sept. 9, 2013", "The Guardian, \"John Kerry gives Syria week to hand over chemical weapons or face attack,\" Sept. 9, 2013", "Washington Post, \"Obama administration’s message on Syria is muddled,\" Sept. 9, 2013", "Washington Post, \"Ted Cruz: Why I’ll vote no on Syria strike,\" Sept. 9, 2013", "ABC News, \"Obama Asks Congress to Delay Vote on Syria,\" Sept. 10, 2013", "NBC News, \"Full transcript of President Obama's remarks on Syria,\" Sept. 10, 2013", "NBC News, \"Obama will try more diplomacy on Syria but warns US 'doesn't do pinpricks',\" Sept. 10, 2013", "USA Today, \"Senate delays Syria vote as Obama loses momentum,\" Sept. 10, 2013", "Politico, \"Tough Hill vote on Syria fades,\" Sept. 14, 2013", "The Hill, \"Rubio votes for CR: Cruz, Paul vote 'no',\" Sept. 18, 2014", "U.S. Senate Foreign Relations Committee, 2013 Syria joint resolution, accessed Sept. 17, 2015", "Interview with Michael O’Hanlon, Brookings Institution senior fellow and co-director of the institution’s Center for 21st Century Security and Intelligence, Sept. 17, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]