["About this rating", "Purveyors of junk news love good hybrid plant stories. Over the years we've covered japes involving improbable plant pairings such as lemon and pomegranate, kale and cannabis, banana and kiwi, and marijuana and Venus flytraps.  In November 2018, we came across yet another interesting marijuana-related hybrid claim, this time with strawberries in the mix:", "The image seen here has been circulating online since at least July 2018, when it was published in a satirical article on the web site \"There is News\" reporting that a University of Miami student had created a marijuana-strawberry cross:", "Biology student has been denounced for crossing a weed plant with strawberries", "A 24-year-old student in the Faculty of Biology in University of Miami has been brought to the authorities after exhibiting a crossbreeding of two plant species between strawberry and marijuana in his practical class.", "He has been fanatic of this plant for a long time. Also he says he hasn’t consumed any kind of marijuana “I’ve never smoked, nor one puff, I just think it’d be cool to create this crossbreeding of species, just like there are flavored tobacco products I think it would be a good idea to combine strawberry flavor with marijuana”.", "This report was not a genuine news story, as \"There is News\" is an entertainment website whose disclaimer states that the \"content of (There Is News) is fiction and does not correspond to reality.\"", "The image purportedly showing a hybrid  marijuana-strawberry plant is obviously a fake one. The original unedited photograph simply shows a marijuana plant (sans strawberries):", "There Is News.   \"Biology Student Has Been Denounced for Crossing a Weed Plant with Strawberries.\"\r\n    14 July 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]