["About this rating", "Officials in Dorchester County, South Carolina have issued an apology for aerial insecticide spraying that inadvertently killed millions of honeybees in the area, WCBD-TV reported on 1 September 2016. Beekeepers in the town of Summerville say they lost scores of active hives almost instantly after spraying began early in the morning on 28 August.", "The insecticide, naled (brand name Trumpet), is recommended by the Environmental Protection Agency for the control of the mosquito species Aedes aegypti, which carries the Zika virus. The insecticide is also highly toxic to bees. Administrators in Dorchester County (where there have been four confirmed diagnoses of Zika infection to date) said they followed guidelines for its proper use, including spraying before dawn to reduce exposure of the bee population and notifying local residents in advance.", "Locals say they weren't notified in advance of the aerial spraying, however. Beekeeper Juanita Stanley told reporters:", "That's true when they sprayed by trucks. But nobody called me about the aerial spraying; nobody told me at all.", "Stanley estimates she lost more than 3 million bees, and says she'll have to destroy the contaminated honey and equipment and start over.", "Researchers at Clemson University took honey and soil samples from Stanley's farm for further analysis.", "LaMotte, Sandee.  \"Zika Spraying Kills Millions of Honeybees.\"\r\n   CNN.  2 September 2016.", "WCBD-TV.  \"Millions of Bees Killed in Summerville.\"\r\n   1 September 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]