["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Brad Blakeman (right) and former Bill Clinton adviser Simon Rosenberg discussed the federal food stamp program with Fox News' Gretchen Carlson.", "The expiration of a piece of the 2009 federal stimulus bill means a $5 billion cut this month to the federal food stamp program, called the Supplemental Nutrition Assistance Program.", "That has some lawmakers scrambling to restore the funding, and others fighting to stop it.", "Count pundit and former George W. Bush aide Brad Blakeman among those who wants to see the cut stand.", "Appearing on Fox News Channel, Blakeman criticized efforts to restore food stamp funding as part of an agriculture bill.", "\"When is a farm bill not a farm bill? When 90 percent of it is for food stamps,\" Blakeman said.", "In this fact-check, we look at whether food stamps, now called SNAP, really amountsto such a large share of spending in the farm bill.", "Blakeman referred us to data from the U.S. Agriculture Department that shows average yearly participation in SNAP and total federal spending rising every year since 2007. Back then, about 26 million people relied on the program. Today, the number is closer to 47 million. Spending in 2012 reached about $75 billion. Blakeman also sent a link to a Reuters news article that estimated that about two thirds of the farm bill went to nutrition programs.", "Blakeman told PunditFact his point was that while the farm bill might sound like it deals with agriculture, it largely funds an entitlement program.", "He’s largely right. Let us explain.", "A bit about the farm bill", "The farm bill is second only to the weather in shaping agriculture in the United States. It determines how many billions of dollars will flow to farmers and companies that grow and distribute basic crops such as corn, wheat, sugar and soy beans. It touches subsidies, crop insurance, land conservation, organic agriculture and rural development.", "But it also serves as the mechanism by which low-income Americans receive nutrition assistance.", "The Congressional Budget Office, the nonpartisan analytic arm of Congress, estimated the 10-year cost for the Senate farm bill at $955 billion and the House version at $921 billion.", "The nutrition component, according to the CBO, is 80 percent in the Senate and 79 percent in the House. That’s close, but a little short of the figure Blakeman used on Fox News.", "2013 farm bill budget: CBO score FY2014-23", "Senate proposal", "Percent of total", "House proposal", "Percent of total", "Commodities", "$41B", "4%", "$40B", "4%", "Nutrition", "$760B", "80%", "$725B", "79%", "Crop Insurance", "$89B", "9%", "$93B", "10%", "Total", "$955B", "$921B", "The House in particular has had a difficult time achieving consensus on farm policy. Hard-line conservatives have wanted deeper cuts in subsidies to producers and SNAP. Liberals have objected to the many ways that the Republican plan would make SNAP less generous and make it harder to qualify for benefits. The House and Senate are now hammering out a version both bodies can pass. Funding for SNAP remains a significant dividing point.", "Dottie Rosenbaum, a senior analyst with the Center on Budget and Policy Priorities, notes that regardless of congressional action, SNAP spending is projected to decline as the economy improves.", "\"The reason spending went up is because the program did what it’s supposed to do,\" Rosenbaum said. \"When people lose their jobs, they need more help.\"", "The Congressional Budget Office says that with no change in the law, the number of recipients could be about 35 million by 2022. That is less than the 47 million people today, about half of whom are children, but still more than the total in 2007.", "A final note: When we told Blakeman that 90 percent was too high, in large measure, he did not object.", "\"In the future I will say  the \"vast majority\" or 80-plus percent,\" he said.", "Our ruling", "Blakeman said that 90 percent of the farm bill went to food stamps. The more accurate figure is 80 percent in the legislation currently under discussion in Congress. The 10 percentage points difference doesn’t change Blakeman’s essential point, but it is enough to bring our rating down a notch.", "We rate the claim Mostly True.", "Fox News, The Real Story, Oct. 31, 2013", "Washington Post, What happens with farmers, food stamps and the USDA with no farm bill?, June 28, 2013", "Congressional Research Service, Budget Issues Shaping a Farm Bill in 2013, Oct. 21, 2013", "CRS, What is the Farm Bill?, Oct. 11, 2013", "Congressional Budget Office, S. 954 Agriculture Reform and Risk Management Act, May 17, 2013", "Congressional Research Service, The 2013 Farm Bill: A Comparison of the Senate-Passed (S. 954) and House-Passed (H.R. 2642, H.R. 3102) Bills with Current Law, Oct. 18, 2013", "Email interview with Brad Blakeman, Nov. 1, 2013", "Email interview with Dottie Rosenbaum, senior analyst, Center on Budget and Policy Priorities, Nov. 1, 2013", "New York Times, As Cuts to Food Stamps Take Effect, More Trims to Benefits Are Expected, Oct. 31, 2013", "U.S. Agriculture Department, Supplemental Nutrition Assistance Program Participation and Costs, Oct. 17. 2013", "Food Systems Network - NYC, FARM BILL 1.01, Jan. 4, 2011", "Reuters, Factbox: How the U.S. farm bill process works, April 20, 2010", "New York Times, Lobbying heats up before farm talks, Oct. 23, 2013", "Congressional Budget Office, Snapshot of the Supplemental Nutrition Assistance Program, April 16, 2013", "Center on Budget and Policy Priorities, SNAP plays a critical role in helping children, July 17, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]