["By D'Angelo Gore", "Posted on September 23, 2020", "President Donald Trump’s reelection campaign claims a video it posted on social media shows Joe Biden botching the Pledge of Allegiance. But Biden’s words were taken out of context. He wasn’t trying to recite the full pledge, as the post could lead some to believe.", "The 8-second clip was posted Sept. 22 by the “Team Trump” Facebook account and the “Donald J Trump” YouTube account. “Joe Biden completely botches the Pledge of Allegiance,” the captions say.", "The accompanying video shows the Democratic presidential nominee saying: “I pledge allegiance to the United States of America. One nation, indivisible, under God, for real.”", "The quote has also been shared by others on different social media platforms.", "However, a fuller clip from Biden’s Sept. 21 campaign speech in Manitowoc, Wisconsin, shows he mentioned certain phrases from the Pledge of Allegiance only to make a point. He wasn’t reciting the pledge. He said that as president, he wouldn’t divide the country, as he claimed Trump had done by criticizing how “blue states” have managed the COVID-19 pandemic.", "Biden, Sept. 21: Think about what he’s saying. He’s saying, if you live in a state like Wisconsin, Michigan, Pennsylvania, states with Democratic governors, you’re not his problem. He has no obligation to you. He’s not responsible for you as president, your family or your well-being. I don’t see the presidency that way. I don’t pledge allegiance to red states of America or blue states of America, I pledge allegiance to the United States of America. One nation, indivisible, under God, for real. I’m running as a proud Democrat, but I’m not going to govern as a Democratic president, I’m going to govern as president.", "The short clip posted by the Trump campaign doesn’t make Biden’s intent clear.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]