["About this rating", "On 18 May 2016, the Daily Snark web site reported that Dallas Cowboys quarterback Tony Romo has been arrested for using a men's bathroom in the state of North Carolina:", "There has been heated controversy over the recent legislation implemented by the leaders of the state of North Carolina.", "The state made headlines and created a relative uproar after maintaining its stance on the LGBT community, essentially vetoing a bill that would protect those who are gay, bisexual, and transgender from discrimination.", "The House Bill 2, known as HB2, has been criticized as being discriminatory toward transgender people. The statewide policy bans individuals from using public bathrooms that do not correspond to their biological sex and prohibits cities from passing anti-discrimination ordinances to protect gay and transgender identity, per CNN.", "Thursday afternoon at approximately 4:57pm ET, North Carolina Police detained a man, later to be identified as Dallas Cowboys quarterback Tony Romo, for using the men’s restroom in the Charlotte-Douglas International Airport.", "Police say they received a complaint from numerous bystanders and patrons inside the bathroom complaining of a person who didn’t belong there.\nWhen asked how police recognized that the man who they received complaints about may have been a women, they pointed towards the Cowboys apparel Romo was wearing at the time. “It was a dead giveaway,” said officer Mike Roseman.", "Under the state law, Romo was technically prohibited from using the men’s bathroom even if he identified as a man.", "In Romo’s statement to police, the QB said, \"I don’t know what I was thinking. I could have swore I saw the proper sign but it was apparently something else. I have a hard time reading things. It happens a lot. Even off the field. Bathroom signs? Try defenses.” He added, “I was just trying to carry on with my business when you guy’s intercepted me.”", "The name of the publishing site and the obviously tongue-in-cheek nature of the article should have been dead giveaways that the report was a spoof, but many readers nonetheless confused it for a legitimate news item.  Aside from taking shots at Romo's prowess as a quarterback, the article echoed previous fake news pieces falsely holding that Romo had admitted to a homosexual romance with a teammate and that political troll Ann Coulter had similarly been arrested for trying to use a women's bathroom in Charlotte, N.C.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]