["The screenshots have been shared hundreds of times on Facebook, Twitter and Instagram in various languages, including English, Spanish and Portuguese.", "“The simpsons predicted Coronavirus,” claims one post on a Facebook page with more than 600,000 followers.", "Three of the four accompanying pictures are from Season 4, Episode 21 of the hit TV show, as the caption claims.", "The episode, “Marge in Chains”, features a virus that spreads from Japan to Springfield in packages. However, the illness is described as Osaka flu -- not coronavirus -- in a report read by the show's newsreader Kent Brockman.", "The image in the bottom-right corner is from a different episode. AFP ran a keyword search for “apocalypse meow” -- visible in red behind the yellow “corona virus” title -- and found that the screenshot was taken from an episode broadcast in 2010.", "The episode, “The Fool Monty”, features a plot by the media to release a man-made disease known as \"house cat flu\".", "During a news bulletin, Kent Brockman is pictured alongside a title reading, “Apocalypse Meow”, which has since been doctored to add the term “corona virus” in the widely-shared social media posts.", "The World Health Organization previously debunked false claims that people could contract the novel coronavirus from parcels arriving from China.", "“It's very unlikely that you can get the COVID-19 just by touching the outside of a package sent from China or another country,” WHO spokesman Tarik Jasarevic told AFP via email.", "“Viruses generally cannot survive more than a few hours on porous materials such as paper or cardboard.”", "Read more about misinformation on the novel coronavirus here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]