["The claim and a link to the website were published on Facebook here on March 17, 2020.", "Below is a screenshot of the misleading post:", "The post’s Hindi-language caption translates to English as: “At a time when Coronavirus has become a pandemic in India, our Prime Minister Narendra Modi under the clean India mission scheme has decided to give free face masks. Everyone should click on the link below and place an order for free masks and keep India clean.”", "Similar claims have also been shared here and here on Facebook and here and here on Twitter, with the same link.", "Below is a screenshot of the website:", "The World Health Organization (WHO) states that face masks can be used to help slow the spread of the novel coronavirus, which has killed more than 9,800 and infected 232,650 others as of March 20, 2020, according to the AFP tally.", "However, claims that the Indian government is distributing free face masks are false.", "The government’s official Press Information Bureau took to Twitter on March 18, 2020, to refute the claim. The Hindi tweet translates to English as: “No scheme like 'PM Mask Scheme' is being run by the Central Government.”", "#PIBFactcheck : केंद्र सरकार द्वारा ‘पीएम मास्क योजना’ जैसी कोई भी योजना नहीं चलाई जा रही है |#CoronavirusOutbreak पर अफवाहों से बचें | pic.twitter.com/MPlVW9ryD5", "Several aspects of the website linked in the misleading posts reveal that it is not a legitimate government site.", "The site, for instance, incorrectly spells Modi’s name “Narendr Nodi”. The URL’s domain name is also “.in” and not the government’s official “.gov.in”, as seen on the central government’s site here.", "After users input their personal information, the site then prompts them to share the link to 10 WhatsApp groups in order to claim the free offer.", "Moreover, the site’s “Terms & Privacy” page redirects users to another deactivated site.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]