["The video has been shared repeatedly online, for example in this Facebook post on February 23, 2017, where it has been viewed more than 8,300 times.", "The misleading post’s caption says: “Wtf.... tuas fire”.", "Below is a screenshot of the misleading post:", "The same video has been shared on Facebook with a similar claim here, here and here, on YouTube here and here, and on Twitter here.", "The misleading posts were all uploaded the same day that a fire broke out at 23 Tuas View Circuit in Singapore on February 23, 2017, according to this post on the official Facebook page of the Singapore Civil Defence Force.", "But the claim is false; the video shared in the misleading posts actually shows firefighters staging an exercise in Sichuan, China, in 2015.", "A reverse image search on Google using keyframes from the video found that the misleading clip has been edited from footage that has circulated online since 2015.", "It was published here on YouTube on November 17, 2015.", "AFP located photos of the same fire in this post published by the official Sichuan Public Security Fire Brigade on Chinese social media platform Weibo on November 13, 2015.", "The Chinese caption translates to English as: “[Here comes the blockbuster! Fire rescue drill for emergency relief department leaders from member states of the Shanghai Cooperation Organization]. A rescue drill display was held at the Chengdu Public Security Fire Brigade Training Base on the afternoon of November 12th for the eighth meeting of the Shanghai Cooperation Organization’s emergency relief department. The scene can be compared to the blockbuster, and the main roles of the show were firemen!”", "Below is a screenshot of the post on Weibo:", "This accompanying report with more photos of the fire states that a fire drill was conducted during the eighth leaders' meeting of Emergency Relief Departments organised by the Shanghai Cooperation Organization on November 12, 2015.", "Below is a screenshot comparison of the video in the misleading Facebook posts (L) and one of the photos from the Sichuan fire brigade (R):", "AFP has circled in red the structures which are consistent across both photos; namely two spherical metal pods and a taller metal structure with square holes.", "The fire drill was reported by local Chinese media China News here.", "The headline states: “Emergency relief department leaders from member states of Shanghai Cooperation Organization watches the fire drill.”", "Below is a screenshot of the report:", "This fact-check article published by Chinese state-run People.cn on August 23, 2016 also verified the footage was of the fire drill in Sichuan.", "Singaporean news site The Straits Times published this report about the false videos circulating about a fire in Tuas on February 23, 2017.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]