["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A chain email circulating recently gets the details of tax increases wrong. (Ray Tsang via Flickr)", "The start of a new year traditionally offers the possibility of rebirth. Apparently, that goes for chain emails, too.", "It was last May when we first encountered a chain email that purported to list a wide variety of taxes that went up on Jan. 1, 2014. The email was littered with errors, so we rated it Pants on Fire.", "Now, readers are flooding the PolitiFact inbox asking whether a new version of the email -- keyed to a new date, Jan. 1, 2015 -- is accurate. It isn’t, and we’ll explain why.", "Here’s the text of the email that’s currently circulating:", "Reminder for those who forgot or for many that didn't know", "Here is what will happen on January 1, 2015 :", "Top Medicare tax went from 1.45% to 2.35%", "Top Income tax bracket went from 35% to 39.6%", "Top Income payroll tax went from 37.4% to 52.2%", "Capital Gains tax went from 15% to 28%", "Dividends tax went from 15% to 39.6%", "Estate tax went from 0% to 55%", "Remember this fact:", "These taxes were all passed only with democrat votes, no republicans voted for these taxes.", "These taxes were all passed under the Affordable Care Act, aka Obamacare.", "If you think that it is important that everyone in the U.S. should know this, pass it  on. If not, then delete it.", "We’ll take these claims in order:", "\"Here is what will happen on January 1, 2015\"", "To the extent that these tax rates were changed -- and as we’ll see most of them didn’t change in the way the email says -- the changes didn’t take effect on Jan. 1, 2015 (or, for that matter, on Jan. 1, 2014). They took effect on Jan. 1, 2013.", "That may seem like a minor difference, but in this case, it makes all the difference.", "The tax rates that changed on Jan. 1, 2013, were all passed as part of the American Taxpayer Relief Act of 2012. That was a bipartisan deal -- we’ll discuss just how bipartisan in a bit -- that passed after the 2012 presidential election to avoid the \"fiscal cliff.\" The \"cliff\" refers to the expiration of tax cuts originally passed under President George W. Bush.", "The law made permanent many but not all of the Bush-era tax cuts that were set to expire anyway. So some people did see their tax rates go up, primarily upper-income taxpayers. That’s what the email is attempting to spotlight, but it does so in a way that introduces a host of inaccuracies.", "\"Top Medicare tax went from 1.45% to 2.35%\"", "This tax hike, unlike the others, did indeed stem from the Affordable Care Act, and the tax rates listed in the email are accurate. (Oddly, this line wasn’t included in the previous version of the email.) However, this hike, like the others, took effect on Jan. 1, 2013, not on New Year’s Day 2015. It’s also worth noting that most Americans won’t be affected -- it hits individuals earning $200,000 annually or married couples earning $250,000.", "\"Top Income tax bracket went from 35% to 39.6%\"", "The timing is wrong, but the numbers are correct. For 2015, the 39.6 percent rate is for individuals earning over $413,200 in taxable income or married couples earning at least $464,850.", "\"Top Income payroll tax went from 37.4% to 52.2%\"", "Usually, people think about income taxes and payroll taxes separately. But it’s not uncommon for tax experts to look at the combination of income and payroll taxes together, because they give a sense of the overall burden of direct taxation on individuals. That’s what the email did here.", "On Jan. 1, 2013, the top combined rate for the income and payroll tax went from 37.9 percent to 42.5 percent, or 43.4 percent due to the additional Medicare tax in the health care law.", "So if you just look at the federal rates, the email overstates the current top rate.", "If you take state taxes into account, the email is closer, but still inaccurate. The Tax Foundation, a business-backed group, calculated 2013 combined tax rates for each state. The group found that the top marginal tax rate, averaged across all states, is 47.9 percent.", "Of course, any state taxes would have been imposed by state governments, and thus were not part of the Affordable Care Act. And this would not be an apples-to-apples comparison; to make the comparison fair, the initial tax rate would need to be adjusted upward for state and local taxes as well.", "\"Capital Gains tax went from 15% to 28%\"", "On Jan. 1, 2013, the highest capital gains tax rate rose from 15 percent to 20 percent. The Affordable Care Act’s additional 3.8 percent Medicare tax for high-income earners can be added to make it 23.8 percent. Either way you calculate it, the email exaggerates the amount of the increase. (And most households still pay nothing or 15 percent for capital gains, depending on their income.)", "If you add in state and local capital gains taxes, the Tax Foundation says the current rate, averaged across the 50 states, is 28.7 percent, but Tax Foundation economist Kyle Pomerleau told us this is \"sort of an apples-to-oranges comparison.\"", "\"Dividends tax went from 15% to 39.6%\"", "This line would have been correct if the Bush tax cuts had expired the way they were initially supposed to. But the December 2012 deal ended up going with a top marginal tax rate of 20 percent on dividend income instead of the pre-Bush rate of 39.6 percent on dividend income. It rose to 23.8 percent due to the high-income added Medicare tax under Obamacare.", "So the final rate cited in the email is far higher than the current rate.", "\"Estate tax went from 0% to 55%\"", "Both ends of this claim are wrong. The estate tax was gradually wound down by the Bush-era tax cuts, disappearing entirely, for one year, in 2010. For 2011 and 2012 it was reimposed at 35 percent, then raised to 40 percent on Jan. 1, 2013 as part of the \"fiscal cliff\" bill.", "Also, it’s worth noting that the estate tax is heavily targeted at the very richest Americans. According to the Urban Institute-Brookings Institution Tax Policy Center, in recent years, the top 10 percent of income earners paid virtually all of the tax, with over half of that paid by the richest 0.1 percent. Indeed, estates with a gross value under $5.25 million don’t even need to file a form with the Internal Revenue Service, and typically more than half of those who do have to file one are ultimately determined not to owe any estate tax.", "\"These taxes were all passed only with democrat votes, no republicans voted for these taxes. These taxes were all passed under the Affordable Care Act, aka Obamacare.\"", "Most of these changes were passed as part of the 2012 fiscal cliff deal, which was enacted with bipartisan support. Facing expiration of the Bush tax cuts, which would have meant a massive tax increase up and down the income scale, both parties felt compelled to strike a deal that neither side was really enthusiastic about.", "In the Senate, the measure passed by an 89-8 margin. Forty Republicans voted for it, and just five Republicans voted against it.", "In the House, it passed by a 257-167 margin. While a majority of Republicans (151) voted against the bill, 85 Republicans did vote for it. So the email is flatly wrong to say that no Republicans voted for these taxes.", "It’s also incorrect to say that these taxes were all raised by Obamacare. The health care law did add marginally to three of the five taxes -- it was the source of the Medicare tax hike from from 1.45 percent to 2.35 percent, and it added 0.9 percentage points to the top payroll tax rate and 3.8 percentage points to the the capital gains and the dividends tax. But the bulk of the increases came from the fiscal cliff deal. Less than a third of the total percentage-point increases cited by the email came from Obamacare.", "Our ruling", "The chain email said that new tax increases went into effect on Jan. 1, 2015, \"all passed under the Affordable Care Act, aka Obamacare.\"", "The email gets many things wrong, most notably scaring people by saying their tax rates will go up on New Year’s Day 2015. In addition, most of the rates cited are wrong in some way, and are uniformly higher than the actual rates. And the email is flat-out wrong when it blames Democrats, and Obamacare for the increases. The bulk of the tax hikes stem from a different bill entirely -- one that received support from a large majority of Senate Republicans and a significant minority of House Republicans.", "Despite some minor changes since the last version of the email that circulated, this one is so riddled with errors -- and gets so few things correct -- that we continue to rate it Pants on Fire.", "Help fund PolitiFact's Kickstarter to live fact-check the 2015 State of the Union and GOP response.", "Chain email, submitted to PolitiFact around Jan. 1, 2015", "PolitiFact, \"Chain email overstates tax increases, incorrectly says they all stem from Obamacare,\" May 14, 2014", "Text of the American Taxpayer Relief Act of 2012 (H.R. 8)", "Senate roll call vote on H.R. 8", "House roll call vote on H.R. 8", "Snopes.com, \"Affordable Care Jacked,\" Jan. 2, 2015", "Kaiser Family Foundation, \"Summary of the Affordable Care Act,\" April 25, 2013", "Forbes, \"IRS Announces 2015 Tax Brackets, Standard Deduction Amounts And More,\" Oct. 30, 2014", "Urban Institute-Brookings Institution Tax Policy Center, \"Tax Provisions in the American Taxpayer Relief Act of 2012,\" Jan. 9, 2013", "Urban Institute-Brookings Institution Tax Policy Center, \"Tax Topics: Estate and Gift Taxes,\" accessed Jan. 5, 2015", "Tax Foundation, \"The High Burden of State and Federal Capital Gains Tax Rates,\" Feb. 11, 2014", "Email interview with Kyle Pomerleau, economist with the Tax Foundation, May 14, 2014", "Email interview with Roberton Williams, fellow at the Urban Institute-Brookings Institution Tax Policy Center, Jan. 5, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]