["About this rating", "Just after Christmas Day in 2020, a 26-year-old Scottish postman named Nathan Evans posted a video to TikTok that captured him singing the folk song \"Soon May the Wellerman Come\":", "Evans' effort kicked off something of a craze for TikTok users to post videos of themselves singing similar catchy tunes that belong to a class of folk song known as \"sea shanties\" (SHAN-tees) -- work songs performed to accompany (rhythmic) forms of labor on ships in the days of sail:", "One of the original purposes of the sea shanty was to create a sense of community and shared purpose. On merchant marine vessels in the 1700s and 1800s, a shantyman would lead sailors in song as they worked, distracting them from their toil, enlivening their tasks and establishing a rhythm.", "“The different kinds of onboard work and chores would have different shanties attached to them,” said Gerry Smyth, a professor of Irish cultural history at Liverpool John Moores University and the author of “Sailor Song: The Shanties and Ballads of the High Seas.”", "According to Mr. Smyth’s research, shanties evolved to match and expedite particular tasks. “If you were hauling sail, for example, the shanty was designed around the physical effort required to achieve that,” he said. “Everybody would pull at the same time,” he added, cued by the rhythm of the song.", "However, to many English speakers exposed to the term for the first time, \"sea shanty\" looks wrong -- it should be \"chanty,\" they think, to reflect that the word refers to verses that are chanted.", "This belief might have some validity in a strict linguistic sense, as the word is believed to be derived from a form of the French verb chanter, \"to sing.\" However, it is not the case (as often happens with linguistic borrowings) that \"shanty\" was originally spelled differently (e.g., \"chanty\"), and a \"corrupt\" or \"wrong\" spelling of the word eventually became the norm. The oldest known print references to sea shanties, from the mid-19th century, employed both the 'sh' and the 'ch' spellings, so neither was an \"original\" form that was later changed to something else. (And educated guess might be that the 'ch' version was faithful to the spelling of the original French root word, but the 'sh' version was a rendering of the French pronunciation of that word in English orthography.)", "In fact, the spelling of \"shanty\" has never been consistent in English, having been rendered variously as \"shanty,\" \"chanty,\" \"chantey,\" or (less frequently) \"shantey.\" The Google Books Ngram Viewer shows \"shanty\" as the far most common form over the last few decades:", "This is one word that you can render in any of four different ways and still be \"correct,\" so all you aspiring singers can focus on your performances of these traditional sailing tunes and not worry too much about how to spell them.", "David Mikkelson founded the site now known as snopes.com back in 1994 as a creative outgrowth of his wide-ranging interests in a variety of subjects (particularly folklo ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]