["The photo was published here on Facebook on August 19, 2020. It has been shared more than 530 times since.", "The post’s caption, written in Hindi and English, says: \"Importance of Indian culture in New Zealand.\"", "The photo was also shared here, here, here and here on Facebook; and here and here Twitter, alongside a similar claim.", "The claim is false.", "A reverse image search on Yandex found a similar photo of people eating in the same hall was published here on a blog named Happy Yoga Travels.", "The post was written by German blogger Susanne Rieker, according to the travel blog’s about section. In the post, she says she took the photo during a 2010 visit to the Sivananda Yoga Ashram in Trivandrum, in the Indian state of Kerala.", "A further search found another photo showing the same hall is published here on the yoga centre’s website.", "Below is a screenshot comparison of the photo published in the misleading Facebook post (L) and the photo published on the yoga centre website (R), with similarities highlighted in red by AFP:", "In response to an inquiry by AFP, a spokesperson for Sivananda Yoga Ashram said the photo on the left was taken at their centre.", "“This photo is from our Trivandrum ashram only and looks like it was taken in March this year,” the spokesperson told AFP by phone on August 25, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]