["About this rating", "In December 2019, readers inquired about several online posts that purported to announce the death of the rapper YNW Melly, whose real name is Jamell Demons.", "On Dec. 9 and Dec. 10, posts emerged on various unreliable websites — including two that invite users to \"prank your friends\" — falsely claiming that the 20-year-old had been stabbed to death in prison. On Dec. 9, the website Channel 45 News published a short post with the headline \"YNW Melly Stabbed to Death,\" along with a photograph of Demons and the following text:", "\"Authorities said that it all happened in a prison riot between to [sic] gangs. Which left the victim found dead with a knife in his abdomen. YNW Melly stabbed to death!\"", "Channel 45 News invites users to \"create a prank and trick your friends\" by generating a vaguely authentic-looking fake news post from a headline and text inputted by the user, as shown below:", "Another user posted a second fake article using the prank news generator NSFNews. That post had the headline \"YNW Melly Stabbed in Jail\" and reported that:", "\"Jamall [sic] Maurice Demons otherwise known as YNW Melly has been stabbed while in jail. Authorities have confirmed Melly to be in critical condition this morning after a stabbing over a gang related incident. Melly encountered two gang members in the Jail who preceded to stab him multiple times. We will update more as the story continues.\"", "Like Channel 45 News, NSFNews invites users to \"Write an article and prank your friends for fun.\"", "Based on these demonstrably fabricated stories, rumors of Demons' demise spread quickly on social media and other websites, including DeadDeath and Market News, which shared what they described as \"unconfirmed\" reports that the rapper had been killed.", "The spread of the rumor was fueled in part by the fact that Demons was indeed in prison in December 2019, adding a modicum of credibility to claims that he had been killed there. In February 2019, Demons was arrested and charged with two counts of first-degree murder and has since been incarcerated in Broward County Jail in Florida, according to prison records.", "The rapper's mother, Jamie Demons, quickly dispelled rumors of her son's death, posting a short video to Instagram in which she explained: \"Melly is fine. I just talked to him this morning. He has not been injured whatsoever. He's fine, he's in great spirits, and he'll be home soon.\"", "Channel45news.com.  \"YNW Melly Stabbed to Death.\"\r\n  9 December 2019.", "Nsfnews.com.  \"YNW Melly Stabbed in Jail.\"\r\n  9 December 2019.", "DeadDeath.com.  \"YNW Melly Stabbed to Death in Jail -- Unconfirmed Rumors.\"\r\n  10 December 2019.", "Marketnews.com.  \"YNW Melly Reportedly Stabbed to Death in Jail.\"\r\n  9 December 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]