["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Assembly Speaker Robin Vos says \"almost none\" of the people who fail gun background checks are prosecuted.", "Wisconsin’s top elected leaders have filled a lot of airtime and newsprint disagreeing on whether to expand background checks for gun buyers.", "But what about the people who already fail background checks?", "The Wisconsin Department of Justice conducts background checks on every person attempting to buy a handgun from a gun dealer in the state. Not everyone passes.", "Assembly Speaker Robin Vos raised that issue while objecting to Gov. Tony Evers’ push for a red flag law in Wisconsin. He said the state should focus on \"enforcing the laws that are already on the books\" rather than pursuing legislation the parties don’t agree on.", "His claim:", "\"Let’s remember that in 2018 we had I think it was 132,000 background checks. About 1,000 of those failed,\" Vos, R-Rochester, said in a Nov. 10, 2019, appearance on WISN-TV’s UpFront program. \"For the 1,000 that failed, almost none of them were prosecuted for trying to do a background check and illegally buy a weapon.\"", "This fact check takes us beyond the numbers into prosecutorial discretion, the ignorance defense and more. Let’s get started.", "Evers is pushing to extend background checks to sales between private parties, also known as  universal background checks. Wisconsin is one of 29 states that currently don’t get involved in private sales.", "For purchases from licensed dealers, Wisconsin splits the background check responsibilities based on the type of gun. The FBI handles checks on long gun sales, while the Wisconsin Department of Justice does checks for handgun purchases.", "RELATED: Do red flag laws allow gun seizure without a judge’s OK?", "RELATED: Sen. Scott Fitzgerald misfires with claim on gun background checks and Second Amendment", "RELATED: Can you buy a gun in Wisconsin after a felony or restraining order?", "Anyone seeking to buy a handgun must fill out a DOJ form that asks a series of questions about disqualifying past conduct. They must say, for example, if they’ve been convicted of a felony, found not guilty of a felony in Wisconsin by reason of mental disease, been convicted of a juvenile offense that would be a felony if they were an adult, or are under a court order or injunction that would ban them from possessing a gun.", "The number of people failing background checks once DOJ processes that form roughly matches Vos’ claim.", "In fiscal year 2019 (July 2018 to June 2019), the DOJ processed 133,452 background checks, and 1,306 of those were denied, said DOJ spokeswoman Gillian Drummond.", "That’s consistent with fiscal 2018, when the DOJ processed 135,265 background checks and denied 1,202 of them, according to the Legislative Fiscal Bureau.", "State statute says the DOJ \"may\" report these denials to local authorities for investigation. But Drummond said DOJ treats that as a requirement and \"alerts local law enforcement for potential investigations.\"", "So Vos is right on the numbers, but what happens when failed background checks are passed on to local police for investigation?", "The core of Vos’ claim — that \"almost none\" of those denials are prosecuted — is trickier.", "For starters, the Justice Department doesn’t track which of their tips lead to prosecution.", "Beyond that, not every failed background check is a crime. The person has to know they’re banned from owning a gun.", "\"The attempt to purchase a firearm by a person not allowed under state or federal law to have a firearm is only illegal if the individual knows they are disqualified from the purchase,\" Drummond said. \"For example, if a person has a misdemeanor in another state, which is a felony under Wisconsin law, the person would be disqualified but may not know that prior to attempted purchase. Or a person who has admitted to a law enforcement officer that they’ve used an illegal substance is also disqualified even if they were not arrested.\"", "So it is a valid defense in this case to plead ignorance.", "Let’s move on to what we do know about prosecuting these cases.", "Vos’ evidence for the claim, as passed on by his office, is built around charges for a crime specific to the background check form. Wisconsin statute 175.35(3)(b)(1) makes it a misdemeanor punishable by up to nine months in jail to provide false information on the background check form.", "Those charges are indeed rare.", "A PolitiFact Wisconsin analysis of Wisconsin court records shows only 23 people were charged with giving false information on the gun purchase form from 2007 to 2018. In other words, we had about two per year over the last decade while DOJ rejects about 1,000 background checks per year.", "But that’s not the only charge that could result from trying to buy a gun illegally, prosecutors say.", "Michael Graveley, the Kenosha County district attorney, said a felon who handles even an unloaded gun is guilty of being a felon in possession of a firearm. So prosecutors could ignore the misdemeanor related to the background check form and charge the more serious felony related to gun possession.", "That was the case in 2016 when Chad A. Fletcher, 44, of Kenosha, applied to purchase a gun through the Kenosha Gander Mountain. He failed his background check through DOJ, but local police investigating the DOJ tip also found video footage of him handling the gun in the store.", "Fletcher was initially charged with possession of a firearm by a felon but not the background check offense. However, he reached a plea deal that later reduced the felony to a misdemeanor charge of providing false information on a background check.", "In short, prosecutors aren’t required to file that charge just because it applies — and they don’t always.", "\"There might be times it applies and prosecutors don’t issue it because they want something else,\" said Sheboygan County District Attorney Joel Urmanski.", "That something else in a background check case would typically be the felon in possession of a firearm charge. But that charge doesn’t shed much light on our question since the vast majority are related to circumstances outside the background check process. For the record, there were 10,000 such charges over the last decade. We can’t detail how many of those are connected to background checks without pulling records on each case.", "But the prosecutors we spoke to from several high-population counties weren’t aware of any significant volume of charges resulting from background checks.", "We should also note that a nationwide 2018 study found it wouldn’t be unusual for background checks in Wisconsin to rarely spur criminal charges. The analysis found only 12 prosecutions in fiscal 2017 in the 29 states where federal officials handle background checks. In 13 states that handle their own checks, 10 do not investigate or prosecute firearm denials at all.", "Vos said \"almost none\" of the 1,000 or so people failing a background check each in year in Wisconsin are prosecuted. It’s a lot more complicated claim than it might seem.", "Indeed, on average only about two people per year are charged specifically with the crime of providing false information on a background check.", "Prosecutors say violators can also be charged with the more serious crime of being a felon in possession of a firearm — or attempting to do so. But anecdotally we found no evidence that this happens frequently.", "And, of course, failing a background check is only a crime if the applicant knew they were banned from having a gun.", "Add it all together and we get a statement that appears to be accurate, but it needs some additional information and clarification. That’s what we call Mostly True.", "WISN-TV, \"'UPFRONT' recap: Assembly Speaker says governor is playing politics with special session,\" Nov. 10, 2019", "Wisconsin Legislative Fiscal Bureau, Concealed Weapons Licensure and Handgun Purchaser Background Checks (page 27), January 2019", "USA TODAY, Very few who may have lied trying to buy guns are investigated or charged, study finds, Sept. 6, 2018", "Email exchange with Kit Beyer, spokeswoman for Robin Vos, Nov. 14, 2019", "Email exchange with Gillian Drummond, Wisconsin Department of Justice spokeswoman, Nov. 18-21, 2019", "Wisconsin Legislative Council, email to Robin Vos’s office, Oct. 15, 2019", "Wisconsin Department of Justice, Firearm Dealer Notification (Handgun Transfers), revised April 2018", "Interview and email exchange with Michael Graveley, Kenosha County district attorney, Nov. 18-20, 2019", "Interview and email exchange with Joel Urmanski, Sheboygan County district attorney, Nov. 18-20, 2019", "Email exchange with Zeke Wiedenfield, Walworth County district attorney, Nov. 18-20, 2019", "Interview and email exchange with Kent Lovern, Milwaukee County chief deputy district attorney, Nov. 18-20, 2019", "PolitiFact Wisconsin, analysis of Wisconsin court records, Nov. 22, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]