["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "\"Terrifying,\" is how Democratic strategist Paul Begala describes the thought of Republican Ken Cuccinelli winning this year’s gubernatorial race.", "Begala sounded the alarm in a June 27 fundraising letter for the Democratic Governors Association, outlining Cuccinelli’s \"extreme positions\" against abortion, government entitlement programs and global warming research. This list was familiar until this eye-popper: \"He attacked churches for helping the poor,\" Begala wrote of Cuccinelli.", "We asked Begala, a frequent CNN contributor, to prove his claim. He pointed to an article in The Virginian-Pilot about a Sept. 29, 2012, keynote address that Cuccinelli gave to the Cherish Life Ministries Christian Life Summit in Ashburn, Va.", "A video of Cuccinelli’s speech, posted along with the story, certainly shows the attorney general heaping criticism on Catholic church leaders.", "\"One of my great frustrations as a Catholic, present company excepted, is how soft and weak the leadership of my church has been,\" Cuccinelli said. \"They have for decades lobbied government to do this and to do that -- all of which should be done by the church if they’re done at all in society. And so over time they have made themselves out to be nothing but the largest special interest group in America.\"", "Begala, to support his statement that Cuccinelli \"attacked churches for helping the poor,\" zeroed in on a comment the Republican made about Catholic bishops:", "\"They’ve helped create a culture of dependency on government, not God,\" Cuccinelli said, lamenting that bishops were arguing churches \"shouldn’t be the primary institution in a society that is responsible for service to the poor.\"", "But that statement doesn’t strike us as \"an attack on churches for helping the poor.\" To the contrary, Cuccinelli was criticizing what he said was an effort by the church to hand off some of its charitable role to government.", "Cuccinelli stressed that point later in his speech:", "\"Two most important things in human life -- your faith in God and, as between ourselves, love -- and government can do neither, can do neither one,\" he said. \"And our churches are asking that institution -- and have for decades -- to step up and take on their role.\"", "Cuccinelli made a similar argument in his 2013 book, \"The Last Line of Defense.\"", "\"One reason the American people got stuck with Obamacare was due to a devolution in American thinking over time that it was the government’s job to provide health care for those who couldn’t afford it on their own,\" Cuccinelli wrote. \"But taking care of the poor is ideally the province first of families, churches and charities, not the government.\"", "A final note: The Democratic Governors Association, for whom Begala wrote the fundraising letter, is the largest contributor to Cuccinelli’s opponent -- Democrat Terry McAuliffe. It donated $2 million to McAuliffe’s campaign on May 13, according to records compiled by Virginia Public Access Project.", "Our Ruling", "Begala said Cuccinelli \"attacked churches for helping the poor,\" a statement that suggests the Republican opposes the charitable work done by religious organizations.", "But a full reading of Cuccinelli’s comments show he was saying the opposite: That  charitable work should be the responsibility of religious organizations -- not the government.", "We rate Begala’s statement False.", "Daily Kos, \"VA-Gov: Paul Begala lists the reasons why Ken Cuccinelli is crazy and bad for Virginia,\" June 27, 2013.", "E-mail from Paul Begala, July 2, 2013.", "E-mail from Danny Kanner, director of communications at the Democratic Governor’s Association, July 2, 2013.", "The Virginian-Pilot, \"Cuccinelli critical of Catholic approach to poor,\" Dec. 13, 2012.", "Think Progress, \"Virginia gubernatorial candidate blasts Catholic Church for creating ‘a culture of dependency on government, not god,’\" Dec. 13, 2012.", "Ken Cuccinelli, \"The last line of defense,\" pages 54-59, 2013", "Virginia Public Access Project, Contributions to Terry McAuliffe, accessed July 3.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]