["“The president has no plan. He has not laid out anything. He knew all the way back in February how serious this crisis was. He knew it was a deadly disease. What did he do? He's on tape acknowledging he knew it, he said he didn't tell us or give people a warning of it, because he didn't want to panic the American people,” the former vice president said.", "Trump countered that his administration had “done a great job” in responding to the virus, saying: “We got the gowns, we got the masks, we made the ventilators… and now we’re weeks away from a vaccine, we’re doing therapeutics already.”", "Trump’s response to the virus -- which has killed more than 205,000 people in America and infected nearly 7.2 million -- is a key issue for voters who will decide whether the real estate mogul-turned-politician will win a second term.", "AFP Fact Check examines Trump’s efforts to combat the virus below.", "Trump told Bob Woodward on February 7, 2020 that the virus is “deadly stuff” and is “more deadly than... even your strenuous flus,” according to a recording of a call between the investigative journalist and the US president.", "“You just breathe the air -- that’s how it’s passed,” Trump said.", "Although Trump knew the virus was dangerous, he did not reflect that in his public remarks, instead repeatedly downplaying the risks it posed.", "On February 27, Trump had said the risk the virus posed to the American people was “very low” and that the number of cases “is going to be down to close to zero” within days, during one of his daily briefings on the virus. He then compared it to the common flu on March 9.", "Trump told Woodward on March 19 that “I wanted to always play it down,” adding: “I still like playing it down, because I don’t want to create a panic.”", "There have been major shortages of key personal protective equipment such as masks during the coronavirus crisis.", "The president has invoked the Defense Production Act to respond to the pandemic, but the non-partisan Congressional Research Service said in late July that, “Despite continued congressional concerns over personal protective equipment (PPE) availability, the Administration has not consistently employed DPA authorities to expedite PPE contracts.”", "Coronavirus vaccines are, as Trump said, in the works, but his timetable of “weeks” is questionable.", "Dr Anthony Fauci, head of the National Institute of Allergy and Infectious Diseases (NIAID) and a member of the Coronavirus Task Force, said that: “We hope as we go along that by the end of this year, or the beginning of 2021, we will at least have an answer whether the vaccine, or vaccines plural, are safe and effective.”", "Trump has also advocated treatments that were ineffective if not potentially harmful, and delayed advocating the use of face masks, despite evidence that they help curb the virus’s spread.", "He repeatedly pushed hydroxychloroquine as a treatment for Covid-19. But according to health authorities and independent experts, the drug -- which Trump said he took himself -- does not treat or prevent the disease caused by the novel coronavirus, and can in fact pose health risks.", "He also suggested countering the virus with “light inside the body” or injecting disinfectant.", "And although the US Centers for Disease Control and Prevention recommended on April 3 that Americans wear face masks to help curb the spread of the virus, Trump refused to do so in public until July, a stance that was embraced by his political supporters.", "The president did not take a firm stance in support of masks until later that month, as cases rose in southern states.", "Trump said in late March that keeping the virus death toll in the 100-200,000 range would mean that “we all, together, have done a very good job.” Those figures have been exceeded.", "Biden’s coronavirus plan calls for making free testing widely available -- something that has been done under Trump, though the president has blamed it for unfavorably high US infection numbers, and there have been major delays in obtaining test results in some areas.", "Biden’s plan also calls for accelerating the development of treatments and vaccines, which is currently underway, ensuring that there are no out-of-pocket costs for Covid-19 treatment, and enacting a “decisive economic response” to aid individuals and small businesses affected by the crisis, among other steps.", "“Public health emergencies require disciplined, trustworthy leadership grounded in science. In a moment of crisis, leadership requires listening to experts and communicating credible information to the American public,” the plan says.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]