["The 35-second video was published here on Facebook on October 22, 2019. It has been viewed more than 1,500 times.", "The post’s Hindi-language caption translates to English as: “Advance Diwali greetings to Pakistan.”", "Diwali refers to a Hindu festival.", "Below is a screenshot of the misleading Facebook post:", "The same video was also shared here, here, here and here on Facebook alongside a similar claim, and has been viewed more than 1,400 times.", "The claim is false; the video shows an Indian army drill at a firing range in India’s western state of Maharashtra.", "A reverse image search on Google using keyframes extracted using video verification tool InVID found the same video was published in this report by Indian news channel Republic TV on June 28, 2019.", "“Showcasing the country’s military prowess, video footage of the Indian Army firing the BM-21 Grad battery in Nasik’s Deolali has been accessed,” says the video caption.", "Below is a screenshot of the report:", "Deolali is a small hill station in Maharashtra state in western India. It does not neighbour Pakistan.", "According to Google Maps, Deolali is more than 660 kilometres (411 miles) away from the nearest land India-Pakistan land border at Kuwala.", "Below is a screenshot of the distance:", "A search on Twitter found the same video posted here by journalist Manish Prasad, from Hindi-language broadcaster India TV, on June 28, 2019.", "Roar of #BM21Grad-\n\n\t\t20 sec,40 #Rockets.\n\t\tRange- 40km and more with Upgradation soon.#God of of battlefield and Lock and key with motto of “Sarvatra izzat o iqbal”\n\n\t\tWatch @indiatvnews. Report from Artillery Range.@adgpi pic.twitter.com/DqP4kp3Cjw", "Prasad also tweeted a second video of the drill from a different angle here on the same day.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]