["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Bernie Sanders is often criticized for \"pie-in-the-sky\" proposals and impractical ideals, but his campaign argues the Vermont senator actually gets things done.", "\"Bernie Sanders passed more roll call amendments in a Republican Congress than any other member,\" according to a TV ad paid for by the Sanders campaign.", "A version of this ad appears on Sanders’ YouTube channel, and Sanders has made this claim on Twitter and Facebook as well so we wondered if it was true.", "The Sanders campaign didn’t get back to us, but we found that this carefully worded statement is accurate for his earlier years in Congress.", "The ‘amendment king’", "Sanders served in the House of Representatives from 1991 to 2006 and has been in the Senate since then. Republicans were in control of the House from 1995 to 2007 and of the Senate from 2015 to present.", "In 2005, Rolling Stone named Sanders the \"amendment king\" of the House. At the time, the title held true with a specific qualification: amendments agreed to by record votes. (Amendments can also be passed with voice votes, in which the volume of yeas and nays dictates passage, or by unanimous consent, in which no one raises an objection.)", "Out of 419 amendments Sanders sponsored over his 25 years in Congress, 90 passed, 21 of them by roll call votes. Here’s a breakdown (bold indicates Republican Congresses):", "Total amendments passed", "Passed by roll call vote", "2015 to present", "4", "1", "2007 to 2015", "37", "3", "1995 to 2007", "49", "17", "1991 to 1995", "0", "0", "Total", "90", "21", "From 1995 to 2007, Sanders passed 17 amendments by a recorded roll call vote — more than any other member in the House.", "Ohio Democrat James Traficant came in second with 16 roll call amendments, but he served five less years than Sanders after being indicted on several corruption charges in 2002 and then expelled from Congress. If we look at all amendments, not just those passed by roll call votes, Traficant passed 72 more than Sanders.", "New Jersey Republican Chris Smith, who served in the same time period as Sanders, finished third with 14 roll call amendments (and 32 overall amendments).", "Craig Volden, an expert on the legislative process at the University of Virginia, told PolitiFact that records like these are rather unusual in the House.", "\"There are so few members with large numbers of substantive and successful amendments,\" he said. \"Sanders and Traficant were exceptions to that rule.\"", "In comparison, Hillary Clinton passed zero roll call amendments during her tenure as a senator from New York from 2001-09.", "Overall effectiveness", "In the current Congress, Sanders ranks fourth when it comes to the number of career roll call amendments passed, according GovTrack founder, Josh Tauberer. The three lawmakers who top him are Sen. Jeff Flake, R-Ariz., with 27 in 15 years in Congress; Sen. Barbara Boxer, D-Calif., with 24 in 33 years; and Rep Steve King, R-Iowa, with 22 in 13 years.", "Roll call amendments aside, Sanders isn’t shattering any legislative records, though he’s not doing poorly either. Tauberer’s research places Sanders at No. 14 in Congress with 90 amendments. The other senator from Vermont, Democrat Patrick Leahy, on the other hand, has passed 226.", "Of course, amendments are just one of the ways lawmakers press their agendas. Sanders has had much less luck with passing bills.", "During his 25 years in Congress, Sanders introduced 324 bills, three of which became law. This includes a bill in a Republican Congress naming a post office in Vermont and two more while Democrats had control (one naming another Vermont post office and another increasing veterans’ disability compensation). Clinton, for the record, also passed three bills in eight years.", "But the sparse number of bills isn’t surprising. Volden and Vanderbilt University’s Alan Wiseman assess the legislative effectiveness of House members by comparing their records to a benchmark. According to this analysis, Sanders has either met or exceeded expectations during his tenure in the House (bold indicates Republican Congresses):", "Congress", "Grade", "Benchmark score", "Effectiveness score", "1991-1992", "Meets expectations", "0.422", "0.335", "1993-1994", "Meets expectations", "0.411", "0.219", "1995-1996", "Exceeds expectations", "0.199", "0.463", "1997-1998", "Exceeds expectations", "0.258", "0.347", "1999-2000", "Meets expectations", "0.397", "0.231", "2001-2002", "Meets expectations", "0.439", "0.343", "2003-2004", "Meets expectations", "0.493", "0.266", "2005-2006", "Meets expectations", "0.514", "0.379", "Lawmakers who belong to the party in control are five times more likely to have their bills go anywhere than minority party members, according to Volden. So Sanders’ legislative approach may seem like fixating on small potatoes, but for an independent who caucuses with the minority party, it’s a smart strategy.", "\"He could have either resigned himself to that fate, changed the nature of his legislation and coalition-building strategy, or offered amendments on the floor,\" Volden said. \"He chose the third of these paths, making him more influential in shaping policy than if he had taken the first path. Why he did not take the second path is an open question — likely linked to his ideological views.\"", "Our ruling", "A campaign ad for Sander said, \"Bernie Sanders passed more roll call amendments in a Republican Congress than any other member.\"", "That’s a very specific way of slicing and dicing Sanders’ effectiveness as a lawmaker, but it’s accurate. From 1995 to 2007, when Republicans controlled Congress, Sanders passed the most roll call amendments (17) out of anyone in the House of Representatives.", "We rate his claim True.", "Political TV Ad Archive, Bernie Sanders ad, Feb. 13, 2016", "Rolling Stone, \"Inside the Horror Show That Is Congress,\" Aug. 25, 2005", "Congress.gov searches", "PolitiFact analysis of amendments passed by Bernie Sanders", "The Lawmakers searches", "Email interview with Josh Tauberer, founder and researcher at GovTrack, March 7, 2016", "Email interview with Craig Volden, professor of public policy and politics at the University of Virginia, March 15, 2016", "The Gazette, \"Fact Checker: Just how effective was Bernie Sanders with a Republican Congress?\" Jan. 8, 2016", "New York Times, \"Via Legislative Side Doors, Bernie Sanders Won Modest Victories,\" March 14, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]