["About this rating", "In 1492, Christopher Columbus sailed the ocean blue. And in 1493, the Italian explorer spotted what he believed to be mermaids.", "While sailing to what would be eventually known as the New World, Columbus reportedly discovered what he thought were \"mermaids\" — almost certainly manatees — while off the coast of Africa and again while sailing near the Dominican Republic. According to historical records documented by the Biodiversity Heritage Library, Columbus described them as “not as beautiful as they are painted, since in some ways they have a face like a man.”", "Of this account, the South Florida Sun-Sentinel reported that Columbus was \"mentally primed for mermaids,\" so his observation may have been something of a self-fulfilled prophecy. Folklore was rife with tales of mermaids, and old maps of the known world were \"always fringed with mermaids and monsters,\" Anthony Piccolo, a professor of literature at Manhattanville College, told the publication.", "And though his written report describing the swimming mammals is among the first to confuse them with mermaids, Columbus was certainly not the only observer to connect the legend and the animal.", "A mermaid published in the 13th-century work by Jacob van Maerlant “Der Naturen Bloeme” . Research Gate", "Tales of creatures similar to mermaids and mermen extend as far back as 7,000 years ago to the Babylonians, who worshipped the fish-tailed god Oannes. Typically described as having the head and chest of a woman with fishlike lower limbs, mermaids appear in folklore around the world, largely as a representation of the dangers of sailing. With a seductive face and a beautifully idyllic voice, these \"sirens\" were said to lure sailing men and their ships to their demise.", "Both manatees and their closely related cousins, dugongs, belong to the scientific order Sirenia, so named for their associations with the siren myths. According to the nonprofit conservation group Save the Manatee, it is believed that at least some of the long-winded accounts of sailors who reported seeing mermaids were inspired by sightings of the blubbery sea cows.", "“With a little imagination, manatees have an uncanny resemblance to human form that could only increase after long months at sea,” wrote the organization in an educational pamphlet. “In fact, manatees and dugongs have helped to perpetuate the myth of mermaids.”", "Smith Collection/Gado/Getty Images", "A 2013 paper written by Assistant Professor Cristina Brito of the Universidade NOVA de Lisboa in Portugal, “On Mermaids and Manatees,” described the cultural and folk manifestations of the mermaid-manatee connection in modern times throughout myths and legends.", "“Mermaids and manatees exist through time and cultures in a limb, in between the real-life and the world of imagination, in the middle of the everyday life of the sailors and the world of every people’s dreams, allegories, beliefs, superstitions and even fears,” wrote Brito in the case study.", "A skeleton of a manatee and calf. Museum of Osteology/Public Domain", "A quick look at the anatomy of a manatee explains how the seagrass-grazing mammals could have been mistaken for a mermaid.", "For starters, the marine mammal breathes air and gives live birth to their young, whom they nurse for up to two years. The two forelimbs found on a manatee are more like hands than they are flippers, each having five sets of fingerlike bones with three to four nails. And with small eyes, two nostrils, and a small amount of body hair, a fatigued, dehydrated — and likely lonely — sailor could perhaps mistake the mammal for a human form. Though they have no neck, manatees have six cervical vertebrae that allow them to turn their head, and the charismatic sea cows can rise out of the shallow seas to appear upright, a phenomenon known as a “tail stand,” according to National Geographic.", "A manatee published in the work by French Botanist Carolus Clusius in 1605. Library of the Madrid Botanical Garden/Research Gate", "As reports from the New World arrived in Europe in the 15th and 16th centuries, descriptions of the then-exotic manatee soon followed. After Columbus’ initial exploration of the Caribbean, French biologist Rondelet Guillaume gave what would soon be the first zoological account of the manatee in 1554. Spanish Captain Gonzalo Fernando de Oviedo y Valdes recorded one of the first descriptions of manatees in Florida in 1526 when he traveled to America, and Italian naturalist Ulisse Aldrovandi published a description and drawing of a manatee in 1613. Manatees were referred to by many names and some scientific descriptions were more biologically accurate than others, but the Renaissance was a period characterized by a mixing of religion, legend, and scientific discovery that often blended the boundaries of fantasy and fact.", "In her paper, Brito cited Portuguese chronicler António Galvão, who wrote of manatees in the Caribbean Sea in 1497:  \"Is there a fish called manatim; is big and has a cow's head and face, and also in the flesh it looks very like it (…) and the female has breasts with nipples that feeds its children who are born alive.\"", "In another example, Spanish Jesuit missionary and naturalist Diaz Acosta Facundo referenced manatees in the region in this 1590 description:", "In the islands of Barlavento, namely Spanish Cuba, Puerto Rico, Jamaica, there is the so-called manatee, a strange kind of fish, if one can name fish to an animal, whose cubs are born alive, and has teats, and with milk, they are raised and eats herb in the fields; but indeed, usually resides in the water. Due to the mentioned reasons, they eat it as fish, but when in the Holy Sunday, when I ate it in a Friday, it almost had scruples, because the color and flavor seemed like nothing but veal chops or knuckle chops, the slices if this fish: Is big as a cow.", "A manatee, also then called piraíba, published in the 1647 body of work by Lisboa. Overseas Historical Archive Lisbon/Research Gate", "Two of the most influential sketches of manatees were made in the 17th century, one (above) by Brazilian missionary and natural historian of Brazil Cristóvão de Lisboa. And in 1687, Italian missionary Father Giovanni who, in his recorded local history and culture of travels to Africa, drew the “woman-fish” (below).", "On Mermaids and Manatees", "The mermaid myth was perpetuated through 16th- and 17th-century retellings of explorations of the New World and throughout the Atlantic, with many of the descriptions making their way into natural history archives.", "“Even though with some intermixture with the mythological marine being, we can find in these reports a glimpse of the real animal, its anatomical and behavioral characteristics,” wrote Brito.", "It wasn’t until 1758 that manatees were classified as a species (Trichechus manatus) by Carl Linneaus, the father of the scientific order, and the order Sirenia was given its name in 1811 by Johann Illiger, the German entomologist and zoologist. Even then, science was slow to overtake legend.", "The following passage is taken from the 1831 Arcana of Science and Art, a British magazine of natural history:", "A short time back, the skeleton of a mermaid, as it was called, was brought to Portsmouth, which had been shot in the vicinity of the island of Mombass. This was allowed to be submitted to the members of the Philosophical Society, when it proved to be the Dugong … It was, if I recollect right, about six feet long: the lower dorsal vertebrae, with the broad caudal extremity, suggested the idea of a powerful fish-like termination; whilst the fore legs, from the scapula to the extremities of the phalanges, presented to the unskillful eye an exact resemblance to the bones of a small female arm.\"", "Until the natural sciences were truly developed well into the 19th century, legends and myths dominated humanity’s understanding of the natural world, including the connection between manatees and mermaids.", "“We cannot simply say that since the moment manatees appeared in human written history, mermaids vanished from memories,” wrote Brito. “Mermaids are a good example of the persistence into comparatively modern times of a legend that is nearly as old as the written records of man.”", "A manatee and her calf. West Indian Manatee in Puerto Rico. USFWS Digital Library/Public Domain", "It’s all a small glimpse into understanding how folklore, myth, and legend perpetrate and sometimes stunt, scientific understanding. Though the literature has a much better understanding of the manatee today, relatively little is known about the species' life cycle and behavior, or the threats facing its survival.", "The International Union for Conservation of Nature has the West Indian manatee — America’s subspecies — listed as vulnerable, with decreasing population trends. Aerial surveys conducted in 2019 found that there were at least 5,733 individuals in Florida, according to Save the Manatee. Like many marine mammals facing an increasing risk of extinction, manatees are primarily threatened by human activities, namely boat strikes, and habitat destruction through climate change.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]