["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "You know those members of Congress who are responsible for the federal government shutdown? While staffers have been furloughed, their bosses continue to collect their paychecks.", "During an Oct. 2 interview on CNN, Wolf Blitzer asked U.S. Rep. Mario Diaz-Balart, R-Miami, \"Will you accept your paycheck as 800,000 other federal workers are being denied theirs?\"", "Diaz-Balart replied that he hopes staffers get repaid when the shutdown is over. As for his own paycheck, Diaz-Balart didn’t say he would or wouldn’t accept his paycheck. Instead, he said this: \"There is a bit of a constitutional issue by the way, as you know, when you are dealing with the paychecks of members of Congress.\"", "A few days later, Diaz-Balart voted to give back pay to furloughed federal workers. The measure passed unanimously in the House, 407 to 0.", "Still, we were intrigued by his comments that pay for legislators raises constitutional issues. What does the Constitution tell us about congressional paychecks amid a shutdown?", "What the Constitution says", "About 800,000 federal workers have been furloughed during the shutdown that started Oct. 1. During past shutdowns, furloughed workers received back pay once the shutdown was over. Other workers have been deemed essential (or in government-speak \"excepted\") and must work for now while getting paid when the shutdown ends. Finally, President Barack Obama signed a law to allow active military and the civilians and contractors who support them to get paid during the shutdown.", "But the rules that apply to federal workers don’t apply to members of Congress. Most members earn $174,000 a year, with leadership getting a little more.", "\"Due to their constitutional responsibilities and a permanent appropriation for congressional pay, members of Congress are not subject to furlough,\" states a September report from the nonpartisan Congressional Research Service.", "Article I, Section 6, of the Constitution authorizes pay for members of Congress. \"The Senators and Representatives shall receive a compensation for their services, to be ascertained by law, and paid out of the Treasury of the United States,\" it states.", "Most of the experts we interviewed and news articles we read agreed that according to the Constitution, Congress continues to get paid, even during a shutdown.", "The purpose of the language about congressional pay \"was to resolve the once-hot dispute over whether the elected representatives to the new federal government would be paid by the states or out of the federal treasury,\" said Ilya Shapiro, Senior Fellow in Constitutional Studies at the Cato Institute. \"So yes, Congress can’t reduce/eliminate its own pay during a shutdown. I guess that makes congressmen and senators the primo ‘essential’ federal workers.\"", "But we’ll offer one counterargument by University of Miami constitutional law professor Stephen Schnably.", "If people are saying the Constitution \"is a barrier to their pay being withheld during the shutdown, I’d have to say the text doesn’t necessarily support that. It doesn’t say, ‘regardless of any appropriation requirement.’ \"", "However, \"what really counts in this area is Congress’s practice over the years,\" Schnably said. \"Mostly these provisions have been left to Congress to interpret.\"", "Right now, Congress is scheduled to be paid. \"Constitutionally, we have to disperse their pay, but we are honoring member requests to hold on to their pay until after the shutdown,\" said Dan Weiser, communications director for the House’s Office of the Chief Administrative Officer.", "At least 125 members have said that they will refuse their paycheck or donate it, according to the Washington Post, though some observers say that’s just a publicity stunt. And it might be a moot point because members get paid at the end of the month and it’s possible the shutdown will be over before then. (Diaz-Balart’s chief of staff declined to discuss with PolitiFact if Diaz-Balart wants to forgo his pay but when questioned about it on CNN he said that lawmakers need to avoid \"gimmicks.\")", "One final wrinkle about their paychecks: Congress can’t change its own pay until after an election happens. The 27th Amendment, adopted in 1992, states, \"No law, varying the compensation for the services of the Senators and Representatives, shall take effect, until an election of Representatives shall have intervened.\"", "That amendment means Congress can’t vote to stop it's pay right now, said Kermit Roosevelt, an expert on constitutional law at the University of Pennsylvania’s law school. However, Congress could pass a law for future shutdowns, saying they won’t be paid, he said.", "Past efforts to do that have failed, though.", "In January, U.S. Sens. Barbara Boxer, D-Calif., and Bob Casey, D-Pa., introduced a bill that would would prevent Congress and the president from being paid during a shutdown or default. The Senate passed such a bill in 2011, but the House didn’t act. Similar efforts this fall leading up to the shutdown also failed.", "Our ruling", "When asked about whether he would forgo his own paycheck during the shutdown, Diaz-Balart said, \"There is a bit of a constitutional issue ... when you are dealing with the paychecks of members of Congress.\"", "He is correct: Article I, Section 6, of the U.S. Constitution authorizes pay for members of Congress \"ascertained by law, and paid out of the Treasury of the United States.\"", "Members can ask the House to withhold their pay, but that’s just a temporary symbolic move -- particularly since they aren’t scheduled to get a paycheck until the end of the month.", "We rate this claim True.", "CNN, Interview with U.S. Rep. Mario Diaz-Balart, Oct. 2, 2013", "Congressional Research Service, \"Shutdown of the federal government: causes, processes, effects,\" Sept. 25, 2013", "Congressional Research Service, \"Congressional salaries and allowances,\" Jan. 15, 2013", "Washington Post’s Post Politics blog, \"Which lawmakers will refuse pay during a Congressional shutdown?\" Oct. 4, 2013", "Washington Post’s The Fed Page, \"House and Senate bills would pay federal workers for shutdown furloughs,\" Oct. 3, 2013", "Washington Post’s Wonk Blog, \"Congress gets paid during a shutdown while staffers don’t. Here’s why,\" Oct. 1, 2013", "Washington Post’s Wonk Blog, \"Absolutely everything you need to know about how the government shutdown will work,\" Sept. 30, 2013", "Wall Street Journal, \"More than 800,000 federal workers are furloughed,\" Oct. 1, 2013", "Wall Street Journal, \"Lawmakers: military pay law covers civilians, contractors,\" Oct. 2, 2013", "CNN, \"Congress still gets paid -- it’s in the Constitution,\" Oct. 2, 2013", "USA Today, \"Lawmakers not likely to miss a paycheck during shutdown,\" Oct. 2, 2013", "Kansas City Star, \"During shutdown, some in Congress turn down pay,\" Oct. 3, 2013", "U.S. Sen. Barbara Boxer press release, \"Boxer, Casey introduce bill to prevent lawmakers from being paid during a default or government shutdown,\" Jan. 22, 2013", "Cornell University Law School, Article 1 of the U.S. Constitution and 27th Amendment, Accessed Oct. 4, 2013", "U.S. House of Representatives, 27th Amendment, Accessed Oct. 4, 2013", "U.S. Senate, Senate salaries since 1789, Accessed Oct. 4, 2013", "House Press Gallery, Salaries, January 2013", "The Volokh Conspiracy, The 27th Amendment, Jan. 22, 2013", "PolitiFact, \"Top claims about the federal government shutdown,\" Oct. 4, 2013", "Interview, Cesar Gonzalez, chief of staff for U.S. Rep. Mario Diaz-Balart, Oct. 4, 2013", "Interview, Dan Weiser, communications director for the House’s Office of the Chief Administrative Officer, Oct. 4, 2013", "Interview, Kermit Roosevelt, an expert on Constitutional Law at the University of Pennsylvania’s law school, Oct. 4, 2013", "Interview, Ilya Shapiro Senior Fellow in Constitutional Studies, Editor-in-Chief of the Cato Supreme Court Review Cato Institute, Oct. 4, 2013", "Interview, Stephen Schnably, constitutional law professor, University of Miami, Oct. 4, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]