["By Vanessa Schipani", "Posted on August 11, 2016 | Updated on August 15, 2016", "In Miami, Hillary Clinton falsely claimed that “my opponent in this race, his campaign officials” have called Zika “an insignificant issue.” That was said by an unpaid local supporter of Donald Trump, not “campaign officials.” Trump himself has called Zika a “big problem.”", "At the Borinquen Medical Center in Miami on Aug. 9, Clinton mentioned the first cases of Zika transmitted on U.S. soil in Wynwood, a neighborhood of Miami. As of Aug. 3, there have been six locally acquired cases of Zika in Florida, in addition to 322 travel-associated cases of the virus, according to the CDC.", "Florida is the only state with locally acquired cases of Zika. But throughout the U.S., there have been more than 1,800 travel-associated cases.", "The Zika epidemic, which first began in Brazil in May 2015, was declared a global public health emergency by the World Health Organization in February 2016. The virus can lead to birth defects, including an abnormally small head and often incomplete brain development, as the Centers for Disease Control and Prevention recently confirmed.", "Clinton expressed disappointment with Congress’ failure to pass legislation for emergency funding to combat the Zika epidemic before going on recess in mid-July. Congress is not slated to return until early September, but she urged “Republican leaders” in Congress “to call people back for a special session and get … a bill that is focused on combating Zika passed.”", "She then criticized Trump and his campaign’s position on Zika.", "Clinton, Aug. 9: I disagree with those who say that Zika is an insignificant issue. My opponent in this race, his campaign officials have said that, and I think that does a grave disservice because when you come here to a health clinic that is working so hard to get people to come in, to get tested, working with the health departments, working with sanitation departments, working with people to try to go after and prevent a population of mosquitoes from growing, this is something we need to take seriously, and I certainly do.", "We contacted Clinton’s campaign to ask whom specifically Clinton was speaking about when she referred to Trump’s “campaign officials.” Clinton campaign spokesman Josh Schwerin pointed us to a comment made by an individual named Juan Fiol in June.", "Fiol told the Boston Globe, “We have bigger mosquitoes to squash than Zika — like ISIS, the national debt, Iraq, and Afghanistan. …We have a wall to build to keep the illegals out. We have so many other issues that are more important than this.” He also called Clinton “sophomoric” for “taking on such an insignificant issue.”", "First off, Fiol is one person, but Clinton referred to the plural, “campaign officials.”", "Second, and more important, Fiol is not a Trump “campaign official.”", "The Globe referred to Fiol as “Trump’s vice chairman of Miami-Dade County.” But Karen Giorno, Trump’s Florida chief strategist and senior political adviser, told us by email, “Mr. Fiol is not the vice chair of Miami-Dade County.” She said he is “an unpaid supporter.”", "We checked and Fiol doesn’t appear on the payroll in Trump’s July 2016 campaign finance report, and he was not reimbursed for any campaign expenses. His name is not mentioned at all in the report’s 9,274 pages. He’s also not included on a list of the Trump campaign’s staffers and advisers, nor on a similar list specific to Florida.", "In fact, on Aug. 10, Fiol posted to his Facebook page, “No rain, volunteering,” along with a picture of himself and two people wearing Trump hats. He tagged the photo as being taken at the BB&T Center in Fort Lauderdale, Florida, which hosted a Trump rally on Aug. 10.", "We contacted Fiol himself through Facebook and email, but he has yet to respond. We also reached out to Trump’s national press secretary, Hope Hicks, to ask about Fiol’s position and responsibilities with regard to Trump’s campaign, but she did not respond.", "Schwerin at Clinton’s campaign also referred us to Miami Herald and CNN articles from Aug. 3 regarding Trump’s comments about Florida Gov. Rick Scott’s handling of the state’s Zika problem. Both news organizations quoted Trump as saying, “First of all, you have a great governor who’s doing a fantastic job, Rick Scott, on the Zika. And it’s a problem, it’s a big problem.”", "When the local CBS reporter asked Trump if Congress should return for an emergency session to approve Zika funding, Trump said, “I would say that it’s up to Rick Scott. … It depends on what he’s looking to do, because [he] really seems to have it under control in Florida.”", "Giorno also told us by email, “Mr. Trump has joined Governor Scott in calling for immediate funding to fight the spread of Zika in Florida including the 10,000 Zika preparedness kits already requested. This remains an issue not isolated to Florida but one that is of concern nationally warranting a more robust response by the federal government.”", "In other words, she added, “Mr. Fiol’s remarks do not represent the views of Mr. Trump on Zika.”", "While Trump’s comments on Zika are limited, he has called it a “big problem,” not an “insignificant issue.” And Fiol, who did say the epidemic was insignificant, isn’t a Trump campaign official, but a volunteer.", "So Clinton was wrong when she claimed that “my opponent in this race, his campaign officials” have called Zika “an insignificant issue.”", "Update, Aug. 15: Fiol returned our email and told us, “I am an unpaid supporter, I speak for myself and not Trump.”", "Editor’s Note: SciCheck is made possible by a grant from the Stanton Foundation.", "https://www.sharethefacts.co/share/50c1ec40-550a-4da3-bdf1-5e0e5386d31e", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]