["About this rating", "Under some circumstances, federal employees can be laid off in targeted \"reduction in force\" plans, or RiF, after 30 days of government shutdown.", "The current shutdown is an \"emergency shutdown\" in which federal government employees cannot be laid off in RiF actions.", "In mid-January 2019, a meme spread on social media that led some users to believe furloughed federal government employees could be fired if the government remains in an ongoing shutdown for 30 days.", "But that scenario of hundreds of thousands of people losing their jobs in the current shutdown won't happen.", "Federal statute requires agencies to take reduction-in-force (RiF) action against employees who have been furloughed for 30 days or more, but that only applies in administrative furloughs, \"a planned event by an agency which is designed to absorb reductions necessitated by downsizing, reduced funding, lack of work, or any budget situation other than a lapse in appropriations.\"", "Furloughs of federal workers as a result of lapses in appropriation are called “emergency furloughs.\" According to the U.S. Office of Personnel Management, reduction-in-force regulations don't apply in such events:", "\"Reductions in force (RIF) furlough regulations and SES competitive furlough requirements are not applicable to emergency shutdown furloughs because the ultimate duration of an emergency shutdown furlough is unknown at the outset and is dependent entirely on Congressional action, rather than agency action. The RIF furlough regulations and SES competitive furlough requirements, on the other hand, contemplate planned, foreseeable, money-saving furloughs that, at the outset, are planned to exceed 30 days.\"", "As of this writing on 17 January 2019, the federal government is entering its 27th day of partial shutdown, the longest in U.S. history, and the result of an impasse reached between President Donald Trump and Democratic members of Congress over Trump's demand to include $5.7 billion in appropriations for new U.S.-Mexico border-wall construction. The shutdown has resulted in 800,000 federal employees going without pay, thousands of whom who have been ordered back to work anyway.", "Haslett, Cheyenne. \"On Day 25 of Longest-Ever Government Shutdown, 800,000 Federal Employees Are Without Pay.\"\r\n  ABC News. 15 January 2019.", "Haslett, Cheyenne. \"Tens of Thousands More Federal Employees Called Back to Work as Government Shutdown Reaches Day 27.\"\r\n  ABC News. 17 January 2019.", "Pengelly, Martin, and Laughland, Oliver. \"Trump Rejects Lindsey Graham's Proposal to Reopen Government.\"\r\n  The Guardian. 14 January 2019.", "U.S. Office of Personnel Management. \"Guidance for Shutdown Furloughs.\"\r\n  September 2015.", "U.S. Office of Personnel Management. \"Pay & Leave; Furlough Guidance.\"", "U.S. Office of Personnel Management. \"Workforce Restructuring; Reduction in Force.\"", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]