["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A video spreading widely on Facebook opens with a fake Time magazine cover showing Barack Obama and then piles on more misinformation about the former president over more than four minutes.", "\"Time is up\" and \"Treason\" appear as headlines on the supposed cover of the magazine, and there’s a partial headline that’s cut off: \"How former president Barack Obama was the kingpin of the biggest political scandal in modern...\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We reviewed Time covers from 2008, when Obama was elected, to date and found no cover matching the image in the video.", "The video goes on to share more fake images of the president among unfounded claims.", "About 17 seconds into the video, one photo has been edited to show Obama wearing a turban while standing next to Osama bin Laden. In the original image, released by Hillary Clinton’s presidential campaign in February 2008, Obama was dressed as a Somali elder by Sheikh Mahmed Hassan, who is standing next to Obama during his visit to northeastern Kenya.", "The next image in the video shows former Secretary of State Condoleezza Rice, Clinton and Obama all posing separately with bin Laden. We’ve already fact-checked those photos — they’re fake.", "About 45 seconds into the video, an image of Obama and Clinton appears with this text: \"They paid a foreign government to falsify information, than lied to the courts to spy and overthrow Trump. Democrats lied and impeached Trump to hide their crimes.\"", "This touches on other claims we’ve already checked.", "After Trump won the Republican nomination, the Democratic National Committee hired an opposition firm called Fusion GPS to collect information on him. Fusion GPS then hired former British spy Christopher Steele to produce memos on Trump’s ties to Russia. He wrote a dossier that included salacious but unverified claims about Trump.", "In September 2019, House Democrats launched a formal impeachment inquiry on grounds that Trump illegally used his position as president to solicit help from a foreign government to damage his political opponent. We have a timeline of the impeachment proceedings, from 2013 through late 2019, here.", "About a minute and 11 seconds into the video, a photo of Obama appears with the names \"Jean Paul Ludwig\" and \"Barry Soetoro\" and a Social Security number. These refer to inaccurate claims that Obama’s real name is Barry Soetoro and that Obama has illegally been using the Social Security number of a dead man, Ludwig.", "The video also uses imagery and slogans associated with the wide-ranging QAanon conspiracy, which asserts without evidence that Trump is fighting against a deep-state cabal of pedophiles seeking to overthrow the president. About a minute and 45 seconds in, it claims that Obama helped \"plan a coup\" and that he should \"pay the price\" for treason.", "After that, another fake image appears, showing Obama kissing David Cameron, Britain’s former prime minister.", "Later in the video, a photo of former presidents Bill Clinton, George W. Bush and Obama appears and perpetuates the conspiracy theory that mass shootings in the United States are orchestrated by the government to achieve its policy agenda.", "\"Trump is sending us all to Gitmo for life,\" Clinton appears to be saying in the image.", "\"Let’s plan another mass shooting,\" Bush says.", "\"We can’t,\" Obama responds, \"all the restaurants and theaters are closed.\"", "Toward the end of the video, yet another doctored image appears. Snopes checked this one — it appears to show Russian President Vladimir Putin pulling Obama’s tie, but that didn’t happen.", "We rate these images False.", "Facebook post, Nov. 22, 2020", "Time vault, visited Nov. 23, 2002", "Guardian, Clinton aides claim Obama photo wasn’t intended as a smear, Feb. 25, 2008", "PolitiFact, Don’t fall for these altered images of Obama, Clinton and Rice with bin Laden, Feb. 18, 2020", "PolitiFact, Timeline: The Trump impeachment inquiry, Oct. 3, 2019", "PolitiFact, The FBI, the Steele dossier and wiretapping, explained, Sept. 11, 2018", "PolitiFact, Exaggerated post connects Clintons, Russia and uranium deal, Oct. 28, 2019", "PolitiFact, No, a college ID does not show Barack Obama was a foreign student at Columbia University, Dec. 9, 2015", "The Florida Times-Union, Fact-check: Obama’s SSN not the same as dead man, Feb. 18, 2012", "PolitiFact, No, this isn’t a real photo of Barack Obama kissing David Cameron, March 27, 2019", "Snopes, Does this photograph show Putin pulling President Obama’s tie? July 18, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]