["About this rating", "On 11 March 2016, the campaign of Republican presidential candidate Donald Trump was jarred when a scheduled rally in Chicago was disrupted by protesters, resulting in Trump's opting to cancel the event at the last minute:", "The Downstate event came after Trump pulled the plug on a Friday night rally in Chicago as thousands of protesters gathered outside and hundreds more were in the arena after getting tickets online through his campaign. After Trump canceled, citing security concerns, there were scattered skirmishes between supporters and demonstrators inside and outside the University of Illinois at Chicago Pavilion.", "Security in Bloomington was tight Sunday, with attendees told to leave bags and umbrellas in their vehicles, forcing some to don black trash bags to protect against the rain as they waited to pass through metal detectors. Hundreds of people didn't make it inside. Also outside was a group of about 100 protesters, who waved anti-Trump signs and chanted \"Mr. Hate, leave our state.\"", "In the immediate wake of those events, a number of Facebook users shared the image reproduced above, which overlaid a quote from Trump about protesters over an iconic news photograph of a student fatally shot by National Guard troops during a 4 May 1970 anti-war protest at Kent State University:", "\"I love the old days.\"", "\"You know what they used to do (to protesters) like that when they got out of line? They'd be carried away on a stretcher, folks.\"", "The quote reproduced with the image reflected words spoken by Donald Trump, but it was something of a paraphrase plucked from a longer statement, and it referenced an utterance made by Trump well before the chaotic Chicago rally.  After a disruption at a Las Vegas political rally that took place on 22 February 2016, Trump told his gathered supporters that:", "I love the old days, you know? You know what I hate? There's a guy totally disruptive, throwing punches. We're not allowed to punch back anymore ... I love the old days. You know what they used to do to guys like that when they were in a place like this? They'd be carried out on a stretcher, folks.", "Trump then briefly lauded police before describing the protester as \"throwing punches ... nasty as hell,\" and telling a cheering crowd:", "The guards are very gentle with him. He's walking out like big high-fives, he's smiling ... laughing. I'd like to punch him in the face, I'll tell ya.", "(Contemporaneous reporting suggested that the individual removed from the 22 February 2016 rally was not \"throwing punches.\")", "The image seen here truncated Trump's remarks, replacing \"to guys like that in a place like this\" with \"to protesters.\" A 23 February 2016 Esquire article pointed out that the euphemisms in Trump's commentary weren't entirely apparent to non-attendees:", "I wonder who the \"guys like that\" are, and why they don't belong \"in a place like this\"? The protester's identity is not yet clear, nor do we know whether or not they were actually throwing punches. But this is not the first time Trump has responded to dissenting voices at his rallies by encouraging violence.", "On 12 March 2016, Vox compiled variations of remarks made by Trump at various rallies on multiple dates across the United States and selected eight instances during which Trump made similar comments. Four of those examples were as follows:", "[1 February 2016, Iowa] \"If you see somebody getting ready to throw a tomato, knock the crap out of them, would you? Seriously. Okay? Just knock the hell. I promise you I will pay for the legal fees. I promise.\"", "[26 February 2016, Oklahoma] \"In the good old days, they'd rip him out of that seat so fast. But today, everybody's politically correct. Our country's going to hell with being politically correct.\"", "[29 February 2016, Virginia] \"Get him out of here please. Get him out. Get him out ... Are you from Mexico? Are you from Mexico? Huh? Are you from Mexico?\"", "[4 March 2016, Michigan] \"Get out of here. Get out. Out! ... This is amazing. So much fun. I love it. I love it. We having a good time? USA, USA, USA! ... All right, get him out. Try not to hurt him. If you do, I'll defend you in court. Don't worry about it ... We had four guys, they jumped on him, they were swinging and swinging. The next day, we got killed in the press — that we were too rough. Give me a break. You know? Right? We don't want to be too politically correct anymore. Right, folks?\"", "The image entered wide circulation following Trump's canceled Chicago rally and subsequent interest in the GOP candidate's lamentations that protesters couldn't be violently ejected from his rallies. The photograph upon which Trump's words were superimposed was well-known, as described in a 6 May 1990 New York Times article marking the twentieth anniversary of the prize-winning image:", "The photograph was of Mary Ann Vecchio, then a 14-year-old runaway from the Miami area, kneeling in anguish beside the body of one of four students slain by Ohio National Guardsmen on May 4, 1970.", "The photograph won a Pulitzer Prize for John Filo, a student photographer who is now deputy picture editor at Sports Illustrated magazine. It became a classic image of the Vietnam War and its repercussions at home.", "Context for the image and the events it depicts are available via the Kent State University Libraries' Special Collections and Archives.  In brief, as described at History.com, the Kent State shooting incident unfolded when:", "On April 30, 1970, President Richard M. Nixon appeared on national television to announce the invasion of Cambodia by the United States and the need to draft 150,000 more soldiers for an expansion of the Vietnam War effort. This provoked massive protests on campuses throughout the country. At Kent State University in Ohio, protesters launched a demonstration that included setting fire to the ROTC building, prompting the governor of Ohio to dispatch 900 National Guardsmen to the campus", "During an altercation on May 4, twenty-eight guardsmen opened fire on a crowd, killing four students and wounding nine. Following the killings, the unrest across the country escalated even further. Almost five hundred colleges were shut down or disrupted by protests. Despite the public outcry, the Justice Department initially declined to conduct a grand jury investigation. A report by the President's Commission on Campus Unrest did acknowledge, however, that the action of the guardsmen had been \"unnecessary, unwarranted, and inexcusable.\" Eventually, a grand jury indicted eight of the guardsmen, but the charges were dismissed for lack of evidence.", "It's mostly accurate to say that Trump made the remarks attributed to him in this image (along with numerous similar statements at multiple other rallies), but the use of the iconic Kent State photograph to accompany those remarks was someone's editorial choice (in the sense that Trump didn't literally advocate shooting political protesters nor did he directly reference the Kent State shootings in the course of what many news outlets described as increasingly violent rhetoric). The juxtaposition of Trump's words with the historically significant Kent State image was illustrative in nature, although Trump has repeatedly stated a desire to see individuals protesting at his campaign events treated  roughly (i.e., without \"political correctness\").", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]