["The one-minute two-second clip was published here in a Facebook post on August 19, 2019. It has been viewed more than 40,000 times.", "The Hindi language text above the footage translates to English as: “Pakistan PM Imran Khan went crazy over Article 370, started abusing journalists.”", "The post’s Hindi language caption translates to English as: “This is the first video of Imran Khan after removal of Article 370.”", "Below is a screenshot of the Facebook post:", "India and Pakistan have long disputed the Himalayan region of Kashmir. Both countries control part of the territory.", "India revoked Article 370, which gave its portion of Jammu and Kashmir a special status, on August 5, 2019. This AFP report explains the background to the decision.", "A shorter version of the video in the misleading post was also shared on Facebook here, here, here and here with a similar claim.", "The claim is false; the video has been taken from a press conference held on June 8, 2015, in Islamabad, during which a visibly irritated Khan urged supporters to be quiet.", "A Google keyword search found an excerpt of the misleading Facebook post published here on YouTube on December 19, 2015 bearing the logo of Pakistani news channel Samaa TV.", "Below are three screenshot comparisons of the YouTube video (L) and the video in the misleading posts (R):", "This report published on June 8, 2015 on the Samaa TV website shows a screenshot of the same video. The headline states: “Video: ‘Angry’ Imran asks supporters to shut up.\"", "A longer clip of the press conference was also published here on Imran Khan’s official Facebook page on the same day. The video is embedded below.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]