["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Several websites continue to insist without a shred of evidence that Democrats in the U.S. House have attempted to enact Sharia law, the religious guidelines of Islam.", "\"THIS IS TREASON!!\" exclaimed one headline we saw on Dec. 12, 2016. \"House DEMOCRATS STRIKE To IMPLEMENT SHARIA LAW!!\"", "A Dec. 12 Facebook post linked to an undated story that referred to a third outlet going back to December 2015.", "First of all, there was no strike, either as a work stoppage or an attack. The citations refer to the Dec. 17, 2015, introduction of HR 569, which sought to support Muslim-Americans and denounce hate crimes and persecution. One story we found online said the resolution \"threatens to restrict our right to even report facts that tarnish Islam’s reputation, a law that all Sharia-governed countries already have in place.\"", "Sharia law is a wide-ranging set of rules that govern aspects of Islamic life, including religious practice, daily living, crime and financial dealings, but Muslims differ on its interpretation. PolitiFact has checked a string of complaints about efforts to institute Sharia law (or aspects of it) in the United States — most recently by retired Army Lt. Gen. Michael Flynn, the potential future national security adviser of President-elect Donald Trump.", "But the resolution, introduced by U.S. Rep. Donald Beyer of Virginia, did not seek to institute Sharia law, or any law, for that matter. The resolution was non-binding, meaning it did not have the effect of law, and was introduced to address an upswing in anti-Muslim sentiment. HR 569 has 145 co-sponsors, all of whom are Democrats.", "Some online stories distorted what the bill would do by saying it \"will serve as a test by which further criminalizing of ‘Islamophobia’ may be introduced\" and single out only Muslims as worthy of special protection. Some websites said the resolution would equate hate speech with violence, and that would potentially alter constitutional rights.", "But HR 569 \"declares that the civil rights and civil liberties of all United States citizens, including Muslims in the United States, should be protected and preserved.\" The resolution denounces \"the increase of hate speech, intimidation, violence, vandalism, arson, and other hate crimes targeted against mosques, Muslims, or those perceived to be Muslim.\" It also \"steadfastly confirms its dedication to the rights and dignity of all its citizens of all faiths, beliefs, and cultures.\"", "There’s no threat of new legal reprisal for intolerance against Muslims, only that Congress would officially disapprove of such behavior. The aim was for Congress to show support for \"the inalienable right of every citizen to live without fear and intimidation, and to practice their freedom of faith.\"", "The resolution was referred to committee. With no Republican co-sponsors in the GOP-controlled House, it likely will not see any further action.", "Our ruling", "Bloggers said, \"House Democrats strike to implement Sharia law!!\"", "There was no kind of strike. Instead, the stories referred to a non-binding resolution introduced in December 2015 that sought to affirm congressional support for Muslim-Americans facing hate crimes and persecution. It did not have the effect of law or mention Sharia law, but rather aimed to send a message that anti-Muslim sentiment would not be tolerated by members of the U.S. House. The resolution has not received any Republican support and is likely dead.", "Wanting Congress to officially condemn hate speech and persecution is not the same as seeking to institute Sharia law. We rate this claim Pants On Fire!", "Hillary For Prison, Facebook post, Dec. 12, 2016", "MadWorldNews.com, \"House Dems Moved To Implement First Sharia Law While You Weren’t Looking,\" Dec. 30, 2015", "PolitiFact Florida, \"Trump security adviser pick Michael Flynn repeated wildly wrong claim about FL Democrats, Sharia law,\" Nov. 22, 2016", "President45DonaldTrump.com, \"THIS IS TREASON!! House DEMOCRATS STRIKE To IMPLEMENT SHARIA LAW!!,\" accessed Dec. 13, 2016", "Congress.gov, HR 569, accessed Dec. 13, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]