["Donald Trump tried to demonstrate his proficiency in foreign policy March 21 during a speech at the 2016 American Israel Public Affairs Committee conference in Washington. One focus of his talk involved condemning the Iran nuclear deal, saying it was a pact that gives \"the world’s leading state sponsor of terror\" $150 billion while the United States gets \"absolutely nothing in return.\"", "\"I’ve studied this issue in great detail — I would say actually greater by far than anybody else,\" Trump said. When the audience voiced skepticism he said, \"Believe me. Oh, believe me.\"", "\"The deal doesn’t even require Iran to dismantle its military nuclear capability,\" he said. \"Yes, it places limits on its military nuclear program for only a certain number of years. But when those restrictions expire, Iran will have an industrial-size military nuclear capability ready to go, and with zero provision for delay no matter how bad Iran's behavior is. Terrible, terrible situation that we are all placed in, especially Israel.\"", "Iran had not built a nuclear weapon at the time the deal was struck, so we wondered if Trump was correct in saying, \"when those restrictions expire, Iran will have an industrial-size military nuclear capability ready to go.\"", "We emailed the Trump campaign looking for details, but didn't hear back.", "So we contacted other people who have also looked at the deal.", "It is correct that after 15 years, the limitations that prohibit Iran from enriching enough uranium to create a bomb will expire. We'll get into that in a moment.", "But to say that, at the 15-year mark, Iran will have a ready-to-go military nuclear capacity ignores the reality of creating that capability and \"simply ignores the other limitations and monitoring provisions that will extend well beyond the 15-year mark of the agreement,\" said Daryl Kimball, executive director of the nonpartisan Arms Control Association, which supports the deal.", "Various parts of the agreement expire at different times, as the following chart from the association shows.", "Yet some portions don't expire at all, such as the provision prohibiting Iran from conducting activities which could contribute to the design and development of a nuclear explosive. As long as it follows that part of the pact, it will never have nuclear weapons.", "But critics are focusing on elements of the deal that do expire. For example, the limit on the number of high-tech centrifuges needed to concentrate enough uranium to make a bomb goes away in 10 years. The requirements that uranium-235 be at a concentration no greater than 3.67 percent and that Iran have no more than 300 kilograms of low-enriched uranium expire after 15 years. The concern is that, at that point, Iran would restart its nuclear weapons program.", "However, there would be nothing \"ready to go\" about their bomb or the delivery system needed to use it.", "At the time of the deal, the worst-case scenario was that Iran was two or three months from developing any type of nuclear bomb.", "Installing more and more sophisticated centrifuges \"would take at least several months,\" according to Matthew Kroenig of Georgetown University and a foreign policy adviser to the 2012 Mitt Romney presidential campaign. He said it's true that once the enrichment limit is gone, that could set the stage for a nuclear weapon.", "\"It is hard to know how long this would take because Iran never came clean on its past weaponization work, and we don't know how much progress they might be able to make covertly over the next 15 years. But again, several months is a reasonable assumption,\" he said.", "\"Next, it would need to marry the warhead to its ballistic missiles, but given its experience in mounting conventional warheads on its already sizable ballistic missile stockpile, this should be a relatively routine matter, said Kroenig. \"So, in sum, after the limits expire, it would likely still take Iran between several months and a year or so to have an actual deliverable nuclear weapon. But, the expansion of the enrichment program to ‘industrial size’ would be allowed at that point.\"", "\"To build an arsenal of nuclear weapons, it would take several years,\" Kroenig said.", "\"Iran will not have an industrial-sized nuclear capability, military or otherwise, when the deal ends at 10 to 15 years,\" said Richard Nephew of Columbia University's School of International and Public Affairs. The country had about 18,000 IR-1 centrifuges, most of which are dismantled and stored as part of the deal. As existing machines wear out, the stored ones can be brought out of mothballs to replace them. Iran would need about 50,000 to make fuel just for its nuclear power plant.", "\"They won't go from 18,000 stored/operating centrifuges at year 10 to 15 to 50,000 over a weekend,\" he said.", "Kroenig said that if the intent is there, \"Iran can build as large and sophisticated an enrichment program as it would like, consistent with the terms of the deal. At that point there is very little other states could do to stop it from building nuclear weapons if it decides to do so.\"", "But other experts we consulted said that's unlikely for a host of reasons.", "\"U.S. intelligence concluded in 2007 that Iran had halted its nuclear weapons program in 2003-04,\" and there is no indication the program was restarted, Nephew said.", "Then there are the permanent inspection requirements.", "\"While Iran will be allowed to gradually expand its peaceful, civilian, non-military nuclear program after year 10, it must remain exactly that — a peaceful, civilian, non-military nuclear program,\" State Department spokesman Sem Werberg said in an email. \"If at any point in time — before 10 years, after 10 years, or at any point in the future — there is any evidence that Iran is 'militarizing' its nuclear program in any way, then it would be in violation of the deal AND its international commitments.\"", "However, what the world would or could do about it at that point is a matter for debate.", "\"Assuming that the Iranians are not cheating, then they couldn't have a 'military nuclear capability' ready to go ever,\" Nephew contended. \"In fact, provisions of the deal would preclude such a capability forever.\"", "If Iran does decide to change course, supporters of the deal suspect that inspection and surveillance provisions of the deal will give other countries plenty of warning.", "\"We will continue to have exquisite knowledge of how much uranium they have for 25 years because inspection of their mines and mills, will continue for 25 years. We will also know for 20 years how many centrifuge machines they will be producing where,\" said Kimball. \"To say there will be a military nuclear capability ready to go simply ignores the other limitations and monitoring provisions that will extend well beyond the 15-year mark of the agreement.\"", "\"If Mr. Trump had studied the deal more than anyone else,\" Kimball continued, \"these facts would be apparent to him.\"", "Our ruling", "Trump said, \"When those restrictions expire, Iran will have an industrial-size military nuclear capability ready to go.\"", "Key restrictions in the deal never expire, including the pledge to not conduct activities that would contribute to the design and development of a nuclear explosive.", "And even if Iran were to go all-out for a nuclear program once the 15-year limit on uranium enrichment goes away, it would take months, if not years, for the country to develop a bomb and delivery system so its military could go to war with nuclear weaponry.", "We rate the claim as False.", "C-SPAN, \"Donald Trump - AIPAC Donald Trump AIPAC Speech,\" March 21, 2016", "PolitiFact, \"PolitiFact Sheet: 6 things to know about the Iran nuclear deal,\" Sept. 8, 2015", "New York Times, ‘Plutonium Is Unsung Concession in Iran Nuclear Deal,’ Sept. 7, 2015", "Interview, Daryl Kimball, executive director, Arms Control Association, March 23, 2016", "Arms Control Association, \"Section 3: Understanding the JCPOA,\" Aug. 10, 2015, accessed March 22, 2016", "Emails, Matthew Kroenig, associate professor, Department of Government and School of Foreign Service, Georgetown University, March 23, 2016", "Email, Richard Nephew, adjunct professor and program director and fellow, Center on Global Energy Policy, School of International and Public Affairs, Columbia University, March 22, 2016", "Email, Sam Werberg, press & public diplomacy officer, Office of Iranian Affairs, U.S. Department of State, March 23, 2016", "U.S. Department of State, \"The Case for the Nuclear Deal with Iran,\" July 22, 2015, accessed March 23, 2016", "The Brookings Institution, \"Based on breakout timelines, the world is better off with the Iran nuclear deal than without it,\" July 17, 2015, accessed March 23, 2016", "PolitiFact, \"PolitiFact Sheet: 6 things to know about the Iran nuclear deal,\" Sept. 8, 2015 and \"John Kerry says Iran nuclear agreement 'never sunsets. There's no sunset in this agreement,'\" Sept. 3, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]