["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "One of the hottest and most divisive topics in Illinois politics for the last 18 months has been workers’ compensation reform. Gov. Bruce Rauner and business groups say the state’s workers’ compensation system is unfairly biased against employers and has led, in the most recent national report, to Illinois having the eighth highest workers’ compensation insurance rates in the nation.", "Two dominant themes have emerged in the workers’ compensation debate. One is that Indiana has been a magnet for Illinois business relocations because it has very low workers’ compensation insurance rates.", "The other is that Illinois has high rates because of the state’s \"no-fault\" workers’ compensation system. Any injury \"arising out of and in the course of employment\" is compensable with workers’ compensation benefits, including medical care and paid time off for recovery. In legal terms, Illinois has no-fault standard of \"causation.\" Thus, a pre-existing condition that is aggravated in the course of work is covered under workers’ compensation.", "Given all this, a statement made during an Illinois House committee hearing on a workers’ compensation reform bill might have struck an odd chord.", "\"The causation standard in Indiana is exactly the same as it is in Illinois,\" said David Menchetti, a labor attorney with the Chicago firm Cullen Haskins Nicholson Menchetti. Menchetti testified at the hearing in opposition to the bill, which would change Illinois’ causation standard to the one described in Rauner’s reform agenda.", "If Indiana is attracting businesses away from Illinois because of its low workers’ compensation insurance premiums, and if Illinois’ no-fault causation standard is the cause of its high insurance rates, could Indiana really have the same legal standard as Illinois? We decided to check.", "Turnaround", "Rauner’s Turnaround Agenda contains a section devoted solely to enhancing the state’s causation standard, and he has spoken extensively about the need to switch to a standard in which workers’ compensation benefits aren’t granted unless the workplace is \"more than 50 percent responsible for the injury compared to all other causes.\"", "He’s also been vocal about Illinois losing jobs and businesses to Indiana because of, among other things, Illinois’ high workers’ compensation insurance premiums.", "\"We should be kickin’ tails, and look what’s happening to us,\" Rauner said in a speech in August at the Illinois State Fair. \"Our jobs are going to Indiana. Come on. They’re going to Indiana. They ain’t going there for the weather.\"", "Rauner is not the first to invoke the state’s causation standard as problematic for businesses.", "In a 2012 brief, Attorney General Lisa Madigan wrote, \"To protect taxpayer dollars, the legislature must address and change the causation standard that is currently applied by the IWCC and the courts.\" The attorney general’s office, however, has never advocated for a specific standard and has not issued an official opinion on Rauner’s proposal.", "\"From our perspective, there ought to be reasonable ways to change the standard that would not damage the purpose of workers’ compensation to ensure that employees who are injured on the job can fully recover,\" Madigan’s chief of staff, Anne Spillane, told Politifact Illinois in September.", "The codes", "The Illinois Workers’ Compensation Act invokes the term \"arising from and in the course of\" employment seven times in defining injuries subject to workers’ compensation. Likewise, the Indiana Workers’ Compensation code (ICC 22-3-6-1-[e]) defines \"injury by accident arising out of and in the course of the employment\" as compensable under the state’s workers’ compensation system.", "By contrast, Florida -- whose causation standard Rauner wants to replicate in Illinois -- adds a conditional clause in its code: \"If an injury arising out of and in the course of employment combines with a preexisting disease or condition to cause or prolong disability or need for treatment, the employer must pay compensation or benefits required by this chapter only to the extent that the injury arising out of and in the course of employment is and remains more than 50 percent responsible for the injury as compared to all other causes combined and thereafter remains the major contributing cause of the disability or need for treatment. Major contributing cause must be demonstrated by medical evidence only.\" (440.09 [b])", "But if Indiana and Illinois have identical causation standards in their workers’ compensation statutes, why are Indiana’s insurance premiums so much cheaper than those paid by businesses in Illinois?", "Menchetti cites two primary reasons. One is that Indiana pays significantly lower workers’ compensation benefits. The other, he says, is that employers in Indiana, not injured employees, have first choice in medical treatment.", "A national compilation of workers’ compensation laws by the Workers’ Compensation Research Institute confirms that the initial choice of treating physician in Indiana lies with the employer, while in Illinois the choice is the employee. A 2015 report by nonprofit, investigative journalism website ProPublica shows that, on benefits for permanent partial disability, Illinois consistently paid more than the national average while Indiana generally was close to average. (Compensation for loss of an arm in Illinois, for example, is $439,858. The national average is $169,878, and Indiana pays $202,050.)", "More than just causation", "While the statutes in Indiana and Illinois may use the same definition for causation, how the law is interpreted and applied makes the difference on cost, says Michael Lucci, who has studied workers’ compensation and written extensively about it for the libertarian Illinois Policy Institute, which favors Rauner’s reform agenda.", "\"I think the difference you’ll find is largely subject to judicial interpretation and arbitration rulings,\" Lucci says. \"Causation is a difficult issue. We haven’t engaged particularly hard on this issue.\"", "In a recent analysis, Lucci offered a seven-point plan for reducing Illinois’ workers’ compensation insurance premiums. Changing the causation standard was not among them. The difference between eighth-most-expensive Illinois and second-least-expensive Indiana for workers’ compensation insurance, Lucci says, can’t be bridged by changing the causation wording alone.", "\"Their arbitrators have a narrower view of what constitutes a workplace injury,\" Lucci says.", "Our ruling", "Attorney David Menchetti testified before the Illinois House Labor and Commerce Committee that, \"The causation standard in Indiana is exactly the same as it is in Illinois.\"", "State workers’ compensation statutes in both states confirm that Indiana and Illinois both are \"no-fault\" states in which an injury need only happen in the workplace to be covered by workers’ compensation. Both define qualifying injuries as those as those arising from employment with no other conditions.", "As noted in statements from Menchetti and Lucci -- who are on opposite sides of the larger workers’ compensation reform issue -- the causation standard’s effect on workers’ compensation insurance rates is open to debate. The standard itself in Illinois and Indiana statutes is not.", "We rate this statement True.", "Illinois House Labor and Commerce Committee hearing, Nov. 28, 2016 (relevant testimony beginning 1:13:00)", "Florida Workers’ Compensation Act, 440-09, accessed Dec. 7, 2016", "Indiana Workers’ Compensation code, IC 22-3-6-1 (e), accessed Nov. 30, 2016", "Interview and e-mail exchange, David Menchetti, Cullen Haskins Nicholson Menchetti, Nov. 28, 2016; Dec. 6-7, 2016", "The Illinois Turnaround, document defining Gov. Bruce Rauner’s reform agenda, page 4, accessed Dec. 7, 2016", "Telephone interview, Christopher Hurley, President, Illinois Trial Lawyers Association, Dec. 7, 2016", "2016 Oregon Workers’ Compensation Premium Rate Ranking Summary, Oregon Department of Consumer and Business Services, accessed Nov. 28-Dec. 9.", "Workers’ Comp Benefits: How much is a Limb Worth, report by ProPublica, March 5, 2015; accessed Nov. 30, Dec. 12, 2016", "Interview with David Menchetti, in person, Nov. 28, 2016; email, Dec. 7, 2016", "Telephone interview, Michael Lucci, Illinois Policy Institute, Dec. 8, 2016", "\"Background on Workers’ Compensation Claims Filed by State Employees and Reforms Proposed by the Office of the Attorney General,\" opinion, Illinois Attorney General, March 2012, accessed Dec. 12, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]