["As Donald Trump amps up attacks on the Clinton Foundation, Democrats are pointing out that Trump himself has given to the nonprofit he now calls a pay-to-play operation.", "Recently released emails between Hillary Clinton’s aides when she was secretary of state and officials at the Clinton Foundation have demonstrated that some foundation donors did get access to Clinton, though there’s no evidence of direct favors.", "Addressing the topic on NBC’s Meet the Press, Barack Obama’s former campaign manager David Plouffe noted the Clinton Foundation’s work on HIV/AIDS and malaria and Trump’s own ties to the charity.", "\"The Clinton Foundation, I think it’s a universal agreement, has done remarkable work around the world. I think Donald Trump himself contributed $100,000 to the foundation,\" he said.", "Plouffe is right that Trump gave at least $100,000 to the foundation, a fact that Trump and his campaign readily admit. One caveat: It appears that the money came through Trump’s own foundation, not directly from Trump.", "The Clinton Foundation lists Donald J. Trump as a contributor with a cumulative lifetime donation amount between $100,001 to $250,000. It’s not clear if Trump himself made a personal contribution, but tax forms show that the Donald J. Trump Foundation (which Trump controls) donated $100,000 to the foundation in 2009 and reserved a table at the Clinton Foundation gala for $10,000 in 2010.", "Trump’s daughter Ivanka is also listed as a donor who gave between $5,001 and $10,000 and her father-in-law, Charles Kushner, gave between $250,001 and $500,000.", "Trump’s gift amount places him in the top 0.2 percent of the foundation’s donors. Most of its 300,000 donors (85.5 percent) gave less than $250.", "Breaking it down by dollar amount, however, Trump’s total contribution isn’t that big. We estimated that the foundation has received at least $800 million in donations, over 70 percent of which came from gifts of $1 million or more.", "In 2009, the Trump Foundation gave $926,750 to some 40 organizations (page 18). The Clinton Foundation received one of the largest gifts that year, matched or surpassed only by the Arnold Palmer Medical Center Foundation ($100,000), the New York Presbyterian Hospital ($125,000) and the Police Athletic League ($156,000).", "Altogether, the Trump Foundation has donated $5.5 million to 298 charities between 2009 and 2013 according to the nonprofit’s tax forms, Forbes found. Trump did not make any personal contributions to his foundations during this time. (Money for the Trump Foundation in these years came from others and from investment income.)", "Trump doesn’t deny that he donated to the Clinton Foundation that he now calls a criminal enterprise.", "During the first GOP primary debate in August 2015, Trump voluntarily brought up his giving to the Clinton Foundation when asked about his previous donations to Hillary Clinton.", "\"When they call, I give. And you know what? When I need something from them two years later, three years later, I call them, they are there for me,\" Trump said. \"With Hillary Clinton, I said be at my wedding, and she came to my wedding. You know why? She didn’t have a choice, because I gave. I gave to a foundation that, frankly, that foundation is supposed to do good. I didn’t know her money would be used on private jets going all over the world.\"", "For the record, the Clintons did attend Trump’s third wedding to Melania Knauss, but that occurred in 2005, four years before the $100,000 donation.", "A few months later, Trump gave pretty similar answers when he was asked to explain the Forbes article on his charitable giving record in late January.", "\"I did give to the Clinton Foundation. What I didn't know is they'd be using it for private aircraft and things like that. The Clinton Foundation was helping with Haiti and with lots of other things and I thought it was going to do some good work. So, it didn't make any difference to me,\" he said on Jan. 31’s Fox News Sunday. \"Again, I was a businessman and it was my obligation to get along with everybody, including the Clintons, including Democrats and liberals and Republicans and conservatives.\"", "Our ruling", "Plouffe said, \"Donald Trump himself gave $100,000 to the Clinton Foundation.\"", "Tax records show the Donald J. Trump Foundation gave $100,000 to the Clinton Foundation in 2009, and spent an additional $10,000 for a table at a Clinton Foundation gala the following year. The Clinton Foundation also lists Donald J. Trump (as well his daughter Ivanka and Ivanka’s father-in-law) as a contributor.", "It’s important to note that Trump made the donation through his foundation, not out of his personal income. But Trump himself acknowledges the donation. We rate Plouffe’s statement Mostly True.", "https://www.sharethefacts.co/share/552526f7-e5b8-4ccb-9206-517f0a5819f7", "NBC, \"Meet the Press,\" Aug. 28, 2016", "Clinton Foundation, Contributors, accessed Aug. 28, 2016", "Donald J. Trump Foundation, Form 990-PF, 2009", "Washington Post, \"What we know about the charitable giving by Hillary Clinton and Donald Trump,\" Aug. 25, 2016", "Forbes, \"When It Comes to Veterans, Donald Trump's Rhetoric Is Much More Generous Than His Giving Record,\" Dec. 3, 2016", "CNN, \"Campaign manager: Trump's donation to Clinton Foundation not 'pay to play',\" Aug. 24, 2016", "PolitiFact, \"Ted Cruz says Donald Trump wrote 10 checks to Hillary Clinton campaigns,\" March 4, 2016", "TIME, \"Transcript: Read the Full Text of the Primetime Republican Debate,\" Aug. 6, 2015", "PolitiFact, \"The Clintons really did attend Donald Trump's 2005 wedding,\" July 21, 2015", "Fox News, Fox News Sunday, Jan. 31, 2016", "Email interview with Josh Schwerin, Hillary Clinton spokesman, Aug. 28, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]