["About this rating", "On 17 November 2018, the Facebook page \"This Is Some Gaston County Shit Right Here\" posted a couple of photographs supposedly showing \"Gaston County resident\" Jasper Smith after he was arrested for selling energy drinks laced with methamphetamine:", "Gaston County resident, Jasper Smith, 62, was arrested yesterday on felony charges of manufacturing and distributing homemade “energy drinks” containing the powerful stimulate methamphetamine. The Gaston County drug task force raided Smith’s tree fort (Smith lives in 200 sq. ft. tree fort on his brother’s property near Chapel Grove) to find Jasper wearing only an adult diaper and reading a Mexican pornographic magazine.", "This was not a genuine news story, nor even a particularly original piece of junk news. The article about Jasper Smith was lifted near verbatim ripoff from a fake news article published by the entertainment website \"Stuppid\" back in January 2015. The \"This Is Some Gaston County Shit Right Here\" Facebook page simply replaced a few minor details in order to create a \"new\" version of the years-old story.", "For instance, the suspect's named was changed from Jasper June to Jasper Smith, his age decreased from 72 to 66, his location moved from Boone County to Gaston County, and his choice of favorite pornographic magazine morphed from Arabic to Mexican. The biggest alteration, however, was the mugshot that was used to illustrate the story.", "Here's the first paragraph of the Stuppidarticle as well as itd featured photographs:", "Boone County resident, Jasper June, 72, was arrested today on felony charges of manufacturing and distributing homemade “energy drinks” containing the powerful stimulate methamphetamine. The Boone County drug task force raided June’s tree fort (June lives in 200 sq. ft. tree fort on his brother’s property) to find Jasper wearing only an adult diaper and reading an Arabic pornographic magazine.", "Stuppid is a junk news site that has previously published misinformation about a couple getting arrested for selling tickets to heaven, a human-chimpanzee hybrid, a man in Florida marrying  a baby, and a death row inmate requesting a kitten for his last meal.", "The original jape from Stuppid featured a mugshot of Delbert Huber, an octogenarian who was jailed in 2011 for killing a teacher. We have not been able to identify the man in the other mugshot, but Gaston County Police Capt. C.J. Rosselle told the Charlotte Observer that the story was \"just plain fake.\"", "Price, Mark.   \"An Energy Drink Made of Meth, Lemonade and Gas? It’s Fake, Say Gaston County Police.\"\r\n    Charlotte Observer.   3 December 2018.", "Stuppid.   \"Man Busted Selling “Energy Drinks” Containing Meth.\"\r\n    25 January 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]