["The image is contained in this Facebook post, which was published on June 6, 2019, and has been shared more than 650 times.", "It shows US President Donald Trump holding up a photo of Filipino politician Ferdinand “Bongbong” Marcos Jr.", "Here is Bongbong’s profile on the website of the Senate of the Philippines. He is the son of late dictator Ferdinand Marcos, who led the Philippines for two decades until he was toppled in a 1986 “People Power” revolution. Here is more information about the revolution on a Philippine government website.", "Next to Bongbong’s photo is a white page with the words “The Next President” and Trump’s signature.", "Below is a screenshot of the misleading Facebook post:", "The post’s caption states: “100 % MR. PRESIDENT TRUMP...THAT BBM WILL BE THE NEXT PRESIDENT OF THE PHILIPPINE’S REPUBLIC”.", "“BBM” is a shorthand reference to “Bongbong” Marcos Jr.", "The same image and caption were also shared elsewhere on Facebook, for example here, here and here with a similar claim.", "The claim is false; the image has been doctored from a photo which shows Trump holding an executive order.", "A reverse image search on Google found the original photo published in this Forbes magazine article, dated January 24, 2017, about Trump withdrawing the US from the Trans-Pacific Partnership trade pact.", "Below is a screenshot of the report:", "The caption credited the photo to AFP. A keyword search of AFP’s archives found this image taken on January 23, 2017.", "The AFP photo caption states: “United States President Donald Trump signs the Executive Order withdrawing the US from the Trans-Pacific Partnership (TPP) after signing it in the Oval Office of the White House in Washington, DC on Monday, January 23, 2017.", "“The other two Executive Orders concerned a US Government hiring freeze for all departments but the military and ‘Mexico City’ which bans federal funding of abortions overseas”.", "Below is a screenshot comparison of the photo in the misleading posts (L) and the AFP photo (R):", "Bongbong ran for vice president in 2016 and lost, as reported here by AFP at the time. He protested the result, prompting a recount that is ongoing; here is a Philippine government information page about the recount, published January 22, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]