["A set of Ramayana stamps is circulating on social media with the claim that Prime Minister Modi recently release them. Twitter user @Kavita_M57 shared the viral image and wrote, “New stamps released by the PM today. Jai Shri Ram.” This was retweeted over 1,000 times. (archived link)", "The image is circulating as the Ram Mandir Bhumi Pujan day draws near. “The construction of the temple will begin after the laying of the foundation stone at Ram Janmabhoomi, most likely by Prime Minister Narendra Modi on August 5,” according to Hindustan Times.", "Other Twitter users who posted the viral image include @Vaidyvoice (archived link) and @smitadeshmukh (archived link). Their tweets were retweeted over 400 times each. Similarly, several Facebook users also shared the viral image.", "Alt News performed a keyword search on Google and found that the official government website of Postage Stamps carries the same image of 11-set stamps.", "According to the website, “India Post issued a set of 11 commemorative postage stamps on “RAMAYANA” on 22.09.2017- 10 stamps are of denominations Rs 5 and 1 stamp is of denomination Rs 15″.", "On September 22 2017, NDTV reported that Prime Minister Narendra Modi released postage stamps depicting different aspects of Hindu deity Ram’s life at Tulsi Manas Mandir in Varanasi, Uttar Pradesh. BJP had also tweeted about this ceremony.", "PM Shri @narendramodi releases postal stamp on Ramayana. Watch LIVE at https://t.co/vhJf66MKAm #ModiInVaranasi pic.twitter.com/vKBSnVOzEn", "— BJP (@BJP4India) September 22, 2017", "Thus the social media claim Prime Minister Modi recently released Ramayana stamps is false. They were released three years ago.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]