["By Lori Robertson", "Posted on May 10, 2019", "In a May 8 rally in Florida, President Donald Trump falsely claimed that Democrats “are trying to stop” disaster relief aid from going to several states. This is an old political trick of claiming the other party doesn’t support something, when actually both parties support it but have pushed different versions of the legislation.", "Case in point: Two days after his remarks at the rally, Trump encouraged House Republicans to vote against a Democratic bill to provide disaster relief aid to Florida and several other states. Thirty-four Republicans joined 223 Democrats in voting in favor of it, and the bill passed. It now goes to the Senate.", "The president told the crowd in Panama City Beach, Florida, which was hit by Hurricane Michael in October 2018, not to “worry” about the relief funding, claiming Democrats were to blame for the delay in getting an appropriations bill passed.", "Trump, May 8: I want to thank FEMA for what they did there, for what they did in Florida, Texas. You look at Louisiana, look at South Carolina, they got hit hard. North Carolina got a piece of it, Georgia, Alabama. These are great places. And they’re all getting aid. But the Democrats are trying to stop it. But you’re going to get it. Don’t worry.", "But the House passed a Democratic-sponsored $14.2 billion disaster relief funding bill in January. The 237-187 vote was along party lines, with just six Republicans voting in favor of it. The legislation then stalled in the Senate in early April. At the time, Trump told Republican lawmakers in a closed-door meeting that he opposed additional aid to Puerto Rico. According to the Associated Press, Sen. Marco Rubio said Trump told Republicans on March 26 that aid for the island “is way out of proportion to what Texas and Florida and others have gotten.”", "Senate Republicans tried to advance a bill for $13.5 billion for natural disaster recovery, including $600 million for nutrition assistance in Puerto Rico and funding for flood damage in Midwestern states. Democrats pushed a measure that included more funding for Puerto Rico, and each party blocked the other’s measure.", "But the day before Trump spoke in Florida, Republican Sen. Richard Shelby told reporters that Vice President Mike Pence had indicated to Senate Republicans that the administration was now OK with the additional funding for Puerto Rico. Shelby said that Pence “said the president, the administration, wanted us to work this out and told me and the leader they were on board now.”", "Senate Majority Leader Mitch McConnell also said “we’re open to discussing additional [funding] — we need to get this done.”", "On May 9, a day before the House was set to consider a new Democratic bill, which totals $17.2 billion and includes funding for Midwest states affected by flooding, Trump told Republicans to vote against it.", "House Republicans should not vote for the BAD DEMOCRAT Disaster Supplemental Bill which hurts our States, Farmers & Border Security. Up for vote tomorrow. We want to do much better than this. All sides keep working and send a good BILL for immediate signing!", "— Donald J. Trump (@realDonaldTrump) May 9, 2019", "This time, 34 Republicans joined the House Democrats in approving the bill, by a 257-150 vote, on May 10. The legislation now goes to the Senate.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]