["A video of a person kicking the food kept on a table while another man yells at a woman standing in front of them is doing the rounds on social media. On May 21, Twitter user Srikanth posted the video and said, “Shiraj Ahmed & Bhujouli Kurd refusing to eat food cooked by a Dalit women at a quarantine center. He kicked the food !!”. The video has been retweeted more than 1,800 times and viewed close to 5 lakh times.", "cccccc refusing to eat food cooked by a Dalit women at a quarantine center.", "He kicked the food !!…", "….. pic.twitter.com/0AUuOk3hyh", "— Srikanth (@srikanthbjp_) May 21, 2020", "Another Twitter handle ‘Meritdhaari’s Against Equality’ posted the video on May 20 and said that ‘meritorious’ people are refusing to eat food cooked by a Dalit woman. Here the word ‘meritorious’ is used for upper-caste Hindus. The video has been retweeted more than 5,000 times and viewed over 4 lakh times.", "Merit Dhari refusing to eat food cooked by a Dalit women at a quarantine center. What arrogance….. pic.twitter.com/UnETG9g9KB", "— Alex Ambedkar (@ganikapudi_) May 20, 2020", "On May 21, Facebook user Sandeep Sai posted the video with the same claim. It has been shared more than 1,100 times so far.", "At a quarantine centre Shiraj Ahmed & Bhujouli refused eat & kicked the food because it was cooked by a Dalit women.", "Posted by Sandeep Sai on Thursday, 21 May 2020", "A Google search with keywords – ‘कोरोना खाना लात मारी’ (Corona food kicked -translated) – led us to a May 18 report by Dainik Jagran. The report stated that a migrant labourer kicked the food and mistreated the woman who had prepared it at quarantine centre set up in a school in Madhwapur block of Bihar’s Madhubani district. However, the report did not talk about the woman hailing from the Dalit community. It said that the staff members had asked migrant labourers to follow social distancing while having their food. This angered a few causing them to misbehave.", "The video attached in the report is the same video viral on social media with the claim that two Muslim men kicked the food cooked by Dalit women. The video is from Bihar and is related to the incident from Madhwapur block. The name of the school – ‘राजकीयकृत मध्य विद्यालय मधवापुर’ (State-run middle school Madhwapur) – seen in the video confirms the same.", "Alt News reached out Saharghat police and spoke to SHO Surendra Paswan. He said that there is no Dalit-Muslim angle to the incident. The people who were quarantined were asked to follow social distancing norms. Hence, the food was cooked and kept at a place from where they were supposed self-serve but some of them requested that they are (normally) served the food while they sit to eat. When they were denied the same, they got furious and started hurling abuses. An FIR has been lodged against three people namely, Pankaj Kumar Rai, Manoj Rai and Ashok Shah.", "The viral claim, however, names two Muslim men – Shiraj Ahmed and Bhujouli Kurd – who threw food cooked by a Dalit woman. This is a separate incident which has been falsely associated with the one that took place in Bihar. But the incident didn’t involve two Muslim men but one Siraj Ahmad who is a resident of Bhujouli Khurd village in Uttar Pradesh’s Kushinagar district. Thus, Bhujoli Khurd is not the name of a person as claimed on social media but a village. In several parts of India, an area of a village is broadly divided into two halves. The bigger one is called ‘Kalan’ whereas the smaller one is called ‘Khurd’.", "“A 35-year-old has been booked by the police for refusing to eat food at a quarantine centre on the ground that it was cooked by a Dalit.” reported Outlook on April 14, 2020. “The village head Lilawati Devi, who hails from the Dalit community, had prepared food at the quarantine centre in the absence of the [designated] cook but Siraj refused to eat it. A case has been registered against Siraj under the SC/ST Act and he has been arrested by the police,” the report adds.", "Therefore, several social media users shared the video of an incident from Bihar as that of an incident from Uttar Pradesh. These are two separate incidents. The incident from Bihar has no Dalit angle. In the incident from Uttar Pradesh, a Muslim man had refused to eat food that was cooked by a Dalit woman.", "Donate Now", "Ketan is Senior Editor at Alt News Hindi.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…"]