["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Vice President Mike Pence and his wife Karen visit victims of Hurricane Harvey in Rockport, Texas, on Aug. 31, 2017. (AP photo)", "Left-leaning bloggers used the aftermath of Hurricane Harvey to attack Vice President Mike Pence, saying he opposed relief for Hurricane Katrina while he was a congressman.", "Many partisans and political groups pointed to a speech Pence gave on the floor of the U.S. House of Representatives in 2005, implying that Pence was going to be unwilling to help Houston-area residents affected by Harvey.", "One such example we saw took exception to the floor speech by calling Pence out for citing the Bible: \"Here's Pence quoting Matthew 7:25 while urging Congress not to fund Katrina relief effort. Can't get any more phony,\" @adamcbest tweeted on Aug. 29, 2017.", "Here's Pence quoting Matthew 7:25 while urging Congress not to fund Katrina relief effort. Can't get any more phony. pic.twitter.com/wiEPkhlI1a", "The admonition, which had been retweeted more than 13,000 times as of this writing, featured a video of Pence posted on Twitter by Scott Dworkin, the cofounder of the Democratic Coalition. Dworkin also posted the video on DailyKos.com.", "Most critics tended to especially focus on Pence’s line, \"Congress must ensure that a catastrophe of nature does not become a catastrophe of debt for our children and grandchildren.\"", "Did Pence really cite the Bible while demanding that Congress not fund Katrina relief?", "Pence spoke in a one-minute speech on the House floor on Sept. 8, 2005, shortly after Katrina wreaked havoc on the Gulf Coast by making landfall near New Orleans on Aug. 29. The brevity of his remarks allows us to consider his statement in full:", "\"Mr. Speaker, Katrina breaks my heart. When I consider its tragic aftermath, the ancient parable comes to mind: ‘And the rains descended and the flood came and the winds blew and beat against the house and it fell with a great crash.’", "\"For most American families, when a tree falls on your house, you tend to the wounded, you rebuild, and then you figure out how you are going to pay for it. Later today Congress will continue the work of funding the relief and recovery from Hurricane Katrina, and well we should, by speeding more than $50 billion to FEMA and other agencies.", "\"But as we tend to the wounded, as we begin to rebuild, let us also do what every other American family would do, in like circumstances, and expects this Congress to do: let us figure out how we’re going to pay for it.", "\"Congress must ensure that a catastrophe of nature does not become a catastrophe of debt for our children and grandchildren.\"", "The parable to which he refers is a Bible verse, but it’s actually Matthew 7:27, not 7:25 as the tweet said. (The wording is very similar.) In context, the parable is about believing in the true God in the face of temptation or suffering, although here Pence is clearly playing off the idea of building on stable ground.", "While the tweet that’s been shared said Pence urged Congress not to approve Katrina aid, the video that accompanied the piece — and Pence’s full remarks — actually support the opposite conclusion. Pence did not oppose any aid for Katrina victims. He said in his remarks that Congress should pay for relief efforts.", "Pence joined the vast majority of lawmakers who voted later that same day in favor of a $51.8 billion relief package, which passed 410-11. The bill then passed the Senate 97-0 and was signed into law by President George W. Bush.", "What Pence was saying is that Congress should not go into debt to pay for the aid package, and find other solutions to offset costs.", "It’s no secret Pence is a fan of reducing government spending.", "As chairman of the Republican Study Group, a collection of very conservative legislators, Pence did propose cutting or delaying spending on some projects to offset the costs of rebuilding the Gulf Coast. Their plan was even called \"Operation Offset.\" Among the group’s targets were a prescription drug benefit for seniors and transportation projects.", "But even as Pence and other congressional Republicans looked to find cuts to curtail a budget deficit, he did not propose holding up Katrina relief. He continued his cost-cutting rhetoric a couple of weeks later, when he discussed cutting \"big-ticket items\" from the budget to deal with Katrina spending.", "Bloggers said a video showed Pence quoting the Bible as justification for \"Congress not to fund Katrina relief effort.\"", "They cited a short 2005 floor speech in which Pence said Katrina relief should pass, but then Congress should look to cut costs elsewhere. He did not hold the aid bill hostage, even while making cost-cutting a personal priority. (The tweet we’re citing also was a bit off about which particular Bible verse he used.)", "Critics are misrepresenting Pence’s comments, which are plain just from watching the video. We rate the statement Pants on Fire.", "Twitter, @adamcbest tweet, Aug. 29, 2017", "Twitter, @funder tweet, Aug. 29, 2017", "Congress.gov, Congressional Record: Funding to rebuild after Hurricane Katrina, Sept. 8, 2005", "U.S. House of Representatives, H R 3673 roll call vote, Sept. 8, 2005", "Associated Press, \"Bush signs $51.8 billion bill for hurricane relief,\" Sept. 8, 2005", "Washington Times, \"‘Operation Offset’ aims to cut transportation fat,\" Sept. 18, 2005", "CBS News, \"GOP Eyes Cuts To Offset Katrina,\" Sept. 19, 2005", "USA Today, \"On this day in 2005, Hurricane Katrina made landfall near New Orleans,\" Aug. 29, 2017", "KingJamesBibleOnline.org, \"Matthew 7:27,\" accessed Aug. 31, 2017", "BibleHub.com, \"Matthew 7: Ellicott's Commentary for English Readers,\" accessed Aug. 31, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]