["The one-minute, 30-second clip was published here on Facebook on October 9, 2019. It has been viewed more than 16,000 times and shared more than 430 times.", "The post's Indonesian-language caption translates to English as: “Foreign (French) media covering the remains of a burnt down mosque in Wamena, Mashallah.. the Koran remains intact not burned....", "\"GOD IS THE GREATEST.”", "Below is the screenshot of the misleading post:", "Wamena is a town in Indonesia’s Papua province that has experienced one of the worst clashes since violence broke out in the Papua region in August 2019. AFP reports on the unrest can be read here and here.", "“Mashallah” is an Arabic phrase which means this is what God wills. It is also used to express praise.", "The same video was also viewed thousands of times after it was published on Facebook here, here, here and here, with a similar claim.", "The claim is false; the video has previously circulated in reports about a collection of Korans which survived a fire at a Saudi Airlines office in Bangladesh in October 2019.", "A Google keyword search found this one-minute, 30-second video published on YouTube on October 7, 2019, which shows identical scenes as the clip in the misleading post.", "The YouTube video's Urdu-language title translates to English as: “Saudi Airlines office in Dhaka, Bangladesh, caught fire, but the Koran Majid,” suggesting that a copy of the Koran was safe although a fire engulfed the Saudi Airlines office.", "The video's English-language caption states: “That’s the Saudi airlines office at Dhaka yesterday. Amazing that all Quran are intact. Allahu Akbar.”", "A woman’s voice could be heard speaking in Bengali throughout the video. According to a journalist at AFP’s Dhaka bureau, she said:\n\t“The miracle thing is the Korans didn’t burn. See all the Korans are intact. Everything else is burnt, praise to Allah! See Nazir? Not a single Koran got burnt. Praise to Allah! Amazing huh! See all Korans are as they are! Even the packages are burnt but not the Koran! Did you see? I am feeling goosebumps!”", "Below is a comparison screenshot of the video in the misleading post (L) and the earlier YouTube video (R):", "The incident happened on October 1, 2019, as reported by the Dhaka Tribune here and United News of Bangladesh here on the same day.", "The Dhaka Tribune’s report is headlined: “Fire at Sonargaon hotel doused.”", "The report's first three paragraphs state: “Saudi Airlines office completely burnt, Pubali Bank branch damaged.", "“The fire, which broke out at the Pan Pacific Sonargaon Hotel in Dhaka, has been doused.", "“The fire broke out around 2:40 am on Tuesday.”", "Saudi Airlines' Dhaka office was located inside the Pan Pacific Sonargaon hotel according to its official website here.", "Photos showing the outside of the Saudi Airlines office in Dhaka tagged on Google Street View here and here correspond with the video in the misleading posts.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]