["About this rating", "An image purportedly showing multiple tornadoes touching down simultaneously in Minneola, Kansas, started recirculating on social media after it was posted to the \"Interesting as F*ck\" section of Reddit:", "This image does not capture the simultaneous appearance of eight tornadoes in a field in Kansas; rather, it's a composite photograph documenting the evolution of a single tornado.", "On 24 May 2016, a series of supercell storms produced more than a dozen different tornadoes across the state of Kansas that overturned semi-trucks and destroyed a number of homes:", "A series of supercells formed during the late afternoon into the early evening hours across portions of western Kansas producing 12 to 15 tornadoes.", "One supercell produced numerous cyclic tornadoes starting few miles north of Minneola with the last tornado dissipating about 6 miles south southwest of Jetmore. EF3 (Enhanced Fujita) damage was produced a few miles east of Ensign were a house was destroyed as well as around 6 miles north of Dodge City. Some notable damage with these tornadoes includes a house that was destroyed just east of Ensign, a semi overturned on US50, numerous homes along highway 50 just west of Dodge City were heavily damaged (at one home there were two injuries), a large propane tank was reported leaking at 14th and Denim and a building at the landfill north of Dodge City was destroyed.", "Other tornadoes occured in northwestern Hodgeman and southwestern Ness Counties. EF3 damage was also produced with these tornadoes. Some notable damage from these tornadoes were a home that was destroyed northwest of Jetmore, a stock trailer was blown nearly 3 miles, an oil take was blown over, many electric poles were damaged and destroyed, and a farmstead was destroyed in southwestern Ness County.", "A few other tornadoes formed across portions of Edwards county causing damage to two homes south of Lewis. One of these tornadoes eventually produced EF3 damage southeast of Lewis.", "Photographer and storm-chaser Jason Weingart was on hand to witness the scene and took multiple photographs of the storm. Although more than a dozen tornadoes touched down in Kansas on that day, the image seen here documents only the formation of a single twister.", "This viral photograph is available on Weingart's web site under the title \"Evolution.\" The caption accompanying the image states that it depicts the \"evolution of the first of several tornadoes in Ford County, Ks on May 24, 2016.\"", "Weingart also made this image available via Wikipedia where it is accompanied by a slightly more detailed caption:", "This image is created from eight images shot in sequence as a tornado formed north of Minneola, Kansas on May 24, 2016. This prolific supercell went on to produce at least 12 tornadoes and at times had two and even three tornadoes on the ground at once.", "The formation of this tornado can also be glimpsed in a video of the storm Weingart uploaded to YouTube:", "Erdman, Jon.   \"Dodge City, Kansas, Missed Tornado Disaster by Just Three Miles on Tuesday.\"\r\n    Weather.com.   25 May 2016.", "National Weather Service.   \"Severe Weather Hits Western/Central KS on 24 May 2016.\"\r\n    24 May 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]