["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As the candidate field for the 2016 election continues to grow, the line between Republicans and Democrats is drawn, altered and emphasized. The race toward the primaries and the White House is starting, and the two major parties are, as usual, the ones to watch.", "Or are they?", "On a segment of Meet the Press this past Sunday, moderator Chuck Todd brought up a third group that may be just as important as the two major parties in the upcoming election.", "\"The growing number of voters who don't affiliate with either major political party is reshaping our political system, perhaps more than you may realize,\" Todd said.", "Todd went on to describe how, according to a recent poll, a larger percentage of Americans identify as independent rather than as Democrat or Republican. Todd cited Florida as a specific example.", "\"The number of voters (in Florida) who now register as ‘other’ has grown by a million in the last 10 years,\" Todd said. \"Compare that with the Democrats, who only grew by 300,000 and the Republicans who grew by just 200,000.\"", "Has the number of independents really increased by a million? And what do those changes mean?", "Starting with 2014 as the most recent complete year, PunditFact looked at Florida voter data going back to 2004. We looked at last voter registration report before the November election.", "The chart below summarizes what we found.", "Registered Republican voters", "Registered Democrat voters", "No Party Affiliation", "2004", "3,892,492", "4,261,249", "1,886,013", "2014", "4,172,232", "4,628,178", "2,778,547", "10-year change", "279,740", "366,929", "892,534", "Percent increase", "7.19%", "8.61%", "47.32%", "The numbers are relatively close to what Todd said. (After hearing from Todd's staff, the differences mainly appear to be the result of rounding and whether or not you count minor parties such as the Reform Party, the Constitution Party and the Florida Socialist Workers Party, among others.)", "So the numbers are in the ballpark. Still, there are a few caveats to consider.", "No Party Affiliation is a catch-all", "Florida’s most recent voter registration form became effective in October 2013.", "In the Party Affiliation box, registrants are asked to choose whether they are affiliated with the Democratic Party, the Republican Party, a minor party, or no party at all. However, if left blank, registrants are automatically registered as having no party affiliation.", "PunditFact has asked the Florida Department of State how many people are registered with No Party Affiliation because they left the field blank. If we get an answer, we’ll update this item.", "No Party Affiliation doesn’t translate to no party", "In an article published in 2014 by Politics in Polk, Kevin Wagner, an associate professor of political science at Florida Atlantic University, warned about some additional nuances that are necessary to consider when talking about independent voters.", "\"We have leaners or loosely affiliated voters,\" Wagner said. \"Sometimes partisan voters like to call themselves independent. So just asking that question can be inaccurate.\"", "According to one 2009 article, once all the \"leaners\" are taken out of consideration, the pure independents actually end up totaling less than 10 percent of registered voters (with the leaners, independents total about 43 percent of the total registered voters).", "PunditFact also reached out to John Brehm, a political science professor at the University of Chicago. Brehm said it might be helpful to think of the \"other\" voters Todd mentioned as being divided into two categories.", "Young voters who have not yet formed a definitive identity mainly constitute the members of the first category. \"The majority of these individuals will eventually come to identify with their parents’ party identities,\" Brehm said. \"Some ... will be influenced by short term forces, typically economic, although sometimes having to do with major foreign policy crises (such as Sept. 11).\"", "The other category of voters, described by Brehm as those who \"left their partisan identity,\" includes \"longtime Republicans or Democrats who say ‘their party has left them’.\"", "\"Nearly all of these people will come to vote with their prior identities, and another large share will simply not vote,\" said Brehm.", "As far as not voting goes, the numbers at the polls seem to support this. In the 2014 midterm election, 28 percent of the voter turnout identified as independent. However, at the time, a Gallup poll recorded that independent voters made up 43 percent of registered voters.", "As Todd even put it during his show, \"Even as the number of Americans identifying as independents has grown, we haven't seen a jump in the number of independent candidates, certainly none that are actually gaining traction, because there are none in the (presidential) race.\"", "Our ruling", "Todd said that \"the number of voters (in Florida) who now register as ‘other’ has grown by a million in the last 10 years,\" while registered Democrat and Republican voters grew by 300,000 and 200,000 respectively.", "In Florida, voters who do not indicate affiliation on their registration forms are automatically placed in the No Party Affiliation category, artificially inflating the number of seemingly independent voters. And among voters registered as having No Party Affiliation, many still vote according to partisan lines.", "Still, the numbers are fairly close, and the trend is certainly spot on.", "Todd’s statement is accurate but needs some additional information. We rate it Mostly True.", "Update: We updated this item on July 8, 2015, to add more information explaining how NBC got its figures.", "NBC, Meet the Press transcript, July 5, 2015", "Florida Department of State, \"2014 General Election: Active Registered Voters by Party,\" Oct. 10, 2014", "Florida Department of State, \"County Voter Registration by Party,\" Oct. 4, 2004", "Florida Department of State, \"Voter Registration Form,\" accessed July 8, 2015", "Politics in Polk, \"Florida Voters Shifting to No Party Affiliation,\" Oct. 21, 2014", "The Monkey Cage, \"Three Myths about Political Independents,\" Dec. 17, 2009", "Gallup, \"In U.S., New Record 43% Are Political Independents,\" Jan. 7, 2015", "The Wall Street Journal, \"Midterm Elections 2014 Exit Polls,\" Nov. 5, 2014", "Email interview with Chuck Todd, July 8, 2015", "Email interview with John Brehm, political science professor at the University of Chicago, July 7, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]