["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Read our lips: If you want to win an election, accuse your opponent of raising taxes.", "So it wasn't surprising when Gina Raimondo, Rhode Island's general treasurer and candidate for governor, accused one of her Democratic primary opponents, Providence Mayor Angel Taveras, of overseeing a hefty tax increase.", "On April 28, 2014, the Raimondo campaign issued a news release headlined, \"Just the Facts: As Providence families pay their property taxes, residential property taxes are up nearly 27 percent under Mayor Taveras.\"", "\"Under Mayor Taveras,\" it said, \"residential property taxes were raised two separate times: by 5 percent in FY 2012 and by 20.7 percent in FY 2014. In total, residential property taxes, which hit working families hard, are up 26.7 percent since 2011.\"", "The news release even included footnotes that cite the pages in the city's budgets that supported the argument.", "The Taveras campaign quickly fired back that the allegation was wrong and the average increase for 2014 was about 6 percent, not 20.7 percent.", "We donned our referee jersey and decided to use the Truth-O-Meter to see who was correct.", "The references in the news release sent us to two Providence budgets. Raimondo spokesman Eric Hyers said we should be looking at the tax rates.", "In the 2012 budget, on page 137, the tax rate for homeowners goes from $15.19 to $15.94, a 4.9 percent increase. The following year, the tax rate remained the same. But in the 2014 budget, on page 161, the rate jumps to $19.25, for an increase of 26.7 percent over three years.", "\"We said tax rates are up 26 percent, which is totally, totally accurate,\" said Hyers.", "But on the same page of the 2014 budget, it notes that the new budget is based on an updated estimate of property values in the city, and residential property values decreased by an average of 13.2 percent.", "Readers who don't immediately understand why this throws a ridiculously-large monkey wrench into Raimondo's claim need to realize how property tax rates are calculated.", "The amount you pay depends on how many thousands of dollars your property is worth. If your house and land are worth $100,000 and the tax rate is set at $22 per thousand, your bill will be $2,200, or $100 times $22.", "In Rhode Island, every community is required to reassess the value of all of its properties every three years. When that revaluation occurs, the tax rate will usually go up or down depending on whether property values fall or rise, even if government spending -- and the average tax bill -- doesn't change from year to year.", "Comparing tax rates in isolation before and after a revaluation ignores half the equation.", "When residential property values decline by 13.2 percent, you have to increase your tax rate by a hefty amount if you want to raise the same amount of revenue that you did the previous year. In that case, the average tax bill remains the same. (On a case-by-case basis, the people in areas of the city where their property values rose will see an increase and homeowners living where property values fell will see their tax bill drop. That's what happened in Providence, although the average homeowner increase on individual tax bills was 4.8 percent.)", "In short: a tax rate -- by itself -- becomes a meaningless number when a municipality has readjusted the value of its tax base.", "When you take Providence’s revaluation into consideration, a homeowner whose property value went from $150,000 to $130,200 after revaluation saw a tax increase of 10 percent over the three-year period Raimondo is talking about, not 26 or 27 percent, according to our calculation based on city data.", "We asked Hyers if the Raimondo campaign had realized there had been a revaluation. He said the campaign knew, but it wasn't relevant to the news release.", "\"We're talking about rates,\" he said. \"The math is very simple.  We are not trying to claim, and you will never hear me try to claim, that tax bills are up 27 percent. We've never said that the bills went up 27 percent. All we're saying is that the rates have gone up 27 percent.\"", "But contrary to Hyers’ assertion, the Raimondo news release never uses the word \"rate.\" And it does say the tax bills went up 27 percent. It even quotes Hyers as saying, \"Providence property taxes are skyrocketing.\"", "Our ruling", "In a news release, State Treasurer Gina Raimondo said, \"Residential property taxes [in Providence] are up nearly 27 percent under Mayor Taveras.\"", "If Raimondo had consistently said that the tax rate had increased nearly 27 percent, PolitiFact Rhode Island would have viewed this claim differently.", "But the Raimondo \"Just the Facts\" news release misstates the facts, claiming taxes increased by nearly 27 percent.", "That's a ridiculous assertion, especially coming from the campaign of the current general treasurer, who is also a finance expert and presumably understands municipal finance.", "We rate it Pants on Fire!", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "News release, \"Just the Facts: As Providence families pay their property taxes, residential property taxes are up nearly 27 percent under Mayor Taveras,\" Raimondo For Governor, April 28, 2014, accessed April 28, 2014", "ProvidenceJournal.com, \"Raimondo criticizes Taveras for increase in Providence property taxes during his term,\" April 28, 2014", "ProvidenceRI.com, \"FY 2012 Adopted Budget,\" \"FY 2013 Adopted Budget - Expenditures & Revenues,\" and \"FY 2014 Adopted Budget - Expenditures & Revenues,\" accessed April 29, 2014", "Interview and email, Eric Hyers, spokesman, Gina Riamondo for Governor, April 29, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]