["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Gary Peters (D-Mich.), who is running for a second term as Michigan’s junior senator, is the subject of an attack ad that takes issue with his position on \"Medicare for All.\"", "The ad claims that \"Peters supports Medicare for All, siding with radical liberals.\" But Peters’ legislative record and public statements suggest otherwise. One Michigan advocate for this single-payer approach even said Peters has never been a part of their cause.", "The ad aired on TV stations across the state starting Dec. 12 and was funded by Better Future Michigan. Initially, the commercial was pulled from some airways after being challenged by the Peters’ campaign for \"being objectively and unquestionably false.\" Better Future Michigan updated and re-released the ad Dec. 16, saying Peters \"supported\" rather than \"endorsed\" Medicare for All, and ran it through Dec. 20.", "The commercial drew our interest ― not only because of the questions it triggered about Peters’ position on health reform, but also because it highlights how the debate over Medicare for All could play out in races ranging from the presidential campaign to House and Senate contests.", "A matter of ‘he said, she said’", "We started out by checking with Better Future Michigan, a 501(c)(4) nonprofit group, to find out the basis for the ad. (Under IRS rules, 501 (c)(4) groups do not have to disclose their donors.)", "Tori Sachs, its executive director, pointed to two videos from a 2018 town hall meeting, featuring an exchange between Peters and a voter who supports the single-payer approach to health reform. Peters responded by saying he wants to protect the Affordable Care Act from Republicans and introduce a public option in the insurance exchange.", "But Peters also said: \"The path forward is where you’re going to have Medicare for All down the road. That’s probably where we’re going to go. But we’ve got to deal with the problem we have right now.\"", "This statement, according to Sachs, is central to Better Future Michigan’s position.", "\"If Peters is (or was) so staunchly against Medicare for All, why did he acknowledge that it’s the future?\" she wrote in an email. \"Someone opposed to an issue or policy would at minimum qualify such a statement, but instead, Peters’ surrounding discussion with the town hall participant shows otherwise.\" (Sachs managed John James’ failed 2018 challenge to unseat Michigan’s senior Democratic senator, Debbie Stabenow. James is now running against Peters.)", "An April 2019 press release from the National Republican Senatorial Committee advanced a similar argument, saying Peters is \"playing both sides\" of the Medicare for All debate.", "The Peters campaign pushed back.", "\"This dark money group with close ties to John James is pushing objectively false claims in their attack ads in a desperate attempt to lie to Michigan voters. Senator Peters’ position has been clear and consistent that he supports strengthening the Affordable Care Act and expanding access to health insurance through common sense policies like adding a public option and letting people 50 and older buy into Medicare but does not support Medicare for All or eliminating private health insurance,\" said Dan Farough, Peters’ campaign manager, in an email.", "The campaign also provided several articles in which the senator shied away from supporting Medicare for All.", "In an August 2019 interview with Politico, when asked if Medicare for All proponents could win his state, Peters said they would \"have to show and be able to explain exactly how that would help folks here in Michigan,\" and \"I think people do want to have the opportunity to keep private insurance.\" His position appeared consistent in other press reports, too, ranging from Michigan TV interviews to a CNN article.", "Peters generally voiced his support for shoring up the Affordable Care Act, offering a public option on the insurance marketplace and lowering the eligibility age for Medicare. In 2019, he co-sponsored a bill that would allow anyone over 50 to buy into Medicare and another bill that would establish a public health plan option on the insurance exchange.", "Peters has not co-sponsored Sanders’ Medicare for All legislation.", "Eli Rubin, president of the advocacy group Michigan for Single Payer Healthcare, said that Peters \"definitely does not support Medicare for All,\" but that he also doesn’t like to take a position or directly answer questions about it.", "\"We’ve had many encounters with him and asked him about it, and he won’t say, ‘No, out of the question,’ but he dodges the question every time,\" said Rubin. \"He turns the conversation every time to where he talks about his defense of the Affordable Care Act.\"", "Marianne Udow-Phillips, the director of the nonpartisan Center for Health and Research Transformation at the University of Michigan, offered another take. \"What he is trying to do is not foreclose strategies, but to essentially say that is not his area of focus on health care right now,\" she said.", "\"Michigan is like the rest of the country,\" said Udow-Phillips. \"People are primarily concerned with the cost of health care and pocketbook issues. They’re worried about deductibles and copays. They’re worried about surprise bills. I don’t think on a statewide basis Medicare for All is a motivating issue or speaks to people in a broad way.\"", "Still, pollsters and policy experts point out that for some voters in the progressive wing of the Democratic Party support for Medicare for All can become a litmus test.", "Why there’s such a fuss", "With the 2020 election fast approaching, there’s a sense among some Democrats in Michigan and other battleground states that supporting progressive issues like Medicare for All could translate into political baggage on the campaign trail.", "\"Independents and swing voters are more negative against Medicare for All,\" said Robert Blendon of the Harvard T.H. Chan School of Public Health, who is an expert on public opinion of social policy.", "For instance, 65% of swing voters in Michigan said a national Medicare for All plan that would eliminate private health insurance is a bad idea, according to a November 2019 Kaiser Family Foundation poll. (Kaiser Health News is an editorially independent program of the foundation.)", "The issue can also be weaponized against Democratic candidates.", "Colleen Grogan, a professor at the University of Chicago’s School of Social Service Administration, pointed out that it is a common GOP strategy to associate Medicare for All with socialized medicine. It can also be used to play on the public’s lack of confidence in government-run social programs, she added.", "\"The whole idea is that the government is such a demon in the U.S.,\" said Grogan. \"It’s easy for Republicans to demonize the government … and say, ‘You don’t want them [the government] running your health care program.’\"", "Another benefit of this attack method, which could be used frequently in the run-up to November, according to Blendon, is that it doesn’t require the GOP to offer a policy alternative and instead focuses on how Medicare for All would eliminate private insurance.", "\"From the Republican point of view, it doesn’t require you to take a stand on what you’ll do for health care,\" he said. \"But it does allow you to say, you won’t have any choice in your health care.\"", "Our ruling", "A TV ad by Better Future Michigan claimed that Peters \"supports Medicare for All, siding with radical liberals.\"", "The statement is based on two videos from a 2018 town hall meeting. Though the senator does not tell a Medicare for All supporter that he backs this approach, he agreed that it could be a \"pathway\" in the future.", "But from this comment to the ad’s overall assertion is a big stretch.", "Specifically, Peters is on the record as supporting efforts to protect the Affordable Care Act from Republican changes, offering a public option and lowering the eligibility age for Medicare. He also supports keeping private insurance. In addition, he is not a co-sponsor of Sanders’ Medicare for All legislation, and single-payer advocates within Michigan said he \"definitely\" does not support this approach.", "For these reasons, we rate the claim False.", "Better Future Michigan television ad, \"Falling in Line,\" Dec. 10, 2019.", "Better Future Michigan television ad, Version 2, \"Falling in Line,\" Dec. 16, 2019.", "Letter from counsel for Sen. Gary Peters and Peters for Michigan, \"Re: False Better Future Michigan Advertisement,\" Dec. 12, 2019.", "MLive, \"Michigan TV stations replace ‘false’ attack ads on Gary Peters,\" Dec. 17, 2019.", "Twitter, Better Future Michigan status, Dec. 16, 2019.", "Email statement from Tori Sachs, Better Future Michigan, Jan. 7, 2020.", "YouTube video, \"Senator Gary Peters on health care,\" June 16, 2018.", "YouTube video, \"Senator Gary Peters on health care (part two),\" June 16, 2018.", "Email statement from Peters for Michigan campaign, Jan. 10, 2020.", "Telephone call and email exchanges with Alex Japko, Michigan Democratic Party spokesperson, Jan. 8, 10, 13, 14, 2020.", "Politico, \"Senate battleground Dems shun ‘Medicare for All’,\" Aug. 25, 2019.", "Email exchange with Peters’ Senate office, providing transcript for Sept. 8, 2019, WSMH interview, Jan. 10, 2020.", "WSMH Fox 66, Gary Peters interview, Sept. 8, 2019.", "CNN, \"Democrats distance themselves from Harris’ call to eliminate private health plans,\" Jan. 30, 2019.", "Telephone interview with Eli Rubin, president of Michigan for Single Payer Healthcare, Jan. 10, 2020.", "National Republican Senatorial Committee, \"Gary Peters Is Hiding from Medicare for All,\" April 12, 2019.", "National Republican Senatorial Committee, \"NRSC Targets Gary Peters On Medicare For All During Bernie Sanders Rally,\" April 13, 2019.", "YouTube video, \"Sen. Gary Peters silenced by Medicare for All chant,\" Feb. 4, 2019.", "S.470 - \"Medicare at 50 Act,\" sponsored by Sen. Debbie Stabenow, 2019-20.", "S.981 - \"Medicare-X Choice Act of 2019\", sponsored by Sen. Michael Bennet, 2019-20.", "S. 1129 - Medicare for All Act of 2019,\" sponsored by Sen. Bernard Sanders, 2019-20.", "Telephone interview with Marianne Udow-Phillips, executive director of the Center for Health and Research Transformation at the University of Michigan, Jan.10, 2020.", "The Atlantic, \"How the Democrats Took Back Michigan,\" Nov. 18, 2018.", "KFF, \"Public Opinion on Single-Payer, National Health Plans, Expanding Access to Medicare Coverage,\" Nov. 26, 2019.", "KFF, \"Blue Wall Voices Project - Michigan,\" Nov. 7, 2019.", "Telephone interview with Ashley Kirzinger, associate director for public opinion and survey research, KFF, Jan. 10, 2020.", "Telephone interview with Robert Blendon, Richard L. Menschel professor and senior associate dean for Policy Translation and Leadership Development, Harvard T.H. Chan School of Public Health, Jan. 21, 2020.", "Telephone interview with Colleen Grogan, professor at the University of Chicago School of Social Service Administration, Jan. 22, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]