["By Angelo Fichera", "Posted on July 25, 2018", "Q: Will Mars be “as big as the Moon” on July 27 for the first time in 35,000 years?", "A: No. A viral story spreads a repeatedly debunked myth.", "A viral story that grabbed the attention of Facebook users this week tells of a historic, “cosmic event” in which Mars will appear “as big as the Moon” on July 27.", "“It will be possible to observe, with the naked eye, a cosmic phenomenon which will allow the inhabitants of the Earth to behold … two moons!” proclaims the story, published July 23 on scienceinfo.news.", "But that’s not happening — in fact, it’s not scientifically possible.", "“I’ve heard this before,” laughed Sarah Noble, a planetary geologist at NASA, when asked by FactCheck.org about the story — which has been posted tens of thousands of times on Facebook.", "False (and debunked) accounts of such an impending occurrence have circulated since at least 2003, when Mars was as close to Earth as it had been in some 60,000 years, according to NASA.", "That close encounter happened during both Mars opposition — which is when Mars and the sun are on directly opposite sides of Earth, an occurrence that happens every two years — and the planet’s perihelion, when Mars is closest to the sun. (NASA says such a “perihelic opposition,” as it is known, occurs every 15 to 17 years.)", "While a perihelic opposition is happening this year, when Mars opposition takes place July 27, NASA says the planets won’t be as close as they were in 2003. “Our 2003 record will stand until August 28, 2287!” NASA says.", "Even in 2003, Mars wasn’t close enough to have “an apparent diameter as big as the Full Moon,” which is what scienceinfo.news says will happen on July 27.", "Though Mars is nearly twice the size in diameter of the moon, Noble said Mars can never appear as big as the moon because of its distance from Earth. On July 31, when Mars reaches its closest point to Earth during its orbit — its so-called close approach — it’s expected to be about 35.8 million miles away. By contrast, the moon is an average of 238,855 miles away from the Earth.", "“The distance from the Earth and the moon compared to the distance from Earth to Mars is enormous,” Noble said.", "Although Mars opposition this summer will technically occur July 27, Noble said the planet’s increased brightness in our sky is visible throughout the summer.", "“It will look like a very bright star, an orange-ish bright star,” Noble said. “It’s still going to be hard to pick it out in the night sky.”", "In other words, not like the moon.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "“Mars Opposition.” NASA.gov. Accessed 24 Jul 2018.", "Noble, Sarah. Planetary geologist, NASA. Phone interview with FactCheck.org. 24 Jul 2018.", "Rao, Joe. “Mars Hoax Returns to Mislead Stargazers.” Space.com. 18 Aug 2015.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]