["About this rating", "In April 2016, a meme was published by the Facebook page \"The Other 98%\" (among others) holding that 643,000 Americans declare bankruptcy over medical bills every year, while in a number of other first-world countries, bankruptcies over medical bills are non-existent (due to the implementation of national social health insurance/medical care systems in those other countries):", "At the fine print at the bottom of the meme was a citation: \"Source: NerdWallet Health Analysis.\" No link to the specific analysis referenced was provided, but presumably the item in question was a 19 July 2013 item published by NerdWallet pertaining to medical bankruptcies. However, in that analysis NerdWallet repeatedly stated that their findings were \"estimates\" or \"extrapolations,\" and some of their data were quite old even back in 2013.", "The primary portion of that article held that:", "“In 2013 over 20% of American adults are struggling to pay their medical bills, and three in five bankruptcies will be due to medical bills. While we are quick to blame debt on poor savings and bad spending habits, our study emphasizes the burden of health costs causing widespread indebtedness. Medical bills can completely overwhelm a family when illness strikes,” says Christina LaMontagne, VP of Health at NerdWallet. “Furthermore, 25 million people hesitate to take their medications in order to control their medical costs. Unfortunately this can lead to even worse financial outcomes as preventative treatments are not rendered and patients end up using expensive ambulance and ER care as their health worsens.”", "Finally, many question whether President Obama’s universal health insurance mandate will protect Americans from problems with medical bills. “Insurance is no silver bullet,” says LaMontagne. “Even with insurance coverage, we expect 10 million Americans will face bills they are unable to pay.”", "Although the \"643,000\" figure didn't expressly appear in that article, if we take the number of bankruptcy filings in the U.S. in 2013 (1,032,236) and apply NerdWallet's statement that \"three in five (60%) bankruptcies will be due to medical bills,\" then we arrive at a number of medical bill-related bankruptcies (619,342) reasonably close to the 643,000 figure (although technically a bankruptcy filing can represent more than one person).", "Likewise, a 2013 CNBC item based on the 2013 NerdWallet Health Analysis included a chart showing the estimated total number of medical-related bankruptcies in the U.S. in 2013 to be 646,812, which is also quite close to the cited 643,000 figure:", "Since the number of bankruptcy filings in the U.S. is a matter of public record, the accuracy of this figure hinges on how reliable is the estimate that 60% of those filings are medical-related.", "In NerdWallet's \"Methodology & Sources\" section, the site said their medical bankruptcy estimates were based on a 2009 Harvard study, which in turn used bankruptcy data from 2007 and involved interviewing a random national sample of a bankruptcy filers:", "BACKGROUND: Our 2001 study in 5 states found that medical problems contributed to at least 46.2% of all bankruptcies. Since then, health costs and the numbers of un- and underinsured have increased, and bankruptcy laws have tightened.", "METHODS: We surveyed a random national sample of 2314 bankruptcy filers in 2007, abstracted their court records, and interviewed 1032 of them. We designated bankruptcies as “medical” based on debtors’ stated reasons for filing, income loss due to illness, and the magnitude of their medical debts.", "RESULTS: Using a conservative definition, 62.1% of all bankruptcies in 2007 were medical.", "NerdWallet themselves reported that they employed a more conservative estimate than the Harvard study figure regarding the proportion of bankruptcies that are medical-related:", "We relied on a widely cited Harvard study published in 2009. NerdWallet Health chose to include only bankruptcy explicitly tied to medical bills, excluding indirect reasons like lost work opportunities. Thus we conservatively estimated medical bankruptcy rates to be 57.1% (versus the authors’ 62.1%) of US bankruptcies. We also used official bankruptcy statistics, released this month through March 2013, from US Courts.", "Still, quantifying the occurrence of medical bankruptcies can be problematic, as noted in a\nJanuary 2016 New York Times article on the subject:", "Research on medical bankruptcies has been controversial because it can be hard to untangle how medical bills fit into a family’s overall pattern of financial troubles. Twenty-nine percent of the people with medical bill problems said a family member had been forced to stop working or cut back on hours. (On the other side, about 41 percent of people said they’d taken on extra work to help pay bills.)", "“Is that a job problem or a medical bill problem?” said David Himmelstein, a professor of public health at the City University of New York’s Hunter College School of Public Health who has studied medical bankruptcies. “It’s both of those things.”", "However, that article also factored in a large development that occurred after NerdWallet's 2013 analysis: the activation of major provisions of the Patient Protection and Affordable Care Act (also known as PPACA, ACA, or Obamacare):", "The [ACA] has led to a decline in the number of Americans suffering financial stress from health problems, thanks to the new options for receiving coverage, especially for the poor. But the problem is still widespread, touching roughly a quarter of Americans under 65, when the insured and uninsured are looked at together. Americans older than 65 are covered by Medicare, which more frequently protects people from major financial trouble.", "Unlike other polls, which have focused on the ways that insurance affects health care, the new Times-Kaiser survey explored the effects of medical bills on people’s daily lives well beyond the medical system. We found that medical bills don’t just keep people from filling prescriptions and scheduling doctors’ visits. They can also prompt deep financial and personal sacrifices, affecting their housing, employment, credit and daily lives.", "The potentially ameliorating effect of the ACA on bankruptcies was also cited by a July 2015 Wall Street Journal article which (in part) described research into medical bankruptcy done by Northeastern University law professor Daniel Austin:", "So what does Prof. Austin think will happen with mandatory health care in all 50 states? Could the system designed to give people access to affordable health insurance make families more financially stable and keep them out of bankruptcy?", "“It absolutely should show a reduction in bankruptcies [filed] due to medical debt,” Prof. Austin said in an interview.", "Plenty of studies have pinpointed medical debt as the No. 1 reason why people turn to bankruptcy for a fresh start. In rallying for health-care reform in his 2009 State of the Union address, President Barack Obama said that 62.1% of consumer bankruptcies are medical bankruptcies, citing a study Sen. Elizabeth Warren (D., Mass.) co-wrote as a Harvard law professor.", "Prof. Austin’s study found the percentage of medical bankruptcies to be far smaller. Overall, 18% to 25% of personal bankruptcies filed in the U.S. were prompted by medical debt.", "But even prior to the implementation of the ACA, some sources questioned the true impact of medical debt on bankruptcy rates. A 2012 piece published by The Hill compared rates of bankruptcy between the United States and Canada (the latter a country with single-payer healthcare system):", "It's difficult to conclude that bankrupt folks are awash in healthcare debt when nearly 90 percent of their obligations are unrelated to health care ... Will ObamaCare's increased regulation of the healthcare marketplace help put an end to the phenomenon?", "Data from countries with government-run healthcare systems suggest not.", "Consider Canada. Our neighbor to the north features a government-run, single-payer healthcare system where private insurance is outlawed for procedures covered under the law. So you'd think that Canada would have a lower rate of bankruptcy than the United States, what with one big potential cause of bankruptcy — the cost of health care — absorbed by the government.", "But according to researchers at the Fraser Institute, a nonpartisan Canadian think tank, bankruptcy rates are statistically the same on both sides of the 49th parallel. In both the United States and Canada, less than one-third of 1 percent of families file for bankruptcy each year.", "Further, even with a socialized healthcare system, some Canadians go bankrupt because of medical expenses. Approximately 15 percent of bankrupt Canadian seniors — those 55 and older — cited medical reasons, including uninsured expenses, as the main culprit for their insolvency.", "Canada wasn't the only country in which the presence of single-payer healthcare reportedly wasn't a total shield against bankruptcies (medical-related or otherwise). A 2010 World Health Organization (WHO) paper [PDF] found that:", "Outside of the US, research on links between over-indebtedness and health has been quite limited to date, consisting largely of rankings of factors in consumer debt. For instance, within the United Kingdom, sickness or disability accounted for 5% of households in financial difficulties in 2002. A ranking of causes of over-indebtedness and private bankruptcy in Germany found that “psychological problems” and “own sickness”, if added together, would rank in fourth place of reasons for over-indebtedness and private bankruptcy.", "There have been a number of interesting recent studies in Germany on the subject. These have found a high risk of mental disorders among those facing the threat of over-indebtedness as well as the association of over-indebtedness with an increased prevalence of overweight and obesity apart from traditional socioeconomic factors. Additionally, there is evidence that over-indebted persons refrain from seeking medical treatment or purchasing prescriptions even under Germany’s health system. One-third of participants in a study of insolvency counseling services in Rhineland–Palatinate indicated that their financial difficulties were a result of accident, illness or addiction.", "In short, using some very specific analyses, one could make the case that (at least within the last several years) about 643,000 Americans declared bankruptcy annually due to medical bills. But the accuracy of those analyses is open to question, the playing field has changed significantly since they were undertaken (due to the implementation of the ACA), and it's far from an absolute that the other countries listed in the meme experience zero medical-related bankruptcies.", "Emami, Sarah.   \"Consumer Over-Indebtedness and Health Care Costs:\r\nHow to Approach the Question from a Global Perspective.\"\r\n    World Health Report (2010) Background Paper, 3.   2010.", "Himmelstein, David U. et. al.   \"Medical Bankruptcy in the United States, 2007: Results of a National Study.\"\r\n    American Journal of Medicine.   12 April 2009.", "Lamontagne, Christina.   \"NerdWallet Health Finds Medical Bankruptcy Accounts for Majority of Personal Bankruptcies.\"\r\n    NerdWallet.   19 June 2013.", "Lamontagne, Christina.   \"NerdWallet Health Finds Medical Bankruptcy Accounts for Majority of Personal Bankruptcies.\"\r\n    NerdWallet.   26 March 2014.", "Luthra, Shefali.   \"Consumers Still Struggling with Medical Debt.\"\r\n    USA Today.   1 February 2015.", "Mangan, Dan.   \"Medical Bills Are the Biggest Cause of US Bankruptcies: Study.\"\r\n    CNBC.   25 June 2013.", "Pipes, Sally C.   \"Medical Bankruptcy: Fact or Fiction?\"\r\n    The Hill.   23 October 2012.", "Sanger-Katz, Margot.   \"Even Insured Can Face Crushing Medical Debt, Study Finds.\"\r\n    Thne New York Times.   5 January 2016.", "Stech, Katy.   \"The Future of Personal Bankruptcy in a Post-Obamacare World.\"\r\n    The Wall Street Journal.   1 July 2015.", "Office of the Superintendent of Bankruptcy.   \"Growing Old Gracefully, An Investigation Into the Growing Number of Bankrupt Canadians Over Age 55.\"\r\n    31 March 2006.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]