["About this rating", "Shortly after Chris Wallace of Fox News moderated a contentious debate between presidential candidates Donald Trump and Joe Biden on Sept. 29, 2020, social media users began circulating photographs said to show Wallace vacationing on the private island (commonly dubbed \"Pedophile Island\") owned by the late financier and convicted sex offender Jeffrey Epstein:", "Although these photographs do capture Chris Wallace vacationing, they have no connection to Epstein or to the notorious private island he once owned in the U.S. Virgin Islands.", "The persons seen in these photographs are easily identifiable as Wallace and his wife, Lorraine Smothers, along with actor George Clooney and his former girlfriend Stacy Keibler.", "The actor and the Fox News host have a friendly relationship, and the two couples spent some time together at Clooney's home in Lake Como, Italy, in August of 2012. The photographs seen above can be glimpsed in a contemporaneous Politico video interview of Wallace, during which the host described his four-day vacation with his wife at Clooney's Italian home.", "Claeson, Hanna.   \"Details About Chris Wallace and George Clooney's Friendship.\"\r\n    The List.   26 September 2020.", "Laviola, Erin.   \"Lorraine Smothers, Chris Wallace’s Wife: 5 Fast Facts.\"\r\n    Heavy.   March 2020.", "Monde, Chiderah.   \"George Clooney, Stacy Keibler Split After Two years Over Their Opposing Views of Marriage, Kids: Report.\"\r\n    New York Daily News.   8 July 2013.", "Politico.   \"Chris Wallace on His Vacation with George Clooney.\"\r\n    17 August 2012.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]