["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In an attempt to wrest the moral high ground on special interest influence, Sen. Barack Obama has gone on the offensive, accusing Republican Sen. John McCain of talking tough on campaign finance reform, but then stocking his campaign with lobbyists.", "At a rally in Tampa on May 21, 2008, Obama said that despite 10 years ago proposing a bill that would have banned lobbyists from being paid by a campaign, McCain \"hired some of the biggest lobbyists in Washington to run his campaign.\"", "The McCain campaign's ties to current or former lobbyists has been well documented in recent weeks. Disclosures about some of those ties — including clients they have served — led to a handful of departures from the campaign. The highest profile casualty was former Rep. Thomas Loeffler, campaign co-chairman and national finance committee co-chairman. Loeffler is a lobbyist and founder of the Loeffler Group, a multimillion-dollar lobbying operation that, according to\n\nHouston Chronicle\n\nreports last year, has included clients such as AT&T, the National Association of Broadcasters, the Pharmaceutical Research and Manufacturers of America, the Port of Houston, Southwest Airlines and Toyota Motor Co. The firm also has represented the Kingdom of Saudi Arabia on trade issues.", "In response, the McCain campaign on May 15, 2008, instituted a \"conflict policy\" — the campaign will not keep any federal lobbyists on its payroll. Period.", "\"We are in compliance with that policy,\" McCain campaign spokesman Brian Rogers told PolitiFact.", "But the campaign is still thick with former lobbyists, some who left or took unpaid leave of absences from their lobbying firms just before joining the campaign.", "One of them is Charlie Black, a senior adviser on the McCain campaign. Described by the\n\nWashington Post\n\nas a \"longtime uber lobbyist,\" Black retired as chairman of BKSH & Associates in March. He told the\n\nNew York Times\n\nhe is not paid by the campaign.", "Then there's campaign manager Rick Davis, who hasn't been a registered lobbyist for five years and took a leave of absence from his lobbying firm Davis Manafort two years ago.", "Black defended the use of former lobbyists.", "\"I think you can change professions and unless you did something unethical or criminal, your past profession should not be injected into the candidate's campaign,\" Black told the\n\nNew York Times.\n\n\"It's absurd.\"", "Said Tucker Bounds, a spokesman for the McCain campaign: \"John McCain has an unmatched record of fighting the influence of special interests in Washington. The McCain campaign has implemented the strictest policy against lobbyists in presidential campaign history, and we challenge Sen. Obama to meet our standard.\"", "Okay, so McCain has clearly set a policy that forbids current federal lobbyists from drawing a campaign paycheck and campaign officials say they are in full compliance with that. Now. But the policy comes more than a year into the campaign. Current lobbyists hired by the campaign may have now been purged, but the fact is they were hired.", "We rule Obama's statement True.", "YouTube,\n\n\"Obama Criticizes McCain on Lobbyists\"\n\nfrom May 21 speech in Tampa", "New York Times,\n\n\"Top Aide to McCain Defends Lobbying Work\"\n\nby Michael Luo, May 19, 2008", "MSNBC,\n\n\"Adviser Calls Lobbyist Scrutiny 'Nonsense'\"\n\nby Carrie Dann, May, 19, 2008", "Media Matters,\n\n\"CNN, First Read repeated McCain adviser's false claims about campaign manager's lobbying history\"\n\non May 20, 2008", "New York Times,\n\n\"McCain Finds a Thorny Path in Ethics Effort\"\n\nby Barry Meier and Kate Zernike, May 20, 2008", "Washington Post,\n\n\"McCain Adviser's Work As Lobbyist Criticized\"\n\nby Michael D. Shear and Jeffrey H. Birnbaum, May 22, 2008", "Politico,\n\n\"Lobbyists: This is our thanks?\"\n\nby Jeanne Cummings, May 21, 2008", "New York Times,\n\n\"The Early Word: Conflict Issues for McCain\"\n\nby Ariel Alexovich, May 16, 2208", "Media Matters,\n\n\"Media advance myth of McCain as lobbyist foe\"\n\nFeb. 26, 2008", "The Hill,\n\n\"Public Citizen comes to McCain's defense\"\n\nby Jim Snyder, Feb. 26, 2008", "Huffington Post,\n\n\"More Lobbyists On McCain Staff Than Any Other 08 Candidate\"\n\nby Thomas B. Edsall, May 23, 2008", "Washington Post,\n\n\"The Anti-Lobbyist, Advised by Lobbyists\"\n\nby Michael D. Shear and Jeffrey H. Birnbaum, Feb. 22, 2008", "U.S. Senate,\n\n\"Lobbying Disclosure Act search engine\"", "Interview with Massie Ritsch, a spokesman for the Center for Responsive Politics, May 23, 2008", "Interview with Steve Weissman, associate director for policy at the Campaign Finance Institute, May 23, 2008", "Interview with McCain campaign spokesman Brian Rogers, May 23, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]