["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Roy Moore, who lost his bid for U.S. Senate, appeared in Gallant, Alabama on election day Dec. 12, 2017. (AP)", "Alabama Senate candidate Roy Moore appeared to hold out hope that military ballots would reverse his loss to Democrat Doug Jones -- and the theory was circulated as fake news.", "\"Roy Moore takes the military vote, pulls ahead by 5,000 votes,\" said the headline on the website defense-usa.xyz on Dec. 15, three days after Moore, a Republican, lost to Jones. We found no contact information on this website to probe the story further.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news.", "The special U.S. Senate election in Alabama was the subject of many fake news stories. This one, too, is fake.", "According to the story, the \"Alabama Secretary of State’s Division Of Electoral Balloting Integrity\" had sent emails to media outlets regarding the military vote count, which showed that Moore led by 5,014 votes after 97 percent of the vote had been counted.", "Jones would have to pay $213 million for a recount, the story stated.", "\"The Secretary of State’s office has already announced that the election won’t be certified until after the first of the year, so the Democrat loser will have plenty of time to decide if he’ll waste the taxpayers’ time and money with a fruitless recount,\" stated the article. \"They can never just admit when they lost.\"", "In reality, there is no such entity as the \"Alabama Secretary of State’s Division of Electoral Balloting Integrity.\" And the number of ballots cast do not bear out what the story alleged.", "The official Alabama Secretary of State’s website showed that Jones received 671,151 votes while Moore received 650,436.", "Moore appeared to hope that military and provisional ballots would turn the tide for him after the election. In a Dec. 15 email to supporters, Moore wrote that those votes were yet to be counted and that the election was \"too close to call\" and \"the battle is NOT OVER!\"", "On Dec. 20, Secretary of State John Merrill provided information showing that there were 366 military and overseas ballots returned. Merrill also reported that there was a total of 4,967 provisional ballots received and of those, 2,888 had been verified. That means that even if all of the overseas and provisional ballots were cast for Moore -- an unlikely scenario -- that would not add up to enough to change the outcome of the race since Jones had a lead of more than 20,000 votes.", "The state is expected to certify the election results on Dec. 28. A spokesman for the Secretary of State’s office said that the final results are not significantly different from the unofficial numbers from election night but will include slight increases for both candidates due to the late-counted military and provisional ballots.", "The viral post saying Moore pulled ahead of Jones thanks to overseas and provisional ballots is not accurate. We rate this claim Pants on Fire.", "Defense-USA.xyz, \"Roy Moore takes the military vote, pulls ahead by 5,000 votes,\" Dec. 15, 2017", "Alabama Secretary of State, \"Secretary of State John H. Merrill Releases Updated Numbers on UOCAVA and Provisional Ballots,\" Dec. 20, 2017", "Alabama Media Group, \"Overseas, provisional ballots won’t affect Jones win,\" Dec. 20, 2017", "Montgomery Advertiser, \"Alabama Senate: Provisional, overseas ballots well short of Jones margin,\" Dec. 20, 2017", "AP, \"Alabama finds no voter fraud after probe of TV interview,\" Dec. 21, 2017", "PolitiFact, \"No, undocumented immigrants were not caught voting in Alabama Senate election,\" Dec. 13, 2017", "PolitiFact, \"No, Alabama poll workers were not arrested in U.S. Senate election,\" Dec. 19, 2017", "PolitiFact, \"Fake news in the Alabama Senate race surges before Election Day,\" Dec. 11, 2017", "PolitiFact, 2017 Alabama Senate’s race, Accessed Dec. 27, 2017", "Interview, John Bennett, spokesman for the Alabama Secretary of State, Dec. 27, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]