["The image was posted here on Facebook on January 30, 2021. It was shared by a New Zealand-based Facebook page with more than 4,000 followers.", "“There you have it folks! A group of communist nazis,” the caption reads.", "The image features five US Democratic Representatives, from left to right: Rashida Tlaib of Michigan; Ilhan Omar of Minnesota; Jamaal Bowman of New York; Alexandria Ocasio-Cortez of New York;Cori Bush of Missouri; and Ayanna Pressley of Massachusetts.", "The image purports to show Ocasio-Cortez, Omar and Tlaib wearing red garments featuring a yellow swastika with a star. Bowman and Bush are pictured sporting facemasks with the same swastika symbol, while Presley appears to be sporting a red bow featuring the symbol.", "The image includes text from another Facebook post that reads: “Anyone else notice the swastika on omer aoc [sic] and rashida’s dress”.", "The image was shared hundreds of times after being posted by multiple Facebook pages in the US, including here, here and here.", "The image, however, has been altered.", "A reverse image search shows the image was originally tweeted by Cori Bush on January 3, 2021.", "The original image features the same five Democratic representatives wearing clothing that does not display swastika symbols.", "Squad up. pic.twitter.com/bp2KATL22R", "Ocasio-Cortez, Omar and Tlaib are also not pictured wearing red dresses, as shown in the doctored image.", "Bush’s “Squad up” caption is a reference to the four women of colour: Oasio-Cortez; Omar; Tlaib and Pressley, who are known for their progressive policy stances, according to the HuffPost.", "The image marked the addition of the newly elected Democratic Representatives, Bush and Bowen, as part of a group of progressive lawmakers, according to a report from US news and politics website The Hill.", "Other members of \"The Squad\" retweeted the photo with their own captions. You can see posts from Bowman here; Ocasio-Cortez here; Omar here; Tlaib here; and Presley here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]