["Donald Trump is interviewed on CBS' \"Face the Nation\" on Sept. 13, 2015. (Screenshot)", "Donald Trump is again defending his disparaging comments about a woman on national television. This time it’s about Carly Fiorina, a rival for the Republican nomination whom Trump mocked by saying \"Look at that face!\" in front of a Rolling Stone reporter who published his remarks.", "Appearing on CBS’ Face the Nation, Trump contended that his remarks were not about her appearance, but about \"her persona\" and her track record as the CEO of Hewlett-Packard.", "\"She hasn’t done a good job in, you could call it, the private sector. The companies, take a look at the record,\" he said Sept. 13. \"The top man at Yale Law School came out, Jeffrey Sonnenfeld, with just a raging report. She’s one of the worst executives in his memory in history running the company.\"", "Trump rarely cites his sources, so we were curious about the \"raging report\" by a top dog at Yale University’s law school.", "The Trump campaign did not get back to us by deadline, but we think he is likely referring to an Aug. 14, 2015, column in Fortune by Yale’s Jeffrey Sonnenfeld.", "The piece did criticize Fiorina’s record at HP, but Trump misstated a few things.", "First, Sonnenfeld is a professor and senior associate dean for leadership programs at the Yale School of Management, not \"the top man\" at Yale Law.", "Second, Sonnenfeld didn’t name Fiorina as one of the worst executives in his memory. But he told PolitiFact in an interview that \"these complaints over her leadership are facts, which she cannot erase by attacking messengers.\"", "\"Fired in 2005, after six years in office, several leading publications titled her one of the worst technology CEOs of all time,\" he wrote in Fortune.", "Here’s a laundry list of Fiorina’s failings, according to Sonnenfeld (which includes a nod to Trump himself):", "\"She was not a criminal nor one of the rogue CEOs of another era and may deserve another chance, but it is telling that in a decade, she has never been given another major company to lead,\" Sonnenfeld told us. \"Experience can be a badge of honor or a badge of shame.\"", "Sonnenfeld’s assessment of Fiorina is echoed by several others, but he stands out as one of her most prominent critics (so much so that Fiorina dismissed him as a Clinton adviser on NBC, which Sonnenfeld denies, and her Super PAC has featured him and his \"disreputable past\" in a blog post). He deemed Fiorina’s tenure at HP a \"colossal failure\" in Bloomberg in April 2015 and \"a reign of terror and poor performance\" in a 2006 Associated Press story.", "\"You couldn’t pick a worse, non-imprisoned CEO to be your standard-bearer,\" he told the New York Times in 2008.", "A Fiorina spokeswoman contended that Fiorina \"was a successful CEO by any metric\" and said that Sonnenfeld \"is a Clinton ally with dubious motives.\"", "\"This is a blatantly absurd statement which holds no factual or empirical basis,\" Leslie Shedd, press secretary for Fiorina’s Super PAC, said. Shedd also pointed out that Trump has disparaged Sonnenfeld in the past (and got his title right) when the latter criticized his NBC reality show, The Apprentice, in 2004.", "\"I would have to say that he lacks the insight required to understand the architecture of a corporation, and his review reflects that lack of knowledge,\" Trump wrote in a letter to the Wall Street Journal. \"Perhaps that is why he is a professor at Yale instead of the Wharton School of Finance (my alma mater).\"", "Since Sonnenfeld and the real estate mogul traded jabs, Trump apparently invited Sonnenfeld to lunch at Trump National Golf Course and charmed Sonnenfeld's wife and colleague, much to the Yale professor’s horror.", "Our ruling", "Trump said, \"The top man at Yale Law School came out, Jeffrey Sonnenfeld, with just a raging report\" about former HP CEO Carly Fiorina, saying she is \"one of the worst executives in his memory in history running the company.\"", "Trump misses minor points about the Yale man and his message. Sonnenfeld teaches at Yale’s business school. He is not the law school’s \"top man. And Sonnenfeld doesn’t exactly say Fiorina is the worst HP CEO in \"his memory.\"", "However, the gist of Trump’s claim is accurate, as Sonnenfeld has been a vocal critic of Fiorina’s HP record for years.", "Trump’s claim is missing some detail but is overall on point about Sonnenfeld’s long-running critique of Fiorina. We rate Trump’s claim Mostly True.", "CBS, Face the Nation, Sept. 13, 2015", "Rolling Stone, Trump Seriously: On the Trail with the GOP's Tough Guy, Sept. 9, 2015", "Email interview with Jeffrey Sonnenfeld, senior associate dean at the Yale School of Management, Sept. 13, 2015", "Fortune, Carly Fiorina as a boss: The disappointing truth, Aug. 14, 2015", "Fortune, Why the ‘Dump Trump’ Strategy is Doomed, Aug. 22, 2015", "CBS News, America's worst CEOs: Where are they now?, April 27, 2015", "USA Today, Can Fiorina trump competition for 'worst tech CEO' title?, Feb. 15, 2005", "CNBC, Portfolio's Worst American CEOs of All Time, April 30, 2009", "PolitiFact, Ad from Sen. Barbara Boxer attacks Carly Fiorina for layoffs at HP, Sept. 17. 2010", "San Francisco Chronicle, Carly Fiorina blasts Barbara Boxer’s hair and Meg Whitman on hot mic, June 10, 2010", "Business Insider, Ex-HP CEO Carly Fiorina is planning to run for president based on her business experience. Here's why that's a terrible idea, March 30, 2015", "Fortune, What Carly Fiorina's Multiple Career Screw-Ups Say About Her Leadership Skills, Aug. 19, 2015", "CNN Money, Forget what Trump says about Fiorina's face. Her HP record is the issue, Sept. 10, 2015", "New York Times, Carly Fiorina’s Business Record: Not So Sterling, Aug. 17, 2015", "Carly for America, Who is Jeffrey Sonnenfeld, Aug. 15, 2015", "Bloomberg, What Brought Carly Fiorina Down at HP is Her Greatest 2016 Asset, April 30, 2015", "Wall Street Journal, 'The Apprentice' Is Real, Not Some 'Gong' Show, March 10, 2014", "NBC, Carly Fiorina's new memoir well-timed, Oct. 8, 2006", "New York Times, Ousted Executive Provides a Feminine Face to the McCain Campaign, June 6, 2008", "NBC, 'Apprentice' lessons for business students?, April 17, 2004", "Fortune, Why the ‘Dump Trump’ strategy is doomed, Aug. 22, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]