["By Eugene Kiely and D'Angelo Gore", "Posted on October 25, 2018", "Editor’s Note: For weeks, President Donald Trump has been campaigning in states that are key to the Republican Party’s chances of maintaining control of the House and Senate. We have reviewed seven speeches he gave from Oct. 10 to Oct. 22. This is the first in a series of stories on his speeches.", "President Donald Trump is trying to make illegal immigration a key issue in the midterm elections. In Montana, which borders Canada, Trump tells supporters that “it’s going to be an election of the caravan,” referring to the several thousand Central American emigrants who are traveling to Mexico and the U.S. in search of refugee status.", "In seeking to motivate his supporters to vote Republican, Trump makes wildly inaccurate and baseless immigration claims about the “radical” Democrats — a term he used 38 times in seven speeches (36 times in referring to Democrats and twice in referring to “Islamic terrorists”).", "Trump warns his supporters that the “radical Democrat mob” has become the “party of crime” and wants to “throw your borders wide open to deadly drugs and ruthless gangs.” He accuses the Democrats – without evidence – of funding the migrant caravan, and falsely claims they want to give “illegal immigrants the right to vote.”", "His claims about the Democrats have become increasingly exaggerated. In Arizona, he jokes, “Next thing you know, they want to buy them a car.” And then he states, as a fact, the next day in Nevada: “They want to give them cars.”", "Here we look at some of the false, misleading and unsupported claims the president has made about immigration in seven speeches over 12 days, from Erie, Pennsylvania, to Missoula, Montana.", "To a predictable chorus of boos, Trump makes the baseless claim that Democrats “want to give illegal immigrants the right to vote.”", "Trump, Nevada, Oct. 20: That’s why Democrats want to give illegal immigrants the right to vote. I’ll tell you, we’ll go down fighting for that one. Can you imagine? People — you know, the vote was always so sacred. Now you see these things where they want the right to vote. They want the right to vote. There’s one town in California where they want to take over the — illegal immigrants want to take over the control of the board that runs the town, all illegal immigrants. And, you know, you would think they’re kidding. Seriously, would you even believe this? And they are serious.", "It is against the law for noncitizens to vote in federal elections, and the Democratic leadership in the House and Senate have not proposed to change that.", "At the local level, voters in San Francisco approved a measure in 2016 that will allow noncitizen residents with children to vote in school board elections. The city council of College Park, Maryland, also came close in 2017 to allowing noncitizen residents to vote in citywide elections, but the measure didn’t receive enough votes to pass.", "That still isn’t evidence of a national or even statewide push to allow immigrants in the country illegally to vote. We also aren’t aware of a California town where the board members are “all illegal immigrants,” and the White House did not identify one when we asked.", "In 2015, Jhonny Pineda, a Huntington Park, California, council member, who is now mayor, appointed two of the city’s longtime residents, who are both living in the U.S. illegally, to two city commissions. Pineda issued a statement that said the men, Julian Zatarain and Francisco Medina, “are eligible to serve on the city commissions as long as it is solely volunteer work and both individuals do not receive financial benefits from the city.”", "Zatarain was appointed to the Parks and Recreation Commission and Medina was appointed to the Health and Education Commission. Those are just two of the city’s six commissions that advise the five-person city council on a number of issues.", "It was in Nevada, too, where Trump fabricated the claim that Democrats want to give “illegal immigrants” cars.", "A staple of the president’s stump speech is his distorted tale of Sayfullo Saipov — the Uzbekistan national who has been charged with killing eight people when he drove his truck into a crowd of pedestrians, bicyclists and joggers along the Hudson River in New York City on Oct. 31, 2017, according to the indictment.", "In speeches on Oct. 22 in Texas, Oct. 19 in Arizona and Oct. 13 in Kentucky, the president claims — without evidence — that Saipov used “chain migration” to bring 22 relatives to the United States. There’s no evidence that Saipov brought even one relative to the country.", "Trump, Kentucky, Oct. 13: He came in, and then he took chain migration, and he brought his mother, and his father, and his brother, and his sister, and his aunt, and his grandfather. None of them working. It ended up being approximately 22 people who came in. It’s called a chain. Isn’t that wonderful? A chain.", "Trump, Texas, Oct. 22: So he has 22 people that came in, because he’s here. So he’s here, it’s called chain, a chain, nice name, chain migration. He’s here. His mother comes with him, his father then comes, his uncle, his aunt, his brother, his nephew, his sister. 22 people. No jobs. Just 22 people.", "Trump is referring to a family-based immigration program that allows U.S. citizens and legal permanent residents, or green-card holders, to sponsor family members for permanent U.S. residency — as First Lady Melania Trump did in sponsoring her parents, who later became naturalized U.S. citizens. Melania Trump became a U.S. citizen in 2006.", "But there is no evidence that Saipov brought any family members to the U.S. Trump claims that Saipov’s “mother comes with him, his father then comes,” but that’s not true. Saipov’s father and mother — Habibullo Saipov and Muqaddas Saipova — were living in Uzbekistan at the time of the attack, as reported by the Daily Mail and the Wall Street Journal.", "Princeton University Professor Marta Tienda, a demographer who has studied family sponsorship, called Trump’s claim an “implausible exaggeration” when we wrote about it earlier this year.", "As we wrote in April, Saipov arrived in the U.S. through the Diversity Immigrant Visa Program in 2010, and he was a green-card holder, or legal permanent resident, at the time of the attack, according to state and federal officials. Green-card holders “may petition for certain family members to immigrate to the United States as permanent residents,” according to the U.S. Citizenship and Immigration Services. But those “certain family members” include only a spouse and children. Saipov married after he came to the United States, so it is possible he did not sponsor any family members. DHS has declined to comment, citing privacy laws, and Saipov’s court-appointed attorney did not respond to our request for information.", "At his rallies, Trump routinely mocks the Diversity Immigrant Visa Program as a “visa lottery,” falsely claiming that other countries abuse the visa program “to dispose of their problems,” as he said in Texas.", "Trump, Texas, Oct. 22: That’s why they support visa lottery. You know what visa lottery is? Countries put names in a batch and you pick ’em. You pick ’em. You keep picking them. And then you got nothing but problems, because you think those countries are putting their finest? I don’t think so. It’s a great way to dispose of their problems. Visa lottery.", "Trump, Ohio, Oct. 12: Right now, we have a system, lottery, a lottery. Think of it, lottery. Oh, pick ’em, I wonder? What people do you think these countries are putting in? Do you think they’re putting in their finest? I don’t think so. I don’t think so. So we’re going to end it.", "Trump grossly misrepresents the Diversity Immigrant Visa Program, which uses a computer lottery system to randomly issue up to 50,000 immigrant visas each year to qualified applicants from countries with low rates of immigration to the United States.", "As we wrote last year, the visa applicants — not their governments — submit the applications to the U.S. Also, the applicants are vetted by numerous U.S. agencies and officials — as are those applying for other visa programs.", "Eligible diversity visa applicants must demonstrate to the U.S. that they have a high school education or its equivalent or “two years of work experience within the past five years in an occupation that requires at least two years of training or experience to perform.” There are more than a dozen grounds of inadmissibility, including health issues, criminal activity, national security concerns and the “likelihood of becoming a public charge,” meaning “a person who is primarily dependent on the government for subsistence.”", "“The diversity lottery is a true lottery,” Stephen W. Yale-Loehr, who teaches immigration law at Cornell Law School, told us for our previous story. “There is no way a foreign government can game the lottery to offload the worst of their citizenry.”", "As we mentioned earlier, Trump portrays the Democratic Party as being taken over by “radicals” who want to “abolish ICE” and “have open borders.” In Ohio, Trump said, “The new platform of the Democrat Party is to abolish ICE.” In Texas, he said, “They’re for open borders, which means crime, and for massive tax cuts.”", "But, as we wrote, Democrats are not advocating open borders. Yes, some liberal Democrats have called for abolishing Immigration and Customs Enforcement — angered by the administration’s “zero tolerance policy,” which caused the separation of children and parents crossing the border illegally. But these rank-and-file Democrats — not the party leaders — have also called for transferring many of ICE’s functions to other government agencies. Rep. Mark Pocan of Wisconsin sponsored a bill — “Establishing a Humane Immigration Enforcement System Act” — that would do just that. It has eight cosponsors.", "Senate Minority Leader Chuck Schumer and House Minority Leader Nancy Pelosi have both called for the immigration functions to be restructured and not abolished. “No one can watch ICE play such a central role in the heartbreak and horror of family separation without reasonably concluding that a drastic overhaul of its immigration functions is desperately needed, and soon,” Drew Hammill, Pelosi’s spokesman, said in a statement.", "In his speeches, the president also falsely blames the Obama administration for the rise of the transnational gang Mara Salvatrucha, or MS-13, in the United States, and exaggerates his efforts to deport gang members.", "Trump, Ohio, Oct. 12: These towns are being liberated of the MS-13 garbage that came into our country. Under the previous administration, by the way. And they came in by the tens of thousands — well, we have set every record on getting them out.", "Trump, Texas, Oct. 22: They came in through the wonderful Obama administration. We removed thousands and thousands of these people.", "The fact is MS-13, which is a “primarily El Salvadoran” gang, formed long before the Obama administration, and there’s no evidence that its membership grew during the Obama years. The gang originated in Los Angeles in the 1980s, according to a 2005 National Gang Threat Assessment report funded by the Justice Department. Attorney General Jeff Sessions estimated its members number more than 10,000 — a figure the department has been using since 2006. We covered all of this in our article “Trump’s MS-13 Miss.”", "Trump also exaggerates when he claims his administration has “removed thousands and thousands” of MS-13 gang members. The administration has put a priority on the gang — but cannot provide any evidence that “thousands and thousands” have been removed from the country.", "Alysa Erichs, acting deputy executive associate director of Homeland Security Investigations, told a Senate subcommittee that there have been 1,450 criminal and administrative arrests of MS-13 members from the beginning of fiscal year 2017, which started Oct. 1, 2016, through May 3, 2018. That time span includes nearly four months under President Obama and nearly 16 under Trump. A Department of Homeland Security spokesperson told us that those are the most current figures available. The spokesperson also said ICE does not track how many MS-13 members are deported.", "There are roughly 7,000 Honduran and Guatemalan emigrants traveling to Mexico and the U.S. in the hopes of seeking refugee status. The United Nations says that, as of Oct. 23, 1,500 of them have applied for refugee status in Mexico.", "Trump portrays this “caravan” as a threat to national security and accuses the Democrats of financing the caravan, repeatedly reminding his supporters that this midterm is “going to be an election of the caravan,” as he put it in Montana.", "While making a gesture of money being handed out, Trump claimed in Texas — without any evidence — that the Democrats “had something to do with” funding the Central American emigrants. He not only has made this claim at rallies, but also in a tweet.", "Trump, Nevada, Oct. 20: The Democrats want caravans. They like the caravans. A lot of people say, I wonder who started that caravan?", "Trump, Texas, Oct. 22: Do you know how the caravan started? Does everybody know what this means? I think the Democrats had something to do with it.", "This unfounded conspiracy theory, as we have written, began with an Oct. 17 tweet by Rep. Matt Gaetz, who posted a grainy video of the Central American emigrants receiving something — money? — from two men. Gaetz, who said he received the video from a “Honduran government official,” questioned if the money came from mega Democratic donor George Soros. But Gaetz provided no evidence for his claim about Soros during an appearance on CNN’s “State of the Union,” saying only it would be a problem if it were happening.", "Trump implemented his “zero tolerance policy” for families crossing the border illegally because he was frustrated with federal laws that allow some of them to seek refugee status and stay in the U.S. until their cases are heard. But the president goes too far when he claims the U.S. is required to accept all people who illegally cross the border into the U.S.", "Trump, Montana, Oct. 18: We have the worst laws anywhere in the world. We have the dumbest laws anywhere in the world. Somebody comes in and we say, excuse me, a foot hits the ground. You know, if a foot hits the ground, we’re not allowed to say, hey, go back. Every other country in the world, they say go back. Can’t come in. Sorry.", "A foot hits the ground, we have to by law, with these horrible people that are making their own rulings, having nothing to do with our Constitution, we have to take those people in, even if they’re, criminals and we have hardened criminals coming in. You think those people are perfect? They’re not perfect.", "It’s inaccurate for the president to claim the U.S. is required to “take those people in” who illegally set foot in the U.S.", "“It’s not true that we have to take them in, but we do have to allow them the opportunity to apply for asylum,” said Sarah Pierce, a policy analyst at the Migration Policy Institute. “It’s definitely a misleading statement at the very least,” Pierce said of Trump’s claim.", "As the Congressional Research Service explains in an August 2018 report, “the Immigration and Nationality Act (INA) establishes a number of avenues by which various categories of aliens can be denied entry or removed from the United States.”", "Typically, the report says, officials will place unauthorized immigrants found in the interior of the U.S. into formal removal proceedings, which involve going before an immigration judge within the Justice Department’s Executive Office of Immigration Review. But officials can also use an expedited removal process “without a hearing or further review” for certain individuals stopped at or near the U.S. border who do not have “valid entry documents or [have] attempted to procure [their] admission by fraud and misrepresentation.”", "However, expedited removal is not allowed, as Pierce indicated, if the person wishes to apply for asylum, a form of protection for those who can’t or won’t return to their home country because of persecution or a well-founded fear of persecution. In that case, they are granted an interview with U.S. Citizenship and Immigration Services to determine if they meet the requirements for a credible fear exemption. If they do, they are placed in formal removal proceedings where they are able to apply for asylum or related protections.", "Another CRS report from September notes that “expedited removal accounts for a substantial portion of the alien removals each year,” and that Trump issued an executive order in January 2017 directing DHS to up its use of expedited removal. “The agency has yet to promulgate regulations implementing this directive,” CRS says.", "The same report explains that the U.S. does not have to allow certain non-Canadian nationals arriving from Canada to apply for asylum. Instead, they are to be returned to Canada, where they can apply for protection in that country.", "Trump repeats his assertion that a proposed wall along the U.S.-Mexico border will stop the flow of illegal drugs coming from Mexico. That’s not realistic, experts say, because the vast majority of illicit drugs comes through legal ports of entry.", "Trump, Montana, Oct. 18: You don’t have the wall, you don’t have a border. What you have is you have infiltration of drugs like you’ve never seen.", "The fact is that Mexican cartels “transport the bulk of their drugs over the Southwest Border through ports of entry (POEs) using passenger vehicles or tractor trailers,” the Drug Enforcement Administration said in a 2015 report. “The drugs are typically secreted in hidden compartments when transported in passenger vehicles or comingled with legitimate goods when transported in tractor trailers.”", "John Kelly, Trump’s chief of staff, acknowledged at a congressional hearing in April 2017, when he was Department of Homeland Security secretary, that illegal drugs from Mexico “mostly comes through the ports of entry.” At the hearing, Kelly said “the big issue really right now in drugs coming into the United States is the ports of entry.” He talked about the need to improve technology – such as density meters – that can “look” into vehicles for signs of drugs packed into tight areas.", "Experts we interviewed last year for our story “Will Trump’s Wall Stop Drug Smuggling?” didn’t think the wall would make much of a dent in the drug trade. In addition to the fact that most drugs come hidden in trucks and cars that pass through legal ports of entry, Stephen D. Morris, a Middle Tennessee State University political science professor whose research has largely focused on Mexico, and Peter Reuter, a University of Maryland criminal justice professor who founded and directed RAND’s Drug Policy Research Center from 1989 to 1993, told us that smugglers adapt to U.S. attempts to stop the drug trade. Vanda Felbab-Brown, a senior fellow at the Brookings Institution who writes about the illegal drug trade, said simply, “The wall won’t stop the flow of drugs into the United States.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]