["State Sen. Stephen Martin was recently asked to weigh in on controversial comments by GOP Lieutenant Governor candidate E.W. Jackson that denounced the Ku Klux Klan, Planned Parenthood and the Democratic Party in the same breath.", "In defending Jackson, Martin sparked a controversy of his own.", "\"The fact is that both the KKK and Planned Parenthood are creations of the Democratic Party,\"", "Martin, R-Chesterfield, said in a May 23 interview with the Richmond Times-Dispatch.", "We decided to check whether the KKK really was spawned by the Democratic Party. We’ll post another Truth-O-Meter that examines Martin’s contention Planned Parenthood was created by Democrats.", "When we asked Martin for the facts behind his KKK statement, he said he had misspoken.", "\"What I should have said is it was started by Democrats, not by the Democratic party,\" the senator said. \"It wasn’t an official subdivision of the party, obviously … It was definitely founded by Democrats.\"", "Soon after our conversation, Martin released a statement saying he \"regretted the carelessness and inaccuracy\" of his comments regarding the KKK, calling his statement an \"impromptu\" response to questions about Jackson’s comments that Planned Parenthood has been more lethal to blacks than the KKK.", "PolitiFact Virginia respects when people tell us they erred, but we still feel obliged to complete our fact checks of their statements. So we asked several historians about the origins of the KKK.", "Details about the hate group’s founding are murky -- including the exact year it began. Some cite 1865 as its start, others say it was 1867. Historians generally agree it was founded by a handful of Confederate veterans in Pulaski, Tenn. as a social fraternity and it quickly changed into a violent group that terrorized newly empowered black and white Republicans in the South.", "J. Michael Martinez, the author of a 2007 book \"Carpetbaggers, Calvary and the KKK,\" told us many angry Southern whites during the 1860s and 1870s were Democrats and a smaller number of them joined the KKK.", "So there is some historic link between Democrats and the KKK. But Martinez said it is misleading to say that the hate group was started by the Democratic Party because it was more of a grassroots creation.", "There’s another point to consider.", "\"To say that the Ku Klux Klan was started by the Democratic Party -- it’s not the Democratic party of today,\" Martinez said. \"(From the) 1930s until today, you think of the Democratic Party being considered the party of the disenfranchised.\"", "Other historians had similar takes.", "Carole Emberton, an associate professor of history at the University at Buffalo, wrote in an email that various \"Klans\" that sprung up around the South acted as a \"strong arm\" for many local Democratic politicians during Reconstruction. Confederate General Nathan Bedford Forrest -- believed to be the KKK’s first Grand Dragon -- even spoke at the 1868 Democratic National Convention, said Emberton, author of \"Beyond Redemption: Race, Violence and the American South after the Civil War.\"", "But Emberton added a major caveat:", "\"The party lines of the 1860s/1870s are not the party lines of today,\" she wrote to us. \"Although the names stayed the same, the platforms of the two parties reversed each other in the mid-20th century, due in large part to white ‘Dixiecrats’ flight out of the Democratic Party and into the Republican Party after the passage of the Civil Rights Act of 1964. By then, the Democratic Party had become the party of ‘reform,’ supporting a variety of ‘liberal’ causes, including civil rights, women’s rights, etc. whereas this had been the banner of the Republican Party in the nineteenth century.\"", "Elaine Frantz Parsons, an associate professor at Duquesne University in Pittsburgh said that most post-Civil War southern whites were Democrats who were unhappy with Republican policies on Reconstruction while large numbers of newly-freed slaves were Republicans.", "\"So it is not surprising that the Reconstruction era Klan would have been very largely Democrats attacking Republicans,\" Parsons said in an e-mail. \"But this simply does not map well at all onto the party structure we know today. Among other things, the Republicans (during Reconstruction) were condemned as the party of big government and as wanting to centralize authority on the federal level.\"", "Our ruling", "Martin said the KKK was created by the Democratic Party. He acknowledged he was wrong.", "Historians say the KKK consisted of a group of Southern whites after the Civil War who were Democrats. But there’s no evidence the KKK was created by their political party.", "It should also be noted that the anti-black Democratic Party of the 1860s and 1870s bears no similarity to the party of today.", "Recognizing that Martin has expressed regret for his statement. We rate his claim False.", "Sen. Stephen Martin’s comments to the Richmond Times Dispatch, May 23, 2013.", "Interview with Sen. Stephen Martin, May 25, 2013.", "E-mail from Sen. Stephen Martin, May 29, 2013.", "Eric Foner, Reconstruction: America’s Unfinished Revolution, 1988.", "Interview with J. Michael Martinez, political science professor at Kennesaw State University, June 5, 2013.", "E-mail from Carole Emberton, associate professor of history at the University of Buffalo, June 4, 2013.", "E-mail from Elaine Frantz Parsons, associate professor at Duquesne University, June 5, 2013.", "Interview with Mark Potok, senior fellow at the Southern Poverty Law Center, June 4, 2013.", "Richmond Times-Dispatch, \"Martin stands by controversial comments,\" May 30, 2013.", "Richmond Times-Dispatch, \"Jackson defends controversial comments,\" May 24, 2013.", "The History Channel, \"Ku Klux Klan,\" accessed June 7, 2013.", "The Southern Poverty Law Center, \"Ku Klux Klan,\" accessed June 7, 2013.", "PBS, \"Rise of the KKK,\" accessed June 7, 2013.", "PolitiFact Virginia, \"E.W. Jackson’s statement on the Democratic Party,\" May 30, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]