["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "As Covid-19 vaccines were rolled out across the world, misinformation was rife across social media platforms. In March 2021, a number of social media users claimed that they had seen online posts that claimed drinking in between COVID-19 vaccine doses will impair the efficacy of the immunization.", "A look through guidelines published by the Centers for Disease Control and Prevention (CDC) showed that there does not appear to be an official government assessment or recommendation on whether drinking alcohol can hamper the vaccine efficacy. We’ve contacted the agency for comment and will update the article accordingly.", "Three Covid-19 vaccines have been approved by the U.S. Food and Drug Administration (FDA) for emergency use, two of which require two doses administered over the course of about a month. In an email to Snopes, the FDA said that the agency did not have data on whether alcohol may impair the effectiveness of any of the three COVID-19 vaccines.", "“The safety and efficacy data submitted by sponsors of currently FDA-authorized COVID19 vaccines did not include how or whether alcohol affects their vaccine. You should reach out to each manufacturer to determine if they are studying this issue,” wrote the FDA.", "None of the emergency use authorizations issued by the FDA to Moderna, Pfizer and Johnson & Johnson mentioned alcohol once, so we contacted each manufacturer for further clarification. Only Pfizer has responded as of the time of this writing, telling us there is no evidence from its study that alcohol use impairs the effectiveness of the vaccine.", "\"The clinical trials for the COVID-19 vaccines authorized for emergency use by the FDA did not exclude participants who consume alcoholic beverages. We have no evidence that moderate consumption of alcoholic beverages would impact the effectiveness or safety of COVID-19 vaccines or other vaccines that FDA has approved to prevent infectious diseases,\" wrote an FDA spokesperson in an email. \"However, it is well established that chronic, excessive alcohol consumption can be detrimental to an individual’s health, affecting, but not limited to the heart, liver and immune system.\"", "Though we have not yet heard back from the other vaccine producers, many health experts note that it is unlikely that consuming alcohol will have an effect on the COVID-19 vaccine’s effectiveness — but that doesn’t necessarily green light boozy nights while undergoing a vaccination regime.", "“Currently, no formal recommendations say to avoid alcohol before or after receiving the COVID-19 vaccines. Studies have shown heavy drinking can weaken the immune system. Long-term alcohol abuse is especially harmful. Still, these studies didn’t involve the new COVID-19 vaccines. So the concern for alcohol interfering with the immune response to COVID-19 vaccination is only theoretical,” said Dr. Angela Hewlett, an infectious disease expert, in a factsheet published by Nebraska Medicine.", "“However, symptoms from the immune response to the vaccine, like fever, body aches and others, are common. Heavy drinking may increase these side effects, making you feel worse. Bottom line – a celebratory drink is probably okay but celebrate in moderation. And stay tuned for any new recommendations on this topic.”", "At the time of this writing, more than 36.9 million people have been fully vaccinated against the virus, according to data provided by the CDC.", "We will update this article with more information as we receive it.", "Update [March 24, 2021]: This article was updated to include comments from an FDA spokesperson.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]