["This video, which was uploaded to YouTube on January 27, 2020, had been viewed more than 700,000 times before it was removed.", "The video, titled “Kobe Bryant Daughter Gianna Bryant Final Hours”, was published one day after Bryant and 13-year-old Gianna died in a helicopter crash in Calabasas, California, on January 26, as reported here by AFP.", "Below is a screenshot of the misleading post:", "Videos of the same scene, some shot from a slightly different angle, were viewed tens of thousands of times here, here, here and here on YouTube, and here on Facebook.", "The claim is false. Keywords in the comment section underneath the misleading post found this longer version of the video, titled “Ariana’s Honor Walk”, which was uploaded to YouTube on September 4, 2019.", "The video's caption states a 28-year-old woman named Ariana was declared brain dead following a car crash in Downey, California in August 2019. Her family subsequently decided to donate her organs, the caption adds.", "The caption states in part: \"Ariana had a spark like no other. She was a happy and caring 28 year old who many confused as teenager due to her spunk, laughter and her childlike antics. She was always doing what she could to make you laugh, but one evening on 8/29/2019, our lives would change forever.", "\"She was on her way to the arcade to meet up with friends with her boyfriend, and as they were crossing an intersection in the city of Downey, California, a distracted driver, ran a red light and struck Ariana and her boyfriend, Jason. Upon arrival to the hospital, Jason died 2 hours later from severe head trauma and on 8/30/2019, Ariana was also declared brain dead due to severe head trauma as well.\"", "Below is a screenshot comparison of the video in the misleading post (L) and the September 2019 video (R):", "An honor walk is a ritual in US hospitals where people pay tribute to patients who are donating their organs to others, according to this New York Times article.", "Pacific Attorney Group, which represents victims of car accidents in California, published this article about Ariana Cervantes’ death on September 12, 2019.", "The article, titled “Ariana Cervantes Identified as 1 of 2 Killed in Pedestrian Accident at Imperial Highway and Barlin Avenue in Downey”, states in part: “One of the pedestrians killed after a traffic collision that happened late last month has been identified as 28-year-old Ariana Cervantes, according to authorities.", "“The deadly crash happened at around 8:07 p.m. Wednesday, August 28th at Imperial Highway and Barlin Avenue. As per the CHP officials, a man and a woman were struck by a vehicle near the intersection for reasons yet to be determined.”", "The Californian edition of the Legal Advocate, a legal news site, published this similar report on September 11, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]