["Bharatiya Janata Party (BJP) Assam MLA Himanta Biswa Sarma claimed that ‘Pakistan zindabad’ slogans were raised while welcoming All India United Democratic Front (AIUDF) chief Maulana Badruddin Ajmal at Silchar airport. “This thoroughly exposes @INCIndia which is encouraging such forces by forging an alliance,” he wrote. AIUDF will contest the 2021 Assam assembly election in alliance with Congress and the Left Front.", "Look at the brazenness of these fundamentalists anti-national people who are shouting PAKISTAN ZINDABAD while they welcome MP @BadruddinAjmal.", "This thoroughly exposes @INCIndia which is encouraging such forces by forging an alliance. We shall fight them tooth & nail. Jai Hind🇮🇳 pic.twitter.com/CiHZjDweFF", "— Himanta Biswa Sarma (@himantabiswa) November 6, 2020", "BJP MLAs Ashok Singhal and Rajdeep Roy tweeted the same.", "This slideshow requires JavaScript.", "CNN News18 correspondent Payal Mehta also shared the video claiming pro-Pakistan chants were raised.", "Anti India slogans shouted at Silchar Airport ahead of @AIUDFOfficial chief @BadruddinAjmal arrival yesterday… Pakistan Zindabad slogans shouted@himantabiswa @drrajdeeproy pic.twitter.com/cdcCSBF4v8", "— Payal Mehta/પાયલ મેહતા/ पायल मेहता/ পাযেল মেহতা (@payalmehta100) November 6, 2020", "Assamese news outlet News Live published a report on Badruddin Ajmal’s arrival at the airport and promoted the identical narrative. The channel is run by Himanta Biswa’s wife. Former editor-in-chief of News Live Atanu Bhuyan also tweeted that ‘Pakistan zindabad’ slogans were raised to welcome Ajmal.", "শিলচৰত বদৰুদ্দিনৰ সমৰ্থকৰ ‘পাকিস্তান জিন্দাবাদ’ ধ্বনি", "অসমত ভয়ংকৰ ঘটনা। শিলচৰত বদৰুদ্দিনৰ সমৰ্থকৰ ‘পাকিস্তান জিন্দাবাদ’ ধ্বনি।", "#NewsLive #AssamNews #PakistanZindabadSlogans #BadruddinAjmal #Silchar #SilcharShocker #AIUDF #ArrestPakSupporters", "Posted by News Live on Thursday, 5 November 2020", "Times Now reported that BJP claimed ‘anti-India’ slogans were raised upon Ajmal’s arrival however, AIUDF termed this is a ‘political conspiracy’. A channel correspondent however, asserted that party supporters sloganeered ‘Pakistan zindabad’.", "BJP tweets video of Anti-India slogans being allegedly chanted at Silchar Airport before the arrival of AIUDF chief @BadruddinAjmal.", "Listen in to more details from TIMES NOW’s Arindam. pic.twitter.com/Z5uJcxZB9W", "— TIMES NOW (@TimesNow) November 6, 2020", "Asianet Bangla and Hindi, The New Indian Express (TNIE) and CNN News18 also reported the purported news. TNIE however included statements by AIUDF spokesperson Aminul Islam and Cachar Superintendent of Police BL Meena. “Our supporters shouted Ajmal zindabad, AIUDF zindabad slogans. The charge that they shouted Pakistan zindabad slogan is a political conspiracy hatched against us by the BJP. We have sought a probe into the incident,” claimed Islam while the police said that they are examining the video.", "This slideshow requires JavaScript.", "Upon closely listening to the audio, Alt News found that ‘Aziz Khan zindabad’ and not ‘Pakistan zindabad’ was chanted by AIUDF supporters. We found a clearer video of Ajmal’s welcome outside Silchar airport. This was uploaded on November 5. According to myneta.info, Aziz Ahmed Khan is an AIUDF MLA from Assam. Readers are requested to use earphones while listening to the audio.", "শিলচর বিমান বন্দরে উপস্তিত এআইইউডিফ সুপ্রীম বদর উদ্দিন আজমল সাহেব #AIUDF প্রধানকে স্বাগত জানাতে শিলচর বিমানবন্দরে হাজার হাজার জনতা।", "Posted by Ahmed Saleh Barbhuiya on Thursday, 5 November 2020", "AIUDF issued a press statement that ‘Aziz Khan zindabad’ slogans were raised outside the airport. “We have been watching news run by News Live since the morning. Himanta Biswa Sarma is the owner of News Live. The channel claimed that our supporters raised the slogans of ‘Pakistan zindabad’. This is completely false. People were raising slogans of Badruddin zindabad, AIUDF zindabad…we have other MLAs and slogans of their names were also raised. Slogans of Aziz Khan zindabad were also raised and it is being claimed that chants of Pakitsan zindabad were raised. This is political conspiracy to break the alliance that we will get into with Congress and Left parties.”", "Press Statement by AIUDF on cheap politics by BJP, how they along with a section of media distorted the slogan ‘Aziz Khan Zindabad’ into ‘Pakistan Zindabad’. pic.twitter.com/obzPASSLNg", "— AIUDF Official (@AIUDFOfficial) November 6, 2020", "Speaking with Alt News, Ajmal confirmed that the slogans in the viral video were in fact mentioning him and further said, “Slogans of Pakistan zindabad were not raised. Several MLAs were present with me when AIUDF chief arrived. Supporters were raising slogans in their favour. They want to damage our reputation with the false claim that Pakistan zindabad slogans were raised. We will take strict action against those [spreading misinformation].”", "Ajmal also shared a photograph of himself outside Silchar airport when Ajmal arrived.", "News reports claiming that ‘Pakistan zindabad’ slogans were raised by supporters of AIUDF chief Maulana Badruddin Ajmal at Silchar airport are false. The crowd was chanting ‘Aziz Khan zindabad’. That Pakistan zindabad slogans were raised by leaders of opposition parties is a recurring pattern of misinformation. AIMIM and Congress have also been targetted with similar false claims. During protests against the Citizenship Amendment Act (CAA) in Lucknow, organised by AIMIM, misinformation that protestors chanted ‘Pakistan zindabad’ slogans was promoted by BJP IT cell head Amit Malviya. However, the crowd was rasing the slogan ‘Kasif Saab zindabad’ in reference to the Lucknow AIMIM chief.", "Update: BJP IT cell head Amit Malviya tweeted the video after this fact-check was published. He promoted the false claim.", "Badruddin Ajmal is welcomed at Silchar airport with Pakistan Zindabad slogans. He is someone Congress desperately wants to ally with in Assam…", "Now expect some tone deaf fact checkers to tell us that it was ‘Aziz Khan Zindabad’ and not Pakistan while Assam police investigates. pic.twitter.com/FB64mgGTLC", "— Amit Malviya (@amitmalviya) November 6, 2020", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]