["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump accused Hillary Clinton of trying to delete part of her personal history during a June 22, 2016, speech that focused in part on the Trans-Pacific Partnership trade deal.", "Clinton tried to promote the deal as President Barack Obama’s secretary of state, but she withdrew her support for the 12-nation pact in October 2015 amid sharp criticism from Democratic primary opponent Bernie Sanders.", "In his speech, Donald Trump took credit for getting her to change her mind and accused her of trying to cover up her support.", "\"Hillary Clinton has also been the biggest promoter of the Trans-Pacific Partnership, which will ship millions more of our jobs overseas — and give up congressional power to an international foreign commission,\" Trump said. \"Now, because I have pointed out why it would be such a disastrous deal, she is pretending that she is against it.", "\"She has even deleted this record of total support from her book,\" he said, adding, \"deletion is something she is very good at,\" a reference to the tens of thousands of emails she deleted on her home internet server.", "Did Hillary Clinton actually censor her own book to hide her past support for the trade agreement that has since come under fire?", "We contacted the Trump campaign asking for its facts to back up the claim. They didn't respond to our query.", "For starters, there is no evidence that any of Trump's comments have influenced Clinton's thoughts on the treaty.", "As for the treaty itself, Clinton offered support for it in 2012, long before the deal was finalized. She hailed the deal as \"setting the gold standard\" during a 2012 speech in Australia, to name just one example. She now says she was, at the time, trying to sell the deal to U.S. allies as a member of the Obama administration.", "The deal was reached in October 2015, well after Clinton departed as secretary of state, and signed the following the February.", "During her debates with Sanders, Clinton said she had waited until the deal was actually negotiated before ultimately deciding to oppose it. Because of her early supportive comments, we rated her statement Half True.", "So what, if anything, did she say about the deal in her book Hard Choices?", "The book was published in June 2014, with a deal still more than a year away.", "On pages 77 and 78 of hardcover edition, she said the deal \"would link markets throughout Asia and the Americas, lowering trade barriers while raising standards on labor, the environment, and intellectual property.\"", "Clinton also refers to it as \"important for American workers, who would benefit from competing on a more level playing field. And it was a strategic initiative that would strengthen the position of the United States in Asia.\"", "\"Because TPP negotiations are still ongoing, it makes sense to reserve judgment until we can evaluate the final proposed agreement,\" she wrote, echoing the stance she would take when Sanders criticized her support for the deal. \"It’s safe to say that the TPP won’t be perfect—no deal negotiated among a dozen countries ever will be—but its higher standards, if implemented and enforced, should benefit American businesses and workers.\"", "So how much of this did Clinton delete from the paperback edition, which the publisher says was trimmed to accommodate the smaller size?", "Nothing.", "The pages are now renumbered as 69 and 70, but the content is the same.", "We found one reference to the TPP that was cut. Here it is from page 254, in a chapter dealing with Latin American issues:", "So we worked hard to improve and ratify trade agreements with Colombia and Panama and encouraged Canada and the group of countries that became known as the Pacific Alliance -- Mexico, Colombia, Peru, and Chile -- all open-market democracies driving toward a more prosperous future to join negotiations with Asian nations on TPP, the trans-Pacific trade agreement. The Alliance stood in stark contrast to Venezuela, with its more authoritarian policies and state-controlled economy.", "That's a description of trying to get other countries involved, not a ringing endorsement.", "Finally, Clinton came out in opposition to the deal after it was finalized in October 2015. By then, the paperback had been out for six months.", "Our ruling", "Trump said Hillary Clinton \"has even deleted this record of total support (for the Trans-Pacific Partnership trade agreement) from her book.\"", "The paperback removed a small reference to the TPP but the two pages that talked about it and why the agreement was important weren't deleted. The paperback edition continues to have text expressing support for the trade deal.", "Anyone who compares the hardcover and paperback versions of the book can see that the claim is ridiculous. We rate it Pants On Fire!", "Politico, \"Full transcript: Donald Trump NYC speech on stakes of the election,\" June 22, 2016", "Amazon, \"Hard Choices; Paperback — April 28, 2015,\" accessed June 22, 2016", "PolitiFact, \"Hillary Clinton says she didn't endorse the TPP trade deal until it was actually negotiated,\" Feb. 5, 2016, and \"Fact-checking 'Hillary Clinton lying for 13 minutes straight,'\" May 20, 2016", "Emails, Josh Schwerin, spokesman, Hillary Clinton campaign,", "NBC News, \"Fact Checking Trump's Speech,\" June 22, 2016 (original and updated versions)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]