["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The blue line shows the gradual growth of the minimum wage. The red line shows the wage's value when adjusted for inflation. The chart runs from 1947 to 2009. (Graph by data360.org)", "President Barack Obama has been talking a lot recently about the need to raise the minimum wage, particularly during a series of speeches on the economy. And when he does so, Obama almost always invokes President Ronald Reagan, an icon for conservatives.", "Obama said, \"We need to raise the minimum wage, because it's lower right now than it was when Ronald Reagan took office,\" Obama said in a speech at Knox College in Galesburg, Ill., on July 24, 2013.", "Obama has used almost the same exact talking point on a number of other occasions, including a speech in Chattanooga, Tenn., and various position papers.", "We were curious about two things. Is Obama right on the statistics? And is Obama’s attempt to link Reagan to a policy of maintaining a generous minimum wage an accurate historical portrayal?", "We should start by noting that the minimum wage, as written into law, is higher now than it was  when Reagan took office in 1981 -- since 2009, it’s been $7.25 an hour, compared to $3.35 in 1981.", "However, Obama was clearly referring to the inflation-adjusted minimum-wage rate. Here’s a summary of changes in the inflation-adjusted minimum wage during Reagan’s tenure. We calculated it using the Bureau of Labor Statistics’ inflation calculator.", "Year", "Minimum wage", "Wage in 2013 dollars", "1981", "$3.35", "$8.61", "1982", "$3.35", "$8.11", "1983", "$3.35", "$7.85", "1984", "$3.35", "$7.53", "1985", "$3.35", "$7.27", "1986", "$3.35", "$7.14", "1987", "$3.35", "$6.89", "1988", "$3.35", "$6.61", "1989", "$3.35", "$6.31", "2013", "$7.25", "$7.25", "So, Obama has a point when he says the inflation-adjusted minimum wage was higher when Reagan entered office than it is now.", "But that’s not the whole story. Over Reagan’s entire tenure, the minimum wage slowly eroded. In Reagan’s fifth year in office, it was almost identical to what it is today in terms of purchasing power. By Reagan’s sixth year as president, it dropped below today’s rate when adjusted for inflation. And by the time he left office, the minimum wage had fallen a full 13 percent below its level today.", "There’s a reason for this: Reagan never presided over a minimum wage increase during his term in office. In fact, he was the only president never to oversee a boost the minimum wage since it was signed into law in 1938 by Franklin D. Roosevelt.", "Democratic presidents weren’t the only ones to back minimum-wage increases. The minimum wage went up three times during the brief presidency of Gerald Ford, and each of Reagan’s fellow Republicans presided over at least one increase, including George W. Bush in 2007 and 2008. Reagan was the only exception.", "Our ruling", "When Obama said the minimum wage is \"lower right now than it was when Ronald Reagan took office,\" he offered a carefully worded statement that is accurate when considering inflation. However, his invocation of Reagan rings hollow, since the late president was hardly a model for Obama’s approach to the minimum wage.", "Reagan was the only president not to preside over an increase in the minimum wage, and by the end of his term, the wage was 13 percent lower than it is now. The statement is accurate but needs clarification or additional information, so we rate it Mostly True.", "Barack Obama, remarks at Knox College in Galesburg, Ill., July 24, 2013", "U.S. Department of Labor, \"History of Federal Minimum Wage Rates Under the Fair Labor Standards Act, 1938 - 2009,\" accessed July 31, 2013", "Bureau of Labor Statistics, inflation calculator, accessed July 31, 2013", "Congressional Research Service, \"Inflation and the Real Minimum Wage: A Fact Sheet,\" June 21, 2013", "Data360.org, graph of nominal and real minimum wage through history, accessed July 31, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]