["Most homicides for which the race of the victim and offender are known are intraracial, meaning they involve people of the same race.", "A Justice Department report on homicide trends from 1980 to 2008 said 84% of white homicide victims over that 28-year period were killed by other white people, and 93% of Black victims were killed by other Black people.", "More recent FBI homicide data puts the percentages in the same range.", "\"The View\" co-host Sunny Hostin slammed President Donald Trump and other conservatives who have cited Black-on-Black homicides to discredit protests of police violence against Black Americans, saying their critiques are missing a critical point about murder in the U.S.", "\"I hear that so much in conservative circles, and what people need to understand is that homicides are intraracial,\" Hostin said July 15. \"When you look at white-on-white crime, it's 84%. Right? Homicides. White people kill white people.\"", "\"But that term ‘white-on-white crime’ is never used,\" Hostin added. \"So why is ‘Black-on-Black crime’ used?\"", "As fact-checkers, we can confirm that Hostin’s claim about most homicides involving people of the same race is accurate, based on available data. So is the figure she cited for the percentage of white homicide victims who were killed by white people.", "\"The fact that (homicides) are predominantly intraracial is widely and deeply accepted in criminology and in police circles,\" said Jeffrey Fagan, professor of law at Columbia Law School and an expert on policing, crime and race.", "Experts previously told us homicides typically involve people who know each other, and people often marry, date, befriend and live with people of the same race.", "An ABC spokesperson said Hostin was talking specifically about homicides and citing data from a 2011 Justice Department report summarizing homicide trends from 1980 to 2008 — a report that, while slightly outdated, we’ve referenced in several fact-checks related to race and crime.", "The report found that between 1980 and 2008, 84% of white homicide victims were killed by other white people, and 93% of Black victims were killed by other Black people. An earlier report analyzing homicides between 1976 and 2005 had identified similar patterns.", "RELATED: Instagram graph misleads on the racial breakdown of homicides", "More recent federal data also puts the numbers in the same ballpark. In 2018, the most recent year for which FBI homicide data is available, about 81% of white victims were killed by white people, and about 89% of Black victims were killed by Black people.", "Here’s what the FBI’s annual crime reports show for the other years since 2008:", "There are caveats to the FBI’s homicide data, as we have previously reported. The data shows information on race only for cases involving a single victim and a single offender, and for cases where the race of both parties is known. Race can be tricky to record correctly, too.", "\"We can only estimate intraracial or interracial trends when we know who the (perpetrator) or suspect is,\" Fagan said. \"But we only know that in about two-thirds of all murders.\"", "The available data does support Hostin’s claim about white-on-white homicides. The co-host’s broader point — that homicides tend to be intraracial — also holds true.", "A 2019 Justice Department report found that most violent crime in 2018 was also intraracial. About 62% of violent incidents against white victims were committed by white people, and about 70% of violent incidents against Black victims were committed by Black people.", "Hostin said, \"Homicides are intraracial. When you look at white-on-white crime, it's 84%. Right? Homicides. White people kill white people.\"", "An ABC spokesperson clarified that Hostin’s 84% figure referred to the percentage of white homicides that involved white offenders. A 2011 report on data from 1980 to 2008 showed 84% of white homicide victims over that 28-year period were killed by white people.", "The report is almost 10 years old, but more recent annual data from the FBI also puts the percentage of white homicide victims killed by white offenders in the same range. Experts say most homicides where race information is known are intraracial.", "We rate this statement True.", "The View on YouTube, \"Trump Says White People Also Killed By Police | The View,\" July 15, 2020", "FBI Uniform Crime Reporting Program, \"Race, Sex, and Ethnicity of Victim by Race, Sex, and Ethnicity of Offender, 2018,\" accessed July 16, 2020", "FBI Uniform Crime Reporting Program, \"Race, Sex, and Ethnicity of Victim by Race, Sex, and Ethnicity of Offender, 2017,\" accessed July 16, 2020", "FBI Uniform Crime Reporting Program, \"Race, Sex, and Ethnicity of Victim by Race, Sex, and Ethnicity of Offender, 2016,\" accessed July 16, 2020", "FBI Uniform Crime Reporting Program, \"Race, Sex, and Ethnicity of Victim by Race, Sex, and Ethnicity of Offender, 2015,\" accessed July 16, 2020", "FBI Uniform Crime Reporting Program, \"Race, Sex, and Ethnicity of Victim by Race, Sex, and Ethnicity of Offender, 2014,\" accessed July 16, 2020", "FBI Uniform Crime Reporting Program, \"Race, Sex, and Ethnicity of Victim by Race, Sex, and Ethnicity of Offender, 2013,\" accessed July 16, 2020", "FBI Uniform Crime Reporting Program, \"Race, Sex, and Ethnicity of Victim by Race, Sex, and Ethnicity of Offender, 2012,\" accessed July 16, 2020", "FBI Uniform Crime Reporting Program, \"Race, Sex, and Ethnicity of Victim by Race, Sex, and Ethnicity of Offender, 2011,\" accessed July 16, 2020", "FBI Uniform Crime Reporting Program, \"Race, Sex, and Ethnicity of Victim by Race, Sex, and Ethnicity of Offender, 2010,\" accessed July 16, 2020", "FBI Uniform Crime Reporting Program, \"Race, Sex, and Ethnicity of Victim by Race, Sex, and Ethnicity of Offender, 2009,\" accessed July 16, 2020", "Bureau of Justice Statistics, \"Criminal Victimization, 2018,\" September 2019", "Bureau of Justice Statistics, \"Homicide Trends in the United States, 1980-2008,\" September 2011", "Bureau of Justice Statistics, \"Homicide trends in the United States,\" July 1, 2007", "PolitiFact, \"Instagram graph misleads on the racial breakdown of homicides,\" June 23, 2020", "PolitiFact, \"Trump's Pants on Fire tweet that blacks killed 81% of white homicide victims,\" Nov. 23, 2015", "PolitiFact, \"An updated look at statistics on black-on-black murders,\" May 21, 2015", "PolitiFact, \"Giuliani: 93 percent of black murders committed by blacks,\" Nov. 25, 2014", "PolitiFact, \"Allen West: More black-on-black murders in six months than by 'KKK' in 86 years,\" Nov. 27, 2013", "PolitiFact, \"A look at statistics on black-on-black murders,\" July 17, 2013", "Email interview with Lauri Hogan, spokesperson for ABC’s \"The View,\" July 16, 2020", "Email interview with Jeffrey Fagan, professor of law at Columbia Law School, July 16, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]