["About this rating", "O'Brien said during an interview that Vindman, like other NSC staff at the White House, would eventually be rotated back to his own department.", "However, O'Brien did not state that Vindman had been \"fired\" or \"removed\" from the NSC, nor did he offer a timeline for when Vindman would be rotated back to his department.", "On Oct. 29, 2019, U.S. Army Lt. Col. Alexander Vindman, who oversaw Ukraine policy at the White House in his role as Director for European Affairs for the United States National Security Council (NSC), famously testified to House impeachment investigators that he believed President Trump had undermined national security by appealing to Ukraine’s president to investigate his (i.e., Trump's) political rivals:", "Vindman told the committees he \"did not think it was proper\" for the president to insist that Ukrainian President Volodymyr Zelensky open investigations into Joe Biden and his son, Hunter Biden, as well as Burisma, the energy company that employed Hunter Biden. He said he reported his concerns to the lead counsel at the NSC.", "\"I realized that if Ukraine pursued an investigation into the Bidens and Burisma, it would likely be interpreted as a partisan play which would undoubtedly result in Ukraine losing the bipartisan support it has thus far maintained,\" Vindman said. \"This would all undermine U.S. national security.\"", "On Nov. 10, U.S. National Security Advisor Robert C. O'Brien was interviewed by host Margaret Brennan on the CBS Sunday morning news program \"Face the Nation\" and answered a question about Vindman's status in a way some people interpreted to mean that Vindman had been, or was about to be, \"fired\" from the NSC:", "Face the Nation's own Twitter feed helped stoke those rumors with a tweet declaring that Vindman would be \"removed\" from the NSC:", "VINDMAN OUT AT NSC: After testifying on the Hill, NSA O'Brien says Alexander Vindman will be removed from the National Security Council. \"Everyone who's detailed at the NSC, people are going...back to their own departments and we'll bring in new folks\" https://t.co/DNsbuDqAwb pic.twitter.com/nQ9U5lvxrG", "— Face The Nation (@FaceTheNation) November 10, 2019", "In fact, what O'Brien said on \"Face the Nation\" was more detailed and nuanced than simply declaring that Vindman would be \"fired\" or \"removed\" from the NSC imminently. As he explicated, personnel are temporarily detailed from other government departments and agencies to the White House to serve on the NSC, and eventually they are sent back to their own agencies and replaced by new detailees. Moreover, he stated, the current administration felt the NSC was \"bloated\" and wanted to reduce its headcount by about 50%. Therefore, Vindman -- like everyone else detailed to the NSC -- would at some indeterminate time in the future be rotated back to his department:", "Q: Lt. Col Vindman, who has testified under oath, is serving on the National Security Council currently. Will he continue to work for you despite testifying against the President?", "A: One of the things I talked about is that we're streamlining the National Security Council; it got bloated to like 236 people from up from 100 in the Bush administration under President Obama. We're streamlining the National Security Council. There are people that are detailed from different departments and agencies. My understanding is that Col. Vindman is detailed from the Department of Defense. So everyone who's detailed at the NSC, people are going to start going back to their own departments and we'll bring in new folks. But we're going to get that number down to around 100 people, that's what it was under Condoleezza Rice; she came and met with me, I met with a number of my successors [sic?]. We don't need to recreate the Department of Defense, the Department of State, the Department of Homeland Security, over at the White House. We've got great diplomats and soldiers and folks that do that work for us in their departments.", "Q: Just to button that up, though, you're saying Lt. Col. Vindman is scheduled to rotate out. You are not suggesting in any way that there will be retaliation against him?", "A: I never retaliated against anyone, so ...", "Q: But his time is coming to an end?", "A: There'll be a point for everybody who's detailed there that their detail will come to an end and they'll go back to their agency, and what we want them to do is take the experience and skills they learned at the White House, take it back to their departments and agencies, and do an even better job there. And so we're grateful that we can have these detailees come in, and they'll come spend a year, maybe a little bit more, at the White House, and they'll go back to their agency, and they'll do a better job at their agency.", "Later that day, CNN's Jim Acosta tweeted that Vindman was \"still at National Security Council\" for the time being:", "Lt. Col. Alexander Vindman is still at National Security Council, we are told. Earlier Sunday questions arose about whether Vindman, the NSC's top Ukrainian expert, was still in his role after Nat Sec Adv O'Brien talked to CBS about a natural rotation of people to and from it.", "— Jim Acosta (@Acosta) November 11, 2019", "CBS News correspondent Paula Reid also reported that Vindman's attorney stated he was not aware of any changes in his client's status, that Vindman \"still has a job,\" and that Vindman's detail was not scheduled to end until July 2020:", "MORE: @mikevolkov20 says, “Vindman is still detailed to NSC. We are not aware of any changes in his status. Obviously any retaliatory action against LTC Vindman on a day when we honor our military heroes would be reprehensible.” #VeteransDay @CBSNews @FaceTheNation", "— Paula Reid (@PaulaReidCBS) November 11, 2019", "How much longer Lt. Col. Vindman's tenure at the NSC lasts remains to be seen.", "A new chapter unfolded in this story on Feb. 7, 2020, when news first broke that Lt. Col. Vindman was \"ousted\" from his job and escorted from the White House.", "David Pressman, an attorney for Vindman, said in a statement, “The truth has cost Lt. Col. Alexander Vindman his job, his career, and his privacy.”", "CBS News.   \"National Security Adviser Robert O'Brien on Syria.\"\r\n    Face the Nation.   10 November 2019.", "Segers, Grace.   \"Alexander Vindman Testified That He Found Trump's Ukraine Call 'Troubling and Disturbing.'\"\r\n    CBS News.   8 November 2019.", "Vindman, Alexander.   \"Opening Statement of Lieutenant Colonel Alexander S. Vindman.\"\r\n    House Permanent Select Committee on Intelligence.   29 October 2019.", "Desiderio, Andrew and Kyle Cheney.   \"NSC Official Testifies Trump Undermined National Security with Ukraine Pressure.\"\r\n    Politico.   28 October 2019.", "CNN. \"Trump Fires Two Major Impeachment Figures -- Alexander Vindman and Gordon Sondland.\"\r\n    7 February 2020.", "Updated to include news coverage of Lt. Col. Vindman's firing in February 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]