["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The ad attacks Collins for increasing taxes with “liberal Stacey Abrams,” citing his vote on a transportation bill, which it calls “the greatest tax increase in Georgia history.”", "As they were originally written, the bills did not raise taxes per se. Instead, they allowed Georgia residents to vote on whether to adopt a tax.", "As a businesswoman, Loeffler vocally supported a regional tax increase that the final version of the bills had put on the ballot.  ​", "As they battle for a Georgia Senate seat, Republicans Sen. Kelly Loeffler and Rep. Doug Collins have each adopted an unorthodox campaign strategy: tying the other to Democrat Stacey Abrams.", "A new attack ad released by the Loeffler campaign follows this tack, claiming that Collins voted with the state’s former Democratic gubernatorial candidate to raise taxes when they were both state representatives.", "\"Doug Collins repeatedly joined liberal Stacey Abrams to raise taxes,\" the ad claims, with text citing HR 206, a bill to fund infrastructure projects. The ad then goes on to refer to HR 206 as \"the largest tax increase in Georgia history\" and concludes by saying that \"Kelly’s never voted for a tax increase — and never will.\"", "While the ad makes claims that are accurate, it also leaves out crucial context about HR 206 and Loeffler’s own position on it.", "In 2009, the Georgia State Assembly was deadlocked over two transportation bills: HR 206 and HB 277. The bills, which complemented each other, allowed Georgia voters to decide whether to adopt a statewide 1-cent sales tax increase to fund infrastructure improvements.", "Proponents of the bill, including Republican business-owners, noted that Georgia spent less on transportation than almost every other state and that its crumbling infrastructure was discouraging investment.", "As the ad claims, both Collins and Abrams supported HR 206 and HB 277 when they were state representatives. Collins was quoted in the Gainesville Times supporting \"the state-wide approach\" to taxation.", "However, HR 206 and HB 277 did not actually constitute a tax increase per se. Instead, they punted the decision to Georgia voters, who would be asked in a statewide ballot whether they wanted to amend the state constitution to allow the tax. The ad’s claim that Collins \"joined liberal Stacey Abrams to raise taxes\" is therefore misleading.", "HR 206 and HB 277 passed the House but stalled in the Senate, where they were fought over, amended, and kicked from committee to committee. In 2010, HB 277 was finally passed – as The Atlanta Journal-Constitution wrote – \"as if it were a billion-dollar kidney stone.\"", "By the time it passed, HB 277 had changed significantly. Instead of calling for a statewide vote, the bill split Georgia into 12 regions and asked residents of each region to vote in a referendum on whether to enact the tax for projects within that region.", "Loeffler, then an Atlanta businesswoman and co-owner of the Atlanta Dream WNBA franchise, supported one of the regional tax increases that the bills put on the ballot. Along with other sports executives, Loeffler was quoted in the Henry Herald promoting the sales tax in the Atlanta regional referendum:", "\"This is about sports and competition and improving the fan experience,\" Loeffler told the Herald, in reference to the tax hike. \"There is no other option for creating jobs in this way right now.\"", "Loeffler did more than simply voice her support for the tax. According to campaign finance records, the company led by Loeffler’s husband, of which she was a senior executive, donated $100,000 to a political committee backing the sales tax increase.", "The Loeffler campaign said that the attack ad was referring to Collins’ vote for HR 206 and HB 277 before they had been amended to include the regional referenda. Since Loeffler supported the regional tax increase rather than the statewide tax that Collins and Abrams favored, she is not taking an inconsistent position, the campaign said.", "\"Kelly supported the 2012 regional [referendum] that allowed communities to vote individually for and fund projects of importance in their own communities,\" wrote Loeffler spokesman Stephen Lawson in an email. \"Doug Collins voted to tax south Georgia for Atlanta's traffic problems by voting for the statewide, one-size-fits-all approach.\"", "In support of Lawson’s claims, the Loeffler campaign ad does specifically cite Collins’ vote on the version of HR 206 that endorsed a statewide, not regional tax referendum. But the reality is that Georgia taxes did not actually increase statewide because of Collins’ vote on HR 206.", "The Loeffler campaign ad makes a series of claims about the transportation bills HR 206 and HB 277. These claims leave out crucial context about Collins’ voting record and Loeffler’s own position on similar tax increases.", "The first part of the claim, \"Doug Collins repeatedly joined liberal Stacey Abrams to raise taxes\" does not strictly apply to the bill that the ad calls \"the greatest tax increase in Georgia history.\" As noted above, HR 206 would not have levied a statewide tax per se. Instead, it left the ultimate decision on the tax up to Georgia voters.", "The second part of the claim, \"Kelly’s never voted for a tax increase — and never will,\" is also misleading. As a citizen, Loeffler publicly supported a regional transportation tax, saying it was necessary to create jobs.", "We rate this claim Mostly False. ​", "Senator Kelly Loeffler on Youtube, \"History,\" Aug. 6, 2020", "The Atlanta Journal-Constitution, \"DOT measure forces Purdue to share wheel,\" Apr. 5, 2009", "The Atlanta Journal-Constitution, \"Kasim Reed’s capitol battle,\" Apr. 25, 2010", "The Atlanta Journal-Constitution, \"Landmark transportation bill has miles to go,\" Aug. 11, 2012", "Gainesville Times, \"General Assembly may fight over taxes,\" Mar. 3, 2009", "Georgia General Assembly, House Vote #105", "Georgia General Assembly, House Vote #103", "Georgia General Assembly, 2009-2010 Regular Session: HR 206,", "Georgia Government Transparency and Campaign Finance Commission, \"15 Days before Special Election,\" 2012", "Henry Herald, \"Sports leaders back T-SPLOST referendum,\" July 23, 2012", "Interview with Dan McLagan, Collins campaign spokesperson, Aug. 14, 2020", "Interview with Stephen Lawson, Loeffler campaign communications director, Aug. 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]