["A video shows the Sotitobire Miracle Centre church in Akure, capital of the southwestern state of Ondo, set on fire by a mob. It was posted here on December 18 and it accompanies claims that the head of the church, Prophet Alpha Babatunde, had confessed to his role in the disappearance of Gold Kolawole.", "“Body of the boy was found under alter (sic) in the church,” the post further claims.", "It was shared more than 256 times and viewed more than 41,000 times in less than 24 hours after being posted, according to data from Facebook.", "“And today after the boy was exhumed from the alter (sic) of the church, the church was set ablaze,” reads another post, which we’ve archived here. It correctly explains that the rampage followed Gold’s disappearance from the church creche during a November service which his mother attended.", "The post, repeated here, has been viewed more than 70,000 times. It was posted to a Nigerian Facebook page “Gist, News, Relationship”, which has nearly 5,000 followers.", "A similar claim, which was posted here, has been shared 177 times and viewed by at least 63,000 times.", "Other posts shared here, here and here repeat the claims, including via this Twitter user with more than 130,000 followers.", "Gold’s whereabouts are still unknown. Police deny his body was ever recovered from the church.", "State police spokesperson Femi Joseph confirmed the church was set ablaze on 18 December, an attack linked to media reports alleging the boy’s body was exhumed from beneath the church’s altar. But, he said, there was “nothing like that”.", "A separate statement by police further added: “It is most unfortunate that this misleading information, spearheaded by a popular TV station, has ignited spontaneous reactions from the people, leading to wanton destruction of properties and injuries to many.”", "At least 10 suspects have been arrested and detained for allegedly looting the Sotitobire church during the mob attack. “Sotitobire” is a Yoruba (in Nigeria) word meaning “tell of his greatness”.", "What does the family say happened?", "Gold went missing from the church creche on 10 November during a service, according to police. His disappearance was also reported here.", "Gold’s mother, Modupe Kolawole, told AFP in an extended interview that she and her husband Temitope (see family picture below) joined the church in June. She said she was reluctant to leave her son at the creche because he was too young and yet to walk.", "However, she said, she finally relented and placed Gold with the creche for the first time on November 10, while she attended a service next door.", "During the service she checked on him twice -- the second time at about 11.45 am. He was nowhere to be found, she said, alleging that all 14 carers from the creche “who had gone to dispose of refuse at that time” had no idea where he was.", "“When I demanded my child back, I was told that maybe someone took him along to play with,” she said. “When it was 3.00 pm, I hadn’t seen my child and the pastor was yet to be informed.”", "Reports of Gold’s disappearance reached Babatunde, founder of the church (see below), at the end of the service. Modupe said the case was reported to authorities.", "Four weeks later and with Gold still missing, his parents alerted Nigeria’s State Security Service (SSS), leading to Babatunde’s arrest on 10 December.", "Babatunde, who was detained in the SSS custody for thirteen days, hit back with a lawsuit in the state’s Federal High Court, demanding his release and a sum of 100 million naira ($278,000) in damages “for the violation of his fundamental rights”.", "On 23 December, authorities arraigned him before a Magistrate's Court in Akure and levelled two kidnapping charges against him and several associates, in connection with Gold’s disappearance (see official charge sheet below).", "Peter Anjorin, a member of the church and a close associate of Babatunde, faces a third charge for allegedly destroying evidence.", "The court was adjourned to 17 January, 2020, for further investigation. The case was later transferred from the magistrate court to a high court in the state where he was sentenced to life imprisonment in October 2020.", "However, the ruling was overturned by an appellate court in December 2021, noting that the evidence upon which the high court based its judgment was not enough to convict Babatunde, who was then released.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]