["The 26-second video, which features a TikTok logo, was published on Facebook here on July 29, 2020. It has been viewed 3.3 million times and shared 80,000 times.", "The Urdu-language text superimposed on the video translates to English as: “Oh Eagle, the world is jealous of your flight.”", "Eagle is a popular reference to Pakistan Air Force pilots.", "The post’s caption translates as: “India cannot win no matter from where it buys the planes because they don’t have sentiments of faith, jihad, martyrdom. When our men raise the slogan of Allah-u-Akbar [God is the greatest], then they shake the world.", "“Wars cannot be won by mere planes. The pilots should be like those in the Pakistan Air Force, then this is possible. Pakistanis know how to defend their land and they know how to give a befitting response to the enemy. This was the JF-17 that had startled the entire world by flying upside down for 133 kilometers.”", "The same video was also shared alongside a similar claim on Facebook, here and here.", "The claim is false.", "A reverse image search on Google followed by a keyword search found the video is in fact computer-generated imagery from Grand Theft Auto Five (GTA5), a popular multiplayer video game released in 2013.", "TikTok user @abrar.rajput, whose handle can be seen under the superimposed logo in the video, originally published the clip on TikTok here. The post includes the hashtag “gta5”, a reference to Grand Theft Auto 5.", "Below is a screenshot of the TikTok post with #gta5 circled in red:", "A keyframe reverse image search on Yandex also found other clips from GTA5 that correspond to the video seen in the misleading posts.", "This 2015 YouTube video, for instance, shows a car doing stunts and passing under the same bridge as the plane. The YouTube video was posted by a user named FrasxGames Z and has an Arabic caption that translates as: “A strong round of Hulla game GTA5”.", "Below is a screenshot comparison of the YouTube video (L) and the footage shared in the misleading Facebook post (R) with similarities circled:", "A closer analysis of the video in the misleading posts also confirms that it is computer-generated imagery (CGI).", "At the 12-second mark, the bushes seen at the roadside remain motionless despite the jet's movement. In a real scenario, the jet's motion would likely create a gust of wind, impacting nearby objects.", "At the two-second mark, a moving car can be seen on the same road, suggesting the video does not show an organised military exercise.", "Below is a screenshot of the CGI car seen in the misleading video circled in red:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]