["About this rating", "On Oct. 28, 2020, a message posted to 4chan’s /pol/ (\"Politically Incorrect\") claimed that Hunter Biden had turned himself in to the FBI and \"flipped\" on his father, former vice president Joe Biden. In the following days, readers asked us in both mail and searches if that claim was true.", "The message on /pol/ read as follows:", "Hunter Biden has turned himself into the FBI. He was personally interviewed this afternoon by Barr and six other Justice Department lawyers. He has been stashed in a medical facility in Washington D.C. where he is getting treatment for his addictions. So far he has signed statements and provided proof of over 300 million in bribes the Biden family has received in the last 20 years. The funds are hidden in several accounts in Switzerland and Hunter has provided proof that Joe Biden has been accessing those accounts and using funds for years. So far the evidence shows Joe Biden has personally removed over 45 million in cash and used it for personal items. The information has been forwarded to a special unit of the IRS for investigation. Barr will be meeting with Biden on Friday and recommend he either withdraw from the race or face numerous criminal charges. If he withdraws from the race and forfeit all funds in the accounts, the Biden family and specifically Hunter will not face criminal charges.", "The message spread to the conspiracy theory website BeforeItsNews and from there was shared on social media:", "The message also said this about Oct. 30: \"Barr will be meeting with Biden on Friday and recommend he either withdraw from the race or face numerous criminal charges.\"", "We were unable to find any credible news organizations that reported this alleged development. Had something of this magnitude occurred in the final week before Election Day, it would have driven wall-to-wall coverage in the news media, yet mention of it appeared not have been published even by far right-wing bloggers.", "This story stemming from 4chan's /pol/ follows a Hunter Biden death hoax that that also originated on /pol/.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]