["By Saranac Hale Spencer", "Posted on September 20, 2018", "Q: Is Christine Blasey Ford accusing Brett Kavanaugh of sexual assault as retribution for her parents’ foreclosure case in the 1990s?", "A: There is no evidence to support that claim, and her parents still live in that house.", "After President Donald Trump nominated Brett Kavanaugh in July to serve on the U.S. Supreme Court, a woman alleged in a confidential letter that Kavanaugh had sexually assaulted her when they were in high school.", "Christine Blasey Ford came out publicly as the woman who made the allegations in a Sept. 16 story in the Washington Post.", "Since then, the backlash against her has been fast and fierce — from death threats to viral internet rumors.", "One of the first rumors to emerge online claimed that Ford was motivated to come forward with her allegation because Kavanaugh’s mother had been one of the judges to preside over a foreclosure case against her parents and their suburban Maryland home.", "That claim has been featured on several websites. The Gateway Pundit’s story — which falsely claimed “Judge Kavanaugh’s mother foreclosed on Christine Blasey Ford’s parents’ home” — was shared on social media pages with a combined following of more than 3 million, according to data from CrowdTangle.", "However, there is no evidence that Ford’s decision to come forward with her allegation against Kavanaugh is connected to her parents’ foreclosure proceeding in the 1990s.", "While it’s true that Martha Kavanaugh was one of two judges who handled the foreclosure case, initially filed in 1996, she was actually the judge who granted the bank’s motion to dismiss the case after the Blaseys refinanced.", "The couple stayed in the house and they still own it to this day, according to Maryland’s Department of Assessments and Taxation.", "So, stories that make claims such as, “Martha Kavanaugh ruled against the parents of Christine Blasey-Ford in a foreclosure case,” are wrong. She didn’t rule against the Blaseys and she didn’t foreclose on them, either.", "For her part, Ford told the Post that she had decided to come forward publicly with her allegation after initially wanting to avoid the exposure. “Now I feel like my civic responsibility is outweighing my anguish and terror about retaliation,” she said in the Sept. 16 story.", "Ford hasn’t mentioned anything publicly about her parents’ foreclosure proceeding, so any connection between it and her decision to come forward is pure speculation.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "CNN. “Read the letter Christine Blasey Ford sent accusing Brett Kavanaugh of sexual misconduct.” CNN.com. 17 Sep 2018.", "Brown, Emma. “California professor, writer of confidential Brett Kavanaugh letter, speaks out about her allegation of sexual assault.” The Washington Post. 16 Sep 2018.", "Katz, Debra and Banks, Lisa. Lawyers for Christine Blasey Ford. Letter to Sen. Charles Grassley, chairman of the Senate Judiciary Committee. 18 Sep 2018.", "Hoft, Jim. “Bad Blood: Judge Kavanaugh’s Mother Presided Over Far Left Accuser’s Parents’ Home Foreclosure.” TheGatewayPundit.com. 17 Sep 2018.", "“CHRISTINE BLASEY-FORD MOTIVE: REVENGE – KAVANAUGH’S MOTHER JUDGE AGAINST PARENTS IN FORECLOSURE CASE 1996.” PacificPundit.com. 16 Sep 2018.", "Moreno, Amy. “REPORT: Court Records Reveal a Sinister Connection Between Christine Blasey Ford and Kavanaugh’s Family.” TruthFeedNews.com. 17 Sep 2018.", "UMLIC-EIGHT CORP A NORTH CAROLINA CORP v. Blasey. Case number 156006V. Circuit Court for Montgomery County, Md. Filed 8 Aug 1996.", "Blasey, Paula and Blasey, Ralph. Deed of trust — refinance. 17 Dec 1996.", "Maryland Department of Assessments and Taxation. Property information — 17 Masters Ct. Potomac, MD  20854. Accessed 19 Sep 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]