["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A glass of red wine in Montreal, Canada. (Wikimedia commons)", "As tensions rose between two longtime allies over trade, House Majority Leader Kevin McCarthy, R-Calif., took aim at Canadian wine.", "McCarthy’s interview with CNN’s State of the Union aired as the United States was slapping tariffs on Canadian steel and aluminum. Canada retaliated with a series of tariffs on U.S. consumer products.", "\"I think what we're finding here is, we are in the middle of a trade discussion,\" McCarthy said in the June 3 interview. \"Nobody wants to be in a trade war. Nobody wins a trade war. But we are standing up for the process of where we're moving forward that we have fair trade. If you are talking about Canada, look what they do when it comes to our dairy products. Look what it — our wine cannot sit on their supermarkets.\"", "Does Canada really bar U.S. wine from its supermarkets?", "Short answer: The whole country doesn’t, but the United States is challenging a rule in one province, British Columbia, at the World Trade Organization.", "McCarthy’s office pointed us to a province-level policy enacted by British Columbia in 2015 that limits sales of wine in grocery stores to products made in British Columbia. The U.S. began challenging this provision under President Barack Obama.", "According to the U.S. Trade Representative, only British Columbia wine may be sold on grocery store shelves. The only way supermarkets can sell imported wine is in a physically separated area with its own cash registers.", "British Columbia’s rules \"discriminate against U.S. and other imported wine by allowing only B.C. wine to be sold on regular grocery store shelves,\" the U.S. Trade Representative said in announcing its action. \"Such discriminatory measures limit sales opportunities for U.S. wine producers and provide a substantial competitive advantage for BC wine.\"", "Other countries that have complained about the rule include Argentina, Chile, Mexico, New Zealand and the European Union, according to the Toronto Globe and Mail.", "Discriminatory rules also prevail in Ontario and Quebec, according to the Wine Institute, a U.S. trade association.", "So McCarthy is referring to a real phenomenon, though one limited to a province.", "When we checked in with experts on U.S.-Canada trade, they added some additional context.", "First, even with the restrictions, the U.S. wine industry leads foreign wine sales in Canada.", "About 69 percent of Canadian wine sales in 2017 were imports. The United States ranks first among all nations for imported wine sales in Canada, totaling 504 million Canadian dollars in 2016, or roughly $388 million at American exchange rates. The United States accounted for 21 percent of all imported wine sales in Canada that year.", "And according to the Wine Institute, the United States sells more wine to Canada than to any country other than the European Union. That’s no small feat, said Ross Burkhart, a political scientist specializing in U.S.-Canada relations at Boise State University.", "\"The U.S. exports almost as much wine to Canada as to the E.U., with about a tenth of the population in Canada compared to that of the E.U.,\" Burkhart said.", "Second, experts said that government-run liquor stores are probably the predominant source for wine sales, especially for foreign wines that are not discriminated against in such outlets.", "\"U.S. wines sell widely in Canada through the government controlled liquor stores,\" said Munroe Eagles, director of Canadian studies at the State University of New York-Buffalo. The offerings at such stores as \"larger and more comprehensive.\"", "Dan Trefler, who teaches at the University of Toronto’s Rotman School of Management, noted that in his province, Ontario, there are 8,553 supermarkets, but only 70 currently sell wine. That’s less than 1 percent.", "In fact, Trefler said, \"grocery store wines are typically the cheapest wines and are bought by people who would not likely pay extra for high-quality U.S. wines. If Ontario opened up grocery stores to U.S. wines, it would have virtually no impact on U.S. exports to Canada.\"", "As it happens, the ability of U.S. wines to compete aggressively in Canada was made possible by the U.S.-Canada Free Trade Agreement, the precursor to the North American Free Trade Agreement.", "Prior to the agreement, \"government wine stores marked up U.S. wine by 50 percentage points more than Canadian wine,\" Trefler said. \"This was a massive trade restriction. The FTA eliminated that restriction.\"", "If NAFTA was terminated, he added, \"Canada could consider reinstating the 50 percentage point differential. McCarthy has chosen to emphasize a minor irritant when he could instead emphasize the great job NAFTA has done in knocking down Canadian barriers to U.S. wines. Ending NAFTA will likely hurt U.S. wine producers.\"", "McCarthy said, \"If you are talking about Canada .. our wine cannot sit on their supermarkets.\"", "He’s referring to an official U.S. government complaint about a provincial rule affecting how wine is sold in British Columbia supermarkets. However, that rule is not in force across Canada, and it’s worth noting that the United States sells a whole lot of wine in Canada despite the rule, including in government-run stores that do not discriminate against imports.", "We rate the statement Half True.", "Kevin McCarthy, interview on CNN’s State of the Union, June 3, 2018", "Office of the U.S. Trade Representative, \"United States Challenges Canadian Trade Measures That Discriminate Against U.S. Wine,\" January 2017", "Wine Institute, \"Wine Institute Commends U.S. Government’s Efforts to Improve Market Access in Canada,\" May 25, 2018", "Wine Institiute, \"U.S. Wine Exports Total $1.53 Billion in 2017,\" March 19, 2018", "Canadian Vintners Association, \"Canadian Wine Imports 2012-2016,\" accessed June 5, 2018", "Government of Ontario, \"Beer, wine and cider sales in grocery stores,\" accessed June 5, 2018", "Statista, \"Wine dollar sales in Canada from FY 2011 to FY 2017, by product type (in billion Canadian dollars),\" accessed June 5, 2018", "Statista, \"Food Retail in Canada - Statistics & Facts,\" accessed June 5, 2018", "Toronto Globe and Mail, \"Canada to hit U.S. with retaliatory tariffs in response to Trump’s steel tariffs,\" May 31, 2018", "Toronto Globe and Mail, \"U.S. asks WTO to strike panel to review B.C. wine rules,\" May 25, 2018", "Email interview with Ross Burkhart, a political scientist specializing in U.S.-Canada relations at Boise State University, June 4, 2018", "Email interview with Munroe Eagles, director of Canadian studies at the State University of New York-Buffalo, June 4, 2018", "Email interview with Dan Trefler, professor at the University of Toronto’s Rotman School of Management, June 4, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]