["“Is Coranavirus a biological Weapon developed by the Chinese called Wuhan -400? This book was published in 1981. Do read the excerpt,” reads a tweet by Congress MP Manish Tiwari. The book Tiwari refers to is Dean Koontz’s ‘The Eyes of Darkness’. The word ‘Wuhan-400’, developed by a Chinese scientist, features in the marked excerpt.", "Is Coranavirus a biological Weapon developed by the Chinese called Wuhan -400? This book was published in 1981. Do read the excerpt. pic.twitter.com/Qdep1rczBe", "— Manish Tewari (@ManishTewari) February 16, 2020", "That Koontz’s novel released in 1981 ‘predicted’ the outbreak of the coronavirus (COVID-19) as a biological weapon developed by China is a claim circulating worldwide in different languages. Below is a tweet in Indonesian.", "Buku The Eyes of Darkness tahun 90an udah ngomongin 2020 ada virus yang menyerang pernafasan", "Terus nama biological weaponnya Wuhan 400 😮 pic.twitter.com/oUDDVaV9hT", "— Ridwan Hanif (@ridwanhr) February 18, 2020", "The claim has also been shared in Spanish. A Hindi text claims that a book in China predicted that the country developed the coronavirus to eradicate poverty. “चीन में ये किताब पहले ही आ गई थी जिसमे कहा गया था कोरॉना चीन में सरकार गरीबी हटाने के लिए इस वायरस का उपयोग करेगी चीनी सरकार ऐसा वॉट्सएप पर कहा जा रहा है,” reads the complete message.", "The novel describes ‘Wuhan-400’ as follows:", "1. Developed by a Chinese scientist in an RDNA laboratory outside the city of Wuhan.", "2. Wuhan-400 affects only human beings. No other living creature can carry it.", "3. The weapon can’t survive outside a living human body for more than a minute.", "The available information about COVID-19 suggests that these predictions are not aligned with the recent outbreak.", "Coronavirus is not man-made. Animals can also host the virus.", "Bogus claims about CoV being engineered as a biological weapon has already been debunked by multiple platforms both national and international. A statement by public health scientists published in The Lancet says, “We stand together to strongly condemn conspiracy theories suggesting that COVID-19 does not have a natural origin. Scientists from multiple countries have published and analysed genomes of the causative agent, severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), and they overwhelmingly conclude that this coronavirus originated in wildlife, as have so many other emerging pathogens.”", "According to an Al Jazeera report, “Chinese health authorities are still trying to determine the origin of the virus, which they say likely came from a seafood market in Wuhan where wildlife was also traded illegally.” This also debunks the second prediction that the novel coronavirus only lives in humans.", "The report adds that Chinese researchers said the virus could have spread from “an infected animal species to humans through illegally-trafficked pangolins”, which are prized in Asia for food and medicine. “Scientists have pointed to either bats or snakes as the source of the virus.”", "The World Health Organisation (WHO) states, “Coronaviruses (CoV) are a large family of viruses that cause illness ranging from the common cold to more severe diseases such a MERS-CoV and SARS-CoV.” A novel coronavirus (nCoV) and its outbreak COVID-19 has not been previously identified in humans.", "“Coronaviruses are zoonotic, meaning they are transmitted between animals and people. Detailed investigations found that SARS-CoV was transmitted from civet cats to humans and MERS-CoV from dromedary camels to humans. Several known coronaviruses are circulating in animals that have not yet infected humans,” the WHO adds.", "Scientific study suggests that the novel coronavirus can survive outside the human body for hours, or even days.", "An earlier fact-check by Alt News Science editor Dr Sumaiya Shaikh and pharmacovigilance physician Dr Sharfaroz cited a new-preprint study (Doremalen et al 2020) conducted by American scientists. According to the study, COVID-19 can live in the air for several hours and on some surfaces for as long as 2-3 days. The study also suggests that the virus can spread through the air as well as from touching things that were contaminated by those who are infected as well as through direct human contact.", "They tested the virus by spraying into the air by a nebuliser mimicking the coughing action of an infected person. They learnt that could be detected up to 3 hours later in the air, up to 4 hours on copper surfaces, up to 24 hours on cardboard and up to 2-3 days on plastic and stainless steel surfaces.", "A search inside the 1981 edition of ‘The Eyes of Darkness’ on Google books reveals that the fictional novel termed the biological weapon ‘Gorki-400’.", "According to an article in South China Morning Post, Koontz had the virus originating in Russia. “The book appears to have been rewritten after the collapse of the Soviet Union meant the country was no longer seen as a communist bogeyman,” says the article which adds that the first edition of the book was written under Koontz’s pseudonym Leigh Nichols. The 1981 version on Google books also recognises the author as Leigh Nicols. The initial copy concerns a virus called Gorki-400 that was created by the Russians and emerged from “the city of Gorki”.", "South China Morning Post also provided an excerpt from the first edition where Gorki-400 and Russia are featured.", "“The change to Wuhan came when the book was released in hardback under Koontz’s own name in 1989. The year of the book’s re-release is significant – 1989 marked the end of the Cold War. And with the collapse of the Soviet Union, the country was no longer communist…An American author pointing the fictional finger of blame at Russia would not have gone down well in that climate, so The Eyes of Darkness needed a new villain,” continues the article.", "Therefore, social media claims about the novel coronavirus are bogus from all counts. Neither did Dean Koontz author a novel in 1981 concerning a bioweapon that originated in Wuhan nor did he predict the COVID-19 outbreak. Furthermore, ‘Gorki-400’ (later renamed to ‘Wuhan-400’) does not mirror the novel coronavirus.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]