["About this rating", "One of the multiple, \"What the heck was this about?\" old-timey newspaper articles that commonly circulates via social media postings is the infamous \"DUCK EATS YEAST, QUACKS, EXPLODES; MAN LOSES EYE\" report about an Iowa man who supposedly lost the sight in one eye when his prize-winning duck named Rhadamanthus (after the mythical king of Crete) consumed a pan of yeast and exploded, presumably from the excessive build-up of gas in its innards:", "DUCK EATS YEAST, QUACKS, EXPLODES; MAN LOSES EYE", "Des Moines, Ia -- The strangest accident recorded in local history occurred this morning when Rhadamanthus, a duck, which took a prize at recent Iowa poultry show, exploded into several hundred pieces, one of which struck Silas Perkins in the eye, destroying the sight.", "The cause of the explosion was the eating of yeast which was placed in a pan upon the back porch, and tempted his duckship, which was taking a Sunday morning stroll.", "Upon returning from church Mr. Perkins discovered his prize duck in a somewhat logy condition. Telltale marks around the pan of yeast gave him his clew.", "He was about to pick up the bird when the latter quacked and exploded with a loud report and Mr. Perkins ran into the house holding both hands over one eye. A surgeon was called, who found that the eyeball had been penetrated by a fragment of flying duck and gave no hope of saving the optic.", "This account did in fact run in dozens of newspapers across the U.S. in January 1910, with slight variations in dating and wording:", "As to the usual follow-up question of \"Is this true?\", our attempts to track down any additional information about the plight of Rhadamanthus and Silas Perkins more than a century after the fact have not proved fruitful.  We can say, however, that this account appears to fall into the category of extremely implausible tall tales, one that echoes multiple urban legends about birds allegedly exploding due to their consuming substances that expand in volume after ingestion -- the most common expressions being the legends that seagulls will gruesomely and fatally burst if fed Alka-Seltzer (due to the resulting build-up of gas in their stomachs), or that birds often die after eating rice commonly thrown at newly-married couples at the end of wedding ceremonies (because the birds purportedly cannot digest the grains, which swell from moisture inside their stomachs and cause fatal raptures).", "These mistaken beliefs about exploding birds are not grounded in science, but they persist nonetheless.  Why?  They seem to be based on the assumption that birds cannot, to put it colloquially, vomit, burp, or fart, therefore they have no way of expelling substances that pose an immediate danger to them from their crops or stomachs (other than through the normal digestive and  excretory processes, which work too slowly).  What is the basis for these false assumptions, though?", "Most of us have noticed how birds often tilt their heads upwards while eating or drinking.  This behavior reflects that birds don't generally swallow food and water the same way humans do -- they lack the mechanism for peristalsis (contractions occurring in the esophagus which propel food toward the stomach) and instead have to rely on gravity to move food from their mouths to their crops:", "https://www.youtube.com/watch?v=cnz7hW6BPXU\n\nSince birds lack the mechanism for swallowing without the aid of gravity, people reason, neither can birds perform the opposite of swallowing -- that is, vomiting -- without the aid of gravity.  But since gravity only works in one direction (down, not up), hapless birds are stuck with whatever they swallow and cannot quickly get rid of it.  But in fact, birds can both regurgitate and  vomit material from their crops and stomachs -- indeed, the process of regurgitating food is often employed by birds in feeding their young.", "Whether birds can burp is less certain but still plausible:", "Scientists are a little less certain about whether birds can release gassy buildup from the mouth, though. There's no official documentation of a bird burp (it's not a common field of research), but most ornithologists suspect that if a bird needed to burp, it would have no trouble doing so.\"Birds are able to excrete lots of things through their mouth,\" says Todd Katzner, the director of conservation and field research at the National Aviary in Pittsburgh.\"The fact that birds can regurgitate food for their young suggests that they can also reverse the direction of other things down there. I'd be pretty surprised if birds didn't burp.\"", "As for the other fowl end, birds may not \"fart\" the way we think of it, but that's generally because they don't need to rather than because they're not capable of it:", "It's not that [birds] can't [fart]. They just don't need to, says Mike Murray, a veterinarian at the Monterey Bay Aquarium in California. Birds have the anatomical and physical ability to pass gas, he explains, \"but if I saw gas in a bird's gastrointestinal tract on an x-ray, I'd suspect that something abnormal was going on in there.\"", "Birds don't typically carry the same kinds of gas-forming bacteria in their gut as humans and other mammals to help digest food, so there's nothing to let loose.", "And the reason birds don't need to fart is because they pass gas before it builds up to the point of becoming a fart:", "[T]he short answer is an almost definite no, birds do not fart. Farts are, by definition, noticeable eruptions of significant volumes of intestinal gas. Avian intestines are short and evacuate wastes frequently. Any gases produced in digestion leak out as fast as they're produced, so there isn't the opportunity for build-up that leads to those explosive releases we cheerfully or disgustedly call farts.", "Or, to summarize those two currents of thought:", "Birds have an anus, and so technically could fart, but to date there’s been no official evidence that they do. One theory is that they don’t need to fart like humans and other mammals because they have a faster rate of digestion – their food simply doesn’t spend long enough in their short gastrointestinal tracts to ferment and form gas. Another theory is that birds’ guts don’t contain the same gas-forming bacteria as mammals. It’s also possible that ornithologists have missed bird farts because they leak out passively rather than in one eruption, or birds could be burping to release unwanted gas instead.", "The only other report of an exploding duck we were able to turn up that did not literally involve the use of explosives was a 1975 UPI report that attributed the mishap to alcohol -- applied externally, rather than consumed by the bird:", "Duck Exploded, Waiter Charges in $36,000 Suit", "Albuquerque, NM -- A waiter who claimed he was burned by a flaming duck which exploded as he was preparing to serve it has filed a $36,000 suit against the restaurant's owners.", "Shun Hang Fung said in the suit he suffered burns on his arms, shoulder, and upper body in the incident. Named as defendants were Stephanie and Migo Liu, owners of a local restaurant.", "The complaint alleges Shun was holding a dish with the flaming duck when Mrs. Liu poured alcohol on the duck and it exploded.", "All that considered, we have to say that if Silas Perkins did lose a prize-winning duck and/or the sight in one of his eyes back in 1910, we suspect that neither event had anything to do with an explosion caused by a pan of yeast.", "The Indianapolis Star   \"Duck Eats Yeast, Quacks, Explodes; Man Loses Eye.\"\r\n    3 January 1910   (p. 1).", "Erickson, Laura L.   \"Question of the Day: Do Birds Fart?\"\r\n    Laura Erickson's for the Birds.   5 April 2007.", "Kalhagen, Alyson.   \"Causes of Regurgitation in Birds.\"\r\n    The Spruce Pets.   30 September 2011.", "Kalhagen, Alyson.   \"Vomiting or Regurgitation in Pet Birds.\"\r\n    The Spruce Pets.   11 September 2006.", "Corney, Charlotte.   \"Do Birds Fart?\"\r\n      BBC Science Focus.    Accessed 10 May 2020.", "Schwanke, Catherine.   \"Is It True That Birds Can't Fart?\"\r\n    Popular Science.   4 June 2009.", "UPI.   \"Duck Exploded, Waiter Charges in $36,000 Suit.\"\r\n    Chicago Tribune.   30 May 1975   (p. 2).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]