["Republican Rep. Joe Heck’s record on abortion is fast becoming the subject of many salvos in the unending television ad wars in Nevada’s competitive Senate race.", "Democrat Catherine Cortez Masto has run several ads attacking Heck on the issue, most recently one featuring a Las Vegas-area gynecologic oncologist who opposes Heck because he voted to strip funding for Planned Parenthood.", "\"Joe Heck voted 10 times to defund Planned Parenthood, which thousands of women depend on for cancer screenings,\" she says in the ad. \"And Heck opposes a woman's right to choose, even when her health is at risk.\"", "Heck is no stranger to ads attacking his stance on abortion, as Democrats have sought to highlight the Republican military doctor’s adamant anti-abortion stance in both his current Senate race and past congressional races.", "A review of Heck’s voting record and public statements over the past six years shows that Cortez Masto’s ad is largely accurate, though over-simplified.", "Ten votes?", "Heck himself freely admits he voted to defund Planned Parenthood, and his voting record since entering Congress in 2010 reflects that position.", "It’s more difficult to argue that Heck has voted 10 separate times to defund the program, as that number relies on counting several procedural motions that weren’t strict up-or-down votes on funding for Planned Parenthood.", "For example, the ad cites five votes taken by Heck in September 2015 to \"shut down the government over Planned Parenthood,\" but not all of them are the same, including:", "Two procedural votes on Sept. 17 to end debate and adopt rules for floor consideration on a measure defunding Planned Parenthood.", "A Sept. 18 vote on a bill (Defund Planned Parenthood Act of 2015) barring federal funding to the organization for one year and redirecting the funding to community health centers.", "A Sept. 30 procedural vote allowing for floor consideration of continuing resolution to fund the government that would also defund Planned Parenthood, and a subsequent vote on that bill itself.", "All of the votes mentioned in the ad were taken as part of a legislative attempt to strip funding from the program, but they aren’t all strict up-or-down votes. Of the five votes listed above, two are actual roll call votes on barring federal funding the program, while the other three are procedural votes that certainly moved the legislation forward but, again, aren’t direct votes on the bill.", "Cortez Masto spokesman Zach Hudson said the campaign referenced every vote listed in Congressional Quarterly that references defunding Planned Parenthood. Heck campaign spokesman Brian Baluta told PolitiFact that counting procedural votes unfairly inflates the number.", "The other votes mentioned in the ad are a mix of procedural and more straightforward votes to defund the program.", "The ad cites three votes related to the same piece of 2015 defunding legislation, including the initial House vote, a reconciliation vote agreeing to changes made by the Senate, and a veto override vote.", "And it cites two votes on amending 2011 spending bills clearly designed to bar federal funding from the organization.", "Our friends at PolitiFact New Hampshire took similar issue with a claim about endangered Republican Sen. Kelly Ayotte voting to defund the group six times, ruling that counting procedural votes is \"accurate but needs clarification.\"", "Health exemptions", "The second part of the ad claims that Heck opposes \"a woman's right to choose, even when her health is at risk.\"", "Generally, Heck opposes abortion. His campaign said he supports exemptions in cases of rape, incest and if the pregnancy threatens a mother’s life.", "The Cortez Masto campaign argues, however, that Heck opposes abortion even when the mother’s health is \"at risk.\"", "There is a difference between situations where continuing a pregnancy threatens the life of the mother and pregnancies with serious future health concerns for the mother.", "Cortez Masto’s campaign pointed PolitiFact to a 2008 Newsweek article detailing the health exemption, in part citing a Supreme Court ruling in Doe v. Bolton that says health can be defined as medical judgment on factors including \"physical, emotional, psychological, familial and the woman's age.\"", "The National Abortion Rights Action League (NARAL), a pro-abortion rights group, provides several examples in a 2016 fact sheet of women whose pregnancies, while not life-threatening, would endanger their future ability to have children or seriously harm the mother if the pregnancy was brought to term.", "The ad cites as evidence Heck voting for a measure banning abortions after 20 weeks of pregnancy, with exemptions for abortions necessary to save the life of a pregnant woman \"in reasonable medical judgment,\" and limited cases of rape and incest.", "Heck voted against a Democrat-led \"motion to recommit\" the bill that sought to add an exception to the 20-week ban by allowing abortions that would preserve the health of the mother.", "Our ruling", "A Catherine Cortez Masto campaign ad claims Joe Heck \"voted 10 times to defund Planned Parenthood,\" and \"opposes a woman's right to choose, even when her health is at risk.\"", "Heck has voted to defund Planned Parenthood, a fact he publicly admits. The harder question to answer is whether to count procedural votes leading up to formal votes on the defunding measures as votes to defund the group.", "The ad is mostly accurate, but needs some clarification on the actual number of votes. We rate it Mostly True.", "https://www.sharethefacts.co/share/ab6a58e3-8036-4024-b176-c218b2187d5b", "Email interview with Brian Baluta, Joe Heck campaign spokesman, Sep. 1, 2016", "Email and phone interview with Zach Hudson, Catherine Cortez Masto campaign spokesman, Sept. 1, 2016", "Catherine Cortez Masto campaign press release, \"New Ad Features a Republican Doctor Slamming Congressman Heck for Votes to Defund Planned Parenthood,\" Aug. 29, 2016", "Joe Heck campaign press release, \"FACT CHECK: Latest ad continues Cortez Masto’s extreme partisanship,\" Aug. 29, 2016", "PolitiFact, \"Maggie Hassan says Kelly Ayotte has record of voting to defund Planned Parenthood,\" April 29, 2016", "NARAL, \"Abortion Bans Endanger Women’s Health,\" Jan. 1, 2016", "Las Vegas Review-Journal, \"House votes to cut off fed funds to Planned Parenthood,\" Sept. 19, 2015", "Ralston Reports, \"Oceguera double down on charges about Heck's record on women's issues, despite torrent of media criticism,\" Oct. 10, 2012", "Newsweek, \"Abortion: What the ‘Health’ Exemption Really Means,\" Oct. 15, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]