["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "If you watched more than an inning of the 2017 World Series, you probably saw an unusual ad from the re-election campaign of Gov. Bruce Rauner.", "Titled \"Thanks, Mike!,\" the 30-second spot features the governors of Missouri, Wisconsin and Indiana extolling the economic success of their states and \"thanking\" Rauner’s arch political rival, Illinois House Speaker Michael Madigan, D-Chicago, for thwarting Rauner’s reform agenda during the Republican’s first term.", "Rauner doesn’t appear in the ad. Instead, Missouri Gov. Eric Greitens, Wisconsin Gov. Scott Walker and Indiana Gov. Eric Holcomb, all Republicans, look into the camera and boast of their states’ economic gains, which they attribute to policies enacted by Madigan (\"raising Illinois’ taxes,\" says Walker) or prevented by him (\"blocking Rauner’s reforms,\" says Greitens).", "The most specific claim comes from Holcomb of Indiana: \"We’re growing union jobs faster than Illinois.\"", "Given Indiana’s status as a \"right-to-work\" state that bans compulsory union membership and Illinois’ status as one of the most union-friendly states in the nation, Holcomb’s statement invites a closer look.", "The Rauner campaign said Holcomb’s claim is based on a U.S. Bureau of Labor Statistics report from January 2017 on union employment and membership.", "The report shows that from 2015 to 2016 -- the first two years Rauner was in office -- workers represented by unions in Indiana grew from 319,000 to 335,000, an increase of 5 percent. During that same time, workers represented by unions in Illinois fell by 4 percent, from 892,000 to 856,000.", "The difference between the two states is all the more striking when considered against Illinois’ longstanding reputation as a union stronghold. The report notes that Illinois is among a handful of states that account for most of the union membership in the nation:", "Over half of the 14.6 million union members in the U.S. lived in just 7 states (California, 2.6 million; New York, 1.9 million; Illinois, 0.8 million; Pennsylvania, 0.7 million; and Michigan, New Jersey, and Ohio, 0.6 million each), though these states accounted for only about one-third of wage and salary employment nationally.", "Illinois’ 2015-16 union numbers are no statistical fluke. Even before the Great Recession, Illinois had been losing union jobs at a faster clip than its neighbor to the east.", "From 2006-07, the number of workers represented by unions in Illinois fell from 979,000 to 884,000, a decrease of nearly 10 percent. Indiana’s union job losses in that period were less than 1 percent -- from 334,000 to 333,000.", "Michael Hicks, an economics professor at Ball State University in Muncie, Ind., who tracks Midwest job trends, says the pattern bucks conventional wisdom.", "\"In 2006-07, in the wake of the very difficult manufacturing employment period, Illinois and Indiana shed both public and private union jobs,\" Hicks said in an email. \"But Indiana was holding on better, when it should not have because we are a more manufacturing intensive state (and private sector unions are more tied to manufacturing).\"", "Greater Chicago’s large and diverse economy should have provided a buffer for the state’s overall jobs picture, but that hasn’t happened, Hicks said.", "\"In the most recent data, Indiana is well outperforming Illinois in both private and public sector union job growth. Given the very large agglomeration economy that is Chicago, this should not be the case,\" Hicks said.", "Unemployment figures over the past decade also attest to Illinois’ job struggles relative to Indiana. While both hit peak unemployment in January 2010 -- Illinois at 11.2 percent, Indiana at 10.9 percent -- Indiana’s post-recession recovery has been significantly stronger. Indiana ended 2016 with 4 percent unemployment while Illinois was at 5.7 percent. The most recent figures, from September, have Indiana at 3.8 percent and Illinois at 5 percent.", "This leads to the big question about the ad: Does the speaker of the Illinois House -- who also happens to be chairman of the Democratic Party of Illinois -- deserve the thanks of Govs. Greitens, Walker and Holcomb? Have policies driven by a Democrat-led General Assembly caused Illinois’ economic woes?", "Hicks is neither dismissive nor completely accepting of the governors’ claims.", "\"While I am not ready to say with scientific certainty that the budget and pension crises facing Illinois are the sole reason for lagging job growth,\" Hicks said, \"the uncertainty about future tax rates and the risk of interrupted public services must surely be playing a role in Illinois’ poorer than expected economic performance in the post-recessionary period.\"", "Indiana Gov. Eric Holcomb said Indiana is \"growing union jobs faster than Illinois.\"", "The latest report on union membership and representation from the U.S. Bureau of Labor Statistics backs Holcomb’s claim, with Illinois losing 5 percent of its union jobs between 2015 and 2016 and Indiana gaining 4 percent.", "It’s a trend that predates the Great Recession and, in the bigger jobs picture, is backed by a decade’s worth of unemployment figures in the two states.", "We rate this statement True.", "Bruce Rauner ad, \"Thanks, Mike!\", YouTube, accessed Oct. 27, 2017", "Union Members Summary, news release, U.S. Bureau of Labor Statistics, Jan. 26, 2017; accessed Oct. 27-30, 2017", "Quick facts statistics for Illinois and Indiana, U.S. Census Bureau; accessed Oct. 30, 2017", "Unemployment statistics, U.S. Bureau of Labor Statistics, accessed from database, Oct. 27-30, 2017", "Email interview, Michael Hicks, Ball State University, Oct. 30, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]