["The video was published here on Facebook on August 14, 2020. It has been viewed more than 108,000 times and shared 5,200 times.", "A woman can be heard speaking Burmese during the video. Her comments translate to English as: \"According to Kuala Lumpur news on August 11, the OIC secretary general, Yousef bin Ahmad Al-Othaimeen, urged OIC member countries to sue the ruling party NLD by signing a statement and submitting it to the OIC.", "“Since 2013, the OIC has funded and supported the NLD party, led by Aung San Suu Kyi, to win in elections and form a government. Although the NLD party has held power for over four years, they have failed to implement the promises discussed between the NLD and the OIC. Because of the NLD’s failures, the OIC faces a lot of losses. Now the OIC will seek legal proceedings against NLD for breaching international agreement, urged by the OIC secretary general.''", "The video’s Burmese-language caption translates to English as: “Breaking News. 57 OIC states sign an agreement to sue NLD. TV News.”", "NLD refers to the National League for Democracy, the current governing party in Myanmar.", "The OIC is an international organisation consisting of 57 member states, most of which are Muslim-majority countries. The organisation describes itself as “the collective voice of the Muslim world” that works to “safeguard and protect the interests of the Muslim world in the spirit of promoting international peace and harmony among various people of the world”.", "In November 2019, the Gambia, on behalf of the 57-nation OIC, Canada and the Netherlands, filed a suit against Myanmar for violating the 1948 UN Genocide Convention. It claimed Myanmar had violated the convention during its 2017 military crackdown, which resulted in about 750,000 Rohingya fleeing into neighbouring Bangladesh. The Gambia requested the International Court of Justice to impose emergency measures -- pending a full case that could take years. In January 2020, the United Nations’ highest court ordered Myanmar to “take all measures within its power” to prevent the genocide of Rohingya Muslims. Here is an AFP report on the ruling.", "The video was also published here, here and here on Facebook, alongside a similar claim.", "The claim, however, is false.", "A reverse image search on Google found an identical video published here on the OIC’s official Facebook page on June 25, 2020.", "It is titled: “Urgent Financial Grants to 21 OIC Member States”.", "The video description states, in part: “#OIC has approved urgent financial grants to 21 Member States to enhance their capabilities to face the negative repercussions of the novel coronavirus disease (COVID-19) pandemic.”", "The description includes a link to this June 25, 2020 report published on the OIC website. It is titled: “Al-Othaimeen: OIC Supports 21 Countries to Overcome COVID-19 Repercussions”. Al-Othaimeen is the incumbent secretary general of the OIC.", "The report reads, in part: “The Islamic Solidarity Fund (ISF), a subsidiary organ of the Organization of Islamic Cooperation (OIC), has approved urgent financial grants to twenty-one Member States to enhance their capabilities to face the negative repercussions of the novel coronavirus disease (COVID-19) pandemic as part of the initiative to support the OIC's least developed Member States.", "\"In the presence of the OIC Secretary General, Dr. Yousef A. Al-Othaimeen, the ISF handed over the third batch of the approved financial grants to the delegates of permanent missions of Yemen, Chad, Mauritania, Senegal, Mali, Sudan, Comoros, and Maldives at the headquarters of the OIC General Secretariat today, 25 June 2020. Seventeen Member States have so far benefited from the ISF's support against COVID-19.”", "Below are two screenshot comparisons between the video in the misleading post (L) and the video on the OIC Facebook page (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]