["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "CNN host Don Lemon and commentator Larry Elder made for some entertaining television recently when they sparred over how small-business owners feel about the health care law.", "\"Seventy-four percent of small-business people believe that Obamacare is a bad idea,\" Elder, a prominent Los Angeles-based conservative talk show host, said during a segment on CNN.", "\"Larry, that’s not true,\" Lemon replied. \"That’s not true.\"", "\"What’s not true?\" Elder asked.", "\"Many people wanted it to be stronger when it came to single-payer,\" Lemon said. \"It all depends on the way you ask the question.\"", "The two men talked over each other for a few seconds before Elder repeated his initial point.", "\"I said 74 percent of the small-business people don’t like Obamacare,\" Elder said.", "So, we wondered, do nearly three-quarters of small-business owners dislike the health care law? We wondered whether Elder’s statement is correct because the host debated the accuracy of Elder’s claim.", "Elder’s executive producer sent us a Washington Examiner article that he used to base his claim. The article’s headline said \"74 percent of small businesses will fire workers, cut hours under Obamacare.\" The article was based on a survey done this past summer by the U.S. Chamber of Commerce.", "The survey was done online, with 1,304 respondents who had an executive-level position in a company with less than 500 employees and annual revenue less than $25 million. About one-third of the respondents were U.S. Chamber of Commerce members. The survey, done by Harris Interactive, was said to be weighted to represent the nation’s small-business population.", "Most of the survey’s respondents were worried about the health care law’s employer mandate that businesses with 50 or more employees must provide insurance for those workers or face a fine.", "The Obama administration announced July 2 that it was delaying the mandate until 2015. Still, those who answered the survey were overwhelmingly concerned about the impact of the mandate on their businesses. Twenty-seven percent of them said they would cut hours to reduce the number of full-time employees on their payrolls, 24 percent would reduce hiring and 23 percent plan to replace full-time employees (30 hours per week or more) with part-time workers to avoid the mandate.", "Combined, that’s 74 percent who said they would find ways to avoid the employer mandate. That’s not exactly the same as saying they believe the entire health care law is a bad idea, as Elder said on CNN.", "This is not the first time someone has used this report to criticize the health care law. U.S. Sen. Marco Rubio, R-Fla., repeatedly claimed \"75 percent of small businesses now say they are going to be forced to either fire workers or cut their hours\" because of the controversial law.", "PolitiFact and The Washington Post found some flaws with the survey. First, while the survey was said to have a margin of error of 2.5 percentage points, it was not a random survey and such margins of error apply only to random samples from a population. Second, the U.S. Chamber of Commerce has been highly critical of the health care law and has called for it to be repealed, so an online survey in which one-third of the respondents are members may not have been the most scientific approach.", "Third, and most disturbing, the U.S. Chamber of Commerce acknowledged that only a small percentage of the businesses surveyed said they would be affected by the employer mandate.", "\"A Chamber spokeswoman, who declined to be identified, acknowledged that only 17 percent of the businesses surveyed said they would be affected by the employer mandate,\" the Post reported. \"Put another way, the poll found that 83 percent of small businesses surveyed said they would not be affected by an employer mandate that the Chamber of Commerce has said is a burden on small businesses. Harris and the Chamber highlighted the answers of only those affected by the employer mandate.\"", "PolitiFact rated Rubio’s claim a Pants On Fire!", "Elder said he was unaware of the criticism of the poll.", "\"I read the methodology, the period of time when the poll was conducted, how it was conducted. Seemed legit,\" Elder said via email.", "Elder said he still believes the poll accurately reflects the feelings of small-business owners concerning the health care law.", "\"When collectively 74 percent -- I know this number is in dispute -- say it will negatively affect hiring decisions, it is not a stretch to conclude that they deem the law a ‘bad’ one,\" Elder said.", "PolitiFact Georgia looked for additional independent polling of small-business owners concerning the health care law. We found there isn’t much out there.", "In May, a Gallup poll found 48 percent of respondents believe the law will be bad for business, 9 percent said it would be good for their company and 39 percent said it will have no impact. Gallup conducted telephone interviews with 603 people whose businesses had less than $20 million in annual revenue.", "A poll by Rasmussen Reports done in October found this breakdown among people who describe themselves as entrepreneurs concerning their impressions of the health care law:", "Very Unfavorable:        49 percent", "Somewhat Unfavorable:    6 percent", "Very Favorable:        16 percent", "Somewhat Favorable:     27 percent", "Not Sure:            1 percent", "We note that the poll does not provide more details about these entrepreneurs, such as whether they are self-employed or how many employees they have.", "To sum up, Elder claimed \"74 percent of small-business people believe that Obamacare is a bad idea.\" There is no independent polling that supports his argument. The numbers that Elder used to base his claim were in response to a different question. Also, the poll that Elder relied on to make his claim is deeply flawed. Still, Elder believes the combined 74 percent of respondents in the U.S. Chamber of Commerce poll who say the health care law may impact future hiring reflects their feelings about Obamacare.", "Elder may have a point, but there is no concrete evidence that supports his argument. We rate his claim False.", "YouTube, CNN clip of Larry Elder, Oct. 11, 2013.", "Emails from Rosemary Jimenez, executive producer for Larry Elder, Oct. 15 & 16, 2013.", "Email from Beth Chunn, Rasmussen Reports, Oct. 15, 2013.", "Gallup poll, \"Half of U.S. Small Businesses Think Health Law Bad for Them,\" May 10, 2013.", "PolitiFact, \"Under Obamacare, ‘75 percent of small businesses now say they are going to be forced to either fire workers or cut their hours,’ \" July 29, 2013.", "U.S. Chamber of Commerce small business outlook study, second quarter 2013, July 16, 2013.", "Washington Examiner, \"74 percent of small businesses will fire workers, cut hours under Obamacare,\" July 16, 2013.", "Washington Post, \"A misleading ‘Obamacare’ poll, courtesy of the Chamber of Commerce and Harris Interactive,\" July 31, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]