["By Eugene Kiely", "Posted on April 16, 2018 | Updated on April 16, 2018", "House Speaker Paul Ryan misleadingly claimed that corporate tax revenues are “still rising,” even though the 2017 tax law cut tax rates. In the first six months of fiscal year 2018, corporate tax receipts have declined by 22.3 percent from a year ago. Revenues are also projected to be less over the next 10 years than they otherwise would have been because of the law.", "Ryan, who recently announced he is leaving Congress in January 2019, discussed his legacy as speaker during an appearance on NBC’s “Meet the Press.” Ryan pointed to the Tax Cuts and Jobs Act that was signed into law on Dec. 22, 2017, as an example of his achievements.", "The bill, among other things, reduced the top corporate tax rate from 35 percent to 21 percent, effective in the 2018 tax year.", "Host Chuck Todd asked Ryan to respond to criticism that the Republican “tax bill spiked the deficit.” The nonpartisan Congressional Budget Office estimates that the fiscal year 2018 deficit will total $804 billion — $139 billion more than in fiscal 2017.", "In response, Ryan blamed rising deficits on mandatory spending. He went on to claim that corporate tax revenues are “still rising,” even though the rate “dropped 40 percent.”", "Todd, April 15: I want you to respond to something Bob Corker said. He said this: “This Congress and this administration likely will go down as one of the most fiscally irresponsible administrations and Congresses that we ever had.” And he’s referring to the fact that this tax bill spiked the deficit. It’s higher than even what was projected. And as — we’re gonna get trillion dollar, you walk away with trillion dollar deficits as far as the eye can see —", "Ryan: That was going to happen. The baby boomers’ retiring was going to do that. These deficit trillion-dollar projections have been out there for a long, long time. Why? Because of mandatory spending, which we call entitlements. Discretionary spending under the CBO baseline is going up about $300 billion over the next 10 years. Tax revenues are still rising. Income tax revenues are still rising. Corporate income tax revenues. Corporate rate got dropped 40 percent, still rising.", "Ryan is right that $1 trillion deficit projections “have been out there for a long, long time.” In a June 2017 report, before the tax bill became law, the nonpartisan Congressional Budget Office estimated that the federal deficit would top $1 trillion in fiscal year 2022 and remain above that level. It’s also true that overall tax revenues are up for the first six months of fiscal year 2018.", "But corporate tax revenues are down for the first six months of the fiscal year, and they are projected to be less over the next 10 years than they otherwise would have been because of the law. In fact, revenues in general will be less than they otherwise would be — resulting in even larger projected deficits. The CBO now projects $1 trillion annual deficits starting in FY2020.", "Each month, the CBO issues an analysis of federal spending and tax revenue collections for the previous month and the fiscal year to date — a report known as the Monthly Budget Review.", "In its most recent report on April 6, CBO said total tax receipts were up 2 percent in the first half of fiscal year 2018, from October to March, compared with the same six-month period in fiscal year 2017.", "However, that same report said corporate tax revenues for the first six months of the year were down $22 billion – a 22.3 percent decline from the first six months of fiscal year 2017.", "Corporate tax revenues declined $10 billion in the final three months of calendar year 2017, from October to December, and fell an additional $12 billion in the first three months of 2018, from January to March, for a total cumulative drop of about $22 billion, according to the CBO monthly reports.", "In its latest Budget and Economic Outlook report, which projects spending and revenue for 10 years, the CBO said it expects “corporate tax receipts to fall by $54 billion in 2018, to 1.2 percent of GDP, largely because of the enactment of the 2017 tax act.”", "CBO projects the federal government will take in $243 billion in corporate tax receipts in fiscal 2018 and $276 billion in fiscal 2019 — both below the $297 billion that the federal government collected from corporations in fiscal 2017. (See Table 3-1.)", "In an email, Ryan’s spokeswoman AshLee Strong told us that the speaker was referring to revenues over a 10-year budget window. She said corporate tax revenue “will nearly double between 2018 and 2028 – from $243 billion to $448 billion,” citing the CBO’s economic outlook report.", "Actually, the increase is about 50 percent, not double, when measured from fiscal year 2017 – before the tax laws changed. Also, CBO projects tax revenues will be less than what the government otherwise would have collected from corporations if the tax laws did not change.", "Over the next 10 fiscal years, from 2018 to 2027, CBO projects that the federal government will take in about $409 billion less in corporate income tax revenue because of legislative changes, mostly those in the new tax law.", "“CBO also reduced its projection of corporate tax revenues — by $94 billion in 2018, and by $409 billion over the 2018–2027 period — to reflect legislative changes,” CBO said in the Budget and Economic Outlook, which was released earlier this month. “Most of that reduction is attributable to the 2017 tax act, which modified the corporate income tax system in many important ways.”", "That $409 billion estimate does not include the potential economic benefits of reducing tax rates. However, when factoring in the economic effects of the new tax law (plus $476 billion) and other technical revisions related to the tax law (minus $333 billion), the CBO estimates a net drop of $266 billion in corporate tax revenue relative to what the government would have collected over 10 years without the 2017 tax law. (See Table A-1.)", "Overall, CBO says the new tax law “increases the total projected deficit over the 2018–2028 period by about $1.9 trillion,” mostly because of a reduction in individual income tax revenue and an increase in debt service.", "Mark Mazur, director of the nonpartisan Tax Policy Center, told us in a phone interview that there may be months or even years when corporate tax revenues increase. There were so many corporate tax changes in the 2017 law that “it’s uncertain when the dollars will show up” in federal coffers. But he said over time the federal government will take in less corporate tax revenue as a result of the new tax law.", "“The whole point of this is to cut corporate taxes,” Mazur said.", "Update, April 16: Ryan’s office responded to us after we posted this item. We have updated our story to reflect its response.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]