["In a radio interview Aug. 23, 2016, Republican National Committee chairman Reince Priebus wrongly interpreted tax forms submitted by the Clinton Foundation to claim that the foundation spends the vast majority of its donations on overhead and not charitable work.", "Speaking on The Mike Gallagher Show, Priebus described the foundation as a way to make the Clintons rich and said he couldn’t find examples of charitable work that they do.", "\"And so, these people ask the question in interviews, especially in the liberal media, you know, well ‘don’t you think they do great work?’ Well, I don’t know what great work they do,\" Priebus said. \"I mean the fact is, is if they’ve got about 80 percent overhead and 20 percent of the money's actually getting into the place that it should, then it seems like the only work that the Clinton Foundation is doing is lining the pockets of Bill and Hillary Clinton. And that, to me, should be investigated …\"", "The claim that 80 percent of the money the foundation raises goes to overhead -- a term used to described expenses that go to management and fundraising costs -- is something that has been made by Carly Fiorina and Rush Limbaugh in varying forms.", "But, despite what Priebus says, it’s an incorrect reading of tax forms submitted by the foundation, experts who monitor and study charitable organizations say. We did not hear back from RNC spokesman Sean Spicer.", "A wrong reading", "Priebus’ case is built on the notion that the only charitable work the Clinton Foundation does is in grant-making and, by extension, everything else is overhead.", "We’ll use the Clinton Foundation’s most recent IRS tax form, for 2014, as an example. (It starts on Page 28 of this document.) The foundation reported total expenses in 2014 of a little over $91 million but grants of just $5.1 million. That’s close to 6 percent of the foundation’s money being spent on grants.", "Over a five-year period from 2009-12, the foundation raised over $500 million, the conservative website The Federalist reported, but only 15 percent of that, or $75 million, went toward grants.", "But that doesn’t mean everything else is overhead, people who monitor charities and their practices say.", "\"Although it has ‘foundation’ in its name, the Clinton Foundation is actually a public charity,\" Brian Mittendorf, a professor of accounting at Ohio State University’s Fisher College of Business, wrote in the Chronicle of Philanthropy. \"In practical terms, this means both that it relies heavily on donations from the public and that it achieves its mission primarily by using those donations to conduct direct charitable activities, as opposed to providing grants from an endowment.", "\"Failure to understand the difference led to the widespread claim (covered by the New York Post, Rush Limbaugh, Fox News, and others) that only a small portion of Clinton Foundation spending goes toward charity. While measuring charitable endeavors by the amount of grants awarded may be appropriate for many private foundations, it is not for an organization that acts as a direct service provider like the Clinton Foundation.\"", "What kind of activities?", "The Clinton Development Initiative is helping farmers in Malawi grow and sell more crops and has built a warehouse where farmers can store their crops for sale. The foundation is doing something similar for coffee farmers in Haiti.", "In 2013, the Clinton Giustra Enterprise Partnership launched the Acceso Centro de Formacion to provide job training for people in Cartagena, Colombia.", "A lot of what the foundation does is have its employees help facilitate partnerships.", "The Clinton Health Access Initiative, for instance, has gotten credit for providing access to lower-cost drugs for millions of people with HIV/AIDS. The foundation program consolidated both the supply of raw materials to make the drugs and the bidding to supply the finished product. The result was lower production costs and lower drug prices. Today, the initiative tracks the going price for a menu of treatments and posts them to help health departments around the world as they negotiate with drug companies.", "Mittendorf and other people who study charities say the most general way to address how much a group spends on charities versus overhead is to look at the audited financial statements that consolidate the financial results of the entities that make up the Clinton Foundation. That include the Clinton Health Access Initiative, Clinton Global Initiative, Clinton Climate Initiative, Clinton Giustra Sustainable Growth Initiative, Clinton Development Initiative, and Clinton Health Matters Initiative.", "Financial statement rules require a nonprofit to split its expenses between program services, fundraising, and management/general costs (the latter two are collectively what are referred to as \"overhead\"), Mittendorf told us.", "He said that in 2014, 87.2 percent of the Clinton Foundation’s expenses were on program services.", "\"Of course, this only speaks to how the organization used its funds and not whether that 87.2 percent was allocated to the most effective program efforts, but it is all we have in terms of verifiable data on this question,\" Mittendorf said.", "The American Institute of Philanthropy’s Charity Watch, reached the same conclusion. It has given the Clinton Foundation an A rating and says it spends only 12 percent of the money it raises on \"overhead.\"", "\"The Clinton Foundation is an excellent charity,\" Charity Watch president Daniel Borochoff said Aug. 24, 2016, on CNN. \"They are able to get 88 percent of their spending to bona fide program services and their fundraising efficiency is really low. It only costs them $2 to raise $100.\"", "Sandra Minuitti at the group Charity Navigator used the same general calculation when talking to our colleagues FactCheck.org, though she did not include the Clinton Foundation’s affiliates. By that measure, in 2013, 80.6 percent of spending was on program services.", "Our ruling", "Priebus said, \"The fact is\" the Clinton Foundation has \"got about 80 percent in overhead and 20 percent of the money is actually getting into the places it should.\"", "Priebus is incorrectly reading IRS documents. Only a small amount of the donations collected by the Clinton Foundation are awarded as grants to other nonprofit groups. But that doesn’t mean that every other dollar is \"overhead.\"", "The Clinton Foundation spends between 80-90 percent on program services, which experts say is the standard in the industry to define charitable works. It spends the majority of its money directly on projects rather than through third-party grants.", "Conversely, only between 10-20 percent is spent on management of the foundation and fundraising activities, which is tagged as \"overhead.\"", "Priebus’ claim rates False.", "The Mike Gallagher Show, Aug. 23, 2015", "Politico, Priebus to FBI director: 'Get back to work' on Clinton, Aug. 23, 2016", "Factcheck.org, Where Does Clinton Foundation Money Go?, June 19, 2015", "PolitiFact, Rush Limbaugh says Clinton Foundation spends just 15 percent on charity, 85 percent on overhead, April 29, 2015", "Clinton Foundation 2014 audited financial report, accessed Aug. 24, 2016", "The Federalist, The U.S. Constitution Actually Bans Hillary’s Foreign Government Payola, March 2, 2015", "Chronicle of Philanthropy, How to Understand the Clinton Foundation, June 8, 2015", "Email interview, Brian Mittendorf, Aug. 24, 2016", "Email interview, Craig Minassian, Aug. 24, 2016", "Charity Watch, Clinton Foundation report, accessed Aug. 24, 2016", "CNN, interview with Daniel Borochoff, Aug. 24, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]