["By Angelo Fichera", "Posted on March 13, 2018 | Updated on July 6, 2018", "Q:  Did President Donald Trump sign an order allowing veterans to get full medical bills paid at hospitals outside the VA?", "A: No, but Trump has continued a program that allows some veterans to seek outside care.", "There is a FB post going around saying veterans are 100% covered at any hospital, a bill signed by President Trump. Is this so?", "A Facebook post shared and continually reposted in recent days claims that President Donald Trump “signed an executive order allowing our veterans to get 100% medical bills paid at hospitals other than a V.A. hospital.”", "But no such executive order was ever signed, as evidenced by a review of Trump’s more than 60 orders made between 2017 and 2018.", "Several readers inquired with FactCheck.org about the veracity of the claim.", "We looked at news reports and White House statements and could find no evidence to support the post, which in one instance was shared more than 209,700 times. It reads in full:", "“For all the Trump haters; today President Trump signed an executive order allowing our veterans to get 100% medical bills paid at hospitals other than a V.A. hospital. This will save the lives of many American service men and women who have been on V.A. waiting lists, some for years and many dying while waiting. Now they can go to ANY hospital they want… This is how our veterans SHOULD be treated!!! Thanks President Trump!!!”", "That’s not to say that Trump hasn’t used his signature to address veterans’ issues.", "The president has continued the Veterans Choice Program, a program started in 2014 following a scandal over wait times at Veterans Affairs facilities. The program was created through the Veterans Access, Choice, and Accountability Act, a bipartisan bill that was signed by President Barack Obama.", "The Veterans Choice Program allows some veterans who experience difficulty obtaining care from a Veterans Affairs medical facility to seek care elsewhere. To qualify, veterans must be enrolled in the VA health care system and demonstrate certain barriers to using the VA system (such as wait time or distance).", "In 2017, Trump signed a bill that eliminated the program’s expiration date and twice signed legislation (in August and December) that authorized funding to keep the program afloat.", "The Veterans Choice Program doesn’t necessarily guarantee everything is free, either. Some veterans could have copayments under the VA system — determined by financial assessments — and are still responsible for those payments under the choice program, according to the VA. The VA reports that “while most Veterans receive cost-free care and services based on eligibility factors, such as service connection and/or income, the 2016 average annual out-of-pocket costs for all other Veterans was just $320.”", "Trump also has used executive orders to advance veterans-specific policies, including one aimed at increasing accountability at the VA and adding protections for whistleblowers. Another extends mental health coverage to all veterans during the first-year transition back to civilian life.", "Update, July 6: On June 6, Trump signed the VA MISSION Act of 2018, a bipartisan bill that calls for a number of changes at the VA. The new law continues the Veterans Choice Program for a year, but then replaces it with the Veterans Community Care Program.", "The new program expands the criteria for those who seek care outside of the VA health care system. For example, it allows a veteran to go to a private provider if the “covered veteran and the covered veteran’s referring clinician agree that furnishing care and services through a non-Department entity or provider would be in the best medical interest of the covered veteran.”", "The Congressional Budget Office estimated that “in the early years of the program, roughly 640,000 additional veteran patients would be referred out to community care each year.” The law also requires the VA to provide veterans access to walk-in care from non-VA providers; the veterans may be required to pay copayments, as determined by the VA.", "“10 Things to Know About the Veterans Choice Program.” U.S. Department of Veterans Affairs. 10 May 2017.", "“2017 Donald Trump Executive Orders.” Federal Register. Accessed 12 Mar 2018.", "“2018 Donald Trump Executive Orders.” Federal Register. Accessed 12 Mar 2018.", "“Health Benefits.” U.S. Department of Veterans Affairs. Accessed 13 Mar 2018.", "“The Affordable Care Act, VA, and You.” U.S. Department of Veterans Affairs. Accessed 13 Mar 2018.", "Trump, Donald J. Executive Order 13793. 27 Apr 2017.", "Trump, Donald J. Executive Order 13822. 9 Jan 2018.", "U.S. Department of Veterans Affairs, Office of Inspector General. “Review of Alleged Patient Deaths, Patient Wait Times, and Scheduling Practices at the Phoenix VA Health Care System.” 26 Aug 2014.", "U.S. House. “H.R. 1370, An Act to amend the Homeland Security Act of 2002 to require the Secretary of Homeland Security to issue Department of Homeland Security-wide guidance and develop training programs as part of the Department of Homeland Security Blue Campaign, and for other purposes.” 22 Dec 2017.", "U.S. House. “H.R. 3230, Veterans Access, Choice, and Accountability Act of 2014.” 7 Aug 2014.", "U.S. Senate. “S. 114, VA Choice and Quality Employment Act of 2017.” 12 Aug 2017.", "U.S. Senate. “S. 544, A bill to amend the Veterans Access, Choice, and Accountability Act of 2014 to modify the termination date for the Veterans Choice Program, and for other purposes.” 19 Apr 2017.", "“Veterans Access, Choice and Accountability Act | About the Choice Program.” U.S. Department of Veterans Affairs. Accessed 12 Mar 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]