["An intensive care unit staff member cares for a COVID-19 patient on April 20, 2020, at St. Joseph's Hospital in Yonkers, N.Y. (AP/Minchillo)", "Reputable scientists warned early in the outbreak that there was not a totally accurate picture of how deadly the coronavirus was. There’s still not.", "It’s misleading to compare, as Carlson did, the early reported case fatality rates, which reflect deaths among confirmed COVID-19 patients, with more recent infection fatality rates that estimate the death rate for all infected people.", "COVID-19 still appears more lethal than the seasonal flu, experts said. Infection fatality rates that may seem small can lead to mounting death tolls.", "Fox News host Tucker Carlson railed against continued statewide shutdowns meant to slow the spread of the coronavirus, claiming in a recent TV segment that they did little to flatten the curve and that \"the virus just isn’t nearly as deadly as we thought it was.\"", "Citing recent studies from hotspots such as New York, Carlson said the virus is \"a full order of magnitude less deadly\" than public health officials warned.", "\"The virus just isn’t nearly as deadly as we thought it was, all of us, including on this show,\" he said. \"Everybody thought it was, but it turned out not to be.\"", "More than 65,000 Americans have died from COVID-19, the disease caused by the coronavirus, according to the Centers for Disease Control and Prevention. That’s in spite of widespread mitigation efforts to reduce the spread. So how deadly is it?", "Estimating the lethality of COVID-19 has been a key question for epidemiologists. In the middle of a pandemic, moving targets make the death rate difficult to pin down.", "But experts told us Carlson’s statement is off-track. Many early mortality estimates were based on official counts of confirmed cases, but epidemiologists were consistent in saying those raw numbers didn’t reflect the virus’s deadliness with complete precision.", "Ideally, epidemiologists could divide the number of deaths by the number of infections to calculate what’s known as the \"infection fatality rate.\" But there’s no way to get a complete count of the number of infected individuals, largely because so many mild cases go unreported.", "Jeffrey Shaman, an epidemiologist at Columbia University, said there could be as many as 12.5 COVID-19 infections for every confirmed case in the U.S.", "Still, scientists work with the data they have, even if it’s evolving and varies with patient demographics and location. Some of the first widely reported death rates were what are called \"case fatality rates,\" which are calculated by dividing the number of known deaths by the number of reported cases.", "On March 3, for example, the World Health Organization announced that 3.4% of confirmed coronavirus patients around the world had died — a case fatality rate.", "Experts told us at the time that the 3.4% was only a snapshot, and one that likely undercounted people with mild symptoms. A WHO spokesperson said it would \"change over time.\"", "The global case fatality rate has actually risen since then. As of May 3, the WHO had tallied 3,349,786 confirmed cases worldwide and 238,628 deaths, for a case fatality rate of about 7%.", "Now, tests for antibodies in the blood of people exposed to the coronavirus are offering the first glimpses at what the infection fatality rate could be in states such as New York and California.", "The tests haven’t all been as accurate as many experts would like, and the studies of them haven’t all been peer-reviewed. \"It remains very clear that we do not know the precise mortality of COVID-19 infection,\" said the University of North Carolina at Chapel Hill’s Myron Cohen.", "But their preliminary results suggested the infection fatality rate may be below 1%, handing fodder to some who say the COVID-19 threat is overblown.", "Carlson said the new information shows COVID-19 is less deadly than expected.", "On his show, he cited widely disputed findings from two California doctors. A Fox News spokesperson also pointed to a White House press conference, a JP Morgan chart, and recent antibody studies in California and New York to support it.", "But Shaman, the epidemiologist, said Carlson was \"cherry-picking evidence.\"", "Many early figures were case fatality rates, while the estimates reported as a result of recent antibody studies are infection fatality rates. They shouldn’t be conflated, Shaman said.", "Seemingly small infection fatality rates can also cause mounting deaths. The New York study showed the state’s infection fatality rate to be around 0.5%, Gov. Andrew Cuomo said.", "That matches estimates from a model Shaman constructed, which he said put the U.S. infection fatality rate at 0.56%. But in a worst-case scenario where 70% of Americans are infected, a 0.5% rate could amount to 1.2 million U.S. deaths, Shaman said.", "And as we’ve reported, the death toll may be higher than we know.", "The infection fatality rate for the flu, which kills thousands of Americans annually, hovers under 0.1% and is calculated annually using a mathematical model that estimates the disease burden.", "There are other problems with Carlson’s sources, including the clip he played of one of two California physicians who gained national attention for calling to end the shutdowns.", "The doctors, who own an urgent care clinic, used the infection rate among patients tested at their clinic to extrapolate to the entire state and put the death rate at a tiny 0.03%.", "The University of Washington’s Carl Bergstrom wrote on Twitter that this amounts to \"sampling bias\" because patients at an urgent care clinic likely think they’re sick. The doctors’ calculations are like \"estimating the average height of Americans from the players on an NBA court,\" he said.", "The problem with this approach is that during a pandemic, the people who come into an urgent care clinic are not a random sample of the population. A large fraction of them are coming in precisely because they suspect that they have the disease.This generates sampling bias.", "The video was \"emphatically condemn(ed)\" by the American College of Emergency Physicians and the American Academy of Emergency Medicine; it was also removed from YouTube.", "Another report cited by the Fox News spokesperson, from the University of Southern California, followed a controversial study from Stanford University.", "A number of experts have since warned that both studies used antibody tests known to yield false positive results. (A USC spokesperson said results were adjusted to account for that.)", "Carlson’s claim that COVID-19 was projected to be deadlier for infected patients also discounts what many experts said months ago.", "\"No one knowledgeable thought it was as deadly as known deaths divided by known cases,\" said Marc Lipsitch, professor of epidemiology at the Harvard T.H. Chan School of Public Health.", "\"Every responsible epidemiologist has been saying that the number of cases is certainly more than those we know about, especially in the U.S., where testing has been inadequate.\"", "Many experts, including Dr. Anthony Fauci, the nation’s top infectious disease expert, said preliminary case fatality rates could be inflated. The WHO said early on, including in mid- February, that the infection fatality rate would be lower than the initial case fatality rates.", "The Imperial College of London, which projected in March that the U.S. could see 2.2 million deaths if it had no response, estimated that 0.9% of infected COVID-19 patients would die.", "\"It is surprisingly mild only to those who were not listening to competent epidemiologists, and it is in fact considerably worse than seasonal flu,\" Lipsitch said.", "Carlson said the coronavirus \"just isn’t nearly as deadly as we thought it was.\"", "Scientists warned early in the outbreak that the raw number of confirmed cases didn’t give a fully accurate picture of mortality.", "It’s misleading for Carlson to compare early case fatality rates — which divide the number of known deaths by the number of confirmed cases — with newer estimates of the infection fatality rate. The infection fatality rate should be lower, as experts have said for months.", "It’s premature to say as a matter of fact that a far rosier picture has emerged.", "We rate this statement Mostly False.", "Fox News on YouTube, \"Tucker: Are coronavirus lockdowns working?\" April 27, 2020", "The World Health Organization, \"Coronavirus disease (COVID-19) Situation Report – 104,\" May 3, 2020", "Centers for Disease Control and Prevention, \"Cases in the U.S.,\" accessed May 3, 2020", "Columbia University, \"Reconciling Diverse Estimates of COVID-19 Infection Rates,\" accessed April 29, 2020", "NBC News, \"YouTube, Facebook split on removal of doctors' viral coronavirus videos,\" April 29, 2020", "The New York Times, \"U.S. Coronavirus Death Toll Is Far Higher Than Reported, C.D.C. Data Suggests,\" April 28, 2020", "JP Morgan, \"Eye on the Market,\" April 28, 2020", "The Washington Post, \"Beware of studies claiming covid-19 death rates are smaller than expected,\" April 28, 2020", "The Washington Post, \"Antibody tests support what’s been obvious: Covid-19 is much more lethal than the flu,\" April 28, 2020", "The Mercury News, \"Cue the debunking: Two California doctors go viral with dubious COVID test conclusions,\" April 28, 2020", "CNN, \"Coronavirus antibody tests have \"really terrible\" accuracy, researcher says,\" April 28, 2020", "The Washington Post, \"U.S. deaths soared in early weeks of pandemic, far exceeding number attributed to covid-19,\" April 27, 2020", "American College of Emergency Physicians, \"ACEP-AAEM Joint Statement on Physician Misinformation,\" April 27, 2020", "The Daily Beast, \"Tucker Carlson: Coronavirus ‘Isn’t Nearly as Deadly as We Thought,’\" April 27, 2020", "Bakersfield.com, \"Local doctors' assertions on COVID-19 make waves on social media, attract national attention,\" April 27, 2020", "New York State, \"Video, Audio, Photos & Rush Transcript: Amid Ongoing Covid-19 Pandemic, Governor Cuomo Announces Phase II Results of Antibody Testing Study Show 14.9% of Population has Covid-19 Antibodies,\" April 27, 2020", "Andrew Cuomo on Twitter, April 27, 2020", "CNBC Television, \"New York Gov. Cuomo holds a briefing on the coronavirus outbreak - 4/27/2020,\" April 27, 2020", "Carl T. Bergstrom on Twitter, April 27, 2020", "ABC News, \"A reality check on antibody testing: How do we race forward thoughtfully?\" April 26, 2020", "The New York Times, \"Coronavirus Antibody Tests: Can You Trust the Results?\" April 24, 2020", "Forbes, \"Scientists Widely Criticize Studies That Claim Coronavirus Death Rate Could Be Far Lower Than Believed,\" April 21, 2020", "Wired, \"New Covid-19 Antibody Study Results Are In. Are They Right?\" April 21, 2020", "The University of California, Berkeley, \"Total COVID-19 Mortality in Italy: Excess Mortality and Age Dependence through Time-Series Analysis,\" April 20, 2020", "University of Southern California, \"Preliminary results of USC-LA County COVID-19 study released,\" April 20, 2020", "Eric Topol on Twitter, April 20, 2020", "Natalie E. Dean, PhD on Twitter, April 17, 2020", "Stanford University, \"COVID-19 Antibody Seroprevalence in Santa Clara County, California,\" April 11, 2020", "The White House, \"Remarks by President Trump, Vice President Pence, and Members of the Coronavirus Task Force in Press Briefing,\" April 6, 2020", "Columbia University, \"Initial Simulation of SARS-CoV2 Spread and Intervention Effects in the Continental US,\" March 27, 2020", "The World Health Organization, \"Q&A: Similarities and differences – COVID-19 and influenza,\" March 17, 2020", "Imperial College COVID-19 Response Team, \"Report 9: Impact of non-pharmaceutical interventions (NPIs) to reduce COVID-19 mortality and healthcare demand,\" March 16, 2020", "Fox News, \"Tucker Carlson: The coronavirus will get worse -- our leaders need to stop lying about that,\" March 10, 2020", "The New England Journal of Medicine, \"Covid-19 — Navigating the Uncharted,\" Feb. 28, 2020", "The World Health Organization, \"Coronavirus disease 2019 (COVID-19) Situation Report – 30,\" Feb. 19, 2020", "Reuters, \"Data suggests virus infections under-reported, exaggerating fatality rate,\" Feb. 5, 2020", "PolitiFact, \"Antibody tests: The promise and pitfalls of using them to reopen the US,\"", "PolitiFact, \"COVID-19 skeptics say there’s an overcount. Doctors in the field say the opposite,\" April 14, 2020", "PolitiFact, \"Why it’s hard to estimate the coronavirus death rate this early,\" March 6, 2020", "Email interview with Leigh Hopper, media relations specialist at the University of Southern California, April 29, 2020", "Email correspondence with George Rutherford, professor of epidemiology and biostatistics at the University of California, San Francisco, April 29, 2020", "Email interview with Marc Lipsitch, professor of epidemiology at the Harvard T.H. Chan School of Public Health, April 29, 2020", "Email interview with Jeffrey Shaman, professor of environmental health sciences at Columbia University, April 29, 2020", "Email interview with Myron Cohen, director of the Institute for Global Health and Infectious Diseases at the University of North Carolina at Chapel Hill’s School of Medicine, April 29, 2020", "Statement from Fox News, April 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]