["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Is the Air Force preparing to spend precious taxpayer funds as it faces sequester-driven budget cuts on a fantasy football league ?", "On blogs and on Twitter on March 20, 2013, people buzzed that it was the case, with a link to back it up.", "\"What sequester? Air Force wants taxpayers to fund fantasy football league,\" read a headline at WashingtonExaminer.com.", "\"Spared by the Sequester, So Far: Air Force Fantasy Football Program,\" said another at NationalReview.com.", "\"Forget Budget Cuts,\" said Wired.com. \" Air Force Is Ready for Some (Fantasy) Football.\"", "Some stories credited tips from a co-founder of conservative site RedState.com or a writer there.", "Does the Air Force want \"taxpayers\" to fund a fantasy sports league? Not so fast.", "Not your money", "Bloggers had noticed a March 19 \"request for information\" from an Air Force contracting office \"seeking sources for providing the Air Force installations a Fantasy Football Program.\"", "The Air Force’s original request for information included some clues that taxpayers might not be involved.", "It mentioned the personnel center services division, and the Air Force’s \"nonappropriated\" purchasing office.", "The personnel center services division runs recreation and leisure programs for Air Force members and their families around the world, including clubs, bowling, golf, fitness, arts and crafts, and recreational shooting. It also manages the Air Force’s \"nonappropriated funds\" — money that comes from fees and other cash collected from airmen and their families who take part.", "That is to say: Money that doesn’t come from Congress.", "It’s not taxpayer money, and it’s not subject to budget cuts under the sequester.", "But it’s not a small amount of money, with tens of millions of dollars from overseas on-base slot machines alone.", "It even supports a different type of federal employee, not considered federal civil servants because they’re not funded through normal congressional appropriations. Those employees run the activities and programs that also include things like restaurants, youth centers, and auto and wood shops.", "The goal of all these programs, sometimes called \"MWR\" for morale, welfare and recreation, is just what it sounds like: to boost troop morale.", "And, for 17 years, they’ve included an annual program called the \"Football Frenzy,\" said Air Force spokesperson Laurel Tingley. In 2011, for example, airmen who joined the Air Force Services Clubs could win a trip to the Super Bowl.", "This year, the personnel center services division wanted to find out what it would take to add fantasy football to the Frenzy.", "Thus, the request for \"information and pricing on providing product branding, hosting, managing, and delivering all programs and materials related to running a Fantasy Football League,\" that would serve airmen, civilians and family members at \"over 100 installations worldwide.\"", "\"What we're looking at doing is enhancing a program that airmen have enjoyed for 17 years,\" Tingley said. \"And the entire program is funded through (nonappropriated funds).\"", "Tingley didn’t have details about exactly what the Air Force sought to create, but a fantasy football league wouldn’t have been unplowed ground in the world of military morale — the Navy organized a fantasy football contest with commercial sponsors in 2010 that offered a grand prize of $100,000.", "On March 21, 2013, the Air Force updated its request to say:", "\"This RFI is issued by the Air Force Nonappropriated Fund Purchasing Office (AFNAFPO). All requirements, solicitations and subsequent contracts, if any, awarded through AFNAFPO are funded wholly with Nonappropriated funds. These funds are generated through user fees and charges at Air Force morale, welfare and recreation (MWR) programs worldwide.  THEY ARE NOT APPROPRIATIONS FROM CONGRESS OR 'TAXPAYER' DOLLARS.\"", "By noon on March 22, 2013, it had canceled the request.", "Our ruling", "Headlines across the blogosphere and shared via social media suggested the Air Force wanted taxpayers to a fund fantasy football league — a charged claim as defense budgets face mandatory cuts.", "But the evidence was a \"request for information,\" not a final decision to fund anything. Meanwhile, any money at stake wouldn’t have come from taxpayers, but \"nonappropriated funds\" generated by Air Force clubs and other activities designed to boost morale. We rate the claim False.", "FedBizOpps.gov, \"Fantasy Football Program,\" updated March 22, 2013", "Interview with Lt. Col. Laurel Tingley, spokesperson for U.S. Air Force, March 22, 2013", "Email interview with Russell Rumbaugh, Stimson Center, director of budgeting for foreign affairs and defense, March 21, 2013", "Air Force Services Clubs, \"Football Frenzy: Win a trip to the Super Bowl!\" accessed March 22, 2013", "Washington Examiner, \"What sequester? Air Force wants taxpayers to fund fantasy football league,\" March 20, 2013", "Wired, \"Forget Budget Cuts — Air Force Is Ready for Some (Fantasy) Football,\" March 20, 2013", "National Review Online, \"Spared by the Sequester, So Far: Air Force Fantasy Football Program,\" March 20, 2012", "Government Executive, \"Air Force Wants Help Running Fantasy Football League,\" March 21, 2013", "DoD Buzz, \"Air Force issues a formal fantasy football RFI,\" March 21, 2013", "Air Force Personnel Center, \"Services,\" accessed March 22, 2013", "Air Force NAF Jobs, \"What is NAF Employment?\" accessed March 22, 2013", "Air Force, \"AF leaders: Sequestration, more budget cuts will be devastating,\" Feb. 14, 2013", "Air Force Personnel Center, \"Sequestration impacts ripple across Air Force,\" March 8, 2013", "Air Force Personnel Center, \"Pentagon delays sending furlough notices to civilian workforce,\" March 21, 2013", "Defense.gov, \"Sequestration: Across-the-board budget cuts could threaten national security,\" accessed March 22, 2013", "Joint Base McGuire-Dix-Lakehurst, \"Navy MWR program kicks off fantasy football contest,\" Aug. 20, 2010", "Stars and Stripes, \"USFK responds to illegal-gambling reports,\" Jan. 30. 2008", "CNN, \"Military uses slot machines to fund overseas recreation,\" May 22, 2007", "New York Times, \"Temptation to Gamble Is Near for Troops Overseas,\" Oct. 19, 2005", "Air Force Manual, \"AIR FORCE SLOT MACHINE PROGRAM OPERATIONS, CONTROLS, AND PROCEDURES,\" April 4, 2003", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]