["This Facebook post was published on March 1, 2019.", "Below is a screenshot of the misleading post:", "The post’s caption states, in part: “1986 FACT / Arturo Tolentino was the duly elected Vice President of the Republic of the Philippines in 1986. Marcos left the palace because of the the people power revolt led by the YELLOW COALITION. / According to the contitutions [sic], the VP authomatically [sic] becomes the President if the President dies or removed from the office. Therefore, CORY AQUINO's Presidency is unconstitutional. TOLENTINO is the REAL President from 1986 to 1992.”", "The caption refers to the 1986 Philippines presidential elections that saw the toppling of dictator Ferdinand Marcos, ending his 20-year rule.", "When the incumbent Marcos and his running mate Arturo Tolentino proclaimed themselves victor of the presidential elections on February 20, 1986, a vote marred by widespread reports of electoral fraud, Aquino and the opposition led a four-day demonstration that resulted in a wave of military defections and a prolonged nationwide strike. Marcos departed for exile in Hawaii and Aquino was sworn in as the elected President on February 25.", "Information sheets have been published by the government about the 1986 elections here and the People Power Revolution here.", "A similar claim, published alongside a photo of Tolentino, have also been shared on Facebook here, here and here.", "The claim is misleading; the Philippine Supreme Court ruled former President Corazon Aquino’s government legitimate at least twice in 1986.", "In this May 22, 1986 ruling, the Supreme Court resolved three petitions which questioned the legality of Aquino’s presidency, saying “the people have made the judgment”.", "The court said, in part: “For the legitimacy of the Aquino government is not a justiciable matter. It belongs to the realm of politics where only the people of the Philippines are the judge. And the people have made the judgment; they have accepted the government of President Corazon C. Aquino which is in effective control of the entire country so that it is not merely a de facto government but is in fact and law a de jure government. Moreover, the community of nations has recognized the legitimacy of the present government.”", "Below is a screenshot of the court’s resolution:", "The court again ruled on October 24, 1986, dismissing another petition questioning the validity of Aquino’s government: “There can be no question that President Corazon C. Aquino and Vice-President Salvador H. Laurel are the incumbent and legitimate President and Vice-President of the Republic of the Philippines.”", "Below is a screenshot of the resolution:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]