["A picture is worth a thousand words, and one photo of a young girl crying with a man’s arm around her shoulder and an ISIS flag in the background is provoking a lot of words — and assumptions — on social media.", "But the image, now turned into a meme, is spreading an inaccurate message about what’s really going on.", "On social media, text above and below the photo says, \"To all you misguided, uninformed liberal ‘women’ demonstrating in favor of embracing Islam. This young lady is being sold into sexual slavery as a child bride. She is a Christian. She watched her father beheaded and her mother raped. Where is her safe place?\"", "The photo was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The picture is actually a screengrab from a video of a 2013 Quran recitation competition organized by the Islamic State in Aleppo. A reverse-image search led us to a 2014 report on the contest by Morocco World News, which explains that the girl began to cry during the event after she made mistakes during her recitation:", "\"The video shows the ISIS member, who was misleadingly presented as the young girl’s groom, having a small chat with her before she recites verses of the Quran.", "Feeling embarrassed for making several mistakes during her recitation, Ghada, the young girl, starts crying before the man returns. He then clearly tries to comfort her and boost her spirits.\"", "AFP Canada (along with other fact-checking websites) also evaluated the miscaptioned photo, and an Arabic-speaking AFP journalist confirmed from the video that the girl is reciting chapter 112 of the Quran.", "\"She made some errors so the man helps her, and he says, ‘Ma sha Allah (Bravo), can you give me two other chapters?’\" the AFP journalist is quoted saying in the story. \"She recites the chapter 113 and the man asks the crowd, ‘Who is the winner?’ Apparently the girl wasn’t happy after the crowd's answer, so she started to cry.\"", "We could find no other account in which the girl was reported to be a child bride or a Christian who just witnessed her father being \"beheaded and her mother raped.\"", "We know that child marriage is a serious global issue affecting the lives of one in every five girls who is married or in a union before age 19, according to the United Nations Population Fund.", "\"In the least developed countries,\" UNFPA reports, \"that number doubles – 40 percent of girls are married before age 18, and 12 percent of girls are married before age 15.\"", "But instead of raising awareness about the practice, some social media posts are spreading misinformation.", "We rate this Pants on Fire!", "Facebook post, May 6, 2019", "TinEye, Reverse-image search, Accessd May 7, 2019", "Facebook video, Accessed May 7, 2019", "Morocco World News, Truth Behind Alleged Marriage of ISIS Member with 7-Year-Old Girl, Aug. 18, 2014", "FactCheckAFP, No, this picture does not show a girl being sold into sexual slavery as a child bride, March 20, 2019", "UNICEF, Child Marriage, March 2018", "UNFPA, Child Marriage, Accessed May 7, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]