["The claim was published on Facebook here on February 26, 2020.", "Below is a screenshot of the misleading post:", "The post’s Hindi caption translates to English as: “Delhi police in full action along with the rioters.”", "In recent weeks, Delhi has experienced its worst sectarian violence in decades. At least 50 people have been killed in the violent clashes, as reported here by AFP on March 7, 2020.", "The photo was also posted alongside a similar claim here, here and here on Facebook; and here and here on Twitter.", "The claim is false.", "A reverse Google image search found the photo was in fact taken by AFP on December 19, 2019, during protests in Lucknow.", "Below is a screenshot comparison of the photo in the misleading Facebook post (L) and the AFP photo (R) :", "The AFP photo caption reads as: “Police throw stones towards protesters during demonstrations against India's new citizenship law in Lucknow on December 19, 2019. Indians defied bans on assembly on December 19 in cities nationwide as anger swells against a citizenship law seen as discriminatory against Muslims, following days of protests, clashes, and riots that have left six dead.”", "Deadly unrest also broke out in other cities across India in late 2019 over the citizenship law. Here is an AFP report about the protests.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]