["TMC supporter Garga Chatterjee tweeted photographs of a man dressed as Hanuman and said that he was “Jagannath Sarkar, BJP MP candidate from Ranaghat” in West Bengal (archive).", "Several other users also shared images of the man sitting on a jeep’s bonnet and claimed that he was BJP’s Ranaghat candidate during a rally.", "The claim is circulated on Facebook and Twitter alike.", "The photographs viral on social media depict the Bharatiya Janata Party’s recent rally in West Bengal’s Ranaghat constituency. Dilip Ghosh, president of the BJP WB unit, had shared the images on April 22 with the caption – “রানাঘাট লোকসভা কেন্দ্রে প্রার্থী জগন্নাথ সরকারকে নিয়ে রোড শো (Roadshow with Ranaghat Lok Sabha constituency candidate Jagannath Sarkar).” Ghosh had uploaded several photographs, including the ones where a man dressed as Hanuman can be seen seated atop a jeep.", "রানাঘাট লোকসভা কেন্দ্রে প্রার্থী জগন্নাথ সরকারকে নিয়ে রোড শো ( বাদকুল্লা-খামার সিমি- চিত্রশালী বাজার – ফুলবাড়ি.. )। “সাধারণ মানুষের বিজেপির প্রতি ব্যাপক উচ্ছাস”", "#BJP4Krishnaganj #Ranaghat4SonarBangla", "Posted by Dilip Ghosh on Monday, 22 April 2019", "If one were to scroll through the other images, Jagannath Sarkar can be seen campaigning alongside Ghosh, and he is not dressed as Hanuman.", "Social media claims are, therefore, false.", "The ongoing Lok Sabha elections have given rise to a considerable amount of misinformation circulated with regard to the polls in West Bengal – a 2017 video from Gujarat was shared as Rohingya and Bangladeshi refugees mistreating BJP workers; one of BJP’s candidates from the state tweeted a video from Bihar to claim that a party worker was attacked by TMC; both BJP and Congress were accused of booth capturing using the same, misleading video.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]