["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Buses with immigrants arrive at the Federal Courthouse in McAllen, Texas on June 21, 2018.", "A popular pro-Donald Trump Twitter account cast blame for family separations at the border on former Democratic presidents of decades past.", "\"Bill Clinton passed a law in 1996 that separated children from adults illegally entering America. And liberals cheered,\" Education for Liberals tweeted. \"(Barack) Obama enforced this same law throughout his entire presidency. And liberals cheered. President Trump is now left to ‘deal with it.’ And liberals are angry.\"", "Bill Clinton passed a law in 1996 that separated children from adults illegally entering America.And liberals cheered.Obama enforced this same law throughout his entire presidency.And liberals cheered.President Trump is now left to “deal with it.”And liberals are angry.", "We’ve previously compared the practices of Trump and Obama when it came to separating families.", "Did Clinton pass a law that separated children from their parents?", "The Twitter user did not respond to multiple requests for comment. We found two major policies relating to immigration that went into effect during the Clinton administration, but neither did what the tweets said.", "Clinton signed an aggressive crackdown on illegal immigration in 1996. But it had no provisions mandating the separation of families, experts told us.", "The biggest change the legislation brought about for families was deporting immigrants who were once legally in the United States but now subject to deportation because of a criminal conviction.", "\"The 1996 reforms made it easier to remove previously legal immigrants (many of whom had married, settled down, and had kids in the United States) for criminal conviction that had previously not made them eligible for removal,\" said Rick Su, an immigration law professor at University of Buffalo.", "\"Adult noncitizens who were removed sometimes chose to have U.S. citizen kids remain in the United States,\" said Peter Marguiles, law professor at Roger Williams University. \"But that was a choice made by parents, not a decision by the government.\"", "The Trump administration’s zero-tolerance policy that has resulted in family separations doesn’t stem from the enforcement of this law, however, but entry without inspection, which had been on the books for decades prior to 1996, Adam Cox, immigration law professor at NYU, told us.", "Despite the law on the books, immigrants entering the country illegally as families were rarely criminally prosecuted before the Trump administration. Immigrants with criminal records or illegally re-entering the country were prioritized for prosecution during more recent administrations.", "Of late, however, the government has cracked down on parents and children attempting to cross the U.S.-Mexico border without legal permission, prosecuting all illegal border crossings.", "Children can’t go to detention centers, so they are being handed over to the Office of Refugee Resettlement in the Department of Health and Human Services. (More on this later.)", "To sum it up: The 1996 law didn’t require, nor did the Clinton administration adopt, a zero tolerance policy requiring that all noncitizens crossing the border in violation of immigration law be prosecuted for federal crimes. That’s a new policy under Trump.", "The tweet may also have been referring to a 1997 agreement conservatives have used to justify family separations.", "The Flores settlement was a January 1997 court agreement between advocates for unaccompanied minors detained by immigration authorities and the Justice Department. The agreement determined immigrant children must be held in the \"least restrictive setting.\"", "The Flores agreement can be read as barring children from jail, but it doesn’t condone or require the separation of children from parents. In fact, it stresses keeping children close to parents and extended family.", "The Obama administration had been placing children with their parents in family detention centers, but the California-based 9th U.S. Circuit Court of Appeals in 2016 held that the Flores agreement applies to all minors, not just those traveling unaccompanied. Because the detention centers were considered restrictive, the children had to be released. The Obama administration chose to release parents alongside their children.", "The result of these actions left the Trump administration with three options when apprehending a family trying to cross the border illegally: release parents and their children; send parents to prison and release their children; or send parents to prison and their children to child detention facilities overseen by the government.", "The Trump administration chose the last option, a decision he reversed on June 20, 2018.", "A tweet by Education4Liberals tried to point out liberal hypocrisy toward immigrant family separations, saying \"Bill Clinton passed a law in 1996 that separated children from adults illegally entering America.\"", "There is no law separating children from their parents when they enter the country illegally. The Trump administration chose to pursue that outcome as a result of its zero-tolerance policy.", "Clinton signed a significant immigration crackdown into law, but it mostly related to immigrants who were already living in the United States with criminal convictions, indirectly impacting some immigrant children.", "The Flores agreement of 1997 mandated that unaccompanied children be placed in the least restrictive setting while awaiting an immigration hearing, but that allows for a few options so that children are not required to be separated from their parents.", "We rate this statement False.", "Tweet, Education4Libs, June 17, 2018", "PolitiFact, Ted Cruz says child-parent separations at border tied to a court order, June 18, 2018", "Email interview with Rick Su, immigration law professor at University of Buffalo, June 19, 2018", "Email interview with Adam Cox, immigration law professor at NYU, June 18, 2018", "Email interview with Louis Desipio, UC Irvine political science professor, June 18, 2018", "Email interview with Peter Marguiles, law professor at Roger Williams University, June 18, 2018", "Phone interview with Guadalupe Correa, professor at George Mason University’s Schar School of Policy and Government, June 19, 2018", "Decision, \"Appeal from the United States District Court for the Central District of California Dolly M. Gee, District Judge, Presiding,\" 9th Circuit Court of Appeals, July 6, 2016", "Settlement agreement, \"Jenny Lisette Flores, et al, Plaintiffs v. JANET RENO, Attorney General of the United States, et al., Defendants,\" U.S. District Court, Central District of California, filed Jan. 17, 1997", "New York Times, Read the Executive Order Trump Signed on Family Separation, June 20, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]