["The claim was originally published here on Twitter on December 9, 2020, where it was shared hundreds of times. It was subsequently removed.", "The post’s caption, written in simplified Chinese language, translates to English as: “The US Congress voted 49 to 46 to add the veto of Section 230 to the 2021 National Defense Authorization Act, which immediately became law after Trump signed it. Now, you can think about how to sue Twitter, Facebook, Google, YouTube, New Times, The Wall Street Journal, CNN, etc..”", "Screenshots of the tweet and similar claims were posted here, here and here on Twitter, and here, here and here on Facebook.", "The tweet and the screenshots include an image which says in simplified Chinese: “Just now, Congress voted 49 to 46 to add a Section 230 veto to the 2021 National Defense Authorization Act, which immediately became law after Trump signed it....", "It also has text saying in English: \"HUGE WIN!!!!!\n\tNathan Simington was just confirmed 49-46!\n\tHUGE WIN\n\t#Section230", "It then says in Chinese: \"Good news: Section 230 was just passed with a 49-46 vote. 230 will be added to the national defense bill. Must punish big companies, must punish big companies like Twitter, Facebook, Google.”", "Section 230 was included in the 1996 Communications Decency Act to protect online service providers from lawsuits based on user-generated content.", "The legal immunity Section 230 provides has been attacked by US President Donald Trump, and he said in two December 2, 2020 tweets here and here that he would veto the NDAA, the annual defense policy bill, if it did not include a Section 230 repeal.", "But the claim in the tweet is misleading.", "A keyword search found a 49-46 vote result actually happened when Republican lawyer Nathan Simington was approved by the US Senate to join the Federal Communications Commission for a term of five years from July 1, 2019.", "That vote, on December 8, 2020,  was recorded on the official site of the US Senate here.", "The 2021 NDAA was passed by 335-78 votes by the US House of Representatives on December 8, 2020.", "A search in the full text of the 2021 bill found no mention of Section 230.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]