["A timeline of Trump statements about the Iraq war, before and after it started, from September 2002 to December 2003.", "By Eugene Kiely", "Posted on February 19, 2016", "Donald Trump has repeated throughout his presidential campaign that he opposed the Iraq war before the March 19, 2003 invasion, often taking credit for his judgement and vision — claiming he knew it would destabilize the Middle East.", "On Feb. 13, in the most recent debate, Trump said: “I said it loud and clear, ‘You’ll destabilize the Middle East.'” In the Sept. 16, 2015 debate, Trump claimed that he “fought very, very hard against us … going into Iraq,” saying he could provide “25 different stories” to prove his opposition.", "Trump has even said that he was “visited by people from the White House” in attempt to silence him, because, he said, he was getting “a disproportionate amount of publicity” for his opposition to the war.", "There is no evidence that we could find, however, that he spoke against the war before it started, although we did find he expressed early concerns about the cost and direction of the war a few months after it started.", "Others have looked, but no one else — including PolitiFact and the Washington Post Fact Checker — has been able to find any evidence to support his claims, either. Now, BuzzFeed reports that Trump indicated his support for war in a radio interview with shock jock Howard Stern on Sept. 11, 2002 — a little more than six months before the war started.", "Stern asked Trump directly if he supported going to war with Iraq, and Trump hesitantly responded, “Yeah, I guess so.”", "We don’t know if Trump still felt the same way in March of 2003. We do, however, know two things after having reviewed multiple news archival services in search of Trump’s position on the war:", "Trump had a financial interest in opposing the war in the weeks leading up to the war. The Newark Star-Ledger, New Jersey’s largest newspaper, reported on March 12, 2003 that Trump Hotels and Casino Resorts planned “to sell $485 million in junk-grade bonds this week in an effort to avoid a cash crunch later this year.” The uncertainty of war complicated Trump’s bond sale.", "The company began planning for the sale of the bonds in December, and it was completed March 13,2003 — six days before the war started. The Star-Ledger reported that “the growing threat of war with Iraq”and a proposal to “raise casino taxes and install video slot machines at New Jersey’s racetracks … made it more difficult for the company to find willing investors.”", "After the sale of the bonds was completed, Trump issued a statement on March 13 saying he was pleased with the results “despite difficult capital market conditions and the looming threat of war.”", "Trump expressed concerns about the cost of the war soon after it started. If Trump did support the war, he turned on it quickly. As the timeline below shows, Trump in July said that he wished the money being spent in Iraq could be spent in New York City. By November, he talked about the “tremendous cost” of the war and the “very, very unpleasant surprises in Iraq.”", "By 2004, Trump’s opposition to the war was well documented.", "Below is a timeline of all the Trump statements about the Iraq war that we could find in 2002 and 2003. Except for the Howard Stern interview in 2002, which was reported by BuzzFeed, the statements below were culled from numerous archival services available to us at FactCheck.org through the University of Pennsylvania: Access World News, ProQuest, Vanderbilt Television News Archives and LexisNexis.", "We invite anyone — including the Trump campaign — to send us additional Trump statements about Iraq from either 2002 or 2003. We will add them to this timeline.", "Sept. 11, 2002: Howard Stern asks Trump if he supports invading Iraq. Trump answers hesitantly. “Yeah, I guess so. You know, I wish it was, I wish the first time it was done correctly.”", "Jan. 28, 2003: Trump appears on Fox Business’ “Your World with Neil Cavuto,” on the night of President Bush’s State of the Union address. Trump says he expects to hear “a lot of talk about Iraq and the problems,” and the economy. He urges Bush to make a decision on Iraq. “Either you attack or you don’t attack,” he says. But he offers no opinion on what Bush should do.", "Cavuto: If you had to sort of breakdown for the president, if you were advising him, how much time do you commit to Iraq versus how much time you commit to the economy, what would you say?", "Trump: Well, I’m starting to think that people are much more focused now on the economy. They are getting a little bit tired of hearing, we’re going in, we’re not going in, the — you know, whatever happened to the days of the Douglas MacArthur. He would go and attack. He wouldn’t talk. We have to — you know, it’s sort like either do it or don’t do it. When I watch Dan Rather explaining how we are going to be attacking, where we’re going to attack, what routes we’re taking, what kind of planes we’re using, how to stop them, how to stop us, it is a little bit disconcerting. I’ve never seen this, where newscasters are telling you how — telling the enemy how we’re going about it, we have just found out this and that. It is ridiculous.", "Cavuto: Well, the problem right there.", "Trump: Either you attack or you don’t attack.", "Cavuto: The problem there, Donald, is you’re watching Dan Rather. Maybe you should just be watching Fox.", "Trump: Well, no, I watch Dan Rather, but not necessarily fondly. But I happened to see it the other night. And I must tell you it was rather amazing as they were explaining the different — I don’t know if it is fact or if it is fiction, but the concept of a newscaster talking about the routes is — just seems ridiculous. So the point is either you do it or you don’t do it, or you — but I just — or if you don’t do it, just don’t talk about it. When you do it, you start talking about it.", "Cavuto: So you’re saying the leash on this is getting kind of short here, that the president has got to do something presumably sooner rather than later and stringing this along could ultimately hurt us.", "Trump: Well, he has either got to do something or not do something, perhaps, because perhaps shouldn’t be doing it yet and perhaps we should be waiting for the United Nations, you know. He’s under a lot of pressure. He’s — I think he’s doing a very good job. But, of course, if you look at the polls, a lot of people are getting a little tired. I think the Iraqi situation is a problem. And I think the economy is a much bigger problem as far as the president is concerned.", "March 19, 2003: President George W. Bush announces in a televised address to the nation that the war with Iraq has started.", "March 21, 2003: Neil Cavuto of Fox Business interviews Trump about the impact of the Iraq war on the stock market. Trump says the war “looks like a tremendous success from a military standpoint,” and he predicts the market will “go up like a rocket” after the war. But Cavuto does not ask Trump whether the U.S. should have gone to war with Iraq and Trump doesn’t offer an opinion.", "Trump, March 21, 2003: Well, I think Wall Street’s waiting to see what happens but even before the fact they’re obviously taking it a little bit for granted that it looks like a tremendous success from a military standpoint and I think this is really nothing compared to what you’re going to see after the war is over.", "Cavuto: What do you mean?", "Trump: Well, I think Wall Street’s just going to go up like a rocket even beyond and it’s going to continue and – you know we have a strong and powerful country and let’s hope it all works out.", "Cavuto: … Why are you so optimistic?", "Trump: Well, I think a couple of things. I really feel that the key is that interest rates — beyond the war interest rates are going to have to stay stable and low. That’s going to be very important. And if you really look at Wall Street, Wall Street’s come down thousands and thousands of points over the last number of years. So really, I remember when we were sitting here saying two years ago that Wall Street is going to be double what it was two years ago and a lot of people didn’t believe that and I didn’t believe that, but there were plenty of very intelligent people who said yes. I think that Wall Street will be going up and the market will be going up and there’s great confidence in this great country.", "Cavuto: You know there is a feeling abroad, Donald, that the French don’t like us, the Germans don’t like us. There were protests abroad still continuing around the globe today from Asia to Africa and that there’s going to be hell to pay that maybe some of these same people will prove their wrath by not investing in this country, by doing all sorts of nasty things, do you buy that?", "Trump: Well, the I guess the French never liked us much except when we were bailing them out, to be totally honest with you. But certainly were going to have to work on our public relations because there’s no question there are a lot of countries right now that aren’t too fond of us. I think that can be solved and probably pretty quickly. The main thing is to get the war over with and just make it a tremendously successful campaign and it will be very interesting to see what kind of weapons they find.", "Cavuto: … Does this put a chill on things economically? Does it scare people into buying [real estate] or not buying, renting and not renting?", "Trump: In a nutshell Neil, the office market is just okay at best. The hotel market is nonexistent. But the residential market for buying, for condos, has been the strongest I’ve ever seen it. It’s amazing. Now, a lot of that has to do I believe with interest rates. You know money is so cheap and people are buying and they are paying the lowest interest rates in 40 years. But the market has been very strong in that sense. There’s been a lot of optimism in New York.", "March 22, 2003: The San Antonio Express-News quotes Trump as saying the “war is depressing.” The article was about the Miss USA pageant, which Trump owned at the time. The pageant was held March 24, 2003 in Alamo City.", "San Antonio Express-News, March 22, 2003: While terrorist attacks and the gloomy economy have taken their toll on New York, Trump said the Big Apple housing market remains strong because of low interest rates.", "And his casinos in Atlantic City still lure gamblers, he said.", "Trump, a bachelor since his marriage to Marla Maples ended in 1999, said the war with Iraq hasn’t shaken his city.", "“New York is one of the safest cities in the United States,” Trump said.", "“War is depressing, but something like the Miss USA pageant is positive and brings you out of that funk.”", "March 25, 2003: The Washington Post quotes Trump, at a post-Oscars Vanity Fair party, as saying the war is “a mess.”", "Washington Post, March 25, 2003: Donald Trump, with Amazonian beauty Melania Knauss at his side, pronounces on the war and the stock market: “If they keep fighting it the way they did today, they’re going to have a real problem.”", "Looking as pensive as a “Nightline” talking head, the Donald concludes, “The war’s a mess,” before sweeping off into the crowd.", "Trump and the paper do not elaborate on exactly what he means by “a mess.” But we do know that the Oscars were held that year on March 23, which is also when it was reported that a U.S. missile accidentally downed a British fighter jet. We also know that Trump’s remarks were in the context of the war’s impact on the stock market.  The Dow Jones Industrial Average increased 235 points the day after the war, but it dropped 307 points a day after the friendly fire incident.", "July 1, 2003: Trump appears on “Hardball with Chris Matthews” and expresses concern about money being spent in Iraq rather than in the U.S. He made his comment when he was asked about a quote Trump gave in February 2000 about the possibility of running for president.", "Trump, July 1, 2003: I never did run [in 2000] and I probably never will run. But we’re having a lot of fun. I think the president is doing a very good job. I would love to see New York City and some of the cities and some of the states get some of the money that`s going toward Iraq and other places, because you know, they really need and it they need it badly.", "As an aside, Trump, who lives in New York, was asked by Matthews who he would vote for in a hypothetical 2008 race between two New Yorkers: then-Sen. Hillary Clinton, a Democrat, or former New York City Mayor Rudy Giuliani, a Republican. Trump refused to answer. Twice Trump said, “Don’t ask me that question.”", "Sept. 11, 2003: Joe Scarborough, who at the time was host of MSNBC’s “Scarborough Country,” airs interviews with New Yorkers — including Trump  — on the second anniversary of the 9/11 terrorist attacks. He asks about terrorism, the Iraq war and New York.", "Trump, Sept. 11, 2003: It wasn’t a mistake to fight terrorism and fight it hard, and I guess maybe if I had to do it, I would have fought terrorism but not necessarily Iraq.", "Nov. 4, 2003: Trump appears on “Hardball with Chris Matthews,” where he is asked about the impact of the economy on President George W. Bush’s reelection bid. Trump says “the economy is doing well,” but predicts “his bigger problem is going to be what’s happening in Iraq.” Trump talks about the “tremendous cost” of the war and the “very, very unpleasant surprises in Iraq.” He says, “The question is whether or not we should have been in Iraq in the first place.”", "Matthews, Nov. 4, 2003: Let me ask you about the president’s course from now until next election, until next November. How does it look over the next year? Is it going to stay up? I thought it was interesting that he low-balled this number. He said 7 percent, 7.2 percent, but don’t count on it continuing. Is that smart politics?", "Trump: Well, I think it is smart politics. I think his bigger problem is going to be what’s happening in Iraq. I believe the economy is doing well. I think it could get better, but lots of surprises out on the horizon, and what is going to happen with Iraq, what is going to happen with the world situation, that could be the bigger problem that President Bush has.", "Matthews: What is the economic impact? Is it the cost factor of about $100 billion a year for the military and the rebuilding, is that the cost, or is it psychological?", "Trump: Well, I think it’s psychological. It is also tremendous amounts of money being pumped into Iraq. I mean, you look at states like New York and California, where they can`t afford school systems, and we are giving $87 billion to Iraq and that is just the beginning. So, you know, it is a tremendous cost to this country, what’s gone on there, and again, we are getting some very, very unpleasant surprises in Iraq, and hopefully something is going to be done about it quickly.", "Matthews: This was an elective war. The president thought we had to do it. He made a judgment call. He took us into Iraq. Do you think he will reconsider that judgment as the costs rise?", "Trump: I don’t think he is going to. He is a very committed guy, he’s committed to that whole situation and I don’t think he will really reconsider. I don’t think he probably can at this point. Other people will, and you are going to find out at the polls whether or not those other people are right. I mean, you see more and more doves, if you call them doves. The question is whether or not we should have been in Iraq in the first place. I don’t think that this president can do anything about that. He is really — he is on a course that has to stay.", "Matthews: Let me ask you about the Democrats. I have noticed a slight — or other people have noticed a slight shift in direction. Instead of whacking him on the economy, which is starting to look like his strong suit, they are shifting to the war. Is that smart?", "Trump: Well, I think that’s the only thing they can do. I mean, the economy is good. New York City is having its best year ever perhaps in real estate. That is a very big indication. In California real estate, where I have a lot, same thing. I mean, the country is starting to do well, so I think the whole shift is going to be very much toward the war.", "Dec. 15, 2003: Neil Cavuto of Fox Business interviews Trump two days after the capture of Iraq President Saddam Hussein. Hussein was captured on Dec. 13, 2003, a Saturday when the markets were closed. Trump says Hussein’s capture was a “great thing” for the country, but he mentions that “a lot of people [are] questioning” the wisdom of going to war with Iraq in the first place.", "Cavuto: What if this had happened today, Donald, in the middle of the trading day? What would the reaction have been then?", "Trump: Oh, I think it probably would have been even more positive. But ultimately, over the next year, two years, 10 years and 20 years, this is just a great thing for the free world.", "Cavuto: What if we got ahead of ourselves, though? What if, for example, the concerns of continued attacks in Iraq do not abate, that that’s still a factor with us and maybe drags on for some time?", "Trump: Well, look, you have a lot of questions and a lot of people questioning the whole concept of going in, in the first place, Neil. But we are in, we went in, you had to find him. If he was alive, you had to find him. And you know, they fulfilled the pledge of finding Saddam Hussein.", "Cavuto: If you are the president’s opponents, what do you do?", "Trump: Well, you have two mixed bags. I mean, you have Mr. [Howard] Dean, that’s going to say we shouldn’t have been there regardless. And you have others that are saying, well, we are there and we have to do the best. I mean, we are there, regardless of what should have been done. Some people agree and some people don’t agree, but we are there. And if we are there, you have to take down Saddam Hussein. And they have done that, and they did it maybe not as quickly as they thought in terms of finding him, but they found him. And that is a huge day for this country.", "(Note: For those who are not reading this on our website please click here to see the latest version.)", "https://www.sharethefacts.co/share/5f108ced-4738-4cfa-8014-1a08792c3d6f", "“The CBS News Republican debate transcript, annotated.” The Washington Post. 13 Feb 2016.", "Beckwith, Ryan Teague. “Transcript: Read the Full Text of the Second Republican Debate.” Time. 16 Sep 2015.", "“Donald Trump: America can be greater than ever before.” Transcript. Fox News “Special Report.” 7 Oct 2015.", "Carroll, Lauren. “Donald Trump overstates his early opposition to the Iraq War.” PolitiFact. 6 Feb 2016.", "Ye Hee Lee, Michelle. “Donald Trump’s baseless claim that the Bush White House tried to ‘silence’ his Iraq War opposition in 2003.” 21 Oct 2015.", "Kaczynski, Andrew. “In 2002, Donald Trump Said He Supported Invading Iraq.” BuzzFeed. 18 Feb 2016.", "DeHaven, Judy. “Trump will sell bonds to avoid cash crunch.” Star-Ledger. 12 Mar 2003, accessed via LexisNexis.", "“Trump Hotels & Casino Resorts, Inc. Announces Pricing of $490 Million Note Issues by Trump Casino Holdings, LLC.” Press release. BusinessWire. 13 Mar 2003.", "“Donald Trump: How I’d Run the Country (Better).” Esquire. Aug 2004, reprinted 18 Aug 2015.", "“Interview with Donald Trump.” CNN’s “Larry King Live.” 24 Nov 2004.", "“Interview with Donald Trump.” Fox Business’ “Your World with Neil Cavuto.” 28 Jan 2003, accessed via Vanderbilt Television News Archives.", "White House. “President Bush Addresses the Nation.” 19 Mar 2003.", "Badger, T.D. “Alamo City to host Miss USA pageant.” Associated Press. 6 Jan 2003.", "Monroe, Melissa S. “The Donald is coming to Alamo City – Trump says Miss USA pageant is just what the nation needs now.” San Antonio Express-News. 22 Mar 2003, accessed via Access World News.", "Booth, William. “Hollywood Partyers, Soldiering On.” The Washington Post. 25 Mar 2003.", "“Interview with Donald Trump.” MSNBC’s “Hardball with Chris Matthews.” 1 Jul 2003, accessed via Access World News.", "“Interview with Donald Trump.” MSNBC’s “Scarborough Country.” 11 Sep 2003, accessed via Access World News.", "“Interview with Donald Trump.” Fox Business’ “Your World with Neil Cavuto.” 15 Dec 2003, accessed via Access World News.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]