["About this rating", "\"The Beverly Hillbillies,\" a sitcom about a poor backwoods family who struck it rich after discovering oil on their property and moved to a mansion in Beverly Hills, California, was one of the most popular television series of the 1960s.", "Airing on CBS for nine seasons from 1962 to 1971, \"The Beverly Hillbillies\" was among the top 20 most-watched programs on television for eight of those nine years, and it ranked as the overall #1 TV program in the U.S. for its first two seasons.", "https://youtu.be/mCSpXAWv_yU\n\nMost successful TV series remain on the air as long as their ratings remain sufficiently high, but a video from the woefully misnamed \"Facts Verse\" YouTube channel implied that \"The Beverly Hillbillies\" was removed from the airwaves, despite its success, due to a \"controversial scene\":", "https://youtu.be/JkrOeOFzsT0\n\nBut in fact, neither any controversy nor any particular scene was responsible for the ultimate cancellation of \"The Beverly Hillbillies,\" as the title \"The Controversial Scene That Took 'The Beverly Hillbillies' off the Air\" wrongly suggested. Hapless viewers had to sit through nearly six minutes of a narrator's reciting 16 mundane \"facts\" (not all of them true) about the show before they finally got to the payoff teased by the video's title ... only to be completely let down when they were lamely informed (in the brief 20 seconds the video devoted to this topic) that \"well, it wasn't actually one scene; it was the entire show.\"", "\"The Beverly Hillbillies\" had no taint of controversy that led to its demise -- rather, the show was a victim of the so-called \"rural purge\" of the early 1970s. During that timeframe, several long-running series featuring rural characters and settings (primarily on the CBS network) were canceled even though they were still pulling down respectable ratings numbers, because those programs' viewership skewed to an older, rural demographic rather than the younger, urban audience prized by advertisers.", "Besides \"The Beverly Hillbillies,\" series such as \"Green Acres,\" \"Hee Haw,\" and \"Mayberry R.F.D.\" all got the axe after the 1970-71 season, to be replaced by shows that proved to be ratings kings as the 1970s unfolded -- the \"The Mary Tyler Moore Show,\" \"All in the Family,\" and \"The Bob Newhart Show.\"", "David Mikkelson founded the site now known as snopes.com back in 1994 as a creative outgrowth of his wide-ranging interests in a variety of subjects (particularly folklo ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]