["About this rating", "The Trump administration relaxed some of the nutritional guidelines regarding school lunches established during the Obama administration.", "President Trump did not cancel Michelle Obama's school lunch program, and changes to the \"Healthy, Hunger-Free Kids Act\" were announced back in May 2017.", "Editor's note: This story was originally published in October 2018. The Trump administration announced further changes to school lunch guidelines in January 2020. You can read more about those changes here. The original report continues below.", "In October 2018, the message \"Trump cancelled Michelle Obama’s school lunch program. The only meal some kids get\" was shared by a number of individuals on Facebook:", "This message has been bouncing around Facebook for at least a year. The most popular example of this message that we could find was shared by \"Tom Bones Malone\" in October 2017, but even then the message was outdated and misleading.", "The phrase \"Michelle Obama's school lunch program\" is a bit inaccurate as the former first lady didn't sponsor or pass any legislation mandating the content of school lunches. However, she was certainly an advocate for a healthier lifestyle, and she pushed for better nutritional standards as part of the \"Let's Move\" initiative, efforts which inspired the passage of the \"Healthy, Hunger-Free Kids Act\" by Congress.", "U.S. Secretary of Agriculture Tom Vilsack said of the bill's passing that:", "“Today is a great day for kids throughout our country as they will soon have healthier, and more nutritious food in their schools. As we continue to focus on the twin issues of childhood obesity and hunger, we will increase access to good, quality meals in school cafeterias so the nutritional needs of our youngsters are better met. The President and First Lady have advocated strongly for passing the Healthy, Hunger-Free Kids Act of 2010, and, this bill, along with the resources and the powers provided under it, are going to allow USDA to be much more effective and aggressive in responding to obesity and hunger challenges for America’s kids.”", "However, as of this writing the \"Healthy, Hunger-Free Kids Act\" has not been \"cancelled\" -- although the Trump administration did roll back a few of the nutritional guidelines for school lunches set by this Obama-era legislation.", "For instance, the Healthy, Hunger-Free Kids Act reduced portion sizes; placed limits on sugar and fat content; mandated fruit, vegetable, and whole grain servings; and prevented schools from serving flavored milk. Agriculture Secretary Sonny Perdue signed a proclamation on 1 May 2017 which announced that some of those regulations would be relaxed:", "Schools won't have to cut more salt from meals just yet and some will be able to serve kids fewer whole grains, under changes to federal nutrition standards announced [today].", "The move by the Trump administration partially rolls back rules championed by former first lady Michelle Obama as part of her healthy eating initiative.", "As his first major action in office, Agriculture Secretary Sonny Perdue said the department will delay an upcoming requirement to lower the amount of sodium in meals while continuing to allow waivers for regulations that all grains on the lunch line must be 50 percent whole grain.", "Schools could also serve 1 percent flavored milk instead of the nonfat now required.", "\"If kids aren't eating the food, and it's ending up in the trash, they aren't getting any nutrition -- thus undermining the intent of the program,\" said Perdue, who traveled to a school in Leesburg, Va., to make the announcement.", "As of this writing, the Trump administration has not \"cancelled\" or repealed the Healthy, Hunger-Free Kids Act. Rather, they have loosened its provisions by changing or delaying some of the school meal nutritional requirements established by that legislation.", "Tampa Bay Times.   \"Trump Administration Relaxes Michelle Obama's Nutrition Standards for School Meals.\"\r\n    1 May 2017.", "Fox, Maggie.   \"Trump Administration Loosens Obama School Food Rules.\"\r\n    NBC News.   1 May 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]