["Multiple Facebook posts, for example this one published June 16, 2018, and shared more than 1,000 times since, contain the two photos of the purple mangoes.", "That post has a Hindi-language caption that translates as:", "“This is a purple colour mango grown after ten years of hard work with combination of mango and black plum plants. This purple colour mango is ripe and ready in fields of Uttar Pradesh. It will be particularly beneficial for the diabetic patients.\"", "Uttar Pradesh is a north Indian state. Black plums are a tropical fruit also known as jamun; here is a Times of India report about their supposed health benefits.", "Below is a screenshot of one of the misleading posts:", "The same photos have been shared with the same claim elsewhere on Facebook, for example in this post dated June 2, 2016, which has been shared more than 60,000 times.", "They have also been shared with the same claim on Twitter, for example here and here.", "But the mangoes in the photo are not \"ripe and ready\" in Uttar Pradesh -- both images have circulated online for years in reports about two different American-developed mango varieties.", "A reverse image search on Google for the top photo in the misleading posts led to this article which contains the same picture, published on the website of British newspaper The Telegraph on October 10, 2013.", "The article is about mango exports from Brazil to the UK. The photo is credited to a photographer called Andre Vieira; here is his website.", "Its caption says in part: “Purple reign: mango trees at a farm in the state of Pernambuco, in north-east Brazil.”", "The article is about the popularity of the purple-skinned Palmer mango and says, in part: \"The variety most on show is the large Palmer mango, blushed with a dark, purply red, like a bruised sunset... a Palmer has smooth, perfumed flesh that can survive transportation, and is popular all over this vast country and in export markets.\"", "Below is a screenshot of the Telegraph article:", "According to America's National Mango Board, the Palmer mango is a purple-skinned variety of the fruit that was developed in the USA and is now primarily grown in Brazil.", "\"Originating from Florida in the 1940's, Palmer mangos are widely grown commercial scale in Florida; often harvested immature due to early coloring,\" the infomation on the NMB website says.", "A reverse search on Google for the bottom photo on the misleading post found it has been published repeatedly online since at least 2001 in reports about another American mango variety, the Tommy Atkins:", "According to the NMB website: \"Hailing originally from Florida, the Tommy Atkins mango is the most widely grown commercial variety coming into the United States.\"", "Below is a screenshot of a website where the photo was published in February 2001. It is the website of a Brazil-based plant nursery, with text in Brazilian Portuguese:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]