["About this rating", "On Sept. 8, 2019, U.S. President Donald Trump took to Twitter to criticize musician John Legend and his \"filthy mouthed\" wife, Chrissy Teigen, after Legend appeared on MSNBC during a segment about criminal-justice reform.", "Teigen and Legend responded with a few insults of their own, with the model calling the president a \"pussy ass bitch\":", "The exchange went viral, sending hashtags such as #filthymouthedwife, #PresidentPAB, and #teamchrissy to the top of Twitter trends. As social media users reveled in the controversy, a video appeared on Twitter supposedly showing Trump being rushed off stage after someone in the audience yelled \"Chrissy Teigen's here!\" and asked if he was \"scared\":", "Donald Trump vs. Chrissy Tiegen (sound up) pic.twitter.com/I4NtsWyssS", "— ElElegante101 (@skolanach) September 9, 2019", "This video quickly racked up more than a hundred thousand views. While many social media users seemed to understand that this clip had been edited, some viewers wondered if this was genuine footage of Trump being rushed off stage.", "The visuals in this clip are real, but the audio is not.", "Trump really was rushed off the stage by the secret service during a campaign rally in Reno, Nevada, in November 2016. The secret service was responding to something they heard in the crowd, but it wasn't the name \"Chrissy Teigen.\" According to CNN, someone yelled \"gun\" after a scuffle in the crowd:", "Donald Trump was rushed off a stage here Saturday by Secret Service agents during a campaign speech after an incident in the crowd near the front of the stage.", "A Secret Service spokesperson said in a statement there was a commotion in the crowd and an \"unidentified individual\" shouted \"gun,\" though no weapon was found after a \"thorough search.\"", "Whoever created the viral clip replaced the genuine audio from the event with a person yelling \"Chrissy Teigen.\" Here's the real video of Trump getting rushed off stage by the Secret Service during the 2016 campaign event:", "Yasharoff, Hannah.   \"Donald Trump Targets John Legend, Chrissy Teigen After Legend Appears on MSNBC Criminal Justice Series.\"\r\n    USA Today.   9 September 2019.", "Diamond, Jeremy.   \"Trump Rushed Off Stage at Campaign Rally; Protester Says He Was Roughed Up.\"\r\n    CNN.   6 November 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]