["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On April 9, 2020, Michigan Gov. Gretchen Whitmer signed Executive Order 2020-42 as part of the state's effort to combat the COVID-19 coronavirus disease pandemic. This order extended the state's shelter-in-place policy to May 1 and tightened some business regulations. For instance, one section of the order required stores larger than 50,000 square feet to do the following:", "Close areas of the store — by cordoning them off, placing signs in aisles, posting prominent signs, removing goods from shelves, or other appropriate means — that are dedicated to the following classes of goods:", "A. Carpet or flooring.\nB. Furniture.\nC. Garden centers and plant nurseries.\nD. Paint.", "But Executive Order 2020-42 did not mention the purchase of American flags. Read the order in its entirety here or review a FAQ about it here. When we reached out to Whitmer's office, we were told: \"No, Governor Whitmer is not banning buying US flags.\"", "As Michiganders were adjusting to this new set of rules, Twitter user Pure Michigan Girl posted a photograph supposedly showing American flags behind a strand of caution tape and claimed that there was \"no buying flags in\" Michigan:", "This single tweet was the sole piece of evidence provided by the hyperpartisan and conspiratorial website The Gateway Pundit in their article headlined \"And There It Is… Michigan Governor Gretchen Whitmer Bans Buying US Flags During Lockdown.\"", "The claim made in that headline is false. Whitmer did not ban the purchase of American flags during lockdown.", "We have not been able to pinpoint the origins of the above-displayed image but it seems reasonable to assume that this photograph was truly taken at a Costco in Michigan shortly after this executive order was signed. As flowers and plants can be seen in this photograph, it's likely that it shows Costco's gardening department after it was cordoned off due to Whitmer's new restrictions.", "While the photograph may be genuine, it does not mean that Michigan has banned the purchase of American flags. Executive Order 2020-42 may make it difficult (or even impossible) to purchase an American flag from a non-essential department at a big box store, but it does not prohibit the purchase of American flags in the state.", "There's nothing in this order, for instance, banning the sale of an American flag at a store under 50,000 square feet or online. In fact, Executive Order 2020-42 makes no mention of American flags at all. As of this writing, American flags can still be purchased on the websites of some Michigan lawmakers.", "Shortly after this article was published, two things happened: First, the FAQ section on Executive Order 2020-42 was updated to include a question about American flags:", "Q: Does Executive Order 2020-42 prohibit buying an American flag?", "A: No. While the order places certain limits on how goods are sold, it does not ban Michiganders from buying any item, including flags.", "Second, The Gateway Pundit changed the headline of their article to omit its false claim. The website changed its original headline, \"And There It Is… Michigan Governor Gretchen Whitmer Bans Buying US Flags During Lockdown,\" to \"And There It Is… Michigan Governor Gretchen Whitmer’s Lack of Clarity Causes Confusion For Consumers During Lockdown.\"", "The Gateway Pundit did not publish a correction noting the change in their headline. You can see an archived version of Gateway Pundit's original post here.", "Egan, Paul; Gray, Kathleen.   \"New Whitmer Order Bans 'Travel Between Residences,' With a Few Exceptions.\"\r\n    Detroit Free Press.   9 April 2020.", "Hoft, Jim.   \"And There It Is… Michigan Governor Gretchen Whitmer Bans Buying US Flags During Lockdown.\"\r\n    The Gateway Pundit.   11 April 2020.", "WXYZ Detroit.   \"Read the Entire Executive Order Extending Michigan's Stay-At-Home Order Until May 1.\"\r\n    9 April 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]