["The post, archived here, has been shared more than 400 times and calls on authorities to close all schools until the gas attacks -- presumably in Zambia, although it doesn’t specify -- are stopped.", "The post includes a video clip that allegedly shows the scene of a fatal gas attack that killed a number of children.", "Part of the caption reads: “Look at how our children are suffering by the gassing of this toxic chemicals.” [sic]", "Reference is also made to the ongoing activity of “ritual killers”, another topical issue in Zambia being linked by some (see here and here) to the chemical gas attacks.", "The post's claim is false: The video shows the tragic aftermath of a stampede that took place at a Kenyan school in Kakamega, northwest of Nairobi, earlier this month which claimed the lives of at least 13 children, as AFP reported here. Dozens were injured.", "A reverse image search using a screengrab from the video links to this Facebook post here, which correctly places the footage in Kenya.", "A different video shot by AFP includes images of injured children in hospital, wearing the same green uniform.", "Authorities in Zambia are battling to quell public alarm following weeks of reported attacks by assailants using unspecified gas to subdue victims before robbing them, as AFP reported here.", "Rumours on social media have added to the panic and led to tit-for-tat accusations between political parties. President Edward Lungu called for calm in a statement on February 19, 2020, saying he was “dismayed by the growing number of unguarded statements in the media from both the ruling and opposition parties”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]