["About this rating", "A few similarities exist between a map of mysterious cases of missing persons and a map of cave systems in the United States.", "However, this is not a map of all people who have gone missing in the U.S. It focuses on so-called \"strange\" disappearances that occurred near national parks. Data from the bottom map was overlaid on the top to make the \"coincidence\" seem stronger. And lastly, correlation does not imply causation.", "An image graphic supposedly showing how a map of missing persons in the United States matches up with a map of America's largest cave systems is frequently shared on social media:", "This may seem like an eerie coincidence at first glance. But when we took a closer look at where the maps originated and what they purportedly showed, the comparison seemed overstated.", "For starters, the top map is not an exhaustive list of every missing person in the United States. If you notice, the map doesn't show any missing persons in large metropolitan areas, like Detroit, Michigan. That's because it was created with the focus on people who \"mysteriously vanished\" in remote areas, specifically near national parks. And because national parks are home to nearly 5,000 caves, these two maps not surprisingly have some similarities.", "The original map of missing persons was created by David Paulides, a former detective and current Bigfoot hunter, for his \"Missing 411\" book series. The version of this map on his website shows a series of orange dots surrounded by various color markings, but it doesn't feature the hundreds of black dots shown on the viral map above. It appears that someone simply took the \"cave dots\" from the bottom map and overlaid them onto the \"missing persons\" map. This may just explain why the two maps look so similar.", "Here's a look at how these two maps compare when we use Paulides' original map (sans the black dots):", "Some parallels can still be drawn between the two maps (after all, Paulides was mapping people who \"mysteriously vanished\" near national parks, which are home to thousands of caves), but the similarities are not as clean.", "As noted above, the people map is not an exhaustive list of all missing persons in the U.S. The National Missing and Unidentified Persons System (NamUs) reports that nearly 600,000 people go missing every year. Many of these cases are resolved with the persons being found alive and well, but tens of thousands of individuals will remain missing for more than a year. The vast majority of these missing-persons cases are not counted on this map.", "The above-displayed people map only shows what Paulides calls \"411 cases,\" or cases Paulides has deemed as having strange circumstances. This could be a case involving dogs that failed to pick up a scent, people who were found with missing clothing items, or cases involving people who traveled unusual distances after they were last seen. The Skeptical Inquirer took a deeper look into Paulides' \"411 Cases,\" and while the Inquirer found that Paulides' work involved real cases of missing persons, many of the so-called strange circumstances had plausible explanations:", "Paulides has classified over 1,440 missing persons cases under the Missing411 label. At its core, Missing411 is the vague claim that something unusual is occurring related to deaths and disappearances in national parks. The concept has been steeped in the milieu of conspiracy and the supernatural, as Paulides frequently appears on paranormal-oriented radio shows and podcasts to discuss it. A forthcoming documentary appears to be in the works as well. (I have been unable to ascertain the meaning of 411. I can only speculate that it’s a slang synonym for “information,” although “MissingInfo” isn’t much better of a moniker.)", "[...]", "I was finding these cases to be fairly mundane until I arrived at the hiker’s disappearance. Following a deadpan factual reporting of the details, Paulides quotes a local person saying cryptically that “according to local legend, beings called Lemurians lived underneath Mount Shasta . . . maybe the Lemurians got Carl.”", "The text is decorated sparsely with this and other head-scratching non sequiturs. For example, in the last case of my brief audit, a woman named Amy disappears while exercising. Her body was never recovered but her wristwatch was found in a river bed years later. Paulides points out that years after that, a woman named Ann disappeared from the same place. He felt the need to point out that “both of their names start with A, and their first names only had three letters.” I can only presume Paulides is open to the possibility that some nefarious Batman villain is at work in this area. Beware the three-lettered killer!", "In short, the above-displayed maps — one showing people who mysteriously vanished, the other cave systems in the U.S. — do bear a few similarities. However, that's because the missing-persons map shows people who vanished under strange circumstances near national parks — which house thousands of caves — and not an exhaustive list of every person currently missing in the United States.", "NPS.   \"Enchanting Landscapes Beneath the Parks.\"\r\n    12 February 2018.", "Langton, Charlie.   \"Over 3,900 People Are Missing in Michigan. ID the Missing Seeks to Chip Away at That.\"\r\n    Fox 2 Detroit.   19 November 2019.", "Polich, Kyle.   \"An Investigation Of The Missing411 Conspiracy.\"\r\n    Skeptical Inquirer.   August 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]