["Just as Gov. Chris Christie celebrates how he approved pension and health benefits reform in June 2011, state Sen. Barbara Buono says she stood up for her beliefs by opposing the landmark bill.\n\nAs the senator emerged last week as the most likely Democrat to take on the Republican governor in his re-election bid this year, Buono claimed in TV interviews that she rejected the legislation because it eliminated collective bargaining for public employees’ health benefits.\n\nBuono, who was Senate Majority Leader when the reform passed, broke with Senate President Stephen Sweeney when she voted against the legislation. That vote likely contributed to her ultimately losing the leadership post.\n\nIn a Jan. 28 interview on NJToday, Buono (D-Middlesex) said she \"drew a line in the sand when it came to eliminating collective bargaining for employee health benefits.\"\n\nThe senator repeated that claim in an interview the following day on Fox 5’s Good Day New York.\n\n\"I’ll continue to stand up for what I believe in, even if it’s not politically expedient -- and that is, I opposed this last piece of legislation that also eliminated collective bargaining for health benefits,\" Buono said.\n\nThe 2011 reform mandates increases in health care contributions without employees’ approval through negotiations, but the senator’s wrong to suggest that bargaining right is eliminated forever.\n\nOnce the increases are fully implemented after a four-year period, unions can resume negotiating those contribution levels.\n\nLet’s review the legislation.\n\nSigned into law by Christie on June 28, 2011, the reform requires employees to contribute higher payments toward their pension and health care benefits. Phased in over four years, the health care contributions are based on a percentage of one’s premium and vary according to salaries and levels of coverage.\n\nThe new contribution levels took effect immediately for employees whose union contracts had expired. For workers under an existing contract when the law went into effect, the payment levels and four-year time frame begin when their contract expires.\n\nThose increases are non-negotiable, but after the fourth year of implementation, the health care contributions can become part of union negotiations.\n\nHere’s what the law says:\n\n\"After full implementation, those contribution levels shall become part of the parties’ collective negotiations and shall then be subject to collective negotiations in a manner similar to other negotiable items between the parties.\"\n\nBut David Turner, communications director for the Buono campaign, argued in an e-mail that the legislation took away workers’ bargaining right to negotiate health benefits when it imposed higher costs without their consent.\n\n\"Sen. Buono strongly believes in the right of workers to collectively bargain for their health benefits,\" Turner said. \"Governor Christie's legislation explicitly takes away this right by unilaterally imposing higher costs without workers' consent.\n\n\"This is by definition eliminating employees right to negotiate their healthcare. Collective bargaining was vital in building the middle class in New Jersey and America and Sen. Buono will continue to support this fundamental right.\"\n\n Our ruling\n\nIn a TV interview, Buono claimed that the pension and health benefits reform \"eliminated collective bargaining for health benefits.\"\n\nThe reform does mandate higher health care contributions over a four-year period without the employees’ approval through negotiations, but the senator is wrong to suggest that bargaining right is eliminated indefinitely.\n\nAfter the payment increases have been fully implemented, those contribution levels return to the bargaining table as a part of union negotiations.\n\nWe rate the statement Half True.", "To comment on this ruling, go to NJ.com.", "MyFoxNY, Interview with state Sen. Barbara Buono, Jan. 29, 2013\n\nNJToday, Barbara Buono Discusses Her Run for Governor, Jan. 28, 2013\n\nPolitiFact New Jersey, Democratic group claims New Jersey’s pension and health benefit reform destroys bargaining rights for public-sector employees, Aug. 15, 2011\n\nThe Star-Ledger, N.J. Assembly passes landmark employee benefits overhaul, June 24, 2011\n\nNew Jersey School Boards Association, A Whole New World: An analysis of the new employee health benefits law, September/October 2011\n\nNew Jersey Department of the Treasury,Pension and Health Benefits Reform 2011: Frequently Asked Questions, accessed Jan. 29, 2013\n\nPension and health benefits reform law, approved June 28, 2011\n\nE-mail exchange with Christina Zuk, chief of staff to state Sen. Barbara Buono, and David Turner, communications director for the Buono campaign, Jan. 31 and Feb. 5, 2013\n\nE-mail exchange with Patrick Duncan and Frank Belluscio, New Jersey School Boards Association, Jan. 31 and Feb. 5, 2013", "The Star-Ledger, N.J. Senate Majority Leader Barbara Buono could be removed from her post, Nov. 9, 2011", "The Star-Ledger, New N.J. Democratic leadership emerges after weeks of party infighting, Nov. 11, 2011", "New Jersey Department of the Treasury, Pension and Health Benefits Reform, accessed Feb. 6, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]