["About this rating", "A photograph supposedly showing a pagoda flower is frequently shared on social media along with the claim that it only blooms once every 400 years in the Himalayas:", "It's not a cabbage ? but Tibet's unique \"Pagoda Flower\". I was sent this by a dear friend. It is the auspicious Mahameru flower that blooms once every 400 years in the Himalayas. Apparently lucky to see it and will give you a lifetime of good luck - now thats worth sharing! Have a wonderful evening all. Lots love cxxx ??? . #mahameruflower #goodluck #auspicious #beautyinbloom ✨???", "A post shared by  Ching He Huang (@chinghehuang) on Oct 30, 2019 at 11:30am PDT", "This picture does not show a pagoda flower (nor the \"auspicious Mahameru flower\") but rather a plant called the Rheum nobile. While this large plant is native to the Himalayas, it does not bloom once every 400 years.", "The above-displayed photograph was taken by Martin Walsh near Daxue Mountain in Yunnan, China. We're not exactly sure when it was taken, but it was the featured picture for a 2011 newsletter from the Alpine Garden Society. The plant in the foreground is a Rheum nobile, which can grow to more than 1 meter tall, sitting next to its \"cousin\" plant, the Rhus delavayi, as explained by the Alpine Garden Society:", "The scenically stunning Da Xue Shan (Big Snow Mountain) proved to be an absolute treasure house of gorgeous plants including meconopsis, lilies, fritillaries, incarvilleas, pedicularis, primulas, corydalis and others.", "The most imposing was the amazing rhubarb, Rheum nobile (see front cover) dwarfing its cousin, R. delavayi, which stands at a mere 15cm. Among the corydalis, C. benecinta was outstanding and Martin\"s lovely photo of Primula dryadifolia (see p.5) makes us wish we could grow it.", "The Alpine Garden Society's Instagram page contains a few additional pictures of the Rheum nobile:", "Quite a few of you were fascinated by the recent photo of Rheum nobile shared from our China tour. Here's a closer look at the plant - demonstrating how the flowers are covered by the white bracts. This keeps the flowers 4-6°C warmer in the alpine climate and helps ripen the seed. The plant dies after flowering. . . . . . #rheumnobile #rheum #chinaflowers #chineseflora #wildflowers #alpineflowers #alpineplant #alpinelandscape #mountainflowers #plants #plantlove #plantgeek #travel #china #planthunting #horticulture #botanicaltour", "A post shared by  Alpine Garden Society (@alpinegardensociety) on Jul 9, 2019 at 2:30am PDT", "An incredible find on our China tour! _______ #Repost @mark.hortic • • • • • • Standing well over a metre tall, the Rheum nobile we saw today on the @alpinegardensociety tour were spectacular. First time I've seen this plant and I certainly won't forget it! . . . . . #rheum #rheumnobile #alpinegardensocietytour #botanising #alpine #alpineplants #alpineplant #alpinegardensociety #mountain #mountains #plant #plants #horticulture #china #flowers #flower #plantlove #plantmad #wildflowers #travel #explore", "A post shared by  Alpine Garden Society (@alpinegardensociety) on Jun 26, 2019 at 7:03am PDT", "Interestingly, a plant called pagoda flower does exist. The flower (Clerodendrum paniculatum) is native to southeast China and produces huge spikes of coral-pink to reddish-orange, butterfly-shaped flowers that bloom from mid-summer well into fall every year, not every 400 years:", "This is hardly the first time a rumor about a flower that only blooms once every 400 years in the Himalayas has circulated on social media. In 2018, a nearly verbatim copy of this text was attached to a different picture of a flower and given a different name. That variant claimed it was the \"ahameru Pushpam,\" or arya pu, not the pagoda flower:", "This is the flower which is known as \"Mahameru Pushpam\" or Arya Pu. It's seen in Himalaya. It flowers once in 400 years. If we wanted to see it again need to wait for another 400 years. So our generation is lucky. So please share maximum. Let others to see it.", "Again, this photograph was mislabeled. It actually showed a Protea cynaroides, or the king protea, which grows in South Africa.", "In September 2019, a nearly identical rumor was circulated about a \"mahameru flower\":", "And once again, the picture was mislabeled. This photograph actually showed a species of cactus called Carnegiea gigantea.", "In 2023, social media users saw a new spate of \"pagoda flower\" postings, in this instance accompanied by an image showing what appeared to be a tree vaguely resembling a fluffy, white weeping willow. We've not yet located the proper name for this tree, nor, indeed, can we confirm that the image is a real photograph (as opposed to one created using CGI (computer-generated imagery) or AI (artificial intelligence) software:", "We also investigated a similar rumor back in 2016. That one focused on a flower supposedly called the \"nagapushpa flower\" and claimed that it bloomed once every 36 years. However, that rumor used a photograph of a marine invertebrate known as a sea pen.", "Hoax Or Fact.   \"Mahameru Pushpam Rare Himalayan Flower Blooms Once in 400 Years: Fact Check.\"     23 July 2018.", "AFP Indonesia.   \"Flower That Blooms Once every Four Centuries.\"     24 September 2019.", "Almost Eden Plants.   \"Pagoda Flower.\"     Retrieved 1 November 2019.", "World Of Flowering Plants.   \"Protea Cynaroides (King Protea).\"     31 October 2014.", "SEINet.   \"Carnegiea Gigantea.\"     Retrieved 1 November 2019.", "Update [May 3, 2023]: Added 2023 variant.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]