["About this rating", "Warren has repeatedly expressed support for sex-reassignment therapy being covered under taxpayer-funded programs such as Medicaid, Medicare, and Tricare, as well as state Medicaid programs.", "However, a controversial article's headline on the subject was misleading in that it gave rise to the impression Warren had said, word-for-word, \"taxpayers must fund sex reassignment surgery,\" and that she had proposed taxpayers must fund any and all sex-reassignment surgeries, as opposed to simply adding that procedure to the list of services taxpayers already fund under Medicaid and similar programs.", "In September and October 2019, we received multiple inquiries from readers about the veracity of reports that claimed U.S. Sen. Elizabeth Warren had said or argued to the effect that \"taxpayers must fund sex reassignment surgery.\"", "On Aug. 14, the right-leaning website OneNewsNow published an article with the headline, \"Warren: Taxpayers Must Fund Sex Reassignment Surgery,\" which reported that:", "\"Democratic presidential primary candidate Sen. Elizabeth Warren (D-Mass.) launched her fight via social media to have taxpayer dollars fund 'gender-affirming healthcare' so that transgender Americans can have 'free' sex-changing surgery.", "\"'Everyone should be able to access high-quality, affordable, gender-affirming health care, but the Trump administration is trying to roll back important protections for trans Americans,' Warren tweeted Tuesday. 'Help fight back by leaving a comment for HHS in protest.'\"", "Everyone should be able to access high-quality, affordable, gender-affirming health care. But the Trump administration is trying to roll back important protections for trans Americans. Help fight back by leaving a comment for HHS in protest: https://t.co/pKDcOqbsc7", "— Elizabeth Warren (@ewarren) August 13, 2019", "Warren's tweet included a link to the website Protect Trans Health, a campaign run by the Transgender Law Center and the National Center for Transgender Equality. The purpose of that campaign was to solicit and convey criticism to the U.S. Department of Health and Human Services (HHS) about its controversial move to repeal an Obama-era rule that prohibits healthcare and insurance providers from discriminating against trans individuals.", "So the source cited by OneNewsNow did not involve Warren saying, \"Taxpayers must fund sex reassignment surgery.\" The phrasing of the website's headline may have given some readers the impression it was a direct quote, even though OneNewsNow did not actually use quotation marks. It might also have led some to believe Warren had proposed that all sex-reassignment surgeries must be taxpayer-funded, which is not the case.", "Nonetheless, an examination of the record, and confirmation from Warren's 2020 presidential campaign, make it clear that she does indeed support covering sex-reassignment surgery under taxpayer-funded programs like Medicaid, as well as full legal access to the surgery, under private health insurance and Obamacare.", "We asked the Warren campaign whether she supports gender-reassignment surgery, and other transition-related services such as medication, being made available at low cost or no cost, under taxpayer-funded programs such as Medicare, Medicaid, Tricare (for military service members and veterans), as well as through Obamacare and private health insurance policies. A campaign spokesperson was unequivocal in response: \"Yes.\"", "The campaign also directed us to a September 2019 interview Warren conducted with \"HIV Plus\" magazine, in which she gave further details about her stance on the issue. The interview refers to Section 1557 of the Affordable Care Act (Obamacare), so a brief explanation is warranted.", "Section 1557 incorporated existing anti-discrimination law into the Affordable Care Act (ACA). It prohibited healthcare or insurance providers that receive federal funding (include state-by-state Medicaid programs) from discriminating against patients on the basis of their sex, race, religion, national origin, and so on.", "In 2016, HHS under President Barack Obama implemented a new rule that expanded those protections from discrimination and, most notably, defined sex discrimination as including discrimination on the basis of a patient's gender identity, as well as their having previously terminated a pregnancy, among other changes.", "Federally funded healthcare and insurance providers (including state Medicaid programs) could not deny services or treatment access to individuals on the basis of their gender identity, and could not categorically refuse to cover treatments related to gender transition, such as sex-reassignment surgery.", "In May 2019, HHS under President Donald Trump proposed another new rule that would largely reverse the Section 1557 expansions brought by the Obama administration, removing gender identity and pregnancy termination from the definition of sex discrimination. It would also add an explicit religious freedom exemption from the requirements of Section 1557. The department wrote in a press release:", "\"In 2016, HHS issued a new rule that redefined discrimination 'on the basis of sex' to include termination of pregnancy and gender identity which it defined as one’s internal sense of being 'male, female, neither, or a combination of male and female.' In response to a subsequent lawsuit by several states and healthcare entities, on December 31, 2016, a federal court preliminarily enjoined the rule’s gender identity and termination of pregnancy provisions on a nationwide basis, finding them contrary to the applicable civil rights law, the Religious Freedom Restoration Act, and the Administrative Procedure Act.", "\"A second federal court agreed. Because the preliminary injunction continues to be in effect, HHS cannot, and has not since the date of the injunction, enforced the rule’s provisions the court said are likely unlawful. The proposed rule would revise the provisions subject to those injunctions to conform with the plain understanding recognized by the court.\"", "With that context and background in mind, the following is the most relevant exchange from Warren's September 2019 interview with \"HIV Plus\" magazine:", "Interviewer:...If elected, would you support a reinterpretation of Section 1557 of the ACA as covering transgender people and champion the passage of the Equality Act? How would you protect the rights, well-being, and lives of transgender people living in this country, while ensuring that they receive the healthcare and housing necessary to be virally suppressed?\"", "Warren: Discrimination against transgender Americans is unconstitutional and we need to fight back. HHS’s proposed reinterpretation of Section 1557 rolls back critical nondiscrimination protections, allowing health insurance companies to refuse to cover and health care providers to deny health services to transgender people, particularly those with HIV/AIDS, and to those who have had or are seeking an abortion. It also removes requirements to make information language-accessible, which will harm transgender immigrants. As President, I will direct HHS to interpret Section 1557 under its 2016 guidance, to fully uphold civil rights and nondiscrimination protections. I will also direct the CDC to collect accurate data on the health of transgender people and am a co-sponsor of the Equality Act, which bans discrimination against transgender individuals in health care and housing.", "Warren's declaration that she would as president \"direct HHS to interpret Section 1557 under its 2016 guidance\" means she would enforce, once again, a set of rules that mean sex-reassignment surgery would be covered under federal programs such as Medicare, Medicaid, and Tricare, including state-by-state Medicaid programs.", "As such, it is accurate to claim that Warren does propose and has proposed that taxpayers should cover the cost of some sex-reassignment surgeries, as they do other treatments and services, under those programs.", "Warren was also one of 31 U.S. Senators who signed on to a June 2019 letter to Trump's HHS, which opposed and criticized the proposed reversal of the 2016 anti-discrimination enhancements. Warren was joined in signing that latter by fellow presidential candidates and U.S. Senators Kamala Harris, Kirsten Gillibrand, Bernie Sanders, Amy Klobuchar, and Cory Booker.", "Warren has therefore put on the record, several times in 2019, her support for sex-reassignment surgery being included among the treatments and services covered under taxpayer-funded programs, as well as under Obamacare and private health insurance policies.", "However, the OneNewsNetwork headline had a tendency to mislead some readers who may have interpreted its phrasing to mean that Warren had said, word-for-word, \"taxpayers must fund sex reassignment surgery,\" or that she had advocated taxpayers must fund any and all sex reassignment surgery, rather than simply adding one more procedure to the list of procedures taxpayers already fund under Medicaid and similar federal programs.", "As such, we issue a rating of \"Mostly True.\"", "Haverluck, Michael F.  \"Warren: Taxpayers Must Fund Sex Reassignment Surgery.\"\r\n  OneNewsNow.com.  14 August 2019.", "Castro, Anna.  \"Record-Breaking 132,400 People Have Spoken Out to #ProtectTransHealth From Trump.\"\r\n  Transgender Law Center.  14 August 2019.", "National Center for Transgender Equality.  \"Medical Leaders Speak Up for Trans Health.\"\r\n  11 September 2019.", "Anderson-Minshall, Jacob.  \"Elizabeth Warren Explains Her Policy Ideas Around HIV.\"\r\n  HIV Plus.  9 September 2019.", "Code of Federal Regulations.  \"Title 45, Chapter 92, Section 101 -- Discrimination Prohibited.\"\r\n  Legal Information Institute, Cornell Law School.  Accessed 2 October 2019.", "Department of Health and Human Services.  \"Final Rule -- Nondiscrimination in Health Programs and Activities.\"\r\n  Federal Register.  18 May 2016.", "Department of Health and Human Services.  \"Press Release -- HHS Proposes to Revise ACA Section 1557 Rule to Enforce Civil Rights in Healthcare, Conform to Law, and Eliminate Billions in Unnecessary Costs.\"\r\n  24 May 2019.", "Department of Health and Human Services.  \"Proposed Rule -- Nondiscrimination in Health and Health Education Programs or Activities.\"\r\n  Federal Register.  14 June 2019.", "Murray, Patty et al.  \"Letter to Alex Azar, 27 June 2019.\"\r\n  27 June 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]