["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Hosni Mubarak may have ruled Egypt with an iron fist since 1981, but he's been an important ally for the United States in the fight against terrorism -- or so the thinking goes.\n\nNew York Times columnist Ross Douthat, though, questioned whether Mubarak has been as helpful as some believe. Mubarak, after all, led a regime that tortured political dissidents.\n\n\"By visiting imprisonment, torture and exile upon Egypt's Muslim Brotherhood, Mubarak foreclosed any possibility of an Islamic revolution in his own country. But he also helped radicalize and internationalize his country's Islamists, pushing men like Ayman Al-Zawahiri — Osama bin Laden's chief lieutenant, and arguably the real brains behind Al Qaeda — out of Egyptian politics and into the global jihad,\" Douthat wrote. Douthat credited the book The Looming Tower, by Lawrence Wright, for documenting that history.\n\n\"At the same time, Mubarak's relationship with Washington has offered constant vindication for the jihadi worldview,\" Douthat wrote. \"Under his rule, Egypt received more American dollars than any country besides Israel. For many young Egyptians, restless amid political and economic stagnation, it's been a short leap from hating their dictator to hating his patrons in the United States.\"\n\nDouthat concluded his column by noting that a different government in Egypt might not necessarily be a good thing. \"The long-term consequences of a more populist and nationalistic Egypt might be better for the United States than the stasis of the Mubarak era, and the terrorism that it helped inspire. But then again they might be worse. There are devils behind every door,\" he wrote.\n\nWe were interested in Douthat's statement about aid to Egypt.\n\nHe is correct based on the most recent statistics. If you don't count Afghanistan ($8.9 billion) and Iraq ($7.5 billion) because of the ongoing U.S. military operations, then Israel ($2.4 billion) is indeed the top recipient, followed by Egypt ($1.5 billion).\n\nThat's followed by Russia ($1.3 billion), Sudan ($1.2 billion), Tanzania ($1.1 billion), Ethiopia ($1 billion), Pakistan ($963 million), Colombia ($888 million), Jordan ($833 million), and Mozambique ($799 million). We found these ratings in the U.S. Census 2011 Statistical Abstract, which compiled 2008 military and economic aid.\n\nForeign aid includes things such as money for economic development, agriculture or children's health. In Egypt's case, most of the money in recent years has gone to military aid, particularly heavy equipment such as tanks, helicopters and fighter planes.", "We should note that Egypt will likely slip a place when the official 2010 figures are released, according to a report in the Boston Globe. Haiti is expected to receive more aid, because of the earthquake that occurred there in 2010. The Globe also reported that much of the aid the U.S. sends to Egypt comes back to the United States when Egypt purchases weapons from U.S. defense manufacturers.\n\nStill, Douthat wrote that Egypt has received more money than any country besides Israel \"under his rule.\" That would mean the 30 years since Mubarak came to power in late 1981. We turned to the same source the Statistical Abstract used, the U.S. Overseas Loans and Grants data as collected in the \"Greenbook.\" The Greenbook, which is compiled by the U.S. Agency for International Development, provides \"a complete historical record of United States' (U.S.) foreign aid to the rest of the world by reporting all loans and grants authorized by the U.S. Government for each fiscal year,\" according to its site.\n\nWe obtained aid data by country, calculated in inflation-adjusted 2009 U.S. dollars, from 1982 to 2009. This time, Israel ($117.6 billion) was number one, followed by Egypt ($83.7 billion) at number two. Rounding out the top 10 were Iraq ($54.4 billion), Afghanistan ($35.2 billion), Russia ($18.1 billion), Pakistan ($18 billion), Turkey ($16.7 billion), Jordan ($11.2 billion), Sudan ($10.3 billion), and Colombia ($10.3 billion).\n\nFor our ruling, we wanted to know if Douthat was correct that under Mubarak's rule, Egypt received more American dollars than any country besides Israel. Douthat is right. We rate his statement True.", "U.S. Census Bureau, The 2011 Statistical Abstract, Foreign Commerce & Aid: Foreign Aid, U.S. Foreign Economic and Military Aid by Major Recipient Country\n\nThe New York Times, The Devil We Know, op-ed by Ross Douthat, Jan. 31, 2011\n\nU.S. AID, U.S. Overseas Loans and Grants\n\nU.S. AID, U.S. Overseas Loans and Grants, U.S. Total Economic and Military Assistance to the World, FY1982-FY2009, Feb. 3, 2011\n\nThe Boston Globe, Critics question billions in aid routed back to US contractors, Feb. 3, 2011\n\nThe New York Times, Allying ourselves with the next Egypt, op-ed by Sen. John Kerry, Jan. 31, 2011", "U.S. AID, U.S. Overseas Loans and Grants, Standard Country Report: Egypt, accessed Feb. 4, 2011", "Congressional Research Service, Egypt: Background and U.S. Relations, Feb. 1, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]