["A black and white photo of a class of indigenous children posing with their white professor wearing a priest’s collar looks like hundreds of similar photos taken in Canada’s residential schools. The difference is in the troubling caption that led tens of thousands of social media users to share it: “Every one of these children was shot due to overcrowding at a Kanien’keha:ka residential school.”", "The story told alongside the photo suggests that these schoolchildren of the Mohawk Institute, a residential school in Ontario, were shot in 1943 due to overcrowding. The post also claims that their remains were found only in 2008, nearly fifty years after the institute was closed. The same story was previously shared on Facebook, Twitter, and blogs as far back as 2011.", "However, this story is false. The Woodland Cultural Centre, the institution that manages the former Mohawk Institute building, told AFP that no mass grave was ever discovered on the grounds of the former school where Kanien’ka:haka (Mohawk) children were interned, despite extensive archeological searches.", "“With well over 1,000 test pits covering the vast property of the Woodland Cultural Centre, the Archaeologists have found NO human remains and NO mass burials,” cultural center representatives said in an email statement to AFP. The Woodland Cultural Centre is connected to the nearby Mohawk communities, who are represented on the center’s board of directors.", "Jim Windle, a veteran reporter for the Two Row Times, a local weekly publication for native communities, told AFP that his search for proof of the mass grave theory came up empty in the past.", "“I could find absolutely no basis for that. I searched through old Brantford Expositor papers and spoke with many former students (of the Mohawk Institute) and there was no confirmation.”", "The photo used to illustrate the claim was not taken in 1943, nor in Ontario. The original photo shows indigenous children at a residential school in Cranbrook, in Canada’s western province of British Columbia, in 1925, according to the Indian Residential School History and Dialogue Centre.", "Residential schools were educational institutions, usually run by the church, for indigenous children taken from their communities by force. They were established in Canada in an effort to impose a Christian and Western lifestyle on students.", "An estimated 150,000 indigenous children attended Canada’s 130 residential schools between 1831 and 1996. In December 2015, the government accepted a report of the Truth and Reconciliation Commission, a process aimed at shedding light on the residential school system. The report included 94 calls to action.", "On September 30, 2019, the names of 2,800 students who died in residential schools were revealed at a ceremony at the Canadian Museum of History.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]