["The much smaller number of death certificates -- six percent -- that only cited Covid-19 as a cause may not have been filled out in sufficient detail to include any complications of the disease caused by the novel coronavirus, the CDC official told AFP.", "“‘This week the CDC quietly updated the Covid number to admit that only 6% of all the 153,504 deaths recorded actually died from Covid That's 9,210 deaths The other 94% had 2-3 other serious illnesses & the overwhelming majority were of very advanced age,’” says a false August 29, 2020 tweet, later deleted by the platform for violating Twitter’s rules.", "The claim was made by a supporter of QAnon, the conspiracy movement whose theories have been given credence by the US president in media interviews, and by his retweets.", "A day after the original tweet, the user -- Mel Q -- tweeted a photo showing the president retweeting her content, with the caption “Wow! Humbled.”", "Searching the term \"CDC\" for August 30 on Trump Twitter Archive shows the president indeed retweeted the claim. Searching the same day for “Jenna” shows Trump also retweeted conservative media outlet Gateway Pundit’s version of the claim.", "The posts came as the US neared six million cases of novel coronavirus, the most in the world, and with the pandemic casting a shadow over Trump's prospects in the country’s November 3 election.", "More versions of the claim -- which is similar to other false theories about the CDC death toll that AFP Fact Check has debunked here and here -- are available on Facebook here, here and here, and on Instagram here, here and here.", "Some posts include a link to CDC information about Covid-19 comorbidity data as evidence for the claim.", "NCHS Chief of Mortality Statistics Bob Anderson told AFP by phone that nearly all deaths in the cited data table did in fact refer to those where Covid-19 was the underlying cause.", "“It’s basically tabulating each of the conditions that are also reported along with Covid-19,” he said of the additional illnesses listed.", "“These data come from death certificates, and the death certificate is designed to only capture information on causes of death,” meaning Covid-19 is not meant to be recorded as \"an incidental or trivial factor.\"", "Anderson clarified that while people can die of pneumonia they developed because of Covid-19, and both illnesses would be noted on their death certificate, their deaths are only counted once, as Covid-19.", "“It’s kind of ridiculous, because if they took the time to just read, they’d understand a little better what’s going on here,” he said.", "Often, comorbidities -- when a disease or condition exists along with another disease or condition -- are actually complications of Covid-19, Anderson explained.", "“You've got things like acute respiratory failure caused by Covid-19, or pneumonia caused by Covid-19,” he said. So while these conditions are technically comorbidities, “Covid-19 is the underlying cause of death, because it caused pneumonia, which caused the person to die.”", "In all 161,392 cases listed on the CDC comorbidity table below, the underlying cause of death is Covid-19, Anderson explained. The summary indicates that for 94 percent of reported Covid-19 deaths, “something else was reported as either a complication or as a contributing factor.”", "In a second phone call to AFP on September 2, Anderson cited a slightly lower 92 percent figure for Covid-19 being the principal factor that caused a fatality recorded by the CDC data.", "“In 92 percent of cases, it is the condition that initiated that chain,” he said. \"But in eight percent of cases, it's reported as just a contributing factor. So some other condition is reported as the underlying cause, and Covid-19 is reported as a contributing factor.\"", "It would be rare that someone would die solely of Covid-19, Anderson said.", "“We want the sequence of events, we want that causal pathway” that led to the death, “and most certifiers understand that. So they're going to report ‘pneumonia due to Covid-19’,” he said.", "Tracking comorbidities is important because it helps experts and doctors to understand who is most vulnerable to a disease.", "“It can give an idea of people who might be at risk,” Anderson said of such data.", "AFP Fact Check has debunked more than 600 false and misleading claims about the novel coronavirus here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]