["About this rating", "On July 7, 2020, U.S. Rep. Ilhan Omar, D-Minnesota, made remarks on structural racism and inequality during a press conference at the Minnesota state capitol. But her words were almost immediately misrepresented by right-leaning media outlets, commentators, and political figures, and misleadingly presented to make it appear she was undermining the U.S. political and economic systems.", "Joined by members of the Minnesota Legislature’s People of Color and Indigenous caucus, Omar criticized her Republican congressional colleagues for failing to act on federal proposed police reform legislation in the wake of widespread protests against racism and police brutality. Omar also discussed how systemic racial injustice manifests in various facets of society beyond policing, such as inequity in housing, health care, the environment, and the impacts of the coronavirus pandemic.", "Omar noted that COVID-19 had claimed the life of her own father, stating \"I see the pain, the havoc it's wreaking on Black communities in Minneapolis.\"", "She then closed out her comments by stating, \"We must recognize that these systems of oppression are linked. As long as our economy and political systems prioritize profit without considering who is profiting, who is being shut out, we will perpetuate this inequality. So we cannot stop at criminal justice system. We must begin the work of dismantling the whole system of oppression wherever we find it.\"", "As we have previously reported, Omar is the frequent target of misinformation and smears, often motivated by Islamophobia and xenophobia. In this case, headlines like \"Ilhan Omar Calls For The ‘Dismantling’ Of US Economy, Political System\" reordered her words to make it appear she was trying to undermine the economic and political foundations of the country, rather than calling for an end to racial inequality.", "Omar and the other legislators at the July 7, 2020, press conference were discussing racial inequality following nationwide protests in the wake of the death of George Floyd, an unarmed Black man whose death in Minneapolis at the hands of a white police officer that May went viral and sparked widespread outrage.", "Because Omar called for \"dismantling the whole system of oppression\" specifically in reference to systemic racism, and not for dismantling the entire U.S. political and economic system, we rate this claim \"False.\" Her comments in their entirety can be viewed below:", "https://www.youtube.com/watch?v=7u7yyHu6FZk&feature=youtu.be", "Bloomberg QuickTake News. \"Rep. Ilhan Omar Calls for Federal Action to Address Institutional Racism.\"\r\n  7 July 2020.", "MacGuill, Dan. \"No, U.S. Rep. Ilhan Omar Didn’t Give ‘Treasonous’ Military Advice to Iran.\"\r\n  Snopes.com. 13 January 2020.", "Palma, Bethania. \"Did U.S. Rep. Omar Say Al-Qaida Makes Her ‘Proud’?\"\r\n  Snopes.com. 24 July 2019.", "Beauchamp, Zack. \"Republicans Are Taking Ilhan Omar’s Comments on 9/11 Out of Context to Smear Her.\"\r\n  Vox. 11 April 2019.", "Evon, Dan. \"Did This Picture Show U.S. Rep. Ilhan Omar in ‘Jihad Academy’?\"\r\n  Snopes.com. 21 August 2019.", "Buchanan, Larry, et al. \"Black Lives Matter May Be the Largest Movement in U.S. History.\"\r\n  The New York Times. 3 July 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]