["The posts read: \"Dr Dénis Mukwege has just resigned from the Covid19 response team. He declares: \"I cannot in any case dirty my Nobel Peace Prize for money, we have been ordered to declare any illness to be coronavirus and any death. After more than 100 samples none came out positive.\"", "The purported quote has been shared more than 25,000 times in Facebook posts around the continent (including posts we've archived here and here), as well as on Instagram, Twitter and WhatsApp. A French version of the quote has also been circulating widely.", "Mukwege, a DR Congo gynaecologist who shared the Nobel Peace Prize in 2018 for his work against sexual violence in war, was appointed on March 30, 2020 as president and vice president of two task forces fighting against the COVID-19 pandemic in South Kivu province.", "On June 10, he announced his resignation in a statement blaming slow testing, lack of prevention measures and organisational problems. He does not mention any of the reasons listed in the online claims, such as \"money\" or manipulating the number of cases.", "Contacted by AFP Fact Check, Mukwege's communications manager Maud Salomé Ekila said the posts were \"fake news\".", "\"These are not Dr Denis Mukwege's words,\" she said on June 18. \"It's incredible that the media and people online share this false information when we have official accounts where his resignation was explained and justified in a statement.\"", "Mukwege himself tweeted that the posts were \"not genuine\" and posted links to his official social media accounts.", "Statements or press releases posted in my name but not appearing on our social networks @PanziFoundation@PanziUSA@MukwegeFound\n\t\tor our official sites https://t.co/ODQFGakgcm https://t.co/0DEwKkzxw1 https://t.co/KekC4StAma https://t.co/f0pTQFf4mr are not genuine.", "Mukwege said in his resignation statement that he was stepping down to \"devote myself entirely to my medical responsibilities\" at Panzi Hospital in South Kivu province, where he treats survivors of sexual violence.", "He said the time taken to confirm test results -- \"more than two weeks to receive the results\" from the National Institute of Biomedical Research in the capital Kinshasa -- was \"a major handicap\".", "He also blamed a \"denial of realities\" and the \"massive return of thousands of compatriots from neighboring countries without having been quarantined\".", "Mukwege had pleaded in mid-April for partial confinement of people over the age of 60 and compulsory mask-wearing for everyone to help break the chain of virus transmission.", "On May 9, he called for \"emergency supplies\" of tests \"before the exponential curve (of infections) gets underway.\"", "DR Congo has recorded more than 5,200 cases of COVID-19, according to an AFP tally on June 18. Indifference and disbelief towards the disease have become major obstacles for prevention teams, who are regularly defied with cries of \"corona eza te\" or \"there is no corona\" in the local Lingala language.", "President Félix Tshisekedi last month asked the health ministry to investigate rumours of fake patient deaths linked to the virus.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]