["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sailors man the rails as the USS Theodore Roosevelt aircraft carrier makes its way into San Diego Bay on July 9, 2020. The carrier returned to San Diego after a massive COVID-19 outbreak on board. (AP)", "During a speech in Warren, Mich., Democratic presidential nominee Joe Biden criticized President Donald Trump’s handling of the coronavirus pandemic by reminding listeners of the death toll from the virus.", "\"U.S. troops wounded in Iraq and Afghanistan: 53,188,\" Biden said. \"U.S. COVID infected in America: 6,344,700. U.S. COVID deaths: 189,506. Military COVID infected: 118,984. Military COVID deaths: 6,114. Folks, every one of these lives matter. Every one of these lives left somebody behind grieving.\"", "However, the Defense Department has publicly announced that through early September, seven servicemembers have died from the coronavirus and nearly 38,500 had been infected — numbers far below what Biden cited. There have also been 50 civilian deaths, seven deaths of dependents and 20 contractor deaths due to the virus, Military Times reported.", "When we checked with Biden’s campaign team, they said he got the numbers wrong. The campaign said Biden said \"military\" when he meant to say \"Michigan.\"", "The numbers Biden cited roughly align with Michigan’s coronavirus totals. According to the COVID Tracking Project, the number of deaths in Michigan through Sept. 8 was 6,811, and the number of cases was 119,863. Total cases and deaths can vary depending on the source and the time of day the data is drawn.", "We rate Biden’s statement False.", "Joe Biden, remarks in Warren, Mich., Sept. 9, 2020", "COVID Tracking Project, data, accessed Sept. 10, 2020", "Military Times, \"7th US service member has died from COVID-19,\" Sept. 3, 2020", "CNN, \"Biden way overstates the number of military deaths and cases from Covid,\" Sept. 9, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]