["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Tuesday, Jan. 21, 2014 file photo, Oumou Balde, 4, left, plays with her teacher Jacqualine Sanchez, right, and some pretend food in a pre-kindergarten class at the Sheltering Arms Learning Center in New York. (AP)", "First Lady Michelle Obama’s initiative on healthy eating and physical activity may have been intended to be noncontroversial, but it hasn’t turned out that way. She has faced pushback from critics who assail her call for healthier school lunches as forcing kids to eat unappetizing meals and who say she’s second-guessing parents who know what’s best for their kids better than the government does.", "Now, a new front against her has opened in the conservative blogosphere: Michelle Obama, critics say, is requiring day care centers to track their children’s weight.", "A reader tipped us off to this social media phenomenon, which has been driven by such headlines as \"Michelle Obama Sending Government Monitors To Weigh Children In Daycare\" (downtrend.com), \"Government plans to weigh and measure your child in daycare,\" (American Thinker), \"Michelle O Mandates Weighing Children in Daycare,\" (InfoWars), and \"Michelle Obama Now Mandating Daycare Centers Weigh Kids\" (Western Journalism Center).", "So is Michelle Obama really mandating the weighing of children in day care? No, this rumor is wildly overblown. Here’s how it came about.", "In 2010, President Barack Obama signed the Healthy, Hunger-Free Kids Act. Michelle Obama was a high-profile supporter of the measure -- she joined her husband in speaking at the bill-signing ceremony -- after it passed the Senate by unanimous consent and the House by a fairly (but not perfectly) party-line vote.", "The law included a provision (section 223) for a Study on Nutrition and Wellness Quality in Childcare Settings, or SNAQCS. The study was designed to look at four topics: the nutritional quality of foods offered, the amount of physical activity, the amount of sedentary activity and the ways that child care centers and family day care homes can improve their performance on these metrics.", "On March 23, 2015, the U.S. Department of Agriculture released details on the proposed study, along with a request for public comments.", "\"Good nutrition is a key to proper childhood development, but not enough is known about the food children are eating in child care and related programs,\" the document reads. Among other things, the study would involve a child food diary to be completed by parents, a standing height and weight form to be collected by study staff, an infant food intake form and a parent interview.", "If this were a mandatory requirement for all day care centers -- as the blogosphere trumpeted -- that would be pretty intrusive. But it’s not -- it’s a study of a limited number of day care centers and students. The USDA document says it will involve an estimated 3,000 children, 3,753 staff members at child care centers, family day care homes and after-school childcare providers, and 4,175 parents.", "That’s a tiny fraction of the more than 30 million children in some form of day care -- about one ten-thousandth, to be exact.", "The Agriculture Department told PolitiFact that the only mandatory aspect of the program is that all facilities receiving federal funding from the Child and Adult Care Food Program will have to fill out a form. Day care centers that don’t participate in that program may be asked on a voluntary basis if they would like to take part as a control group.", "Moreover, only a small sampling of children at the federally supported centers would ever be weighed, and parents would be allowed to opt their children out of the weighing part if they wish.", "The headline of the article that sparked the flurry of social media commentary -- published by the Washington Free Beacon, a conservative website -- was more measured than the later iterations. The Free Beacon piece was titled, \"Feds to Weigh Children in Daycare: USDA collecting data for study mandated by Michelle Obama’s healthy eating law.\" The Free Beacon mentioned the fact that the study was limited to 3,000 children high up in the story and quotes at length from the USDA’s explanation of the purpose of the study.", "Some of the subsequent articles that appeared on the Internet also mentioned the size of the study and the department’s justification for undertaking it, but the headlines glossed over these nuances. (Email inquiries to several of the publications in question were not returned.)", "\"I'm not responsible for how the blogosphere picks up my stories,\" Elizabeth Harrington, the Beacon reporter who wrote the story, told PolitiFact. \"Though other sites may have gone farther, the mandate in the Healthy Hunger-Free Kids Act, which the First Lady was largely responsible for, is still clear. And that's what I reported on.\"", "Our ruling", "Bloggers say Michelle Obama \"mandates\" weighing children in day care.", "A law she supported -- that was passed by unanimous consent in the Senate -- has set in motion a proposed study of how children in day care are eating, and part of the monitoring would include periodically weighing the participating students. However, the headlines of most of the posts on social media painted this as a sweeping, new requirement for all children in day care. That’s not true -- the study aims to track 3,000 children, or about one ten-thousandth of all children in day care. We rate the claim False.", "CORRECTION, Mar. 27, 2015: This version corrects a mathematical error in the initial posting of this story. Three thousand children is one ten-thousandth of the 30 million children in day care nationally, not one ten-thousandth of 1 percent.", "U.S. Department of Agriculture, \"Food and Nutrition Service Agency Information Collection Activities: Proposed Collection; Comment Request--Study on Nutrition and Wellness Quality in Childcare Settings (SNAQCS),\" March 23, 2015", "Washington Free Beacon, \"Feds to Weigh Children in Daycare: USDA collecting data for study mandated by Michelle Obama’s healthy eating law,\" March 26, 2015", "Snopes.com, \"Weighty Matters,\" March 25, 2015", "Govtrack.us, \"S. 3307 (111th): Healthy, Hunger-Free Kids Act of 2010,\" accessed March 26, 2015", "White House, \"The President & First Lady on Child Nutrition Bill: 'The Basic Nutrition They Need to Learn and Grow and to Pursue Their Dreams,' \" Dec. 13, 2010", "Los Angeles Times, \"Conservatives dig into Michelle Obama's anti-obesity campaign,\" Feb. 26, 2011", "Email interview with Elizabeth Harrington, reporter with the Washington Free Beacon, March 25, 2015", "Email interview with Cullen Schwarz, Agriculture Department spokesman, March 26, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]