["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In the wake of the Planned Parenthood video controversy, several of the Republican presidential candidates weighed in about abortion during the first GOP primary debate on Fox News.", "Here was the exchange between U.S. Sen. Marco Rubio and moderator Megyn Kelly on Aug. 6:", "Kelly: \"You favor a rape and incest exception to abortion bans. Cardinal Timothy Dolan of New York just said yesterday those exceptions are preposterous. He said they discriminate against an entire class of human beings. If you believe that life begins at conception, as you say you do, how do you justify ending a life just because it begins violently, through no fault of the baby?\"", "Rubio: \"Well, Megyn, first of all, I'm not sure that that's a correct assessment of my record. I would go on to add that I believe all --\"", "Kelly: \"You don't favor a rape and incest exception?\"", "Rubio: \"I have never said that. And I have never advocated that. What I have advocated is that we pass law in this country that says all human life at every stage of its development is worthy of protection. In fact, I think that law already exists. It is called the Constitution of the United States.\"", "PolitiFact readers asked us to fact-check Rubio’s claim that he never advocated for a rape and incest exception.", "Rubio’s record on abortion", "We soon found two Senate bills Rubio supported that includes exceptions for rape and incest.", "In November 2013, Rubio was one of 40 cosponsors of a Senate bill entitled \"Pain-capable unborn child protection act.\" Several GOP presidential candidates backed the bill, including main sponsor Lindsey Graham of South Carolina and co-sponsors Ted Cruz of Texas and Rand Paul of Kentucky.", "The bill bans abortions at 20 weeks or greater but includes exceptions, including rape and incest:", "\"(1) where necessary to save the life of a pregnant woman whose life is endangered by a physical disorder, illness, or injury, excluding psychological or emotional conditions; or (2) where the pregnancy is the result of rape, or the result of incest against a minor, if the rape has been reported at any time prior to the abortion to an appropriate law enforcement agency, or if the incest has been reported at any time prior to the abortion to an appropriate law enforcement agency or to a government agency legally authorized to act on reports of child abuse or neglect. …\"", "The 2013 bill stalled in committee; Graham sponsored a similar version in 2015 -- and again Rubio is listed as one of dozens of co-sponsors. This version also has a rape exception, although the language differs. It requires for adult women to obtain counseling or medical treatment for the rape 48 hours before the abortion, with separate criteria for minors about reporting the rape to law enforcement.", "We asked a Rubio spokesman about his claim in light of the 2013 bill.", "\"Marco has supported pro-life legislation with and without exceptions because they enhance protections for innocent life,\" Alex Conant told PolitiFact. \"Pro-life groups supported that legislation -- Marco has a 100 percent rating from National Right to Life in the 112th and 113th Congresses, and a 100 percent rating from the Family Research Council in the 113th Congress.\"", "Rubio has long been an opponent of abortion rights, and his record bears that out. National Right to Life gave him a 100 percent rating for the 112th and 113th congresses. In both sessions, the ratings were based on five votes, such as cutting off funding for Planned Parenthood, repealing or defunding the Affordable Care Act and protecting free speech.", "The Family Research Council also gave Rubio a 100 percent rating for 13 votes in 2013-14. And NARAL, a group that supports abortion rights, gave Rubio a zero every year between 2011 and 2014.", "We found two examples of bills that Rubio voted for that did not appear to obtain a rape exception.", "In 2000, then state Rep. Rubio voted for a ban on late-term abortions, according to an article in the Miami Herald. The original version of that bill didn’t contain a rape exception, though it allowed a doctor to take steps to save the life of the mother. The Senate version of the bill had no rape exception, but it did have the exception about saving the mother’s life. That was signed into law by then Gov. Jeb Bush in May 2000. But within a couple of months, state officials gave up on enforcing the ban due to court decisions including a ruling by the U.S. Supreme Court.", "The other example is a 2013 U.S. Senate bill that is similar to Graham’s proposal to ban abortion at 20 weeks or later; however, it only pertains to the District of Columbia. That bill, sponsored by Sen. Mike Lee, R-Utah, has dozens of co-sponsors including Rubio. The bill makes an exception to save the life of the mother but not for rape or incest.", "In an interview after the debate, Rubio told CNN’s Chris Cuomo, \"I'm in favor of a 20-week abortion ban. Does that mean I'm in favor of abortions at 19 weeks? No. Any bill that reduces the number of abortions is a bill that I'm going to support.\"", "Our ruling", "Rubio said during the debate about exceptions for rape and incest on abortion: \"I have never said that or advocated that.\"", "Recently, Rubio has supported a bill that would have banned abortion after 20 weeks, and the bill did include exceptions for rape or incest. So Rubio has supported legislation with exceptions.", "However, we could find no evidence that Rubio has generally favored those types of exceptions, and we couldn’t find him specifically advocating for them.", "Rubio’s claim has an element of truth, but it leaves out important details. So we rate it Mostly False.", "YouTube, Debate clip, Aug. 6, 2015", "CNN, Interview with Sen. Marco Rubio, Aug. 7, 2015", "Congress.gov, S. 886, May 7, 2013", "Congress.gov, S. 1670, Introduced Nov. 7, 2013", "Congress.gov, S. 1533, Introduced June 11, 2015", "National Right to Life scorecards for U.S. Sen. Marco Rubio 112th and 113th congresses", "Family Research Council, Scorecard for U.S. Sen. Marco Rubio, 2013-14", "NARAL, Scorecard for U.S. Sen. Marco Rubio, 2014", "The Hill, \"Rubio: abortion rights’ arguments ‘indefensible,’\" July 10, 2015", "Florida House, HB 583 and SB 160, 2000", "Face the Nation, \"Rubio: Opposing abortion isn’t about denying rights,\" Aug. 26, 2012", "PolitiFact, U.S. Sen. Marco Rubio’s Truth-0-Meter record, Aug. 6, 2015", "Tallahassee Democrat, \"Legislator wants to ban abortion,\" (Accessed in Nexis) Feb. 19, 2009", "Miami Herald, \"Florida prohibits late term abortions,\" Accessed in Nexis May 4, 2000", "Miami Herald, \"Legislature’s abortion law put on hold,\" Accessed in Nexis, June 3, 2000", "Tampa Bay Times, \"Late term abortion ban on hold,\" July 7, 2000", "Interview, Alex Conant, U.S. Sen. Marco Rubio spokesman, Aug. 7, 2015", "Interview, Kevin Bishop, U.S. Sen. Lindsey Graham spokesman, Aug. 7, 2015", "Interview, Aniello Alioto, NARAL spokeswoman, Aug. 7, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]