["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Scott Walker may have vetoed 104 items from the 2015-’17 budget, but he left in one that has Democrats and union leaders upset.", "The Wisconsin State AFL-CIO posted a meme to its Facebook page July 8, 2015 that in bold letters proclaims: \"Scott Walker’s bad budget includes: No weekend for workers.\"", "The meme goes on to say the change could \"lead to intimidation in the workplace and to an environment where bosses can pressure workers into working every single day of every single month without needed rest.\"", "It’s not the first time unions have slammed the governor.The most notable outcry came after Walker and Republicans passed Act 10, which sharply curtailed collective bargaining for most public employees. More recently, Walker signed a \"right-to-work\" measure in March 2015 that prohibits requiring private sector workers to pay union fees.", "The no-weekend claim had come up before.", "An opinion piece published in the Milwaukee Journal Sentinel written by Stephanie Bloomingdale, secretary-treasurer of the Wisconsin State AFL-CIO declared, \"they took away the weekend.\" And a Gawker article, shared widely on social media sites, was titled, \"Wisconsin is trying to take away your right to a weekend.\"", "So, now that it’s summer, it begs this important question: Will you have to work this Saturday and Sunday?", "Background on the law", "Since the 1970s, a law has required employers operating factories or retail stores to give workers at least 24 hours off every seven days.", "That law does not apply to janitors, security personnel or those who care for live animals. People who are employed in the manufacture of butter, cheese or other dairy products, or in bakeries, flour and feed mills, hotels and restaurants are also exempt.", "Passage of the law came on the coattails of federal legislation -- the Occupational Safety and Health Act -- aimed at assuring safe and healthy working conditions. Wisconsin, and most other states, passed additional legislation in 1971 to improve employment standards.", "In 2014, Republican lawmakers pushed a bill that would have allowed workers to voluntarily forgo that day of rest. The bill, which the state AFL-CIO lobbied against, passed committee, but did not get a vote in the full Senate.", "At that time, supporters said the bill would give workers a way to earn some extra money, while allowing companies to increase production. For instance, if a company needed to run extra hours to fulfill an order, all workers would be eligible to get a piece of the extra cash.", "Sponsors said the idea came from the Wisconsin Manufacturers and Commerce. The Metropolitan Milwaukee Association of Commerce and the Wisconsin Manufacturers and Commerce also lobbied in support of the bill.", "Backers of the change noted the federal government does not impose limits on consecutive work days.", "How it changes", "The provision inserted into the state budget permits employees in certain industries  to voluntarily work seven days in a row. It was added in committee July 7, 2015, a day before the GOP-controlled Senate passed the budget.", "So who can volunteer to work seven days without rest?", "The same workers protected under the old law. So really just a fraction of workers in the state are affected by the budget provision -- though the union offers it as so sweeping that everyone might be affected.", "\"There will be a chilling effect for everyone,\" Bloomingdale said in an interview. \"It sends the message that it’s acceptable to go without a day of rest.\"", "John Witte, professor emeritus of political science and public affairs at the University of Wisconsin-Madison, said the union’s statement is \"clearly overstating the case.\"", "Witte said one problem for the workers is that employers could take advantage of the provision and subtly coerce workers to \"volunteer.\"", "\"If, however, employers tried to make that an overt requirement of employment, the workers could use that as a legal argument against the employer because that would clearly violate the voluntary nature of the action,\" Witte said.", "Our rating", "The state AFL-CIO said, \"Scott Walker’s bad budget includes: No weekend for workers.\"", "But the provision does not apply to all workers, as the claim suggests. What’s more, it is a voluntary thing -- workers could agree to the extra day to, for instance, earn extra overtime.", "We rate the claim False.", "Department of Workforce Development, One day of rest in seven.", "Email exchange with John Witte, Professor emeritus of political science and public affairs, University of Wisconsin-Madison.", "Phone conversation with Stephanie Bloomingdale, Secretary-treasurer of the Wisconsin State AFL-CIO, July 15, 2015.", "Milwaukee Journal Sentinel, Budget amendment would allow 7-day workweeks, July 7, 2015.", "Stephanie Bloomingdale in the Milwaukee Journal Sentinel, Walker and GOP just took away the weekend, July 13, 2015.", "Associated Press, GOP lawmakers propose allowing 7-day work week in Wisconsin, Jan. 12, 2014.", "Milwaukee Journal Sentinel, Scott Walker signs state budget with 104 vetoes day before 2016 kickoff, July 12, 2015.", "Email exchange with John Dipko, Communications director, Department of Workforce Development.", "Monthly Labor Review, Changes in state labor laws in 1971, January 1972.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]