["Inch by inch, row by row, time to see if Donald Trump's claims will grow.", "At a rally in Des Moines, Iowa, Trump proclaimed that he was \"going to end this war on the American farmer\" and accused Hillary Clinton of wanting to shut down family farms.", "\"Almost 97 percent of farms in this country are family owned and family managed. It’s not only a great American tradition, but a vital component of America’s economic and national security,\" Trump said.", "\"Yet, Hillary Clinton wants to shut down family farms just like she wants to shut down the mines and the steelworkers,\" he continued. \"She will do this not only through radical regulation, but also by raising taxes on family farms — and all businesses — to rates as high as nearly 50 percent. Adding to the pain, she will tax family farms again at death by as much as 45 percent.\"", "There are four elements here. We'll take them in order.", "Clinton wants to shut down family farms?", "There is no evidence this is true.", "Clinton, in fact, talks about a strong agricultural economy on her website.", "\"A strong agricultural economy remains a critical cornerstone of a vibrant rural economy,\" Clinton’s website says. \"Farmers and ranchers supply food for America's dinner tables, invest in farm machinery and supplies, and provide domestic energy resources that fuel small businesses. The agriculture economy also drives America's larger economic success.\"", "Her site talks about \"raising agricultural production and profitability for family farms,\" offering \"support (for) the next generation of farmers,\" and providing \"a focused safety net for farmers and ranchers.\"", "So what's Trump talking about? His campaign declined to offer details, but based on his speech, that's where regulations, the business tax and the death tax come in.", "'Radical regulation'", "We asked the Trump campaign for specifics about what Trump meant by \"radical regulations.\" They declined to cite specifics, saying it's been outlined in his speeches.", "We searched the Congressional Quarterly database of Trump speeches since January. We found two other instances where the candidate talked about \"radical regulations.\" Like his speech in Iowa, neither said what they were.", "Raising taxes as high as nearly 50 percent", "Trump is plowing familiar ground here claiming that Clinton would raise taxes on family farms — and all businesses — to rates as high as nearly 50 percent", "We rated a different version of this statement Mostly False.", "The Trump campaign is talking about Clinton's proposal to raise the tax rate for taxpayers who have an adjusted gross income of more than $5 million.", "Currently, taxpayers with adjusted gross income of more than $5 million have a tax rate of about 43.4 percent. Clinton wants to raise the rate by 4 percentage points, to 47.4 percent.", "Income above $5 million would potentially be subject to the additional 4 percent tax.", "And to be sure, that would not affect the vast majority of people who own small businesses or family farms.", "According to the United States Department of Agriculture, of the 2.1 million farms in the country in 2012, only 0.3 percent of family farms were large enough to have gross cash income of $5 million or more. The vast majority -- 88 percent -- reported less than $350,000 in income.", "Roberton Williams, senior fellow at the nonpartisan Tax Policy Center, said, \"Very few people make enough to be affected by the surtax and only a tiny fraction, if any, are traditional family farmers.\"", "'Death' tax", "This is another cornfield we've visited before.", "The \"death tax\" is formally known as the estate tax, which applies to inherited assets such as cash, stock and real estate. The problem with Trump's assertion is that only the wealthiest Americans are subject to the tax and only a tiny fraction of those are farmers.", "The tax doesn't kick in until an individual's estate is worth $5.45 million and the 40 percent tax only applies to amounts over that limit, which is indexed for inflation.", "At first blush, this would seem like an area where family farms might be hit particularly hard. Given the price of land and the expensive machinery used to farm it, it would seem that even the value of a small farm would likely exceed the $5.45 exemption.", "But in reality, in 2013 only 16 to 24 small businesses and farm estates owed any estate taxes, and the actual tax amounted to just 4.9 percent of the estate's total value, according to an analysis by the nonpartisan Urban-Brookings Tax Policy Center. Many of those may actually have been businesses, not farms.", "Not only that, the exemption doubles for a farm owned by a couple, there is an additional $1.5 million exception for closely held family farms, and the tax code allows farms to spread their payments over 15 years at a low interest rate.", "That number prompted comedian Bill Maher to joke that, \"More astronauts have been to the moon than farmers who paid the inheritance tax in 2013,\" a statement we rated as Mostly True.", "But, as we reported in 2014, there are countervailing forces at work here.", "For example, if you want to take advantage of the tax breaks, the property has to be held and used for farming for 10 years, and using it as collateral for a loan becomes more difficult because the IRS places a lien on the property to make sure it's used for crops or livestock.", "The estate tax was more of an issue for family farms years ago when the exemption was much lower. In 2001, during the Bush administration, for example, only the first $1.5 million was exempt from the tax. Now it’s $5.45 million.", "President Barack Obama has tried to get the exemption brought down to $3.5 million. Trump, like most Republicans, wants to eliminate the estate tax entirely. That would leave the treasury short by about $19 billion.", "\"Note that years ago, opponents of the estate tax who asserted that families had to sell their farms to pay the estate tax were unable to find a single case where that happened,\" said Williams, the Tax Policy Center expert. \"I expect that finding family farms that would be driven out of business by the surtax would be just as hard.\"", "Our ruling", "Trump said, \"Hillary Clinton wants to shut down family farms\" using \"radical regulation,\" by raising tax \"rates as high as nearly 50 percent\" and through a death tax as high as 45 percent.", "So let's harvest the arguments.", "Clinton wants to shut down family farms? We've seen no evidence she's ever said that.", "Radical regulation? Trump's not providing any evidence to evaluate.", "Raising taxes to nearly 50 percent? Clinton's proposing an extra 4 percent increase, but that's on the wealthiest Americans, and very few family farms will face it.", "Death tax? Family farms have been surviving with the death tax for years, and the best data suggest that it affects no more than about 20 estates nationwide per year, if that.", "We rate this combination of claims as False.", "https://www.sharethefacts.co/share/114a083e-bf90-4b4b-90b8-cd9819ef30b9", "PolitiFact, \"Pro-McConnell group says the estate tax makes it hard for family farms to survive,\" April 3, 2014", "PolitiFact, \"Donald Trump says Hillary Clinton plan would tax small businesses at nearly 50 percent,\" Aug. 10, 2016", "PolitiFact, \"Bill Maher says more Americans have been to the moon than farmers who paid the estate tax in 2013,\" April 23, 2015", "Politico, \"Transcript: Donald Trump's full remarks in Des Moines, Iowa,\" Aug. 27, 2016", "Email, Roberton Williams, senior fellow, Tax Policy Center, Aug. 30, 2016", "Emails, Stephen Miller, spokesman, Donald Trump campaign, Aug. 30, 2016", "United States Department of Agriculture, \"2012 Census of Agriculture Highlights; Family Farms,\" March 2015", "Forbes, \"IRA Announces 2016 Estate And Gift Tax Limits: The $10.9 Million Tax Break,\" Oct. 22, 2015", "Center on Budget and Policy Priorities, \"Policy Basics: The Estate Tax,\" updated July 5, 2016", "Tax Policy Center, \"Current Law Distribution of Gross Estate and Net Estate Tax by Size of Gross Estate, 2013; Farm and Businesses Under $5 Million,\" accessed April 22, 2015", "The Tax Foundation, \"The Estate Tax Provides Less than One Percent of Federal Revenue,\" April 7, 2015", "HillaryClinton.com, \"Hillary Clinton's Plan for a Vibrant Rural America,\" accessed Aug. 30, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]