["About this rating", "Within hours of news breaking about the death of musician Prince, a meme began to circulate online featuring a purported quote from the music icon about his supposed devotion to the Republican party:", "One day my brothers and sisters will realize that Democrats have made us weak by giving us things we would normally have to work for. That is why I vote Republican for they realize anything worth having is worth working for.", "We couldn't uncover any record of Prince's uttering this phrase. The quotation (whether from Prince or anyone else) doesn't appear in any reports from major news outlets and appears to have been invented solely for this fictional meme.", "The quote also doesn't fall in line with Prince's known political views. Like the musician's life and career, Prince became famous by defying definition. Throughout his life he expressed support (and criticism) for a wide range of political and social views.", "Most recently, Prince voiced his support for the Black Lives Matter movement. He performed a concert in Baltimore after the death of Freddie Gray (a young black man who died in police custody), said \"books, black lives, and albums still matter\" during the 2015 Grammy Awards, played a secret show at the White House (President Obama is reportedly a big fan of Prince's), and (according to Rev. Al Sharpton) donated money to the family of Trayvon Martin (the black Florida teen fatally shot by George Zimmerman):", "When we were raising the issue of justice around the Trayvon Martin killing. Prince called me and sent some funds that I gave to the family for him, and never wanted recognition for it… He was one that didn’t want to make a lot about about his humanitarian and activist involvements, but he was very much involved in what was going on in the country.", "However, while Prince exuded sexuality on the stage, the musician did harbor conservative religious views. Prince, who was raised a Seventh-Day Adventist and later became a Jehovah’s Witness, criticized both Republicans and Democrats for their interpretation of the Bible during an interview with the New Yorker in 2008:", "So here's how it is: you’ve got the Republicans, and basically they want to live according to this.” He pointed to a Bible. “But there’s the problem of interpretation, and you’ve got some churches, some people, basically doing things and saying it comes from here, but it doesn’t. And then on the opposite end of the spectrum you’ve got blue, you’ve got the Democrats, and they’re, like, ‘You can do whatever you want.’ Gay marriage, whatever. But neither of them is right.”", "When asked about his perspective on social issues—gay marriage, abortion—Prince tapped his Bible and said, “God came to earth and saw people sticking it wherever and doing it with whatever, and he just cleared it all out. He was, like, ‘Enough.’\"", "While Prince once donated to the campaign of a Republican senator from Minnesota in 1990, the musician said in 2009 that his religious views prevented him from voting:", "“The reason why is that I’m one of the Jehovah’s Witnesses,” Prince said. “And we’ve never voted. That’s not to say I don’t think ... President Obama is a very smart individual and he seems like he means well. Prophecy is what we all have to go by now.”", "We found no record of Prince's ever expressing a devotion to the Republican Party. In fact, while researching Prince's political views, we found that the musician supported a wide range of political views, and (like the rest of his life and his career) could not be described as fitting into any one specific political category or party.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]