["South African motorists are feeling the pinch. A major hike in fuel prices took effect on 3 October 2018.", "Website Breek Nuus claimed that some drivers could escape the increase.", "The article reported that energy minister Jeff Radebe had convinced President Cyril Ramaphosa to “allow previously disadvantaged people to pay less for fuel by means of subsidising them”.", "But the minister has never made such claims, Maropeng Ramokgobathi, a spokesperson in the department of energy, told Africa Check.", "The department gave a number of “international factors” as the reasons for the current price adjustments.", "These include a higher rand exchange rate to the dollar, which means South Africa pays more for imported goods, and international tensions such as the “unwillingness by Organisation of Petroleum Exporting Countries (OPEC) to increase their production outputs”.", "These have led to increases in the price of crude oil, which have been passed down to the price of refined products such as petrol, the department’s media report said.", "The fuel price is set by four factors, according to Roula Inglesi-Lotz, a professor in the department of economics at the University of Pretoria.", "They are:", "The basic fuel price, which accounts for the shipping of fuel to South Africa", "The general fuel levy, a tax on petrol sold", "A levy for the Road Accident Fund, which pays victims of road accidents", "Other costs such as wholesale and retail profits, distribution and transport costs.", "Azar Jammine, the director and chief economist at the economic consultancy Econometrix, told Africa Check that no supplier could set their own price for fuel.", "“It’s all controlled in South Africa,” Jammine said. “It’s all regulated. So the moment you give discounts you’re breaking the rules.”", "Please complete this form to receive the HTML sharing code.", "A fact-checker has rated your Facebook or Instagram post as “false”, “altered”, “partly false” or “missing context”. This could have serious consequences. What do you do?", "Click on our guide for the steps you should follow.", "Africa Check is a partner in\nMeta's third-party fact-checking programme\nto help stop the spread of false information on social media.", "The content we rate as “false” will be downgraded on Facebook and Instagram. This means fewer people will see it.", "You can also help identify false information on Facebook. This\nguide explains how.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]