["About this rating", "In 2000, Mike Pence publicly downplayed the risks of smoking cigarettes and stated \"smoking doesn't kill.\"", "Pence's point was that not everyone who smokes dies from smoking-related illnesses, and he acknowledged the health risks of smoking after referencing fairly accurate statistics about them.", "On 10 November 2016, the IFLScience blog published an article reporting that Vice President-Elect Mike Pence \"doesn't believe that smoking kills.\" The headline traversed Facebook quickly and widely:", "Mike Pence, the vice president-elect of the US, has said he doesn't believe smoking kills people.", "He made that case in an op-ed article published in 2000 and has made no public effort to update his position since.", "\"Time for a quick reality check,\" Pence wrote. \"Despite the hysteria from the political class and the media, smoking doesn't kill. In fact, 2 out of every three smokers does not die from a smoking related illness and 9 out of ten smokers do not contract lung cancer.\"", "IFLS referenced a March 2015 BuzzFeed item titled \"'Smoking Doesn’t Kill' and Other Great Old Op-Eds from Mike Pence\" which similarly featured a headline claiming Pence had once stated that \"smoking doesn't kill\" and featured archival links to op-eds penned by Pence back in 2000. However, Pence's editorial pertained to the role of \"Big Government\" with respect to adult tobacco use and largely railed against anti-tobacco legislation which he maintained impinged on individual freedom:", "In the coming weeks, Americans are going to be treated with the worst kind of Washington-speak regarding the tobacco legislation currently being considered by the Congress and Attorney Generals from forty different states. We will hear about the scourge of tobacco and the resultant premature deaths. We will hear about how this phalanx of government elites has suddenly grown a conscience after decades of subsidizing the product which, we are now told, \"kills millions of Americans each year\".", "Time for a quick reality check. Despite the hysteria from the political class and the media, smoking doesn't kill. In fact, 2 out of every three smokers does not die from a smoking related illness and 9 out of ten smokers do not contract lung cancer. This is not to say that smoking is good for you ... news flash: smoking is not good for you. If you are reading this article through the blue haze of cigarette smoke you should quit.", "The relevant question is, what is more harmful to the nation, second hand smoke or back handed big government disguised in do-gooder healthcare rhetoric.", "Even a conservative like me would support government big enough to protect us from foreign threats and threats to our domestic tranquility but the tobacco deal goes to the next level. Government big enough to protect us from our own stubborn wills. And a government of such plenary power, once conceived will hardly stop at tobacco. Surely the scourge of fatty foods and their attendant cost to the health care economy bears some consideration. How about the role of caffeine in fomenting greater stress in the lives of working Americans? Don't get me started about the dangers of sports utility vehicles!", "Those of you who find the tobacco deal acceptable should be warned as you sit, reading this magazine, sipping a cup of hot coffee with a hamburger on your mind for lunch. A government big enough to go after smokers is big enough to go after you.", "Although Pence did state that \"smoking doesn't kill,\" he buttressed his argument by saying that only a third of smokers died of smoking-related illnesses (and that only one in ten developed lung cancer) while unequivocally declaring that \"smoking is not good for you.\"", "The clumsy choice of wording (in a paragraph that conflicted with itself) cited statistics that were reasonably accurate at the time. Pence maintained that a third of smokers died of smoking-related illnesses, a figure that appeared to come from a 1987 study. Data demonstrating the percentage of smokers who contract lung cancer were mixed, but some indicated the number was roughly ten to 15 percent.", "In 2015 and 2016, a more than fifteen-year-old op-ed written by Mike Pence drew attention anew as the election of Donald Trump elevated him to the position of Vice President Elect. It was true that Pence's commentary on tobacco restriction stated \"smoking doesn't kill,\" but it went on to cite relatively accurate numbers about the risks of smoking. Moreover, Pence's editorial had little to do with the statistical risks associated with tobacco, but rather with his belief that smokers ought to be permitted to smoke if they wished without governmental interference.", "In his piece, Pence stated that he believed smoking was a poor health choice and that current smokers should quit. Since 2000, Pence has made no similar comments downplaying the risks of smoking that we could find, and his current position on the issue remains unclear.", "Letzter, Rafi.   \"Mike Pence, The US Vice President-Elect, Has Said He Doesn't Believe That Smoking Kills.\"\r\n    IFLScience.   10 November 2016.", "Mattson, M.E. et al.   \"What Are the Odds That Smoking Will Kill You?.\"\r\n    American Journal of Public Health.   April 1987.", "Kaczynski, Andrew.   \"'Smoking Doesn’t Kill' and Other Great Old Op-Eds from Mike Pence.\"\r\n    BuzzFeed.   31 March 2015.", "Kelland, kate.   \"Nutrients May Be Why Some Smokers Avoid Cancer.\"\r\n    Reuters.   16 June 2010.", "Pence, Mike.   \"The Great American Smoke Out.\"\r\n    Mike Pence, Congress.   Undated.", "Villeneuve, P.J. et al.   \"Lifetime Probability of Developing Lung Cancer, By Smoking Status, Canada.\"\r\n    Canadian Journal of Public Health.   December 1994.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]