["Several Facebook and Twitter users have posted a collage of three images with the claim that the India army made a 1000-bed hospital in Barmer, Rajasthan in a matter of days. Several social media users have written, “It takes a few hours to set up such Hospitals…And we have only been reading about China doing such miraculous feats and forgotten the achievements of our own army.” The images of circulating in light of the coronavirus pandemic.", "Alt News has received several requests to fact-check the images on WhatsApp (+91 76000 11160) and on our official Android application.", "Image 1", "Alt News performed a reverse image search on Yandex and found that the viral image has been used in articles on Russian news websites – annews.az and aze.az.", "The report published by annews.az in September 2019 said, “Russia to donate mobile hospital worth KGS 5.5 mln to Kyrgyz Emergency Ministry”. The article on aze.az is from February 26.", "It is important to note that neither of the websites has given picture credit. Since the same image has been used for two different reports, it is most likely a representative image. Alt News couldn’t authenticate who clicked the picture but that it was not shot in 2020.", "Image 2", "After a reverse image search on Google, we found the viral image on the website of the United States Air Force. According to the article published in 2008, the image shows a Mobile Field Hospital. “The hospital is designed with climate control systems and is self-contained with all medical equipment, supplies, and pharmaceuticals to deliver comprehensive emergency medical care. The three MFHs can also be integrated to provide one 600-bed facility.” The image was clicked by Staff Sgt. Diane Ducat.", "The website also has linked the high-resolution image of the photo. As a result, Alt News could analyse the EXIF data of the image. According to the EXIF data, the image was clicked on March 21, 2006.", "Image 3", "After a reverse image search on Google, Alt News found a tweet by Principal Spokesperson, Ministry of Defence, Government of India which posted the viral image in 2015. The picture shows a set up by the Army Medical Corps at Kathmandu Air Base. This was part of disaster relief aid extended to Nepal after a severe earthquake.", "#NepalEarthquake Casualty Triage Centre set up by Army Medical Corps at Kathmandu Air Base to aid the rescued people pic.twitter.com/a8FW48gaUI", "— ADG (M&C) DPR (@SpokespersonMoD) April 28, 2015", "On March 23, Additional Directorate General of Public Information, Ministry of Defence debunked the misinformation that the Indian army has built a 1000-bed quarantine facility in Barmer.", "A Fake input is circulating on Social Media that #IndianArmy has established 1000 bed quarantine facility in Barmer.", "This is untrue. pic.twitter.com/ne78m7KCXW", "— ADG PI – INDIAN ARMY (@adgpi) March 23, 2020", "Thus the social media claim associated with the viral images is false.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]