["\"So Queen Elizabeth still wears to match mask (sic),\" reads the caption on this Facebook post by a page administered in Italy and Nigeria. It has been shared more than 3,000 times since March 25, 2020.", "The post includes four images of Britain's Queen Elizabeth appearing in different outfits with matching face masks.", "\"Queen Elizabeth maintains her fashion sense during these times of Coronavirus as seen from her matching outfits and masks,\" says another Facebook post archived here.", "A similar claim has been published here and here on Nairaland, Nigeria's most visited domestic social network, according to Alexa website traffic rankings. AFP Fact Check has archived similar claims shared in Kenya, Ghana, Zambia, and Uganda.", "More than 11 million people globally, including nearly 286,000 in the UK, have been infected with COVID-19 as of July 7, 2020, with the World Health Organization (WHO) warning that people older than 60 are at a higher risk of getting the disease caused by the coronavirus.", "AFP Fact Check recently debunked social media posts claiming that the 93-year-old monarch had contracted the virus, which the WHO says requires the use of masks to slow down its transmission.", "But the claim about the queen wearing masks matching her colourful couture, which has also spread to Twitter alongside similar images, is false. All the images were doctored to add masks by an artist who then published them among a body of his works.", "By running multiple reverse image searches, AFP Fact Check found a version of the first photo, where the Queen appears in a yellow outfit, in a June 2019 article by The Daily Mail newspaper on her visit to a school in Scotland.", "The watermark for the UK-based PA Media news agency, formerly Press Association, found in the bottom left-hand corner of the photo, led us to the source of the image in the agency’s photo archives.", "A similar search for the second image of the queen in a lime-coloured coat led to the original version on the website of US-based stock photo agency Alamy, which states the image shows the monarch attending the Al Habtoor Royal Windsor and Mountbatten Cup Final in Surrey in 2015. Alamy credited the WENN entertainment news photo agency, which also published the image on its website.", "We traced the third image of the monarch looking radiant in tangerine to the archives of the i-Images picture agency. The photo was shot in 2017 by Andrew Parsons, who included this caption: “HM Queen Elizabeth II at St. Mary Magdalene Church on her Sandringham estate in Norfolk, for the Christmas Day service.”", "The queen makes a final stylish appearance in a red dress in the fourth photo. The picture by Dan Kitwood was shot on October 26, 2010, in Windsor, England, as seen here on the website of photo agency Getty Images.", "Embed from Getty Images", "“Queen Elizabeth II arrives to greet the Emir of Qatar, Sheikh Hamad bin Khalifa al Thani to her Windsor residence on October 26, 2010 in Windsor, England,” reads the caption.", "Meanwhile, AFP Fact Check found an A-shaped watermark centred at the bottom of most of the altered images.", "We ran another reverse image search on Yandex using the clue from the watermark and found this tweet by a Twitter user called JWalter.", "The Queen is a better role model than Trump. pic.twitter.com/fH37r1FeeY", "The images of the masked queen in the tweet also carry the distinctive watermark, as well as the name “Andrea Crespi”.", "A keyword search for “Andrea Crespi” found the masked images on the Instagram page of Italian artist Andrea Crespi. He published six digitally-altered images in total, captioning them “GOD SAVE THE QUEEN” in a March 17, 2020 post.", "GOD SAVE THE QUEEN. ????️‍? what is your favorite outfit? 1,2,3,4,5 o 6 ? Art by @andcrespi", "A post shared by  who the fvck is ANDREA CRESPI (@andcrespi) on Mar 17, 2020 at 11:05am PDT", "In the Instagram post, Crespi asks his followers to pick their favourite images, which he describes as “art by @andcrespi”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]