["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In October 2020, less than a week before Election Day, multiple online observers and campaigners critical of U.S. President Donald Trump claimed that he had been caught on camera at a rally in Michigan, calling for the assassination of his rival, Democratic presidential nominee Joe Biden.", "On Oct. 27, the Lincoln Project, an influential group led by erstwhile Republican strategists who are supporting Biden's candidacy and are virulently opposed to Trump, posted a short clip of the president's rally in Lansing, Michigan, along with the claim, \"Trump is calling for the assassination of his political opponent.\" In the 16-second video, originally posted by reporter Andrew Feinberg, Trump says:", "\"That's why they're talking about the, that's why they talk about the 25th Amendment, right? Three weeks. Three weeks in, Joe's shot, 'Let's go Kamala, you ready?' Most liberal person in the Senate. She makes Bernie Sanders look like a serious conservative.\"", "Similar claims and condemnations of Trump were posted by several other social media users, primarily online activists or journalists critical of the president. The websites Tehran Times, Second Nexus, Hill Reporter, and Political Flare also posted articles that either claimed Trump had incited Biden's assassination or uncritically presented such allegations.", "Those claims were false. Tweets and articles accusing Trump of calling for Biden's assassination grossly misrepresented the meaning of his remarks, which is made abundantly clear when they are viewed in their proper context and with the background awareness that the president frequently uses the adjective \"shot\" to describe what he presents as Biden's lack of mental acuity and fitness for office.", "The president has on several occasions in 2020 violated the norms of political campaign rhetoric, including promoting false, inflammatory, and potentially dangerous claims that Biden is a \"pedophile,\" and that he orchestrated the fictional deaths of dozens of U.S. Navy Seals, in order to cover up the supposed fact that the raid that killed Osama bin Laden was phony. However, \"Joe's shot\" was not another one of those instances.", "Trump made the remarks in question during a campaign rally in Lansing, Michigan, on Oct. 27, 2020. The relevant section can be watched below. Early in his speech, he repeated his frequently deployed attack on Biden's fitness for office and mental acuity, saying: \"He came out yesterday and he made a speech, and then they had to rip him off the stage because he lost it because he's gone.\"", "A few minutes later, Trump followed up on his allusion to Biden's mental acuity, adding the favorite Trump campaign talking point that voters should be wary of electing Biden, because his purported lack of fitness for office meant that, if elected, he would quickly be replaced, under the terms of the 25th Amendment, by his vice presidential running mate Sen. Kamala Harris of California:", "Kamala. Do you like Kamala? Do you like her to be your first president? I don't think so. [Crowd boos]. If he gets elected, three weeks into his presidency they'll say \"Kamala, you ready? Let's go.\" [Crowd laughs]. That's why they're talking about the, that's why they talk about the 25th Amendment, right? Three weeks. Three weeks in, Joe's shot, \"Let's go Kamala, you ready?\" Most liberal person in the Senate. She makes Bernie Sanders look like a serious conservative. [Crowd laughs]. This will not be — we can't let it happen — this will not be the first woman president. You're going to have a woman president, this will not be the first woman president.", "A few points can be made about what Trump said, before even getting to his habitual use of the word \"shot\" to describe Biden's mental and physical condition. First, Trump's broader argument is that voters should not choose Biden in part because if he is elected, his purportedly weak mental condition would quickly prompt congressional Democrats to use the 25th Amendment — which governs a hypothetical scenario in which the president is no longer able to \"discharge the powers and duties of his office\" — to replace him with Harris, whom Trump portrays as a left-wing extremist.", "Trump is presenting this as a worst-case scenario, so it makes no sense that he would encourage anyone to violently incapacitate a President Biden in order to bring about a Harris presidency. His reference to the 25th Amendment also means it makes no logical sense to claim Trump is encouraging anyone to assassinate a President Biden, since in that scenario the 25th Amendment wouldn't apply because the president would be dead, not merely incapacitated.", "More important, those who claim that Trump's use of the phrase \"Joe's shot\" is a reference to gun violence either fail to mention or are simply not aware that the president habitually describes Biden as \"shot,\" as a way of attacking his perceived lack of mental acuity or fitness for office, in the same way that a person might describe a car engine that has failed. Instances of that linguistic eccentricity abound, and a fuller list can be found here and here. The following are just a few examples:", "On Aug. 17, 2020, the Trump campaign posted a video to Facebook with the title \"Let's face it, Joe is shot.\" The clip was taken from an interview with Trump on Fox News, in which the president said:", "Joe is shot. Let's face it, Joe is shot. Now maybe people are going to feel sorry for him ... but our country is too important for that. You're dealing with people that are very sharp, you're dealing with world-class chess players in the leaders of these countries...you can't have a guy that's shot, you can't have a guy that doesn't know where he is, you can't have a guy that's afraid to leave his basement because he can't speak any longer.", "In an Oct. 15, 2020, interview with Stuart Varney on Fox Business, Trump explicitly explained that by \"shot\" he meant \"mentally shot\":", "I'll tell you what, people better hope he doesn't win, because if he wins — first of all, he's going to have nothing to do with it because he's shot, he's mentally shot. Everybody knows it. And he's going to have nothing to do with it. It's going to be run by other people who are vicious and smart, and radical Left, and antifa.", "https://youtu.be/lSNlYkrJRK0?t=1524\n\nOn Sep. 19, 2020, Trump spoke at a rally in Fayetteville, North Carolina, and attacked Biden as \"the dumbest of all candidates\" and \"the worst candidate in the history of presidential politics.\" He later added: \"Now he's shot, he's got like half of his head left...he's totally shot, and he ends up getting the nomination. He couldn't get it in prime time. What the hell is going on with the world today?\"", "https://www.youtube.com/watch?v=8j3MMBxe5TM&feature=youtu.be&t=1410\n\nAs far back as June 25, 2020, Trump told voters at a town hall event in Wisconsin:", "\"I don't think Biden's a radical [Leftist], but it doesn't matter because they're just going to do whatever they want to do. They'll take him over, he can't perform, he's not going to be able to perform. He's shot. He's shot. Whether you like it or not, he's shot. The radical Left is going to take him over.\"", "On Oct. 14, he told the conservative television network Newsmax that Biden's \"mind is blown\":", "How can you vote for Joe? Joe is — Joe is shot. I say it openly, he's shot. He's 50 percent, and when he was 100 percent he was a dumb guy. And now he's 50 percent. And he can't put two sentences together...and the [Democratic] party is going to replace him very quickly, because he can't possibly do this job. I know this job very well. I deal with the toughest, sharpest people in the world. Joe Biden has to be in the category, he can't be — his mind is blown.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]