["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A handout making the case for electing Austin City Council members from small-scale districts rather than continuing to elect each one citywide says: \"Geographic representation brings government and people together.\"\n\nWe don’t know how to check that. But our attention was drawn to the next bullet point on the leaflet paid for by Austinites for Geographic Representation: \"Austin is the largest city in the U.S. or Texas with no geographic representation.\"\n\nOnce we sorted out what that means, we wondered if it was so.\n\nAustin’s council consists of the mayor and six members, each one elected citywide. But Austin voters on Nov. 6, 2012, will be offered two plans that would change how council members are elected. One, put on the ballot by the council, would lead to eight members elected from districts with the mayor and two members elected citywide, according to an Aug. 7, 2012, Austin American-Statesman news article, The other proposal, which made the ballot after Austinites for Geographic Representation collected more than 20,000 petition signatures, would result in 10 district-elected representatives with the mayor chosen by citywide vote.\n\nAccording to the story, a district plan must get more than half the vote to pass. If both plans clear that hurdle, the one with the most votes would take effect.\n\nWe asked the group for backup on the leaflet claim, and volunteer Art Olbert told us that he earlier checked how city councils are elected in the bigger cities by looking up each city government online. At our request, Olbert replicated his work by starting from a U.S. Census breakdown of the nation’s most populous cities showing that as of July 2011, Austin ranked 13th, with 820,611 residents. Olbert shortly sent us his chart indicating that in the cities bigger than Austin, including three Texas cities, at least some council members are elected from geographic districts.\n\nWe confirmed that analysis by visiting his cited sites or similar ones.\n\nUpshot: The larger-than-Austin U.S. cities of New York, Los Angeles, Chicago, Houston, Philadelphia, Phoenix, San Antonio, San Diego, Dallas, San Jose, Jacksonville and Indianapolis all elect all or some council members from districts. (In Texas, too, Fort Worth and El Paso elect council members from single-member districts.)\n\nEight of the other cities elect council members solely from districts, while the other cities -- Houston, Philadelphia, Jacksonville and Indianapolis -- elect most members from districts, choosing a few at large. Our detailed counts are posted here.\n\nOur ruling\n\nEach of the dozen U.S. cities bigger than Austin has a city council with members elected from geographic districts -- and eight solely elect members from districts. This claim rates True.", "News article, \"2 City Council district plans headed to November ballot,\" Austin American-Statesman, Aug. 7, 2012\n\nPress release, \"Texas Dominates List of Fastest-Growing Large Cities Since 2010 Census, Census Bureau Reports,\" U.S. Census Bureau, June 28, 2012\n\nWebsites, \"About the (New York) City Council,\" \" (Chicago)City Council, Your Ward & Alderman,\" \"Houston City Council,\" \"About (Philadelphia) City Council,\" \"About the Phoenix City Council,\" \"The (San Antonio) City Organization, How it Works,\" \"Adopted (Dallas City) Council Redistricting Map,\" \"Jacksonville City Council,\" \"Indianapolis City-County Council\" (accessed Aug. 14, 2012)\n\nReport, \"Your Government at a Glance, Facts About the City of Los Angeles,\" compiled by Frank T. Martinez, city clerk, 2006 (accessed Aug. 14, 2012)\n\nCity charters, San Diego, \"Article II, Nominations and Elections;\" San Jose, \"City Charter\" (accessed Aug. 14, 2012)\n\nDocument, PolitiFact Texas, \"City Council Composition in U.S. Cities Larger Than Austin,\" August 14, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]