["A few days ago, Bollywood actor Aamir Khan met Emine Erdoğan, wife of Turkish President Recep Tayyip Erdoğan. On August 15, the First Lady had tweeted pictures of their meeting following which Khan received widespread backlash on social media with several demanding a boycott of the actor’s upcoming films. Turkey’s criticism of abrogation of Article 370 and support to Pakistan on the Kashmir issue sparked the outrage against the actor.", "In the backdrop of this, a picture of Khan standing with two people started going viral on social media platforms. The caption written above the photo claimed that he had met Lashkar-e-Taiba (LeT) terrorists, Junaid Samshed and Maulana Tariq. According to the caption, both of them had met with him during his visit to Mecca. Apart from this, a picture of Khan with Pakistani cricketer Shahid Afridi was also shared. One Twitter user dubbed him ‘anti-India’ while sharing these photos. (archived link to the tweet)", "Have you ever questioned your brother Aamir Khan as to WHY he meets people who are ANTI- INDIANS…", "Don’t always play your VICTIM CARD… pic.twitter.com/x3QNTwxgYy", "— Subba Rao🇮🇳🇮🇳 (@yessirtns) August 17, 2020", "The photos were shared widely on Twitter with claims of Khan’s supposed terrorist connections.", "This slideshow requires JavaScript.", "Alt News received several requests to investigate the origins of this image on our Android app and WhatsApp number (+ 917600011160).", "This slideshow requires JavaScript.", "We found that the claims of Aamir Khan meeting with members of terror outfit LeT to be completely baseless. When we ran a reverse image search of the photo in question and found that it had originally been posted on March 14, 2013, by Junaid Jamshed on his official Twitter account. Jamshed was a Pakistani singer who passed away in a plane crash in 2016. The caption accompanying the viral photo incorrectly spelt his name as Junaid ‘Samshed’.", "With @Aamir_Khan and Maulana Tariq Jameel Sahab accompanied by Afridi. pic.twitter.com/SyipeQZBoq", "— Junaid Jamshed (@JunaidJamshedPK) March 14, 2013", "In his tweet, Jamshed revealed that he was in one of the pictures alongside Khan and Maulana Tariq Jamil. In the other, the actor can be seen with cricketer Shahid Afridi. Using this information we were able to deduce that the man standing to the right of Khan is Maulana Tariq Jamil. He is an Islamic preacher and scholar and is also a member of the Tablighi Jamaat. It is important to note that Maulana Tariq’s sermons are heard in many countries including Pakistan. Apart from this, we did not find any media reports that mentioned the Maulana had any kind of involvement with Lashkar-e-Taiba.", "In a video dated November 23, 2013, Maulana Tariq spoke about his meeting with Aamir Khan.", "Khan was also photographed with Pakistani cricketer Shahid Afridi during his visit to Mecca. On October 23, 2012, NDTV Sports reported that Khan had met the sportsman during his Hajj pilgrimage. In this report, his meeting with Maulana Tariq Jamil has also been mentioned. A photo of the actor with Shahid Afridi was also published in a photostory done by Outlook India from October 23, 2012.", "Therefore, photos from Aamir Khan’s October 2012 Hajj trip are being falsely circulated on social media as proof of his meetings with terrorists. The men standing beside him in the first photo include a now-deceased Pakistani singer and an Islamic preacher and scholar named Maulana Tariq Jamil.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]