["For years, members of Congress have pressured drug companies and pharmacy benefit managers to bring under control the rising costs of insulin and epinephrine for millions of Americans with diabetes or allergies.", "In July 2020, President Donald Trump signed four executive orders aimed at reining in prescription drug costs. One required that federally qualified health centers, which purchase insulin and epinephrine through what's called the 340B drug program, pass along any savings they receive from discounted drug prices to medically underserved patients.", "The rule blocks health centers from receiving future federal grants unless they charge patients no more than their acquisition price for insulin and EpiPens — epinephrine auto-injectors — plus a small administration fee.", "At the time, the U.S. Department of Health and Human Services said the move would increase access to insulin and EpiPens for the 28 million patients who visit community health centers annually, over 6 million of whom are uninsured.", "On the campaign trail last year, Trump made repeated claims that, because of the executive orders, he was succeeding in his promise to lower drug prices.", "HHS approved the rule affecting community health centers in December, and it was to go into effect Jan. 22.", "A user on Facebook claims President Joe Biden is now \"reversing\" Trump's executive order. “This is NOT a partisan issue and will harm Americans,” reads the Jan. 22 post, which has almost 1,000 shares.", "Another social media user claimed Biden has ended \"the savings for epi pens and insulin.\"", "USA TODAY reached out to the social media user for comment.", "More:Fact check: No basis for claims that President Joe Biden's inauguration was faked", "Biden's White House chief of staff, Ronald Klain, announced a regulatory freeze of “any new and pending rules” as Biden took office on Jan. 20. The freeze on the insulin and epinephrine rule is effective until March 22.", "According to Bloomberg Law, \"A regulatory pause is a common tradition among incoming presidents to ensure that the unfinished policies from the prior administration align with the new one.\"", "The National Association of Community Health Centers, among others, expressed support for the new administration's move, saying the Trump rule would not have lowered the cost of insulin and EpiPens for most Americans who use them, as advertised.", "In a Jan. 25 statement, it also said the Trump rule reflected \"a fundamental misunderstanding\" of federally qualified health centers and the 340B drug program, placing extensive administrative burdens on them.", "“The stated aim was to cut drug prices. However, it triggered alarm among safety net providers and bipartisan lawmakers because it would accomplish the opposite of what the Trump Administration intended — ultimately making it harder for health centers to provide affordable life-saving services and prescription drugs — especially during the pandemic,” the association said.", "It pointed out that the only patients affected would be those using the health centers.", "The overall prices of insulin and EpiPens across the country are not affected by the Trump administration regulation or the recent action by the Biden administration, the health center association said.", "Community health centers serve one in 11 Americans across the country, according to the U.S. Health Resources & Services Administration.", "More:Here are all the executive orders President Joe Biden has signed so far", "Nationally, 30 million Americans suffer from diabetes, according to the American Diabetes Association. And nearly one in 50 Americans are at risk for anaphylaxis brought on by certain foods, insect bites, medications and latex, according to a 2013 study by the Asthma and Allergy Foundation of America.", "But not all of those patients require insulin or epinephrine. And most who live in extreme poverty, or less than 200% of the federal poverty level — an equation that works out to $34,840 for a family of two — already receive free or discounted prescription drugs, a national health policy expert said.", "Karyn Schwartz, a senior fellow at the Kaiser Family Foundation, a nonpartisan nonprofit that analyzes health policy, said some patients served by the 1,400 federally backed health centers nationally, such as those with high deductibles or those who are uninsured and paying list prices for the drugs, would have benefitted from the new pricing rule.", "But it's hard to say how many, she said. It's also difficult to speculate about how many new patients would switch care to a community health center to take advantage of the discounted insulin and EpiPen prices, she said.", "In addition, Sayeh Nikpay, associate professor of health policy and management at the University of Minnesota School of Public Health, told PolitiFact that while freezing the Trump rule might make some patients who get insulin or epinephrine from health center worse off, it risked reducing services for wider swath of needy patients if it resulted in cutting access to the 340B program by the centers, which use its revenues to subsidize their programs.", "U.S. Rep. Cindy Axne, D-Iowa, who opposed the Trump administration rule, said in a news release that “by targeting the centers providing these medications to those without insurance or the means to get the care instead of big pharmaceutical companies, HHS risks making things worse for a community already in need. Community Health Centers provide critical lifelines in our communities. They aren’t the reason why drug costs, especially insulin costs, are too high in this country.”", "We rate this claim about the Biden administration's action to be MISSING CONTEXT, based on our research. Some patients who use insulin and EpiPens — the fraction who are served by federally qualified health centers — may benefit from Trump's order, but others could suffer if it results in decreased access for the centers to the 340B drug discount program. Also, the freeze through March 22 does not represent final action on the program, so it's premature to call it a \"reversal.\"", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]