["“The medical industry literally gives nothing away for free, except flu shots,” begins a November 1, 2020 Facebook post.", "“They want y’all to be injected so bad they entice you with grocery store gift cards. Doesn’t that seem odd to you?” asks the post which was reshared with testimonials questioning the flu vaccine.", "Nearly identical posts were liked and shared thousands of times since October 27 on Instagram and on Facebook in Canada and the US.", "But drug companies do not give away flu shots -- despite the vaccinations being marketed that way by many local governments and pharmacies.", "In 2019, Sanofi Pasteur, one of several companies approved to make flu shots for Canada and the US, reported its influenza vaccines sales were up 17.1 percent to €596 million (currently $704 million) in the fourth quarter. GlaxoSmithKline reported £541 million (currently $712 million) in 2019 earnings on its Fluarix/FluLaval vaccines worldwide.", "Aparna Soni, a health economist and assistant professor at American University, said governments often intervene to ensure vaccines remain affordable because they produce positive externalities, or benefits to people beyond the individual who receives the shot.", "“Without government intervention, the private market will not produce the socially desired amount of vaccines and society will not be able to experience the benefits that come with community immunity,” she explained by email.", "Kimberley Geissler, assistant professor of health policy and management at the University of Massachusetts Amherst, agreed.", "“This positive benefit of vaccinations is a classic economic argument for government intervention, including through eliminating cost-sharing for vaccinations to encourage uptake,” she said by email.", "Health experts also told AFP that the flu vaccine, which is a regular target of misinformation, is even more important during the Covid-19 pandemic to help prevent already busy health care facilities from becoming overwhelmed.", "In Canada, the universal health-care system is paid for through taxes and is administered by ministries of health in provinces and territories.", "In Ontario, for example, Premier Doug Ford announced that the province would invest $70 million to administer 5.1 million doses of flu vaccine for the 2020-21 season.", "Canada's National Advisory Committee on Immunization recommends that nearly everyone six months of age and older get a yearly influenza vaccination. It is publicly funded universally in most provinces and territories.", "British Columbia is one exception, funding the vaccination only for people at high risk of serious illness from influenza, including children under five and seniors over the age of 65, among others.", "Quebec also limits free vaccination to children and adults with some chronic diseases, pregnant women and seniors over the age of 75. During the pandemic, the flu shot will also be free to all children aged 6-23 months and healthy adults who are 60-74 years old.", "The Affordable Care Act, passed when Barack Obama was president, mandated that the flu shot be covered by insurance companies without charging the patient at point-of-service. However, private insurers do recoup that cost through the monthly premiums they charge patients and employers.", "Ge Bai, associate professor of health policy and management at Johns Hopkins Bloomberg School of Public Health, said in an email, “On the private market, the negotiated price between a given insurance company and a given provider might differ substantially from the negotiated price between another insurance company and the same provider.”", "A 2017 analysis by the non-profit Kaiser Family Foundation found that insurers paid between $28 and $80 for the flu vaccine.", "About 92 percent of Americans have either private insurance or taxpayer funded Medicare or Medicaid, but Bai pointed out that “uninsured patients cannot get the vaccine without paying for it, unless through a free clinic.”", "Find more AFP Fact Check articles on the flu vaccine in English here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]