["By Angelo Fichera", "Posted on October 8, 2020", "A viral image on social media is spreading a fabricated quote attributed to President Donald Trump. There’s no evidence the president ever said that doctors have “never seen a body kill the Coronavirus like my body,” and that they “tested my DNA and it wasn’t DNA. It was USA.”", "President Donald Trump has touted what he deems a quick recovery from COVID-19 days after he publicly announced that he was diagnosed with the disease.", "But a viral image repeatedly shared by tens of thousands, in posts across social media platforms, falsely claims the president said: “The doctors said they’ve never seen a body kill the Coronavirus like my body.”", "“They tested my DNA and it wasn’t DNA,” the bogus quote continues. “It was USA.”", "There’s no evidence he ever said that.", "The image was shared in a tweet Oct. 6 — which was retweeted more than 100,000 times — in which the user wrote, “this man literally just said he was built different.” It spread widely on Facebook, too — where one popular post claimed, “Trump really said” it — as well as on Instagram.", "Some commenters wrote that they took the image to be an obvious joke.", "The quote is formatted to appear as closed-captioning text for a video address that Trump recorded while in Walter Reed National Military Medical Center and shared in an Oct. 3 tweet.", "A review of that four-minute video shows he never made the statement falsely attribute to him.", "Joel Luther, an associate in research at the Duke Reporters’ Lab, found that the image was part of a set that was posted on Reddit on Oct. 6. It appeared in forums dedicated to memes and political humor.", "A subsequent meme in the set fictitiously quotes Trump as saying, “They said if Joe Biden had this virus his body would’ve died several times by now.”", "As we’ve previously explained, Trump did make exaggerated statements in that Oct. 3 video, including about the treatments he received for COVID-19, which he likened to “miracles.”", "But he didn’t say the quote being widely shared on social media.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Luther, Joel. Associate in research, Duke Reporters’ Lab. Email. 7 Oct 2020.", "McDonald, Jessica, et. al. “Trump’s COVID-19 Misinformation Since Testing Positive.” FactCheck.org. 6 Oct 2020.", "Trump, Donald (@realDonaldTrump). Video tweet. Twitter. 3 Oct 2020.", "Trump, Donald (@realDonaldTrump). “A MESSAGE FROM THE PRESIDENT!” Twitter. 7 Oct 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]