["About this rating", "Though scientist Carl Sagan died in 1996, his work remained highly influential. One quote in particular attributed to Sagan regularly showed up on share-centric social media sites: \"If it can be destroyed by the truth, it deserves to be destroyed by the truth.\"", "So popular is the phrase that it has appeared as a print available for purchase:", "However, we were unable to find any versions of the quote published until mid-2013, long after Sagan's death.", "A frequently cited source for the attribution was the social literature site GoodReads, but we couldn't find the quote in any of his books. Another prominent placement of the phrase involved Sagan's Wikiquote page, under the \"misattributed\" section, which observed that the quote was built on a similar phrase in fantasy author P.C. Hodgell's novel Seeker's Mask:", "That which can be destroyed by the truth, should be.", "Hodgell commented on a Reddit page in February 2016, confirming that the quote appeared in her novel, but that she didn't get it from Sagan:", "Hodgell here. \"That which can be destroyed by the truth should be\" appears in my 1994 novel Seeker's Mask. I first heard of the Sagan quote in 2013, more or less. No source that I've seen dates the latter. If it's not a case of misattribution, it's probably a matter of \"great minds\" etc.", "As Hodgell indicated, the quote didn't appear to exist in the Sagan-attributed form until mid-2013. (Hodgell's novel appeared in 1994.) The likeliest trajectory is one of the most common for misattributed quotes: the phrase was dormant for nearly two decades, and then reached socially viral status only when a slightly rewritten version was incorrectly attached to a beloved science celebrity.", "However, Sagan really did write the following on the topic of truth:", "One of the saddest lessons of history is this: If we’ve been bamboozled long enough, we tend to reject any evidence of the bamboozle. We’re no longer interested in finding out the truth. The bamboozle has captured us. It’s simply too painful to acknowledge, even to ourselves, that we’ve been taken. Once you give a charlatan power over you, you almost never get it back.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]