["By Robert Farley", "Posted on September 1, 2017", "In lifting the Obama-era restrictions on police acquisition of surplus military equipment, Attorney General Jeff Sessions misleadingly cited studies to claim that President Obama “went too far” and undermined public safety.", "Sessions said the studies showed that surplus military equipment provided to local police departments “reduces crime rates” and “reduces the number of assaults against police officers.”", "They did say that, but authors of those studies said most if not all of that benefit derives from equipment that is unaffected by the restrictions imposed by Obama.", "Amid rising concern about the “militarization” of police departments, President Obama in 2015 ordered the review of the 1033 program, which has for decades provided surplus military equipment and supplies to state and local law enforcement agencies for free.", "In May 2015, a working group created by Obama’s order made a series of recommendations that were adopted by the administration. The group created a “prohibited equipment list,” a list of items that could no longer be given to police departments because there is “substantial risk of misusing or overusing these items, which are seen as militaristic in nature.” Among the items on this banned list:", "But the vast majority of surplus military gear provided to local law enforcement agencies was unrestricted, according to authors of the studies cited by Sessions. That includes items like computers, furniture and protective gear, but also most military vehicles and weapons less than .50 caliber.", "In remarks at a conference of the National Fraternal Order of Police on Aug. 28, Sessions said the Obama restrictions “put superficial concerns above public safety.” The same day, President Donald Trump issued an executive order rescinding Obama’s order.", "Sessions justified the move by citing two studies he said showed the surplus military equipment provided to police departments “reduces crime rates, reduces the number of assaults against police officers, and reduces the number of complaints against police officers.”", "Sessions, Aug. 28: Studies have shown this equipment reduces crime rates, reduces the number of assaults against police officers, and reduces the number of complaints against police officers. Those [Obama] restrictions went too far. We will not put superficial concerns above public safety.", "The Justice Department press office said Sessions was referring to two studies recently published in American Economic Journal: “Police Officer on the Frontline or a Soldier? The Effect of Police Militarization on Crime” and “Peacekeeping Force: Effects of Providing Tactical Equipment to Local Law Enforcement.”", "Both studies concluded that surplus military equipment provided to police departments helped to reduce crime, though they reached conflicting conclusions about whether it reduces assaults against police officers.", "But those studies looked at a time period before the Obama order was enacted. They do not directly address the impact of the Obama-era restrictions on public safety.", "And, since Obama did not entirely do away with the 1033 program, we don’t know how much — if any — of the banned or restricted surplus equipment helped to reduce crime, or how much of the reduction in crime was attributable to other surplus equipment that was unaffected by the Obama order.", "The study “Peacekeeping Force: Effects of Providing Tactical Equipment to Local Law Enforcement” by University of Tennessee economics professor Matthew C. Harris — as well as Jinseong Park, Donald J. Bruce and Matthew N. Murray — speaks to the entirety of the 1033 program when it concludes that tactical military equipment provided to police departments has “generally positive effects: reduced citizen complaints, reduced assaults on officers, increased drug crime arrests, and no increases in offender deaths.”", "The other narrative centers around the necessity of these armaments as an input to the production of public safety from the modern, dangerous, well-armed violent or drug criminal. While this paper does not directly address need per se, we do find that the tactical items issued through the 1033 Program reduce assaults on and deaths of police officers, assist in drug interdiction, and may have deterrent effects on crime.", "In a phone interview, co-author Harris told us the results don’t necessarily mean the 1033 program is good policy, and the study does not speak to the Obama restrictions rescinded by Trump.", "The study cautions that: “It is entirely possible that in certain jurisdictions these armaments may or may not be necessary, have not increased the efficacy of drug interdiction, or have led directly to increased violence by police against civilians. In other words, our findings do not necessarily mean that saturating our local law enforcement agencies with military hardware is good policy.”", "The authors of the study also say it would be a mistake to conclude that the positive impacts of military equipment found in their analysis are in any way hampered by the items restricted by Obama.", "“Those specifically prohibited items are a very small percentage of the overall gear we were looking at in our report,” said Donald Bruce, one of the co-authors of the “Peacekeeping Force” study. “You can’t get anything out of our report that gets to the prohibited class of items. It was not intended to analyze those limitations.”", "The authors broke down the effectiveness of various categories of equipment provided to police departments. Specifically, the authors found, for example, that “weapons” provided to police departments led to a small decrease in crime and an increase in arrest rates. But while there are some items in the “weapons” category that are banned by Obama’s order, the overwhelming majority are not, Bruce said.", "For example, he said, only four counties in the nation received grenade launchers in 2015. In 2010, it was 10.", "“These are very small numbers compared to the rest of the category,” Bruce told us. “It is unlikely that the prohibited items are driving our results.”", "The other study, “Police Officer on the Frontline or a Soldier? The Effect of Police Militarization on Crime,” co-authored by Vincenzo Bove and Evelina Gavrilova, provides even less support for Sessions’ claim. While it, too, concluded that military aid reduces street-level crime and is cost-effective, almost all of that benefit was found to come from military equipment unaffected by the Obama order.", "Unlike the Harris et al. study, the one by Bove and Gavrilova found no conclusive results about the effect of “weapons” on crime rates. There was some decrease in crime attributed to “vehicles” donated to police, but the strongest decrease in crime, they found, came from an “other” category — a catch-all hodgepodge that includes everything from software to furniture, electric wire and scaffolding. “Nonlethal equipment, without military attributes, has the biggest marginal effect on the reduction of crime,” the study says. That kind of equipment was wholly unaffected by Obama’s order.", "“Our own speculation is that by getting the diverse items from the ‘others’ category law enforcement agencies re-allocate the funds that they were supposed to spend to other necessities, and this somehow allows them to spend for e.g. less time on typing out reports because of faster computers and more time on e.g. patrol,” Gavrilova told us via email.", "Gavrilova told us the vast majority of the equipment provided to police departments was not banned by the Obama order. And so, she said, the decreases in crime rates detected in the study “are not due to the Obama restricted items.”", "The study found a modest reduction in crime. “By the most conservative estimate, a 10 percent increase in aid reduces total crime by 5.9 crimes per 100,000 population,” it said. The impact was “relatively small” at just 0.24 percent of the crime rates on average. But “the annual average value of aid acquired by a county is around $58,000, suggesting that this is a very inexpensive crime-reducing tool.”", "According to the New York Times, Pentagon officials said the Obama order led to the return of 126 tracked armored vehicles, 138 grenade launchers and 1,623 bayonets. The studies cited by Sessions do not indicate how the denial of those particular items could potentially affect crime rates, assaults against police officers or complaints about police.", "Some legislators upset by the Trump reversal, such as Republican Sen. Rand Paul, question how making those items available again to local police departments makes communities safer.", "During a September 2014 Senate hearing on the distribution of Department of Defense weapons and equipment to state and local police forces, Paul asked Alan Estevez, principal deputy undersecretary of defense for acquisition, technology and logistics, what purpose bayonets were given out for. “I can’t answer what a local police force would need a bayonet for,” Estevez answered. Paul retorted, “I can give you an answer: None.” According to the New York Times, “Trump administration officials said that the police believed bayonets were handy, for instance, in cutting seatbelts in an emergency.”", "Another study recently published in Peace Economics, Peace Science and Public Policy, “The Risks of Operational Militarization: Increased Conflict Against Militarized Police,” suggests there may also be some evidence of negative effects of the 1033 program. It found that the provision of things like surveillance, sonar and radar equipment led to an increase of assaults against police officers, though the authors could not be sure why.", "“I think what the research tells us right now is this: The 1033 Program does have its benefits — clothing and armor are reducing assaults against police, and perhaps are signaling a deterrence mechanism of a professional, army-based police department that is ready to take on crime,” one of the co-authors of the study, Kevin Carriere, of Georgetown University, told us via email. “However, the impact of the purchases that Obama sought to ban in 2015 — military grade weapons, tanks, explosives, and the like – do not have a significant impact such that Sessions’ notes — confirmed by Bove & Gavrilova and Carriere & Encinosa, but disputed by Harris et al.”", "Harris, co-author of the study cited earlier, told us more study and greater transparency — particularly about negative outcomes that police departments may be reluctant to share — are needed to fully understand the consequences of the program.", "Bove and Gavrilova also conclude in their study that the 1033 program in aggregate may have some crime-reduction benefits, but they stop short of asserting that this proves its overall benefit.", "“[T]aken together, our results do not directly provide evidence in favor of or against the possibility that military equipment contributes to overly aggressive approaches by police units, which can in turn escalate to a standoff between urban communities and the officers that police them,” the authors conclude. “This is a social cost that our analysis cannot duly capture and it is an important point for future research.”", "Those are also matters for political debate. On the question of whether surplus military equipment “reduces crime rates,” studies suggest the program overall does. But those studies do not prove — as Sessions implied — that the Obama restrictions on the transfer of some of that equipment would therefore jeopardize public safety.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]