["By Eugene Kiely", "Posted on April 10, 2018", "President Donald Trump repeatedly has claimed that Sayfullo Saipov — the Uzbekistan national who was arrested for a deadly terrorist attack in New York City last year — brought 22 people with him into the United States through “chain migration.” There’s no evidence of that, and it’s likely not even possible.", "Princeton University professor Marta Tienda, a demographer who has studied so-called chain migration, called Trump’s 22 figure “an implausible exaggeration given the current visa system.”", "Trump made his latest remarks about Saipov during an April 5 visit to West Virginia. Eight people were killed when Saipov allegedly drove his truck into a crowd of pedestrians, bicyclists and joggers along the Hudson River in New York City on Oct. 31, 2017, according to an indictment handed down against him.", "Trump, April 5: And chain migration — think of that. So you come in, and now you can bring your family, and then you can bring your mother and your father. You can bring your grandmother. You can bring your this; you can bring — we had somebody on the West Side Highway, which I know very well — in Manhattan — he ran over — I think he killed about eight people. … That was months ago. And came in through chain migration. Or he might have also come in through a lottery. But he brought a lot of people with him. They say 22 people. Twenty-two people.", "At the Conservative Political Action Conference on Feb. 23, Trump made a similar statement about Saipov. “They say 22 people came in with him. In other words, an aunt, an uncle, a grandfather, a mother, a father, whoever came in. But a lot of people came in. That’s chain migration,” Trump said.", "Who told the president that Saipov brought 22 people with him? We don’t know; the White House did not respond to our emails inquiring about it.", "But what we do know suggests that it is not conceivable that Saipov could have sponsored 22 family members.", "Saipov arrived in the United States through the Diversity Immigrant Visa Program in 2010, according to the Department of Homeland Security.", "“DHS can confirm that the individual identified in the New York City terror attack was admitted to the U.S. upon presentation of a passport with a valid diversity immigrant visa to U.S. Customs and Border Protection in 2010,” Homeland Security spokesman Tyler Q. Houlton said in a Nov. 1, 2017, statement that the department emailed to us for this story.", "The department declined further comment. Although Trump claims that Saipov brought in 22 family members, the department cited privacy laws in refusing to say how many of Saipov’s family members immigrated to the U.S. and how many of those — if any — Saipov sponsored.", "Upon entering the U.S., a diversity visa holder may be eligible to bring certain family members to the U.S. The State Department’s Foreign Affairs Manual says that a person who enters the country on a diversity visa may bring his or her spouse and children — known as “derivative beneficiaries” — if they also meet the program’s qualifications.", "But there is no indication that this happened in Saipov’s case.", "Saipov did not marry until April 2013 — three years after he entered the United States in March 2010. Saipov, then 25 years old, married Nozima Odilova, 19, in Summit County, Ohio, on April 12, 2013, according to the couple’s marriage certificate. It was the first marriage for both, the record shows.", "Once he entered the U.S. through the diversity visa program, Saipov received a so-called green card and became a legal permanent resident. Saipov was a legal permanent resident at the time of the deadly truck attack, according to John Miller, a deputy commissioner for intelligence and counter-terrorism for the New York Police Department.", "At a Nov. 1, 2017, press conference, Miller described Saipov as “a 29-year-old legal permanent resident of the United States who came into the country from Uzbekistan in March of 2010.”", "Once in the United States, green-card holders “may petition for certain family members to immigrate to the United States as permanent residents,” according to the U.S. Citizenship and Immigration Services. But those “certain family members” include only a spouse and children — contrary to Trump’s suggestion that Saipov brought in with him aunts, uncles and others.", "Saipov’s wife, Nozima, is also from Uzbekistan, but as we said the couple got married in Ohio after they both entered the U.S.", "At most, Saipov would have been eligible to bring in with him no more than a few people upon arriving in the U.S. or after arriving here.", "Despite this fact, Trump claimed — without evidence — that Saipov brought in relatives he would not have been able to sponsor at numbers that are improbably high.", "In a peer-reviewed paper on chain migration published in the Population Research and Policy Review in July 2013, Tienda and her Princeton colleague, Stacie Carr, found every 100 immigrants admitted to the U.S. between 1996 and 2000 sponsored an average of 345 family members – or 3.45 family members per admitted immigrant.", "We asked Tienda about Trump’s claim that Saipov “brought a lot of people with him. They say 22 people.”", "“You won’t find any evidence to support Trump’s claim — which is an implausible exaggeration given the current visa system, which includes country limits and unlimited visas ONLY for immediate family members (spouses, dependent children and parents of CITIZENS),” Tienda told us in an email, emphasizing the word “citizens.”", "Tienda, who teaches demographic studies, said sponsorship is easier for citizens to encourage naturalization. But, as we said, Saipov was not a U.S. citizen at the time of the attack.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]