["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A hoaxster tweeted that White House staff created a gorilla channel for President Donald Trump. (Traveltipy via Flickr Creative Commons)", "With off-the-charts anticipation over the release of a tell-all book about President Donald Trump, the Twittersphere was primed for a classic hoax. The Twitter account @pixelatedboat delivered.", "\"Wow, this extract from Wolff’s book is a shocking insight into Trump’s mind,\" the prankster said Jan. 4, adding what looked like a picture of a section of the book.", "\"On his first night in the White House, President Trump complained that the TV in his bedroom was broken, because it didn’t have ‘the gorilla channel’,\" the faux excerpt began. \"To appease Trump, White House staff compiled a number of gorilla documentaries into a makeshift gorilla channel, broadcast into Trump’s bedroom from a hastily-constructed transmission tower on the South Lawn.\"", "Wow, this extract from Wolff’s book is a shocking insight into Trump’s mind: pic.twitter.com/1ZecclggSa", "Not content with that absurdity, the excerpt continued with a quote from an unnamed insider saying Trump \"kneels in front of the TV, with his face about four inches from the screen and says encouraging things to the gorillas.\"", "But it’s not true. To be sure, we ran a search on a Kindle copy of Fire and Fury: Inside the Trump White House, by Michael Wolff.", "There was not one mention of a gorilla.", "But plenty of people believed the tweet, which got over 51,000 likes and was retweeted over 16,000 times.", "One person tweeted, \"I did not realize it was a joke until I read the comments!! We're so far down the rabbit hole, this seemed completely believable. What's happening to us????\"", "Another said \"I read pretty far in before I realized ...\"", "Prolific twitterer Eric Garland with over 170,000 followers confessed \"I got totally punked on the Gorilla Channel thing.\"", "About six hours after the tweet went up, the author changed his display name to \"the gorilla channel thing is a joke.\" And he wrote, \"Wonder if this new display name will help. Probably not.\"", "Come on. A phony gorilla channel for President Trump hacked together by his staff to distract him?", "Do we need to say more than Pants on Fire?", "Pixelatedboat, tweet, Jan. 4, 2018", "Michael Wolff, Fire and Fury: Inside the Trump White House, 2018", "Politico, Internet falls for Trump-'Gorilla Channel' parody, Jan. 5, 2018", "Photo: Paul Vladuchick, via Flickr Creative Commons", "Photo: Traveltipy, via Flickr Creative Commons", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]