["About this rating", "CNN posted a year-over-year ratings drop during the second week of May 2018, prompting celebratory notices on right-leaning web sites such as Breitbart, Daily Caller, and others on which the network is routinely cast as unreliable and a purveyor of anti-Trump propaganda.", "The reports were based on statistics published in Adweek showing CNN's total-day viewership for the week of 7 May 2018 as down 29 percent from the same period in 2017, but at least one partisan site with a well-documented bent for blending fact and fiction, Your News Wire, parlayed the numbers into the exaggerated claim that the network would soon be closing its doors because of \"collapsing\" ratings:", "CNN is on the verge of permanently closing its doors after its ratings collapsed even more than last week, falling a staggering 30 percent in the second week of May.", "While Fox News increased its total viewers by a healthy 6 percent and MSNBC held steady, CNN’s viewership took a nosedive, signalling that the failing news network may be about to come to an abrupt end.", "Breitbart.com reports: While no one in the media want to talk about it, CNN’s relentless fake news sprees have not only created a massive credibility problem for the hate network, the far-left cable channel’s ratings crisis is even more severe.", "Due to the network's critical reporting on the actions of his administration, President Trump has frequently singled out CNN as one of the worst offenders in what he calls the \"fake news media.\" The practice has also been taken up by web sites such as Your News Wire and Breitbart, both of which have rushed to attribute CNN's falling ratings to a \"massive credibility problem.\" However, a recent poll conducted by Monmouth University found that despite a general consensus that even traditional media outlets engage in some so-called \"fake news\" reporting, roughly half of Americans say they still trust CNN more than Trump as an information source. (Adweek's reporting did not speculate on the putative causes of CNN's ratings blip.)", "In any case, despite its year-over-year decline, CNN remained the seventh most-watched cable network in (terms of total-day viewership) for the week in question, and the eleventh most-watched in prime time. While that may be temporarily troublesome in terms of getting top dollar for advertising, it's wishful thinking on the part of CNN's detractors to interpret it as spelling doom for the network, which has weathered innumerable ups and downs in the television rating wars over the 38 years of its existence. Despite being down in prime time viewership during the first three months of 2018, for example, CNN posted its second-best first-quarter ratings in 10 years.", "We note, finally, that CNN executives have announced no plans to shutter or shrink the network because of a \"ratings collapse,\" or for any other reason.", "Our request for comment from CNN's communications team has thus far gone unanswered.", "Adl-Tabatabai, Sean.  \"CNN to Permanently Close Its Doors as Ratings Plunge 30 Percent.\"\r\n  Your News Wire.  18 May 2018.", "Caruso, Justin.  \"Complete Meltdown — CNN Loses 30 Percent of Viewers SInce Last Year While Fox New Increased Viewers.\"\r\n   The Daily Caller.   16 May 2018.", "Katz, A.J.   \"The Big Three Finish Among Top 10 in Total Day; Fox News Is No. 1 and Posts Year-Over-Year Growth.\"\r\n    Adweek.   15 May 2018.", "Katz, A.J.   \"Q1 2018 Ratings: CNN Finishes Third in Prime Time, but Posts Second-Best Q1 This Decade.\"\r\n  Adweek.  3 April 2018.", "Nolte, John.  \"Ratings Crisis: CNN Suffers Viewership Collapse of Nearly 30 Percent.\"\r\n  Breitbart.  16 May 2018.", "Monmouth University.  \"Trump Less Trusted Than CNN, MSNBC, and Fox as Info Source.\"\r\n  2 April 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]