["Buttigieg compared an estimated 10-year revenue gap in Bernie Sanders’ plans with the current U.S. GDP.", "Compared with the economy over a 10-year period, the results are reversed, with the national economy dwarfing the revenue gap.", "Sen. Bernie Sanders, I-Vt., leading in the polls heading into the Nevada Democratic caucuses, faced more than a few attacks from his rivals on the debate stage in Nevada. Former South Bend, Ind., Mayor Pete Buttigieg aimed one at the fiscal realities of Sanders’ many plans.", "\"If you add up all his policies all together, they come to $50 trillion,\" Buttigieg said. \"He's only explained $25 trillion worth of revenue, which means that the hole in there is bigger than the size of the entire economy of the United States.\"", "Estimating the future costs of huge plans — such as Medicare for All — and the future revenues from new taxes — such as a wealth tax — is fraught with problems. Buttigieg’s campaign sent us the basis for their numbers, and they are reasonable, if still subject to uncertainty and debate.", "Medicare for All is a good example of how estimates can vary. The Urban Institute, a Washington think tank, calculated that under Sanders’ plan, overall health spending would rise by 13%. But a new study from policy researchers at Yale, University of Maryland and University of Florida estimated overall spending would fall by 13%. So, treat all projections with caution.", "But there’s an issue with Buttigieg’s basic comparison of Sanders’ proposals to the U.S. economy. He might have been using a rhetorical flourish to give a sense of scale, but his words muddled the math.", "The flaw is that he used 10-year cost and revenue estimates for the Sanders plans and stacked them against one year of the nation’s GDP.", "The U.S. Bureau of Economic Analysis put the size of the U.S. economy at $21.4 trillion in 2019. Using Buttigieg’s estimate of the revenue gap, his statement is mathematically correct, but it ignores the different time frames.", "For a more apples-to-apples comparison (which would come with a host of other analytic issues), you would look at the cumulative value of the economy as projected by the Congressional Budget Office over the next decade. The CBO’s latest estimate amounts to nearly $300 trillion worth of GDP by 2030.", "In that context, a budget hole of $25 trillion adds up to about 8% of the total.", "Buttigieg said the budget hole in Sanders’ plans \"is bigger than the size of the entire economy of the United States.\"", "Buttigieg has compared proposed spending and revenues over a decade to one year’s worth of GDP. By that measure, the math works.", "If we use a 10-year window across the board, the revenue gap is about 8% of cumulative U.S. GDP.", "Buttigieg may have taken rhetorical license, but that doesn’t change that the statement is partially accurate and leaves out important details. We rate this claim Half True.", "U.S. Bureau of Economic Analysis, Gross domestic product, Jan. 30, 2020", "Congressional Budget Office, 10-year economic projections, Jan. 28, 2020", "Urban Institute, Don’t Confuse Changes in Federal Health Spending with National Health Spending, Oct. 16, 2019", "The Lancet, Improving the prognosis of health care in the USA, Feb. 15, 2020", "Email exchange, Sean Savett, spokesman, Buttigieg for President, Feb. 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]