["The photo depicts what appears to be a massive tooth lodged into what the post describes as a whale vertebra. A part of the text reads: “This is the most badass fossil in existence”.", "A Facebook post from December 9, 2018 has been shared 227 times. Multiple versions of the photo have been shared since 2012, including in a post from 2014 on a page with more than 22,000 followers.", "The megalodon is the largest shark and largest fish that ever lived according to Encyclopaedia Britannica. A Google search shows much speculation still exists around its extinction.", "A photo search of “megalodon stuck in a whale tooth” on Facebook shows the same picture posted as early as December 27, 2013 with the same text as copy.", "A Twitter search of the claim shows a post from July 24, 2012, which appears to be the original post of the image.", "The Reddit post is headlined, “The newest addition to my museum of a house: a megalodon tooth stuck in a vertebrae!”.", "After much speculation on the thread, the original poster, believemeimlying, wrote that his father had told him that the fossils were real but that the tooth was later lodged into the vertebra.", "Vertebrate palaeontologist and palaeobiologist, Dr Julien Benoit of Johannesburg’s University of Witwatersrand, told AFP that the tooth and the vertebra showed different types of preservation.", "“The tooth is blackish and not eroded while the vertebra is brownish and strongly eroded, which strongly suggest (but do not demonstrate) that the two fossils come from different localities and were put together artificially. The dust around the point of insertion of the tooth inside the vertebra is also quite evocative of a forgery.”", "“If a megalodon would have had bitten a whale, the tooth would not have entered the vertebra this way,” Benoit said.", "“All in all, this look very much like a fake news to me. Although some bite marks of Megalodon have been found on fossil whale bones which show that they would have some interactions, but nothing this dramatic has never been officially reported.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]