["A video of Azam Khan asking voters to vote for BJP is currently viral on social media at the backdrop of SP and BSP alliance in Uttar Pradesh. Co-convenor of BJP Delhi IT and social media cell, Praveen Kumar Dixit, was among those who circulated the video with the caption – “बुआ के गोद में बैठने से चचाजान नाराज हुए, आजम खान बोले मोदी को सीधे वोट दो|” It drew combined views (Facebook+Twitter) of nearly 1.5 lakh.", "बुआ के गोद में बैठने से चचाजान नाराज हुए, आजम खान बोले मोदी को सीधे वोट दो pic.twitter.com/GpJeSydJwi", "— प्रवीण कुमार दीक्षित (@IPraveenDixit) January 13, 2019", "In the video, the founding member of SP can be heard saying, “बसपा की हिमायत करोगे? क्या सन्देश दे रहे हो? क्या बताना चाहते हो? ज़लील करना चाहते हो हमारे जैसे लोगों को? (Now you will advocate for BSP? What message are you trying to give? What are you trying to say? Are you trying to insult people like us?)”", "Khan then reminds the Muslim audience how he stood by them during the Babri Masjid demolition and adds, “बसपा को वोट कर रहे हो, तो सीधे बीजेपी को ही वोट कर दो| वो कुछ अच्छा सोचेंगे आपके बारे में| एक मस्जिद ही तो गई, दो-चार और दे दो|” (If you are going to vote for BSP, you might as well vote for BJP. They will think of something good for you. Only one mosque has been demolished, let 2-3 more be brought down too.)", "Several other usual suspects also tweeted the video, including Delhi MLA Kapil Mishra and Rishi Bagree.", "गौर से सुनिए – खान साहब कुछ समझा रहे हैं#SPBSPAlliance #AzamKhan pic.twitter.com/ldw1AB7Sjz", "— Kapil Mishra (@KapilMishra_IND) January 13, 2019", "On Facebook, the clip attracted nearly 3 lakh views from the page Shivraj Singh Chouhan Fans Clube. It was also circulated by NAMO TV, I Support Yogi and I Support Narendra Bhai Modi Bjp.", "Alt News found that the video of Azam Khan asking Muslims to vote for BJP and not BSP is two years old.", "कोई हया नाम की चीज नही,BSPको वोट दोगे? मत दो BSP को वोट,थोड़ी शर्म बची है तो BJP को वोट दो कुछ अच्छा ही करेगी- #AzamKhan #UPElection2017 pic.twitter.com/1UJDBkYpK4", "— Samachar Plus (@samachar_plus) February 24, 2017", "This was also reported by Amar Ujala on February 23, 2017. According to the news organisation, the SP leader made the statement in Narendralaya, Faizabad ahead of UP assembly elections. Khan was reportedly enraged after seeing blue flags hoisted on Muslim homes. Lashing out at voters, he said, “you might as well vote for BJP than BSP”, and left the podium.", "The aforementioned statement sounds more like a gibe than Khan literally urging Muslims to cast their votes in favour of the Bharatiya Janata Party. It is to be noted that his statement was immediately followed by the words – “One mosque has been demolished, let 2-3 more be brought down too.”", "A two-year-old video is now being circulated as Azam Khan advocating for the BJP despite the recent alliance of known political rivals SP and BSP. The Times of India reported on January 14 that BJP spokesperson Shalabh Mani Tripathi had circulated the video, and many, including BJP MP Farrukhabad Mukesh Rajput, mistook it as a recent affair.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]