["By Angelo Fichera", "Posted on April 1, 2020", "A viral post on Facebook claims without substantiation that the “media” is running a photo of coffins from a 2017 movie with news stories about the novel coronavirus pandemic in Italy. The picture is actually from 2013; it did appear in the 2017 movie, too, but there’s no evidence it’s being used by credible news organizations now.", "Facebook users are spreading a false claim that the “MSM” — mainstream media — is using an image from a 2017 movie in its coverage of the novel coronavirus pandemic.", "The viral post — a screenshot of one user’s text-and-photos post — suggests that the picture, showing rows of coffins, was taken from a 2017 movie and is now being circulated by news organizations as an image related to the outbreak in Italy.", "The picture was indeed used in that movie, but it was originally taken in 2013 by an Associated Press photographer. We could find no evidence of news organizations today using it to illustrate the pandemic’s toll in Italy, where more than 12,400 deaths have been reported.", "The post claims: “Ok, Patriots so I’m watching the movie UNLOCKED on Showtime and this scene pops up of coffins lined up and guess where I saw that exact picture… from our MSM telling us that this is ITALY right now because of COVID 19 virus!!”", "“This movie was made in 2017! It’s on Showtime right now!” it continues. “This proves that you cannot trust the Media!!!”", "Many of the screenshots simply show that the photo appeared on a website for CTV News, a Canadian news organization.", "But some larger versions of the post further show that the example cited was actually connected to a CTV story dealing with “African migrants.” We found that story, which was reported by the Associated Press. It’s from 2013, not 2020, and the caption described the image as showing an airport hangar filled with coffins of African migrants who died in a shipwreck near an Italian island in 2013.", "The same picture was indeed used in the movie “Unlocked,” which came out four years later. (We checked.)", "So the central claim of the argument — that the “media” is currently using the photo in coverage of the novel coronavirus — isn’t supported by the original post, or any evidence we could find.", "Reverse image searches on Google and Tin Eye didn’t turn up any recent news coverage using the picture in that context.", "Ironically, the fact-checking divisions of two reputable news organizations — Agence France-Presse and Reuters — have debunked claims advanced on social media that similar images from the airport hangar showed coffins for victims of the coronavirus pandemic. The outlets correctly pointed out that the pictures were, in fact, from 2013.", "We tracked down the Facebook user who shared the initial claim about the “MSM” — and whose profile contains numerous references to the QAnon conspiracy theory — and asked for any examples to back up the claim. We haven’t heard back.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Bruno, Luca and Andrea Rosa. “Caskets of African migrants lined up in Italian airport hangar.” Associated Press. 5 Oct 2013.", "“Coronavirus COVID-19 Global Cases.” Center for Systems Science and Engineering, Johns Hopkins University. Accessed 31 Mar 2020.", "Mason, Charlotte. “These photos show the coffins of victims of a boat disaster in 2013.” Agence France-Presse. 27 Mar 2020.", "“False claim: Photo shows coffins of coronavirus victims in Italy.” Reuters. 28 Mar 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]