["Nothing screams Internet credibility quite like an entire paragraph in all caps, alternating text background colors and no fewer than five question marks in an email subject line.", "We recently received such a chain email insisting that bank safe deposit boxes merely let people \"entertain the illusion of safety.\" (If anyone can persuade you to take your valuables out of the bank and stuff them in your mattress, please don’t let it be a stranger who just can’t figure out that caps lock key.)", "Different versions of a chain email about the U.S. Department of Homeland Security seizing safe deposit box contents have been circulating through inboxes and on websites since 2006, and as recently as this month.", "The message sent to PolitiFact read:", "U.S. DEPARTMENT OF HOMELAND SECURITY HAS TOLD BANKS -- IN WRITING -- IT MAY INSPECT SAFE DEPOSIT BOXES WITHOUT WARRANT AND SEIZE ANY GOLD, SILVER, GUNS OR OTHER VALUABLES IT FINDS INSIDE THOSE BOXES!", "According to in-house memos now circulating, the DHS has issued orders to banks across America which announce to them that \"under the Patriot Act\" the DHS has the absolute right to seize, without any warrant whatsoever, any and all customer bank accounts, to make \"periodic and unannounced\" visits to any bank to open and inspect the contents of \"selected safe deposit boxes.\"", "Further, the DHS \"shall, at the discretion of the agent supervising the search, remove, photograph or seize as evidence\" any of the following items \"bar gold, gold coins, firearms of any kind unless manufactured prior to 1878, documents such as passports or foreign bank account records, pornography or any material that, in the opinion of the agent, shall be deemed of to be of a contraband nature.", "This raises the question: Who keeps their porn in a bank safe deposit box? But porn aside, there was a lot to check out here.", "We contacted David McGuinn, president of Safe Deposit Specialists, a financial consulting firm that offers training, products and services to the financial industry. He told us he was flooded with phone calls when this claim resurfaced in 2013. He attributes it to the Cyprus financial crisis earlier this year.", "The small Mediterranean country had been in severe recession since 2009, and a banking crisis led to a rescue package from the European Central Bank. The terms of the bailout left the government desperate for cash, so officials announced in March that they would seize a portion of savers’ assets.", "That’s when people started warning that something similar could happen in the United States, and the chain email started circulating again, McGuinn told us.", "\"There’s no truth to that at all,\" he said.", "The Internal Revenue Service, U.S. Drug Enforcement Administration and U.S. Customs are groups McGuinn listed as potential officials who could force open a box with a search and seizure notice. McGuinn said this process doesn’t occur frequently.", "And when officials do open safe deposit boxes, there are safeguards in place.", "Rob Rowe, vice president with the American Bankers Association, explained that good cause must be proven in order for the Patriot Act to be used to open a safe deposit box, which is private property. The email in question cited the Patriot Act as the reason the DHS can seize this property, but Rowe said that isn’t the case.", "Also, DHS officials wouldn’t be able to open up boxes without bank officials present, he said.", "\"The only way to open the box without the renter’s key is to drill the lock. If and when a box is drilled, standard bank operating procedures require dual control – the presence of two officers – and many jurisdictions also require that the locksmith who drills the box to be specially licensed or certified,\" Rowe said.", "When we contacted Homeland Security about the issue, an official cited the Fourth Amendment, explaining that searches and seizures by the department may only take place with probable cause and a court-ordered warrant.", "Our ruling", "Various chain emails over the past seven years have warned readers about the possibility of Homeland Security seizing items like gold, silver and guns from their safe deposit boxes at the bank. This isn’t possible without first obtaining a search warrant, since those boxes are private property. And banking officials told us random seizures just aren’t happening. We rate this statement Pants on Fire.", "ABC, \"Explainer: Behind the Cyprus Financial Crisis,\" March 22, 2013", "Bellaciao, \"Homeland Security to Confiscate Bank Safe Deposit Box Contents,\" January 22, 2006", "Email interview with Nicole Stickel, Department of Homeland Security spokeswoman, July 25, 2013", "Email interview with Robert Rowe, vice president of Center for Regulatory Compliance at the American Bankers Association, July 23, 2013", "New York Times, \"Cyprus Makes Plans to Seize Portion of High-Level Deposits,\" March 23, 2013", "Phone interview with David McGuinn, president of Safe Deposit Specialists, July 23, 2013", "Safe Deposit Specialists, \"Can the Department of Homeland Security or the FBI Seize Safe Deposit Box Contents Without a Court Order?\" accessed July 23, 2013", "Snopes, \"Bank Shot,\"January 24, 2006", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]