["As Hyderabad is reeling under heaviest October downpour in a century, a video of a flooded airport has been shared with claims suggesting its Rajiv Gandhi International Airport in Shamshabad, Hyderabad.", "#Shamshaba_Airport", "Posted by Elluru Lakshmaiah on Wednesday, 14 October 2020", "The clip is also circulating on Twitter.", "Kcr brought the sea to Hyderabad 👏 pic.twitter.com/0y0jt8qv4z", "— Brinda #WeStandAgainstDictator (@B4Politics) October 14, 2020", "The same video was viral during monsoons in 2018 as scenes from an airport in Mumbai. Twitter handle @TheNewsJockey that claims to be “everything your average newspaper isn’t” shared the video on July 10, 2018 and wrote, “Mumbai Airport flooded. Flights delayed and cancelled. Please check your flight status online before heading to the airport.”", "Mumbai Airport flooded. Flights delayed and cancelled. Please check your flight status online before heading to the airport. #MumbaiRains #MumbaiRains2018 #Weather #Airport pic.twitter.com/yfRGBshLUS", "— The News Jockey (@TheNewsJockey) July 10, 2018", "This video was also widespread on Facebook as Mumbai airport.", "As torrential rains batter Telangana, almost all airline carriers have cancelled their flights that were supposed to depart and arrive at Hyderabad due to safety concerns. However, reports do not claim that the Rajiv Gandhi International Airport (RGIA) is inundated but a road connecting the city to the airport was swept away in floodwaters.", "When the video was viral as Mumbai airport, many users had pointed out that the claim is false since the airport was functional.", "This doesn’t look like Mumbai Airport from any angle. Travelled yesterday from there. Everything was perfectly fine. Just about 20 mins delay. https://t.co/apZGNZODcd", "— Yogini (@yoginisd) July 11, 2018", "Alt News used InVid Chrome Plugin to break up the video into individual frames and found that the video pertains to Mexico and was shot at the Mexico City International Airport.", "The video was posted by multiple Mexican news outlets on their Twitter accounts on August 31, 2017.", "#QueNoSeTePase Así el @AICM_mx esta tarde. El servicio está suspendido desde las 18:40. https://t.co/8XXhlAfv3i pic.twitter.com/eeTRkKq1fL", "— Reporte Índigo (@Reporte_Indigo) August 31, 2017", "Suspenden operaciones en el @AICM_mx por las lluvias. Así lucen algunas zonas de pista. https://t.co/mKqbLJobAR Video: @CanalOnceTV. pic.twitter.com/2a2dYsTKkg", "— Newsweek en Español (@NewsweekEspanol) August 31, 2017", "The official Twitter handle of Mexico City International Airport had also tweeted on August 31, 2017 that the take-off and landing of flights had been suspended due to weather conditions.", "In the past, this video was circulated claiming that it is the Miami Airport. Ironically, it was Director of Social Media, White House who had put out this misleading video. He later deleted his tweet.", "The official Miami Airport Twitter account had responded stating that it wasn’t Miami airport.", "This video is not from Miami International Airport.", "— Miami Int’l Airport (@iflymia) September 10, 2017", "A video from Mexico is therefore viral with the false claim that RGI airport in Hyderabad was flooded. Such messages can spread panic and should not be forwarded without basic verification.", "Donate Now", "Follow @free_thinker", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]