["About this rating", "On 5 October 2016, Politico reported that presidential candidates Donald Trump and Hillary Clinton had been edged out of the news cycle in the final weeks leading up to the November 2016 election by Hurricane Matthew, which (at the time the story was posted) was headed into Florida as a powerful Category 4 storm.", "The story, citing an unnamed source \"monitoring TV ad buys,\" also reported that the Clinton campaign had spent $63,000 for ad time on the Weather Channel to coincide with the brunt of the hurricane's hitting Florida.", "The Politico piece dwelt chiefly on how the two candidates would grapple with being shouldered out of news coverage by Hurricane Matthew, and discussed the gamble Clinton was taking by buying ads during the storm, at the risk of being seen as \"crass.\" Opponents seized on the story to cast her in just that light.", "After political blogs and commentators attacked Clinton for \"capitalizing\" on the pending disaster, the Clinton campaign released a statement to the media saying that the Weather Channel buy was a very small portion of their advertising outlay:", "Earlier in the week, we made changes to our TV ad reservations across hundreds of stations in several battleground states including Florida. Less than 1% of those changes included The Weather Channel. We have requested that stations in Florida delay any of those ads on the Weather Channel until after the storm passes.", "After Hurricane Matthew pummeled Haiti, Cuba, the Bahamas, and other Caribbean countries — leaving hundreds dead by even the most conservative estimates — the huge storm turned toward the southeastern United States, prompting the evacuations of millions of people living in Florida, North Carolina, South Carolina and Georgia as coastal regions flooded.", "Cheney, Kyle, and Shepard, Steven.   \"Clinton, Trump brace for Hurricane Matthew.\"\r\n   Politico.   5 October 2016.", "Joseph, Cameron.   \"Hillary Clinton Campaign Delays Weather Channel Ads After Targeting Hurricane Matthew Audience in Florida.\"\r\n    [New York] Daily News.   6 October 2016.", "Mazzel, Patricia.   \"Clinton Team Asks Weather Channel to Delay TV ads Until After Hurricane Matthew.\"\r\n    The Miami Herald.   6 October 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]