["About this rating", "At least five individuals are known to have died in conjunction with the Jan. 6, 2021, insurrection at the U.S. Capitol in the District of Columbia, and rumors surrounding the circumstances of their deaths were quick to circulate across social media platforms.", "Kevin Greeson, a 55-year-old father of five from Alabama, was at the heart of many of these rumors when some Twitter users, some of whom had verified accounts, claimed that he had suffered a fatal heart attack after “accidentally and repeatedly” discharging a taser in his pants while attempting to steal a portrait off the walls inside the Capitol:", "Snopes spoke with Kristi Greeson, the wife of the late Kevin Greeson, who told us that there was no truth to the allegation that her husband’s heart attack was the result of his accidentally tasing himself. Greeson said that her husband attended the Capitol riot but never entered the building. Kevin had told his wife that he was in a safe area, but then he described seeing people pushing a barrier at a nearby location.", "“He just stopped talking, and I could hear all the people. That’s when he had the heart attack,” Greeson told Snopes over the phone. “He died instantly.”", "Greeson said that her husband was a supporter of U.S. President Donald Trump and that he was excited about going to “once-in-a-lifetime events,” but she denied allegations that her husband had stolen a painting or that he had even made it inside of the Capitol, for that matter. And he certainly didn’t “taser his balls.”", "According to Greeson, her husband did not have a gun or a taser on him during the riot — to her knowledge he was only carrying a flagpole. Any claims that he \"tasered his balls while stealing a painting\" could not be \"farther from the truth,\" she said.", "A photograph of Kevin Greeson. Courtesy of Kristi Greeson.", "An article published by the New York Times and written by Adam Goldman depicted the events leading up to Kevin Greeson’s death, corroborating Greeson's wife’s account. A reporter for the publication was near Kevin when he “fell to the sidewalk” while on the phone.", "“A New York Times reporter watched as emergency personnel rushed to help, furiously performing chest compressions, but were unable to revive him,” wrote the publication.", "Three other attendees died following the breach of the Capitol, including a 35-year-old woman named Ashli Babbit who was fatally shot by Capitol Police. Benjamin Phillips, 50, from Greentown, Pennsylvania, and Roseanne Boyland, 34 of Kennesaw, Georgia, also died. U.S. Capitol Police Officer Brian D. Sicknick succumbed to injuries suffered while he was on duty during the riot.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]