["A video of a person committing suicide by jumping from a high rise building is doing the rounds on social media. It is being claimed that the person was infected with coronavirus in USA’s New York City.", "[The video might be disturbing for some users, Viewer discretion is advised.]", "न्यूयॉर्क में कोरोना के मरीज़ ने फ्लैट से कूदकर की आत्महत्या…….", "ये तस्वीर आपको हिला कर रख देगी, न्यूयॉर्क में…", "Posted by Bharat Breaking News on Saturday, 28 March 2020", "Vikas Bhadauria, a journalist with ABP News, also tweeted the video claiming that a person infected with coronavirus committed suicide in the US: “ये तस्वीर आपको हिला कर रख देगी, न्यूयॉर्क में #Corona से जूझ रहे एक शख्स ने अपने फ्लैट से कूद कर आत्महत्या कर ली, अमेरिका के 1 लाख कोरोना मामलों में 46 हज़ार अकेले न्यूयॉर्क के हैं अकेले इस शहर में 606 लोगो की मौत हो चुकी है।”. An archived version of the tweet can be accessed here.", "Many other individuals on Twitter and Facebook shared the video with the same narrative. We have also received a request on our official mobile application to fact-check this claim.", "Alt News broke the video into multiple frames using the digital verification tool InVid. A Google reverse image search of one of the keyframes revealed that the video is from 2015 and is not related to the recent coronavirus pandemic.", "We found a Facebook post where it was claimed that a pregnant Ghanian woman committed suicide by jumping from the roof of her building after finding out that her husband was cheating on her with her mother.", "Graphic: Pregnant Ghanaian Woman jumps off the Cliff", "Suicide Pregnant Ghanaian Jumps Building Shocking Video Ghanaian Woman jumps off the Cliff as Hubby sleeps with Her Mom. Pregnant Ghanaian Woman Jumps From 40 Storey Building Because Her Husband Was Sleeping With Her Mom and was carrying her husbands child,40 Storey Building jumping Must she commit suicide? Comment your opinion and share", "Posted by Ọmọ Oòdua on Monday, 10 August 2015", "“It is understood that the woman’s mother and husband had been having an affair for some time and that their secret relationship was only discovered when the wife caught them in [the] act of having sex. While still trying to come to terms with the double betrayal, the woman suffered further humiliation when she learned that her mother had actually fallen pregnant as a result of the affair,” stated a report published by Daily Mail on August 12, 2015. There was confusion over exactly where the woman’s alleged suicide took place, however, many reports have claimed that a local police report in Ghana has confirmed it.", "In conclusion, a 2015 video of a Ghanian woman committing suicide is being shared with the claim that a person committed suicide after getting infected with the coronavirus. At the time of writing this article, the total number of COVID-19 positive cases crossed over 1 lakh in the United States of America, with close to 27,000 cases in New York itself. The death toll in New York City has climbed to 450.", "Note: The number of positive cases of the novel coronavirus in India exceeds 1,000. This has caused the government to impose a complete restriction on movement apart from essential services. Globally, more than 6.5 lakh confirmed cases and over 30,000 deaths have been reported. There is a growing sense of panic among citizens, causing them to fall for a variety of online misinformation – misleading images and videos rousing fear or medical misinformation promoting pseudoscience and invalid treatments. While your intentions may be pure, misinformation, spread especially during a global pandemic, can take lives. We request our readers to practice caution and not forward unverified messages on WhatsApp and other social media platforms.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…"]