["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump and first lady Melania Trump, third from left, arrive for Game 5 of the World Series baseball game between the Houston Astros and the Washington Nationals at Nationals Park in Washington, Sunday, Oct. 27, 2019. (AP)", "After a day in which he announced the death of terrorist leader Abu Bakr al-Baghdadi, President Donald Trump attended Game 5 of the World Series in Washington where he was met with some loud boos and taunts of \"lock him up!\"", "The booing occurred at the end of the third inning when the Jumbotron showed Trump, wife Melania and other guests at the game.", "On the same night, a viral screenshot of a tweet purportedly written by Trump rhetorically punched back with allegiance to the red state of Texas and its baseball team.", "\"Fine you boo me DC? Go #Astros, Texas loves me, I get the best kind of love there. I’ll be renaming the White House the Orange House,\" stated the Oct. 27 post, which was posted on Facebook.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Trump didn’t really write that.", "We looked through Trump’s tweets on Oct. 27 and found he did not tweet about being booed at the game. We also searched through deleted tweets on ProPublica’s Politwoops website and didn’t find it there either. The screenshot appears to be created using a fake tweet generator, which mimics real accounts but is most definitely not.", "We rate this statement Pants on Fire.", "Facebook, Post, Oct. 27, 2019", "Facebook, @Realdonaldtrump public group, Accessed Oct. 28, 2019", "CBS News, Trump booed at World Series and chants of \"Lock him up!\" break out, Oct. 28, 2019", "ProPublica, PolitWoops, Accessed Oct. 28, 2019", "PolitiFact, Again, Trump boasted that he called to take out Osama bin Laden in 2000. He didn’t, Oct. 28, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]