["After a string of gaffes on the campaign trail, some critics suggested that Joe Biden was mentally unfit for the job of president. Now a viral video has surfaced on social media claiming that Biden said he was unaware of what document he was signing before signing it.", "\"He actually says 'I don’t know what I’m signing here.'\" a Facebook user captioned the viral video, which was shared to Facebook on Jan. 27 and has over 1,400 reactions.", "The 42-second video clip shows Biden at a signing ceremony with Republican House Minority Leader Kevin McCarthy, R-Calif., and House Speaker Nancy Pelosi, D-Calif., standing behind him. Standing next to Biden is Vice President Kamala Harris.", "A text caption near Biden reads, \"I don’t know what I’m signing,\" and a caption below Harris reads, \"Sign it anyways.\"", "USA TODAY reached out to the Facebook user for comment.", "Fact check:Meme of 9 questions makes false inauguration claims", "The original video clip, which is visible on VOA News and PBS News Hour, shows Biden signing his first documents as president of the United States. Coverage of the signing ceremony was also streamed live on C-Span.", "Following his swearing in, Biden signed three documents while in the President's Room at the U.S. Capitol, including an Inauguration Day proclamation and nominations to Cabinet and sub-Cabinet positions, according to PBS.", "There is no evidence that Biden said, \"I don't know what I'm signing here,\" and experts who have reviewed the audio say it's unclear.", "Rob Maher, a professor at Montana State University's department of electrical and computer engineering and an audio forensic analysis expert, analyzed the audio in the video by reducing background noise to make the words more intelligible.", "\"At 24 seconds he (Biden) peruses the document and utters a phrase that sounds to me like 'a look what I’m signing here.' The vice president is simultaneously sliding the first folder over to the edge of the desk. I don’t detect any utterance by the vice president at that point,\" Maher told USA TODAY in a statement.", "Then the president starts his signature and closes the second folder at the 35-second mark in the video. At 38 seconds, Biden slides the closed folder and pen to his left and makes a remark to Harris.", "Maher said the remark to Harris is unintelligible but sounds like, \"add this one to the cabinet\" or \"hand this one to the cabinet.\" Harris then makes unintelligible remarks and turns toward Pelosi, who reacts to her comment.", "Hany Farid, a professor in electrical engineering & computer sciences at the School of Information at the University of California, Berkeley, whose research specialties include digital forensics, reviewed the video for PolitiFact. He reduced background noise and enhanced the voice.", "Farid told USA TODAY that there is a short gap between \"I\" and \"signing.\"", "\"I don't believe that he (Biden) is saying 'I don't know what I'm signing.' I believe that he is saying 'I like what I'm signing here,' but can't be positive,\" Farid said in a statement.", "Editorial manager of the AFP Medialab Denis Teyssou also told PolitiFact that it is not clear what Biden said.", "Fact check: Altered 2014 image used to make false White House blackout claim", "The claim that Biden said \"I don't know what I'm signing\" while signing a document at the Capitol is FALSE, based on our research. There is no evidence that Biden said this, and the audio in the video is not entirely clear. Experts who enhanced and analyzed the audio agree that Biden said \"signing\" but it does not sound like he said, \"I don't know what I'm signing.\"", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]