["BJP spokesperson Tajinder Pal Singh Bagga tweeted (archive link) a 30-second clip and wrote: “Terrorist Commercial Ad by Volkswagen” Interesting? The video shows a man in a suicide vest drive down a car to a public place and press the detonation button. The explosion, however, is contained inside the car. The clip ends with the slogan, “Polo. Small but tough.”", "Bagga’s video was viewed over 40,000 times. He also shared it on Facebook. Alt News has documented multiple instances of misinformation shared by Bagga in the past.", "“Terrorist Commercial Ad by Volkswagen” Interesting ? pic.twitter.com/AYs98BmMYE", "— Tajinder Pal Singh Bagga (@TajinderBagga) November 24, 2020", "This video was shared by multiple Facebook and Twitter users with identical text. The same has also been shared with Arabic music playing in the background. The caption suggests that Volkswagen made the ad to ‘mock’ Muslims. It was shared by Twitter user @SonuSri795 (archive link) gaining over 700 retweets. It was also tweeted by Akash RSS who frequently shares misinformation. (archive link)", "(Hindi text: जर्मनी की ऑटोमोबाइल कंपनी फॉक्सवैगन ने इन शांति दूतों का जमकर मजाक उड़ाया है शांतिदूत आतंकी फॉक्सवैगन की कार में बम लेकर ब्लास्ट करना चाहता है लेकिन कार इतना मजबूत है कि ब्लास्ट नहीं होता अगर ऐसा ऐड किसी भारतीय कंपनी ने बनाया होता तो अब तक इस्लाम खतरे में आ गया होता)", "जर्मनी की ऑटोमोबाइल कंपनी फॉक्सवैगन ने इन शांति दूतों का जमकर मजाक उड़ाया है", "शांतिदूत आतंकी फॉक्सवैगन की कार में बम लेकर ब्लास्ट करना चाहता है लेकिन कार इतना मजबूत है कि ब्लास्ट नहीं होता", "अगर ऐसा ऐड किसी भारतीय कंपनी ने बनाया होता तो अब तक इस्लाम खतरे में आ गया होता pic.twitter.com/aMbBq7NKvv", "— Akash RSS (@Satynistha) November 24, 2020", "Alt News performed a keyword search on YouTube and found that the video was uploaded on YouTube in 2006. The description states that it’s a parody video.", "In 2017, US-based ABC 10 News debunked the claim that Volkswagen made an advertisement featuring a suicide bomber. The video was made by viral brand communications experts Lee & Dan and Volkswagen was not involved in the production.", "The hoax advertisement was also reported by The Guardian and The New York Times in 2005. Dan said that the video reflected “what people see in the news every day. The car is the hero that protects innocent people from someone with very bad intentions. We’re sorry if it has caused any offence.”", "A 15-year-old parody video was shared by several social media users with the false claim that Volkswagen aired a suicide bomber commercial to ‘mock’ Muslims.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]