["The posts, shared thousands of times in the US and Canada since May 2020, list a number of risk associated with mask wearing including: “reduces oxygen up to 60%,” “increases risk of CO2 poisoning,” and “causes increased face-touching.” Similar claims have also been posted in Spanish.", "Vinita Dubey, Associate Medical Officer of Health at Toronto Public Health, told AFP via email that, if worn correctly, a cloth mask is unlikely to reduce oxygen enough that the wearer would pass out.", "“In general, a cloth mask does not fit tightly to the face. Air can still go around the mask as well as through the pores in the material,” while acting as a barrier to small virus particles, she said.", "The claim that masks cause an oxygen deficiency (hypoxia) was disproved in a separate AFP fact-check.", "The claim that wearing a mask “increases risk of CO2 poisoning” was also refuted by Dubey.", "“Prolonged use of a face mask, including the N95, has not been shown to cause carbon dioxide toxicity in healthy people. If CO2 slowly builds up in the mask over time, the levels are low and mostly tolerable,” Dubey said.", "N95 masks used by health care workers are designed to have a very tight fitting.", "However, there can be specific circumstances where “some individuals may not be comfortable wearing a mask. Anxiety or panic may lead to hyperventilation (rapid breathing) which can cause the CO2 levels to drop and symptoms of lightheadedness, dizziness and confusion,” Dubey added.", "The post also claims that wearing a mask “increases face touching.”", "Hyo-Jick Choi, Assistant Professor at the University of Alberta’s Chemical and Materials Engineering Department, said he is not aware of any study that directly correlates wearing a mask with increased face touching.", "Choi told AFP via email that “whether you wear a mask or not, face touching can either infect an individual by the contaminated hands, or transmit disease by the contaminated masks and cause infections.”", "Both Choi and Dubey were clear that users should not touch their masks after putting them on.", "Dubey stressed that “a mask should fit comfortably and be easy to breathe to avoid frequent adjustments of the mask while using it.”", "The post also claims that “viruses and bacteria saturate the outside” of the mask.", "Choi said, “it depends on the risk level of the environments, the time spent and where the mask has been exposed to.”", "Health Canada guidelines state that “if you plan to reuse the mask, wash it before wearing it again.”", "Finally, the post claims that “contaminants sit within mask fibers, get reinhaled.” This is misleading.", "Choi explained that “respiratory diseases are transmitted by virus/bacteria-carrying droplets. Face masks are used to prevent the transmission of those pathogens-carrying droplets (i.e. contaminants),” and it is unlikely that these would be “reinhaled” as claimed in the post.", "“If the pathogen-carrying droplets (from large droplets to small aerosols) are produced by human activities such as sneezing, coughing, and speaking, then the virus-carrying droplets would have a composition similar to saliva. In this case, pathogens on the mask surface may not be easily released from fibers because of the high viscosity of the contaminant.”", "Health Canada cautions, however, that homemade masks “may not provide complete protection against virus-sized particles.”", "However, the agency, along with the CDC, continues to recommend that face masks or face coverings be used in situations where social distancing is difficult to maintain.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]