["About this rating", "On 26 July 2016, shortly after Bill Clinton took the stage at the Democratic National Convention to make the case that his wife Hillary Clinton should be the next President of the United States, an image purportedly listing the various fines and consequences he suffered for lying under oath during the Monica Lewinsky scandal showed up on social media.", "The list displayed above is mostly accurate, although some of the claims deserve extra clarification:", "Bill Clinton was disbarred from practicing law in Arkansas and was also disbarred from practicing law in front of the Supreme Court over the Lewinsky incident.", "While Clinton can no longer practice law in front of the highest court, it's not accurate to say that he was disbarred from either the Supreme Court or from practicing law in Arkansas. Clinton's license was suspended in Arkansas, but he was not disbarred, and while Clinton did face the possibility of being barred from arguing in front the U.S. Supreme Court, he resigned before the ruling was handed down.", "On his last day in office in 2001, Clinton agreed to a five-year suspension of his Arkansas law license in order to head off any criminal charges for lying under oath about his relationship with Lewinsky. Clinton has been eligible to seek reinstatement of his license since 2006, but as of 2013 he had not applied to do so.", "Shortly after Clinton's license was suspended in Arkansas, the U.S. Supreme Court suspended Clinton from presenting cases in front of the highest court (which he had never done) and gave him 40 days to contest his disbarment (which Clinton did not do). Instead, he resigned from the Supreme Court bar:", "Former President Clinton, facing the possibility of being barred from practicing law before the U.S. Supreme Court because of the Monica Lewinsky scandal, has resigned instead, his lawyer said.", "\"Former President Clinton hereby respectfully requests to resign from the bar of this court,\" his lawyer, David Kendall, said in a two-page letter to the high court's clerk. Kendall did not elaborate on why Clinton decided to resign.", "Clinton's resignation from the Supreme Court bar will have little practical impact. Clinton has not practiced before the Supreme Court and was not expected to argue any cases in the future.", "He also paid a $25,000 fine over the Lewinsky incident.", "In addition to agreeing to a five-year suspension of his Arkansas law license, Clinton accepted a $25,000 fine:", "Mr. Clinton paid the fine with a personal check on March 21, said Marie-Bernarde Miller, the lawyer who handled a disbarment lawsuit brought by a committee of the Arkansas Supreme Court.", "\"The case is completed,\" Ms. Miller said.", "Clinton was fined $90,000 for giving false testimony in the Paula Jones case.", "In April 1999, U.S. District Judge Susan Webber Wright found Clinton in contempt of court for giving false testimony in the Paula Jones sexual harassment trial and fined him over $90,000:", "The federal judge who found President Clinton in contempt of court levied a penalty of $90,686 against him, making him the first chief executive ever assessed such a payment.", "Repeating her condemnation of Clinton for lying under oath in the Paula Corbin Jones sexual harassment lawsuit, U.S. District Judge Susan Webber Wright said that she was imposing the sanction to cover some of Jones' legal expenses and \"to deter others who might consider emulating the president's misconduct.\"", "Robert S. Bennett, Clinton's private attorney, said that he would not challenge the ruling. \"We accept the judgment of the court and will comply with it.\"", "He also paid an $850,000 settlement over the Lewinsky incident.", "Bill Clinton did write a large settlement check, but that money went to Paula Jones and not Monica Lewinsky,", "In 1994, Paula Jones filed a sexual harassment lawsuit against Bill Clinton. Thar case dragged on for four years (while Clinton was serving as President) before it was finally settled in November 1998 with a check for $850,000:", "Clinton mailed the settlement cheque to Mrs. Jones, even as he braced for the heaviest fallout yet from her harassment suit — an impeachment trial in the Senate.", "To finance the settlement, the president drew about $375,000 from his and Hillary Rodham Clinton's personal funds and got the rest of the money, about $475,000, from an insurance policy, a White House official told The Associated Press.", "\"This ends it. The check is being Fed-Exed\" to Bill McMillan, one of Mrs. Jones' lawyers, said the official, who spoke on condition of anonymity.", "Srinivasan, Kalpana.   \"Clinton Pays Paula Jones $850,000.\"\r\n    The Guardian.   13 January 1999.", "Jackson, Robert.   \"Clinton Fined $90,686 for Lying in Paula Jones Case.\"\r\n    Los Angeles Times.   30 July 1999.", "Vicini, James.   \"As Sanction Looms, Clinton Resigns from High Court Bar.\"\r\n    Los Angeles Times.   11 November 2001.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]