["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A viral Facebook posts says Democratic presidential candidate Elizabeth Warren likened abortion to tonsil removal.", "The post features a photo of the Massachusetts senator with text above and below the image that reads: \"‘Having an abortion is no different than someone having their tonsils removed.’ - Liberal Democrat Senator Elizabeth Warren. Yes she really said this and is really this damn crazy and stupid!\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Warren did make a comparison between abortion and tonsil removal procedures, but the quote shared in the post is heavily edited and is not something Warren said or wrote.", "After searching the web and Nexis news archives, the first instance we could find of Warren discussing tonsils and abortion came in a Jan. 21, 2018, opinion column in Time magazine.", "She wrote:", "\"On the 45th anniversary of Roe vs. Wade, I think about what has changed since abortions became legal. Our health care system has pretty much dealt with the safety issue: thanks to Roe vs. Wade, abortion is now safer than getting your tonsils out. A lot of women are alive today because of Roe.\"", "Warren made the same statement a few days later in a speech she delivered on the Senate floor in opposition to legislation that would ban abortions after 20 weeks of pregnancy.", "In another opinion column, published in Marie Claire magazine in July 2018, Warren wrote that Brett Kavanaugh’s confirmation to the Supreme Court could threaten the overturn of Roe vs. Wade.", "In the column, she again makes comparisons between the safety of the two procedures:", "\"The threat of overturning Roe vs. Wade is also serious. When abortions are illegal, women don’t stop getting them — they just risk their lives to do it. Today, thanks to Roe, getting an abortion is safer than getting your tonsils out. Before Roe vs. Wade, many women turned to back-alley butchers to end their pregnancies.\"", "In the piece, Warren links to a Time magazine article, which reported in 2014 that women who get abortions are less likely to have complications than people who have their wisdom teeth removed, citing a study published in the peer-reviewed Obstetrics & Gynecology medical journal.", "Dr. Ushma Upadhyay, the author of the study, told Time that of the 54,911 abortion procedures analyzed, \"only 2.1% resulted in a complication — considerably lower than the 7% complication rate for wisdom tooth removal and 9% rate for tonsillectomy.\"", "A Facebook post shares an image of Warren and claims she said \"having an abortion is no different than someone having their tonsils removed.\"", "Warren never said having an abortion \"is no different\" than removing a tonsil. In arguments defending Roe vs. Wade, Warren compared the overall safety of the two medical procedures, once by citing a study.", "This post takes Warren’s statement, swaps out her words and places the heavily edited statement inside quotation marks to make it look like she said something she didn’t. So while it contains an element of truth, it ignores critical facts that would give a different impression. We rate it Mostly False.", "Facebook post, July 31, 2019", "Senate.gov, TIME Op-Ed: America Can Never Go Back to the Era of Back-Alley Abortions, Jan. 21, 2018", "Senate.gov, Senator Warren Delivers Floor Speech Opposing Proposed 20-Week Abortion Ban, Jan. 30, 2018", "Marie Claire, If You're Not Worried About Justice Kavanaugh Overturning Roe v. Wade—You Should Be, July 24, 2018", "Time, Abortion Complication Rates Are 'Lower Than That For Wisdom Tooth Extraction', Study Says, Dec. 9, 2014", "Journal of Obstetrics and Gynecology Incidence of Emergency Department Visits and Complications After Abortion, January 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]