["“Zoom in. The cap is still on the needle. Love the sterile gloves,” reads a February 18, 2021, Facebook post that includes a picture of Ramaphosa receiving a Covid-19 vaccination.", "Officials wearing masks watch on as a nurse prepares to jab Ramaphosa in his left arm. The plunger has a visible label attached to it, but no cap covering the needle.", "Misleading claims about Covid-19 vaccines continue to spread online as they are administered around the world, raising fears and doubts about a key tool in the fight against a disease that has killed more than 2.4 million people. Of those fatalities, close to 50,000 have been in South Africa.", "#COVID19 Statistics in SA as at 22 February.\n\n\t\tUse the COVID Alert SA app to protect yourself, your loved ones and your community. Start using this privacy preserving app today. Add your phone to the fight! Download the Covid Alert SA app now! https://t.co/8YKEqaiiRF pic.twitter.com/jXYxyyHDYW", "Ramaphosa received his jab on February 17, 2021, a historic moment that was captured by several media outlets and broadcast live on multiple web platforms.", "“Taking the vaccine was quick, easy and not so painful,” he tweeted, along with a two-minute video of the shot being administered. “I urge all our healthcare workers to register to receive their vaccinations as they are our first line of defence against the coronavirus pandemic.”", "Taking the vaccine was quick, easy and not so painful. I urge all our healthcare workers to register to receive their vaccinations as they are our first line of defence against the coronavirus pandemic. #WeChooseVacciNation #VaccineforSouthAfrica ?? pic.twitter.com/11tyl1f9Xs", "The exposed needle is clearly seen in footage broadcast by local media here and here.", "An AFP photo also shows that the needle was uncovered at the time the shot was administered.", "The false Facebook post also comments on the fact that the nurse administering the jab is not wearing gloves.", "But according to the US Centers for Disease Control and Prevention (CDC), the use of gloves for the Covid-19 vaccine is not required unless the person administering the shot has open wounds or might come into contact with potentially infectious bodily fluids.", "AFP Fact Check previously debunked similar false claims about other world leaders receiving their Covid-19 vaccinations here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]