["About this rating", "In February 2021, millions of people in Texas were left without power after a major winter storm overwhelmed the state's power grid. In the immediate aftermath, some politicians attempted to blame the power outages on environmental policies such as the \"Green New Deal\" (a policy that was never enacted) and on green energy sources such as wind turbines (a mostly false claim). On social media, this argument was countered by people who claimed that wind turbines can function properly in extremely cold regions such as Antarctica.", "This is a genuine photograph of functioning wind turbines in Antarctica.", "This photograph was taken at the Princess Elisabeth Antarctica base, a zero-emission polar research center that is powered by solar and wind energy. Here's how Antarcticstation.org explains the green energy set-up at this arctic research base:", "While the sun never sets in Antarctica for one half of the year, it never rises for the other half. This means that, in order to function properly during the Antarctic winter, the Princess Elisabeth Station needed a second source of energy that would be available all winter long.", "The katabatic winds on the Antarctic continent provided the answer to that issue, as the wind gusts from the plateau are as fierce in the winter as they are in the summer.", "Along the ridge of the Princess Elisabeth Station are nine wind turbines, installed by the IPF crew to complement the solar installations.", "Each of the wind turbines is designed to withstand the most vicious storms on Earth. The blades of the wind turbines can close down in the event of a storm, thus reducing the rotating speed in order to prevent any damage from occurring to the wind turbine.", "The wind turbines at Princess Elisabeth Station are specifically designed to function in extremely cold weather. The Conversation academic research site explains that these turbines are drilled into the granite ridge below the snow and ice, unlike a wind turbine in, say, Idaho, which would be mounted on a large concrete base. These turbines also use special polar lubricants that help them withstand the freezing temperatures.", "The Conversation writes:", "Solar panels have to be mounted high above the snow-covered ground to capture the 24 hours of daylight during the austral summer. Wind turbines are drilled into the granite ridge beneath the snow and ice, removing the need for large concrete foundations. Their blades are maintained with carefully designed polar lubricants, but they can shut down production during intense storms. These renewable energy sources melt snow for water, which is filtered and reused on site to reduce waste.", "The whirl of nine wind turbines generates the reassuring sound of regular clean electricity on base. While other research stations have to use fossil fuels to keep station staff warm, fed and hydrated, the Princess Elisabeth station uses 100% renewable energy supplied by the sun, the wind, and plentiful frozen water.", "There’s no need for conventional heating here either. Nine layers of cladding and insulation keep the biting Antarctic cold out, and the pleasant warmth of the station in. Every piece of electrical equipment runs on renewable energy. Even my hair dryer is powered by the almost constant Antarctic winds and summer daylight.", "Wind turbines can certainly function in cold weather, but they need to be prepared for those conditions. While an investigation is needed to get to the bottom of exactly what went wrong in Texas (you can read more about the causes of the power outages here), Tom Smith, the former director of the consumer advocacy group Public Citizen, told the Texas Tribune that wind turbines (as well as natural gas plants and other pieces of energy infrastructure) likely froze because they were not \"winterized\" and prepared for the cold weather:", "“Instead of taking any regulatory action, we ended up getting guidelines that were unenforceable and largely ignored in [power companies’] rush for profits,” he said.", "It is possible to “winterize” natural gas power plants, natural gas production, wind turbines and other energy infrastructure, experts said, through practices like insulating pipelines. These upgrades help prevent major interruptions in other states with regularly cold weather.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]