["About this rating", "A photograph purportedly showing a woman named \"Malinda Borden\" is frequently shared on social media along with the claim that she had worked aboard the RMS Titanic and drowned at sea when that ship sank on its maiden voyage, as lifeboat seats were only made available to white passengers. Her name, according to the viral Facebook post, was nearly lost to history because the black workers who perished during the disaster were listed as property that was lost, rather than being included in the list of victims:", "TITANIC VICTIM MALINDA BORDEN was drowned at sea as she was working aboard the Titanic. Life boats were made available to WHITE women and WHITE children ONLY. The Black workers were not listed among the passengers or victims. They were only listed among property that was lost. #BlackHistoryicon", "This claim has been working its way online since at least 2016. While we have been unable to determine the specific origins of this photograph, we can say that this Facebook post does not relay an authentic story about the Titanic tragedy.", "A number of the details in the post are contradicted by what we know about the event. For example, the post suggests that a number of the workers aboard the Titanic were black, and that they were prevented from boarding lifeboats due to their race. However, that simply wasn't the case: black persons were nearly entirely absent from the ship, either as passengers or crew, due to racial discrimination laws of that era.", "The Solid Rock Herald, an \"afro-American press\" outlet, noted in their condolences after the Titanic's sinking that it could be \"safely calculated that no member of the colored race lost their lives in this awful catastrophe owing to certain conditions over which we have no control\":", "We were unable to find any record of a black person working among the crew of the Titanic, let alone a black woman. Only two dozen women were among the Titanic's crew of 900, none of them named Malinda Borden. Apparently the liner had only one black family among its passengers, headed by a man named Joseph Phillippe Lemercier Laroche.", "The Haitian-born Laroche, his white, French-born wife, Juliette, and their two mixed-race children, Simonne and Louise, were second-class passengers aboard the Titanic when it sank in April 1912 after hitting an iceberg. Juliette and the children survived the ordeal, but Joseph was among the over 1,500 people who died:", "While this Facebook post would lead us to believe that Laroche's name was listed among the \"property\" lost, Laroche and his family were in fact listed as missing persons in a report published in the Brooklyn Daily Eagle the morning after the sinking:", "The following is a list of those not accounted for. It is an elimination of the passengers reported saved. The record has been compiled with the greatest care. Owing to the confusion in the transmission by wireless of the names of the survivors, it is expected that some errors have been made. Many of those in this list of not accounted for will doubtless be reported saved later.", "Tue, Apr 16, 1912 – Page 2 · The Brooklyn Daily Eagle (Brooklyn, Kings, New York) · Newspapers.com", "We should note that Laroche was not a slave, but an engineer returning to his home country of Haiti in search of a better job to provide for his family.", "While racial discrimination was certainly prevalent in the early 1900s, it's inaccurate to say that black people aboard the Titanic were denied spots on the lifeboats specifically due to their race -- largely because of the absence of black passengers on the ship in the first place. Furthermore, contemporaneous news articles document that the one black passenger who died during the disaster was indeed listed among the victims and not, as suggested by the viral Facebook post, as \"lost property.\"", "The viral photograph does not appear to show any identifiable passenger or crew member who was aboard the Titanic. We could not find the name \"Malinda Borden\" among any of the available passenger or crew lists, and the Titanic Historical Society mentioned only the Laroche family when discussing black persons who were aboard the ship.", "It appears that this photograph is entirely unrelated to the Titanic, and that its accompanying back story was made up.", "Hendrix, Shawna.   \"Black Titanic Passenger Has Chicago Kinship.\"\r\n    WMAQ-TV.   9 April 2012.", "Safford, Stephen.   \"Southampton's Lost Titanic Generation.\"\r\n    BBC News.   12 April 2012.", "The Pittsburgh Courier.   \"Afro-American Press on Titanic Disaster.\"\r\n    4 May 1912.", "The Brooklyn Daily Eagle.   \"Not Accounted For.\"\r\n    16 April 1912.", "Titanic Historical Society.   \"A Haitian French Family Which Traveled in Second Class Aboard Titanic.\"\r\n    Retrieved 28 February 2019.", "The Library of Virginia.   \"R.M.S. Titanic: 100 Years Later.\"\r\n    Retrieved 28 February 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]