["About this rating", "In May 2005 we began receiving many inquiries similar to the following:", "A photo of an alleged sex offender named \"Brian Peppers\" surfaced in my office today.  The picture was obtained from the ohio sex offender website.", "The picture looks too gruesome to be real.", "This photograph, which accompanied an entry in Ohio's Electronic Sex Offender Registration and Notification (eSORN) system, was real.  The picture depicted a then 34-year-old man named Brian Peppers, who was listed in that registry due to a conviction for Gross Sexual Imposition in Lucas County, Ohio, in 1998.", "Although many viewers were of the opinion that the image was fake (possibly a picture of some type of mannequin or a digitally manipulated photograph), and that the entry in eSORN was an erroneous one (possible a mistake, an inside joke, or a hacking prank), we verified both the photo and the entry in several ways:\n\n We contacted the Ohio Attorney General's office, who told us: \"This is an accurate photo of this offender.\"", "The same Brian Peppers appeared on a list of registered sex offenders in Lucas County.", "A record existed for <!--court proceedings-->court proceedings related to cases involving a person named Brian J. Peppers, charged with two counts of Gross Sexual Imposition.", "We heard from several people who lived in or near Lucas County and said they'd encountered Brian Peppers.  One of them told us he had a relative who attended school with Brian Peppers and forwarded us some high school yearbook photos to document it:", "Brian Peppers' unusual physical appearance might have been due to a condition such as Apert Syndrome or Crouzon Syndrome,  and he appeared unusually short in the eSORN mug shot because he was wheelchair-bound.  The address in his eSORN entry indicated he was a resident of a nursing home, and his court docket reported that he was sentenced in 1998 to 30 days in jail with another 5 years probation for Gross Sexual Imposition, which is defined in Ohio as  \"unwilling sexual contact with one who is not one's spouse.\"", "<!--court docket-->", "<!--", "Although the setting of the photograph does not look what one might expect of a mug shot taken for a sex offender registry listing, informal pictures taken in police station cubicles and rooms are often used for such purposes, as evidenced by  other photographs in the Lucas County sex offender registry:", "We've also heard from several people who live in or near Lucas County and claim they've encountered Brian Peppers in the past.  One of them told us he had a relative who attended school with Peppers and forwarded us some high school yearbook photos to document it:", "-->", "Brian Peppers passed away in February 2012 at the age of 43.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]