["This post, which features a photo of Kotelawala Defence University Hospital, was published on Facebook on March 29, 2020. It has been shared more than 2900 times.", "Below is a screenshot of the misleading Facebook post:", "The Sinhala-language text superimposed on the image translates to English as: “Kotelawala University hospital reserved for infected VIPs!... What would be valuable is to reserve such a hospital for the health and security sectors who are working tirelessly in this hour to eradicate corona…. It shouldn’t be given to political thieves known as VIPs. They run to Singapore even for a mild cough and if this devastation had only affected Sri Lanka, would have already fled the country to another to spend time in enjoyment. ”", "The post’s Sinhala-language caption reads: “They must have already been reserved by now...”", "A similar claim was also made on Facebook here, here, here and here.", "The claim is misleading; Sri Lankan military officials and the Kotelawala Defence University Hospital director said the hospital will be open to all COVID-19 patients.", "Dr. Seetha Arambepola, a member of the Presidential Task Force appointed to overlook the country’s response to COVID-19, told AFP by telephone on March 30, 2020 that the claim was “inaccurate”.", "She said: “The KDU hospital has been identified among many other hospitals to be prepared to accommodate patients - particularly patients who require intensive care - if the need arises. However, currently there are only seven patients receiving intensive care treatments and the facilities at the Infectious Diseases Hospital more than suffice. But we believe in being prepared so several other hospital ICUs were also prepped.", "“There will be absolutely no reservation of facilities exclusively for VIPs - all available resources and facilities will be deployed as and when the need arises without any discrimination.”", "Sri Lanka Army spokesperson Brigadier Chandana Wickramasinghe also told AFP that the military hospital will treat all COVID-19 patients.", "“We are preparing for every scenario and caring for the patients will be the top priority irrelevant of whether or not they are VIPs,” he said.", "On March 29, 2020, Kotelawala Defence University Hospital’s director Dr. Jayantha Balawardana also addressed the misleading claim during a news programme on the Sri Lankan television channel ITN, calling it “a blatant lie”.", ">", "From the video’s 10-minute 55-second mark, Balawardana says: “I would like to state in no unclear terms, the claim that KDU is being prepared to accommodate VIP patients is a blatant lie. We prepared six ICU beds at the moment with the assistance of our doctors to be used when necessary. We are prepared to treat patients from anywhere in the country if the need arises.”", "As of April 2, 2020, COVID-19 has killed three people and infected 148 others in Sri Lanka, according to Sri Lanka's state-run Health Promotion Bureau live dashboard.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]