["“Canada is going to take in more than 3 million new immigrants in this year,” claims the headline of an article shared more than 6,000 times.", "However, the Canadian government has no such plan.", "“In 2020, Canada plans on welcoming about 341,000 immigrants, not 3,000,000,” Rémi Larivière, a spokesman for Immigration, Refugees and Citizenship Canada (IRCC), told AFP in an email.", "IRCC, Canada’s immigration agency, defined the target in its 2019-2021 plan, which called for a gradual increase in the number of accepted permanent residents from 310,000 in 2019, to 350,000 in 2021. The largest part of the increase will be granted to economic immigrants, including people who qualify for skilled worker programs, at around 72 percent, according to Lariviere. Other immigration categories focus on reuniting families and resettling refugees.", "In 2019, the set target for permanent residents was 330,000. The actual number ended up being 341,180. Permanent residency, Canada’s green card equivalent, is granted to immigrants who will stay in Canada indefinitely, as opposed to seasonal labourers, students or tourists.", "Identical versions of the article were published at the same time on four different websites: Canada-eh.info; Canadians Daily, Toronto-Ontario.news, and Canada 1867. All four websites have visually similar layouts, and AFP FactCheck has debunked two of them several times in the past.", "Canada 1867’s Facebook page is administered by three people in Kosovo, according to the page’s transparency information.", "Buzzfeed News reported in August 2019 that Facebook page transparency information at the time for Canada Eh? also showed administrators in Kosovo.", "Page administrators did not respond to AFP’s requests for comments by the time of publication.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]