["As a winter storm blanketed Texas in snow and a deep freeze last week, the state’s main electricity provider instituted rolling blackouts as it struggled to generate enough power to handle the increased load.", "Posts circulating on social media falsely claim, though, that the Electric Reliability Council of Texas didn’t have all of the resources it needed because the U.S. Department of Energy denied ERCOT’s request for electricity generators to exceed emissions limits under federal permits.", "The claim, posted Feb. 20 by InfoWars and by multiple Facebook users, places the blame squarely on President Joe Biden and acting DOE Secretary David Huizenga who, it says, “blocked Texas from increasing power ahead of a killer storm.”", "More:Texas politicians saw electricity deregulation as a better future. Years later, millions lost power.", "The order included on those posts, however, shows Huizenga granted ERCOT’s request just before 9 p.m. on Feb. 14.", "InfoWars did not immediately respond to a request for comment.", "ERCOT’s Feb. 14 letter to DOE described an historic winter storm that would bring with it record winter electricity demand. Its own meteorologist had warned “this period will go down in Texas weather history as one of the most extreme events to ever impact the state.”", "For that reason, ERCOT asked the department for authorization for “all electric generating units” that are part of its network “to operate up to their maximum generation output levels under the limited circumstances described in this letter, notwithstanding air quality of other permit limitations.”", "Three power agencies told ERCOT that operating for maximum output would push them over limits set in federal permits for emissions of nitrogen oxide, carbon monoxide, sulfur dioxide, mercury along with release of wastewater, according to the letter.", "ERCOT asked for leeway on those limits during its energy emergency, which expired on Feb. 19. It described its request as “narrowly tailored to allow only the exceedances that are necessary to ensure reliability over the next few days” and noted that power generated under the request would be the last used to fill its needs.", "More:Family suing Texas utility companies for $100M after 11-year-old boy died amid power failure", "“ERCOT does not lightly request this authorization. It understands the importance of the environmental permit limits that are at issue. However, in ERCOT’s judgment, the loss of power to homes and local businesses in the areas affected by curtailments presents a far greater risk to public health and safety than the temporary exceedances of those permit limits that would be allowed under the requested order,” ERCOT wrote in its request.", "Fact check:Posts falsely claim Biden gave China control of U.S. power grid", "DOE’s order acknowledges that Texas’ shortage of electricity generation was an emergency that it was seeking to remedy.", "Huizenga wrote in the order that the department was granting the request because of that emergency and that it was limiting operation above the permitted level “to the times and within the parameters determined by ERCOT for reliability purposes” to “minimize adverse environmental impacts.”", "A list of power-generating units that the order applied to also was included and updated nine times while it was in effect.", "ERCOT acknowledged that the request had been granted, too. In a “market notice” sent late in the afternoon on Feb. 14, ERCOT wrote that Huizenga “granted ERCOT’s request” in the order.", "More:As some Texans see electric bills skyrocket, most should be spared pricing spikes", "The order required ERCOT to “exhaust all reasonably and practically available resources, including available imports, demand response, and identified behind-the-meter generation resources selected to minimize an increase in emissions, to the extent that such resources provide support to maintain grid reliability,” before allowing operators to exceed permit levels and operate at maximum capacity.", "That is consistent with ERCOT’s request, which noted that electricity generated from those operations would be the last resource tapped to address the shortage.", "In its order, DOE also required ERCOT to notify the department about additional facilities that would have to exceed environmental permit limits to generate enough power for the state. ERCOT also must write a report about the environmental impact of the emergency.", "\"On February 14, ERCOT formally requested the Department of Energy (DOE) issue an emergency order to address electric generation shortages in Texas caused by unprecedented cold weather conditions. Later that day, DOE approved a Section 202(c) emergency order that allowed specified power plants to generate up to their maximum capacity in order to manage the expected increase in electricity demand,\" said Kevin Liao, DOE press secretary, in an email.", "The claim that the U.S. Department of Energy denied ERCOT’s request to allow electricity generators to operate at maximum capacity in violation of federal environmental permits is FALSE. Records show that the department authorized the additional generation under the limited circumstances ERCOT requested Feb. 14.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]