["An alleged screenshot from a broadcast by news channel Aaj Tak has been making the rounds on social media the last few days. The Hindi headline in the viral image shows a purported statement by Uttar Pradesh Chief Minister Yogi Adityanath which reads, “Thakurs are hot-headed, they can make mistakes.” A Dalit woman was allegedly raped by four Thakur men in Hathras last month. The purported quote attempts to show the CM’s support to the accused. It is noteworthy that the alleged rape has sparked massive outrage in the country but there are also reports of hundreds of people from the Thakur community staging a counter-protest in support of the accused and demanding justice for them.", "ये है बनारस कांग्रेस का सबसे बङा वाहियात नेता अस्सी घाट पर लङकी छेङ रहा था लङकी से बहस हुई थी लङकी ने इसको करारा तमाचा…", "Posted by सैफरान राजेश सिंह on Saturday, 3 October 2020", "The screengrab is viral on Facebook.", "Congress leader Udit Raj also attributed the statement to Adityanath however, sans the Aaj Tak screenshot. He later took down his tweet (archive).", "A closer look at this screengrab shows that the font used on the Breaking News template looks different from the text on the bottom. The background colour behind the headline is also different. There are certain formatting issues which would otherwise not be present in a genuine broadcast. For example, there is no space after the comma or the colon in the headline.", "Moreover, a Google search does not throw any news reports claiming that Adityanath made the statement in question.", "Aaj Tak’s fact-check wing had examined the screenshot and concluded that it was fake. The channel revealed that the viral image was made using a Breaking News graphic aired on the evening of October 2. Aaj Tak had tweeted a video of the genuine news update containing the unedited screenshot. This appears at the 56-second mark.", "Therefore, social media claims that Yogi Adityanath gave a statement in support of the accused in the Hathras case is false. This is not the first instance where screenshots of news broadcasts were edited to spread misinformation.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]