["About this rating", "During the 2016 presidential campaign, Republican candidate Donald Trump became notorious for making inflammatory comments or assertions.  Trump's stances on Mexico (that \"rapists\" are crossing the southern border in droves, for example) provoked outcries and demonstrations across the United States.", "In June 2016, Trump repeatedly said that a federal judge presiding over the Trump University case, U.S. District Judge Gonzalo Curiel, may have a biased perspective because of his Mexican heritage (Curiel is American, but born to Mexican immigrants in the state of Indiana).", "The lawsuit brought against Trump University says that while the school claimed to teach Donald Trump's real estate strategies and techniques, it was actually an unlicensed and illegal school, and a thinly-veiled scam to sell high-priced seminars.", "In an interview with CNN, Trump alluded to Curiel's alleged involvement with a \"very pro-Mexican\" group:", "\"I have had horrible rulings, I have been treated unfairly by this judge,\" said Friday. \"Now this judge is of Mexican heritage, I'm building a wall.\"", "\"He's a member of a society, where you know, very pro-Mexico and that's fine, it's all fine,\" Trump continued. \"But I think he could recuse himself.\"", "While Trump did not mention any group by name, his spokeswoman identified the group as the La Raza Lawyers Association:", "Trump spokeswoman Katrina Pierson on Monday said that Judge Gonzalo Curiel had been member of a group that has been overtly against her candidate.", "\"I think what's really interesting about this particular judge — as Mr. Trump refers to him as a 'Trump hater' — is he even mentions on his judicial questionnaire that he was a La Raza Lawyers Association member,\" Pierson said in an interview on CNN.", "While Curiel is indeed a member of the San Diego La Raza Lawyers Association, several conservative pundits, politicians, and supporters of the Republican presidential candidate accused the federal judge of being a member of a different organization with \"La Raza\" in its name: the National Council of La Raza, a civil rights organization that advocates for (among other things) immigration reform and better opportunities for Latino families.", "Luis Osuna, president of the La Raza Lawyers Association, confirmed to the Washington Post that these two organizations are not connected:", "“The only tie that we have is that we serve the Latino community, and they do as well,” said Luis Osuna, president of the lawyers association. “But they’re a politically driven advocacy group, and we’re just a local diversity Bar association that focuses on both diversity and equality in the legal field, but particularly among Latinos.”", "However, neither the NCLR nor the La Raza Lawyers Association could accurately be described as \"radical\" or equated with the Ku Klux Klan. The NCLR has actively worked for immigration reform and is a nonpartisan civil rights group, not a hate group. In fact, on 6 June 2016, NCLR president Janet Murguía released a statement condemning the violence at Trump's rally in San Diego and informing protesters that \"violence is never the answer\":", "“People have a right to be angry. We’re angry too. But violence is never the answer.” That is my message to the protesters who engaged in violent acts at a Donald Trump rally in San Jose last week. Due to that troubling incident and Trump’s despicable attack on U.S. District Judge Gonzalo Curiel, a lot of misinformation about NCLR—and the Latino community in general—is being pushed out by people who know nothing about my organization. I would like to clear up a few things.", "First, NCLR does not condone and has never called for violence in our 50-year history as an American institution. We do believe in the right to engage in civil and nonviolent protest. We, ourselves, at NCLR have marched; we have fasted; we have picketed; and we have boycotted, but always in a dignified manner that is well in line with American values.", "In addition, anyone familiar with our history would know that it is a true affront to assert that NCLR has any association with violence. My predecessor, Raul Yzaguirre, served as a volunteer at the March on Washington in 1963 and marched with Dr. Martin Luther King, Jr. We worked with Cesar Chavez and continue to work with the organization he founded, the United Farm Workers. These civil rights icons and paragons of nonviolent protest have been our guide stars throughout our history.", "Finally, NCLR has not called for nor participated in protests at any candidates’ events, including Donald Trump’s. Since the term “La Raza” is a nod to our common heritage, many, many groups share our name, but we are all separate, unaffiliated organizations. We want people to exercise their right and obligation to engage in our nation’s political process. But we want them to engage constructively and effectively.", "The NCLR is not a \"radical\" group similar to the Ku Klux Klan and U.S. District Judge Gonzalo Curiel is not the \"grand master,\" or affiliated in any way, with this group. The San Diego La Raza Lawyers Association (of which Curiel actually is a member) is one of more than a dozen affiliates of the California La Raza Lawyers Association, and not an outlier group:", "Formed in 1979, with a handful of Latino attorneys, San Diego La Raza Lawyers Association (SDLRLA) has grown to represent over three hundred Latino and Latina lawyers practicing in San Diego County. SDLRLA is one of 18 affiliate bar associations of the California La Raza Lawyers Association, which serves several thousand Latino lawyers practicing in the State of California.", "Our purpose is to advance the cause of equality, empowerment and justice for Latino attorneys and the Latino community in San Diego County through service and advocacy. We are dedicated to promoting diversity on both the bench and bar. We support law students with mentorship programs and scholarships.", "Accusations that the National Council of La Raza and the La Raza Lawyers Association are akin to the Ku Klux Klan seem to hinge on a mistranslation of \"la raza.\" While \"la raza\" does mean \"the race,\" the San Diego La Raza Lawyers Association noted that this is not the only translation:", "Many people incorrectly translate the name, “La Raza,” as “the race.” While it is true that one meaning of “raza” in Spanish is indeed “race,” in Spanish, as in English and any other language, words can and do have multiple meanings. As noted in several online dictionaries, “La Raza” means “the people” or “the community.”", "Translating our name as “the race” is not only inaccurate, it is factually incorrect. “Hispanic” is an ethnicity, not a race. As anyone who has ever met a Dominican American, Mexican American, or Spanish American can attest, Hispanics can be and are members of any and all races.", "The phrase \"La Raza\" is actually truncated from \"La Raza Cósmica,\" a phrase coined by politician and philosopher José Vasconcelos (also a former secretary of education and 1929 presidential candidate in Mexico) to describe the ideology that the mixture of ethnicities in the New World ushered in a new era of humanity characterized by love and inclusivity.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]