["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A conspiracy website advanced the false story of Democratic and CNN ties to the pipe bombs sent in the mail. (Screenshot)", "In the world of right-wing conspiracy fans, the series of bombs sent to former President Barack Obama, Hillary Clinton, CNN and other targets of President Donald Trump’s barbs is nothing more than a left-wing Democratic feint –– a false-flag operation designed to undermine Trump’s message.", "An outfit called Stranger Than Fiction News posted a video on its Facebook page Oct. 25. Over footage of a group of masked protestors burning an American flag, the post has the bold news headline \"‘MAGA bomber’ identified as former CNN employee who donated to heavily to Hillary Clinton.\" (The video matches an antifa flag burning in Portland, Ore.)", "The video had over 30,000 views, and if the comments are any guide, it reached a receptive audience. Comments included \"The Democratic Party is a terrorist organization,\" and \"The fake pipe bomb fiasco that has gripped America for the last two days is rapidly unraveling as a political hoax.\"", "A couple of people asked \"Is this for real?\"", "To which we say, no. This is pure, 100 percent certified fake news.", "The FBI’s latest statement (as of the time we published) says only that an 11th package was recovered in Florida, addressed to Sen. Cory Booker, D-N.J.", "There’s been no announcement of any suspects, much less a person with ties to CNN or the campaign of Hillary Clinton.", "Stranger Than Fiction News also promotes the false story of crisis actors who pretend to be grieving survivors after gun massacres .", "Take this as your daily dose of Pants on Fire fake news.", "Stranger Than Fiction News, Breaking news, Oct. 25, 2018", "Federal Bureau of Investigation, Statement on the FBI’s Investigation of Suspicious Packages, Oct. 26, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]