["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Before being required by the national health care reform, New Jersey expanded Medicaid coverage to certain low-income parents, but according to one assemblywoman, the state is not getting any federal matching funds in return.\n\nAssemblywoman Amy Handlin (R-Monmouth) made that claim in an April 4 opinion piece published in the Times of Trenton, criticizing the Patient Protection and Affordable Care Act enacted in 2010.\n\n\"The federal government is supposed to match what states spend on new enrollees,\" Handlin wrote. \"I have serious concerns about Washington’s ability to keep a promise, especially because it has already indicated New Jersey’s new enrollees aren’t entitled to federal funds.\"\n\nHandlin later continued: \"These new enrollees won’t qualify for the matching federal funds simply because we added them onto the rolls before 2014.\"\n\nThe assemblywoman’s claim is largely inaccurate, because the state is still receiving federal matching funds for these parents. But when the reform’s expanded Medicaid eligibility takes effect in January 2014, New Jersey is slated to receive half of the matching rate awarded to some other states.\n\nIn response to our findings, Handlin said in a statement: \"The point is that we are taking a significant hit just for doing the right thing ahead of the federal mandate. The taxpayers in states that waited will get double the federal benefit.\"\n\nHere’s what PolitiFact New Jersey found:\n\nOn a voluntary basis, New Jersey began providing Medicaid coverage for certain low-income parents in 2000 through its NJ FamilyCare program. Under health care reform, covering that population will be a requirement for all states.\n\nStarting in January 2014, states must provide coverage to adults under 65 years old with incomes below 133 percent of the federal poverty level. For instance, an individual with no children would qualify for Medicaid if the person earns less than $14,000 a year.\n\nNew Jersey currently receives a federal matching rate of 65 percent for that parent population, but since the state began covering this population before enactment of the reform law, the federal match will drop to 50 percent in January 2014, according to state officials.\n\nStates that did not previously cover parents will be eligible for a 100 percent match to support the expanded coverage -- double what New Jersey would be receiving, officials said.\n\n\"New Jersey has been in the forefront on expansion of parent coverage and we believe states that were early adopters are being penalized by the Affordable Care Act (ACA),\" according to an application submitted by the state in September to the U.S. Centers for Medicare & Medicaid Services.\n\nJennifer Velez, commissioner of the state Department of Human Services, told the Assembly Budget Committee last week that federal officials had denied the state’s request to immediately increase the match to 75 percent, and to 85 percent in 2014.\n\nNew Jersey officials are now awaiting an answer to their request for a 100 percent match starting in 2014, Velez said.\n\n\"Once they said no to the 75-85, right, our ask again was, ‘Will you consider our current parents -- at 65 percent match -- will you consider them ‘newly eligible’ in 2014,’ which would be matched at 100 percent, which is what other states will get who haven’t covered their parents,\" Velez told the committee members.\n\nFederal officials said last month a final rule on matching funds \"will follow as technical work with States on (Federal Medical Assistance Percentage) methodologies and income conversion continues.\"\n\nOur ruling\n\nIn an opinion piece in the Times of Trenton, Handlin claimed that federal officials \"already indicated New Jersey’s new enrollees aren’t entitled to federal funds\" and that \"new enrollees won’t qualify for the matching federal funds simply because we added them onto the rolls before 2014.\"\n\nBut the issue is not over whether matching funds will be granted, but how much. New Jersey currently receives a 65 percent match for certain low-income parents covered by the NJ FamilyCare program. That match is slated to drop to 50 percent, representing half of the rate to go to some other states.\n\nWe rate the statement Mostly False.", "To comment on this ruling, go to NJ.com.", "Times of Trenton, Opinion: Obama's health-care reform -- A big swing and a miss, April 4, 2012\n\nNew Jersey Department of Human Services, Commissioner Jennifer Velez's Testimony Before the State Assembly Budget Committee, April 4, 2012\n\nNew Jersey Department of Human Services, Section 1115 Demonstration Comprehensive Waiver, Sept. 9, 2011\n\nCongressional Research Service, Medicaid: The Federal Medical Assistance Percentage (FMAP), Sept. 24, 2010\n\nU.S. Centers for Medicare & Medicaid Services, Affordable Care Act: Eligibility Provisions, accessed April 4, 2012\n\nU.S. Centers for Medicare & Medicaid Services, Letter Regarding New Option for Coverage of Individuals under Medicaid, April 9, 2010\n\nTHOMAS, Health care reform regulations, accessed April 4, 2012\n\nThe Kaiser Commission on Medicaid and the Uninsured, Medicaid Coverage and Spending in Health Reform: National and State‐by‐State Results for Adults at or Below 133% FPL, May 2010\n\nAmerican Cancer Society, Affordable Care Act: Medicaid Financing, September 2010\n\nThe Henry J. Kaiser Family Foundation, Explaining Health Care Reform: Questions About Medicaid’s Role, April 2010\n\nThe Kaiser Commission on Medicaid and the Uninsured, Medicaid’s Optional Populations: Coverage and Benefits, February 2005\n\nRecording of April 4, 2012 Assembly Budget Committee meeting, accessed April 4-5, 2012\n\nPhone and e-mail interviews with Greg Volpe, spokesman for Assemblywoman Amy Handlin, April 4-5, 2012\n\nE-mail interview with Nicole Brossoie, spokeswoman for the New Jersey Department of Human Services, April 5, 2012\n\nE-mail interview with the U.S. Centers for Medicare & Medicaid Services press office, April 5, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]