["About this rating", "According to a statement from Blake’s lawyer, Harris met with Blake's family and told Blake on the phone that she is “proud of him and how he is working through his pain.” In July 2020, Blake was charged with third-degree sexual assault of his ex-girlfriend.", "Blake has not been tried or convicted of sexual assault.", "In September 2020, U.S. Sen. Kamala Harris, D-Calif., visited the family of Jacob Blake, a Black man shot in the back by police on Aug. 23 in Kenosha, Wisconsin. Harris, the Democratic vice presidential candidate, also spoke to Blake himself over the phone as he recovered in hospital from his injuries. Details about their conversation spread on the internet and drew censure as social media users learned Blake had previously been accused of sexual assault.", "Snopes readers shared a Facebook post, asking if Harris had indeed told Blake — a man who had committed \"rape,\" the meme claimed — that she was “proud of him.”", "The post read: \"Just so women are clear ... Kamala Harris went to see a man that raped a woman and told him she's proud of him!\"", "Blake was charged with third-degree sexual assault of his ex-girlfriend, but has not been tried or convicted. In July 2020, prosecutors in Kenosha, Wisconsin, successfully applied for an arrest warrant for Blake on charges of third-degree sexual assault, criminal trespass, and disorderly conduct, all of which were additionally designated as acts of domestic abuse. In Wisconsin, third-degree sexual assault is defined as: “Whoever has sexual intercourse with a person without the consent of that person is guilty of a Class G felony.”", "Snopes reported on Blake's sexual assault charges in more detail here. Since Blake has not been tried or convicted of the July 2020 charges, it is not yet known whether the Facebook post's claim that Blake \"raped a woman\" is accurate.", "On Aug. 23, 2020, the same woman who had filed the complaint against Blake that led to the sexual assault charges in July called 911 to report that Blake was at her home in Kenosha, according to interviews and records. Officials said that police responded to what they said was a domestic complaint and attempted to arrest Blake. Police initially attempted to use a Taser on him and also said Blake admitted to having a knife. Ben Crump, a lawyer for Blake’s family denied that Blake was carrying a knife and said he had been trying to break up a disturbance involving two women. Police shot Blake seven times in the back in front of his children. A neighbor recorded the shooting with a cellphone. Protests spread across Kenosha in the aftermath. Blake’s family said he was paralyzed from the waist down as a result of the shooting.", "Harris visited Blake’s family in early September and said she wanted to “express concern for their well-being” and “to let them know that they have support.” She added, “they’re an incredible family and what they’ve endured and they do it with such divinity and grace and you know they’re carrying the weight of a lot of voices on their shoulders.” Crump released a statement after Harris met the family and spoke to Blake on the phone.", "According to Crump: “In a moving moment, Jacob Jr. told Sen. Harris that he was proud of her, and the senator told Jacob that she was also proud of him and how he is working through his pain.”", "Since this is a secondhand account of the encounter, we have reached out to Harris' campaign to confirm what she said to Blake and will update this as we receive more information.", "We should note that Harris’ visit to Blake’s family took place after she criticized the police officers’ handling of the situation. In August she told NBC News that there should be a thorough investigation and based on what she saw in the video of the shooting, “the officer should be charged.” Harris added, “in America, we know these cases keep happening. And we have had too many Black men in America who have been the subject of this kind of conduct. And it's gotta stop.”", "Based on Crump's statement, Harris expressed that she was proud of Blake as he made his recovery. Given that Blake was also previously charged, but not convicted of sexual assault, we rate this claim as a “Mixture.”", "Kenosha County Circuit Court.   “State of Wisconsin vs. Jacob S. Blake — Criminal Complaint.”\r\n    6 July 2020.", "MacGuill, Dan.   \"Was Jacob Blake Charged With Raping a Child?\"\r\n    Snopes.   27 August 2020.", "Morales, Christina.   \"What We Know About the Shooting of Jacob Blake.\"\r\n   The New York Times.   10 September 2020.", "Rummier, Orion.   \"Kamala Harris Says Officer in Jacob Blake Shooting Should Be Charged.\"\r\n    Axios.   28 August 2020.", "Silverstein, Jason.   \"Kamala Harris Meets With Jacob Blake's Family in Wisconsin.\"\r\n   CBS News.  8 September 2020.", "Wisconsin State Legislature.   “Wisconsin Statutes, Section 940.225(3)(a) — Third Degree Sexual Assault.”\r\n    Accessed 15 September 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]