["Falsely attributed quotes on social media that target politicians have become a popular form of misinformation, particularly as the 2020 election season enters its final stretch.", "A phrase claiming to come from President Donald Trump that circulated in October 2015 is making the rounds again on social media platforms.", "The article, allegedly published Oct. 27, 2015, claims Trump, while in Indianapolis, said African Americans are \"lazy.\" The story does not reference a date or context for Trump speaking in that city.", "The social media post contains what appears to be a picture of the print version of the article, which has \"'Africans Are Lazy, Good At Sex, Theft,'\" as a headline, above a photo of Trump. The article quotes Trump as referring to Africans and African Americans interchangeably.", "“African Americans are very lazy,\" the article attributes to Trump. \"The best they can do is gallivanting around ghettoes, lamenting how they are discriminated. These are the people America doesn’t need. They are the enemies of progress. Look at African countries like Kenya for instance, those people are stealing from their own government and go to invest the money in foreign countries. From the government to opposition, they only qualify to be used as a case study whenever bad examples are required.\"", "The article also claims that Trump \"reiterated his promise to deport Africans especially those of Kenyan origin including their son (Barack) Obama.\"", "The story was republished by Nigerian and Zimbabwean websites, which cite a publication called Politica as the source,a fake news site, according to BBC News. All date the article Oct. 25 or Oct. 26 in 2015.", "Politica has since deleted the original article.", "Fact check:There's no evidence Donald Trump helped with 9/11 response", "The quote was attributed to Trump while he was campaigning for the White House.", "Trump did speak publicly on Oct. 25, 2015, when he appeared on CBS’ \"Face the Nation,\" CNN's \"State of the Union,\" and ABC's \"This Week.\"", "Trump was active on Twitter that day, describing his media appearances throughout the morning.", "Trump then said he would be traveling to New Hampshire that night for his appearance on NBC's \"Today\" show the next morning.", "Trump did not appear to make any public appearance in Indianapolis in October 2015.", "At that time, Trump was the front-runner for the GOP nomination for president, and comments such as those claimed would have gained national attention. A study by the New York Times showed that by March 2016, Trump was being covered by \"free media\" outlets more than twice as much as his Democratic rival, Hillary Clinton.", "As an example, national media outlets gave ample coverage to his June 2015 comments accusing Mexican immigrants of bringing \"drugs\" and \"crime\" to America, as well as calling them rapists.", "Fact check:Joe Biden has condemned protest-related violence all summer", "There is no evidence that Trump said \"'Some Africans are lazy fools only good at eating, lovemaking and stealing,'\" or any of the other comments in the news item quoted in the social media posts. We rate this claim as FALSE, because it is not supported by our research, and was debunked previously when it circulated in 2015.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]