["By Angelo Fichera", "Posted on April 12, 2019", "There is no evidence that Rep. Alexandria Ocasio-Cortez said “owning guns is not a right,” contrary to what a viral meme claims.", "Since joining Congress in January, Rep. Alexandria Ocasio-Cortez has used her position to support gun control measures — co-sponsoring legislation requiring universal background checks, for example, and advocating for bans on bump stocks and semi-automatic weapons. (She’s also no supporter of the National Rifle Association.)", "But there is no evidence that the freshman lawmaker said that gun ownership “is not a right,” despite a claim in popular posts shared throughout social media.", "“Owning guns is not a right, if it were a right it would be in the constitution,” reads the viral quote wrongly attributed to Ocasio-Cortez.", "We could find no record of Ocasio-Cortez ever making that statement. We did find, however, that as a candidate last year, she recognized the Second Amendment to the Constitution — which the Supreme Court has found “protects an individual right to possess a firearm unconnected with service in a militia, and to use that arm for traditionally lawful purposes, such as self-defense within the home.”", "On her 2018 campaign website, the New York Democrat said she supported “common-sense gun legislation,” citing New York as an example of a city with “tough gun laws” that don’t violate the Constitution. “Even in the United States, cities and states with strong gun laws have managed to cut gun violence significantly without running afoul of the Second Amendment,” her campaign platform read.", "Thousands of social media users have helped spread the false quote through repeated posts on Twitter and Facebook since at least January.", "The posts include a photo of Ocasio-Cortez from her interview with PBS in July, before she was elected to her seat in Congress.", "We wrote about one inaccurate claim she made during that interview — about the cause of low unemployment in the U.S. — but the interview transcript shows she didn’t make any claims about gun rights.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“Alexandria Ocasio-Cortez.” Firing Line with Margaret Hoover. PBS. 13 Jul 2018.", "“Alexandria Ocasio-Cortez’s Platform.” Ocasio2018.com. Accessed 12 Apr 2019.", "Berman, Corey, and Robert Farley. “Ocasio-Cortez Wrong on Cause of Low Unemployment.” FactCheck.org. 18 Jul 2018.", "Ocasio-Cortez, Alexandria (@AOC). “You know, instead of training children, teachers, houses of faith, & concertgoers to prep for being shot, we could just: -Pass Universal Background checks (#HR8!) -Disarm domestic abusers -Mandate safe storage -Ban bump stocks, semiautos, & high cap mags designed to kill people.” Twitter. 21 Mar 2019.", "U.S. House. “H.R.8, Bipartisan Background Checks Act of 2019.” (as passed by the House 27 Feb 2019.)", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]