["The video was published here on Facebook on February 19, 2021. It has been shared more than 1,800 times.", "The one-minute 32-second video shows smoke billowing from a fire in a car park. The video has embedded text stating “Clementi” in both English and simplified Chinese.", "Clementi is a town in the west region of Singapore.", "The video was also shared on Facebook here and here and YouTube here and here alongside a similar claim.", "The claim, however, is false.", "A reverse image search using keyframes generated using digital verification tool InVID-WeVerify and a subsequent keyword search found the same video featured in Malaysian news reports by Berita Harian and The Star.", "A subsequent keyword search on Google found this news report from Malaysian national news agency Bernama published on February 17, 2021. It is headlined: “Seven vehicles destroyed in parking lot fire”.", "Part of the article reads: “Seven vehicles in a parking area of a People's Housing Project (PPR) in Pantai Dalam, here, were destroyed in a fire today.", "“Brickfields district deputy police chief Supt Basri Sagoni said a team was deployed to the location at about 12.45pm after they received a report regarding the incident.", "“He said seven vehicles of various models were found burned in the car park area of the PPR and the fire forensics team who was also fetched to the location found a bottle smelling of petrol.\"", "The Malaysian police released this statement and photos about the incident.", "Translated from Malay, part of the statement reads: “On February 17, 2021, around 12.45pm, the Police received information regarding a case of arson resulting in fires to cars. A Malay woman alerted to the fire occurring at a (public) car park in the area of a PPR in Pantai Dalam, Kuala Lumpur. The Police went to the scene of the incident and as a result of the investigation, found as many as (7) vehicles of various brands had been burned. The case is investigated under Section 435 of the Penal Code.", "“The forensic team from the fire department present at the scene of the incident had found (1) bottle with petrol odor and traces of petrol splashed in front of a black Myvi car and a red colored van which is suspected to be the cause of the fire. As many as (5) specimens from the scene of the fire have been taken and will be brought to the laboratory for analysis for the true cause of the fire.\"", "Here is a Facebook post published on the same day which shared the video in the correct context.", "Below is a screenshot comparison of the video from the misleading Facebook post (L) and the video with the correct location (R):", "The same car park in Kuala Lumpur can be seen here on Google Maps.", "Below is a screenshot comparison between the video from the misleading Facebook post (L) and the location on Google Street View (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]