["By Robert Farley and Eugene Kiely", "Posted on April 19, 2019", "The Russia report released April 18 contradicts President Donald Trump’s claims that special counsel Robert Mueller had two conflicts of interest that prevented him from conducting an impartial investigation:", "According to the report, in the days after Mueller was appointed special counsel on May 17, 2017, Trump complained to advisers that Muller had conflicts of interest. Trump said those included that “Mueller had interviewed for the FBI Director position shortly before being appointed as Special Counsel, that he had worked for a law firm that represented people affiliated with the President, and that Mueller had disputed certain fees relating to his membership in a Trump golf course in Northern Virginia,” the report reads.", "According to the report, the president’s advisers — including then-White House Chief of Staff Reince Priebus, then-White House counsel Don McGahn and Bannon — “pushed back on his assertion of conflicts, telling the President they did not count as true conflicts.” Bannon told investigators that he “recalled telling the President that the purported conflicts were ‘ridiculous’ and that none of them was real or could come close to justifying precluding Mueller from serving as Special Counsel.”", "On May 23, 2017, shortly after Mueller was appointed special counsel, Justice Department ethics officials concluded it was “appropriate” for Mueller to lead the investigation even though his former law firm, WilmerHale, had represented Trump’s son-in-law, Jared Kushner; his daughter, Ivanka Trump; and Trump’s former campaign manager, Paul Manafort.", "Justice Department spokeswoman Sarah Isgur Flores noted that Mueller himself was not involved in representing Kushner, Manafort or Ivanka Trump. “Mr. Mueller is permitted to participate in matters involving his former firm’s clients so long as he has no confidential information about the client and did not participate in the representation,” she said.", "Nonetheless, the president repeatedly made public claims highlighting his other concerns about Mueller’s purported conflicts. Most recently, Trump made his case for Mueller’s conflicts in a speech at the 2019 Conservative Political Action Conference on March 3.", "Trump, March 3: But we have conflicts. I had a nasty business transaction with Robert Mueller a number of years ago. I said, why isn’t that mentioned? He wanted the job as FBI Director. I mean, these are things that are out there; they know it. Why isn’t that — and I didn’t give it to him. Why isn’t that mentioned?", "Trump detailed those same accusations during an interview with the Daily Caller last fall.", "Trump, Sept. 4, 2018: But I view it [the Mueller investigation] as being illegal for many reasons. Some of which are that, number one there was no crime and number two everybody was conflicted, including Mueller. There were, I mean tremendous conflicts here, you know the conflicts, you’ve heard the conflicts.", "Daily Caller: Speaking of one which you cited, I’d like to know, you said you interviewed Mueller for FBI director.", "Trump: Sitting right in that chair.", "Daily Caller: What did you think during the interview?", "Trump: I liked him, but I didn’t give him the job?", "Daily Caller: Why?", "Trump: But I had a business dispute with Mueller before that. I had a real business dispute.", "And during an interview on “Fox & Friends” last summer.", "Trump, Aug. 23, 2018: When you see Mueller with all the conflicts. He’s so conflicted. Comey’s his best friend. He had a really nasty business transaction with me, which he never reported. I’ve been talking about it; he never reports it. I mean, you look at the bad things. He wanted the FBI job, that Christopher Wray has.”", "And, of course, Trump has repeated the claim on Twitter.", "Is Robert Mueller ever going to release his conflicts of interest with respect to President Trump, including the fact that we had a very nasty & contentious business relationship, I turned him down to head the FBI (one day before appointment as S.C.) & Comey is his close friend..", "— Donald J. Trump (@realDonaldTrump) July 29, 2018", "FBI Director James Comey was fired on May 9, 2017, and the administration set out quickly to find his replacement in what turned out to be a very public vetting process.", "On May 12, 2017, Politico reported that four people — acting FBI Director Andrew McCabe, Sen. John Cornyn of Texas, former Justice Department Criminal Division Chief Alice Fisher and former U.S. Attorney in Manhattan Michael Garcia — were set to be interviewed the next day. “Henry E. Hudson, U.S. District Court Judge for the Eastern District of Virginia, Fran Townsend, former Homeland Security Adviser to former President George W. Bush, and Mike Rogers, the former chairman of the House Intelligence Committee, were also interviewed,” the story said.", "Similarly, the Washington Post and Bloomberg each named eight people who were interviewed on May 14, 2017. PBS listed 14 possible candidates for the job.", "But there was no media mention of Mueller at that time.", "But according to Trump, after he fired Comey, Mueller came to him to interview for the director’s position — a job that Mueller held for 12 years until he retired in 2013 — but Trump says he turned him down. According to Trump, Mueller “wanted the job … and I didn’t give it to him.”", "That narrative was echoed by an unnamed White House official in June of 2017, as reported by CNN and others.", "In an interview on June 15, 2017, White House Press Secretary Sarah Sanders was asked about the meeting between Trump and Mueller. She said it was her understanding that it was a job interview on the day before Mueller was named as special counsel, though she wasn’t aware of whether it was for acting or permanent FBI director. Sanders did not answer the question about why the administration hadn’t mentioned him as a possible candidate, as it did with others.", "Bannon, however, has a different recollection of events.", "In an interview with investigators, “Bannon recalled that the White House had invited Mueller to speak to the President to offer a perspective on the institution of the FBI. Bannon said that, although the White House thought about beseeching Mueller to become Director again, he did not come in looking for the job.”", "In other words, Bannon says Mueller did not come to the White House for a job interview. And it was the White House, not Mueller, that was considering wooing Mueller into taking the job.", "We reached out to Peter Carr, a spokesman for the special counsel, for more details about what actually took place at the meeting, whether it was an interview, and whether Mueller was seeking the director job. “We’ll decline comment beyond the report,” Carr said.", "Trump also claimed that Mueller had a conflict because the two men had a “very nasty & contentious business relationship” regarding Mueller’s membership fees at the Trump National Golf Club in Sterling, Virginia. Through a spokesman, Mueller has denied that there was a dispute.", "“Mr. Mueller left the club in October 2011 without dispute,” special counsel spokesman Joshua Stueve told DailyMail.com in July 2017.", "Mueller’s report provides some details on how and why Mueller left the club — but none of it suggests that the two men had a “very nasty & contentious business relationship.”", "According to the report, Mueller informed the club in a letter on Oct. 12, 2011, that he would no longer be a member. The letter “noted that ‘we live in the District and find that we are unable to make full use of the Club’ and that inquired ‘whether we would be entitled to a refund of a portion of our initial membership fee,’ which was paid in 1994,” the report said.", "“About two weeks later, the controller of the club responded that the Muellers’ resignation would be effective October 31, 2011, and that they would be ‘placed on a waitlist to be refunded on a first resigned/first refunded basis’ in accordance with the club’s legal documents,” the report said. “The Muellers have not had further contact with the club.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]