["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "That didn’t happen. The video was edited to create a deceiving and inaccurate narrative.", "The original video from 2011 involved an interview with Harry Belafonte.", "The fabricated video used a clip of Biden from an April town hall. Biden did not fall asleep then, either.", "Have you seen on Facebook that video of a TV reporter telling Democratic presidential nominee Joe Biden to \"wake up, wake up,\" while Biden slumbers and snores on camera?", "Well, wake up, wake up: That never happened. This video was edited to create a false narrative.", "The 29-second video features a split screen, a reporter on the left and Biden on the right. The reporter at the beginning says: \"Joining us live this morning from New York, hey good morning.\"", "A few quick things wrong with the start of that clip: it cuts out key words the reporter said, namely that she was addressing singer, songwriter and activist Harry Belafonte:", "\"Harry Belafonte joining us live this morning from New York, hey good morning, Harry,\" she said.", "Also, the Belafonte interview happened in 2011, and Biden had nothing to do with it.", "The Facebook post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Dan Scavino, President Donald Trump’s deputy chief of staff for communications, on Aug. 30 tweeted the deceptive video from his personal account.", "John Dabkovich, a news anchor in California, tweeted on Aug. 31 that Scavino’s video was inaccurate: \"This is fake. You know how I know? I was the coanchor in studio. We were interviewing Harry Belafonte.\" In a follow-up tweet, Dabkovich tweeted a link to the original video from nearly a decade ago.", "(Description for the 2011 video says: Was legendary actor and singer Harry Belafonte asleep during a live satellite interview Friday morning with Eyewitness News? His publicist says no.\")", "Twitter flagged Scavino’s post as manipulated media.", "The fabricated video has text toward the bottom of the screen that falsely says: \"On air: Joe Biden | The importance of this election.\" The original video with Belafonte, of course, did not have that text. The manipulated video also includes snoring sound effects that didn’t come from either Belafonte or Biden.", "As the Associated Press reported, the Biden clip is from an April town hall on COVID-19 with 2016 Democratic presidential nominee Hillary Clinton. Biden didn’t fall asleep there, either. The doctored video pulled from a point in the interview when Biden was looking down. He later looked up. A social media user told the Associated Press he created the altered video.", "A Facebook post claims Biden was asleep and snoring during a TV interview.", "That didn’t happen. The video was edited to create a deceiving and inaccurate narrative.", "We rate it Pants on Fire!", "Archive of Facebook post with manipulated video, Aug. 31, 2020", "YouTube, KBAK - KBFX - Eyewitness News - BakersfieldNow - Official Station Video: Is Harry Belafonte asleep during live TV interview?, Oct. 18, 2011", "YouTube, Women's Town Hall on COVID-19 ft. Hillary Clinton | Joe Biden For President, April 28, 2020", "Associated Press, Video altered to suggest Biden fell asleep in interview, Aug. 31, 2020", "Twitter, @DanScavino tweet, Aug. 30, 2020; Twitter’s \"manipulated media\" tag on Scavino’s tweet", "Twitter, @JohnDabkovich tweet, Aug. 31, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]