["About this rating", "In April 2020, Facebook posts circulating online offered coupons supposedly good for two free large pizzas from the Domino's pizza chain:", "Users who clicked on the offer were taken to an external website where they were instructed to answer survey questions in order to receive their coupons:", "After completing the questionnaire, however, users were then required to click a button to share the \"offer\" with their Facebook friends before they could retrieve their coupons. Those who complied by spamming their friends were then allowed to click a \"Receive the Coupon\" button, but there was no actual coupon to receive.", "Like innumerable other \"free merchandise\" offers on Facebook, this offer was another variation of a common scam.", "We've had many occasions to alert readers to this kind of fraud:", "These types of viral “coupon” scams often involve websites and social media pages set up to mimic those of legitimate companies. Users who respond to those fake offers are required to share a website link or social media post in order to spread the scam more widely and lure in additional victims. Then those users are presented with a “survey” that extracts personal information such as email addresses, telephone numbers, dates of birth, and even sometimes credit card numbers. Finally, those who want to claim their “free” gift cards or coupons eventually learn they must first sign up to purchase a number of costly goods, services, or subscriptions.", "The Better Business Bureau offers consumers several general tips to avoid getting scammed:", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]