["About this rating", "On 1 August 2017, Golf magazine reported that President Trump had told people at his New Jersey golf club that the White House was a \"real dump.\" Although Trump denied that he ever said such a thing, calling the report \"fake news,\" a number of outlets rushed to blame the alleged dumpiness of the White House on Trump's predecessor, Barack Obama.", "The stories, published under headlines like \"Obama Left Trump A White House Full Of Roaches,\" were largely based on a 2013 report published by The National Journal entitled \"Bugged: Obama's Roach Problem.\"", "Freedom Daily even claimed that the Obamas \"brought\" the cockroaches to the White House:", "Apparently the Obamas brought more to the White House besides just their crappy anti-American attitudes, as the roach and rodent problem was so severe under Obama’s presidency, that multiple stories were written about it online.", "Freedom Daily provided three links following the \"multiple stories\" claim, but two of those links redirected to the same 2013 report (one version published in The National Journal, the other reproduced in The Atlantic), and the the third redirected to an aggregated version of the original article.", "It's also disingenuous to suggest that Obama brought cockroaches to the White House or that his cleanliness contributed to the bug problem (this rumor is often associated with Obama's ethnicity, racial slurs, and ignorance). In fact, the web sites which quoted this 2013 article to blame President Obama for a roach infestation at the White House must have not read it very carefully, as the article simply used a single cockroach sighting at the White House as a launching off point to talk about various infestations that have plagued the residence over its more than 200-year history.", "President Jimmy Carter, for instance, battled mice during his tenure in the West Wing, and former First Lady Barbara Bush had at least one run-in with a rat:", "It is, of course, not the first time bugs or vermin have done battle with the humans who work in the 213-year-old building. Humans have not always prevailed easily \"“ [sic] much to the deep frustration sometimes of the president of the United States. None was more frustrated than Jimmy Carter, who battled mice from the start of his administration. To his dismay, he found the bureaucracy unresponsive. GSA, responsible for inside the White House, insisted it had eliminated all \"inside\" mice and contended any new mice must have come from the outside, meaning, the New York Times reported at the time, they were \"the responsibility of the Interior Department.\" But Interior, wrote the Times, \"demurred\" because the mice were now inside the White House.", "[...]", "His fury was captured in his diary entry for Sept. 9, 1977. Carter that day summoned top officials from the White House, the Department of Interior and the GSA to the Oval Office to unload on them about the mice overrunning the executive offices \"“ [sic] including the dead ones rotting away inside the walls of the Oval Office and giving his office a very unpleasant odor. \"For two or three months now I've been telling them to get rid of the mice,\" Carter wrote. \"They still seem to be growing in numbers, and I am determined either to fire somebody or get the mice cleared out \"“ or both.\"", "The book Real Life at the White House: Two Hundred Years of Daily Life at America's Most Famous Residence also documented various bug problems at the White House stemming back to its construction. In a passage about President Grover Cleveland and First Lady Frances Cleveland's impressions of the White House, the author writes:", "The mansion was also infested with all manner of undesirable creatures. The infamous White house rats remained plentiful. Frances kept a canary in a cage by her window, and one day a servant came around just as a big rat that had forced its way into the cage was about to devour the bird. Spiders were even more abundant - one estimate put the building's population at one million. When the outside of the house was hosed down during a cleaning, a shower of spiders blanked the ground. That evening, the white columns were black with them as they crawled back from whence they came. And then there were the cockroaches. One staff member said, \"I didn't know there were so many species of cockroaches as I got acquainted with my daily work.", "We also have not been able to find any reports documenting a roach infestation at the White House in 2017. Recent reports from The Washington Post and Politico concerning renovations at the White House noted that the Trump administration has had to deal with a large number of flies (another common White House problem), but the report made no mention of roaches:", "Bug zappers buzz in the West Wing while flies zip around. The yellow carpet is worn, and it can sometimes be difficult to work in parts of the White House because it fills with fumes when Marine One lands or takes off on the lawn of America’s most famous home.", "Some White House aides claim to have seen rodents, and say they’re used to having maintenance professionals moving around their work space to do work on the air conditioning system, which hasn’t been overhauled in more than 20 years.", "It is not surprising that the White House would have vermin infestations, given that Washington, D.C. has a high population of mice and rats, and a fair amount of cockroaches -- which can be observed on summer evenings on sidewalks all over the city. The fact someone saw a roach in the White House in September 2013 has nothing to do with Obama's level of cleanliness. The only surprising thing about the finding -- given the city's relative roachiness -- is that there was just one.", "Selk, Avi.   \"White House to Become Less ‘Dump’-Like in Trump’s Absence.\"\r\n    Washington Post.   6 August 2017.", "Palmeri, Tara.   \"Life in the West Wing: Bug Zappers and Helicopter Fumes.\"\r\n    Politico.   3 August 2017.", "Whitcom, John.   \"Real Life at the White House: Two Hundred Years of Daily Life at America's Most Famous Residence.\"\r\n    Psychology Press.   2002.", "Leibovich, Mark.   \"What Has 132 Rooms and Flies?\"\r\n    New York Times.   17 June 2009.", "Shipnuck, Alan.   \"First Golfer: Donald Trump's Relationship with Golf has Never Been More Complicated.\"\r\n    Golf.   1 August 2017.", "Condon, George.   \"Bugged: Obama's Roach Problem.\"\r\n    The Atlantic.   13 September 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]