["About this rating", "In 2014, weather reporter Évelyne Dhéliat of the TF1 television channel in France teamed up with the World Meteorological Organization to create a series of fictional weather reports imagining what the weather will be like in the summer of 2050. While these reports may have seemed far-fetched at first, a June 2019 heat wave across Europe showed that these temperatures are well within the realm of possibility.", "In July 2019, an image graphic that supposedly compared the fictional 2050 weather map with a recent weather map from the June 2019 heat wave started going viral on social media (note: 40 degrees Celsius is approximately 104 degrees Fahrenheit):", "One popular posting of this image comparison was accompanied by the caption, \"The top image is a fictitious weather report imagining what the weather would be like in 2050 for a 2014 French TV documentary about climate change. The bottom image is the real weather report from last week.\"", "This caption is largely accurate, with the exception of the relative temporal term \"last week.\" According to LCI television weather presenter Guillaume Woznica, the bottom portion of this image graphic dates from the end of June 2019:", "⚠️ En 2014, Évelyne Dhéliat présentait un bulletin météo fictif d’un jour d’été de 2050... En milieu de semaine, la fiction rattrapera la réalité ! Les #températures pour cette #canicule de fin juin 2019 seront très très proches de celles affichées sur ces cartes... #chaleur @LCI pic.twitter.com/GwCUamnqMY", "— Guillaume Woznica (@GWoznica) June 22, 2019", "The original 2050 prediction video can be viewed below. The still included in the viral comparison can be seen around the 1:40 mark:", "In June 2019, the French magazine L'Obs created a video that showed these two weather reports side-by-side:", "TF1, France 2, M6, BMF TV ou encore CNews : tous les bulletins météo annonçant les températures caniculaires prévues cette dernière semaine de juin 2019 emploient le même vocabulaire alarmiste. Le thermomètre va dépasser les 40 degrés dans certaines villes de France, et les températures ressenties pourraient dépasser les 48 degrés à cause de l’humidité. Ces prévisions font écho à un certain bulletin météo daté du 18 août 2050… Une météo futuriste présentée par Evelyne Dhéliat, dans le cadre d’une campagne contre le réchauffement climatique, il y a cinq ans. « L’Obs » les a mis en parallèle. Regardez.", "TF1, France 2, M6, BMF TV or CNews: all the weather reports announcing the heat waves expected this last week of June 2019 use the same alarmist vocabulary. The thermometer will exceed 40 degrees in some cities of France, and temperatures felt could exceed 48 degrees because of humidity. These forecasts echo a certain weather report dated August 18, 2050 ... A futuristic weather presented by Evelyne Dheliat, as part of a campaign against global warming, five years ago. \"The Obs\" has put them in parallel. Look.", "This image comparison is frequently shared along with comments or concerns about global warming. While this comparison certainly relates to climate change, it may not be the best example. After all, this graphic merely compares two single points in time (one of which was a prediction, the other from an unusually hot time period), which is not enough to illustrate any type of long-term weather trends.", "However, climate scientists have found that heat waves will become more common due to climate change.", "Ducharme, Jamie.   \"Scientists Predict Climate Change Will Make Dangerous Heat Waves Far More Common.\"\r\n    Time.   16 July 2019.", "Le Perisien.   \"Evelyne Dhéliat Veut Provoquer un Déclic.\"\r\n    11 December 2014.", "Moreau, Sarah.   \"PHOTOS. Évelyne Dhéliat: Son Bulletin Météo Futuriste Daté De 2050 Devient Réalité.\"\r\n    Telestar. 24 June 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]