["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former President Barack Obama, accompanied by Secretary of State John Kerry, meets with veterans and Gold Star Mothers to discuss the Iran nuclear deal in the Roosevelt Room at the White House in Washington on Sept. 10, 2015. (File/AP)", "Amid media reports that President Donald Trump’s son-in-law Jared Kushner sought secret \"back-channel\" communications with Russia before Trump’s inauguration, some conservative commentators say outraged liberals have a short memory.", "They say Barack Obama did pretty much the same thing during the 2008 presidential campaign, secretly sending former Ambassador to Ukraine William Miller to Iran. Like Kushner, they say, Obama went around the existing administration to forge his own diplomatic path with a foreign adversary.", "\"Let me set the scene for you. It's 2008, we are having an election, and candidate Obama, he's not even president-elect, sends William Miller over to Iran to establish a back channel and let the Iranians know that should he win the election, they will have friendlier terms,\" Wall Street Journal columnist Kimberley Strassel said on NBC’s Meet the Press on May 28.", "Candidate Obama faced criticism for saying he would talk to Iranian leaders as president. And after he took office, his administration pursued back-channel communications — meaning secret dialogue outside normal diplomatic processes — with Iran as part of achieving the nuclear deal. Journalists reported on those processes extensively.", "We were intrigued by the claim that Obama sought secret communication channels with Iran before he even won the 2008 election. When we started to dig into it, we were surprised to find that the evidence supporting that narrative is slim and ultimately insufficient.", "As far as we can tell, this allegation stems solely from the commentary of Michael Ledeen, a conservative Iran and Iraq expert at the Foundation for Defense of Democracies and a critic of Obama’s foreign policy.", "Ledeen was also a national security consultant to President Ronald Reagan’s administration. He recently co-authored a book with Trump’s ousted National Security Adviser Michael Flynn, The Field of Fight: How We Can Win the Global War Against Radical Islam and Its Allies.", "Strassel hasn’t replied to our requests for comment, but she defended her comment on Twitter by citing Ledeen’s work.", "By Ledeen’s account, Miller told him that Obama sent him to Tehran in 2008. Ledeen has made this claim a number of times since at least 2013, in blog posts, on conservative talk radio, on Twitter in prepared remarks, and in a phone interview with PolitiFact June 1.", "\"During his first presidential campaign in 2008, Mr. Obama used a secret back channel to Tehran to assure the mullahs that he was a friend of the Islamic Republic, and that they would be very happy with his policies,\" Ledeen wrote in 2014 for conservative website PJ Media. \"The secret channel was Ambassador William G. Miller, who served in Iran during the shah's rule, as chief of staff for the Senate Select Committee on Intelligence, and as ambassador to Ukraine. Ambassador Miller has confirmed to me his conversations with Iranian leaders during the 2008 campaign.\"", "We called up Miller. He said Ledeen’s claims are \"totally untrue.\"", "Miller told us that he supported Obama’s 2008 candidacy and knew some of the campaign’s foreign policy staff from his decades-long public service career, but he had no role in the campaign or the subsequent administration.", "Miller does have extensive experience with Iran, starting out as a diplomat there in the 1950s and 1960s. President Jimmy Carter chose Miller to be a lead negotiator during the 1979 hostage crisis, while Miller was serving as staff director of the Senate Select Committee on Intelligence. And as a private citizen, he played a role in the release of American hikers who were imprisoned in Iran from 2009-11.", "But \"the assertion that Obama sent me as an envoy is totally false,\" he said, adding that he’s met Ledeen a few times but doesn’t really know him. Miller said he travels frequently to Iran but didn’t in 2008.", "When we told Ledeen that Miller was telling a different story, Ledeen stood by his account.", "\"(Miller has) changed his mind,\" Ledeen said. \"He’s decided he didn’t go to Tehran.\"", "So either Ledeen or Miller isn’t telling the truth.", "We’re sensitive to the idea that someone who was involved in secret communications might not be forthcoming with us about those communications. But it’s also telling that there have been no independent news reports to corroborate Ledeen’s claims, given the extensive reporting on the Obama administration’s relations with Iran and negotiations over the nuclear deal.", "Marie Harf, who headed the State Department’s Iran nuclear negotiations communications strategy during Obama’s second term, said she hadn’t heard of these allegations until we called her.", "\"Never in my time at the State Department or working on Iran negotiations did any back channel prior to when we were in office come up,\" she said.", "Wall Street Journal foreign affairs reporter Jay Solomon, author of The Iran Wars, said he \"could never prove\" that Obama sought a back channel to Iran as a presidential candidate, but he can’t definitively say it didn’t happen.", "Like Solomon, National Iranian American Council President Trita Parsi never came across any evidence for the alleged back channel while researching either of his two books about the Obama administration’s relationship with Iran, including the upcoming Losing an Enemy: Obama, Iran and the Triumph of Diplomacy.", "Parsi questioned Ledeen’s credibility and said, \"At this point, I'm completely convinced this is all B.S.\"", "Strassel said that in 2008, Obama’s presidential campaign secretly sent former Ambassador William Miller to Iran to talk with Iranian leaders.", "This is a case of he-said-she-said. A single conservative scholar says Miller told him about his secret ‘08 campaign mission to Iran. Independent journalists who have covered U.S.-Iran relations extensively haven’t been able to confirm the account. There is no corroborating evidence, and Miller says it’s not true; he says he never worked on behalf of the Obama campaign, and he didn’t travel to Iran in 2008.", "At PolitiFact, we believe the burden is on the speaker to back up their claim with evidence. The evidence here is insufficient, so we rate this claim False.", "NBC, Meet the Press, May 28, 2017", "Huffington Post Canada, \"My Life as a Secret Back Channel in Iran,\" Dec. 4, 2013", "PJ Media, \"Obama's Latest Big Lie: 'We Have No Strategy,'\" Aug. 29, 2014", "PJ Media, \"Chamberlain, Washington-Style,\" May 16, 2016", "Frontpage Magazine, \"Michael Ledeen: Obama Carrying Out Iranian Foreign Policy,\" Nov. 25, 2015", "Mark Levin Show, Oct. 1, 2014", "Wall Street Journal, \"Secret Dealings With Iran Led to Nuclear Talks,\" June 28, 2015", "New York Times, \"How Obama’s Undercover Statecraft Secured Three Major Accords,\" Dec. 18, 2014", "Washington Post, \"The Omani ‘back channel’ to Iran and the secrecy surrounding the nuclear deal,\" June 7, 2016", "Associated Press, \"How a series of secret meetings between U.S. and Iran led to historic agreement,\" Nov. 25, 2013", "PolitiFact, \"He has said it again and again,\" May 21, 2008", "Phone interview, former State Department spokesperson Marie Harf, May 30, 2017", "Phone interview, former Ambassador William Miller, May 31, 2017", "Phone interview, Foundation for the Defense of Democracies scholar Michael Ledeen, June 1, 2017", "Email interview, Wall Street Journal reporter Jay Solomon, May 31, 2017", "Email interview, National Iranian American Council President Trita Parsi, May 31, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]