["About this rating", "A constituent-only hotline will connect calls from individuals in Speaker Ryan's home district but no others.", "Fax numbers appear to connect normally, and we found no evidence that all telephone calls to his office were being blocked.", "In January 2017, a viral message began spreading on social platforms, carrying the rumor that House Speaker Paul Ryan had blocked his phone and fax lines from receiving calls and documents:", "The instructions of the message were somewhat self-perpetuating, potentially inducing social media users to try calling the phone numbers for Speaker Ryan's office and thereby overload those phone lines, thus making it more difficult for others trying to call in (and fostering the impression among those unsuccessful callers that the phone lines had  indeed been disabled and encouraging them to spread a social media message that further strained Ryan's office phone lines).", "First, we tried calling Ryan's constituent hotline, three satellite office numbers, and his main Washington, D.C. switchboard extension. The first returned a message stating that the number was accessible only to individuals in a certain area, likely only those calling from numbers that correspond to residents of his home district. The other lines generated busy signals, which was to be expected given that this rumor has been so popular. The message claimed that Ryan's office lines had also rejected faxes, but we received normal connect responses from answering fax machines when we dialed those numbers.", "We reached a press contact for the House of Representatives, who told us that it is not possible for anyone there to switch off or otherwise block access to their switchboard lines. Although it is perhaps possible Ryan could have blocked open lines at his satellite offices, it is also likely that high call volume simply made them impossible to use.  We also tried to contact two members of Ryan's staff about the rumor (neither of their lines was busy) but have not yet received any response from them.", "Some media reports suggested Speaker Ryan had enlisted security guards to block the delivery of paper petitions to his office:", "[A] crowd of Planned Parenthood Action Fund supporters lined the halls of the Longworth House Office Building in Washington, D.C. to hand-deliver over 87,000 #StandWithPP petitions to Speaker of the House Paul Ryan’s office. Ryan confirmed that the GOP would move to “defund” Planned Parenthood as part the reconciliation bill they plan to introduce soon to repeal the Affordable Care Act (ACA), known colloquially as Obamacare. Ryan reportedly sent six security guards to block the delivery of the petitions by the pink-T-shirt-clad Planned Parenthood volunteers, who waited in the halls to make their delivery of the petitions, which ask Ryan to protect funding for Planned Parenthood through Medicaid and Title X. The security guards ultimately blocked the volunteers from being able to deliver their petitions, a spokesperson for Planned Parenthood [said].", "Uffalussy, Jennifer Gerson.   \"Planned Parenthood Volunteers Blocked From Delivering 87,000 Petitions to Paul Ryan.\"\r\n    Teen Vogue.   6 January 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]