["A photograph of policemen making people squat and hold their ears was shared by RJD Lakhisarai suggesting that it depicts mistreatment of Bihar citizens.", "जो भूल जाते हैं, दोबारा भोगते पाए जाते हैं!", "भूलना नहीं है बिहारवासियों! यह आपके साथ नहीं हुआ हो, पर आपके दूसरे गरीब बिहारी भाइयों के साथ ज़रूर हुआ है!", "उनके स्वाभिमान व न्याय की ख़ातिर भूलना नहीं है बिहारवासियों! pic.twitter.com/yjls0RmTZW", "— RJD Lakhisarai (@LakhisaraiRjd) October 21, 2020", "The same image was also shared by the official Twitter account of RJD on October 21.", "The image was earlier shared in March with the claim that it depicts mistreatment of migrant workers during lockdown imposed due to COVID-19.", "A quick reverse image search on Google redirects to several news reports from March 25 where the photograph has been used – The Hindu, Financial Express and Outlook.", "According to description attached to the image: “Police personnel punish offenders flouting lockdown guidelines, imposed in wake of coronavirus pandemic, at Chakeri area of Kanpur, on March 24, 2020.” The Hindu credited the photograph to PTI.", "Alt News contacted PTI photographer Rahul Shukla who got the photograph shot by a colleague on March 24 after he was informed of the police action. “This picture was shot at around 1:30 pm. Section 144 was imposed and 75 districts in Uttar Pradesh were under lockdown.” It is noteworthy that UP Chief Minister Yogi Adityanath had announced a lockdown in Kanpur starting March 23. “These people had stepped out without any reason. Some were on foot while others were on bikes. None of these people was able to prove to the police that they had stepped out for either ration or medicine,” said Shukla.", "He further informed that the police asked those who violated lockdown protocol to show ID cards. “Had these people been migrant workers from say, Delhi or Bihar, they would’ve shown their Aadhaar cards for proof of residence and the police wouldn’t have punished them. But they were unable to provide ID proof.”", "There are also hints in the photograph which suggest that the people being punished are not migrant workers – motorcycles in the background and the lack of luggage.", "Alt News checked the PTI photo gallery and confirmed that the image was indeed shot on March 24.", "Therefore, a photograph of police in Kanpur punishing people for stepping out during lockdown in March has been revived ahead of Bihar elections with the false claim that the image depicts police excess in the state.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]