["Several people have shared an image of a man standing behind a podium wearing just his briefs. As per the social media claim, he is Mexican MP Antonio Garcia protesting against corruption. The claim also ascribes the following quote to him, “You are ashamed to see me naked and you are not ashamed of your people whose money you have striped, plundered and stolen so that you can live in complete luxury with high wages and enjoy with your families.” This has been widely shared on Twitter and Facebook.", "Twitter user @MuthuiMkenya’s tweet gained over 1,700 retweets. (archived link)", "Mexico MP Antonio Garcia undressed in parliament and said, ” you are ashamed to see me naked and you are not ashamed of your people whose money you have striped , plundered and stolen so that you can live in complete luxury with high wages and enjoy with your families” pic.twitter.com/agvvpLu9Rp", "— MuthuiMkenya 🇰🇪 (@MuthuiMkenya) October 12, 2020", "The image is also being shared with the Hindi translation of the English text on Twitter. @Ms_Marmat is one such user who tweeted in Hindi. (archived link)", "#मेक्सिको 🇲🇽 में संसद के एक सदस्य ने संसद में बहस के दौरान अपने सारे कपड़े उतार देता है और बोलता है की ” तुम्हे मुझे नग्न देखने मे शर्म आती है लेकिन आपको अपने देश को नग्न, नंगे, हताश, बेरोजगार और निजी कंपनियों को जब इस देश का सारा धन लुटा रहे है और आम आदमी को गुलाम बना रहे है😢 pic.twitter.com/XfjTqx1Fd0", "— Mansingh Meena(आदिवासी) (@Ms_Marmat) October 14, 2020", "Similarly, several Facebook users posted the image. The Hindu’s political editor Nistula Hebbar quote-tweeted @MuthuiMkenya’s tweet and made the following remark, “The lady official sipping coffee while all this is going is just…” (archived link)", "The picture is viral across the globe. It received close to 8,000 shares from a page ‘World Press‘ that wrote a slightly different caption, “In Mexico, a member of Parliament removes all his clothes in Parliament during debate… “You are ashamed to see me naked, but you are not ashamed to see your people in the streets naked, barefooted, desparate, jobless and hungry after you have stolen all their money and wealth”………he told the Parliament!! What a courageous man, this is how it should be.” The image was shared with the same caption on 9gag.", "Alt News performed a reverse image search on Google and found that the image was published in 2013 by BBC, The Wall Street Journal and Daily Mail. As per the reports, the man is Democratic Revolution Party MP Antonio Garcia Conejo. He stripped down to his underwear to show his rejection of the energy law that allowed private companies to drill for oil and gas with the state-run firm Pemex in exchange for a share of the profits.", "This slideshow requires JavaScript.", "In August, The Guardian reported that Emilio Lozoya, the former head of Mexico’s state oil company Pemex accused former Mexican presidents — Enrique Peña Nieto, Felipe Calderón and Carlos Salinas — of corruption.", "Next, we performed a keyword search on YouTube and found that the historic speech by Conejon was uploaded by Cámara de Diputados, Mexican parliament’s lower house. Alt News used Google Transcribe app to transcribe the entire speech, then translated Spanish to English on Google translate. We did not find him making the statement attributed on social media.", "In the video, he began to strip around 11:30 minutes and said (translated via Google), “I am not ashamed because of what they are doing. They [government] took away and privatized the telecom [industry] in Mexico. Where is the profit? Railroads of Mexico are not going to achieve [profits] either. Shame on you! …. You can call it whatever you want. You are a coward! You are a coward! You are a coward!”", "We also looked for media reports that may have carried the statement ascribed to the MP but to no avail. BBC quoted Conejo as, “This is how you’re stripping the nation. Where is the benefit? I’m not ashamed, what you’re doing is a shame.”", "Therefore, an image from a speech given in Mexican parliament by Democratic Revolution Party MP Antonio Garcia Conejo in 2013 has been shared as him protesting against corruption and poverty in the country. He was protesting against an energy bill that would invite private players to invest in state-run oil and gas company.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]