["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "At the Democratic debate in Cleveland, Ohio, on Feb. 26, 2008, Sen. Hillary Clinton stole a line from Sen. John McCain and President Bush.", "Clinton said that last summer, Sen. Barack Obama \"basically threatened to bomb Pakistan, which I don't think was a particularly wise position to take.\"", "Clinton's line echoes recent comments by McCain, who told reporters Feb. 20 that Obama \"suggested bombing Pakistan,\" and Bush, who said in a Feb. 17 TV interview that he didn't know much about Obama's foreign policy except that \"he's going to attack Pakistan and embrace (Iranian President Mahmoud) Ahmadinejad.\"", "Clinton is seriously distorting Obama's remarks, just as Bush and McCain did. As we said with\n\nour check of McCain's statement last week,\n\nit is an extreme charge because Pakistan has been a key ally to the United States.", "Clinton, Bush and McCain are referring to a speech that Obama gave in August 2007 at the Woodrow Wilson International Center for Scholars in Washington. He spoke about the problem of terrorists at large within Pakistan. He said he would continue to provide military aid to Pakistan as long as the authorities there work to close terrorist training camps and prevent the Taliban from using Pakistan as a staging area for attacks in Afghanistan.", "Then Obama added:", "\"I understand that (Pakistan) President Musharraf has his own challenges. But let me make this clear. There are terrorists holed up in those mountains who murdered 3,000 Americans. They are plotting to strike again. It was a terrible mistake to fail to act when we had a chance to take out an al-Qaida leadership meeting in 2005. If we have actionable intelligence about high-value terrorist targets and President Musharraf won't act, we will.\"", "The transcript of his speech makes it clear that Obama is talking about targeting terrorists within the country regardless of whether he has the permission of the Pakistani government.", "We recognize that Clinton et al. are making a larger point questioning the wisdom of Obama telegraphing future military plans and we are not addressing whether that is a good idea. But it is a significant distortion to say Obama wants to \"attack Pakistan,\" as President Bush did, and an even more serious one that he supports \"bombing Pakistan\" as McCain and Clinton did. (Indeed, all Obama said was that he would \"act.\")", "The charge from Clinton and her odd allies is especially unusual in light of\n\na Feb. 19 article\n\nin the\n\nWashington Post\n\nthat revealed missiles from a CIA-operated Predator aircraft recently killed a key al-Qaida commander in the Pakistani town of Mir Ali. The U.S. government did not have permission from the Pakistani government for the attack, the article said.", "So the United States is already doing what Obama is advocating.", "We might give Clinton points for qualifying her remarks with \"basically.\" But even with that qualifier, she is twisting Obama's comments to imply he wants to attack a U.S. ally. It's not enough to call that False. We called it Pants-on-Fire wrong when McCain said it and we're doing the same for Clinton.", "Fox News Sunday,\n\nInterview with President Bush\n\n, Feb. 10, 2008", "Barack Obama campaign Web site,\n\nSpeech at the Woodrow Wilson International Center for Scholars\n\n, Aug. 1, 2007", "Associated Press,\n\nMcCain says Obama is simplistic to warn of bombing Pakistan\n\n, Aug. 2, 2007", "CNN,\n\nDemocratic debate transcript\n\n, July 23, 2007", "Associated Press,\n\nClinton: Obama is 'naive' on foreign policy\n\n, July 24, 2007", "White House Web site,\n\nPresident Bush Press Conference\n\n, Aug. 9, 2007", "Associated Press,\n\nObama: Would meet Iranian as president\n\n, Sept. 24, 2007", "New York Times,\n\nObama Envisions New Iran Approach\n\n, Nov. 2, 2007", "Washington Post,\n\nUnilateral Strike Called a Model For U.S. Operations in Pakistan,\n\nFeb. 19, 2008", "CQ Transcript Wire, Sen. McCain Holds a Media Availability, Columbus, Ohio, Feb. 20, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]