["A video that supposedly shows a combat robot has been shared on social media with the claim that Mossad, the national intelligence agency of Israel, has manufactured this “deadly weapon” to take on “terrorists and predators”.", "Amazing #Military #robot from #Israel. Hats off to the officers experimenting with this deadly weaponised robot by risking their lives. This shows their confidence in the machine designed to take care of predators and terrorists with clinical precision 🇮🇱#Idf #Mossad pic.twitter.com/g9v4Fg2sOV", "— Arun Deshpande (@ArunDeshpande20) November 27, 2020", "The clip was also shared with an anti-Muslim narrative.", "See how the future wars will be like! Mosad is preparing for manless wars against jihadists pic.twitter.com/UMjocZju8u", "— Gopal Goswami (@gopugoswami) November 28, 2020", "“This is not a CG Robo made for film fictiom. It’s real US Delta force “Robot” Training practice used in yesterday operation to kill Terrorist Al bagdi in Syria. Hats off to these soldiers taking part in the demo with live amunition. Total faith in the robot …using AI, Machine Learning…Technology is scary. Received from whatsapp,” was the message shared with the video last year.", "This is not a CG Robo made for film fictiom. It’s real US Delta force “Robot” Training practice used in yesterday operation to kill Terrorist Al bagdi in Syria. Hats off to these soldiers taking part in the demo with live amunition. Total faith in the robot …using AI, Machine Learning…Technology is scary. Received from whatsapp", "Posted by Sreenivasulu Nichenametla on Wednesday, 30 October 2019", "The claim that this robot was used in the operation to take down ISIS chief Abu Bakr al-Baghdadi is massively circulated on Facebook.", "The message had also been shared in Telugu, “ఇది ఫిల్మ్ ఫిక్టియం కోసం చేసిన రోబో కాదు. ఇది నిజమైన యు.ఎస్ .డెల్టా ఫోర్స్ “రోబోట్” శిక్షణా పద్ధతి సిరియాలో ఉగ్రవాది అల్ బాగ్దాడిని చంపడానికి ఆపరేషన్లో ఉపయోగించబడింది. ప్రత్యక్ష మందుగుండు సామగ్రితో డెమోలో పాల్గొనే ఈ సైనికులకు హ్యాట్స్ ఆఫ్. రోబోపై పూర్తి నమ్మకం … AI, మెషిన్ లెర్నింగ్ ఉపయోగించి … టెక్నాలజీ భయానకంగా ఉంది.”", "Chairman of RPG Group Harsha Goenka tweeted the video saying, “The real question in humans vs machines is not if the machines can think well?”", "A YouTube search with the keyword ‘combat robot’ throws up the same video shared by Corridor on October 26. The video was titled, “New Robot Makes Soldiers Obsolete (Bosstown Dynamics)”", "Several people commented on the video that the robot was a work of CGI effects.", "A second YouTub search with the keyword ‘Bosstown Dynamics cgi robot’ led us to a video of Corridor explaining how the robot was digitally created. “We Used CGi to Fake Military Robots,” is the title of the video which was uploaded the next day, October 27.", "A video of digitally-created ‘combat robot’ was shared on social media as a weapon manufactured by the Israeli intelligence agency. It was earlier shared as US Delta force robot used in the operation to take down ISIS leader Abu Bakr al-Baghdadi.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]