["By Robert Farley", "Posted on March 2, 2021", "President Joe Biden boasts that the U.S. is on pace to be the first country in the world to vaccinate 100 million people. That’s true, but per capita the U.S. is not tops in the world in vaccinations.", "Israel has administered about four times as many doses per 100 people as the U.S., and the United Arab Emirates and the United Kingdom have also administered significantly more doses per capita than the U.S., according to Our World in Data.", "Speaking at an event on Feb. 25 commemorating the 50 millionth COVID-19 vaccine shot, Biden noted that the U.S. is ahead of schedule to deliver on his promise of administering 100 million vaccine doses in his first 100 days in office.", "As we have written, the U.S. was already virtually at the pace Biden set as his goal — 1 million shots per day — before he took any action as president. It has risen since then. The seven-day average daily number of people vaccinated was 1.4 million on Feb. 24, 47% higher than on Jan. 20, when Biden was inaugurated, according to  the Centers for Disease Control and Prevention’s COVID Data Tracker. According to preliminary numbers from the CDC, the U.S. had administered more than 78 million vaccine doses by March 1, with more than 57 million of them coming since Biden took office.", "“And the more people get vaccinated, the faster we’re going to beat this pandemic,” Biden said from the Eisenhower Executive Office Building. “That’s why one of my first goals in office when I — just before I was sworn in, I indicated that my goal was to get 100 million COVID-19 vaccine shots in people’s arms in my first 100 days as president. At first, critics said that goal was too ambitious; no one could do that. And then they said it was too small. But the bottom line, though, is that America will be the first country — perhaps the only one — to get that done.”", "In remarks at a Federal Emergency Management Agency COVID-19 vaccination facility in Houston the following day, Biden again boasted that the U.S. was “ahead of schedule” to meet his 100 million shots in 100 days goal.", "“And because of the people behind me and others, America … is going to be the first in the country — perhaps the first in the world — to get that done,” Biden said.", "The implication, of course, is that the U.S. — the third most populous country — is leading the world in vaccine distribution. And in raw numbers, that’s accurate, according to the University of Oxford-based project Our World in Data.", "But that’s not true per capita.", "Looking at the total COVID-19 vaccination doses administered per capita for countries with a population of at least 1 million, Israel leads the world, with 94.9 doses per 100 people as of March 1. Second is the UAE at 60.9 doses per 100 people, and the United Kingdom is third at 31.1 doses per 100 people. By this measure, the U.S. ranks fourth at 23.2 doses per 100 people. This represents people who have gotten at least one dose of vaccine. The Moderna and Pfizer vaccines — the only vaccines that had been administered at that time — require two doses to be most effective.", "The United States’ seven-day average for daily vaccine doses administered per 100 people also ranked fourth on March 1.", "Nor is the U.S. tops when looking at the percentage of a country’s population that has gotten at least one dose of a vaccine. According to a New York Times project, “Tracking Coronavirus Vaccinations Around the World,” Israel (54%), the United Kingdom (30.5%), Bahrain (19%) and Chile (19%) all have vaccinated a larger percentage of their population than the U.S. (15%).", "Biden’s boast about the raw number of vaccinations in the U.S. leading the world reminds us of former President Donald Trump’s frequent claims that the U.S. led the world in testing for the coronavirus. But as is the case with Biden here, Trump was citing raw numbers for a relatively populous U.S. as opposed to the per-capita figure.", "Editor’s Note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]