["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Joe Biden was recently accused of sexual assault by former aide Tara Reade, but for years now he’s faced allegations as well as misinformation about his behavior.", "In February, for example, we fact-checked a doctored photo that made it look like the presumptive Democratic presidential nominee was grabbing a reporter’s chest — he wasn’t.", "Now an authentic campaign photo is being shared online but the description of it is inaccurate.", "\"AMERICA,\" the April 16 post says. \"This is 76 year old Senile Joe Biden!!! That is a 15 year old girl with whom he’s making out!!!\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The photo shows the former vice president kissing his granddaughter on the lips during a campaign rally in Iowa on Feb. 2. Biden was 77 years old when the photo was taken, not 76. His granddaughter, Finnegan Biden, was 19, not 15.", "\"Granddaughters not only love their grandpops, but they like him,\" Joe Biden said at the rally before kissing her. \"And that’s the great thing. Thank you, baby.\"", "Online, reactions ranged from people saying they were creeped out to others who chastised those who think a kiss between grandfather and grandchild is inappropriate.", "Either way, this Facebook post is misleading. Not only does it give the wrong ages for both Bidens, but it also gives the impression that Biden is making out with an underage girl. That’s not what’s happening in this photo.", "We rate this post False.", "Facebook post, April 16, 2020", "PolitiFact, An image that appears to show Joe Biden groping a woman is altered, Feb.14, 2020", "New York Post, Joe Biden kisses granddaughter on lips during Iowa rally, Feb. 3, 2020", "New Zealand Herald, Joe Biden kisses granddaughter on lips during Iowa rally, Feb. 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]