["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump speaks during an interview with Laura Ingraham on Fox News on Sept. 1, 2020. (Screenshot from YouTube)", "In a recent Fox News interview, host Laura Ingraham asked President Donald Trump what he would tell Republicans and conservatives in Democratic-leaning states about whether they should vote in November, and talked about whether a higher popular vote total would send a message of support for Trump.", "Trump interjected with a theory of his own.", "\"I think I did win the popular vote in a true sense,\" he said. \"I think there was tremendous cheating in California, there was tremendous cheating in New York and other places.\"", "Though he won the electoral college, Trump lost the popular vote nationwide, winning 62.99 million votes to former Secretary of State Hillary Clinton’s 65.85 million votes.", "In New York, Clinton won 4.56 million votes, while Trump won 2.82 million votes.", "We were curious about his claim of \"tremendous cheating in New York\" in the last presidential election.", "We reached out to the White House and the Trump campaign to get details of what Trump was talking about, but we did not receive a response.", "Though we can’t know for sure, New York has had some voting irregularities that Trump could have had in mind when he said that.", "In 2017, the New York City Board of Elections admitted to improperly removing voters from the rolls ahead of the 2016 Democratic primary. The admission followed a lawsuit, in which the city board was accused of violating federal and state election laws. According to a report from the New York City Campaign Finance Board, 126,000 voters were improperly removed before the primary, but were restored in time to vote in the general election. The report did not note anything that could be considered \"tremendous cheating\" in the general election.", "A spokesman for the state Board of Elections said that Trump may have been referring to a recent story in the New York Post. Two days before Trump’s interview with Ingraham, the Post published an interview with an unnamed Democratic operative who described the ways that mail-in votes can be manipulated. The story did not refer specifically to any actions taken in New York in the 2016 general election. The operative, who worked in New Jersey and mentored operatives in other states, including New York, said that tactics to manipulate an election result, such as knocking on voters’ doors and asking residents to hand over their filled-out ballots so the operative can tamper with it later, have been used \"for decades.\" The spokesman for the Board of Elections, John Conklin, said he could not confirm or deny any criminal activity by a political operative.", "Conklin also directed us to a report by the New York City Department of Investigation, which found that in 2013 investigators impersonated voters who were ineligible or deceased and were handed a ballot 61 of 63 times.", "\"There was nothing of note in the 2016 election to indicate there was any election tampering or cheating or whatever you want to call it,\" said Sarah Goff, deputy director of Common Cause New York, an organization that closely watches elections and was the lead plaintiff in the lawsuit against the city elections board in the 2016 primary.", "There were documented problems with eligible voters being improperly purged from the New York City Board of Elections’ voting lists during the 2016 primary.", "But in the interview, Trump talked about how he won the popular vote \"in a true sense,\" and made claims about \"tremendous cheating\" in New York and California. The popular vote he is talking about refers to the general election, not the primary. There is no evidence of cheating in the 2016 general election.", "Trump made a ridiculous claim.", "We rate his statement Pants on Fire.", "Fox News interview with President Trump, via Grabien, Sept. 1, 2020. Accessed Sept. 2, 2020.", "New York Post, article, \"Confessions of a voter fraud: I was a master at fixing mail-in ballots,\" Aug. 29, 2020. Accessed Sept. 2, 2020.", "City & State New York, article, \"NYC purged 200,000 voters in 2016. It wasn’t a mistake,\" Nov. 6, 2018. Accessed Sept. 2, 2020.", "Wall Street Journal, commentary, \"Voter Fraud a Myth? That’s Not What New York Investigators Found,\" Larry Levy, Feb. 7, 2017. Accessed Sept. 2, 2020.", "WNYC, article, \"City Board of Elections Admits It Broke the Law, Accepts Reforms,\" Oct. 24, 2017. Accessed Sept. 3, 2020.", "Common Cause NY, et. al., vs. New York City Board of Elections, Consent Judgement and Decree, 2017, via Lawyers Committee for Civil Rights Under Law. Accessed Sept. 10, 2020.", "Phone interview, Sarah Goff, deputy director, Common Cause New York, Sept. 2, 2020.", "New York State Attorney General, press release, \"A.G. Schneiderman Moves To Intervene In Lawsuit Against NYC Board Of Elections Regarding Voter Registration Purges,\" Accessed Sept. 3, 2020.", "Email interview, John Conklin, director of public information, New York State Board of Elections, Sept. 2, 2020.", "New York City Department of Investigation, \"Report on the New York City Board of Elections’ Employment Practices, Operations, and Election Administration,\" December 2013. Accessed Sept. 3, 2020.", "New York City Campaign Finance Board, Voter Assistance Annual Report, 2016-2017, April 2017. Accessed Sept. 3, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]