["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On \"The Daily Show,\" Jon Stewart said Congress shouldn't be surprised by the recent revelations about the U.S. government spying on its allies.", "The U.S. tapping of German Chancellor Angela Merkel’s cell phone, along with the phone calls of other American allies, has led members of Congress to call foul.", "Jon Stewart, host of The Daily Show, isn’t having any of it.", "\"They have no right to be surprised,\" Stewart said.", "Stewart then walked through all the ways that from 2001 onward, lawmakers have given the green light for greater and more expansive eavesdropping.", "\"Congress passed the Patriot Act giving our intelligence agencies access to, quote, 'any tangible thing',\" Stewart said. \"Our intelligence has to have access to everything except wishes and fairies.\"", "Sarcasm aside, Stewart made some specific allegations.", "\"The very Legislature that is bewildered at the scope and reach of our spying apparatus, granted them the scope and reach,\" he said. \"In 2008 and 2012 (they) explicitly rejected an amendment calling for more disclosure of said surveillance.\"", "While many of Stewart’s bits are pure comedy, his take on Congress’ actions includes specific claims that can be fact-checked.", "In that vein, Stewart is correct. Congress expanded the legal boundaries of intelligence gathering and turned back several efforts aimed to reveal details of how spying touched the lives of ordinary Americans. The only caveat: It seems unlikely that any of the amendments he referenced would have led the intelligence agencies to report on their spying on America’s allies.", "Bolstering FISA in 2008 and 2012", "The Foreign Intelligence Surveillance Act, or FISA, has been around since 1978. It basically sets the ground rules for spying on foreign agents, especially when that spying touches American soil and might touch American citizens. It gives a special court the power to oversee that work. After the terrorist attacks of 2001, President George W. Bush pressed to give intelligence agencies additional money and authority to look at information that people might have thought was private, such as library records. That was the \"any tangible thing\" that Stewart referred to.", "But library records were a tiny sliver of the data collection program created by the Federal Bureau of Investigation and the National Security Agency. Electronic information, over the Internet and through telephone networks was gathered and stored in vast quantities.", "The collection of that data became known in 2006, when the role of major companies such as Verizon and AT&T was revealed. That prompted a 2008 review of the FISA law, to basically retroactively approve the arrangement.", "\"The 2008 amendments appear to be designed to legalize warrantless wiretapping by the NSA that had been done illegally prior to the amendment,\" said Molly Bishop Shadel, an expert in foreign intelligence law at the University of Virginia School of Law. \"Congress expanded the scope of FISA even though it knew or should have known that the NSA had done something questionable.\"", "During the debate in 2008 the main point of contention was whether to grant retroactive immunity to the telecommunications companies that apparently had given the government access to data that passed through their networks.", "While the changes in 2008 did set some limits on domestic surveillance, they gave intelligence agencies greater flexibility to use new technology to track the activities of foreign agents so long as they were outside American borders, even if their communications ran through American systems. The 2008 revisions were to last five years, which prompted further tinkering in 2012.", "By 2012, several members of Congress offered amendments that would have compelled intelligence agencies to give Congress more details on their activities. One from Sen. Jeff Merkley, D-Ore., would have urged the government to share key interpretations of law from the FISA court. Another from Sen. Ron Wyden, D-Ore., would have told the government to report the number of Americans whose personal records had been caught up in its surveillance nets and would have strengthened the rules against warrantless searches. A third from Sen. Rand Paul, R-Ky., would have required a warrant for access to any U.S. communication, although it didn’t speak directly to greater disclosure to Congress.", "The Senate rejected all three amendments. Wyden’s bill came the closest but failed 52-43.", "The overall reauthorization of the wiretapping program passed 73 to 23.", "The expanded reach of intelligence agencies continued and any amendment that Stewart referred to was turned back. (We reached out to The Daily Show for supporting details but did not hear back.)", "Congress \"definitely had a chance to pass amendments that would have given them more information,\" said Trevor Timm, a privacy activist with the Electronic Frontier Foundation.", "But there is a caveat.", "Timm said none of the amendments would have changed American activities overseas. They all were aimed at protecting the privacy of Americans. While keeping the country safe from its enemies remains the larger goal of the Foreign Intelligence Surveillance Act, there is nothing in the law that puts America’s friends off limits.", "Legally, the U.S Code says intelligence agencies \"shall keep the congressional intelligence committees fully and currently informed of all intelligence activities.\" But that law allows to the director of national intelligence to set the standards as to what should be included in its reports.", "Our ruling", "Stewart said Congress had given intelligence agencies broad powers to engage in surveillance and had rejected an amendment that would have required more disclosure. Overall, changes made in 2008 and continued in 2012 did give U.S. spy agencies more leeway. Individual lawmakers offered amendments aimed expressly at giving Congress more details on intelligence activities, but they failed to win enough support.", "We rate this claim True.", "Comedy Central, The Daily Show, Oct. 30, 2013", "Senate Select Committee on Intelligence, Report on FISA Amendment Act - Sunset Extensions Act 2012, June 7, 2012", "Email interview with Trevor Timm, Electronic Frontier Foundation, Oct. 31, 2013", "Email interview with Molly Bishop Shadel Associate Professor of Law, University of Virginia School of Law", "Email interview with Stephen Vladeck, professor of law, American University Washington College of Law, Oct. 31, 2013", "Library of Congress, Amendments For H.R.5949 - FISA 2012 extension", "Legal Information Institute, 50 USC § 413a - Reporting of intelligence activities other than covert actions", "ProPublica, Mass Surveillance in America: A Timeline of Loosening Laws and Practices", "Legal Information Institute, 50 USC § 1861 - Access to certain business records for foreign intelligence and international terrorism investigations", "Legal Information Institute, 50 USC § 1881a - Procedures for targeting certain persons outside the United States other than United States persons", "Legal Information Institute, 50 USC § 1804 - Applications for court orders", "Legal Information Institute, 50 USC § 1805 - Issuance of order", "Legal Information Institute, 50 USC § 1801 - Definitions", "Washington Post, Obama joins Fellow Senators in Passing New Wiretapping Measure, July 10, 2008", "Washington Post, House Passes Spy Bill; Senate Expected to Follow, June 21, 2008", "Washington Post, Senate Debates Rewrite of '78 Law That Created Secret Intelligence Court, June 26, 2008", "National Archives, Executive Order 12333", "PolitiFact, Are Americans being ‘targeted’ for surveillance?, July 2, 2013", "Electronic Frontier Foundation, Congress Disgracefully Approves the FISA Warrantless Spying Bill for Five More Years, Rejects All Privacy Amendments, Dec. 28, 2012", "Electronic Frontier Foundation, Why We Should All Care About Today's Senate Vote on the FISA Amendments Act, the Warrantless Domestic Spying Bill, Dec. 27, 2012", "PolitiFact, Sen. Udall says ordinary Americans’ business records caught up in surveillance net, June 13, 2013", "PolitiFact Georgia, Phone call surveillance policy no mystery, congressman says, July 8, 2013", "PolitiFact, Rep. Tom Cole says his NSA vote backed by entire Intelligence Committee, Aug. 2, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]