["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former Vice President Joe Biden has denied the sexual assault allegation made by Tara Reade, who worked for him in the 1990s, when he was a senator. An aide has said that Biden doesn’t remember her.", "But images being shared on social media suggest that the presumptive Democratic presidential nominee ought to remember her.", "\"This is Tara Reade,\" says the text above a photo published on Twitter of a younger Biden standing next to a smiling, brown-haired woman, with his hand on her arm (the other hand is not visible). \"The woman he never met. He knows her well enough to … have one hand on her butt and appears to be at ease firmly against her like family.\"", "\"Joe Biden says he can’t remember Tara Reade,\" reads another tweet showing the photo. \"Perhaps this will help refresh his memory.\"", "The tweets were flagged by VineSight, an organization that uses artificial intelligence to surface potential misinformation, and they also appear on Facebook.", "The photo was taken by Associated Press photographer Ron Edmonds in January 1993, when Reade worked for Biden. However, the woman in the picture is Zoe Baird, whom then-President Bill Clinton had nominated for attorney general.", "The AP photo caption says: \"Attorney General-designate Zoe Baird meets with Sen. Joseph Biden (D-Del.), chairman of the Senate Judiciary Committee, on Capitol Hill in Washington. Biden will chair the committee during Baird’s confirmation hearings.\"", "Baird ultimately withdrew her nomination after losing support because she hired two undocumented immigrants to help take care of her child.", "Politico reported that Biden told the White House Baird was \"dead-on-arrival after failing to pay Social Security taxes on her nanny.\"", "We rate these tweets about the photo False.", "Tweet, May 2, 2020", "PolitiFact, Tara Reade has accused Joe Biden of sexual assault. Here’s what we know, April 30, 2020", "The Washington Post, Joe Biden denies he sexually assaulted a former Senate aide, calls on National Archives to release complaint if one exists, May 1, 2020", "Shutterstock, Zoe Baird, Washington, USA, Jan. 6, 1993", "Los Angeles Times, Under fire, Baird withdraws bid for attorney general, Jan. 22, 1993", "Politico, Clinton and Biden’s awkward friendship, Aug. 31, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]