["By Saranac Hale Spencer", "Posted on December 11, 2020", "A list of bogus election fraud claims, cobbled together from dubious websites and failed lawsuits aimed at overturning President-elect Joe Biden’s victory in the 2020 election, has spread widely online.", "It appeared in a recent story posted in a publication called the Spectator, an American offshoot of the British journal once edited by Boris Johnson, the country’s Conservative prime minister.", "The article has been promoted by, among others, Rep. Jim Jordan of Ohio and former House Speaker Newt Gingrich, even though the agencies and organizations that oversee U.S. elections have called the 2020 election “the most secure in American history.” In a joint statement on Nov. 12, federal, state and local officials said: “There is no evidence that any voting system deleted or lost votes, changed votes, or was in any way compromised.”", "Also, Attorney General William Barr — who had broken with longstanding guidance in the Department of Justice by instructing prosecutors to investigate allegations of voter fraud before the election results were certified — said on Dec. 1 that his department has “not seen fraud on a scale that could have effected a different outcome in the election.”", "Still, the falsehoods aimed at undermining the election continue to circulate on social media. We’ve debunked more than two dozen, so far.", "We’ll address below the nine claims made in the Spectator.", "Claim: “Late on election night, with Trump comfortably ahead, many swing states stopped counting ballots. In most cases, observers were removed from the counting facilities. Counting generally continued without the observers.”", "Facts: As we have previously reported, it is not unusual for all states — not just swing states — to stop counting ballots late on election night. In fact, it is routine for ballot counting to be suspended late in the evening, since final vote tallies and official tabulations are normally certified after Election Day.", "The second part of this claim — that in “most cases” observers were removed from counting facilities and that counting continued “without the observers” — is false. FactCheck.org could find only one such allegation about counting continuing without observers — in Fulton County, Georgia — which was disputed by county election officials.", "In Pennsylvania, Nevada, Wisconsin, Michigan and Arizona, all of which were swing states in the 2020 election, we could find no evidence to support such allegations.", "Claim: “Statistically abnormal vote counts were the new normal when counting resumed. They were unusually large in size (hundreds of thousands) and had an unusually high (90 percent and above) Biden-to-Trump ratio.”", "Facts: This vague claim could either be suggesting that votes were switched (a conspiracy theory we’ve repeatedly debunked and the Cybersecurity and Infrastructure Security Agency has said is false) or that the mail-in ballots counted after Election Day were illegitimate.", "Neither is true.", "Since we’ve already addressed the vote-switching conspiracy theories, we’ll focus on the ballot-box stuffing suggestion.", "Due to the COVID-19 pandemic, some states made voting by mail easier in 2020. Most states normally don’t start counting mail-in ballots until Election Day, and mail-in ballots tend to favor Democrats in presidential elections. Also, in the run-up to the election, President Donald Trump repeatedly discouraged their use.", "So there’s nothing unusual about post-Election Day votes favoring Biden.", "The Spectator story might have oversold the degree to which those votes favored Biden, though.", "In two swing states that keep track of the type of ballot cast for each candidate, Biden garnered more mail-in votes than Trump, but he didn’t win 90% of them. In Pennsylvania, Biden won 76% of the mail-in vote. In Georgia, he won 65% of the absentee mail-in vote.", "Also, CISA has weighed in on two types of ballot-box stuffing claims, explaining that states have a variety of measures to protect against the submission of counterfeit mail-in ballots and that the number of overseas military ballots is so small — fewer than 1,000 in most states — that an influx would be easily detectable.", "Claim: “Late arriving ballots were counted. In Pennsylvania, 23,000 absentee ballots have impossible postal return dates and another 86,000 have such extraordinary return dates they raise serious questions.”\n\nFacts: Twenty-two states and the District of Columbia allowed mail-in ballots that arrived after Election Day to be counted in the Nov. 3 election, according to a survey of state laws from the National Conference of State Legislatures. In almost all cases, the ballots had to be postmarked by Election Day.", "So, there’s nothing nefarious about states counting legally cast ballots that arrived after Election Day.", "In Pennsylvania, state law requires mail-in ballots to be received by Election Day in order to be counted. But a state Supreme Court ruling in September extended the deadline to Nov. 6 for the 2020 election, as requested by Democratic Gov. Tom Wolf’s administration.", "About 10,000 ballots in total were received in that three-day period, according to the Pennsylvania Department of State.", "That’s 91% lower than what the Spectator story suggested.", "The story’s suggestion — that “23,000 absentee ballots have impossible postal return dates and another 86,000 have such extraordinary return dates they raise serious questions” — appears to be based on a post from a pro-Trump media outlet called the Epoch Times.", "Using a database from the Pennsylvania Department of State that shows the dates on which mail-in ballots were sent out to voters and the dates on which those ballots were returned, the story claims that more than 23,000 ballots were supposedly returned before they were sent out. It claims that an additional 86,000 ballots are suspect since they were returned either on the same day or the day after they were sent out.", "But a Department of State spokeswoman told us in an email, “That data does not indicate fraud.” State law requires counties to provide voters with mail-in ballots at their election offices. So, a voter could go to the county election office, request a mail-in ballot, fill it out at the office and return it — all in one visit to the election office, the spokeswoman explained.", "Similarly, voters could return mail-in ballots at in-person locations a day after picking up their ballots. So there’s nothing fraudulent about ballots that were returned on the same day they were issued or the day after.", "As for the appearance that ballots were returned before they had been sent out, that’s due largely to an update of the system that feeds the database.", "Over the summer, when counties exported voter data from the state system in order to send out requested ballots, the system filled in that date as the date on which the ballots were mailed, the spokeswoman explained. Since some counties were exporting a batch of data days or weeks before they sent out the ballots to voters, on Aug. 28 the state started offering an option for counties to amend the date in the system to reflect the actual date on which the ballots were mailed. This new option would also trigger an email to the voter with an alert that the requested ballot had been sent.", "Many counties began using the updating option in October, which was then days or weeks after they had sent out the ballots, the spokeswoman said. This resulted in emails going out to voters who had already returned their ballots, causing confusion, and resetting the date in the system. Lehigh County, for example, posted a notice about the issue on Facebook on Oct. 20. Greene County responded to voters’ concerns through a radio announcement at the time, a county spokeswoman told us.", "So, that discrepancy was a matter of data entry, not widespread fraud.", "Claim: “The failure to match signatures on mail-in ballots. The destruction of mail-in ballot envelopes, which must contain signatures.”", "Facts: For privacy reasons, mail-in ballots don’t need to be signed — but the envelopes they arrive in do. Rules about matching the signature on a mail-in ballot envelope with the signature on file for a voter vary by state, and not all states have such a requirement.", "Thirty-one states and the District of Columbia had signature matching requirements in effect for the 2020 election, according to a report from the Stanford-MIT Healthy Elections Project. The details of those requirements differ from state to state.", "The Spectator story doesn’t offer any specific allegations — let alone proof — of election workers eschewing signature matching rules, so this claim is hard to address.", "Of the six states where the Trump campaign has contested the election results, four had signature matching requirements — Arizona, Georgia, Michigan and Nevada. Pennsylvania and Wisconsin did not.", "So, in two contested states and in about 40% of the country, the “failure to match signatures” means nothing since there’s no requirement to do so.", "Claim: “Historically low absentee ballot rejection rates despite the massive expansion of mail voting. Such is Biden’s narrow margin that, as political analyst Robert Barnes observes, ‘If the states simply imposed the same absentee ballot rejection rate as recent cycles, then Trump wins the election.'”", "Facts: Most states have not yet released data on how many mail-in ballots were rejected, so we don’t know what the rates were in the 2020 election.", "There has been speculation, though, that they may be lower than in previous years; we’ll explain why later.", "But both Robert Barnes and, by extension, the Spectator story, appear to have based this claim on an internet post written by A.J. Cooke, who describes himself as a “conservative ghostwriter.” With his statement, Barnes tweeted a graph that had been included in Cooke’s post.", "The graph included what Cooke purported to be the number of mail-in ballots that should have been rejected and the number of votes by which Biden won in five states — Pennsylvania, Georgia, Wisconsin, Arizona and Nevada.", "In the first four states, as Cooke figured it, the number of ballots that should have been rejected was larger than Biden’s lead.", "But relying on this to conclude that Biden should have actually lost those states is flawed.", "Cooke came up with the number of ballots he thought should be rejected by applying the rejection rate from the 2018 midterm elections for each state to the number of mail-in ballots they received in 2020. But that doesn’t take into account the reasons the rejection rate may have been lower in 2020.", "“First, states changed laws that cause rejected ballots, either on their own or through court action,” said Michael McDonald, a political science professor at the University of Florida who runs the United States Elections Project. “Second, voters returned ballots sooner than in past elections, allowing voters and election officials more time to fix deficient ballots. Third, election officials and outside organizations had better communication with voters who had rejected ballots. States created new online portals where voters could check the status of their ballots, election officials had more proactive outreach efforts, and outside organizations invested in communications to supplement election officials’ efforts.”", "In Michigan, one of the states that has released its ballot rejection data, Secretary of State Jocelyn Benson pointed to some of the same reasons.", "“It is also gratifying that our voter education efforts, alongside those of countless other nonpartisan organizations, in addition to the installation of secure ballot drop boxes across the state, combined to dramatically reduce the rate of voter disenfranchisement due to late submission and signature errors,” Benson said in a statement.", "Michigan rejected 0.46% of the mail-in ballots submitted for the 2020 election, down from 0.57% in 2018 and 0.49% in 2016.", "Claim: “Missing votes. In Delaware County, Pennsylvania, 50,000 votes held on 47 USB cards are missing.”", "Facts: This appears to be based on one of the claims advanced by Rudy Giuliani, Trump’s personal lawyer, in his effort to overturn the election results.", "Giuliani brought several individuals to the Pennsylvania State Senate Majority Policy Committee in a hotel ballroom in Gettysburg, Pennsylvania, on Nov. 25. Among them was Gregory Stenstrom, who identified himself as a poll watcher in Delaware County and alleged something similar to this claim.", "The state Senate panel — made up entirely of Republicans — convened four days after a federal judge dismissed a Trump campaign lawsuit aimed at preventing Pennsylvania from certifying its election results.", "Biden won the state by 80,555 votes, and the results were certified the day before the Gettysburg panel met.", "At the panel hearing, Stenstrom claimed that, on Election Day, he saw thumb drives, called vCards, “being uploaded to the voting machines by the voting machine warehouse supervisor on multiple occasions.” Those uploads resulted in 50,000 votes for Biden, he said.", "Then, he claimed, “as of today, 47 USB vCards are missing, and they’re nowhere to be found.”", "Stenstrom did not provide any evidence that the cards were used to upload fraudulent votes or that Biden benefited from this purportedly illegal upload.", "Delaware County officials explained to us that the vCards are used to transfer data from the paper-ballot scanning machines at each precinct to the central vote tabulating system. Uploading data from the vCards is part of the regular process for tallying votes — there’s nothing untoward about it. Other parts of his claim are also false, they said.", "“The allegation that someone from the voting machine warehouse uploaded anything from any vCards is utterly false,” Adrienne Marofsky, the county’s spokeswoman, told us by email.", "Nobody from the warehouse is trained to use the software that uploads the data from the vCards, she said. That job is done by staff in the bureau of elections department or the information technology liaison.", "“This is not a system designed for mass use and it is not intuitive such that a new user with no training on the system could manage to navigate their way through it,” she wrote, noting that it’s possible Stenstrom might have mistaken the IT liaison for a warehouse worker.", "Likewise, Marofsky said, “the report of 47 ‘missing’ vCards is false.”", "It’s not uncommon for some vCards to be delivered after Election Day, she said.", "“Within a day or so after Election Day, the vCards that had not been returned on election night were accounted for,” Marofsky said. “A number of them were simply left in the scanners by the local election board and were recovered when the scanners (which were put in sealed rolling carts called ‘cages’ at the end of the day on Election Day) were returned to the voting machine warehouse.”", "Marofsky also noted that there are two fail-safes if a vCard were to be lost — the vote scanners’ hard drives hold the original data and the paper ballots are held in sealed, numbered bags in case they need to be rescanned.", "Beyond that, Marofsky said, “Stenstrom’s allegations rely on the proposition that the Board of Elections staff was working in league with the Democratic Party to engage in a mass fraud. That theory makes absolutely no sense when one considers the fact that: (1) the Chief Clerk of the Bureau of Elections has worked in that position for Delaware County approximately 15 years, 14 of them under Republican rule… (2) the Director of the County Voter Registration Office has worked for the County for approximately 20 years, 19 of them under Republican rule… (3) the IT liaison to the Bureau of Elections has worked in that capacity for many years, all of them prior to 2020 under Republican rule.”", "“These individuals—not Democratic partisans—ran the election in Delaware County and handled the counting/tallying of the votes in Delaware County. It is simply absurd to propose that after years and years of running elections under Republican administrations in Delaware County, they all suddenly became Democratic fraudsters overnight,” Marofsky said.", "Also, the results of the 2020 election in Delaware County are on par with the results from 2016.", "The county’s turnout increased 10% (there was a 16% increase nationally), so there were more ballots. But the parties maintained roughly the same share of the vote. In 2016, Hillary Clinton received 60%, while Trump received 37%. In 2020, Biden received 63%, while Trump received 36%.", "Claim: “Non-resident voters. Matt Braynard’s Voter Integrity Project estimates that 20,312 people who no longer met residency requirements cast ballots in Georgia. Biden’s margin is 12,670 votes.”", "Facts: This claim comes from yet another failed lawsuit.", "It was included in an expert report for a case brought in Georgia state court aimed at decertifying the election results.", "The person giving the report was Matt Braynard, who worked on Trump’s 2016 campaign and then ran a voter registration nonprofit and a consulting firm that promises to “deploy voter data on behalf of your cause or candidate.” Those two organizations shared an office in Washington, D.C., and the nonprofit’s tax-exempt status was revoked in May for failing to file its 990 forms.", "In his report, Braynard claimed that thousands of illegal votes were counted in Georgia’s election.", "He determined that 20,312 “absentee or early” ballots were cast by voters who didn’t satisfy the residency requirements by comparing Georgia’s list of voters with a national change-of-address database and other states’ voter rolls, according to the report. But Braynard didn’t explain how he had verified that the voters on the state’s list were the same as those on the other lists he was using.", "Judge Jane Barwick dismissed the case on a technical issue — the plaintiff had sued the wrong people — in a ruling from the bench on Dec. 7.", "The same report was submitted in another, similar lawsuit filed in federal court in Georgia. In that case, an expert rebuttal submitted by Democrats who joined the case said that Braynard’s claims didn’t meet scientific standards.", "“Recent academic research on attempts to match voter registration records to other state’s voter files or to national lists, such as NCOA has shown that this task can be prone to high rates of error,” wrote Stephen Ansolabehere in his rebuttal. Ansolabehere is a professor of government at Harvard University and an expert on elections.", "“Crosscheck, a collaboration of 28 states, matches people across states based on first name, last name, and date of birth. This approach has been determined to be unreliable because it yields a very high number of incorrect matches,” he wrote. “One study found that Crosscheck’s methodology identified almost 3 million ‘matching individuals who voted twice nationwide.’ All but 600 of these records were deemed to be false positives, in which the method says two people are the same but in fact they are not. For those 600 other cases, it could not be determined whether they were or were not the same individual.", "“The Crosscheck experience suggests that it is quite easy to link records incorrectly when matching voter files to national lists (such as NCOA) or other states’ registration databases. This example underscores the need to disclose algorithms and provide evidence that there are no large numbers of false positives and false negatives. Matching on name and date of birth, as was done using Crosscheck, will likely produce huge numbers of false positives,” Ansolabehere wrote.", "Judge Timothy Batten dismissed that case, also citing technical issues — standing and venue — on Dec. 7.", "Claim: “Serious ‘chain of custody’ breakdowns. Invalid residential addresses. Record numbers of dead people voting. Ballots in pristine condition without creases, that is, they had not been mailed in envelopes as required by law.”", "Facts: This claim is both vague and broad.", "We’ve already addressed more specific allegations that ballots were cast on behalf of deceased voters in Pennsylvania. In one story, we explained that experts say there are some cases in each election in which a relatively small number of people die in the period between when they send in a mail-in ballot and Election Day. While there may be some instances of fraud, experts told us that the scale of it wouldn’t impact the outcome of an election.", "In another story, we explained that a claim alleging more than 21,000 registered voters in Pennsylvania were dead had actually originated in a lawsuit brought by a conservative group that failed to convince a federal judge in October that its list of deceased voters was accurate.", "CISA has also explained that this persistent allegation is largely unfounded.", "“Taken out of context, some voter registration information may appear to suggest suspicious activity, but are actually innocuous clerical errors or the result of intended data practices,” the federal agency explained on its webpage debunking election rumors. “For example, election officials in some states use temporary placeholder data for registrants whose birth date or year is not known (e.g., 1/1/1900, which makes such registrants appear to be 120 years old). In other instances, a voting-age child with the same name and address as their deceased parent could be misinterpreted as a deceased voter or lead to clerical errors.”", "As for the claim that some ballots were suspect because they were “in pristine condition,” that appears to have come from an affidavit submitted in a failed lawsuit aimed at overturning the election results in Georgia. Like the other evidence submitted in the case, it didn’t convince the federal judge hearing the case.", "Claim: “Statistical anomalies. In Georgia, Biden overtook Trump with 89 percent of the votes counted. For the next 53 batches of votes counted, Biden led Trump by the same exact 50.05 to 49.95 percent margin in every single batch. It is particularly perplexing that all statistical anomalies and tabulation abnormalities were in Biden’s favor. Whether the cause was simple human error or nefarious activity, or a combination, clearly something peculiar happened.”", "Facts: There was no anomaly.", "The claim appears to be based on a post from the Gateway Pundit, a partisan website, which published data it characterized as “inconceivable” and indicative of “fraud.”", "The data showed that, as the Spectator story says, Biden maintained a lead with 50.05% of the vote while Trump held 49.95% over the course of about an hour of ballot counting in Georgia.", "But that’s to be expected, Charleen Adams, a research fellow at the Harvard T.H. Chan School of Public Health, told FactCheck.org in an interview.", "“What they’re calling an anomaly is statistically normal,” Adams said. She examined similar claims that misinterpreted the same type of data about other states.", "In the Georgia example, the data — for which Gateway Pundit didn’t disclose the source — shows information for batches of ballots counted on the night of Nov. 6.", "That’s three days after the election, when most of the counting was complete. With cumulative data like this, it’s normal to see small differences in the percent shares of votes between candidates at that late point in the process, Adams explained.", "In contrast to the earlier days of counting — when there are relatively few votes included in the total and there can be wide fluctuations in the lead or deficit held by a certain candidate as new batches of ballots are counted — the later days show the cumulative, almost complete vote total when the margins between the candidates have tightened and each new batch of ballots has a shrinking impact on the total balance.", "The Gateway Pundit data shows tallies from one of the later days, when 89% of Georgia’s ballots had been counted and each new batch of votes did little to shift the already established balance.", "“So, there’s not an anomaly in the data,” Adams said. “They’ve misinterpreted cumulative data.”", "Caitlin Quinn and Katie Busch contributed to this report.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]