["By Eugene Kiely", "Posted on August 13, 2019 | Updated on August 19, 2019", "A Facebook post from a user who appears to subscribe to QAnon conspiracies claims that Jeffrey Epstein is not dead. The theory is based solely on a news photo that shows an unresponsive Epstein being wheeled into a hospital on a gurney.", "The Federal Bureau of Prisons, in an statement, said that “inmate Jeffrey Edward Epstein” was found unresponsive in his cell at approximately 6:30 a.m. on Aug. 10 from “an apparent suicide.” The staff at the Metropolitan Correctional Center in New York administered life-saving measures until the emergency medical services team could arrive and transport him to a local hospital, where he was pronounced dead, the statement said.", "A New York Post photo of the former wealthy financier being wheeled into New York Downtown Hospital shows the unresponsive Epstein.", "That photo is now being circulated by conspiracy theorists as evidence that Epstein is actually alive.", "“Not a chance he is dead,” reads a Facebook post by Erik Pearson, whose page features images of QAnon — a reference to anti-government conspiracy theorists who support President Donald Trump. “Since when are DEAD bodies just wheeled out without being covered or in a body bag? And look at how pink he looks. That is not the face of a dead man.”", "The Epstein-is-alive conspiracy is being spread by others on Facebook, generating thousands of shares.", "But the photo proves nothing.", "It’s true that pallor mortis, which refers to the paleness of the skin upon death, happens “occurs within the first few hours after death,” according to a study published in the International Journal of Legal Medicine. But we don’t know the estimated time of death. New York City Chief Medical Examiner Dr. Barbara Sampson did not address that in a preliminary statement her office released on Aug. 11 after the autopsy was performed.", "“Today, a medical examiner performed the autopsy of Jeffrey Epstein,” Sampson said in the statement, which her office provided to us. “The ME’s determination is pending further information at this time. At the request of those representing the decedent, and with the awareness of the federal prosecutor, I allowed a private pathologist (Dr. Michael Baden) to observe the autopsy examination. This is routine practice.”", "We don’t even know if he was still alive when prison staff discovered him in his cell or when photographer William Farrington snapped the photo at the hospital for the Post. As mentioned earlier, the BOP statement said prison staffers and EMT personnel administered life-saving efforts, and that Epstein was pronounced dead at the hospital. CBS News reported that prison guards were quick to act after they heard shrieking from Epstein’s cell, although that has not been confirmed by prison officials.", "There are many questions about Epstein’s apparent suicide — notably why he was taken off suicide watch just days after apparently attempting suicide. Attorney General William Barr said in an Aug. 10 statement that he was “appalled” by the death.", "“Mr. Epstein’s death raises serious questions that must be answered,” Barr said, a point he reiterated in an unrelated speech he made on Aug. 12.", "“We are now learning of serious irregularities at this facility that are deeply concerning and demand a thorough investigation,” Barr said, adding that the FBI and the department’s inspector general will investigate.", "But there is no question that Epstein is dead. The statements issued by Barr, the city’s chief medical examiner, the Federal Bureau of Prisons, and U.S. Attorney Geoffrey S. Berman for the Southern District of New York, whose office had brought charges against Epstein, all said Epstein was dead. The autopsy has already been performed.", "Both Barr and Berman emphasized that federal prosecutors will continue to pursue the case.", "“To those brave young women who have already come forward and to the many others who have yet to do so, let me reiterate that we remain committed to standing for you, and our investigation of the conduct charged in the indictment — which included a conspiracy count — remains ongoing,” Berman said in a statement.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Update, Aug. 19: The New York City Chief Medical Examiner’s Office on Aug. 16 publicly reported that, after a “careful review of all investigative information, including complete autopsy findings,” the determined cause of death for Epstein was “hanging” and the manner of death was “suicide.”", "Press release. “Inmate Death at the MCC New York.” Federal Bureau of Prisons. 10 Aug 2019.", "Celona, Larry et al. “Photos show Jeffrey Epstein as he’s wheeled into Downtown Hospital.” New York Post. 10 Aug 2019.", "Schäfer, Achim Th. “Colour measurements of pallor mortis.” International Journal of Legal Medicine. 2000 Feb.", "Noor, Saliha, New York City Office of Chief Medical Examiner. Email sent to FactCheck.org. 12 Aug 2019.", "“Shrieking heard from Jeffrey Epstein’s jail cell the morning he died.” CBS News. 13 Aug 2019.", "Mallin, Alexander et al. “Agents descend on Epstein’s island home looking for evidence of inner circle: Sources.” ABC News. 12 Aug 2019.", "Hartmann, Margaret. “Jeffrey Epstein Found Injured in Jail Cell After Possible Suicide Attempt.” New York Magazine. 23 July 2019.", "U.S. Department of Justice. “Statement from Attorney General William P. Barr on the Death of Jeffrey Epstein.” Press release. 10 Aug 2019.", "“AG Bill Barr speaks at a Fraternal Order of Police conference.” Fox News video. 12 Aug 2019.", "U.S. Attorney’s Office, Southern District of New York. “Statement of Manhattan U.S. Attorney on the Death of Defendant Jeffrey Epstein.” @SDNYnews. 10 Aug 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]