["About this rating", "Former Starbucks CEO Howard Schultz appeared on MSNBC's \"Morning Joe\" program on 30 January 2019 to talk about his potential candidacy for the U.S. presidency. When co-host Mika Brzezinski asked Schultz to name his favorite Republican president from the last 50 years, Schultz responded with an anecdote about President Ronald Reagan.", "Schultz's reply can be glimpsed around the 11:45 mark of the following video. We've transcribed the relevant portion below:", "I have great respect for Ronald Reagan. I just came from the Ronald Reagan Library. The thing that I took away about Ronald Reagan, aside from all the wonderful things that he did, that really struck me especially compared to the current person who is despicable in the Oval Office... Ronald Reagan never took his jacket off in the Oval Office in 8 years. Why? Because of his respect for the dignity of the office. That needs to be restored.", "Howard Schultz was hardly the first person to state the idea that President Reagan never entered the Oval Office without a suit jacket or removed it once there. In 2011, for instance, Ken Langone, the co-founder of Home Depot, invoked this notion to criticize President Barack Obama for being \"unpresidential\":", "\"He is dividing us as a nation. He's not bringing us together. He's willfully dividing us. He's petulant.\"", "\"Ronald Reagan would never go into the Oval Office without his jacket on -- that's how much he revered the presidency. This guy worked like hell to be president ... Behave like a president. Let me look at you as a model to how we should behave. What does he say? Fat cats, jet airplanes. What is the purpose? Us versus them.\"", "In 1998, Ronald Reagan's son, Michael Reagan, also referenced this image while criticizing President Bill Clinton for disrespecting the Oval Office: \"", "My father, Ronald Reagan, held the presidency in such honor and reverence that he was never in the Oval Office without a coat and tie. Bill Clinton has such disrespect for the presidency that he was often in the Oval Office without his pants.", "We searched the photo galleries of the Ronald Reagan Library to see if we could turn up any images of President Reagan in the Oval Office clothed in informal attire. The vast majority of photographs we encountered of him in the Oval Office did indeed capture him in a tie and jacket -- but that wasn't always the case, so employing the absolute term \"never\" in reference to his sartorial habit is not accurate:", "A similar claim has been made about the Oval Office attire of President George W. Bush. A 2009 article published in the New York Times criticized Barack Obama for unbuttoning the formal dress code at the White House and stated that Bush had an \"ironclad rule\" about the wearing of coats and ties in the Oval Office at all times:", "Thus did an ironclad rule of the George W. Bush administration — coat and tie in the Oval Office at all times — fall by the wayside, only the first of many signs that a more informal culture is growing up in the White House under new management. Mr. Obama promised to bring change to Washington and he has — not just in substance, but in presidential style.", "Again, however, this \"ironclad rule\" wasn't exactly so ironclad. While President Bush may have worn a coat and tie during most of the time he occupied the Oval Office, the term \"at all times\" isn't  accurate:", "Stolberg, Sheryl.   \"White House Unbuttons Formal Dress Code.\"\r\n    The New York Times.   28 January 2009.", "Cox, Jeff.   \"Obama 'Unpresidential,' 'Petulant' 'Dividing Us': Langone.\"\r\n    CNBC.   28 July 2011.", "Reagan, Michael.   \"Reagan Wore Coat, Tie in Oval Office.\"\r\n    WND.   23 September 1998.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]