["About this rating", "On Aug. 20, 2020, the Twitter account @RealBasedMaga posted a photograph of Kathy Hoffman, the Arizona superintendent of public instruction, along with a piece of text that levied several false accusations. The post incorrectly claimed that Hoffman was sworn into office on a Dr. Seuss book, that she hated the Bible, and that she advocated for teaching kindergarten children about masturbation and sexual positions in schools:", "This meme claims that Hoffman was sworn in on a Dr. Seuss book because she \"hates the Bible so much.\" This claim is inaccurate, unfounded, and is based on the false assumption that lawmakers are legally required to be sworn in on a Bible.", "Although many public servants have chosen to swear their oaths of office on a Bible, this is in no way a legal requirement. In fact, people have been sworn into office using copies of the U.S. Constitution (in at least one case a digital copy), law books, various religious texts, and without any book at all. It's also worth nothing that the U.S. Constitution states that, \"No religious test shall ever be required as a qualification to any office or public trust under the United States.\"", "Hoffman chose to be sworn in on a copy of \"Too Many Moose!\", a children's book authored by Lisa M. Bakos, not Dr. Seuss. Hoffman said, \"This has a lot of sentimental value to me because this is my students favorite book, this was [what] my students always wanted to read from.\"", "Hoffman did not say that she chose this book because she \"hates\" the Bible.", "The social media post also claimed that Hoffman advocates teaching kindergarten students about \"masturbation and sexual positions.\" This is also false.", "This claim is based on a proposal crafted by Arizona State Sen. Martin Quezada, which Hoffman brought to to the State Board of Education in June 2019.  The proposal sought changes to some of the language in Arizona's sex education policies. The proposal would have replaced language prohibiting the \"teaching of abnormal, deviate, or unusual sexual acts and practices\" with a statement saying that sexual education material should be \"medically accurate.\"  The Associated Press reported that the proposal would have also allowed schools to teach sex education to boys and girls at the same time.", "All of the proposed changes can be seen here. The most relevant portions are shown below:", "This proposal, which was ultimately rejected by the State Board of Education, made no mention of teaching sexual positions or masturbation to kindergartners. In fact, Arizona sex education policy explicitly states that the materials should be age appropriate. The aforementioned proposal made no changes to this age-appropriate policy.", "It should also be noted that sex education is optional in Arizona schools and this proposal would not have changed that policy. In other words, Hoffman did not advocate to teach sexual positions and masturbation to kindergartners.", "Gutekunst, John.   \"Viral Social Media Post Contains False Information About State School Superintendent.\"\r\n    Parker Pioneer.   24 August 2020.", "The Associated Press.   \"Arizona School Board Leaves Sex Education Rules Unchanged.\"\r\n    25 June 2019.", "Rodrigo, Chris   \"New Head of Arizona Schools Takes Oath of Office on Children's Book.\"\r\n   The Hill.   25 June 2019.", "Hertzel, Laurie.   \"Bookmark: If You Were Being Sworn Into Office, What Book Would You Choose?\"\r\n    Star Tribune.   19 January 2018.", "Bromwich, Jonah.   \"You Don’t Need to Take an Oath on a Bible, or Any Religious Text.\"\r\n    The New York Times.   13 December 2017.", "Dale, Mariana; Goldstein, Steve.   \"Arizona Board Of Education Declines Changes To Sex Education Policy.\"\r\n    KJZZ.   24 June 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]