["About this rating", "An April Fools' Day post made on the blog of activist group People for the Ethical Treatment of Animals still gets passed around as fact, years after the original joke was first published.", "That 1 April 2013 post (\"PETA Set to Release Meat-Allergy–Inducing Ticks in Northeastern U.S.\") is tongue-in-cheek and laden with puns:", "We do get a little ticked off that some people are still eating animals, but we are not alone: Apparently, so does at least one breed of ticks. Scientists have discovered that the bite of the Lone Star tick causes people to develop an allergy to meat. Once a person has been bitten, if he or she eats meat, things can get a little uncomfortable and a hives-like rash can break out within hours. That gave PETA the germ of an idea, and we’d like your input.", "Currently, the ticks are predominantly found in the southeastern United States. But PETA has hatched a plan to release Lone Star ticks in parks in the Northeast, hoping that warming weather and moist conditions will help the ticks thrive. PETA’s Don Beleav, a biologist who is investigating the feasibility of the project, explained how the resulting meat allergies will greatly benefit human beings who come into contact with the ticks.", "Years later, the joke has morphed into a claim, albeit a somewhat random one. In the context of 2013, however, such a joke makes a bit more sense. In late November 2012, NPR reported on scientific discoveries suggesting that Lone Star Ticks can, in rare and specific cases, cause an allergy to a carbohydrate found in meat — a story that was widely shared online at the time:", "The meat allergy, known as alpha-gal for a sugar carbohydrate found in beef, lamb, and pork, produces a hive-like rash – and, in some people, a dangerous anaphylactic reaction – roughly four hours after consuming the meat. It's caused by antibodies to the alpha-gal sugar that are produced in humans after they are bitten by common Lone Star ticks.", "Now, the government has not yet issued health warnings about meat allergies associated with these ticks — such allergies are still quite rare, and like many other food allergies, the presence of the antibody doesn't necessarily guarantee an allergic response. Scientists say the allergy-inducing tick bites have affected about 1,500 people since it was first reported in 2008 —compared to the roughly 25,000 new cases of Lyme diseases reported every year.", "While, scientifically, it is possible for a tick to occasionally cause a meat allergy, PETA’s post highlighting these scientific developments were a prank meant to \"draw attention to a serious issue\", according to PETA spokesperson Nicole Dao:", "PETA's Lone Star tick breeding program is as fictitious as a happy elephant in the circus.", "[...]", "Our April Fool's joke is a fun way to draw attention to a serious issue: that with all the delicious meat-free options out there today, you don't have to be left out in the woods — you can go vegetarian.", "Finn, Lisa.   \"PETA's Joke About Meat Allergy Ticks Flops on North Fork.\"\r\n    North Fork Patch.   2 April 2013.", "Wolver, Susan, et al.   “A Peculiar Cause of Anaphylaxis: No More Steak?\"\r\n    Journal of General Internal Medicine.   February 2013.", "Kroen, Gretchan Cuda.   “Rare Meat Allergy Caused By Tick Bites May Be On The Rise.\"\r\n    NPR The Salt.   November 2012.", "Kretzer, Michelle.   “PETA Set to Release Meat-Allergy–Inducing Ticks in Northeastern U.S.\"\r\n    NPR The Salt.   November 2012.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]