["About this rating", "Alabama Senatorial candidate Roy Moore has led a controversial public career, to say the least. Its highlights include being sued by the American Civil Liberties Union when he was Chief Justice of the Alabama Supreme Court for erecting a monument bearing the Ten Commandments in the court building in 2001, and being dismissed from the bench by a state judiciary panel in 2003 for refusing to remove it.", "He was also an unapologetic \"birther,\" freely promoting and promulgating roundly disproven rumors that President Barack Obama wasn't born in the United States and was secretly a Muslim, and argued that \"homosexual conduct\" should be illegal.", "Although his views struck a chord with a subset of Alabama voters, propelling him to the Republican Party nomination in a run for the U.S. Senate seat vacated by Attorney General Jeff Sessions, at least one member of his own party, Sen. Jeff Flake (R-Arizona), refused to endorse him on the grounds that Moore had \"expressed his personal belief that a practicing Muslim should not be a member of Congress because of his faith\":", "When a judge expressed his personal belief that a practicing Muslim shouldn’t be a member of Congress because of his religious faith, it was wrong.", "That this same judge is now my party’s nominee for the Senate from Alabama should concern us all.", "Religious tests should have no place in the Senate. Standing up for people of faith, whether Muslim or Catholic, who are facing unfair prejudice should be an act of basic conscience. It should be expected of all of us, regardless of party.", "In point of fact, imposing any sort of religious test as a qualification to hold office in the United States government is a violation of Article VI of the U.S. Constitution, which reads:", "The Senators and Representatives before mentioned, and the Members of the several State Legislatures, and all executive and judicial Officers, both of the United States and of the several States, shall be bound by Oath or Affirmation, to support this Constitution; but no religious Test shall ever be required as a Qualification to any Office or public Trust under the United States.", "Moore made the statement Flake was referring to in a December 2006 op-ed piece on the conservative web site WorldNetDaily concerning the election to the U.S. House of Representatives of Keith Ellison (D-Minnesota), a Muslim. The article was unambiguously titled \"Muslim Ellison Should Not Sit in Congress\" and compared allowing Ellison to go through with his expressed intention to be sworn in on the Quran instead of the Bible to allowing members of Congress to take their oaths on a copy of Mein Kampf:", "Our Constitution states, “Each House [of Congress] shall be the judge … of the qualifications of its own members.” Enough evidence exists for Congress to question Ellison’s qualifications to be a member of Congress as well as his commitment to the Constitution in view of his apparent determination to embrace the Quran and an Islamic philosophy directly contrary to the principles of the Constitution. But common sense alone dictates that in the midst of a war with Islamic terrorists we should not place someone in a position of great power who shares their doctrine. In 1943, we would never have allowed a member of Congress to take their oath on “Mein Kampf,” or someone in the 1950s to swear allegiance to the “Communist Manifesto.” Congress has the authority and should act to prohibit Ellison from taking the congressional oath today!", "When asked by an MSNBC reporter in October 2017 if he stands by those views, Moore replied in the affirmative:", "Read my article and you’ll find out what I believe. It’s clarified very clearly in my article.", "In addition to criticism of his extreme views, Moore was hit in November 2017 with allegations (as yet unproven) that as a thirtysomething assistant district attorney in Etowah County, Alabama he initiated sexual encounters with underaged girls — including one who was allegedly just 14 years old.", "Beavers, Olivia.  \"Ala. Senate Hopeful Moore in 2005: Homosexuality Should Be Illegal.\"\r\n  The Hill.  21 September 2017.", "Bonk, Lawrence.  \"Roy Moore Stands by Assertion Keith Ellison Shouldn't Sit in Congress Because He's Muslim.\"\r\n  Mediaite.  31 October 2017.", "Kaczynski, Andrew and LeBlanc, Paul.  \"GOP Senate Candidate Roy Moore Has Said He Doesn't Believe Obama Is a Natural-Born Citizen.\"\r\n  CNN.  23 August 2017.", "Kamisar, Ben.  \"Roy Moore's Five Most Controversial Remarks.\"\r\n  The Hill.  24 September 2017.", "McCrummen, Stephanie, Reinhard, Beth and Crites, Alice.  \"Woman Says Roy Moore Initiated Sexual Encounter When She Was 14, He Was 32.\"\r\n  The Washington Post.  9 November 2017.", "Moore, Roy.  \"Muslim Ellison Should Not Sit in Congress.\"\r\n  WorldNetDaily.  13 December 2006.", "CNN.  \"Ten Commandments Judge Removed from Office.\"\r\n  14 November 2003.", "Flake.senate.gov.  \"Flake: 'Religious Tests Should Have No Place in the Senate.\"\r\n  31 October 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]