["About this rating", "Charlie Chaplin was an actor, director, composer, and according to a persistent internet rumor, the author of a poem entitled, \"As I Began to Love Myself\":", "As I began to love myself I found that anguish and emotional suffering\nare only warning signs that I was living against my own truth.\nToday, I know, this is “AUTHENTICITY”.", "As I began to love myself I understood how much it can offend somebody\nAs I try to force my desires on this person, even though I knew the time\nwas not right and the person was not ready for it, and even though this\nperson was me. Today I call it “RESPECT”.", "As I began to love myself I stopped craving for a different life,\nand I could see that everything that surrounded me was inviting me to grow.\nToday I call it “MATURITY”.", "As I began to love myself I understood that at any circumstance,\nI am in the right place at the right time, and everything happens\nat the exactly right moment. So I could be calm.\nToday I call it “SELF-CONFIDENCE”.", "As I began to love myself I quit steeling my own time,\nand I stopped designing huge projects for the future.\nToday, I only do what brings me joy and happiness, things I love to do\nand that make my heart cheer, and I do them in my own way and in\nmy own rhythm. Today I call it “SIMPLICITY”.", "As I began to love myself I freed myself of anything that is no good for\nmy health – food, people, things, situations, and everything that drew\nme down and away from myself. At first I called this attitude\na healthy egoism. Today I know it is “LOVE OF ONESELF”.", "As I began to love myself I quit trying to always be right, and ever since\nI was wrong less of the time. Today I discovered that is “MODESTY”.", "As I began to love myself I refused to go on living in the past and worry\nabout the future. Now, I only live for the moment, where EVERYTHING\nis happening. Today I live each day, day by day, and I call it “FULFILLMENT”.", "As I began to love myself I recognized that my mind can disturb me\nand it can make me sick. But As I connected it to my heart, my\nmind became a valuable ally. Today I call this\nconnection “WISDOM OF THE HEART”.", "We no longer need to fear arguments, confrontations or any kind of problems\nwith ourselves or others. Even stars collide, and out of their crashing\nnew worlds are born. Today I know THAT IS “LIFE”!", "In addition to the numerous websites that reproduced this poem in full while attributing it to Chaplin, a few stanzas of this poem have also been used to create share-worthy memes featuring the famous actor's image:", "This poem, however, was not penned by the silent-era actor. This actually appears to be an English translation of a Portuguese translation of an English-language book written by Kim and Alison McMillen.", "Before we get to the somewhat convoluted origins of this poem, let's consider the fact that Charlie Chaplin, who passed away at the age of 88 in 1977, was one of the most famous actors of the silent era. In addition to his own autobiography, dozens of books have been written and movies made about his life and work. If Chaplin truly wrote this poem, we should be able to easily find a record of where and when it was originally published. Yet, we were unable to find references to Chaplin's writing of this poem in any credible source. It seems that this poem has only been attributed to Chaplin on random blogs and internet memes.", "As for the poem itself, it appears to be a reworking of a selection of stanzas that were originally published in 2001 in the book \"When I Loved Myself Enough.\" Although the  stanzas in the alleged Chaplin poem are not verbatim replicas of passages in the McMillens' book, they express familiar sentiments with similar language:", "When I loved myself enough I quit settling for too little.", "When I loved myself enough I came to know my own goodness.", "When I loved myself enough I began taking the gift of life seriously and gratefully.", "When I loved myself enough I began to know I was in the right place at the right time and I could relax.", "When I loved myself enough I felt compelled to slow down way down. And that has made all the difference.", "In 2003, this book was translated into Portuguese by Iva Sofia Golcalves Lima under the title, \"Quando Me Amei de Verdade.\" That translated text was later abbreviated to a few select passages and started to spread around the internet. Here's how a portion of that text appeared in one 2005 blog post:", "Quando me amei de verdade pude compreender que, em qualquer circunstância, eu estava no lugar certo, na hora certa.\nEntão pude relaxar.", "Quando me amei de verdade pude perceber que o sofrimento emocional\né sinal que estou indo contra minha verdade.", "Quando me amei de verdade parei de desejar que a minha vida fosse\ndiferente e comecei a ver que tudo que acontece contribui\npara o meu crescimento.", "When I truly loved myself, I could understand that under any circumstances I was in the right place at the right time.\nThen I could relax.", "When I truly loved myself, I realized that emotional suffering\nIt's a sign that I'm going against my truth.", "When I truly loved myself I stopped wishing my life was different and I started to see that everything that happens contributes\n for my growth.", "This text continued to evolve as it was translated back into English. It's not entirely clear when Chaplin's name was first attached to the text, but it appears to have been sometime around 2007, about 30 years after the actor's death.", "In sum, the poem \"As I Began to Love Myself\" was not written by Charlie Chaplin. As far as we can tell, this poem is actually an English translation of Portuguese translation of an English language book written by Kim and Alison McMillen in 2001 entitled \"When I Loved Myself Enough.\" That text was then altered even further into the shareable form it consists of today. It's unclear who arranged these stanzas into their current form.", "Comoutrosolhos.   \"'As I Began to Love Myself' Don't Belongs to Chaplin!\"  \r\n  16 December 2009.", "McMillen, Alison and Kim McMillen.   \"When I Loved Myself Enough.\"\r\n    London: Pan MacMillan, 2001.  ISBN 978-0283073373.", "Exploring Your Mind..   \"'As I Began to Love Myself': A Wonderful Poem by Charlie Chaplin.\"\r\n    8 January 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]