["About this rating", "It is now common knowledge (hat tip to the Internet) that President Donald Trump's ancestral family name was Drumpf, a presumably respectable German surname that sounds, unfortunately — to English speakers' ears, at any rate — like a sack of potatoes hitting the bed of a donkey cart.", "At some point (a century, or two, or perhaps three ago; the exact timing of it remains unclear), a forebear shortened the family name to Trump: \"a good move,\" Donald Trump noted in 2004, \"since Drumpf Tower doesn't sound nearly as catchy.\"", "During the early months of Trump's presidential campaign in 2015, naysayers deployed Drumpf to great effect as a put-down, sometimes even alleging (falsely) that Drumpf, not Trump, was the candidate's real name.", "It was around the same time that Trump antagonists caught on to another peculiarity of the President-to-be's surname, which is that it can be passed off as the root of the English noun trumpery, which has been in use since the 1400s and is rife with derogatory connotations. You can imagine these people's delight to discover, for example, that the current edition of Merriam-Webster defines trumpery as \"worthless nonsense,\" or a collection of \"trivial but useless articles.\" And that's just for starters:", "Webster's Unabridged. 1983 pic.twitter.com/dAXqt5dGHq", "— Phillip Adams (@PhillipAdams_1) January 30, 2017", "The Oxford English Dictionary, as historian Simon Schama noted in November 2015, defines trumpery thusly:", "OED definition of trumpery: 1) deceit, fraud, imposture, trickery; 2) something of less value than it seems..worthless stuff, trash, rubbish", "— Simon Schama (@simon_schama) November 20, 2015", "Nor is this a new usage. The 1780 edition of Thomas Sheridan's General Dictionary of the English Language yields a very similar definition:", "The list of synonyms for trumpery leaves nothing to the imagination:", "To be absolutely clear, however, apart from their being partial homonyms, the proper name Trump, which is a simplification of Drumpf, a surname of German origin, is not linguistically related to trumpery, the root of which is French, and originally meant \"to deceive.\" The Merriam-Webster web site explains:", "Trumpery derives from the Middle English trompery and ultimately from the Middle French tromper, meaning \"to deceive.\" (You can see the meaning of this root reflected in the French phrase trompe-l'oeil-literally, \"deceives the eye\"-which in English refers to a style of painting with photographically realistic detail.) Trumpery first appeared in English in the mid-15th century with the meanings \"deceit or fraud\" (a sense that is now obsolete) and \"worthless nonsense.\" Less than 100 years later, it was being applied to material objects of little or no value. The verb phrase trump up means \"to concoct with the intent to deceive,\" but there is most likely no etymological connection between this phrase and trumpery.", "Not to put too fine a point on it, but anyone who tries to convince you that there is anything deeper than a rhetorical connection between Trump, trump up, and trumpery is engaging in a boldfaced example of the latter. Feel free to call them on it.", "Hobson, Archie (ed.).    The Oxford Dictionary of Difficult Words.\r\n        Oxford: Oxford University Press, 2004.      ISBN 9780195173284      (p. 447).", "Sheridan, Thomas.      A General Dictionary of the English Language, Vol. 2.\r\n        London: Dodsley, Dilly and Wilkie, 1780    (p. 400).", "Trump, Donald J. and Meredith McIver.      Trump: Think Like a Billionaire: Everything You Need to Know About Success, Real Estate and Life.\r\n        New York: Random House, 2004.      ISBN 9781588364371      (p. xiv).", "Merriam-Webster Dictionary (online).      \"Trumpery.\"\r\n       2016.", "Wordsmith.org.      \"Trumpery.\"\r\n        20 October 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]