["About this rating", "President Trump was widely criticized over Veterans Day weekend in November 2018 after he skipped an event at the Aisne-Marne American Cemetery in France commemorating the 100th anniversary of the end of World War 1 due to inclement weather.", "Social media users chided Trump for bowing out of the scheduled event, which was attended by other world leaders such as Canadian Prime Minister Justin Trudeau, German Chancellor Angela Merkel, and French President Emmanuel Macron, sharing photographs of \"real presidents\" who had previously honored veterans while standing in the rain.", "President Trump took issue with this coverage, however, and on 13 November 2018 he took to Twitter to explain his absence (asserting that his helicopter couldn't fly because of the rain) and proclaim that he had delivered a speech in the \"pouring rain\" the following day but that the event was \"little reported\" by the \"fake news\":", "President Trump's explanation for missing the memorial at the Aisne-Marne American Cemetery might have been regarded as questionable, but President Trump truly did deliver a speech in the rain (although we'd quibble with the assertion that it was \"pouring\") at the American Cemetery of Suresnes, as NBC News reported:", "President Donald Trump paid tribute on Sunday to Americans who fought in the two world wars, saying the nation is forever in their debt during a visit to a cemetery in France where more than 1,500 of them are buried.", "“It’s been a wonderful two days we spent in France, and this has certainly been the highlight of the trip,\" Trump said in remarks that capped a weekend in Paris where he and more than 80 other world leaders marked the 100th anniversary of the end of World War I ...", "Standing at the presidential podium under a steady rain without an umbrella, Trump joked to six World War II veterans about their enviable position keeping them dry.", "“You look so comfortable up there under shelter as we're getting drenched,” Trump said, drawing laughter from the crowd. “Very smart people.”", "“You look like you’re in very good shape, all of you,” he added. “I hope I look like that some day. America is forever in your debt.”", "The ceremony in Suresnes certainly drew less attention on social media than Trump's absence at the Aisne-Marne American Cemetery the previous day did, but it isn't accurate to say that his visit to the Suresnes Cemetery was \"little reported.\" In addition to the aforementioned NBC News report, Trump's speech was also covered by outlets such as CNN, USA Today, CBS News and Time magazine.", "Despite this coverage, a number of social media users seemed surprised when they came across a photograph posted to Facebook by Dan Scavino, the White House Director of Social Media, which showed President Trump standing solemnly in the rain at a cemetery:", "Social media users took to the comments section to claim that this image was fake and that Trump had been digitally inserted into the picture. While it's possible that Scavino applied some sort of filter to this photograph (Trump's outline is surprisingly crisp), a number of similar pictures can be found via news outlets such as NBC News and photography agencies such as Getty Images:", "Embed from Getty Images", "Jackson, David.   \"President Trump Blames Secret Service for Canceling Cemetery Trip in France.\"\r\n    USA Today.   13 November 2018.", "Lee, Carol.   \"Trump Pays Tribute to the Veterans and Alliances of Two World Wars.\"\r\n    NBC News.   11 November 2018.", "Brinlee, Morgan.   \"Trump Canceled a U.S. Military Cemetery Visit Due to Rain, and Twitter Was Not Impressed.\"\r\n    Bustle.   11 November 2018.", "Belam, Martin.   \"French Army Trolls Trump with Picture of Them Training in Rain.\"\r\n    Guardian.   12 November 2018.", "Horton, Alex.   \"Trump Skipped a U.S. Cemetery Visit Abroad. The French Army Trolled Him for Avoiding the Rain.\r\n    The Washington Post.   12 November 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]