["By Saranac Hale Spencer", "Posted on November 2, 2017 | Corrected on November 9, 2017", "Q: Is the Department of Defense planning a drill that will cause a nationwide blackout? Is antifa involved?", "A: No and no. The Army is conducting a drill with ham radio operators, and it has nothing to do with antifa.", "I was wondering, does the Department of Defense plan on doing a globe wide EMP [electromagnetic pulse] to simulate a “very bad day”? And if so, is the antifa really going to overthrow our government?", "The U.S. Army is planning to conduct its regularly scheduled communications drill with ham radio operators starting on Nov. 4. It will have no effect on the electric power grid.", "The drill typically involves several hundred amateur radio operators practicing how they would use their equipment to help military communications in the event of a major power outage, according to a statement that Charlie Stadtlander, chief of public affairs for the U.S. Army Cyber Command, sent to us.", "The exercise has gone largely unnoticed each year since it started in 2013. But not this year. That’s because Nov. 4 is also the date on which far-right bloggers have forecast a violent uprising by antifa, a loosely organized group of anti-fascist activists. So, some websites have now spun the annual ham radio exercise into a conspiracy theory involving a government shutdown of the power grid in concert with an antifa-led riot.", "Neither of these things is true.", "The idea of an antifa uprising was stoked by a now deleted tweet that said: “can’t wait for November 4th when millions of antifa supersoldiers will behead all white parents and small business owners in the town square.”", "The writer of the tweet — whose feed is rife with Trump family jokes and antifa-related humor — explained in a column for Vice that it was intended to be satire.", "Gateway Pundit, a conservative blog, wrote about the tweet as though it were an earnest threat, and that story was picked up and published on several sites. It was also flagged by Facebook users as potentially false.", "At least one leftist group is planning to hold rallies in cities across the country on Nov. 4. But, Andy Zee, one of the founders of that organization, called Refuse Fascism, told the Washington Post that the group is committed to non-violent protest.", "“It’s absurd. Calling for a civil war?” Zee told the Post. “Pick a date for a civil war? Honestly, what do you say to this?”", "As for the idea that the Department of Defense is planning to shut down the power grid on Nov. 4, that originated with an announcement on the website for the American Radio Relay League, an amateur radio association. The announcement said in part: “Elements of the US Department of Defense (DOD) will conduct a ‘communications interoperability’ training exercise November 4-6, once again simulating a ‘very bad day’ scenario.”", "That announcement was then publicized on InfoWars, a popular conservative website, which suggested that it might be related to antifa.", "That idea was then picked up by other websites and bloggers, such as the Gateway Pundit, which ran a story that trumpeted the headline: “REPORT: Pentagon Plans ‘National Blackout Drill During Antifa Protests In November.'” It was flagged by Facebook users as being potentially false.", "The Gateway Pundit blog post, which quotes heavily from the amateur radio association’s announcement, cites an unrelated executive order that it falsely claims mandates the blackout drill. The executive order says: “Space weather has the potential to simultaneously affect and disrupt health and safety across entire continents. Successfully preparing for space weather events is an all-of-nation endeavor that requires partnerships across governments, emergency managers, academia, the media, the insurance industry, non-profits, and the private sector.”", "But that language actually comes from an executive order signed by former President Barack Obama in October 2016 that deals largely with preparing for space weather events, like solar flares, that could interrupt the power grid.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Correction, Nov. 9: We incorrectly referred to the amateur radio organization as the National Association for Amateur Radio. It is called the American Radio Relay League. We have changed the story accordingly.", "Stadtlander, Charlie. Spokesman, U.S. Army Cyber Command. Email sent to FactCheck.org. 1 Nov 2017.", "Nelson, Krang T. “Twitter Suspended Me for Trolling White Supremacists.” Vice. 31 Oct 2017.", "Wintrich, Lucian. “ANTIFA Leader: ‘November 4th […] millions of antifa supersoldiers will behead all white parents.’” The Gateway Pundit. 30 Oct 2017.", "Swenson, Kyle. “The antifa apocalypse is coming this weekend, if you believe the hype.” Washington Post. 1 Nov 2017.", "American Radio Relay League. “Communicationa Interoperability Training with Amateur Radio Community Set.” ARRL.org. 24 Oct 2017.", "Drew, Rob. “Breaking: DOD Exercise To Simulate National Power Grid Collapse On Antifa Day Of Rage.” Infowars.com. 24 Oct 2017.", "Caplan, Joshua. “REPORT: Pentagon Plans ‘National Blackout Drill During Antifa Protests In November.’” The Gateway Pundit. 27 Oct 2017.", "Obama, Barack. Executive Order 13744. 13 Oct 2016.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]