["A photo of a purported hospital notice was published here on a Facebook page called Philippines Report on July 4, 2019, with a caption saying: “For public awareness”.", "The purported notice says: “This message is to inform you all that dengue viral is going on. So please use coconut oil below your knees till your footsteps. It is an antibiotic. And a dengue mosquito can not fly higher than knees. So please keep this in mind & start using it. Spread this message to as much as you can. Your one message can save many life’s. Dr. B. Sukumar, Sri Saisudha Hospital.”", "Below is a screenshot of the misleading post:", "Similar claims about the benefits of coconut oil in protecting against dengue have circulated online for years, for example here in a September 19, 2016 post on an Indian Facebook page. A similar post was also shared here on Twitter.", "The claim is false, according to experts from World Health Organization, the International Vaccine Institute, and the University of the Philippines’ National Institutes of Health.", "Dengue is a disease caused by a virus spread primarily by female mosquitoes of the species Aedes aegypti, according to this descripton published on the World Health Organization website on April 29, 2018.", "“Coconut oil is not an antibiotic. There is no evidence to show that it can prevent or cure dengue,” Dr Gawrie Loku Galappaththy, Medical Officer, Malaria and other Vectorborne and Parasitic Diseases from WHO Philippines told AFP in an email sent on July 10, 2019.", "Dr Anh Wartel from the International Vaccine Institute, a body which develops vaccines for different diseases including dengue said antibiotics are not used for viral infections.", "“Coconut oil is not an antibiotic. There is no evidence to show that it can prevent or cure dengue.”", "“Antibiotics are prescribed for bacterial infection, not for viral infection,” she told AFP in an email on July 7.", "Dr Edsel Salvana, Director of the Institute of Molecular Biology and Biotechnology at the National Institutes of Health-University of the Philippines Manila and adjunct Professor for Global Health at the University of Pittsburgh said there is no reliable scientific data which proves that coconut oil can prevent or cure dengue.", "“It is not an antibiotic in the sense that you can reliably use it for treatment of infection. It does have some antimicrobial properties but there are no randomized controlled trials that have proven its efficacy in active infection. It cannot be used to prevent dengue. There is no reliable scientific data that it can prevent dengue or any biological mechanism that shows that it can cure dengue. This can only be shown by a randomized controlled trial and I am unaware of any trials that have been published in reputable peer-reviewed scientific journals”, he said in an email to AFP on July 8.", "Salvana also said any oil can be used as a “barrier for mosquito bites”, but they are not reliable.", "“Any oil can be used as a barrier for mosquito bites, but these are not reliable or practical over the course of a day. Proven mosquito repellents like DEET have a chemical repellant effect on mosquitoes. There is one study that studies compounds with mosquito and other insect repellant properties of fatty acids derived from coconut oil but these are concentrated extracts, and unprocessed coconut oil had no effect on stable flies and was not tested against mosquitoes”, he said.", "The experts also agreed that it is not true that mosquitoes which spread dengue cannot fly higher than the knees.", "In an email to AFP on July 7, Wartel said: “Aedes aegypti, infected mosquitoes can transmit dengue, they may spend their lifetime in or around the houses where they emerge as adults and they usually fly an average of 400 meters. It is not accurate to state that they cannot fly higher than the knees”.", "In an email to AFP on July 8, Salvana said: “The dengue carrying mosquito Aedes aegypti is generally low flying and day biting but it can bite above the knees without any problems. The misconception is probably due to the fact the the mosquito is traditional only associated with low altitudes <2000 meters. However, with global warming the mosquitoes are now starting to tolerate higher elevations and have been found above 2000 meters”.", "\"The dengue carrying mosquito Aedes aegypti... can bite above the knees without any problems.\"", "In addition, the doctor identified as the author of the public health warning in this misleading post, Dr. B. Sukumar, told AFP he did not issue such notice.", "“This message is being shared online for past 4 years. I have already denied issuing any notice. I don't know why every year this message gets shared on WhatsApp. It is a fake news, I have never issued any alert or such notice,\" he said July 5.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]