["“CDC admits 98 million Americans were given cancer virus via the polio shot,” announces a headline on vaccine.news, a website dedicated to questioning vaccination efforts worldwide. The article is based on a supposedly now-censored “grand admission” from the Center for Disease Control (CDC), the American government agency that oversees vaccines.", "The article was also shared in French, Spanish, and Portuguese.", "In 2013, the CDC published a facts sheet about the SV40 virus and the contamination of the first polio vaccines administered in the 1950s. “The CDC quickly took down the page, along with Google,” the vaccine.news article claims, but the web page was saved in an internet archive and is still available today.", "Further, there is no evidence that the CDC is trying to censor information connected to the contamination of the first polio shots. Official government websites explain the details and implications of the contamination episode here, here, and here.", "Kristen Nordlund, a spokesperson for the CDC told AFP by email, \"every few years and as website technology changes we redesign CDC’s website.\" She added that the archived page was \"multiple versions ago of the website.\"", "The vaccine.news article was recently shared in Canada and in Asia via Facebook groups with thousands of members, even though the SV40 virus has not been in polio vaccines since 1963.", "The first polio vaccines were developed in the 1950s by American scientists Jonas Salk and Albert Sabin. The strains of viruses used in their vaccines were cultivated in monkey kidney cells, a normal part of the vaccine making process at the time.", "It was later discovered that some of the green monkey kidney cells had been contaminated by a simian virus, SV40. The virus affected an estimated 10-30% of vaccines between 1955 and 1963. Around 98 million people had received the polio vaccine in those years, and therefore only between 10 and 30 million people were concerned.", "The CDC website points out, “most studies looking at the relationship between SV40 and cancers are reassuring, finding no causal association between receipt of SV40-contaminated polio vaccine and development of cancer.” Examples of studies on the correlation between SV40 and cancer can be found here, here and here.", "Eric Engels, Chief of the Infections and Immunoepidemiology Branch of the National Cancer Institute, took part in one of the studies mentioned above. He told AFP that “The field has largely concluded that SV40 is not a cause of human cancer, and that is my belief as well.”", "He added that in the case of studies that detected the SV40 virus in human tumors, “the consensus is now that those reports were false positive results.”", "According to the Canadian Public Health Association (CPHA), polio peaked in Canada in 1953 with nearly 9,000 cases and 500 deaths. Through vaccination, CPHA said Canada was declared “polio free” in 1994. The list of polio vaccines authorized in Canada and their ingredients are available on the Canadian government’s website.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]