["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Michelle Nunn has kept a mostly low profile during this year's primary election season, correctly gauging that she had the Democratic nomination for the U.S. Senate sewn up.", "Her pre-primary television ads were upbeat, talking about her work with former President George H.W. Bush’s Points of Life Foundation and even life lessons she learned from her grandma.", "That has left GOP operatives and political pundits to pore over her every statement, and they have. They’ve been particularly eager to pin her down on the Affordable Care Act, or Obamacare, which Republicans know is a polarizing issue.", "The Washington Examiner on June 9 wrote that Nunn has avoided addressing the Affordable Care Act. It’s a strategy that’s also gleaned attention from The Washington Post, The New Republic, The Associated Press and others.", "PolitiFact Georgia decided to take a look at whether Nunn can be accused of dodging and weaving on the ACA.", "Nunn, the daughter of former U.S. Sen. Sam Nunn, easily defeated three challengers in the May 20 Democratic primary. She has received national funding from Democrats, who hope to win a seat in what is still a mostly conservative state controlled by Republicans. In November, she will face either U.S. Rep. Jack Kingston or businessman David Perdue, who are in the GOP’s July 22 runoff.", "Our first step was to determine what Nunn has said publicly.", "Nunn has said multiple times that she doesn’t support repealing the ACA. She's embraced the widely viewed positives of the law: coverage for pre-existing conditions and expansion of parents’ health care coverage to children to age 26.", "She also has identified specific problems in the law -- namely that premium rates aren't always affordable and that families are sometimes given less choice concerning their insurance plans.", "Her stance is clear on this point: Georgia and Gov. Nathan Deal should have accepted Medicaid expansion under the ACA.", "Where the pundits say she’s been evasive is on the question of whether she would have voted for the ACA in 2010. Some would say she has dodged that question like Floyd Mayweather weaving away from a right hook.", "\"At the time the Affordable Health Care Act was passed, I was working for Points of Light. I wish we had more people who had tried to architect a resolution,\" Nunn said to an MSNBC reporter in May. \"I think it’s impossible to look back retrospectively and say, ‘What would you have done when you were there?’ \"", "She was later zinged by MSNBC News Chief Chuck Todd for those comments.", "\"It just doesn’t come across as credible,\" Todd said of her statement. \"Nothing screamed practiced politician like that answer.\"", "A quick look at the \"Ideas\" section of her campaign website shows no mention of health care. Her campaign links to a few news articles that mention the law, but none of her press releases or news links mention it in their headlines. That’s in stark contrast to the other two candidates, who both list \"Repeal Obamacare\" prominently on their campaign websites.", "During a primary debate in Cobb County, Perdue called the ACA \"the worst thing in American history legislatively.\" Kingston says the law \"has been a failure.\"", "Nationally, the ACA has been a political quagmire for candidates. Do they fall with the vocal critics? Or do they stand with the law of the land? And that’s arguably an even tougher call in Georgia, where 50.8 percent of residents still oppose the law and 45.2 percent support it, according to the 2014 Georgia State of the State poll.", "We asked Kyle Kondick, the managing editor for the University of Virginia Center for Politics’ Crystal Ball blog, for his take.", "\"The state, in many ways, determines the messaging,\" Kondick said. \"It’s no surprise to me that she’s dodging that question.\"", "The typical strategy for Democrats in red states, such as Georgia, is to depict themselves as middle-of-the-road candidates while painting other candidates as unlikable, Kondick said.", "That might work for Alison Lundergan Grimes, a Democrat also running for the Senate and facing a similar challenge on whether to support or denounce the controversial law. She faces a Kentucky electorate that is not as diverse as Georgia’s, and her response has been to remain quiet on the issue.", "But in Georgia, there are still a lot of Democratic and minority voters, which means Nunn can’t stray too far right.", "\"You can’t run exclusively like a Republican because how are people going to come out and vote for you?\" Kondick said. \"You’re threading the needle.\"", "Nunn deflects the hypothetical questions – after all, she wasn’t in Congress to vote for or against passage of the ACA. Instead, she makes generic accusations of dysfunction among legislators.", "\"Folks in Washington need to stop playing political games and come together and fix what's wrong with the law, and preserve the parts that are working,\" Nunn said in a statement to Healthcare Georgia, forwarded to PolitiFact by her campaign.", "But has Nunn done \"cartwheels\" (gone of out her way) to avoid taking a stand on the controversial law?", "Nunn doesn’t prominently discuss health care on her website or in her stump speeches, despite its wide-ranging implications for the state.", "She refuses to say how she would have voted when Congress passed the ACA in 2010, but unlike her opponents, she said she would not vote to repeal the law. While she does list some of the problems with the law, she has yet to propose specific solutions on her website or in person.", "Nunn has been evasive on some aspects of Obamacare but has been very specific on other areas, such as Medicaid expansion.", "We rate the overall statement as Half True.", "Election Guide 2014: Georgia’s Candidates for United States Senate Address Our State’s Most Critical Health Challenges report.", "2014 Georgia State of the State poll.", "Michell Nunn campaign website.", "\"Michelle Nunn stumbles in new Georgia Senate polling,\" column by Blake Seitz of The Washington Examiner, published June 9.", "\"It’s Time for Michelle Nunn to Stop Running From Obamacare,\" article by The New Republic, published on May 20.", "\"Would Michelle Nunn and Alison Lundergan Grimes have voted for Obamacare? Why they’ll never tell,\" article by The Washington Post, published May 27.", "\"Michelle Nunn skirts questions on Obamacare vote,\" article by The Associated Press, published May 19", "\"Kingston speaks the truth on Obamacare,\" YouTube clip published by Jack Kingston campaign on March 31", "Emails with Nathan Click, communications director, Michelle Nunn campaign", "Phone interview with Kyle Kondick, managing editor, Crystal Ball blog, University of Virginia Center for Politics", "Audio recording from May 10 Republican primary debate in Cobb County", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]