["In the run-up to the 2014 general election, the cleaning of the Ganga was one of the major poll planks of the BJP. The Congress party has targeted Prime Minister Narendra Modi and the ruling BJP via a tweet highlighting the poor state of the river and the lackadaisical attitude of the government which “has focused on lip service rather than getting anything done”.", "With an atrocious completion rate, PM Modi has focused on lip service rather than getting anything done on cleaning the Ganga. #MaaGangaSeDhoka pic.twitter.com/7QYHSUmkXI", "— Congress (@INCIndia) October 12, 2018", "Seeking to corner the government over the ‘atrocious completion rate’ of projects related to the cleaning of the river with the rather dramatic hashtag #MaaGangaSeDhokha, the party has posted a photograph, showing the Ganga river in a dirty state.", "The photograph used by the Congress party in its tweet is not recent. Using the reverse image search tool, Alt News came across links which had posted this very photograph in 2009 and 2010.", "These websites claimed that this is a river in Israel. Using the date and time filter on Google, we searched for results restricted to 2009 and 2010. This led us to a Romanian website which had posted this photograph, claiming that it was clicked at Varanasi in April 2009. The name of the photographer was mentioned as Prakash Singh. We searched the text accompanying the photograph and found a link to the website of Getty Images, a repository of photographs.", "According to Getty Images, the photograph was taken on April 5, 2009 by Prakash Singh, depicting scavengers who were looking for valuable items among the offerings of devotees.", "In the infographic shared by Congress, it has been claimed that out of 187 projects undertaken under Namami Gange or National Mission for Clean Ganga (NMCG), only 47 have been completed. The Namami Gange programme was launched immediately after the Modi led NDA government came to power in 2014, with the objective of conservation and rejuvenation of the river.", "While verifying the data, we found that this claim pertains to data provided in Lok Sabha in February 2018. According to the latest data from NMCG website, from financial year 2011-12 to 2018-19, 236 projects have been sanctioned of which 63 projects have been completed. According to the last available data before the present Union Government came into power, by March 2014, 72 projects had been initiated under National Ganga River Basin Authority (NGBRA) of which 16 were completed. The NGBRA was the agency responsible for planning, coordination, implementation and monitoring for the Ganga river. NGRBA was dissolved with effect from the 7th October 2016, consequent to constitution of National Council for Rejuvenation, Protection and Management of River Ganga (referred as National Ganga Council).", "The death of G D Agarwal who succumbed to his indefinite fast demanding concrete measures for the conservation of the Ganga river has once again brought this lingering issue into the limelight. However, in its rush to berate the Prime Minister and the government over the continuing state of the river, the Congress party rather embarrassingly ended up using a photograph of 2009, when the UPA government was in fact in power at the centre.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]