["About this rating", "In the winter months of 2020, oblong metallic structures appeared and vanished in various locations, creating something of a public mystery — in part because the objects' appearance reminded some of the famous monolith in the 1968 science fiction film \"2001: A Space Odyssey.\"", "After making a splash and appearing in Utah on Nov. 18, 2020, a monolith appeared in Romania less than two weeks later. Both mysteriously disappeared days after they were found. Then on Dec. 2, a third one was found on Pine Mountain in Atascadero, a city in central California's coastal San Luis Obispo County.", "According to the local newspaper, The Atascadero News, the monolith has become an attraction for hikers in the area:", "The three-sided obelisk appeared to be made of stainless steel, 10-feet tall and 18 inches wide. The object was welded together at each corner, with rivets attaching the side panels to a likely steel frame inside. The top of the monument did not show any weld marks, and it appears to be hollow at the top, and possibly bottom.", "Unlike its Utah sibling, the Atascadero obelisk was not attached to the ground, and could be knocked over with a firm push. The Atascadero News estimates it weighs about 200 pounds.", "As of this writing, there is no publicly-known explanation as to who is responsible for the objects or why they are appearing, although a working hypothesis is that they are part of a guerrilla art installation. Some joked that the monoliths were the work of extraterrestrials.", "The monolith was torn down overnight by a group of white supremacists decked out in gear labeled with the campaign slogan of U.S. President Donald Trump, \"Make America Great Again,\" as reported by Vice on Dec. 3, 2020. One of the men stated on a livestream video of their activity, “Christ is king in this country. We don’t want illegal aliens from Mexico or outer space.\"", "Updated to note the structure was torn down by a group of white supremacists.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]