["About this rating", "In July 2019, a Twitter account that has posted multiple celebrity death hoaxes issued a tweet purporting that comedian/actor Adam Sandler had died in New York at the age of 52:", "The actor and film producer Adam Sandler has died at his New York home at the age of 52.", "— Marxist Nikes (@VRSJMS) July 25, 2019", "This tweet was yet another hoax.  As of this writing, Adam Sandler was alive and preparing for his role in the crime-thriller Uncut Gems.", "This was far from the first instance of an Adam Sandler death hoax. Back on 29 September 2015, the entertainment web site Link Beef published an reporting that Sandler had been found dead of an apparent suicide at age 49:", "US actor and comedian Adam Sandler has been found dead, aged 49, in an apparent suicide.", "Marin County Police in California said he was pronounced dead at his home shortly after officials responded to an emergency call around noon local time.", "“At this time, the Sheriff’s Office Coroner Division suspects the death to be a suicide due to asphyxia, but a comprehensive investigation must be completed before a final determination is made,” police said in a statement.", "In a statement, Adam’s wife, Jackie Sandler, said she was “utterly heartbroken” and asked that he be remembered for the joy he brought to the world.", "“This morning, I lost my husband and my best friend, while the world lost one of its most beloved artists and beautiful human beings. I am utterly heartbroken,” she said.", "There was no truth to that story. Link Beef was one of many junk news websites publishing fabricated stories, such as ones about a gang member gold-plating his genitals and another about a a “lab-grown” baby.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]