["About this rating", "This is a genuine photograph of a family wearing masks during a flu epidemic, circa 1920.", "Whether the cat is wearing a mask, or just has a white face.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In the summer of 2020, as many city and state officials urged citizens to wear masks in order to slow the spread of coronavirus, a photograph supposedly showing a family (and their cat) wearing masks during the 1918 flu epidemic started to circulate on social media:", "This is a genuine photograph of a family wearing masks during a flu epidemic, circa 1920. However, we're not entirely convinced that this cat is also wearing a mask.", "This photograph comes from the City of Dublin California Heritage Center. While specific details about the image are unknown (such as the identity of the pictured family), this image is accompanied by a caption noting that the photo was taken in Dublin, California around 1920, and shows a family taking precautions to protect themselves from a flu that had already killed millions of people:", "By 1919, the influenza pandemic killed between 20 and 40 million people. So great was the fear of contracting this deadly virus that people as far away as Dublin took whatever precautions they could to protect themselves.", "While it may appear, at first glance, as if this cat is wearing a mask, a closer inspection introduces doubt to this claim. When we zoom in on this image, it appears that the cat's nose and mouth are both visible, indicating that this may just be a cat with white fur on its face.", "We spoke with Tyler Phillips, the coordinator who oversees Dublin’s Heritage Park & Museums, in the hopes of putting an end to cat-mask-gate, but Phillips informed us that it was difficult to discern any additional details from the physical photograph, as it was too small and old. Phillips told us that there was much debate among the staff at the museum over whether or not the cat was wearing a mask, or if this was just a sort of optical illusion:", "That picture has been getting a lot of attention lately. Unfortunately this photo did not come with much information when we acquired it. All we know about this picture is that it is of a family in Dublin California, taken between 1918-1920 during a flu outbreak. The fun thing about this photo is that it does appear that even the cat is wearing a mask, but unfortunately we cannot prove that. The staff here at our museum go back and forth on that same question. My personal belief is that it is an optical illusion. I cant imagine any cat staying that calm with a tight fitting mask on their face. Also if you zoom in real close you can start to see the faint features of the cats face (nose and mouth). Since the original photo is pretty small and very old its not much easier to tell looking at it.", "Either way, it’s a fun picture to look at and hopefully it is making people smile worldwide!", "While we can't say for certain if this cat is wearing a mask, it wasn't entirely unheard of for people to put masks on their animals during the 1918 flu epidemic.", "A 1919 article published in the Los Angeles Evening Express, for instance, noted that several people put masks on their dogs after the city of Pasadena issued an ordinance requiring the precautionary measure. This article also noted that people put masks on their cars, which may indicate that these pet owners were more focused on making a statement about the mandatory mask ordinance than they were about public health.", "The article read:", "Shall a dog wear an influenza mask in a city where an ordinance requires the wearing of \"flu\" masks?", "Pasadena dogs were not taking any chances today. A number of canines appeared on the Pasadena streets in formal mask dress. Owners of automobiles, who did not want their machines \"pinched,\" also attached masks to the hoods of their cars.", "In the meantime, according to statistics compiled by the police, about 50 arrests had been made in Pasadena today of people who had either defied the law, or who did not know such an ordinance existed.", "While the dogs in Pasadena may have been wearing masks as some sort of social commentary, a dog in Seattle, Washington was just trying to be a good citizen.", "The Seattle Star reported in November 1918:", "Yancia is one of Seattle's best canine flu observing citizens. She is the property of Mrs. Harvey H. Carroll, of Carroll's Dancing academy, and as heartily  approves of the aesthetic art as she does of flu precautionary measures....", "Wednesday she appeared with her mistress on the streets of Seattle wearing a flu mask. \"Sometimes,\" said Mrs. Carroll, \"I catch her wearing it as a chest protector, but all in all, she has made the best of it in good spirit, as we all have.\"", "Seattle Star.   \"This Seattle Dog Wears Flu Mask.\"\r\n    2 November 1918.", "Los Angeles Evening Express.   \"Pasadena 'Flu' Mask Law Wide In Scope; Dogs, Cars Don 'em.\"\r\n    20 January 1919.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]