["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Social media users and some conservative commentators have recently shared posts that claim President Joe Biden used an offensive and derogatory slur.", "In the title of a Facebook video, a pair of conservative commentators known as the Hodgetwins assert Biden said a racial slur. A YouTube video that draws on the same clip of Biden speaking says the same in its headline.", "These posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The video footage of Biden in the posts is authentic, from a Feb. 19 address Biden gave at a virtual meeting of the Munich Security Conference. During the speech, Biden, who has a stutter, stumbled over the words \"I’m eager to hear.\" The third time he said eager, it sounded like he put an \"n\" at the front of \"eager.\"", "This is what the posts are referring to as a racial slur.", "You can hear it at the 16:32 mark in this C-SPAN video, when Biden said: \"Look, the range of challenges Europe and the United States must take on together is broad and complex. And I’m eager to hear, I’m eager to hear, I’m eager to hear next, from my good friends and outstanding leaders, Chancellor Merkel, about her thoughts on the way forward.\"", "A transcript of Biden’s remarks published by the White House reflects this: \"And I’m eager to hear — I’m eager to hear — I’m eager to hear next from…\"", "About 2 minutes and 55 seconds into their video about the stumble, one of the Hodgetwins acknowledged that Biden was not trying to say a racial slur: \"Hey, Joe, you can at least apologize, man. I mean I know you didn’t intentionally say it but how do you get confused with the word eager...?\"", "But for social media users clicking through their feeds and seeing headlines that say the president said a racial slur, that context is missing.", "Biden, who has a speech disorder, stumbled over the words \"I’m eager.\"", "We rate the claim that he said a racial slur False.", "Facebook post, Feb. 25, 2021", "YouTube post, Feb. 22, 2021", "C-SPAN, President Biden addresses the Munich Security Conference, Feb. 19, 2021", "Rev, Joe Biden speech at 2021 Munich Security Conference transcript, Feb. 19, 2021", "The White House, Remarks by President Biden at the 2021 virtual Munich Security Conference, Feb. 19, 2021", "The Atlantic, What Joe Biden can’t bring himself to say, January/February 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]