["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An effort to strengthen gun owner rights with an Iowa Constitution amendment affirming the right to bear arms and to give strict scrutiny to restricting gun ownership heads to voters next year, but not without a fight from Democrats who oppose the amendment.", "Both the Republican controlled Iowa Senate and House passed the bill on Jan. 28 along party lines and the proposed constitutional amendment will go before Iowa voters in the 2022 general election.", "State Rep. Beth Wessel-Kroeshell, D-Ames, wrote in an Iowa Standard article, Jan. 22, that the bill supporting the amendment would roll back gun control regulations and reform throughout the state. \"Republicans are back this year with a bill that aims to eliminate background checks, remove the requirement for a permit to carry a concealed handgun, and allow guns in our safest spaces, schools, hospitals, child care centers, and courthouses.\" she wrote in the article.", "She also wrote:", "\"Statistic: 86% of Americans and 82% of gun owners support requiring all gun buyers to pass a background check, no matter where they buy the gun and no matter who they buy it from.\"", "Wessel-Kroeschell did not cite or link in her article to the poll she received the statistic from, so we asked. She responded in an email, \"I hope this helps,\" and attached a RABA Research Poll from February 2019. The survey was taken Jan. 30 and 31, 2019, of 939 Iowans likely to vote in 2020. The poll had a margin of error of plus or minus 3.18 percentage points.", "The poll, conducted for the Giffords Law Center to Prevent Gun Violence, showed that 89 percent of Democrats and 83 percent of Republicans in Iowa favor background checks. But, the report does not state how many Republicans or Democrats were polled or the margins of errors for each of those groups.", "One of the survey’s questions was: \"Do you support or oppose requiring a background check on all gun buyers?\" 86 percent of respondents said support, 7 percent said oppose, and 8 percent said unsure, according to the Giffords report on the poll.", "The goal of Wessel-Kroeschell and other Democrats has been to show bipartisan support for some gun control measures, like background checks, as Iowans consider the proposed strict scrutiny constitutional amendment that could overturn them. More than one survey exists on the topic.", "In September 2020 Giffords commissioned a Public Policy Polling Iowa Survey, which found 79 percent of 1,151 Iowa voters — 91 percent of Democrats, 70 Percent of Republicans, and 77 percent of Independent voters,  said they supported background checks for all gun sales. That poll’s margin of error plus or minus 2.9 percentage points.", "According to a 2019 SurveyUSA poll commissioned by gun-control advocacy group EveryTown for Gun Safety Action Fund, 92 percent of Iowa gun owners, \"support the state’s background check requirement for all handgun sales,\" with a majority of both Democrats and Republicans supporting background check laws. The poll was conducted among 1,239 registered Iowa voters and had a margin of error of plus or minus 2.9 percentage points.", "Iowa’s margin of supporters for universal background checks on gun owners was comparable to results from nationwide polls on similar questions.", "In August 2019, NBC News and the Wall Street Journal asked 500 adults if they supported, \"expanding background checks to all firearm sales and transfers.\" In that survey, 75 percent said they strongly supported it and 14 percent said they somewhat supported it. The poll had a margin of error of plus or minus 3.1 percentage points for 1,000 interviews among adults, and 3.39 percentage points for 834 interviews among registered voters.", "In September 2019, National Public Radio (NPR), PBS Newshour, and Maris College asked 1,317 people in a nationwide poll if they thought Congress should pass legislation that requires background checks for gun purchases at gun shows or other private sales. Of those answering, 83 percent said yes, 14 percent said no and 3 percent said they were unsure. That poll had a margin of error of plus or minus 3 percentage points.", "A 2019 Pew Research Center Poll showed that Democrats more strongly favored gun control reform, but data showed a majority of Republicans also favor tighter restrictions like background checks. In September 2019, the center partnered with the American Trends Panel to survey 9,895 U.S. adults and found that 93 percent of Democrats and 82 percent of Republicans said they favored, \"making private gun sales and sales at gun shows subject to background checks.\" The poll had a margin of error of plus or minus 1.5 percentage points.", "A national Gallup Poll conducted in March 2018 with 766 national adults found that when asked if they favored or opposed 92 percent of people supported \"requiring background checks for all gun sales,\"  to prevent mass shootings at schools. The poll had a margin of error of less than .5 percentage points.", "A March 2019 poll conducted by Quinnipiac University found that 87 percent of national gun owners support \"requiring background checks for all gun owners.\" The poll surveyed 1,120 national voters and had a margin of error of plus or minus 3.4 percentage points.", "Wessell-Kroeschell wrote, \"86% of Americans and 82% of gun owners support requiring all gun buyers to pass a background check .\" The 2019 study she cited in her article compares with both national and Iowa poll results. National polls generally align with her statistic, with an EveryTown for Gun Safety Action Fund-SurveyUSA poll showing 92 percent of Iowa gun owners supported background checks on handguns. The more recent 2020 poll of Iowa voters by the Giffords center showed 79 percent of survey respondents supporting universal background checks.", "While the numbers aren’t exactly the same in each poll, they show a consistent story of Iowans favoring background checks for gun purchases when surveyed in multiple polls. We rate her claim as True.", "The Iowa Standard, \"Republicans rushing ‘extreme’ amendments,\" Jan. 22, 2018", "The Iowa Legislature, \"Senate Joint Resolution 7,\"", "Text message from Representative Beth Wessel-Kroeschell. Feb. 2, 2021", "Email from Representative Beth Wessel-Koreschell. Feb 3, 2021", "Quinnipiac University, \"U.S. voters oppose Trump emergency powers on wall 2-1, Quinnipiac University national poll finds:; 86% back Democrats’ ill on gun background checks,\" March 6, 2019.", "Pew Research Center, \"Share of Americans who favor stricter gun laws has increased since 2017,\" Oct. 16, 2019", "Gallup, \"Guns,\" March 5-11, 2018", "NPR, PBS NewsHour/Marist, \"Poll National Tables,\" Sept. 5-8, 2019", "NBC News/Wall Street Journal Survey, \"Hart Research Associates/Public Opinion Strategies, August 2019 Social Trends Monitor,\" August 10-14, 2019", "Sioux City Journal, \"Iowa House panels advance gun, abortion constitutional amendments,\" Jan. 19, 2021", "Public Policy Polling, \"Iowa Survey Results,\" Sept, 1-2, 2020", "Email with Jim Williams, Polling Analyst at Public Policy Polling, March 11, 2021", "RABA Research, \"Iowa Survey on Gun Laws,\" Feb. 8, 2019", "Giffords Law Center to Prevent Gun Violence, \"The State of Gun Violence in Iowa,\" Jan. 2020", "Giffords, \"IOWA: Giffords Endorses Gun Safety Candidates for State Legislature,\" Sept 17, 2020", "Moms Demand Action, \"New Poll: 9 in 10 Iowa Gun Owners Support State’s Law Requiring a Permit to Carry a Concealed Handgun in Public,\" Feb. 4, 2019", "Everytown for Gun Safety, \"Results of SurveyUSA Mkt Research Study #24584\" Jan. 21 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]