["By Jessica McDonald", "Posted on March 14, 2019", "Since the ambitious and controversial Green New Deal debuted last month, Republicans and Democrats have sparred over the cost of the measure — a nonbinding resolution that broadly outlines how the U.S. should address climate change over the next decade.", "But sometimes the politicians have erred in their descriptions of the proposal and the costs of climate action and inaction.", "We’ll explain the origin of Markey’s 10 percent gross domestic product line, and go over why it’s not the best way to summarize the economic impacts of climate change.", "And we’ll demystify the seemingly specific $93 trillion figure, which the think tank report’s own authors say should not be the only takeaway.", "We’ve already written about the Green New Deal, and the confusion over what the resolution entails. Some of that applies here, too, as many Republicans continue to say the proposal covers things it doesn’t.", "The Green New Deal, which hasn’t yet come up for a vote in either chamber, is a nonbinding resolution that calls for the country to address climate change by reaching net zero greenhouse gas emissions through a “10-year national mobilization.” The proposal requires that the transition to clean energy be done in a way that is sensitive to vulnerable populations, and includes other large-scale goals, such as providing all Americans with health care, housing and economic security.", "In the past two weeks, the cost of the Green New Deal has been a relentless focus for Republicans, including during a Feb. 27 Western Caucus forum and press conference organized by Arizona Rep. Paul Gosar that was devoted to denouncing the proposal.", "At the annual Conservative Political Action Conference on Mar. 2, Trump said the Democrats would “completely takeover American energy and completely destroy America’s economy through their new $100 trillion Green New Deal.”", "And on Mar. 5, Eric Trump, the president’s second eldest son and an executive vice president of the Trump Organization, said on Fox News Radio that the proposal would cost $93 trillion, adding, falsely, that it banned airplanes, cows and cars. (As we’ve explained before, the Green New Deal doesn’t call for any of those prohibitions.)", "Sens. John Barrasso, Mitch McConnell, John Cornyn and Joni Ernst, among many others, have also cited the same $93 trillion figure.", "The number is an estimate from the American Action Forum, a self-described “center-right policy institute.” The AAF is the “sister organization” of the American Action Network, a conservative nonprofit that has spent tens of millions of dollars supporting Republicans in general elections. The AAN is a tax-exempt 501(c)(4) that doesn’t disclose donors, but must disclose any independent expenditures on TV ads for or against specific candidates to the Federal Election Commission.", "In a brief analysis, the AAF estimated costs for six sectors related to Green New Deal goals, including clean energy, high-speed rail, a job guarantee, health care, green housing and food security. The estimated costs only include outlays, and don’t factor in economic benefits or other effects.", "The group produced a single figure or range for each category, which, when tallied, runs from $51 trillion to $93 trillion between 2020 and 2029. The summed figures don’t appear in the report, although they are mentioned in a separate summary. The upper number has gotten the most attention.", "But the experts we spoke to said it’s not possible to put a specific price tag on the Green New Deal.", "“I’d say that it is *way* too early to even pretend to put cost estimates on the ‘Green New Deal.’ It’s at this point a still-amorphous construct,” said Josh Bivens, director of research at the labor-funded Economic Policy Institute, in an email to FactCheck.org.", "Noah Kaufman, a research scholar at Columbia University’s Center on Global Energy Policy, agreed. When asked what one can say about how much the Green New Deal would cost, he said, “basically nothing.”", "The Green New Deal, he said, is a set of ambitions, not policies, and how much things cost will depend on what the policies are.", "“You can’t use policy analysis if you don’t have policy,” said Kaufman, who previously served as President Barack Obama’s deputy associate director of energy and climate change. “It just seems definitely premature and a little misleading to try to claim we know how much.”", "Jeffrey Miron, the director of economic studies at the libertarian Cato Institute, said, “It’s hard to be very precise because a lot of the proposals are broad brush and vague.”", "He nevertheless noted that other estimates — including one back-of-the-envelope calculation from Bloomberg Opinion writer Noah Smith, which came out to $6.6 trillion every year — have been roughly the same as the American Action Forum’s figure.", "The president of the American Action Forum and a co-author of the analysis, Douglas Holtz-Eakin, defended the estimate, but acknowledged that using the $93 trillion figure by itself was not ideal.", "“The figure’s not wrong, but it’s incomplete,” he said, adding that in a perfect world, people would give ranges and convey uncertainty. Holtz-Eakin is a former director of the Congressional Budget Office and was John McCain’s chief economic adviser during the 2008 presidential campaign.", "A better numerical summary of the findings, Holtz-Eakin said, would be $50 trillion to $90 trillion, with some mention of the nuances in the report.", "The analysis, for example, notes that the breadth of the Green New Deal “makes it daunting to apply the standard tools of policy analysis.”", "The paper goes on to say that the Green New Deal would result in changes that “are impossible to quantify at this point,” and that redundancy in certain policies “complicates a precise analysis, as the interactions are difficult to predict.”", "Those caveats aren’t included when Republicans bring up the Green New Deal’s price tag.", "Strictly speaking, as a nonbinding resolution that would require other legislation to carry out its goals, the Green New Deal costs nothing. Even if it passed both the House and the Senate, it would not have the force of law. Lawmakers would have to propose other legislation to act on any of the broad goals in the resolution. And that legislation would include specific policy proposals, which the CBO would score as it would any other bill. The score would then be provided to lawmakers so they could be informed about the impact of the legislation on the federal budget.", "The AAF estimate shouldn’t be thought of as the same or even similar to a CBO cost estimate, which estimates the full impact of the legislation on the federal budget, given spending and revenue changes.", "We won’t pick through all of the AAF estimate — most economists we spoke to didn’t want to comment on it. As Miron said, “it’s impossible to argue about details because the exact proposals don’t have enough details.”", "But a few key examples help explain why the $93 trillion figure is problematic.", "Because none of the Green New Deal’s policies are defined yet, the estimate’s authors had to make assumptions about what sorts of policies would be made.", "In the case of health care, AAF authors assumed the Green New Deal would be similar to Sen. Bernie Sanders’ Medicare for All proposal, despite the fact that the only thing the resolution says about health care is that it should be “high-quality” and provided to “all people of the United States.” The group calculated that single line item would cost $36 trillion over a decade.", "As Miron pointed out, there are a variety of different universal health care systems that one could choose to implement, and the costs for each vary widely.", "Similarly, the AAF estimate also makes assumptions about the Green New Deal’s plan to invest in high-speed rail. The estimate states, inaccurately, that the Green New Deal “envisions enough high-speed rail to make air travel unnecessary.”", "That idea was originally included in a FAQ sheet that Rep. Alexandria Ocasio-Cortez’s office distributed to news organizations, but it does not appear in the resolution. The resolution, which Ocasio-Cortez sponsored in the House, simply mentions investment in high-speed rail as one way of “overhauling transportation systems” to reduce pollution and greenhouse emissions in the sector “as much as is technologically feasible.”", "Furthermore, the rail estimate isn’t reliable because it claims to come from the number of airline miles flown multiplied by a cost per mile estimate. But the airline miles number that was used actually represents the number of airports in the country.", "Redundancies, too, could have a large impact on the ultimate cost of any Green New Deal. Miron explained that some of the Green New Deal’s goals would have substantial overlap with others, which could lead to double-counting. For example, if there’s infrastructure spending to build new rail lines, that could create jobs, reducing the costs of a jobs program. But the AAF estimate counts both separately, without factoring in those interactions.", "Holtz-Eakin said his group would have accounted for this if it could have.", "It’s worth noting that more than 80 percent of the AAF estimate was for social programs such as health care, not for clean energy and climate policies.", "Kaufman, the Columbia researcher, said he does have concerns about cost, but reducing greenhouse gas emissions doesn’t have to break the bank.", "“It turns out if you do something like carbon tax and use that money to reduce other taxes, what happens is you get a drastic reduction on emissions and basically no effect on the economy at all,” he said.", "Economists of all stripes generally agree that the most efficient way to cut emissions is to put a price on carbon. If the Green New Deal were not to take such an approach, the costs would almost certainly be much higher.", "Several economists have looked at how to implement plans that reach or work toward net zero emissions.", "Robert Pollin, an economist at the University of Massachusetts Amherst, thinks it’s entirely possible to get to net zero by 2050 by spending around 2 percent of GDP each year, or around $18 trillion in total.", "“$18 trillion is real money,” he said. “But when you spread it out over 30 years, it’s entirely feasible and it will have a lot of economic benefits in addition to getting us down to zero emissions.”", "Under his scenario, Pollin says the economy would continue to grow and consumers would not see increases in their utility bills — one of the prospects that some politicians have highlighted under a shift to a greener economy.", "Pollin, however, strongly disagrees with the resolution’s aim of getting to net zero with just a decade of investment.", "“I think it’s completely unrealistic and it’s not worth costing out,” he said of the Green New Deal.", "Edward Barbier, an economist at Colorado State University, agrees that a strict timeline isn’t realistic. He advocates jump-starting the transition by investing about 5 percent of GDP over five or so years. GDP was $20.5 trillion in 2018, according to the Bureau of Economic Analysis, so that’s a little over $1 trillion a year.", "“That would push us on a path to clean energy, and a path that permanently lowers carbon emissions,” he told us.", "After that push, Barbier said the costs of renewables and other technologies would fall, and the country would be able to take advantage of those reductions.", "As Republicans have attacked the Green New Deal because of its potential price tag, Democrats have hit back, arguing that the costs of climate change are also high.", "Sen. Ed Markey of Massachusetts, for example, pointed to the National Climate Assessment and a frequently cited GDP statistic.", "Climate change is literally destroying the planet. According to the Trump admin's National Climate Assessment, with no action, climate change will result in 10% GDP loss by 2090. A #GreenNewDeal addresses this climate reality, not right-wing misinformationhttps://t.co/3m3fKAd94t", "— Ed Markey (@SenMarkey) February 28, 2019", "The National Climate Assessment doesn’t make such a definite prediction, and the scientists behind the number say it really shouldn’t be used without providing more context. One told us a better estimate to use would be roughly 4 percent of GDP, but that, too, is only a projection. (Climate change, it should also be noted, is making life more difficult for humans and many other organisms on Earth, but it won’t literally destroy the planet, as Markey said.)", "The GDP estimate doesn’t appear anywhere in the text of the climate report. Instead, it’s found in a graphic that was reprinted from a 2017 Science paper.", "The graph plots out damage to the U.S. economy by around 2090 as a function of various climate scenarios and temperature increases. Damages amounting to 10 percent of GDP are projected only under the higher climate scenario, which assumes emissions continue unabated, and under large temperature changes.", "One of the Science paper’s authors, Amir Jina, wrote an entire article in Forbes to explain the research after several news outlets highlighted the 10 percent figure in their coverage of the fourth National Climate Assessment.", "Jina, who is an environmental economist at the University of Chicago, explained that the number “mischaracterizes” his study. The number is too high because losses equivalent to 10 percent of GDP are unlikely.", "“While it is true that we estimated damages as high as 10% of GDP annually at the end of the century for warming of 15°F above pre-industrial levels, the odds of a temperature change that would drive damages of this magnitude are slim,” he wrote. “In fact, they are less than 1-in-100 by our original calculation.”", "The study found that for every 1.8 degree Fahrenheit increase in global mean temperature, the damages would amount to about 1.2 percent of GDP. The researchers arrived at those numbers by tabulating the economic benefits and losses under different temperature increases from six sectors, including agriculture, crime, energy, human mortality and labor.", "At the same time, Jina said there is also a chance that 10 percent of GDP is an underestimate. That’s because the number includes only a subset of the impacts, and not others, such as ecosystem damages, that the researchers didn’t have enough information to model.", "And Jina noted that even if climate change’s impact on the economy as a whole is small, some locales will be hit much harder than others. Under a more likely scenario of a 7 degree Fahrenheit temperature increase, many individual counties in the U.S. could experience damages of more than 10 percent of GDP by the end of the century. The economic toll of climate change in Florida’s Union County, for example, could be close to 28 percent of the county’s GDP.", "Robert Kopp, a climate scientist at Rutgers University and a fellow co-author of the Science paper, said Markey’s phrasing is incorrect because he said climate change “will” result in the 10 percent loss in GDP, when that level of damage is just one possibility.", "But Kopp said Markey also failed to mention another assumption baked into the number, which is that researchers were factoring in a limited level of adaptation. The group included the sorts of things that people have done in the past to respond to heat or cold, for instance, but not novel approaches. If people are more creative and come up with better ways of adapting to climate change, that wouldn’t be reflected in the economic damages.", "If that sounds like a minor thing, it gets at a fundamental aspect that many people misunderstand about climate science. We’ve discussed it before with climate scenarios, but Kopp said the goal of the study wasn’t to predict the future, but to understand a range of possibilities so scientists are more aware of the level of risk the country will have to manage. That’s a slightly different perspective that often gets lost when politicians and others summarize these sorts of findings.", "Finally, Kopp explained that his study wasn’t estimating how much climate change would reduce GDP, but rather, how much the costs would be, expressed as a percent of GDP. A good chunk of the calculated GDP damages come from people dying, so the group estimated those costs using the government’s estimate of how much people value a life — a common practice in economics — and turned that into a GDP-equivalent.", "Keeping all these caveats in mind, Kopp said it’s better for Markey and others to say that around the turn of the next century, climate change could result in annual damages worth roughly 4 percent of GDP. Even this lower value at the economy’s current size would reach about $16 trillion between 2080 and 2099. When factoring in growth of the economy, the cost of climate change could easily balloon into the tens of trillions.", "Thus, while Markey flubbed this particular statistic, he’s not wrong that scientists expect substantial damages from climate change if little action is taken.", "For Kopp, that’s where the value of the Green New Deal comes in. The only way to stabilize the climate is to get to net zero emissions, he said, and the proposal is starting a discussion about how to do that.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]