["About this rating", "As damage from Hurricane Harvey continued to grow in Texas in late August 2017, some Twitter users sought to defend President Donald Trump's response to the disaster by criticizing the actions of his predecessor, Barack Obama during similarly pervasive flooding in Louisiana in 2016. Other users took that argument even further, knocking Obama for not \"doing enough\" to help Louisiana during Hurricane Katrina.", "!function(r,u,m,b,l,e){r._Rumble=b,r[b]||(r[b]=function(){(r[b]._=r[b]._||[]).push(arguments);if(r[b]._.length==1){l=u.createElement(m),e=u.getElementsByTagName(m)[0],l.async=1,l.src=\"https://rumble.com/embedJS/ucxbq\"+(arguments[1].video?'.'+arguments[1].video:'')+\"/?url=\"+encodeURIComponent(location.href)+\"&args=\"+encodeURIComponent(JSON.stringify([].slice.apply(arguments))),e.parentNode.insertBefore(l,e)}})}(window, document, \"script\", \"Rumble\");", "Rumble(\"play\", {\"video\": \"v4tygd\",\"div\": \"rumble_v4tygd\",\"autoplay\":2});", "The argument that Obama did not do enough after Hurricane Katrina lashed New Orleans, however, ignores the fact that Obama was not president at the time. Katrina made landfall in August 2005, during George W. Bush's presidency.", "Obama -- who was a Democratic Party senator representing Illinois when the storm hit -- was not elected president until November 2008. However, Obama did meet with Katrina evacuees on 5 September 2005 in Houston, Texas alongside former Presidents Bill Clinton and George H.W. Bush:", "Online speculation also mounted around some users posting anti-Obama tweets, questioning whether they were actually Russian misinformation \"bots\":", "One of the suspected bots, @DaNolans, denied being an illegitimate account in a post on 29 August 2017:", "I was taking the piss outta Trump with this folks. Check TL. Never woulda thought people truly believe such nonsense. Scary times #notabot", "Ben Nimmo, a senior fellow for information defense for the Atlantic Council's Digital Forensic Research Lab who has written about \"bot\" attacks, told us that he scanned mentions of Obama and Katrina between 24 August 2017 and 30 August 2017. He said:", "The majority of tweets, and the most popular tweets, all mocked the idea of blaming the Katrina reaction on Obama. The anti-Obama messaging does not appear to have penetrated. Of the accounts in the image, one is now suspended and the others show varying degrees of activity; one claims to have been joking. There doesn't appear to be major bot (i.e. automated) traffic involved.", "While it is unclear how many of the recent spate of anti-Obama tweets were manufactured or made in jest, an August 2013 survey conducted by the Democrat-oriented Public Policy Polling showed that 29 percent of Louisiana Republicans believed that Obama was to blame for the oft-criticized federal response to Katrina. Another 44 percent were reportedly unsure whether Obama or George W. Bush was at fault, while 28 percent blamed Bush.", "That mindset was brought to national television in a September 2016 segment on Comedy Central's Daily Show, which featured a Trump supporter who said he believed that Obama \"had a big part\" in the 9/11 attacks because he was \"never in the office\" at the time. When asked why Obama would not have been in the Oval Office during the 11 September 2001 attacks (which occurred more than seven years before he was elected president), the man said:", "That I don't know. I'd like to get to the bottom of that.", "Kludt, Tom. \"Poll: Louisiana GOPers Unsure If Katrina Response Was Obama’s Fault.\"\r\nTalking Points Memo. 21 August 2013.", "Associated Press. \"Former Presidents Again Join Forces To Help Victims of Disaster.\"\r\nAccessed via lubbockonline.com. 6 September 2005.", "\"Jordan Klepper Fingers the Pulse - Conspiracy Theories Thrive at a Trump Rally: The Daily Show.\"\r\nYouTube, uploaded by The Daily Show with Trevor Noah. 21 September 2016. https://youtu.be/eFQhw3VVToQ", "Alpert, Bruce. \"George W. Bush Never Recovered Politically From Katrina.\"\r\nNew Orleans Times-Picayune. 28 August 2015.", "Barojan, Donara and Nimmo, Ben. \"Kremlin and Alt-Right Share “Nazi” Narrative.\"\r\nMedium. 18 August 2017.", "Gonzales, Carolina. \"10 Years Ago: Politicians United for Hurricane Katrina Victims.\"\r\nHouston Chronicle, 4 September 2015.", "Updated [30 August 2017]: Added comment from Ben Nimmo about possible \"bot\" activity.", "Correction [31 August 2017]: A previous version of this article included a tweet saying that Obama golfed during \"flooding\" in Louisiana. We have updated the article to clarify that that tweet referred to 2016 flooding, rather than Hurricane Katrina.", "Correction [31 August 2017]: A previous version of this article stated that Obama, George H.W. Bush, and Bill Clinton met with Katrina evacuees in Lubbock, Texas. We have updated the article to clarify that they visited the evacuees in Houston.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]