["Democratic presidential candidate, former Vice President Joe Biden bows his head in prayer during a visit to Bethel AME Church in Wilmington, Del., Monday, June 1, 2020. (AP)", "The NAACP doesn’t endorse candidates.", "Biden’s campaign said he was referring to scorecard ratings from the NAACP when he was a U.S. senator.", "The NAACP’s ratings showed that Biden received an “A” grade of 90% or above many times. In some congressional cycles he received lower marks, including one 60% score.", "Black voters helped former Vice President Joe Biden all but secure the Democratic presidential nomination. But Biden overstated his support from the NAACP on a prominent radio show — the same one in which he said black voters who don’t support him \"ain’t black.\"", "Biden faced tough questions during the May 22 edition of the \"Breakfast Club\" show, which has a mostly black audience. Host Charlamagne tha God told Biden that Democrats take black voters for granted and asked why Biden resisted admitting that the 1994 crime bill hurt the black community. He also asked about the message sent by his campaign vetting Sen. Amy Klobuchar, a white senator from Minnesota, as a possible running mate.", "Near the end of the interview, Biden said: \"You got more questions, but I tell you if you have a problem figuring out whether you're for me or Trump, then you ain't black.\"", "Charlamagne tha God responded: \"It don't have nothing to do with Trump. It has to do with the fact I want something for my community. I would love to see --\"", "Biden interjected: \"Take a look at my record, man,\" citing his work to extend the Voting Rights Act. \"I have a record that is second to none. The NAACP has endorsed me every time I've run.\"", "Later in the day, Biden walked back his \"you ain’t black\" comment. But it wasn’t the only thing that needed addressing from the interview.", "NAACP CEO Derrick Johnson said contrary to Biden’s claim, the civil rights organization does not endorse candidates.", "\"We want to clarify that the NAACP is a nonpartisan organization and does not endorse candidates for political office at any level,\" Johnson wrote May 22. \"Persons affiliated with the NAACP at the national, state, and local levels are free to make candidate endorsements in a personal capacity, but they do not reflect support by the NAACP as an organization.\"", "The NAACP’s tax-exempt status means that it cannot endorse political candidates.", "RELATED: US minorities surpassed 25 percent of electorate when Obama ran in 2008, and it's going up", "The Biden campaign told PolitiFact that Biden was referring to NAACP ratings. Like other groups around politics, the NAACP issues a legislative report card for members of Congress rating their positions on bills pertaining to civil rights and other priorities for the organization.", "Each report card rates members on how they voted on judicial confirmations and specific bills that cover a range of topics such as education funding, job training, gun regulations, Medicaid and Medicare, voting and civil rights. The report cards available online date back to the 1989-90 term in Congress.", "Biden received several ratings during his decades-long career as a U.S. senator. Most were high.", "Biden’s most recent report cards are from at least 15 years ago. In 2005-06 and 2003-04, he received a 100%. The link on the NAACP’s website for the 2001-02 report card was broken.", "In the 1990s, he received grades of 90% or higher  three times and received one 80%, one 70% and one 60%.", "In the earlier years, the report cards often reflected members’ votes on about 10 issues while in later years it covered around 30 votes. That means that the more recent report cards provide more information on members’ voting records.", "Thirty-six years ago, the Biden campaign pointed out, the Wilmington News Journal wrote that while the NAACP doesn’t endorse, its materials show who they support. The newspaper described a voter education bulletin distributed in October 1984 by the Delaware State Conference of Branches of the NAACP. The bulletin \"makes clear that the NAACP backs two Democratic incumbents, Sen. Joseph R. Biden Jr. and Rep. Thomas R. Carper, as well as Republican Battle R. Robinson for lieutenant governor,\" the News Journal wrote. The group’s voter information guide stated that Biden received a 90%.", "RELATED: Donald Trump said he's done more for African Americans than any president. Historians disagree", "Biden said, \"The NAACP has endorsed me every time I've run.\"", "The NAACP does not endorse candidates.", "Biden’s campaign said he was referring to past ratings by the NAACP when Biden was a U.S. senator. The civil rights organization gave him a grade of 90% or higher five times, though on three occasions in the 1990s he earned a lower score. Those grades show that Biden’s record generally aligned with the NAACP’s priorities for most of his tenure in the Senate. But it’s not the same as an endorsement in a campaign.", "We rate this statement False.", "The Break Club radio show, Interview with Joe Biden and transcript, May 22, 2020", "Factcheck.org, FactChecking Biden’s ‘Breakfast Club’ Interview, May 27, 2020", "NAACP, Statement, May 22, 2020", "NAACP, Civil rights legislative report cards, 1989-2006", "NAACP, NAACP Presidential Candidate Civil Rights Questionnaire, 2008", "Pew Research, Behind Trump’s victory: Divisions by race, gender, education, Nov. 9, 2016", "NPR, Trump Campaign Works To Court Black Voters, March 6, 2020", "Washington Post, Does Biden have a problem with African American voters? May 28, 2020", "Washington Post op-ed, Biden still needs black women. Here are 3 things he needs to do. May 14, 2020", "Washington Post, Biden walks back suggestion that black voters who aren’t already supporting him ‘ain’t black’ May 22, 2020", "CNN, Trump pitches black voters: 'What the hell do you have to lose?' Aug. 19, 2016", "BBC, Reality Check: Who voted for Donald Trump? Nov. 9, 2016", "Wilmington News Journal, NAACP makes choices known  while shunning endorsements, Oct. 23, 1984", "Washington Informer, New GOP Leadership Fails NAACP Report Card, Feb. 8, 1995", "PolitiFact, US minorities surpassed 25 percent of electorate when Obama ran in 2008, and it's going up, April 23, 2019", "Email interview, Marc Banks, NAACP spokesman, May 28, 2020", "Email interview, Andrew Bates, Joe Biden campaign, May 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]