["About this rating", "On 20 July 2017, humor site The Onion published an article appearing to claim that thousands of passengers died in a \"clash\" between two cruise ships in the waters off the Bahamas:", "COCO CAY, BAHAMAS—In the latest clash between rivals that have long vied for control of highly prized cruise routes, a barrage of cannon fire from Royal Caribbean’s M.S. Allure of the Seas sank a Carnival Cruise Line ship that crossed into disputed waters off the coast of the Bahamas, sources said Thursday.", "The Allure, an Oasis-class recreational vessel with a standing crew of around 2,300, opened fire on Carnival’s M.S. Magic after it allegedly ignored repeated warnings not to approach Coco Cay, a private island owned by Royal Caribbean. After sustaining several direct hits, the enemy ship’s hull reportedly ruptured, immediately flooding its bingo hall and spa with seawater, collapsing several theme restaurants, and ultimately killing all 3,675 guests on board.", "Although The Onion was well-known as a satirical outlet, not all readers were in on the joke:", "Report from \"the Onion\" (7/20/17) states the Royal Caribbean Cruise ship, Allure of the Seas, had attacked and sunk the Carnival Magic Cruise ship, killing all on board (over 3,400 people) in the waters of Coco Cay. It would be appreciated if you could validate or disprove this report. Thanks for your time and research into this report. ;-)", "A Royal Caribbean expert blog tweeted shortly after the article appeared, making it clear the piece was humorous in nature:", "Great laugh to brighten your day! https://t.co/eHNk6v6C2A", "— Royal Caribbean Blog (@theRCLblog) July 20, 2017", "The Royal Caribbean and Carnival Cruise Lines clash story was hardly the first Onion bit to confuse social media users. Prior items mistaken for news included claims about cleaning and entertainment at Seaworld, and a piece about Mike Pence's adherence to Biblical principles.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]