["By Lori Robertson", "Posted on October 21, 2020", "In a Florida speech about senior citizens, President Donald Trump made misleading comparisons of Medicare costs under his administration and his predecessor’s.", "Trump claimed “premiums for Medicare health plans went up” under the Obama administration, but his administration “lowered Medicare Advantage premiums” by 34%. He is talking about premiums for Medicare Advantage, a private Medicare option, that most Medicare beneficiaries don’t pay. For those who do pay them, the average national Medicare Advantage monthly premium went up by all of 46 cents under then-President Barack Obama.", "As for “Medicare health plans,” there are four parts to Medicare and the largest premium — for Part B, physician coverage — has increased under both administrations. Nearly all Medicare enrollees pay the Part B premium, including Medicare Advantage enrollees.", "Trump further said that those “Medicare health plan” premiums went up by 25% in Florida under Obama. But he, again, was talking about Medicare Advantage average premiums, which went from $6.85 to $8.60 per month in Florida during Obama’s two terms. The Medicare Advantage premium figures vary considerably by state and territory: For instance, the average monthly premium for 2021 is 77 cents in Puerto Rico but $81.79 in Minnesota, based on projected enrollment.", "The average annual growth in the national average Medicare Advantage premium under Obama works out to be 0.39% over his two terms, as the average premium went up in two of his years in office and down in the other six. Under Trump, the average annual decline in the Medicare Advantage premium has been 9.9% under the four years for which he has announced these figures. The total dollar decrease in Trump’s term is $10.90 per month for the average premium.", "Further complicating those figures is the fact that many Medicare Advantage enrollees pay zero dollars for their MA premium.", "Of the about 68 million people enrolled in Medicare in 2020, 36% of them have Medicare Advantage plans, according to an analysis of government data by the Kaiser Family Foundation. Nearly all Medicare enrollees pay the Part B premium — except for some very low income beneficiaries who also receive Medicaid.", "Medicare, the federal health care program that primarily covers those age 65 and older, as well as younger people with disabilities and end-stage renal disease, is made up of four parts, with different costs or premiums for each:", "Trump made his comments about Part C on Oct. 16 in Fort Myers, Florida, in a speech about seniors. Florida is a key swing state that Trump won by  just 1.2 percentage points in 2016, but Biden currently holds a slight advantage in the polls.", "Trump, Oct. 16: Under eight years of the previous administration, premiums for Medicare health plans went up, including a 25% increase right here in Florida. That’s for the previous people. Under my administration, we’ve lowered Medicare Advantage premiums by a number nobody even believes — 34% nationwide. And today it’s the lowest level in 14 years.", "He has touted the Medicare Advantage premiums before, but he hasn’t always been clear on which premiums he was describing. On Twitter on Sept. 17, Trump said, “I am lowering, not raising, Medicare Premiums!” But there isn’t one Medicare premium; what people pay depends on their plan choices.", "Here’s what has happened to the average monthly national Medicare Advantage premium since 2007, according to figures from the Centers for Medicare and Medicaid Services. Keep in mind, the figures vary considerably by state.", "In an analysis of Medicare Advantage enrollees in plans that include prescription drug coverage (excluding certain MA plans, such as special needs plans, that are only available to specific groups), the Kaiser Family Foundation found that 89% of MA enrollees have plans that include drug coverage, and 60% of those enrollees “pay no premium for their plan, other than the Medicare Part B premium ($144.60 in 2020).”", "Jeannie Fuglesten Biniek, a senior policy analyst for the program on Medicare policy at KFF, told us that works out to 9.3 million people in 2020 in MA plans with drug coverage that have $0 premiums.", "But among those who do pay a premium, the amounts are noticeably higher than the nationwide average for all plans. The average premium is $63 per month for those with an MA plan that includes prescription coverage and charges a premium, KFF said.", "Medicare Part B premiums have gone up under both the Trump and Obama administrations, according to figures from the Medicare trustees report.", "KFF’s Fuglesten Biniek told us the Part B premium is “definitely the more important” element “when you’re talking about magnitude.” Everybody in Medicare pays that, except for some very low-income enrollees who get help with their premiums from Medicaid. (That’s about 20% of Medicare beneficiaries, according to a Congressional Research Service report.)", "Part B premiums have gone up under Trump by 7.9%, from 2017 to 2020, the most recent figures available. We start with 2017 because the first Part B premiums announced under the Trump administration would have been 2018 premiums, revealed in late 2017. Premiums for 2017 were announced in November 2016, when Obama was still in office.", "Under the comparable time frame for Obama, the Part B premiums went up by 3.6% for 2009 to 2012.", "The average annual Part B premium growth was 4.6% per year under Obama’s two terms and 2.6% per year under Trump’s first three years.", "Again, those with high incomes pay more than the standard premium. The Centers for Medicare & Medicaid Services says that affects about 7% of enrollees.", "There are other caveats: A “hold harmless” provision limits Part B premium increases for some to no more than the amount of the annual increase in their Social Security benefits. About 3% of enrollees in 2020 are affected by that provision, the CRS report says. Some Medicare Advantage plans also “may help pay all or part of your Part B premiums,” CMS says.", "While the premiums have risen, so, too, have the Part B deductibles, and cost-sharing between traditional Medicare and Medicare Advantage, and among MA plans, differs.", "As for Part D, the prescription drug plan, the base premium, which is based on bids submitted by the stand-alone plans and Medicare Advantage plans, went up under Obama from $30.36 to $35.63 and has gone down under Trump to $33.06. “But actual premiums paid by Part D enrollees vary considerably,” a KFF report published in June says. “For 2021, [prescription drug plan] monthly premiums range from a low of $5.70 for a PDP in Hawaii to a high of $205.30 for a PDP in South Carolina (unweighted by plan enrollment). Even within a state, PDP premiums can vary; for example, in Florida, monthly premiums range from $7.30 to $172.”", "And there are low-income subsidies for Part D as well as high-income surcharges.", "Overall, what individual Medicare enrollees pay in total varies depending on what plan they choose and their income, and some also will purchase supplemental plans to help with cost-sharing expenses.", "The president is correct that Medicare Advantage average national premiums have gone down under his administration, and they went up under Obama — by less than 50 cents. But the larger expense that affects most enrollees is the Part B premium, which has gone up under both administrations. In fact, Part B premiums have gone up faster in Trump’s first three years than they did in Obama’s first three years.", "Editor’s note: Swing State Watch is an occasional series about false and misleading political messages in key states that will help decide the 2020 presidential election.", "Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]