["About this rating", "On 12 December 2016, the Dallas Morning News published an article about a new initiative to recruit panhandlers for day labor — but as is sometimes the case, a single excerpt of the piece caught readers' attention:", "The proposed jobs program would pay people $10.37 an hour for day labor, either cleaning up litter or working in parks. The effort mimics an initiative in Albuquerque, NM.", "But city leaders caution the program might not work, at least not on panhandlers. Some can make more than $50 an hour, making other work unappealing.", "\"The reason why they're doing this is it's very lucrative,\" said Alan Sims, Dallas' chief of Neighborhood Plus.", "The origin of the $50 per hour figure was not immediately clear, but both the author of the piece and the person quoted (Alan Sims of Neighborhood Plus) made statements about the potential profitability of panhandling. But the assertion that panhandlers make large sums of money is not new; one version posted to our message board in 2009 repeated the rumor that many downtrodden beggars were \"secret millionaires,\" made wealthy by posing as people in need:", "Maybe it's the economy - people have money on the mind - or maybe it's because I recently moved to Los Angeles, which (believe it or not) has a lot more panhandlers than my native New York. Whatever the cause is, the old \"I heard some panhandlers are actually millionaires\" has come up in conversation much more often recently. Whenever it does, it's always accompanied by statements like \"I saw it on TV once\" or \"My Mom swears it's true.\" I'm still waiting on proof.", "It seems more like a popular construct than truth; if I can believe a grubby panhandler is really a secret millionaire, I can feel less guilty when I don't give him any change. We're all hurting for money in one way or another right now, and perhaps the fantasy of panhandling ones way to fortune is a nice thing to think about.", "Rumors about dishonest beggars often serve as parables to illustrate our broader fears and attitudes about panhandling and being swindled, vulnerability to those who would fleece us, and general anxiety about to how often our trust in others might be misplaced.", "Kindly people getting defrauded or harmed by those posing as victims is a perennial theme in modern folklore, inviting us to test and reframe our true opinions about the poor, needy, and down on their luck. A stranded or distressed person isn't just often a potential con artist in these tales of caution, but also frequently a violent individual, gang member, or murderer. Because of the inherent risk of extending trust, the rumors say, we're more likely to become a victim than to help one. As for the age of the trope itself, readers pointed to Sir Arthur Conan Doyle's 1891 Sherlock Holmes short story \"The Man with the Twisted Lip\"; a primary plot point involves the discovery of an apparently destitute man who is in fact living a secret \"reputable\" life.", "Just as its impossible to produce even a ballpark figure of how many folks on the streets are truly, desperately in need, so too is figuring out how much the average panhandler can make. Location, season, visibility, personality, appearance, the economy, and a giver or mark's own views of the activity are among the variables that affect how lucrative it can be. Numerous articles including \"estimates\" of panhandling incomes are available; one penned by a self-identified panhandler described an \"average is closer to $15 than $30,\" adding that panhandling for more than a few hours at a time was \"nearly impossible\" due to police, weather, and public aggression.", "A 2002 paper from the Department of Justice's Community Oriented Policing Services, or COPS, typically cited other police materials or dated research in an excerpt about the \"Economics of Panhandling\":", "Most evidence confirms that panhandling is not lucrative, although some panhandlers clearly are able to subsist on a combination of panhandling money, government benefits, private charity, and money from odd jobs such as selling scavenged materials or plasma. How much money a panhandler can make varies depending on his or her skill and personal appeal, as well as on the area in which he or she solicits. Estimates vary from a couple of dollars (U.S.) a day on the low end, to $20 to $50 a day in the mid-range, to about $300 a day on the high end. Women—especially those who have children with them—and panhandlers who appear to be disabled tend to receive more money. For this reason, some panhandlers pretend to be disabled and/or war veterans. Others use pets as a means of evoking sympathy from passersby. Panhandlers' regular donors can account for up to half their receipts.", "The absolute highest estimate was placed at about $300 a day, or $50 per hour for six hours of begging. But the report estimated a daily average of $20-50 was more common, and came from the perspective of policing panhandlers. Research conducted in Toronto and published in 2002 referenced both some more rigorously collected average panhandler \"takes,\" as well as one of myriad news articles alleging that begging was surprisingly lucrative:", "Panhandlers in Toronto reported a median monthly income of $300 from panhandling and $638 from all sources. The amount of payment that panhandlers were willing to accept for participating in a 20-minute survey was generally consistent with their self-estimated earnings from panhandling for the same length of time. This suggests that few panhandlers earn extremely large amounts of money. Their single largest reported expense was food, followed by tobacco, then alcohol and/or illicit drugs. These findings differ significantly from those of John Stackhouse, a journalist who briefly lived on the street in Toronto working as a panhandler and who reported that panhandlers can earn more than $200 per day and typically spend “almost all their begging money on their addictions” and very little on food.", "Informal findings collected by one individual and reported by a news outlet in 2013 tracked more closely with the actual research than the \"wealthy panhandler\" trope:", "He said a panhandler can make more than minimum wage. His informal “study” took place at the exit ramp off highways 205 and 99 in Oregon City.", "The man behind the study, David Spears, spent two weeks last summer on that Oregon City exit ramp — and recorded his findings.", "“I got my oldest pair of work pants, a ratty T-shirt, I grew out my beard as far as it would go,” Spears told KOIN 6 News.", "And he made — on average — $11.10 an hour. That’s more than $2 above Oregon’s minimum wage of $8.95.", "A $300 monthly average income and spending donated money on food was far less attention grabbing than the trope of the wealthy panhandler, but research didn't indicate anywhere near a $50 hourly take was common for beggars under the best of conditions. That dichotomy was present in a November 2015 article titled \"How Much Do Panhandlers Make? New York City Homeless Man Earns $200 An Hour Sitting On Sidewalk With Dog[.]\" Although the headline suggested yet another tale of street beggars drowning in money, its content belied the commonly referenced idea:", "A myriad of perceptions and myths about panhandlers in the United States abound, with the predominant one being that those who sit on the sidewalk asking for handouts are lazy and spending whatever money they get on alcohol or drugs. In 2013, researchers in San Francisco surveyed 146 panhandlers and found that most make less than $25 per day. And while it found that 94 percent spent that money on food, it also found that 44 percent would use it for drugs or alcohol and that 25 percent and 32 percent of those surveyed were addicted to alcohol and drugs, respectively.", "A survey conducted in 2001 on panhandlers' income and spending patterns in Toronto found that 70 percent would prefer a minimum-wage job over panhandling. The median monthly income from panhandling was found to be $300. \"Few panhandlers earn extremely large amounts of money,\" the researchers said their findings indicated.", "Although hard, reality-based numbers about panhandler income are difficult to track down, no credible source suggests that panhandlers are regularly earning $50 an hour under any conditions. Most studies indicate that a monthly average is well below minimum wage earnings (and that money was determined to most likely be spent just on food). Although panhandlers intermittently do report random incidents of extreme generosity, \"wealthy panhandlers\" seem to exist primarily in questionably authenticated news exposés about begging scams.", "We have contacted Sims as well as the original article's author, but have not yet received a response to our question about the origin of the $50 figure.", "Bose, Rohit and Stephen W. Hwang.   \"Income And Spending Patterns Among Panhandlers.\"\r\n    Canadian Medical Association Journal.   September 2002.", "Harrington, Elyssa et. al.   \"Do Panhandlers Make More Than You Do?\"\r\n    KOIN.   13 August 2013.", "Scott, Michael S.   \"The Problem Of Panhandling.\"\r\n    Center for Problem-Oriented Policing.   2002.", "Whitman, Elizabeth.   \"How Much Do Panhandlers Make? New York City Homeless Man Earns $200 An Hour Sitting On Sidewalk With Dog.\"\r\n    International Business Times.   12 November 2015.", "Museum of Hoaxes.   \"Panhandler Earns $50/hr.\"\r\n    10 June 2008.", "Residentially Challenged.   \"How Much Does A Panhandler Really Make?\"\r\n    9 June 2012.", "Shmoop.   \"The Adventures Of Sherlock Holmes[:] The Man With The Twisted Lip Summary.\"\r\n    Accessed 14 December 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]