["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The photo does not show a COVID-19 protest in Berlin. It was taken in August 2019 in Zurich, Switzerland, during the 28th annual techno Street Parade.", "A photograph showing a crowd of hundreds of thousands of people at a techno music event is being misused online.", "Posts, like this one on Facebook, claim that the image depicts a massive COVID-19 protest in Berlin, Germany.", "\"Berlin right now … protesting the COVID hoax,\" the Aug. 2 post says.", "The photo was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The photograph is real, but it has nothing to do with the pandemic. It wasn’t taken in Germany, or in 2020.", "The image was captured on Aug. 10, 2019, in Zurich, Switzerland, and shows partygoers at the 28th annual Street Parade.", "The house and techno music parade travels around Lake Zurich; organizers estimated that approximately 850,000 people attended the event in 2019.", "Meanwhile, thousands of people did participate in demonstrations in Berlin against the country’s COVID-19 restrictions. German police estimated that at least 17,000 people turned out for the Aug. 1 march, which was followed by a sit-in at Berlin's Brandenburg Gate.", "But this photo doesn’t depict that event. False.", "Facebook post, Aug. 2, 2020", "StreetParade.com, 2019 event photos, Accessed Aug. 3, 2020", "Wegoout.com, Street Parade: discover Switzerland's biggest techno event, July 17, 2019", "CNN, Thousands gather in Berlin to protest against Covid-19 restrictions, Aug. 1, 2020", "Associated Press, Thousands protest in Berlin against coronavirus restrictions. Aug. 1, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]