["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On the morning of Nov. 7, 2020 — around the same time the world learned voters elected Democrat Joe Biden as the 46th president of the United States — Republican President Donald Trump's personal attorney, Rudy Giuliani, held a news conference in a Philadelphia parking lot to attack the integrity of America's democratic process by alleging voter fraud without any evidence.", "One of Giuliani's many unsubstantiated claims to perpetuate the alleged conspiracy involved onetime heavyweight boxing champion Joe Frazier, otherwise known as Smokin' Joe. The former New York City mayor asserted that someone, or a group of people, was maliciously using Frazier's identity to illegally cast ballots in Philadelphia though Frazier is dead. Giuliani said:", "\"I know this city has a sad history of voter fraud. After all, Joe Frazier is still voting here, kinda hard since he died five years ago. But, Joe continues to vote. If I recall correctly, Joe was a Republican. So maybe I shouldn't complain. But we should go see if Joe is voting Republican or Democrat, now from the grave.\"", "The accusation was false on several fronts.", "For starters, yes, Smokin' Joe is dead. However, he died on Nov. 7, 2011, of liver cancer, which was exactly nine years prior to Giuliani's press conference — not five, like the attorney asserted. Additionally, Frazier did not voice political views when he was alive, according to his New York Times obituary, though media and onlookers perceived him, to his consternation, as the American establishment's fighter.", "But the most extreme assertion Giuliani made was that one or more people had used Frazier's identity to illegally vote on a continuous basis. Although Giuliani did not specify to which election he was referring, the timing and nature of his remarks suggested he wanted his listeners to believe Frazier had \"voted from the grave\" in the Trump-Biden race.", "To determine the legitimacy of that accusation, we looked up Frazier's birthdate on Britannica — Jan. 12, 1944 — since elections officials in Pennsylvania keep records on registered voters using their birthdates.", "Next, we reached out to the Philadelphia City Commissioners, a bipartisan board that oversees elections and voter registration in the city, for evidence to confirm or deny whether anyone was illegally using the boxer's identity.", "At Snopes' request, the office sent screenshots of its voter database showing every person who at one point registered to vote in Philadelphia under the name \"Joseph Frazier,\" as pictured below. Fifteen people fell under that category, including people whose registration was no longer valid, such as the famous boxer himself.", "As you can see, just one entry showed the same birthdate as Frazier, which meant that entry was Smokin' Joe's voter file in Philadelphia.", "The election board's office sent us a copy of that specific document, which showed election officials \"canceled\" Frazier's active registration status on Feb. 8, 2012, shortly after his death. He last voted in Philadelphia in 2006, the records show.", "Considering that irrefutable evidence — which was directly from the state-certified computer system running elections in Philadelphia — we can say definitely that no person or group used the identity of the famous boxer to vote after his death, including in the 2020 presidential election.", "A spokesman for the board, Kevin Feeley, confirmed with Snopes via email:", "\"The Board of Elections updates all voter records in Philadelphia upon receiving word of a voter’s death from state health officials. The Board has no evidence to support this allegation.\"", "In fact, there was no evidence of any Pennsylvania voter's using a dead person's identity to vote in the 2020 election. “The court found no deficiency in how PA maintains its voter rolls, and there is currently no proof provided that any deceased person has voted in the 2020 election,\" the state's Office of Attorney General said in a statement to The Associated Press.", "In sum, the claim by Giuliani about Frazier was false, and ultimately part of a campaign by Trump and his Republican allies to convince Americans of a nefarious scheme by Democrats to undermine Trump's reelection — even though elections officials from both political parties say there's no evidence of mass, or even sporadic, voter fraud that influenced the outcome of the election.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]