["About this rating", "In February 2012, Indiana state representative Bob Morris sent the above-quoted letter to House Republicans to explain why he refused to add his name to a resolution celebrating the 100th anniversary of the Girl Scouts (a resolution which was passed unanimously by the rest of the Indiana House), maintaining that the Girl Scouts are a \"radicalized organization\" that promotes abortions and homosexuality and serves as a \"tactical arm\" of Planned Parenthood.", "In response, Planned Parenthood of Indiana (PPIN) President and CEO Betty Cockrum issued the following statement:", "It was disappointing to read Rep. Morris' inflammatory, misleading, woefully inaccurate and harmful words about Planned Parenthood, the Girl Scouts of America, and the President and First Lady.PPIN does not produce nor distribute the materials Rep. Morris referenced. Planned Parenthood of Indiana is first and foremost a provider of affordable, high-quality health care, serving more than 100,000 Hoosiers across the state. Our nonprofit provides preventive services such as life-saving cancer screenings, Pap tests, birth control, testing and treatment for STDs, as well as sexual health education and health counseling. As part of our sexual education services, we offer a variety of age-appropriate education services developed by trained professionals.", "On the national level, inflammatory and generally inaccurate claims about a partnership between the Girl Scouts and Planned Parenthood have been promoted primarily by anti-choice lawmakers seeking to place pressure on organizations to disassociate or distance themselves from Planned Parenthood. As part of their campaign against the Girl Scouts, these groups are also attacking the Girl Scouts' policies on sexual orientation and gender identity.", "Planned Parenthood currently has no formal partnership with the Girl Scouts, but supports their mission and recognizes their century of contributions to our society.", "According to the Associated Press, Morris' comments were dismissed by his fellow lawmakers:", "The scouts and Planned Parenthood have dismissed Rep. Bob Morris' comments as absurd, as did Republican House Speaker Brian Bosma.Morris' comments were the butt of jokes inside the House, with Bosma spending much of the day handing out Thin Mints to lawmakers. He joked that Morris' comments led him to buy hundreds of cases of the famous Girl Scout cookies.", "\"I purchased 278 cases of Girl Scout cookies in the last four hours,\" said a clearly sarcastic Bosma, who closed the session by asking the former Girl Scouts in the", "chamber to stand up.", "At the end of the session, he brushed off the controversy, saying \"I've been to the carnival before, and you don't walk into every sideshow tent.\"", "No other Republican representative expressed support for the letter.", "Morris' comments about the Girl Scouts came in a letter he sent to House Republicans that said he had conducted some research on the Internet and discovered that the scouts are a \"tactical arm\" of Planned Parenthood.", "The Girl Scouts flatly denied Morris' accusations, and Planned Parenthood of Indiana issued a separate statement calling Morris' charges \"woefully inaccurate.\"", "Morris, in his letter to lawmakers, said some Christian conservatives who share his concerns have pulled their children out of Girl Scouts. He also pointed to a Colorado Girl Scout troop's acceptance of a transgender child last month as another reason to leave the group.", "The Girl Scouts of America issued their own statement on the matter, saying:", "Regarding Representative Morris, if the freshman representative wishes to discredit the contributions that hundreds of thousands of Indiana women and girls have made through the Girl Scouts program over the last 100 years, then he's entitled to his opinion. Not only is Rep. Morris off the mark on his claims, it's also unfortunate in his limited research that he failed to discover that since 1917, every First Lady has served as the honorary leader of Girl Scouts including Nancy Reagan, Barbara Bush and Laura Bush.We believe that leadership is about hearing from all sides of an issue before making up one's mind. We only wish we had the chance to speak with Freshman Representative Morris before he distributed his letter", "Victor Inzunza, Director of Corporate Communications for Girl Scouts of the USA, also said that:", "As for the specific issues mentioned in Rep. Morris letter, in 2011 a Colorado chapter of the Girl Scouts initially refused, then allowed, a 7-year-old transgender girl to join their organization:", "The leader of a Girl Scouts troop in Denver initially told 7-year-old Bobby Montoya that he couldn't join because, \"he has boy parts.\"But the organization had a change of heart, saying, \"Girl Scouts is an inclusive organization and we accept all girls in Kindergarten through 12th grade as members.", "\"If a child identifies as a girl and the child's family presents her as a girl, Girl Scouts of Colorado welcomes her as a Girl Scout.\"", "Bobby Montoya was born with male genitalia but has been convinced since the age of 2 that he is a girl. His biggest worry, said his mother, is that he will have to change his name.", "\"I believe he was born in the wrong body,\" said Felisha Archuleta, who admitted that even she has difficulty switching from male to female pronouns when talking about her son.", "\"I thought Bobby would grow out of it,\" she said. \"For birthdays, he asked for ponies. He had a princess birthday, and last year when he turned 7, he had a Rapunzel birthday. I have just basically supported him.\"", "Bobby has told his mother he believed he was a girl ever since he was very young, said Archuleta. \"He just liked girl stuff. When he was 4 or 5, he asked me, 'Why didn't you make me a girl?'\"", "The issue of the Girl Scouts' using a Planned Parenthood sex education pamphlet entitled \"Happy, Healthy, and Hot\" was touched on in a Daily Beast article about sisters Tess and Sydney Volanski, who left the Girl Scouts because they felt the Girl Scouts had a \"pro-abortion mind-set\" and a \"radical feminist agenda\":", "The Volanskis' gripe with the Girl Scouts began in earnest when the World Association of Girl Guides and Girl Scouts (WAGGGS) attended the U.N.'s Commission on the Status of Women. At the conference, 30 to 35 teenagers from around the world participated in the Girls Only Workshop, a panel discussion about global issues affecting girls.The Volanskis and their supporters say that during the workshop, a brochure about HIV health, family planning, and reproductive rights entitled \"Happy, Healthy, and Hot\" was distributed to the teen girls. According to the GSUSA, the brochure in question was not distributed at the WAGGGS workshop, but was from a different event at the conference. There was also a march for women's reproductive rights at the conference — rights that include \"accessible, affordable, and safe abortions,\" according to the WAGGGS website.", "The events that transpired at the conference, as stated on the Volanskis' blog, were perceived as part of GSUSA's \"corrupt\" plan to promote \"Planned Parenthood, promiscuity, and abortion to their members, as well as a political agenda.\"", "The Girl Scouts have asserted that the national organization \"maintains a neutral position on abortion and birth control,\" but local chapters may partner with outside groups in covering those issues:", "The GSUSA officially maintains a neutral position on abortion and birth control. Because the organization has a two-tiered leadership structure, however, local or regional chapters have the autonomy to partner with organizations of their choice, which may include, say, Planned Parenthood affiliates (or, for that matter, conservative organizations).\"In some areas of the country, Girl Scout troops or groups may choose to hold discussions about human sexuality and may choose to collaborate with a local organization that specializes in these areas,\" said the GSUSA in a statement. \"The topic is discussed from a factual, informative point of view and does not include advocacy or promotion of any social or religious perspective.\"", "Last updated:   23 February 2012", "Goudreau, Jenna. \"Girl Scouts Responds to Indiana Lawmaker's Allegations.\" Forbes. 22 February 2012.", "Guarino, Mark. \"Indiana Lawmaker Slams 'Radicalized' Pro-Abortion Group.\"\r\n   The Christian Science Monitor.   22 February 2012.", "Jaccarino, Mike.   \"Transgender Boy's Attempt to Join Girl Scouts Initially Rejected.\"\r\n     New York Daily News.   27 October 2011.", "James, Susan Donaldson.   \"Transgender Bobby Montoya Still Waits for Call from Girl Scouts.\"\r\n   Yahoo! News. 27 October 2011.", "Lynche, Rene.    \"Girl Scouts Promote Homosexuality and Abortion, Lawmaker Says.\"\r\n     ABC News.   27 October 2011.", "LoBianco, Tom.   \"Indiana Lawmaker Says Girl Scouts Promote Abortion.\"\r\n    Los Angeles Times.   22 February 2012.", "Salario, Alizah.   \"Why Are Pro-Lifers Targeting the Girl Scouts?\"\r\n   Associated Press.    22 February 2012.", "Associated Press.\r\n    \"Rep. Stands by Claims Girl Scouts Work for Planned Parenthood.\"     22 February 2012.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]