["About this rating", "On 29 December 2016, Politicalo published an article that appeared to report Bristol Palin said \"sissies\" who won't perform at President-elect Donald Trump's inauguration did not want to because they were afraid they might fall in love with him:", "The daughter of former half-term Alaska governor Sarah Palin had a meltdown on her blog [on 28 December 2016], calling out what she termed the 11 “sissies” who have publicly stated that they have no intention of performing at Donald Trump’s inauguration.", "“I understand it must be difficult to be in a position where you’re supposed to publicly perform for a man you’re sexually attracted to, but at the same time, don’t want the rest of the world to know about,” Palin wrote on her blog. “I get that that’s a burden, and a heavy one at that, but ultimately, it would seem that so-called Hollywood superstars these days haven’t got a clue what it means to suck it up and take one for the team, because if they did, not a single one would refuse to do their duty for this country. And let’s make one thing very clear, while we’re on the subject: the only reason why they’re alleged stars in the first place is because this country and its people, many of whom are Trump supporters, have made that possible.”", "She continued, “So, to react in such a way when the very people that made them famous require them to be there and do their job, to perform and entertain, to do the very thing that enables them to drive expensive cars, live in huge mansions and earn millions of dollars, it doesn’t mean that they’re superstars or even primadonas; it makes them huge sissies who would rather disappoint their fans than show them gratitude. And then there’s also the fact that the majority of them are closeted homosexuals, who are afraid of falling in love with the great, handsome newly elected President of the United States right then and there on stage. Some might even say that’s the main reason why they’re acting like sissies, and you know what? I agree with that.”", "The material published by Politicalo (as well as sister sites Religionlo, Politicops, and Newslo) generally begins with a paragraph of fact-based information before appending extensive fabricated details.", "It has been widely reported that Palin described artists refusing to accept invitations to Trump's 20 January 2017 inauguration as \"sissies\":", "ICYMI: Bristol calls musicians \"sissies\" for refusing to perform at President-elect @realDonaldTrump's inauguration. https://t.co/vcJJNRItOI pic.twitter.com/g9aF7AstK8", "— Fox News (@FoxNews) December 30, 2016", "But all content following the first paragraph's \"sissies\" remark was fabricated. Palin's remarks did not delve into whether Trump was irresistible or lovable, nor did she suggest at any point that anyone would be uncontrollably attracted to him.", "Newslo's fake news sites frequently circulate (sometimes using the lesser-known Politicops domain) on social media, and all include a button allowing readers to \"show facts\" or \"hide facts.\"", "The sites' articles display by default in \"hide facts\" mode, ensuring most visitors are not apprised of the highlighted embellishments:", "Bristol Palin, and the rest of the Palin family, are a popular target for Newslo sites. Previous articles falsely reported that Bristol Palin said all black actors look alike and thus are unlikely to earn Oscar nods, and another stated (again, falsely) that Sarah Palin made offensive remarks about slavery.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]