["By Saranac Hale Spencer", "Posted on October 24, 2018", "Q: Is George Soros paying Central Americans to immigrate to the U.S.?", "A: That’s an unsubstantiated claim that began with a tweet from Rep. Matt Gaetz and then spread widely online.", "A video purportedly showing Central American emigrants who are part of what has become widely referred to as a “caravan” was posted last week by Rep. Matt Gaetz and, later, President Donald Trump. It has been shared tens of thousands of times on Facebook and Twitter.", "The problem is that many claims about those videos also include misinformation.", "The most widely circulated claim came from Gaetz’s original tweet, which said: “BREAKING: Footage in Honduras giving cash 2 women & children 2 join the caravan & storm the US border @ election time. Soros? US-backed NGOs? Time to investigate the source!”", "Gaetz later corrected one piece of information in his original tweet. He said on CNN’s “State of the Union” on Oct. 21 that the video wasn’t shot in Honduras, but rather in Guatemala. He explained in a tweet that “because a Honduran government official sent me this video, I believed it came from Honduras.”", "But he has let stand the reference to one of the most common right-wing conspiracy theories — that liberal billionaire philanthropist George Soros is behind it all.", "We’ve debunked a lot of claims that Soros is involved in orchestrating major social or political events. This is just the latest.", "In his tweet, Gaetz suggested, without offering any evidence, that Soros might be funding the immigrants. And that claim has been embraced by the right-wing community that is spreading the video online.", "It also has been adopted by websites that traffic in misinformation, which have posted stories with headlines like: “Who’s behind the ‘migrant caravan’ invasion? – George Soros and the telltale Star of David,” “Soros’s Human Caravan Slowed In Mexico But Still Pushing North,” and “Soros Letter Reveals Plot to ‘Take Down Borders’ with Migrant Caravan Invasions.”", "That last story, posted on a website called News Punch, claims, “George Soros and his Open Society Foundations have been plotting since 2015 to use migrant caravan blitzkriegs to achieve the goal of ‘taking down national borders.'” It cites an email that Soros sent to Bloomberg Business as the only evidence to support the claim, but Soros didn’t say that he had plans of “taking down national borders.” He did respond to criticism about immigration policy from Hungary’s prime minister, Viktor Orban, in a statement to Bloomberg that said, “His plan treats the protection of national borders as the objective and the refugees as an obstacle. Our plan treats the protection of refugees as the objective and national borders as the obstacle.”", "Laura Silber, spokeswoman for the Open Society Foundations confirmed to FactCheck.org in an email that neither Soros personally nor his charitable organization have been funding the Central Americans traveling through Mexico.", "Silber said in a statement: “Open Society certainly supports the historic US commitment to welcoming people fleeing violence and oppression in their home countries — a commitment honored by presidents of both parties dating back years, prior to 2016. And the foundation has supported various organizations working with immigrants on both sides of the border. But there is no funding going from OSF to the group of people moving north from Honduras into Mexico.”", "Beyond that, the video itself doesn’t even clearly show that it’s money being handed out. The video was shot in the southern Guatemalan city of Chiquimula, which served as a way station for the group of immigrants, who are largely from Honduras. Starting on Oct. 16, a local radio station began reporting on the immigrants’ path through the city, including photos of various things that locals handed out to them, including: Bibles, medical care, and food. At least one church opened its doors to let immigrants sleep inside. It’s likely that the video was taken that day, since Gaetz posted it to Twitter on Oct. 17. It’s unclear if the two men in the video are handing out vouchers, or cash, or informational bulletins, or even who the men are.", "Gaetz said on CNN’s “State of the Union” that the video had been provided to him by “Honduran government officials, it was collected by Central American intelligence officials,” but he hasn’t given any further information to support the questions he raised in the tweet about Soros. His office did not respond to our request for more information.", "Gaetz explained on the show that he was raising these questions because Soros has funded non-governmental organizations in the past. He said, “If you have organizers working in concert with U.S. NGOs or left- leaning groups that’s also a problem. So I think that we’ve seen that model in other parts of the world, Jake, in the Balkans. Judicial watch just did a report where you saw U.S. NGOs working alongside Soros backed groups for political outcomes. I hope that’s not happening in Latin America or anywhere else in the world.”", "While it is certainly true that Open Society works with NGOs to advance democracy abroad and support issues such as anti-discrimination and gender equality, that’s not evidence that Soros or Open Society is funding Central American emigrants to come to the U.S.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“As human caravan moves through Mexico, ‘full respect’ needed for national control of borders: UN chief.” Press release. United Nations. 22 Oct 2018.", "Gaetz, Matt. “BREAKING: Footage in Honduras giving cash 2 women & children 2 join the caravan & storm the US border @ election time. Soros? US-backed NGOs? Time to investigate the source!” Twitter. 17 Oct 2018.", "“State of the Union with Jake Tapper.” CNN. 21 Oct 2018.", "Gergely, Andras. “Orban Accuses Soros of Stoking Refugee Wave to Weaken Europe.” Bloomberg. 30 Oct 2015.", "Open Society Foundations. Grants database. Accessed 24 Oct 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]