["The photo was published on Facebook here on February 16, 2021.", "“In her Toolkit GretaThunberg wanted #AskIndiaWhy to trend. But India  turned the tables on Greta. #AskGretaWhy is trending at No.1 now. Greta’s way of social activities,” reads the post’s caption.", "The post circulated online after Thunberg tweeted her support for  the Indian farmers farmers’ protests on February 4, 2021.", "On February 19, 2021, she also voiced support for an Indian activist arrested over a guide for anti-government farmers protests, which the Swedish climate campaigner had earlier shared to social media. AFP reported on the developments here.", "Similar posts mocking Thunberg’s activism also shared the photo here, here, here, here and here on Twitter.", "The image, however, has been doctored.", "A Google reverse image found the original photo posted here, on Greta Thunberg’s official Twitter account on January 22, 2019. The photo caption reads: “Lunch in Denmark.”", "Lunch in Denmark. pic.twitter.com/LWKMQ9AuqR", "Below is a screenshot comparison of the doctored photo (L) and the original Twitter photo (R):", "A reverse image search found the photo of children in the background was published by Reuters news agency in August 2007 in an article about a deserted village in the Central African Republic due to an armed conflict.", "The photo caption reads:  “Children living in the forests sit at a makeshift camp for the internally displaced persons near the village of Bodouli August 23, 2007. According to locals, government soldiers attacked Korosigna without warning in January 2006, part of a two-year-old bush war fought against rag-tag rebels across northern parts of the former French colony, landlocked in the heart of Africa.”", "Below is a screenshot of the Reuters photo:", "Eduardo Bolsonaro, the son of Brazilian President Jair Bolsonaro, posted the doctored image of Thunberg here on his official Twitter account in September 2019.", "AFP Fact Check’s Portuguese team subsequently published this fact check about the doctored photo in 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]