["The 41-second clip was published in this Facebook post on September 6, 2019. It has been viewed more than 1.6 million times and shared more than 64,000 times.", "The post's Hindi-language caption translates to English as: “See what happens when the cops could not distribute the money equally among themselves after collecting traffic fines.”", "Below is a screenshot of the misleading Facebook post:", "The same video was shared on Facebook here and here; here on Twitter and here on YouTube with a similar claim.", "India’s new Motor Vehicle Act and updated traffic fines came into effect on September 1, 2019. Here is a local media report explaining the fines, and here is a copy of the legislation.", "The footage of the police officers fighting has nothing to do with the new traffic fines -- the video has circulated online since 2013. According to local media reports at the time, it shows police officers fighting over security arrangements at an event attended by the then-chief minister of the north Indian state of Uttar Pradesh, Akhilesh Yadav.", "A Hindi-speaking journalist in AFP's Delhi bureau analysed the video. At the 26 second mark in the clip, one of the policemen can be heard accusing the other of being absent from duty when the chief minister was due to arrive.", "“When the chief minister was coming, he was missing from his security duty. I didn’t have his number and asked a constable to call him, but he started abusing me. I told my senior, but abused me in front of him as well,” he says in Hindi.", "A reverse image search on Google using the keyframes from the misleading footage found this footage posted on the official YouTube channel of Headlines Today on May 22, 2013.", "The video’s title states: ‘Two UP cops thrash each other with lathis’", "UP cops refer to Uttar Pradesh police, meanwhile ‘Lathi’ is a Hindi word for a stick or truncheon.", "Below are three screenshot comparisons of the video shared in the misleading Facebook post (L) and the video published in the Headlines Today report (R ):", "The original incident was also reported here by The Indian Express newspaper on May 23, 2013, which said the fight was due to an issue over security arrangements at an event.", "Below is a screenshot of the news report:", "“Two jawans of Provincial Armed Constabulary (PAC) clashed in full public view outside the Indira Gandhi Pratishthan soon after Chief Minister Akhilesh Yadav left the venue after attending a business conference of the Indian Industries Association at Gomti Nagar area on Wednesday afternoon,” a part of the report says.", "The 2013 incident was also reported here by India TV and here by the Hindustan Times.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]