["About this rating", "Patrick Moore was an early and influential member of Greenpeace who now espouses climate-skeptic views.", "Greenpeace does not consider Moore a co-founder of the organization, and the entity that became Greenpeace existed prior to Moore being affiliated with that group.", "On 12 March 2019, U.S. President Donald Trump tweeted about a portion of a \"Fox and Friends\" television interview with a man named Patrick Moore. \"Fox and Friends,\" and by extension Trump, claimed Moore co-founded Greenpeace:", "People who adopt ostensibly oppositional views to their own perceived political background are popular fodder for punditry. The problem with this specific example is that Moore did not co-found Greenpeace. Though he once was involved with the group, his views have diverged substantially since he left in 1986. According to that organization:", "Patrick Moore frequently portrays himself as a founder or co-founder of Greenpeace, and many news outlets have repeated this characterization. Although Mr. Moore played a significant role in Greenpeace Canada for several years, he did not found Greenpeace. Phil Cotes, Irving Stowe, and Jim Bohlen founded Greenpeace in 1970.", "Moore was one of Greenpeace’s earliest and more influential members, eventually serving as president of Greenpeace Canada. Greenpeace, as an organization, has its origins in a voyage made by activists to the Aleutian Island of Amchitka in a largely failed effort to stop nuclear weapons testing in the area.", "These activists, who at the time called themselves the “Don’t Make a Wave Committee,” raised money and commissioned a vessel, the Phyllis Cormack, for this purpose beginning in 1970. In March 1971, as a graduate resource ecology student, Moore applied for and was given a berth on the ship, later nicknamed “The Greenpeace.” In fairness, many people associated with these early days apparently describe themselves as co-founders of Greenpeace. An archived Greenpeace history page from 2007, which lists Moore under “co-founders and first members”, says:", "There's an old joke that in any bar in Vancouver Canada you can sit down next to someone who founded Greenpeace. In fact, there was no single founder, and the name, idea, spirit, tactics, and internationalism of the organisation all can be said to have separate lineages.", "Moore left Greenpeace in 1986. Speaking of that decision, Moore wrote in 2005:", "By the mid-1980s, the environmental movement had abandoned science and logic in favor of emotion and sensationalism. I became aware of the emerging concept of sustainable development: balancing environmental, social and economic priorities. Converted to the idea that win-win solutions could be found by bringing all interests together, I made the move from confrontation to consensus.", "In 2004, Wired Magazine described Moore’s shift away from Greenpeace in more cynical terms:", "In 1986, the PhD ecologist abruptly turned his back on the environmental movement. He didn't just retire; he joined the other side. Today, he's a mouthpiece for some of the very interests Greenpeace was founded to counter, notably the timber and plastics industries. He argues that the Amazon rainforest is doing fine, that the Three Gorges Dam is the smartest thing China could do for its energy supply, and that opposition to genetically modified foods is tantamount to mass murder.", "Moore is now or has been paid by several entities or causes that Greenpeace now opposes. According to the climate media blog DeSmog:", "After he left Greenpeace, Moore began work with the Nuclear Energy Institute front group, the Clean and Safe Energy Coalition (CASEnergy). Moore stepped down from his leadership role at CASEnergy in January 2013, however [he said that he] would remain an active member.", "Moore has worked for the mining industry, the logging industry, PVC manufacturers, the nuclear industry, and in defense of biotechnology. In October 2008, Greenpeace issued a statement distancing itself from Moore, saying he “exploits long gone ties with Greenpeace to sell himself as a speaker and pro-corporate spokesperson, usually taking positions that Greenpeace opposes.”", "Moore has been criticized for his relations with “polluters and clear-cutters” through his consultancy. His primary income since the early 1990s has [come from] consulting and publicly speaking for a variety of corporations and lobby groups such as the Nuclear Energy Institute. As of 2014, Moore was also listed as a board member of NextEnergy, a Canadian energy services company.", "In one notable media appearance, he defended the safety of glyphosate, a weed killer, by saying he could drink a quart of the product straight with no problem. When challenged to do so by the interviewer, he changed course, saying he wouldn’t because he’s “not an idiot” before abruptly ending the interview:", "Moore has also long been associated with a cadre of academics who consider themselves climate skeptics. In 2015 he was a speaker at a Texas Public Policy Foundation conference that included sessions like “CO2 is the Gas of Life”, echoing the statements Moore made on \"Fox and Friends\" in 2019.", "As Moore states, it is true that CO2 is a crucial building block of life that provides the raw material for plants to grow. This, in turn, provides animals with food and oxygen. However, such an observation, which you can find described in any middle-school science textbook, does not infringe upon the fundamental, physical truth that higher concentrations of CO2 in the atmosphere will warm the planet. Moore’s anti-climate-change statement on \"Fox and Friends\" is a bad-faith argument, and attributing such statements to a “Greenpeace co-founder” is factually inaccurate.", "Greenpeace.org.   “Patrick Moore Background Information.\"\r\n    Accessed 12 March 2019.", "Greenpeace.org.   “Amchitka: the Founding Voyage.\"\r\n    Accessed 12 March 2019.", "Greenpeace.org.   “The Founders of Greenpeace.\"\r\n    Archived on 3 February 2007.", "Moore, Patrick.   “Environmental Movement Has Lost Its Way.”\r\n    Foreign Policy.   28 January 2005.", "Bennett, Drake.   “Eco-Traitor.”\r\n    Wired.   March 2004.", "Desmog Blog.   “Patrick Moore.\"\r\n    Accessed 12 March 2019.", "Texas Public Policy Foundation.   “TPPF To Host ‘At the Crossroads’ Energy and Climate Policy Summit.\"\r\n    9 November 2015.", "Grumbach, Elizabeth S.   Roadmap to 6th Grade Science, Ohio Edition.\r\n    Princeton Review, 2001.   0375755993.", "Natural Resources Defense Council.   “EPA’s Endangerment Finding.\"\r\n    May 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]