["By Eugene Kiely", "Posted on July 3, 2018", "In a Fox Business interview, President Donald Trump singled out trade barriers as a reason for five “very bad years” for U.S. farmers. But agricultural economists blame low farm commodity prices — not trade barriers.", "In fact, U.S. agricultural exports totaled $140.5 billion in fiscal year 2017 — the third-highest amount on record. And, as it has done for decades, the U.S. agricultural sector posted an annual trade surplus of $21.3 billion in 2017, up almost 30 percent from fiscal 2016.", "Chad E. Hart, an associate professor of economics and crop markets specialist at Iowa State University, described trade as a “bright spot” for an industry that has been in decline after record income levels from 2011 through 2014.", "“Farm incomes have dropped significantly since, but most of the blame for that should go [to] consistent, near record high production for most agricultural goods,” which has “lowered prices and incomes,” Hart told us in an email. “Trade is more likely to be a bright spot for ag, rather than a barrier (as the aggregate data shows).”", "In a wide-ranging discussion on trade deals, Trump talked about farm trade during a July 1 interview with Maria Bartiromo on Fox Business.", "Trump, July 1: If you look at what has happened with farms. Over 15 years, it’s just a steady decline. Over the last five — I’ve been here a year-and-a-half — over the last five years, they have been very bad years for farms and farmers. I said, we have to change that. And one of the reasons is because they have barriers. These aren’t even economic barriers, although, in Canada’s case, 275 percent tariff for dairy. That’s not fair.", "Trump is wrong that farm income has been in “steady decline” over 15 years and generally right that the last few years have been “very bad” — but not for the reason he gives.", "U.S. farms “experienced a golden period during 2011 through 2014 due to strong commodity prices and robust agricultural exports,” according to a February report by the nonpartisan Congressional Research Service. Since then, however, net farm income has been well below those record levels — a trend that will continue through fiscal 2018, the CRS report says.", "“Net cash income and net farm income are both forecast lower in 2018 relative to 2017, thus continuing a general downward trend in farm income since 2013 — primarily the result of a significant decline in most farm commodity prices since the 2013-2014 period,” the CRS report says. (The emphasis is ours.)", "The U.S. Department of Agriculture’s Economic Research Service forecasts national net farm income at $59.5 billion in 2018, down nearly 7 percent from last year and “substantially below the 10-year average of $85.7 billion,” the CRS report says.", "“The ag sector is seeing some hard times, but it is because of lower prices and not trade,” Wallace E. Tyner, who teaches agricultural economics at Purdue University, told us. “Weather has been pretty good, production high, and prices therefore lower.”", "As for trade, the USDA reported in November 2017 that farm exports “totaled $140.5 billion in fiscal year (FY) 2017, climbing nearly $10.9 billion from the previous year to the third-highest level on record.” That’s an increase of 8.4 percent.", "“As it has done for well over 50 years, the U.S. agricultural sector once again posted an annual trade surplus, which reached $21.3 billion, up almost 30 percent from last year’s $16.6 billion,” the USDA said.", "The USDA’s Economic Research Service projects that exports will remain flat at $140 billion in fiscal 2018, which ends Sept. 30. But $140 billion “would still rank in the top 5 years for ag export value,” Hart, the Iowa State University professor, told us. “For historical perspective, 2008 was a record year for ag exports at the time, at $115 billion. So there has been significant growth in ag exports over the past decade.”", "Mary Marchant, a professor in Virginia Tech’s Department of Agricultural and Applied Economics, said simply, “Bottom line, trade has been good for ag. overall & we are dependent on it for our success.”", "This USDA chart shows how farm exports have fueled farm cash receipts since 2000.", "Trump is generally correct about Canada’s high tariffs on U.S. dairy imports. Canada limits U.S. dairy products that can be imported without tariffs and imposes stiff tariffs above those quotas.", "“Under the current system, U.S. imports above quota levels are subject to high tariffs (e.g., 245 percent for cheese, 298 percent for butter),” according to Export.Gov, a project of the U.S. Department of Commerce.", "But that’s the exception — not the rule — when it comes to trade with Canada under the North American Free Trade Agreement.", "“Canada eliminated tariffs on all industrial and most agricultural products imported from the United States under the terms of NAFTA,” with dairy and poultry being the exceptions, according to Export.Gov.", "Tyner, the Purdue professor, said it is not unusual for countries to impose trade barriers on what he called the “white trade,” which he said is rice, dairy, sugar and cotton.", "“Many countries have protections on those – for whatever reason, people want to produce it at home,” Tyner told us in a phone interview. “It is not uncommon. Most of the world has protection [on white trade]. The U.S. has huge protection on sugar – though tariffs and quotas. Rice is sacred in Japan – very high protection. Those four commodities have always been tough to get free trade on.”", "Despite Canada’s high tariffs on dairy, the USDA says that U.S. dairy exports grew 17 percent to $5.3 billion in fiscal 2017 from the previous year.", "Soybeans were the top U.S. agricultural export in 2017 at $21.6 billion, according to the USDA.", "Tyner said retaliatory tariffs from China, the European Union, Mexico and Canada threaten to do long-term damage to U.S. agricultural exports, citing soybeans in particular.", "For example, the Trump administration has announced it will charge tariffs on $34 billion in Chinese imports, beginning July 6. China says it will retaliate with equal tariffs on $34 billion in U.S. goods, including on U.S. soybeans, wheat, corn, sorghum and beef.", "Tyner co-authored an article with a Purdue colleague, Farzad Taheripour, on the potential impact of China’s retaliatory tariffs — focusing in particular on the No. 1 agricultural export, soybeans.", "China is “by far the largest importer of U.S. soybeans” and imports soybeans from both the U.S. and Brazil, the authors write. As a result, Tyner and Taheripour estimate that U.S. global exports of soybeans would fall between 24 percent and 34 percent, while Brazil would see a 15 percent to 25 percent increase in global soybean trade. (See Table 1.)", "“[T]he 25% Chinese tariff is a lose–lose proposition for both China and the United States,” the authors write. But Brazil would see “a significant increase in soybean production and an improvement in economic well-being.”", "Tyner told us that the impact would occur over a period of years, as Brazil increases production.", "“If those [tariffs] go away in six months, it won’t have any impact. But if it goes on for six years, Brazil and others will expand market,” he said. “This can be quite serious.”", "Contrary to Trump’s claim, Tyner said that trade has not been a problem for the U.S. agriculture sector — until now.", "“For the president or anyone else to say trade is a problem – it is now, but wasn’t a month ago,” he said, referring to the retaliatory tariffs.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]