["As unfounded claims of voter fraud continue to spread online, some allege that voters are rising from the dead to cast their ballots.", "Early Thursday morning, conservative commentator Fleccas Talks tweeted that an 118-year-old man named William Bradley had cast an absentee ballot in Michigan. The caveat? Bradley died in 1984, Fleccas wrote. Shortly after, “Students for Trump” founder Ryan Fournier posted the same claim on Facebook.", "The posts were accompanied by a number of screenshots, supposedly showing official data", "When asked for comment, Mark Chase, a spokesperson for Fournier, pointed to the links included in the Facebook post, which he said were provided by Fleccas, who posted the claim first. Fleccas has not responded to USA TODAY’s request for comment.", "Fact check:Votes in Virginia accidentally tallied for Biden, error quickly fixed", "The screenshots that Fleccas and Fournier provide in their respective posts are real. But the Michigan Department of State wrote in a statement that it’s not what it looks like.", "A search of the Michigan Voter Information Center for a “William Bradley” born in March 1902 and living in the postal code area 48202 yields a page that reads “Yes, you are registered!” It says the late Mr. Bradley’s absentee ballot was received on Oct. 2. The U.S. Social Security Death Index has a record of a man with the same name, birthday and postal code’s death.", "Under Fleccas’ tweet, the Michigan Department of State replied, calling it “misinformation” and linking to a “fact check” page on the Secretary of State’s website. Tracy Wimmer, director of media relations for Michigan's Secretary of State, provided USA TODAY with the following statement regarding deceased voters’ ballots:", "“Ballots of voters who have died are rejected in Michigan, even if the voter cast an absentee ballot and then died before Election Day. On rare occasions, a ballot received for a living voter may be recorded in a way that makes it appear as if the voter is dead. This can be because of voters with similar names, where the ballot is accidentally recorded as voted by John Smith Sr when it was actually voted by John Smith Jr; or because of inaccurately recorded birth dates in the qualified voter file; for example, someone born in 1990 accidentally recorded as born in 1890. In such scenarios, no one ineligible has actually voted, and there is no impact on the outcome of the election. Local clerks can correct the issue when it is brought to their attention.”", "USA TODAY searched for record of a younger, living William Bradley and found that one resides at the same address listed for the late Bradley.", "The state of Michigan has a number of security practices in place to ensure voter fraud does not take place, including a partnership with the Electronic Registration Information Center, which uses encrypted voter information from partnering states and death records from the Social Security Administration to flag suspicious registrations, including those of deceased voters.", "Neither Michigan’s Secretary of State office nor Janice Winfrey, the local clerk for the ZIP code, responded to USA TODAY’s request for comment.", "Fact check:Milwaukee wards did not have more votes for president than registered voters", "There's no evidence that indicates ballots mailed to people who have died leads to voter fraud, USA TODAY previously reported. Lorraine Minnite, a political science professor at Rutgers University and author of \"The Myth of Voter Fraud,\" previously told USA TODAY that dead people being able to vote is a myth.", "\"There could be a short period of time in which if you took a snapshot of a (voter registration) list there might be some names of people on there who have died yesterday or died last week,\" Minnite said. \"It takes election officials a little bit of time to sort those things out.\"", "She added that people who claim dead people can vote are referring to voting registration lists, which is misleading because those are regularly cleaned up by election officials.", "A 2016 study by researchers at Dartmouth focused on noncitizen populations, dead people, timing of results and voting technology. It found no evidence of widespread voter fraud in the 2016 presidential election nor any striking abnormalities in states flagged as potentially problematic. Other studies have reached similar conclusions.", "Fact check:Wisconsin turnout in line with past elections, didn't jump 22% as claimed", "We rate the claim that a deceased man in Michigan cast an absentee ballot in the 2020 election as FALSE because it was not supported by our research. While the screenshots posted to social media are real and can be replicated, Michigan’s Secretary of State office debunked the claim as “misinformation,” and USA TODAY found evidence to support that.", "Thank you for supporting our journalism. Youcan subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]