["The voters have spoken, and on Jan. 20, President-elect Joe Biden will be inaugurated as the 46th president of the United States.", "Dump Trump — a page on Facebook that opposes President Donald Trump — posted a photo that purports to show preparations for the day occurring on the lawn behind the White House on Nov. 21.", "\"If you're having a bad day, just remember, Trump is watching Biden's inaugural stage being built on the White House North Lawn. For the next 59 days,\" the caption reads.", "Dump Trump — whose post has been shared almost 1,000 times — has not responded to a request from USA TODAY for comment.", "Fact check:Viral 'Jimmy Kimmel Live' video showing movers at the White House is satire", "In reality, the photo depicts preparations for a different inauguration: that of President Bill Clinton in 1993. The aerial shot of the White House now resides in the Smithsonian Institution Archives.", "The structure in the photo is also not an \"inaugural stage.\" It's a viewing stand for the inaugural parade that traditionally makes its way down Pennsylvania Avenue after the ceremony, per Lead Stories.", "The actual swearing-in occurs on the inaugural platform at the U.S. Capitol, not the White House.", "The inaugural platform that Joe Biden may use to take the oath of office in January is already being built, per the Washington Post.", "The District of Columbia has also repaved Pennsylvania Avenue in preparation for the parade, and the National Park Service has issued a permit for construction of inaugural facilities in Lafayette Square.", "That includes the viewing stand in the photo — it's actually where the new president traditionally sits to watch the rest of the parade after he completes his portion.", "As of Nov. 16, the grand viewing stand near the White House was under construction, per a photo from United Press International.", "It is possible that some traditional elements of a presidential inauguration will not occur for Biden. He may not even use the stage at the Capitol, per the Washington Post.", "Ron Klain, the incoming White House chief of staff, said on Sunday that the inauguration will \"definitely have to be changed.\"", "\"Obviously, this is not going to be the same kind of inauguration we have had in the past,\" he said on ABC News. “They’re going to try to have an inauguration that honors the importance and the symbolic meaning of the moments, but also does not result in the spread of disease,\" Klain also said.", "The claim that a viral photo shows a stage for Joe Biden's inauguration being built on the lawn of the White House is FALSE, because it is not supported by our research. The photo is actually from 1993 and depicts a parade viewing stand. Still, it is true that some preparations for the next inauguration — such as the construction of the inaugural platform at the U.S. Capitol — have begun.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]