["A tweet by historian Ram Guha has caused quite a stir on social media. It carries an excerpt from British writer and former communist Philip Spratt’s writings from 1939. “Gujarat, though economically advanced, is culturally a backward province…Bengal in contrast is economically backward but culturally advanced,” reads the excerpt.", "“Gujarat, though economically advanced, is culturally a backward province… . Bengal in contrast is economically backward but culturally advanced”. Philip Spratt, writing in 1939.", "— Ramachandra Guha (@Ram_Guha) June 11, 2020", "Many individuals accused the historian of promoting misinformation. OpIndia published an article declaring Guha “got history wrong” because OpIndia, which wishes to establish itself as a fact-checking organisation, was unable to trace the excerpt quoted in the tweet.", "Historian Ram Guha gets history wrong while drawing up comparison between Gujarat and Bengal https://t.co/FSWDu2Katf", "— OpIndia.com (@OpIndia_com) June 11, 2020", "OpIndia further attempted to dismiss Guha’s tweet by mentioning that Gujarat came into existence as a state in 1960. This was an attempt to claim that the word ‘Gujarat’ could not have been used before 1960. The same was highlighted by several others.", "Silly man, Gujarat was created in 1960 if it Gujaratis u are referring to then talk about Somnath Dwarka Rani Vav Modhera; Poets like Narmad, Meghani, show me something that can touch ‘Vaishnava Jana To’ written by #NarsiMehta. Show me some place as ancient & vibrant as Dholavira", "— Swaroop Rawal (@YoSwaroop) June 11, 2020", "Former BJP MP Paresh Rawal accused Guha of distorting history.", "https://t.co/wDva5ABpZI After distorting History books Gutless Guha opens up a new avenue of Gujarati/Bengali !looks like he is getting a free ride on somebody’s Tail …! This Chuha Guha is not tired of being punchline of everyone’s jokes !@Ram_Guha", "— Paresh Rawal (@SirPareshRawal) June 11, 2020", "Chief Minister of Gujarat Vijay Rupani responded to Guha’s tweet saying, “Earlier it was the British who tried to divide and rule. Now it is a group of elites who want to divide Indians.”", "Earlier it was the British who tried to divide and rule. Now it is a group of elites who want to divide Indians.", "Indians won’t fall for such tricks.", "Gujarat is great, Bengal is great…India is united.", "Our cultural foundations are strong, our economic aspirations are high. https://t.co/9mCuqCt7d1", "— Vijay Rupani (@vijayrupanibjp) June 11, 2020", "Guha’s tweet also drew flak from Congress.", "This is an ill informed statement", "From Kutch to Vapi & from Shyamlaji to Dwarka,Gujarat’s culture is built on striking diversity but united through indomitable entrepreneurial spirit", "Every culture has it’s unique greatness,backwardness is our failure to understand this fact https://t.co/IKCLOnf85I", "— Ahmed Patel (@ahmedpatel) June 11, 2020", "Times Now covered the historian’s tweet quoting Philip Spratt, ensuring that it crosses the bounds of social media to national television. As of this writing, Times Now put out at least 45 tweets on the topic while attempting to trend the hashtags #LobbyDividesIndia and #GuhaDividesIndia.", "Historian Ramachandra Guha (@Ram_Guha) insults Gujaratis by tweeting an offensive quote on Gujarat. | #GuhaDividesIndia pic.twitter.com/Ky8Z0vVMnP", "— TIMES NOW (@TimesNow) June 11, 2020", "Two separate claims were raised by those who accused Ram Guha of circulating misinformation —", "1. No such excerpt was penned by Philip Spratt in 1939.", "2. Philip Spratt could not have made a reference to Gujarat in 1939 since the state came into existence only in 1960.", "1. Excerpt from Philip Spratt’s book ‘Gandhism: An Analysis’ published in 1939.", "On page 2 of the book, Spratt wrote, “Gujarat accordingly, though economically advanced, is culturally a backward province.” He further wrote that the Kathiawad region was entirely medieval. On page 32, he compared Bengal with Gujarat and wrote that the former is “economically backward but culturally advanced.” Present-day Gujarat was part of the Bombay Presidency under British colonial rule when the book was released.", "Seeing that the quote even irked politicians holding office, Guha tweeted, “Reserve your praise or your anger for the ghost of the person being quoted.”", "Statutory warning; when I post quotes by others found in the course of my research, I do so because I find them arresting in some way. I may (or may not) endorse, in part or in whole, what I am quoting. Reserve your praise or your anger for the ghost of the person being quoted.", "— Ramachandra Guha (@Ram_Guha) June 11, 2020", "2. Gujarat was referred by its state name before it came into existence in 1960.", "Not only Philip Spratt but Indian revolutionaries have also referred to Gujarat by its state name before 1960. The Indian National Anthem by Rabindranath Tagore was first sung in 1911. It has the word ‘Gujarat’ in the lyrics.", "Mahatama Gandhi had penned a letter in 1948 addressed to the “people of Gujarat”. The letter can be found among the ‘Selected Works of Mahatma Gandhi : Vol – 4’ archived on the website of Gandhi Sevgram Ashram.", "There are many such letters where Gandhi had made references to Gujarat. We found a collection of letters on archive.org, written by Gandhi to Sardar Patel before independence. The letters were collected by Navjivan Publishing House, Ahmedabad.", "The Indian National Congress also had a Gujarat committee which was formed in 1920 and Patel was its first president. The letter below can be found on archive.org.", "An official document (1880) of the Gazetteer of the Bombay Presidency under British rule makes several references to Gujarat. So does the 1911 census report.", "Therefore, Ram Guha, who was accused of promoting misinformation, was ironically targetted with misinformation. Those offended by his tweet either claimed that he has falsely quoted Philip Spratt or directed their anger at him instead of the original author.", "[Update: The reference to the Indian National Anthem was added to the report on June 12, 2020. It was pointed out was Twitter handle @Mediarama2.]", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]