["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As debate continues over the call to remove statues and monuments memorializing the Confederacy and its leaders, an eyebrow-raising claim about the army’s famous commander, Robert E. Lee, is circulating online.", "It says that Lee was \"against slavery\" – even though he commanded the army that fought to uphold the barbaric institution.", "A viral Facebook post displays a painting of the Islamic prophet Muhammad next to an image of the Confederate commander with accompanying text that says:", "\"Muhammad owned many slaves. Robert E. Lee was against slavery. So why are we tearing down statues instead of mosques?\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Yes, the prophet Muhammad owned slaves – but so did Lee.", "Muhammad, who lived more than 1,000 years before Lee, reportedly taught that \"slaves were to be regarded as human beings with dignity and rights and not just as property, and that freeing slaves was a virtuous thing to do.\" That said, Muslims in the 7th century, when Muhammad lived, still deemed slavery as legal.", "According to an article posted by American Civil War Museum on its website, Lee personally owned slaves he inherited upon the death of his mother, Ann Lee in 1829. Then, in 1857, following the death of his father-in-law, Lee assumed command of 189 enslaved people working between two estates. Interestingly, Lee’s father-in-law specified in his will that all the family’s slaves be freed within five years of his death.", "But Sean Kane, then the museum’s interpretation and programs specialist, reported that Lee, as executor of the will, \"drove his new-found labor force hard to lift those estates from debt,\" and concerned it would take longer than five years, \"petitioned state courts to extend his control of enslaved people.\" That didn’t happen, as Lee freed them in accordance with the will in 1862 (and three days before the Emancipation Proclamation went into effect). However, in response to the brutal workload during those last years, many of the slaves attempted to escape.", "\"In 1859 Wesley Norris, his sister Mary, and their cousin, George Parks, escaped to Maryland where they were captured and returned to Arlington,\" the museum said. In a later testimony in 1866, Norris reportedly said they were immediately taken before Lee, whose punishment was ordering them to be tied up to receive 50 lashes each, excluding Norris’ sister, who got 20.", "Regardless of that account, historians continue to argue over Lee’s position on slavery. Some of Lee’s letters and post-war statements paint an ambiguous picture of a man with a lukewarm opposition to it, but his own actions, slave-owning practices and other statements contradict that position.", "One of the most prominent letters that Lee’s defenders point to is one he wrote to his wife on Dec. 27, 1856: \"In this enlightened age, there are few I believe, but what will acknowledge, that slavery as an institution, is a moral & political evil in any Country. It is useless to expatiate on its disadvantages.\"", "But he goes on to say that slavery was \"a greater evil to the white man than to the black race\" and \"while my feelings are strongly enlisted in behalf of the latter, my sympathies are more strong for the former.\" Lee wrote that African Americans were \"immeasurably better off\" in America than in Africa and that the \"painful discipline they are undergoing, is necessary for their instruction as a race...\"", "PolitiFact reached out to Eric Foner, a Civil War historian and Columbia University professor, on the veracity of the claim. Foner referred us to a passage he wrote on Lee’s connection with slavery:", "\"During his lifetime, Lee owned a small number of slaves. He considered himself a paternalistic master but could also impose severe punishments, especially on those who attempted to run away. Lee said almost nothing in public about the institution. His most extended comment, quoted by all biographers, came in a letter to his wife in 1856. Here he described slavery as an evil, but one that had more deleterious effects on whites than blacks. He felt that the ‘painful discipline’ to which they were subjected benefitted blacks by elevating them from barbarism to civilization and introducing them to Christianity. The end of slavery would come in God's good time, but this might take quite a while, since to God a thousand years was just a moment. Meanwhile, the greatest danger to the ‘liberty’ of white southerners was the ‘evil course’ pursued by the abolitionists, who stirred up sectional hatred. In 1860, Lee voted for John C. Breckenridge, the extreme proslavery candidate (a more moderate southerner, John Bell, carried Virginia that year).\"", "\"I would not say that this qualifies Lee as ‘against slavery,’\" Foner added in an email.", "John Reeves, author of \"The Lost Indictment of Robert E. Lee\" wrote a post on some of the most popular myths attributed to the general – the first being Lee’s opposition to slavery.", "Reeves explains that after losing the war, Lee attempted to present himself as always being against slavery. In an interview after his surrender, Reeves says, Lee said that \"the best men of the south\" were eager to do away with it, and in a testimony in 1866 he had \"always been in favor of emancipation — gradual emancipation.\"", "But, as Foner said, Reeves writes that the historical record doesn’t support these statements, as Lee and his family owned and managed slaves for decades and benefited \"tremendously\" from the institution.", "A Facebook post says that the prophet Muhammad owned many slaves while Robert E. Lee was against slavery.", "Both men owned slaves. Meanwhile, Lee, besides serving as commander of the army that fought to uphold slavery, imposed harsh punishments when his slaves disobeyed and said he thought the \"painful discipline\" was necessary for the \"instruction of the race,\" and that the end of slavery would come when God willed it.", "While Lee made some mixed statements on his feelings toward slavery, his actions and political positions contradict that he opposed it. We rate this post False.", "Facebook post, Aug. 19, 2018", "Encyclopedia Virginia, Letter from Robert E. Lee to Mary Randolph Custis Lee (December 27, 1856), Accessed Aug. 26, 2019", "The American Civil War Museum, MYTHS & MISUNDERSTANDINGS | LEE AS A SLAVEHOLDER, Accessed Aug. 26, 2019", "Medium, Five myths about Robert E. Lee, July 24, 2018", "BBC, Slavery in Islam, Sept. 7, 2009", "New York Times, What Robert E. Lee Wrote to The Times About Slavery in 1858, Aug. 18, 2017", "New York Times Jan. 8, 1858 archive, Accessed Aug. 26, 2019", "NBC News, Is Removing Confederate Monuments Like Erasing History?, April 25, 2017", "Al Jazeera, Confederate statue removed in North Carolina city, March 12, 2019", "Smithsonian Magazine, Making Sense of Robert E. Lee, July 2003", "Email interview, Eric Foner historian and DeWitt Clinton Professor Emeritus of History at Columbia University, Aug. 26, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]