["About this rating", "According to a 29 December 2017 story in the New York Times, Silicon Valley is going all-in on \"off-the-grid\" water — marketed as an untainted, healthier alternative to bottled or tap water. There's a growing movement to drink what some people are calling \"raw water,\" and some companies are capitalizing by selling untreated spring water at a considerable markup at health food stores on the West Coast.", "Raw water proponents either buy this water or find their own natural spring water for drinking. The health risks inherent to either form of untreated water — cholera, E. coli, hepatitis, and giardia, just to name a few — have been well covered. Without sterilization procedures, there is no guarantee the water does not contain pathogens, either from the water source or introduced during the collection and bottling process.", "But what about the argument that, despite these health risks, there is some inherent benefit to drinking unpurified water? When intelligible, the rationalizations boil down (not literally, of course) to a collection of health aphorisms with no demonstrable relationship to untreated spring water. As a case study, we will focus on the raw water purveyor Live Water, whose arguments echo those of similar companies.", "Live Water, a company that has undergone a variety of name changes since its founding as \"Fountain of Truth Spring Water\" in 2015, is run by a man who changed his own name to Mukhande Singh from Christopher Sanborn after getting into the raw water business. According to Singh, the primary benefit imparted by his water, which he told the Times \"stays most fresh within one lunar cycle of delivery,\" is beneficial bacteria that would have otherwise been removed during the sterilization process. His company's web site reads:", "Living spring water is the key to unlocking a perfect micro-biome balance. The probiotics listed [in this analysis of our water] are exclusive to our unsterilized water. [...] They are imperative for optimal physical and mental health. Without these probiotics we're not able to fully assimilate all the nutrients in our food. Some beneficial bacteria are also ​proven​ to have abilities to transform harmful bacteria. Here is a published medical report supporting evidence that raw spring water has vast healing abilities.", "The density of scientific errors contained in this statement is considerable. Below, we will pick apart the primary misrepresentations contained within, along with the report that Singh links to:", "The \"Perfect Micro-biome Balance\"", "Singh first alludes to established and well-accepted science on the myriad links between gut microbiome and overall human health, falsely suggesting that because his water contains bacteria (apparently any old bacteria), it too will impart benefits. In fact, there are very specific criteria for what makes a bacterial strain viable as a dietary probiotic. Aside from not causing harm to a human, legitimate probiotics have to be able to survive the environmental conditions of the stomach and to consume material present in the stomach, among many other requirements.", "Even within commonly used probiotic strains like Lactobacillus, the number of species within that single classification which can actually work as a probiotic is low. A 2008 study isolated 567 lactobacilli strains from healthy human fecal samples and screened them for their probiotic potential. Only 36 of those nearly 600 strains made the cut.", "In other words, without knowing what bacteria specifically are present in a “raw water” sample, claims of its probiotic nature are baseless.", "The Bacteria in Raw Water \"Are Imperative for Optimal Physical and Mental Health\"", "Laudably, Singh provides the results of chemical and biological safety testing performed on his water, which includes a readout of the viable strains of bacteria cultured from a sample. Unfortunately, the strains identified (hailed as \"recently discovered probiotics\") are are by no means exclusive to his product nor are they \"imperative for optimal physical and mental health.\"", "The bacterial flora of Live Water belong to two somewhat obscure but closely related genera: Pseudomonas and Acidovorax. Found in soil, they are not known to impart any human health benefits, and are not listed in any studies as potential candidates for human probiotics. One major reason is that they do not consume the carbohydrates that might be found in the human intestinal tract. Instead, they consume dangerous organics such as solvents and dyes.", "Pseudomonas oleovorans, the most common bacterial strain in Live Water, is known primarily for its ability to degrade the triarylmethane dye malachite green. Pseudomonas putida, also found in Live Water, can be helpful as an environmental tool because it can break down the harmful solvent toluene. There is no evidence to support the claim that these play a role in “assimilating nutrients,” because — among many other reasons — toluene and triarylmethane are not nutrients.", "Given that most viable probiotics are harvested from human sources and not from pristine aquifers, it is unlikely that other springs used as raw water sources would provide useful probiotics.", "Some Bacteria “Are Also ​Proven​ to Have Abilities to Transform Harmful Bacteria”", "Singh alleges that certain \"beneficial bacteria\" can \"transform harmful bacteria\" into something benign. As evidence, he links to the Wikipedia page for “Phage therapy” which uses viruses called bacteriophages (not \"beneficial bacteria\") to kill harmful bacteria.", "While some work suggests a potential role for some specific bacteriophages to affect some specific infectious bacteria, its inclusion on the Live Water website is an absolute non-sequitur because Singh provides no evidence that any bacteriophage is in his product.", "Bottom line: It’s not 100% clear what Singh is talking about here, but he appears to have confused bacteria with bacteriophage — an unforced error, given the wholescale irrelevance of phage therapy to his raw spring water.", "“A Published Medical Report Proving Raw Spring Water Has Vast Healing Abilities”", "Finally, Singh links to a single scientific study as evidence to support his claim that raw water has “vast healing abilities.” The linked study speculated that a single mineral spring's ability to heal skin wounds (topically, not by drinking it) might possibly be aided by the bacteria present. (None of the bacteria in that spring was identified in Live Water).", "In other words, the one (preliminary) scientific study Singh actually cites is about the healing properties of soaking in a specific spring in Italy, not about drinking spring water. It is, like many other statements made on Live Water’s website, irrelevant to the issue at hand.", "Ultimately, the probiotic claims of Live Water (and those made by other similar companies) are based on wholesale misreadings of scientific papers and principles that, even if interpreted correctly, would offer no relevance to — let alone proof of — raw water’s probiotic potential.", "Bowles, Nellie.   \"Unfiltered Fervor: The Rush to Get Off the Water Grid.\"\r\n    New York Times.   29 December 2017.", "Bever, Lindsey.   \"‘Raw Water’ Is the Latest Health Craze. Here’s Why Drinking it May Be a Bad Idea.\"\r\n    Washington Post.   4 January 2018.", "Hooper, Lora V., and Gordon, Jeffrey, I.   “Commensal Host-Bacterial Relationships in the Gut.\"\r\n    Science.   11 May 2001.", "McFarland, Lynne V.   “From Yaks to Yogurt: The History, Development, and Current Use of Probiotics.\"\r\n    Clinical Infectious Diseases.   28 April 2015.", "Collins, J.K., et al.   “Selection of Probiotic Strains for Human Applications.\"\r\n    International Dairy Journal.   May 1998.", "Gu, Rui-Xia, et al.   “Probiotic Properties of Lactic Acid Bacteria Isolated from Stool Samples of Longevous People in Regions of Hotan, Xinjiang and Bama, Guangxi, China.\"\r\n    Anaerobe.   December 2008.", "VoyageLA.   \"Meet Mukhande of Fountain Of Truth Spring Water.\"\r\n    12 June 2017.", "Anzai, Y., et al.   “Phylogenetic Affiliation of the Pseudomonads Based on 16S rRNA Sequence.\"\r\n    International Journal of Systematic and Evolutionary Microbiology.   1 July 2000", "Wang, R., et al.   “Draft Genome Sequence of Pseudomonas oleovorans Strain MGY01 Isolated from Deep Sea Water.\"\r\n    Marine Genomics.   17 December 2014", "Gomes, Newton, C.M, et al.   “Effects of the Inoculant Strain Pseudomonas Putida KT2442 (pNF142) and of Naphthalene Contamination on the Soil Bacterial Community.\"\r\n    FEMS Microbiology Ecology.   1 September 2005.", "Duckworth, Donna H. and Gulig, Paul, A.   “Bacteriophages: Potential Treatment for Bacterial Infections.\"\r\n    BioDrugs.   15 August 2012.", "Duckworth, Donna H. and Gulig, Paul, A.   “Non-Pathogenic Microflora of a Spring Water With Regenerative Properties.\"\r\n    Biomedical Reports.   24 August 2015.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]