["The image was published in this Facebook post on August 30, 2020.", "The post’s caption reads: “Protesters against #lockdown #lunacy in Trafalgar Square standing side by side #maskfree REFRESHING ♥️ What a surprise the mainstream media barely touch on it. The people are rising against the ridiculous subjugation that is destroying lives, businesses the economy and creating massive government reliance and death. STAND UP against authoritarianism. In Nazi Germany the removal of freedoms was a stealth approach that ended with the Holocaust. Please remember that. #agenda21 #populationcontrol #vaccinations #billgates”", "The post circulated one day after thousands gathered in London’s Trafalgar Square on August 29 to protest against coronavirus restrictions in England. Here is a report by UK newspaper The Guardian about the mass rally.", "The same image was published in Facebook posts here, here, here, here, here, here, here, here and here with a similar claim. The image was also shared in Spanish and Nepalese posts with a similar claim.", "The claim, however, is false.", "A reverse image search on Google found an identical image published here by Getty Images. The same image also appears here on the AFP photo archive.", "The image shows a crowd in front of St George’s Hall in Liverpool during a winner’s parade for Liverpool FC on May 26, 2005. The club won the UEFA Champions League that same year. Here is a report from The Guardian about the parade.", "Below is a screenshot comparison between the image in the misleading post (L) and the Getty Images photo (R):", "Local newspaper The Liverpool Echo reported here on March 31, 2019 that the image in the misleading posts also circulated in 2019 in false social media posts about a Brexit march.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]