["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Claire McCaskill, D-Mo., is requesting information from the U.S. Department of Homeland Security, the United States Postal Services and the U.S. Department of States regarding a drug she claims is illegally making its way into the country.", "In a press release from Nov. 22, 2017, the senator said, \"Fentanyl is now killing more Americans than heroin or any other opioid, and we should use every tool at our disposal to keep it from entering the United States.\"", "The number of opioid overdose deaths has been getting a lot of attention in recent years, but is fentanyl now the leading cause?", "What is fentanyl?", "According to the Centers for Disease Control and Prevention, fentanyl is a synthetic, or man-made, opioid sold legally as a pharmaceutical drug to treat pain. It is also illegally made and is increasingly used to intensify the effects (or \"high\") of other drugs, such as heroin. Most recent cases of fentanyl-related overdose and death have been linked to illicitly-manufactured fentanyl. Heroin is an opioid synthesized from morphine that can be a white or brown powder, or a black sticky substance. Heroin is an illegal, highly-addictive opioid, typically injected but also smoked and snorted.", "Although fentanyl is similar to heroin, fentanyl is 30 to 50 times more potent, according to the National Institute on Drug Abuse.", "Have overdose deaths increased?", "There was a 21 percent increase nationally in overall overdose deaths from 2016 to 2017.", "The CDC categorizes six types of drugs, with fentanyl part of the \"synthetic opioids excluding methadone.\"", "Fentanyl-related deaths are on the rise. A 2016 study of 10 states over six months detected fentanyl in 56.3 percent of 5,152 synthetic opioid deaths.", "The CDC reported a total of 20,145 overdose deaths, up from 9,445 in 2015, which means the number of overdoses related to synthetic opioids excluding methadone more than doubled between 2016 and 2017.", "Sarah Feldman, the deputy communication director for McCaskill, told us that \"the term ‘synthetic opioids excluding methadone’ is, according to the CDC, exclusively represented by ‘fentanyl and fentanyl analogs.’\"", "But CDC spokeswoman Courtney Lenard said the synthetic opioids category isn’t exclusive to fentanyl. She gave an example as prescription pain reliever tramadol, which isn’t fentanyl-based.", "In other words, fentanyl and fentanyl analogs are a subset of synthetic opioids. \"Fentanyl deaths cannot be separated out,\" Lenard said.", "Our ruling", "Sen. McCaskill said, \"Fentanyl is now killing more Americans than heroin or any other opioid.\"", "The CDC says illegally manufactured fentanyl is primarily responsible for the increase in deaths involving synthetic opioids in 10 states. But fentanyl and fentanyl analogs aren’t the only synthetic opioids claiming lives. There is no breakdown of fentanyl from the larger synthetic category number.", "We rate this claim Half True.", "Press release, \"McCaskill Seeks Details on Preventing Fentanyl and Illicit Opioid Shipments to the U.S.,\" November 22, 2017", "Centers for Disease Prevention and Control, \"Provisional counts of drug overdose deaths, as of 8/6/2017,\" Dec. 11, 2017", "Centers for Disease Prevention and Control, \"Trends in Deaths Involving Heroin and Synthetic Opioids Excluding Methadone, and Law Enforcement Drug Product Reports, by Census Region — United States, 2006–2015,\" September 1, 2017", "Centers for Disease Preventions and Control, \"Synthetic Opioid Data,\" Dec. 11, 2017", "Centers for Disease Preventions and Control, \"Deaths Involving Fentanyl, Fentanyl Analogs, and U-47700 — 10 States, July–December 2016,\" Nov. 3, 2017", "New York Times, \"The First Count of Fentanyl Deaths in 2016:Up 540% in Three Years,\" Sept. 2, 2017", "National Institute on Drug Abuse, \"Fentanyl,\" June 2016", "Email interview with Sarah Feldman, Dec. 5, 2017", "Email interview with Courtney Lenard, Dec. 11, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]