["By Saranac Hale Spencer", "Posted on May 22, 2019", "A photo of a woman protesting Brett Kavanaugh’s nomination to the U.S. Supreme Court has been manipulated to make it look like former Vice President Joe Biden was there and kissed her.", "Joe Biden, who is leading the pack of Democrats seeking the party’s nomination for president, has been trailed by complaints that he gets too handsy with women. A raft of pictures showing some of his interactions has been circulating online for years.", "But he didn’t snuggle up to a woman demonstrating against the confirmation of Brett Kavanaugh to the U.S. Supreme Court in October 2018.", "A still of Biden from a video of him kissing a senator’s daughter in 2015 was added to a 2018 picture of a woman shouting at Sen. Lindsey Graham, who supported Kavanaugh’s nomination.", "The doctored photo may have first circulated as a joke, but has now been shared on Facebook where social media users are commenting on it as if it were real. It’s not.", "The original photo was taken in October 2018 by Benny Johnson, who was listed as “politics reporter at large” by the conservative news site the Daily Caller. Johnson wrote an account of Graham walking from his Senate office building to his car, followed by a group of protestors concerned about the sexual assault allegations leveled against Kavanaugh during the heated run-up to his confirmation vote. Johnson used several pictures to illustrate the scene, one of which shows Graham in the foreground and a female demonstrator yelling in the background — that’s the one that was manipulated to include the old image of Biden.", "The doctored photo showed up as early as Oct. 9, 2018 — four days after the original was posted by the Daily Caller — on a site that produces some over-the-top political commentary. By April, that manipulated version of the picture had been used to illustrate a story about complaints about Biden’s behavior on a site that calls itself News That Matters Today. Now, it’s circulating on Facebook and prompting comments such as, “Will you let him get away with this????”", "Move the slider below to see how the doctored image is different from the original.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Johnson, Benny. “Protesters Chase Graham To His Car Saying They Will Remove Him From Office — Lindsey Responds.” The Daily Caller. 5 Oct 2018.", "Farley, Robert. “Ford Did Not Recant Accusations Against Kavanaugh.” FactCheck.org. 7 Nov 2018.", "Levinson, Alana. “Awesome Little Girl Rejects Biden’s Kiss At Senate Swearing-In.” TalkingPointsMemo.com. 6 Jan 2015.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]