["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Okay, people, let’s chat from the heart for a second.", "Congressional approval ratings nearing single digits and government shutdowns do not make viral rants about lawmakers’ pay any more true.", "If your in-box claims to share shocking truths in ALL-CAPS underlined exclamations!! — take your hand off the mouse button. Do not click Forward. Unless, of course, it’s to your favorite fact-checkers.", "Take this recent example sent by one of you to [email protected]:", "Subject: Obscene Salaries - Pass this on if you believe this is all wrong", "Salary of retired US Presidents .$180,000 FOR LIFE", "Salary of House/Senate....$174,000 FOR LIFE   This  is  stupid", "Salary of Speaker of the House ....$223,500 FOR  LIFE!  This is  really stupid", "Salary of Majority/Minority Leader $193,400 FOR   LIFE        Ditto last  line", "Average Salary of a teacher .. $40,065", "Average Salary of Soldier DEPLOYED IN  AFGHANISTAN .. $38,000 Think about  this.", "Nancy Pelosi will retire as a Congress Person at $174,000 Dollars a year  for LIFE.    She has retired  as SPEAKER at $223,500 a year.", "PLUS she will  receive an additional $193,400 a year as Minority Leader. That's  $803,700 Dollars a  year for LIFE including FREE  medical which is  not available to us ...   the  taxpayers.", "She is  just one of the hundreds of Senators and Congress that float in and  out every year!", "I think we  found where the cuts should be made!", "If you  agree ..... pass it on, I just did.", "In honor of Congress’ second-worst approval rating in Gallup history, let’s keep this simple: Do congressional lawmakers earn their salaries \"FOR LIFE? Would House Minority Leader Nancy Pelosi get \"$803,700 Dollars a year for LIFE including FREE medical\"?", "No. And really, really, really, no.", "We’ll break it down.", "Do congressional lawmakers earn their salaries \"FOR LIFE?", "Let’s turn to the nonpartisan research arm of Congress, the Congressional Research Service, which explains laws so even lawmakers can understand them.", "• Members of Congress earn their $174,000 salaries only during their elected terms. (Nope, not for life.)", "• They’re eligible for congressional pensions only after five years of service. (For a member of the House, that would mean getting elected to office at least three times.)", "Those pensions can’t be tapped until retirement age — and can’t be collected while a lawmaker still gets a federal salary. So John Kerry, for example, can’t collect his congressional pension while he serves as secretary of state, according to Pete Sepp of the National Taxpayers Union.", "• The size of the pension depends on years of service and the average of a lawmaker’s highest three years of salary. The exact formula depends on when they started. Meanwhile, every paycheck, lawmakers contribute to both their pensions and Social Security.", "• Most congressional pensions are nowhere near a lawmaker’s salary. Under a pre-1984 retirement formula, it couldn’t be more than 80 percent of a lawmaker’s final salary, not counting cost-of-living adjustments. Under current rules, lawmakers could theoretically get more than 80 percent of their salary, but most would need to serve more than 66 years to get that.", "Would House Minority Leader Nancy Pelosi get \"$803,700 Dollars a year for LIFE including FREE medical\"?", "The email writer gets a whole host of things wrong here.", "The message claims Pelosi will retire as a member of Congress making $174,000 — and that she’ll earn it annually, for life, on top of her full speaker’s salary of $223,500 and minority leader’s salary of $193,400, for a whopping \"$803,700 Dollars a year for LIFE including FREE medical.\"", "Nope.", "Congressional leaders do get paid more than other lawmakers. The speaker of the House earns $223,500. The House minority leader earns $193,400. That’s more than the $174,000 earned by the rank and file. But those are annual salaries that leaders earn while they hold their titles, not lifetime guarantees that get stacked on top of one another.", "• First, even if her pension did equal all three salaries, they add up to $590,900, not $803,700. (Unless perhaps the writer’s suggesting the \"free medical\" is worth $212,800 a year. Talk about rising health care costs!)", "• Second, that’s not how it works. See above.", "• Third, lawmakers don’t get \"free medical.\" They pay a portion of their health insurance premiums, co-pays and co-insurance and can face a deductible, just like a lot of workers with employer-based health care. In January, their employer-offered health insurance will be a choice of plans offered on Obamacare’s federal exchange.", "Pelosi’s higher salary as House speaker from 2007-11 will boost her pension. But the congresswoman, who’s been in office since 1987, would have to work at least two more decades for her starting pension to match a regular lawmaker’s pay, much less $803,700.", "She’s 73.", "And, oh, by the way, lawmakers haven’t given themselves a pay raise since January 2009.", "We’re not saying they’re earning their keep.", "But perhaps it’ll make you feel slightly better that their salaries this year hit their lowest inflation-adjusted levels since December 1990. And that more than 200 of them were refusing pay while the government was closed.", "Our ruling", "A viral message claims congressional lawmakers earn their salaries \"FOR LIFE,\" which for House Minority Leader Nancy Pelosi would add up to \"$803,700 Dollars a year for LIFE including FREE medical.\"", "Lawmakers don’t earn a salary after their terms end. They may earn pensions based on years of service, but those don’t start until retirement. They don’t get \"free medical.\"", "It might feel good to click Forward. But it wouldn’t make this claim any less Pants on Fire.", "Congressional Research Service, \"Retirement Benefits for Members of Congress,\" Aug. 9, 2013", "Congressional Research Service, \"Salaries of Members of Congress: Recent Actions and Historical Tables,\" Sept. 24, 2013", "Congressional Research Service, \"Legislative, Executive, and Judicial Officials: Process for Adjusting Pay and Current Salaries,\" Feb. 9, 2011", "Congressional Research Service, \"Former Presidents: Federal Pension and Retirement Benefits,\" March 18, 2008", "U.S. House of Representatives, \"What is a Representative?\" accessed Oct. 16, 2013", "Gallup, \"Congress and the Public,\" accessed Oct. 16, 2013", "Gallup Politics, \"Congress' Job Approval Falls to 11% Amid Gov't Shutdown,\" Oct. 7, 2013", "USA Today, \"Members of Congress haven't had a raise in years,\" Aug. 15, 2013", "Bloomberg, \"Obama-Congress Paychecks Safe From Automatic Budget Cuts,\" Feb. 28, 2013", "Washington Post's Post Politics, \"Which lawmakers will refuse their pay during the shutdown?\" Oct. 10, 2013", "National Taxpayers Union, \"Do Members of Congress Pay Social Security Taxes?\" accessed Oct. 17, 2013", "PolitiFact, \"Pro-Democratic group says Rep. Tom Cotton voted to give lawmakers, aides taxpayer-funded health care 'for life,'\" June 28, 2013 (Pants on Fire)", "PolitiFact Rhode Island, \"Email message says members of Congress get a full pension for serving just one term,\" May 29, 2011 (Pants on Fire)", "PolitiFact, \"Sen. Ted Cruz says Obama 'just granted all of Congress an exception' to Obamacare,\"  Aug.14, 2013 (False)", "Interview with Pete Sepp, executive vice president, National Taxpayers Union, Oct. 17, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]