["General Secretary of BJP Delhi Ravinder Gupta shared a photograph of a family sipping tea in a water-logged lane. Gupta attacked Chief Minister Arvind Kejriwal-led Aam Aadmi Party (AAP) government in Delhi by claiming that the picture is from Kirari assembly constituency which Kejriwal has converted into “London”.", "#दिल्ली के मुख्यमंत्री @ArvindKejriwal जी का दिल से धन्यवाद जिन्होंने #किराड़ी विधानसभा को #लंदन बना दिया। यह देखिए किस प्रकार एक पूरा परिवार #लंदन की गली में बैठकर ” गरमा गरम चाय” और बिस्कुट का आनंद ले रहे है🤣#केजरीवाल जी इससे अच्छे दिन मत दिखाना🙏 pic.twitter.com/vz9ZdMbvQe", "— Ravinder Gupta (@guptaravinder71) July 26, 2020", "National Spokesperson of Akali Dal Manjinder Sirsa quote-tweeted Gupta and took a jibe at Kejriwal — “Don’t know about London but he surely converted Delhi into Venice.”", "लंदन तो नहीं पर दिल्ली को वेनिस ज़रूर बना दिया है @ArvindKejriwal जी ने https://t.co/g6G466CThL", "— Manjinder Singh Sirsa (@mssirsa) July 26, 2020", "‘The picture is also doing the rounds on Facebook as Surat, Gujarat.", "A reverse image search led to a tweet by journalist Salil Tripathi on July 27. Tripathi said that this picture is not from Surat but Punjab. He retweeted a tweet by AAP MLA Gurmeet Singh from Barnala district of Punjab.", "On July 18, 2016, Gurmeet Singh had tweeted this picture claiming that a family in Mansa district of Punjab protested against “shoddy sewage work” by the Akali Dal.", "Family in Mansa dist #Punjab protesting against shoddy sewage wrk by #akalis .Ppl r waiting fr 2017 @ArvindKejriwal pic.twitter.com/VUZFNjxuzR", "— Gurmeet Singh Meet Hayer (@meet_hayer) July 18, 2016", "A user shared a news clipping of Punjab Kesari while replying to Singh. The report describes the picture as, “After rain in Mansa, people sitting on a street filled with water, enjoying the rain with a cup of tea.”", "This slideshow requires JavaScript.", "The photo is circulating as Delhi since 2016. On July 20, 2016, a Twitter user had shared the Punjab Kesari clipping when Chairman of RPG Group Harsh Goenka promoted the false claim.", "Pic 1 : @hvgoenka Spreading Lies and Propaganda against Delhi Govt Pic 2 : Truth of Pic 1; From Mansa, Punjab", "RT pic.twitter.com/2EedHQJcfl", "— DaaruBaaz Mehta (@DaaruBaazMehta) July 20, 2016", "A picture from 2016 shot in Punjab is therefore shared as Delhi to target the AAP government for “poor” drainage system.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]