["About this rating", "News organizations reported that a homeless woman was found holding a dead baby in Portland, Oregon in January 2017.", "The photograph attached to the meme shows a homeless man in Washington, D.C. in 2013.", "On 17 January 2017, the Willamette Week reported a heartbreaking story: as the temperature there dipped below freezing, a homeless woman was discovered at a bus stop barefoot, clad in tattered clothes, and holding a dead baby:", "The infant, found Jan. 9, marks the fifth death on Portland's streets during the cold weather this year.", "Four homeless people died of exposure in the first 10 days of 2017. A week after the baby was found, it's still unclear whether he died of exposure hours after being born outdoors or was stillborn.", "This report is true, and was filed by a legitimate news organization. However, a photograph that was quickly attached to the already-shocking story in order to make it into a meme is not related to the incident:", "Embed from Getty Images", "The meme about the woman and her baby also spread the claim that the baby froze to death and did not die from a cause unrelated to the cold, which has been debated. First responders had previously reported that the child was alive when it was found, but the state's medical examiner said that the infant was actually stillborn:", "First responders told colleagues in text messages that the baby was \"conscious and breathing OK, but has been outside this entire time\" and was \"ice cold.\" The child was \"born in a transient camp,\" one message said.", "The baby was taken to the hospital and later pronounced dead. Meanwhile, police said the infant's 34-year-old mother showed signs of mental illness, telling investigators that she became pregnant by \"immaculate conception.\"", "Although two emergency room doctors reportedly told investigators that the baby \"appeared to 'be viable,'\" the state's medical examiner, Dr. Karin Gunson, said the infant was stillborn after performing an autopsy.", "There are many factors to this story, none less tragic than any other — the fact that many people on the streets of Portland, Oregon (as in many parts of the United States) suffer from untreated mental illness; that this 9 January 2017 death was not the first of the year from possible exposure in the local homeless population, nor even the second, but the fifth; or that the mother of the dead baby is now nowhere to be found. However, this particular meme not only oversimplifies the issue, but uses a misleading photograph in order to do so.", "Jaquiss, Nigel.   \"A Baby is Dead After Being Found With His Homeless Mother at a Portland Bus Stop.\"\r\n    Willamette Week.   17 January 2017.", "Ewing, Michelle.   \"Did baby of homeless woman die in freezing cold or was child stillborn? Authorities disagree.\"\r\n    AJC.   17 January 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]