["By Eugene Kiely and Robert Farley", "Posted on March 23, 2017", "There is still no evidence to support President Donald Trump’s tweets accusing President Barack Obama of illegally “tapping my phones in October” during the “very sacred election process.”", "In a March 22 interview with Time magazine’s Michael Scherer, Trump said “new information” from the House intelligence committee chairman proved his tweets about a “Watergate/Nixon”-style scandal were “right.” That’s wrong.", "Trump is referring to a press conference Rep. Devin Nunes held shortly before Trump spoke with Scherer. At his news conference, the Republican chairman of the House intelligence committee said he reviewed “intelligence reports” that show “incidental collection” on some unnamed Trump transition team members in November, December and January. Nunes, a Trump transition team member himself, said he believed the incidental collection of information was legally obtained.", "As of this writing, Trump’s tweets — in which he described Obama as a “bad (or sick) guy!” — are still unsupported on multiple levels, based on Nunes’ account of the intelligence reports he read:", "In his Time magazine interview, Trump said that things he says or tweets frequently “turn out to be right,” citing the wiretapping tweets as an example.", "Trump, March 22: This is a Politico story. “Members of the Donald Trump Transition team possibly including Trump himself were under [inadvertent] surveillance during the Obama administration following November’s election.” House intelligence chairman Devin Nunes told reporters, wow. Nunes said, so that means I’m right, Nunes said the surveillance appears to have been … incidental collection, that does not appear to have been related to concerns over Russia.", "Scherer: But so incidental collection would not be wiretapping of you, it would be wiretapping of …", "Trump: Who know what it is? You know, why, because somebody says incidental. Nunes is going to the White House.", "Scherer: Nunes has also said that he has no evidence that your tweet was right, previously.", "Trump: Well, he just got this information. This was new information. That was just got. Members, of, let’s see, were under surveillance during the Obama Administration following November’s election. Wow. This just came out. So, ah, just came out.", "When he read part of the Politico story, Trump left out the word “inadvertent” — which we inserted above. Trump also downplayed the article’s use of Nunes’ term “incidental collection,” suggesting that it is labeled as such because “somebody says incidental.” But this inadvertent collection of intercepted communications is important context when assessing Trump’s wiretapping claim.", "Incidental collection occurs when a targeted foreign person happens to communicate with an American or an American is mentioned in intercepted communications.", "“We may incidentally acquire the communications of Americans even though we are not targeting them, for example if they talk to non-U.S. persons outside of the United States who are properly targeted for foreign intelligence collection,” Robert S. Litt, then-general counsel for the Office of the Director of National Intelligence, said in a 2013 speech. “Some of these communications may be pertinent; some may not be.”", "Nunes raises an important issue about how the intelligence community protects the identities of Americans who are inadvertently picked up during the legal surveillance of non-U.S. persons.", "During the March 20 House intelligence committee hearing, FBI Director James Comey stressed the importance of protecting the identity and privacy of “U.S. persons” caught up in surveillance operations. He said the intelligence agency conducting the surveillance refers to them in its reports as “U.S. person number one” or “U.S. person number two,” and they are only “unmasked,” or identified, if other intelligence agencies believe the name may be relevant to their investigation. It is also possible that the identity of a person may be known to some from the context of the intercepted communication, even if the name remains undisclosed.", "Michael Flynn, Trump’s former national security advisor, is an example of a Trump transition team member caught up in the surveillance of a foreign agent. Flynn was overheard in late December, before Trump took office, discussing U.S. sanctions against Russia in phone calls with that country’s ambassador to the United States. That information was leaked to the media in February, and Flynn was forced to resign because until then he had publicly insisted he did not discuss the sanctions with Russia.", "The Trump administration has long complained about leaks to the media, and, more recently, it has taken issue with the “unmasking” of U.S. persons caught up in the surveillance of foreign targets. It may have a point about those things. But that does not mean the president’s tweets about Obama are at all accurate. There is no proof of that.", "The illegal wiretapping claim wasn’t all that Trump got wrong in the Time interview.", "Trump doubled down on his unfounded accusation that Rafael Cruz, the father of Sen. Ted Cruz, was with Lee Harvey Oswald just prior to the assassination of President John F. Kennedy. Trump told Time that his baseless claim about Cruz was something he read “in the newspaper.” The newspaper in question is the tabloid National Enquirer. And while Trump told Time the paper “had a picture of Ted Cruz, his father, and Lee Harvey Oswald, having breakfast,” it did not. For more info on this absurd claim, see our story, “Trump’s Tall Tabloid Tale,” and “Trump Defends Oswald Claim.”", "Asked about his unsubstantiated claim that “thousands and thousands” of people in New Jersey celebrated on Sept. 11, 2001, when the World Trade Center was attacked, Trump falsely said, “Well if you look at the reporter, he wrote the story in the Washington Post.” That is not what the reporters wrote. And the reporters never backtracked on that, despite Trump’s many claims to the contrary.", "Trump also stuck to his baseless claim that millions of people voted illegally for Democratic presidential nominee Hillary Clinton in the 2016 presidential election. “Well I think I will be proved right about that too,” Trump told Time.", "“Well now if you take a look at the votes, when I say that, I mean mostly they register wrong, in other words, for the votes, they register incorrectly, and/or illegally. And they then vote. You have tremendous numbers of people. In fact I’m forming a committee on it,” the president said.", "As we have reported, repeatedly, a 2012 study by the Pew Charitable Trusts found that “more than 1.8 million deceased individuals are listed as voters” and that “approximately 2.75 million people have registrations in more than one state.” But there is no evidence that millions voted illegally, as Trump claims.", "The president describes himself in the Time interview as a soothsayer. He may believe he has an uncanny ability to predict the future, but we have seen no evidence to support his unsubstantiated claims about alleged past events that involve illegal campaign wiretapping, Cruz’s connection to JFK’s assassination, massive 9/11 celebrations and widespread voter fraud.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]