["By Brooks Jackson", "Posted on September 21, 2016", "Old talking points die hard. Mike Pence is still claiming that the number of people living in poverty has gone up by 7 million under President Obama, nearly a week after the news came out that 3.5 million escaped poverty last year alone.", "At a campaign event in Dubuque, Iowa, on Sept. 19, the GOP vice presidential nominee said:", "Mike Pence, Sept. 19: We have the lowest labor participation rate since the 1970s, when I got out of high school. And, most shockingly of all, today there are more than 7 million Americans more living in poverty than the day that Barack Obama became president of the United States.", "Pence has been using that 7 million figure for some time. He sent it out via Twitter on Sept. 8, getting his words a bit garbled.", "There are more than 7 million Americans living in poverty today than when @BarackObama took office", "— Mike Pence (@mike_pence) September 8, 2016", "Technically, Pence’s claim wasn’t true even then. He was referring to the poverty level in 2014, not “today.” There’s a big difference. We won’t know what the 2016 figure is until it’s released in September 2017.", "But there’s no excuse for continuing to use his outdated talking point nearly a week after the Sept. 13 release of new poverty figures covering 2015, showing the largest one-year drop in the official poverty rate in 16 years.", "As shown in the U.S. Census Bureau’s historical tables, the number living in poverty last year was 43,123,000, or 13.5 percent of the entire U.S. population. Compared with the number in poverty in 2008, the difference is 3,294,000 — less than half the 7 million figure Pence incorrectly claims. And the poverty rate plunged 1.2 percentage points from 2014 to 2015, the biggest drop since 1999.", "Also worth noting is that the U.S. population grew by more than 17 million between 2008 and last year. As of last year, the poverty rate was a mere 0.3 percentage points higher than it was in 2008.", "As for the labor force participation rate — the percentage of the population age 16 and older that is working or looking for work — Pence was correct to say that it recently has been at the lowest levels since the 1970s, when large numbers of women were flooding into the workforce.", "What Pence failed to acknowledge was that the rate peaked in 2000, and has gone down mostly because of predictable demographic factors, including the postwar baby-boom generation reaching retirement age.", "Pence also failed to mention that lately the labor force participation rate has been going up, not down. In August the rate was 62.8 percent of the population age 16 and older, up from 62.4 percent 11 months earlier. But why spoil a dramatic-sounding talking point by getting into the facts?", "https://www.sharethefacts.co/share/c911b821-b2d0-40f9-aece-d8128889db13", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]