["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. J.B. Pritzker | Ashlee Rezin/Sun-Times", "Illinois kicked off February with one of the lowest COVID-19 vaccination rates in the country, fueling frustration among many over the program’s sluggish start.", "Nearly three weeks later, Democratic Gov. J.B. Pritzker said the state was making progress thanks to increased supply from the federal government and the efforts of local health departments:", "\"As a result, for the month of February, Illinois has been the vaccination leader among the 10 most populous states in the country,\" Pritzker said in a prerecorded video address, which aired Feb. 17.", "Has Illinois come as far on vaccinations this month as the governor claimed? We found Pritzker's statement was supported by one metric measured over a few days, but glossed over an otherwise spotty vaccination record.", "There are many yardsticks to measure states’ progress getting their residents vaccinated against COVID-19. Illinois performs well on some metrics this month but still ranks low on others.", "Illinois started off the month 43rd in the nation for total doses administered when adjusted for population, according to Our World in Data, a University of Oxford-based project that has been tracking vaccine statistics from the U.S. Centers for Disease Control and Prevention. By the time Pritzker’s address aired, the state had improved to 34th nationally — and sixth place when only the 10 most populous states are considered.", "The state is also performing better on a different metric: the share of residents that have received at least one dose of the vaccine. By Feb. 17, Illinois had taken a narrow lead over the other nine most populous states, and it has occupied first, second or third place in that group each day since.", "That measurement goes hand in hand with another, though: the share of people fully vaccinated. There, Illinois ranked last among the 10 largest states — and has continued to rank at or near the bottom nationally each day. Experts say it’s tricky to compare states on this measure, however, due to differences in state policies on how much vaccine to earmark for second doses.", "Given these mixed results, we reached out to the governor’s office to find out what Pritzker was referencing when he said Illinois was the \"vaccination leader\" this month among large states.", "Pritzker spokeswoman Jordan Abudayyeh said that, per capita, Illinois leads the most populous states in vaccinations administered in February — and has done so \"for the vast majority\" of the month.", "Experts said it is fair to compare states based on the total doses administered and adjusted for population. They were split, however, on whether it makes sense to focus on a few weeks in February.", "Hemi Tewarson, a senior fellow at the Duke-Margolis Center for Health Policy, said the February snapshot might be helpful to show recent improvement after a sluggish start because of issues outside state control, such as delays with the federal pharmacy partnership program created to vaccinate those in nursing homes.", "\"If they started out slow back in December or early January, it's hard to catch up,\" she said.", "Amesh Adalja, a senior scholar at the Johns Hopkins Center for Health Security, said that while month-to-month data is important for gauging a state’s progress internally, it’s not as useful for making comparisons because it doesn’t provide a full picture of a state’s vaccine rollout.", "Regardless, by Pritzker’s metric Illinois’ lead among large states on total doses administered per capita in February amounted to just a few days out of the month, based on our analysis of CDC figures catalogued by Our World in Data.", "To support Pritzker’s claim, Abudayyeh sent us a screenshot of a spreadsheet containing figures she said the governor’s office had taken from the CDC’s COVID-19 vaccination tracker. The spreadsheet compares how many doses were administered from Jan. 31 through Feb. 11 per 100,000 residents in the 10 most populous states.", "Those numbers could not be directly verified because the CDC’s tracker only makes available a current cumulative total on each day.", "So to check the governor’s figures we turned to Our World in Data again, which makes previous days’ CDC tallies available for users to download. Those numbers matched the governor’s analysis.", "Day to day, however, Illinois claimed first place three times out of the first 11 days of the month, hardly the \"vast majority\" of February as Pritzker’s spokeswoman claimed. The state’s lead was narrow, and by the time the governor’s address aired, Illinois had fallen back to second place behind Florida.", "So Priztker’s claim was accurate as of Feb. 12, the last day of his office’s analysis. It was not accurate when his speech first aired five days later.", "Pritzker said that \"for the month of February, Illinois has been the vaccination leader among the 10 most populous states in the country.\"", "There are many different ways to measure how states compare when it comes to vaccinating residents against COVID-19. On some, Illinois ranks high and on others it ranks low. Pritzker’s office pointed to one very specific metric: total doses administered per capita during the month of February alone.", "The key issue with Pritzker’s claim is that Illinois only took the lead on that metric for a handful of days prior to the governor’s prerecorded address — and had already fallen back to second place by the time it aired.", "We rate this claim Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "\"COVID-19 vaccine in Illinois: Complaints of slow rollout, confusing process, unequal distribution of doses,\" WGN-TV, Feb. 1, 2021", "Video: Gov. Pritzker’s State of the State and Budget Address, aired Feb. 17, 2021", "State-by-state data on COVID-19 vaccinations, Our World in Data, accessed Feb. 23, 2021", "Emails: Jordan Abudayyeh, Pritzker spokesperson, Feb. 18, 2021", "Phone interview: Hemi Tewarson, senior policy fellow at the Duke-Margolis Center for Health Policy, Feb. 19, 2021", "Phone interview and emails: Amesh Adalja, senior scholar at the Johns Hopkins University Center for Health Security, Feb. 18, 2021", "COVID-19 vaccination data tracker, U.S. Centers for Disease Control and Prevention", "Annual estimates of resident population, U.S. Census Bureau, July 1, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]