["By Robert Farley", "Posted on August 31, 2020", "President Donald Trump retweeted a video, which had been posted under the misleading heading “Black Lives Matter/Antifa,” of a Black man shoving a white woman into a stopped subway car. The incident occurred on Oct. 23, 2019, and there is no indication that the man in the video was affiliated with, or motivated by, either Black Lives Matter or antifa.", "It is the second time Trump has retweeted video of this incident.", "Back in June, Trump retweeted a post of the video that included the comment, “Where are the protests for this?” Trump added his own comment, “So terrible!”", "The video shows a man violently pushing an unsuspecting woman into a stopped subway car in Brooklyn on Oct. 23, 2019. Police arrested a 28-year-old man and charged him with felony assault. Police say the man had a history of offenses on the subway, such as pulling the emergency brakes on trains, exposing himself to passengers, once attempting to push a woman onto the tracks, “surfing” on the outside of trains and causing hundreds of train delays. An aunt told the New York Post that he has “some mental issues going on.”", "The video retweeted by Trump on Aug. 30 — which bore the heading “Black Lives Matter/Antifa” — was posted by @TDN_NOTICIAS, a Spanish-language account that posts a lot of pro-Trump messages. The tweet notes that the video came from the Twitter account “I’m With Groyper.” So-called “Groypers” are “a loose network of alt right figures who are vocal supporters of white supremacist and ‘America First’ podcaster Nick Fuentes,” as defined by the Anti-Defamation League.", "The author of the “I’m with Groyper” account tweeted a clarification on Aug. 31, saying, “Unlike what the tweet shared by @realDonaldTrump implied, I did not say the black guy was antifa or BLM. Maybe he was radicalized by them, maybe not. But the attack was not made in the context of a BLM protest/riot.” The author also said they had mistakenly suggested the man was a “migrant.” Twitter shows the “I’m with Groyper” account has since been suspended.", "We could find no evidence that the man involved in the subway attack was affiliated with, or motivated by, Black Lives Matter or antifa. The incident in the video occurred nearly seven months before the mass protests that followed the death of George Floyd, a Black man who died when a white police officer knelt on his neck in Minneapolis on May 25.", "Trump has repeatedly blamed Black Lives Matter and antifa, an umbrella term for far-left militant anti-fascism groups, for fomenting rioting and looting during these protests. In late May, however, state and local officials blamed different groups, or said they didn’t know who was behind the violence that erupted amid mostly peaceful protests. Trump has stepped up such attacks in the days following  the police shooting of Jacob Blake in Kenosha, Wisconsin, on Aug. 23. That incident sparked a new wave of chaotic and at times violent protests.", "The Trump campaign declined to comment about the tweet.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]