["The photos were published in this Facebook post on January 4, 2020.", "Below is a screenshot of the misleading post:", "The post’s Hindi-language caption translates to English as: “You don't fear, that's a good thing, even home minister Amit Shah said you shouldn't have any fear. But tell me first, who is the doctor who has applied bandaged over the jacket and headscarf. There is a limit to lying.”", "The protesters in the photos can be seen wearing bandages over clothing, and holding placards in romanized Hindi-language that translate to English as: “We won’t be feared, we will fight. No NRC, No CAA.”", "NRC is an acronym for the National Register of Citizens, a government record of all Indian citizens in India’s northeastern state of Assam. The register came under scrutiny after its most recent release in August 2019 was found to have omitted some two million people - mostly Muslims - effectively stripping them of Indian citizenship, as reported by AFP here on September 2, 2019.", "CAA is an acronym for the Citizenship Amendment Act, a new law passed by the Indian government on December 11, 2019. The law, which grants citizenship to non-Muslim immigrants from Afghanistan, Bangladesh, and Pakistan, sparked violent protests nationwide, as reported by AFP here on December 12, 2019.", "The same photos were also shared in posts here, here and here on Facebook, and here, here and here on Twitter, alongside a similar claim.", "The photos have been shared in a misleading context; they show protesters rallying in solidarity with with a Jamia Millia Islamia University student who lost an eye during an earlier anti-citizenship law protest in Delhi.", "The first image in the misleading posts carries a “Zafar Abbas” watermark on the bottom left corner. AFP found a Delhi-based journalist with the same name, who shared it on his Twitter account here on December 29, 2019.", "Jamia today ! pic.twitter.com/qQp1IXLkCA", "During a phone conversation with AFP on January 9, 2020, Abbas said he took the photos during an anti-citizenship law protest in Jamia Nagar area of Delhi, India, on December 29, 2019.", "“I clicked these pictures when the students and local residents decided to protest in a unique way by tying a bandage around one eye in solidarity with Minhajuddin, a student who lost an eye in Delhi police crackdown,” he said.", "Mohammed Minhajuddin is a student of Delhi’s Jamia Millia Islamia University who allegedly sustained permanent eye damage when police clashed with protesters during an anti-citizenship law protest on campus on December 15, 2019, according to reports by Indian news outlet News18 here and English-language newspaper Hindustan Times here.", "Abbas also shared a video from the solidarity protest on his Twitter account here on the same day.", "With an Eye bandaged : Jamia students put bandages on one eye in solidarity with Jamia student Minhajuddin who lost an eye in the police crackdown in #JamiaMilliaIslamia https://t.co/OABE2TIOvE", "The December 29 protest was also reported by local Indian media, including here by national broadcaster NDTV, here by English-language newspaper Millennium Post and here by English-language news magazine Outlook India.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]