["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Actor Matt Damon talked with World Bank president Jim Yong Kim about making water affordable for the poor. (World Bank)", "Hollywood star Matt Damon has been a champion of bringing clean water and sanitation to the world’s poor for many years, co-founding the group Water.org. The organization links families to microloans so they can tap into safe water supplies.", "In a conversation with the president of the World Bank, Damon tried to convey a sense of the severity of the problem.", "\"The poor often pay more for water than the middle class,\" Damon said. \"These people have no savings,  but they’re paying every day, in some cases, up to 25 percent of their income just for water.\"", "People who live in poverty always spend most if not every penny of what little they earn on basic necessities. That is part of the crushing reality of being poor. But we wanted to know about the fraction of their income that goes toward water.", "The poor often pay more for #water than the middle class. They have no savings, but spend up to 25% of income for water. —Matt Damon @water pic.twitter.com/Ar98ZUOH6X", "Rosemary Gudelj, spokeswoman for Water.org, told us the statistic was based somewhat on anecdotal evidence. Gudelj said Damon drew on the work of the group’s co-founder Gary White.", "\"Gary’s statement has been, ‘I have met people who pay up to 25 percent of their income on water,’ \" Gudelj said. \"This comes from Gary’s experience in Tegucigalpa, Honduras, when doing research for his master’s thesis.\"", "That might not seem like much to hang a claim on, but we did find a 2006 United Nations Development Program estimate that confirmed Damon’s point.", "\"In Uganda water payments represent as much as 22 percent of the average income of urban households in the poorest 20 percent of the income distribution,\" the report said.", "The report went on to say that in countries such as Argentina, El Salvador and Jamaica, the bottom fifth of households were spending over 10 percent of their money on water.", "The core problem, the report said, is the poorest families often pay the highest prices for water because they aren’t connected to the pipes that provide service to middle class and wealthy homes:", "\"In Jakarta, Lima, Manila and Nairobi households living in slums and low-­income settlements typically pay 5–10 times or more for their water than high-income residents of the same city. In Manila an estimated 4 million people receive water resold through kiosks, pushcart vendors or tanker deliveries.\"", "Each of those middlemen take their cut, and the cost of water rises accordingly.", "Now, that United Nations report is a decade old and progress has been made since.", "But Damon avoided hard numbers and the risk that some would be outdated. Taken at face value, he only said that some people pay as much as 25 percent of their income on water.", "To know the reality, the gold standard would be household spending surveys from a range of countries. But it looks like current ones for water expenditures don’t exist.", "A report from the advocacy group WaterAid used a baseline assumption that someone was buying the 50 liters/day minimum for drinking water and and sanitation set by the World Health Organization in compiling hypothetical water bills for many countries.", "But Michael Hanemann, an economist who specializes in water at the University of California Berkeley, said that’s a dicey set of calculations.", "\"In economics it is the case that when something is expensive, people buy less of it,\" he told PolitiFact. \"It is more likely that they are getting by with less water.\"", "Or as likely, they are using unclean water, and paying the price with illness and bad health.", "By the way, the average water and sewer bill in the United States is about 0.5 percent of household income, according to the Environmental Protection Agency.", "Our ruling", "Damon said that poor people sometimes pay as much as 25 percent of their income for water. A decade-old United Nations report said that the urban poor in Uganda were paying very nearly that much, about 22 percent of their wages. Damon’s co-founder of Water.org has seen people spending this much in his work in Honduras.", "More recent hard data appears to be in short supply. But it wouldn’t take much for Damon’s claim to be accurate. Given that poor people pay an inordinate share of whatever money they have for basic needs, and they tend to live in places where water costs more, some people probably do spend as much as Damon said.", "The facts we have are enough for us to rate this claim Mostly True.", "World Bank, tweet, April 20, 2017", "United Nations Development Program, Beyond scarcity: Power, poverty and the global water crisis, 2006", "World Bank, Toward Water and Sanitation for All, April 20, 2017", "WaterAid, Water: At What Cost? The State of the World's Water 2016, March 22, 2016", "Euro-Mediterranean Information System, Is drinking water affordable?, Aug. 9, 2011", "Email interview, Rosemary Gudelj, spokeswoman, Water.org, April 25, 2017", "Email interview, Carolynne Wheeler, news manager, WaterAid, April 26, 2017", "Interview, Michael Hanemann, professor of economics, University of California Berkeley, April 27, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]