["The 41-second video was shared on the messaging app Line on June 26, 2020.", "Below is a screenshot of the Line message:", "The Thai-language message translates to English as: “The route downhill from Pak Thong Chai District No. 304 from Sattaheep to Korat, they are probably dead. Poor them.”", "Pak Thong Chai is a district in the south of Nakhon Ratchasima province -- locally known as Korat -- in northeastern Thailand.", "The video also features the logo of Ruptly, the Berlin-based video branch of Russia’s state-owned RT television network.", "The video was also shared here, here, here, here on Facebook alongside a similar claim.", "The claim, however, is false.", "A combined reverse image and keyword search found the same video published here on Ruptly’s official YouTube account, headlined: “*DISTRESSING CONTENT* Russia: Fatal truck crash caught on CCTV in Chelyabinsk”.", "Chelyabinsk is a city in west Russia.", "Below is a screenshot comparison between the video in the misleading post (L)and the Ruptly video (R):", "The video description reads: “Two people were killed and seven injured after a truck ran into five vehicles on the M-5 highway.”", "The video was also published in this June 17, 2020 article by the Turkish television channel TGRT Haber, headlined: “Truck crushed 4 vehicles like paper: 2 dead, 7 injured”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]