["About this rating", "On 23 May 2016, the website news.groopspeak published an article with an outraged headline (\"BREAKING: Trump Wants Congress To Declare War – Against ‘People In The U.S.’\").  According to the article, presidential candidate Donald Trump announced that he wanted to authorize war against potential terrorists within the borders of the United States:", "This is a war against people who are vicious, violent people that we have no idea who they are, where they come from. We are allowing tens of thousands of them into our country now so on top of wars on foreign land wait ’til you see what happens in the future…It’s probably not going to be pretty. I hope I’m wrong about that, but it’s probably not going to be pretty. It’s not speculation. We’re allowing people into our country. We don’t know who they are, where they come from.", "The story was rewritten from a Politico article published earlier that day. The original piece had reported that Trump discussed formally declaring war on terrorism:", "President Donald Trump would have no problem asking Congress for a declaration of war to fight terrorism, the presumptive Republican presidential nominee told Fox News host Bill O’Reilly in an interview that will air Monday evening.", "Fox News transcribed most of its broadcast content for publication on its web site, and Trump's O'Reilly Factor appearance transcript was readily available by 24 May 2016.  Trump commented about declaring war or military action at the start of the clip, after O'Reilly asked whether Trump believed the recent crash of an Egyptian airliner was related to terrorism:", "DONALD TRUMP (R), PRESIDENTIAL CANDIDATE: I do [think the crash was likely terrorism]. In a certain way. I mean, I don't know what they used but something bad happened and we'll see. I guess they will eventually find out but I certainly do. I know that plane very well. I know that type of aircraft. And you have thousands and thousands flying millions of miles and never been anything like it. So I do and I think most people do.", "O'REILLY: Okay. Now, would you support asking Congress for a declaration of war? To fight terrorism and then under that declaration it would be the groups that would be -- that the United States would declare war on, ISIS, al Qaeda, Taliban. Would you favor that because if your president, a declaration of war gives you more power to defeat these people?", "TRUMP: It wouldn't bother me at all doing that. We probably should have done that in the first place. Look, we are at war with these people and they don't wear uniforms. It's not your traditional war where it's a war against Germany, Japan, or whoever. This is a war against people that are vicious, violent people, that we have no idea who they are, where they come from. We are allowing tens of thousands of them into our country now. So on top of wars on foreign land, wait until you see what happens in the future. It's probably not going to be pretty. I hope I'm wrong about that but it's probably not going to be pretty.", "O'REILLY: All right. But it's speculation.", "TRUMP: And we're allowing, Bill, we're allowing, well, that's not speculation. We are allowing people into our country we don't know who they are, where they come from. Some of them happen to have cellphones with the ISIS flag on them. So, I think it's something that we have to be very tough and very vigilant and very smart or we will be in big trouble.", "O'REILLY: Okay. You've done very well with your national security policy. But I want to get you \"ON THE RECORD.\" Would you ask Congress to pass a declaration of war if you are elected?", "TRUMP: I would have no problem with doing it, Bill.", "O'REILLY: Okay. But that doesn't mean you would do it but I will take that.", "TRUMP: No. I will study the facts.", "O'REILLY: Okay.", "Although it is possible to extrapolate from Trump's comments that such a declaration of war might affect people within U.S. borders or U.S. citizens, it's  a leap to state Trump said any such thing either proactively or definitively. Trump was ambiguous in answering O'Reilly's questions about counterterrorism, and it did seem that he believes terror cells exist or operate inside the United States and that future attacks were possible or likely, but at no point did he specifically suggest that he would declare war on Americans or on U.S. soil.", "McCaskill, Nolan D.   \"Trump: I May Ask Congress To Formally Declare War To Fight Terror.\"\r\nPolitico.   23 May 2016.", "news.groopspeak.   \"BREAKING: Trump Wants Congress To Declare War – Against 'People In The U.S.'\"\r\npublication date   23 May 2016.", "FoxNews.com.   \"Donald Trump's Plan To Fight Terrorism [Transcript].\"\r\n24 May 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]