["About this rating", "Photographs purportedly showing a vendor displaying Nazi flags and homophobic stickers along with pro-Trump merchandise at a recent Pennsylvania rally for President Trump started making their way around social media in October 2018:", "These images were often shared with the caption \"Found at a Trump rally in Pennsylvania. They aren't even hiding it anymore. They're proud of their racism and homophobia.\"", "These pictures are genuine, but they were not recent in October 2018, nor were they taken at a rally for President Trump that month. The photographs were snapped more than two years earlier (before the election of Donald Trump) at the Bloomsburg Fair in Bloomsburg, Pennsylvania, in September 2016.", "The photograph showing the Nazi flag appears to have been taken by Pennsylvania resident Chloe Winters, who originally posted it on social media with a message stating that she was \"shocked and appalled\" that a swastika flag was on display at the fair:", "I was absolutely shocked and appalled. This flag represents the brutal and horrific genocide of innocent people. It stands for the hatred and destruction of a religion I feel blessed to be a part of.", "Bloomsburg Fair officials removed the offensive flag shortly after these photographs went viral on social media:", "Bloomsburg Fair President Paul Reichart has issued a statement in reference to earlier posts on our Facebook wall regarding the questionable flag that a vendor was displaying at the fairgrounds:", "\"We were initially unaware of the flag and other merchandise being displayed by a vendor on our fairgrounds. Most posts were made after midnight, and as soon as we were made aware of it early this morning, we took the appropriate action with the vendor to remove those items. Unfortunately, we have over 1200 vendors on our fairgrounds and it’s difficult to monitor each one individually. Whenever someone brings something like this to our attention, we always discuss it with the vendor and take any steps to maintain a family-fun atmosphere at our fair.\"", "Officials also found that the vendor, Lawrence Betsinger, was selling stickers and other memorabilia inappropriate for the fair. Betsinger was asked to leave after it was revealed that he was also a registered sex offender:", "A picture posted on social media showed a vendor at the Bloomsburg Fair displaying a huge Nazi flag. It created a firestorm of controversy that the fair took care of on Monday.", "The Bloomsburg Fair president made the decision to kick out that vendor, Lawrence Betsinger, after fair officials found out he is a registered sex offender.", "Howells, Rich.   \"Photo of Bloomsburg Fair Vendor with Nazi Flag Hung Next to Trump Flag Goes Viral.\"\r\n    NEPA Scene.   26 September 2016.", "Krize, Nikki.   \"Photo Showing Nazi Flag at Bloomsburg Fair Sparks Controversy.\"\r\n    WNEP.   26 September 2016.", "Fiorillo, Victor.   \"Nazi Flags Were for Sale at the Bloomsburg Fair This Weekend.\"\r\n    Philly Magazine.   26 September 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]