["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As Donald Trump speechified his way through Iowa auditoriums and gyms to his No. 2 finish in the Republican caucuses, he made a lot of claims in a lot of places.", "Many of those reinforced a central theme: Professional politicians are failing and President Trump’s business and personal savvy would be the antidote.", "His claim that the United States outspends other countries on K-12 education by a \"factor of four\" was part of that narrative. And it caught our attention.", "\"We spend more money than anyone else any other country in the world by a lot,\" he went on to say. \"And yet we're number 28 on the list … So we're 28 in terms of quality. So that means we have 27 countries ahead of us, and yet in terms of cost we're No. 1 by far.\"", "Spending that out-of-proportion to results would throw serious doubt on proposals to boost education budgets, so we decided to check it out.", "Breaking it down", "We reached out to Trump’s campaign, but they didn't respond.", "We consulted data collected by the Organization for Economic Cooperation and Development — an international organization of 34 developed countries — and by the United Nations.", "Researchers and policymakers from groups across the political spectrum told us they put the most stock in OECD data, which includes spending from both government and private sources.", "Based on 2012 data, the OECD shows that the United States has generous education budgets, spending about 50 percent more than the average OECD country.", "But relative to the nation’s overall wealth, the United States was at the middle of the pack. Relative to the size of the economy or overall government spending, U.S. levels were within 1 percent of the OECD average.", "Additionally, the United States was not the top spender. Luxembourg, Switzerland and Norway each spent more per pupil than the United States. In the case of Luxembourg, about 66 percent more per secondary school student.", "And similar UN data puts the United States eighth among all countries, behind several other developed countries and Macau, a semi-autonomous city inside China.", "We looked at a variety of other ways to crunch the numbers, but the United States never rose above No. 4. (see table) That was true even if figures were adjusted for purchasing power, the difference in what $1 buys from country to country.", "In fact, the United States would have to increase per student spending about $8,000 per year just to match Luxembourg at the high school level. To spend quadruple what Luxembourgers do would require a $70,000 per student boost.", "U.S. ranking in spending", "Rank", "Amount", "Above average by", "Below #1 by", "Below four times #1 by", "Per student per year (including college)", "4", "$15,494", "51%", "$7,051", "$74,685", "Per student primary school", "4", "$11,030", "30%", "$8,990", "$69,050", "Per student secondary school", "5", "$12,442", "33%", "$8,175", "$70,026", "As percent of GDP", "15", "4.8%", "—", "2.9%", "26%", "As percent of government spending", "14", "11.6%", "—", "6.8%", "62%", "Source: OECD", "Educational achievement", "So what about us scoring \"No. 28\" among countries in education? There is ample evidence suggesting that U.S. educational performance is sub-par.", "For instance, the OECD rated the U.S. 23rd out of the 25 countries for the percent of current students going on to pursue higher education.", "U.S. students were also 30th in math proficiency worldwide according to an OECD test. Meanwhile  U.S. students were about average among developed countries for reading science.", "Or as Jason Bedrick, a policy analyst for the libertarian Cato Institute, put it:", "\"The U.S. definitely spends more than most other industrialized nations and has less to show for it.\"", "Our rating", "Trump said the United States spends more on education per pupil by a factor of four and gets poor results.", "There is good evidence to support his overall idea, that the United States gets less bang for its education buck than other developed countries. But Trump overstated U.S. spending by 500 percent. We’re not No. 1 in spending, by several different ways of measuring. His comments suggest the country won the gold medal in spending when it’s actually just shy of a bronze.", "We rate his statement Mostly False.", "E-mail interview Jason Bedrick, Policy Analyst, Center for Educational Freedom, Cato Institute, Jan. 29, 2016", "Government Accountability Office, \"Trends in U.S. Education Spending,\" Sept. 15, 1995", "National Center for Education Statistics, First Look: Revenues and Expenditures for Public Elementary and Secondary Education: School Year 2012-13 (Fiscal Year 2013), Jan. 27, 2016", "National Center for Education Statistics, The Condition of Education 2015, May 28, 2015", "National Center for Education Statistics, \"Fast Facts: International comparison of achievement,\" retrieved Feb. 8, 2016", "Organization for Economic Cooperation and Development, OECD Skills Outlook 2015: Youth, skills and employability, May 27, 2015", "Organization for Economic Cooperation and Development, \"skills.oecd: United States.\"  Retrieved Feb. 8, 2016", "Organization for Economic Cooperation and Development, \"Country Note: United States,\"  retrieved Feb. 8, 2016", "Education data from United Nations Economic, Social and Cultural Organization Institute for Statistics, retrieved: Feb. 3, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]