["By Angelo Fichera", "Posted on July 26, 2019", "A social media image makes the misleading claim that former special counsel Robert S. Mueller “can’t provide evidence that his probe reached a conclusion.” Mueller reached several conclusions, including that Russia interfered in the 2016 election to damage Hillary Clinton and help Donald Trump.", "The political world recast its gaze this week on the findings of Robert S. Mueller, the former special counsel who investigated Russia’s interference in the 2016 presidential election.", "Mueller testified before two House committees on July 24, largely highlighting the findings in his report — a redacted version of which was made public by the Department of Justice in April.", "The next day, the young conservatives group called Turning Point USA — a staunch supporter of President Donald Trump — shared a misleading claim on Facebook suggesting Mueller didn’t reach any conclusions.", "“Spent over two years and $25 million investigating Russia … can’t provide evidence that his probe reached a conclusion,” reads the meme.", "The Russia probe did last about two years, and it cost $25.2 million as of Sept. 30, 2018, according to the special counsel’s most recent expenditure statements. The final figure is certain to be higher since the probe lasted another six months.", "But Mueller’s 448-page report did reach conclusions, especially in regards to Russia’s interference.", "From the introduction of the report’s first volume: “[T]he Special Counsel’s investigation established that Russia interfered in the 2016 presidential election principally through two operations. First, a Russian entity carried out a social media campaign that favored presidential candidate Donald J. Trump and disparaged presidential candidate Hillary Clinton. Second, a Russian intelligence service conducted computer-intrusion operations against entities, employees, and volunteers working on the Clinton Campaign and then released stolen documents.”", "The special counsel’s office in February 2018 secured an indictment against 13 Russian nationals and three Russian entities for their role in that interference. In July of that year, 12 Russian military officers were also indicted.", "Regarding Mueller’s inquiry into potential coordination between the Trump campaign and Russians, the report said that “the investigation established multiple links between Trump Campaign officials and individuals tied to the Russian government. Those links included Russia offers of assistance to the Campaign. In some instances, the Campaign was receptive to the offer, while in other instances the Campaign officials shied away.”", "It continued: “Ultimately, the investigation did not establish that the Campaign coordinated or conspired with the Russian government in its election-interference activities.”", "We reached out to Turning Point USA inquiring about the meme’s claim but haven’t yet received a response.", "It may be a reference to the fact that Mueller did not reach a conclusion on whether Trump committed obstruction of justice. Mueller’s office explicitly declined to reach a conclusion on that front, instead detailing in the report’s second volume several “key events” regarding obstruction that were investigated.", "Investigators “found multiple acts by the President that were capable of exerting undue influence over law enforcement investigations, including the Russian-interference and obstruction investigations.” But, the report said, “[b]ecause we determined not to make a traditional prosecutorial judgment, we did not draw ultimate conclusions about the President’s conduct.”", "Factoring into the decision to not weigh in on prosecution, according to the report (and as we’ve written before), was an opinion issued by the Office of Legal Counsel that found that a sitting president cannot be indicted.", "Attorney General William P. Barr ultimately told Congress that the Justice Department wouldn’t bring charges against Trump. In a March 24 letter, Barr wrote that “the evidence developed during the Special Counsel’s investigation is not sufficient to establish that the President committed an obstruction-of-justice offense.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Farley, Robert, et. al. “What the Mueller Report Says About Obstruction.” FactCheck.org. 18 Apr 2019.", "Kiely, Eugene. “What the Mueller Report Says About Russian Contacts.” FactCheck.org. 18 Apr 2019.", "Mueller, Robert S. III. “Report On The Investigation Into Russian Interference In The 2016 Presidential Election.” U.S. Department of Justice. Mar 2019.", "“Remarks by President Trump at Turning Point USA’s Teen Student Action Summit 2019.” WhiteHouse.gov. 23 Jul 2019.", "“Statements of Expenditures.” Special Counsel’s Office, U.S. Department of Justice. 14 Dec 2018.", "United States of America v. Internet Research Agency LLC, et. al. 1:18-cr-00032-DLF. U.S. District Court, District of Columbia. Indictment. 16 Feb 2018.", "United States of America v. Viktor Borisovich Netyksho, et. al.  1:18-cr-00215-ABJ. U.S. District Court, District of Columbia. Indictment. 13 Jul 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]