["About this rating", "On 2 May 2017, Twitter user Andy Ostroy posted a gif showing First Lady Melania Trump looking sad after smiling at her husband, President Donald Trump, alongside a message about their perceived icy relationship:", "Seems the only #Wall @realDonaldTrump's built is the one between him and @FLOTUS #Melania #trump pic.twitter.com/XiNd2jiLUF", "— Andy Ostroy (@AndyOstroy) May 3, 2017", "Shortly afterward, Ostroy was surprised (and initially skeptical) when he saw that his tweet had been \"liked\" by Melania Trump herself:", "I suspect this isn't a real account for @flotus... pic.twitter.com/ziWXhlHruV", "— Andy Ostroy (@AndyOstroy) May 3, 2017", "A Twitter account belonging to Melania Trump did \"like\" Ostroy's message. However, there are several things that should be noted about this social media interaction. First, it was Melania Trump's personal account (@MelaniaTrump) that like this message and not the official First Lady account (@FLotUS). Second, her account quickly \"unliked\" this message. Screen shots from archive.is show that this \"like\" appeared on her page for at least a half hour:", "Although it's true that the @MelaniaTrump account \"liked\" a message about the relationship between the First Lady and President Trump, it's unclear if she was actually the one who pressed the \"like\" button. The First Lady has not used the @MelaniaTrump account since Election Day on 8 November 2016, opting instead to use the @FLotUS account. Although it's certainly possible that she \"liked\" this message on her own, it's also possible that her underutilized personal account was hacked, or more likely, that she made a mistake and quickly fixed it.", "The viral gif of Melania frowning on Inauguration Day may not accurately portray her feelings toward President Trump. We investigated this video when it first went viral in January 2017, and found the claim that Melania Trump's frown was the result of harsh words from President Trump was based on very little evidence; without actually talking to the First Lady, we cannot make any authoritative statements about what transpired that day beyond what is visible in the video.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]