["About this rating", "On 5 December 2018, the World News Daily Report (WNDR) website published an article reporting that a Boston man had filed a lawsuit against household appliance manufacturer Dyson Ltd. after allegedly being partially emasculated by a Dyson vacuum cleaner:", "A Boston man is suing Dyson for $2.3 million after he was left partially emasculated from inserting his penis into a Dyson vacuum cleaner.", "Matthew Blair, 47, was transported to the Boston Medical Center last month where he necessitated a 96-hour-long surgical procedure costing him $1,260,000 in medical fees with no insurance.", "Surgeons were forced to remove one of Blair’s testicles as well as the top section of his penis, requiring 37 stitches and leaving him practically impotent because of his inability to maintain an erection more than several seconds.", "Given the prominence of the defendant and the amount of damages sought, one would have expected the incident to be reported in mainstream news venues -- even nationally -- but it was not. We were unable to locate a court filing or any other evidence to prove that such a lawsuit was actually filed.", "Moreover, the photograph used to illustrate the article (purportedly showing the plaintiff in court) appears to have been lifted from a 2014 BuzzFeed report about an entirely different case involving charges of second-degree murder and manslaughter.", "The sole source of the vacuum emasculation story, World News Daily Report, is a notorious purveyor of junk news under the guise of \"satire.\" A disclaimer on the website reads:", "WNDR shall not be responsible for any incorrect or inaccurate information, whether caused by website users or by any of the equipment or programming associated with or utilized in this website or by any technical or human error which may occur.", "WNDR assumes however all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website — even those based on real people — are entirely fictional and any resemblance between them and any persons, living, dead, or undead is purely a miracle.", "Hayes, Mike.   \"Porch Shooter\" Found Guilty of Second-Degree Murder in the Death of an Unarmed Teenager.\"\r\n    BuzzFeed News.   7 August 2014.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]