["A banner with a graphic of mascot Bucky Badger's face hung between the columns of Bascom Hall at the University of Wisconsin-Madison on Nov. 25, 2014. (UW-Madison photo)", "The $300 million Gov. Scott Walker wants to cut from the University of Wisconsin System includes an estimated $114 million reduction for the flagship University of Wisconsin-Madison.", "\"We can't handle this,\" UW-Madison Chancellor Rebecca Blank has said. \"It's not good for the university. It's not good for the state. These are simply too big.\"", "We’ve established that there are different ways to present the size of the $300 million, a two-year cut that would be made across the 26-campus system as part of Walker’s 2015-’17 state budget. There’s a measure of truth in figures that range from 2.5 percent to 13 percent.", "But what about the effect on UW-Madison, home to 43,000 students and nearly 22,000 faculty and staff (not to mention more than 400,000 living alumni)?", "At a Feb. 12, 2015 public meeting on Walker’s plan, Blank said the reduction would put the campus in a serious financial predicament.", "\"As many of you know, we got a budget cut two years ago. ... We were told to spend down our reserves, rather than acknowledging that budget cut,\" Blank said.", "\"So, we have spent down reserves in the last two years and ... I have no more reserves to spend down.\"", "We’ll check both parts of Blank’s claim -- that two years ago, UW-Madison \"spent down reserves\" as it was told to, and now it has \"no more reserves to spend down.\"", "The reserves backdrop", "Much of this stems from a report issued by the nonpartisan state fiscal bureau in April 2013 that revealed the UW System had quietly amassed $648 million in reserves.", "In fact-checking a claim by the system’s president at the time, we found the amount was roughly in line with some comparable university systems.", "Nevertheless, Walker and many fellow Republicans in the Legislature were outraged.", "The schools had built up their reserves over a period of years while they were also raising tuition -- and, in the opinion of many, had not been up front in doing so.", "\"Spend down\"", "The first part of the claim made by Blank -- who was President Barack Obama’s acting commerce secretrary until coming to Madison three months after the bombshell report -- is UW-Madison spent down its reserves after being told two years ago to do so.", "There was no explicit order to UW-Madison -- or the other UW System schools -- to trim their reserves.", "But, in effect, there was.", "The report disclosing the size of the reserves was issued as Walker and lawmakers were fashioning the 2013-’15 state budget. They responded swiftly, instituting a $66 million budget cut to the UW System and a two-year tuition freeze. The freeze amounted to a $40 million hit, given that the schools had already planned tuition increases and incorporated that revenue into their own budgets.", "The message was clear, if indirect: Reduce your reserves. And pressure was applied with the budget squeeze -- cutting state aid on the one hand and eliminating the ability to raise tuition revenue on the other.", "The UW System’s most recent assessment of reserves, or so-called fund balances, was produced in October 2014. That assessment showed UW-Madison had total reserves of nearly $387 million, down from nearly $420 million a year earlier.", "Reserves left", "The second part of Blank’s claim is UW-Madison has \"no more reserves to spend down.\"", "That’s an overstatement.", "Now, there are reserves, and there are reserves. Most are defined as \"designated,\" \"planned\" or obligated\" -- that is, they are earmarked in some way.", "But Blank herself is saying UW-Madison has $54 million in what the school describes as discretionary reserves -- \"fund balances not already committed to payments.\"", "In other words, of the $387 million in total reserves, there is $54 million in discretionary cash. That’s arguably a tiny amount for an institution that has a nearly $3 billion total budget.", "On the other hand, $54 million would go a significant way toward covering the estimated $114 million, over two years, from Walker’s proposed budget cuts. And in any case, it isn’t zero.", "Our rating", "Blank says UW-Madison \"spent down reserves\" as it was told to do two years ago and, facing new state budget cuts, has \"no more reserves to spend down.\"", "With rhethoric and actions taken with the 2013-’15 state budget, Walker and the Legislature made it clear to UW-Madison and other UW System campuses that they needed to tap their reserves. And UW-Madison did.", "But Blank, objecting to even larger cuts in state aid now being proposed by Walker, goes too far in saying UW-Madison has no reserves, given that, at a minimum, $54 million in \"discretionary reserves\" are available.", "For a statement that is partially accurate, our rating is Half True.", "------", "More on Scott Walker", "For profiles and stories on Scott Walker and 2016 presidential politics, go to the Milwaukee Journal Sentinel's Scott Walker page.", "YouTube, video of University of Wisconsin-Madison budget forum (quote at 7:15), Feb. 12, 2015", "PolitiFact Wisconsin, \"Scott Walker’s university budget cuts -- how big?\" (article) Feb. 17, 2015", "PolitiFact Wisconsin, \"UW Systems reserves fair to middling, system president says,\" (Half True)\" May 8, 2013", "Interview, University of Wisconsin-Madison spokesman Greg Bump, Feb. 18, 2015", "University of Wisconsin System, 2013-’14 operating budget, July 2013", "University of Wisconsin-Madison, \"UW-Madison budget FAQs,\" Feb. 14, 2015", "Milwaukee Journal Sentinel, \"UW-Madison chancellor fears cuts will hurt competitiveness,\" Feb. 5, 2015", "Milwaukee Journal Sentinel, \"2 years after outcry, UW System much clearer about reserves,\" Oct. 6, 2014", "Wisconsin Joint Committee on Finance, University of Wisconsin System report to the committee, Oct. 16, 2014", "University of Wisconsin-Madison, news release, Oct. 6, 2014", "Email interview, Gov. Scott Walker press secretary Laurel Patrick, Feb. 19, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]