["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "During the 2016 presidential campaign, Donald Trump promised to allow Americans to buy health insurance across state lines.", "The idea is not new, but it’s never been fully enacted.", "Currently, health insurance is regulated state by state. Some Republicans have long argued that such state-by-state regulation, including minimum requirements for health insurance plans, has kept the price of premiums high. They argue that a more unfettered, free-market approach -- where insurers compete to sell identical policies anywhere, regardless of what the purchaser’s state requires -- would drive down the cost of coverage for consumers.", "Critics counter that effectively getting rid of state regulation of insurance coverage within their borders would weaken consumer protections and promote a \"race to the bottom\" in the quality of coverage. (Here are some articles that discuss the pluses and minuses of the approach.)", "A provision to do what Trump promised didn’t make it into the American Health Care Act, the House Republican bill to repeal and replace the Affordable Care Act. However, Trump reiterated his support for the proposal in future legislation -- and his allies have kept up the rhetoric.", "During a March 19 appearance at the Church by the Glades in Coral Springs, Fla., Vice President Mike Pence said, \"Under President Trump’s leadership ... we're going to give the American people the freedom to buy health insurance across state lines -- the way you buy life insurance, the way you buy car insurance.\"", "Pence made a similar remark eight days earlier while visiting Kentucky. And on March 14, White House spokesman Sean Spicer reiterated the theme at his daily briefing. \"Who could be against allowing insurance to be sold over state lines?\" Spicer said. \"It’s something that you can do (for) your car insurance.\"", "One PolitiFact reader wrote to ask whether the comparison of health insurance and car insurance was accurate, so we decided to take a look.", "We found that their analogy is flawed. Contrary to what Pence and Spicer said, the rules governing the sale of car insurance are much the same as how health insurance is sold today -- not how the Trump administration wants it to be sold tomorrow. (The White House did not respond to an inquiry.)", "Currently, states have laws that set minimum standards for both health insurance and car insurance. For instance, when you buy car insurance, you may be required to pay for policies with a minimum level of liability coverage, medical coverage, property damage coverage and coverage for other drivers in an accident who are uninsured or underinsured. (Here’s an interactive tool from Geico to see the particular requirements in your state.)", "So it’s common for consumers to buy an auto insurance policy online from an out-of-state vendor -- just as they can buy a health insurance policy from a vendor whose headquarters are out of state.", "The key factor, though, is that for both types of insurance, that out-of-state vendor has to tailor the plan it sells you to the laws of your state.", "Today, if you live in Maryland, you can purchase an auto policy from Progressive, which is based in Ohio. But the policy you buy from Progressive must adhere to the minimum requirements of your home state, Maryland. It can’t simply sell you a one-state-fits-all policy.", "That’s effectively the same setup as it is for health insurance. If you are living in Maryland but decide to buy a health insurance policy from Aetna -- a company headquartered in Connecticut -- that plan must conform to Maryland’s minimum requirements.", "In reality, then, Pence got it backwards. What the Trump administration wants to do would make buying health insurance unlike the way you buy car insurance today -- not more like it, as Pence had said.", "\"Auto insurance is regulated by the states, which have different laws and regulations,\" said Roger Feldman, a professor of health policy and management at the University of Minnesota. \"It doesn't matter from whom I buy my policy -- all auto insurers that sell policies in Minnesota must live by the Minnesota laws.\"", "Feldman called the formulation by Pence and Spicer a \"false analogy.\"", "Lynne McChristian, executive director of the Center for Risk Management, Education and Research at Florida State University, agreed.", "In fact, she said, \"if you buy your health policy today and move from one state to another, when you notify the insurer of the change of address, the policy changes according to the requirements of the new state of residence -- just like auto insurance would.\"", "Our ruling", "Pence said that Trump’s proposal to allow Americans to buy health insurance across state lines would make it the same as \"the way you buy car insurance\" today.", "Experts say this analogy is deeply flawed. Contrary to what Pence suggested, today’s rules for car insurance are not a free-market, borderless nirvana. Car insurance is just as regulated, on a state-by-state basis, as health insurance is. So using today’s car-insurance system as a model for the administration’s vision of cross-border health-insurance sales is wrong. Making the change Trump wants would actually make the rules for health insurance and car insurance different -- not the same.", "We rate the statement False.", "Mike Pence, remarks in Coral Springs, Fla., March 19, 2017", "CBS Miami, \"Pence Stops In Coral Springs While Campaigning For GOP Health Bill,\" March 19, 2017", "Mike Pence, remarks in Kentucky, March 12, 2017", "Sean Spicer, White House daily briefing, March 14, 2017", "National Association of Insurance Commissioners, \"A Shopping Tool for Automobile Insurance,\" 2014", "Peter Orszag, \"Selling Health Insurance Across State Lines Won't Save Money,\" March 9, 2017", "New York Times, \"The Problem With G.O.P. Plans to Sell Health Insurance Across State Lines,\" Aug. 31, 2015", "Modern Healthcare, \"Trump's favorite health reform idea viewed as more talking point than solution,\" Oct. 10, 2016", "GEICO, \"Car Insurance Requirements And Laws By State,\" accessed March 22, 2017", "PolitiFact Trump-O-Meter promise, \"Get Congress to allow health insurance across state lines,\" accessed March 22, 2017", "Email interview with Joseph Antos, research scholar at the American Enterprise Institute, March 22, 2017", "Email interview with Roger Feldman, professor of health policy and management at the University of Minnesota, March 22, 2017", "Email interview with Linda Blumberg, senior fellow with the Health Policy Center at the Urban Institute, March 22, 2017", "Email interview with Lynne McChristian, executive director of the Center for Risk Management, Education and Research at Florida State University, March 22, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]