["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This is misleading. Some of the quotes are legitimate, and were made during or around the height of the Black Lives Matter protests over the summer. Some statements received backlash, but none specifically indicated that they meant anything besides peaceful protest.", "Other comments were made years ago and were not referring to any looting or violent civil unrest that occurred in 2020.", "After pro-Trump rioters stormed the U.S. Capitol on Jan. 6, some have taken to social media to criticize liberals who have condemned the breach, calling them hypocrites for supporting the Black Lives Matter protests over the summer.", "One popular Facebook post targets four Democratic women in Congress: U.S. Rep. Ayanna Pressley, Vice President-elect Kamala Harris, U.S. Rep. Maxine Waters, and House Speaker Nancy Pelosi. Their faces are pictured in front of burning buildings.", "Each photo includes a quote purportedly from the lawmaker that sounds like she is encouraging unrest. The post claims these are \"direct quotes\" from when Black Lives Matter \"was BURNING down cities and killing people in the streets!\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Let’s take it one quote at a time.", "Ayanna Pressley", "According to the post, Pressley, D-Mass., said of the Black Lives Matter protests that \"there needs to be unrest in the streets.\"", "Pressley did call for \"unrest in the streets\" in an Aug. 15 interview with Tiffany Cross on MSNBC’s \"AM Joy\" show.", "\"This is as much about public outcry and organizing and mobilizing and applying pressure so that this GOP-led Senate and these governors that continue to carry water for this administration, putting the American people in harm’s way, turning a deaf ear to the needs of our families and our communities — hold them accountable,\" she said.", "\"Make the phone calls, send the emails, show up,\" she added. \"You know, there needs to be unrest in the streets for as long as there’s unrest in our lives.\"", "Pressley received swift backlash with critics accusing her of condoning lawlessness. Pressley said she didn’t expect that reaction.", "\"There are moments in real time when you’re offering something — on a stage in a dais, in an interview — where you become aware: ‘I’m going to experience a lot of vitriol for this,’\" Pressley recalled about her comment in a Jan. 3 USA Today article. \"I have to say, for this particular moment, I had not anticipated that, because it was a framing that I have used many times before.\"", "There was no indication Pressley necessarily meant anything other than peaceful protest.", "Kamala Harris", "The quote attributed to Harris, that \"protesters should not let up,\" is legitimate, but she was neither referring to riots nor condoning people burning down buildings.", "Speaking remotely to late-show host Stephen Colbert in June 2020, Harris voiced support for the racial justice protests that were going on — but she didn’t say she wanted riots to continue.", "\"This is a movement, I’m telling you, they’re not going to stop, and everyone beware, because they’re not going to stop before Election Day in November, and they’re not going to stop after Election Day,\" she said. \"And everyone should take note of that, on both levels, that they’re not going to let up, and they should not, and we should not.\"", "In a speech on Aug. 27, Harris said she supported peaceful protesters.", "\"We should not confuse them with those looting and committing acts of violence,\" she said.", "Maxine Waters", "Rep. Maxine Waters, D-Calif., is quoted as saying: \"If you see anybody from that Cabinet in a restaurant, in a department store, at a gasoline station, you get out and create a crowd and you push back on them, and you tell them they’re not welcome anymore, anywhere.\"", "Waters’ comment came in 2018 at a Los Angeles rally after a Virginia restaurant owner refused to serve then-White House press secretary Sarah Huckabee Sanders. It had nothing to do with the Black Lives Matter movement or riots.", "Waters urged attendees at the event to keep \"pushing back\" against members of the Trump administration with whom they disagreed.", "\"You think we’re rallying now? You ain’t seen nothing yet,\" Waters said, according to a HuffPost report. \"Already you have members of your Cabinet that are being booed out of restaurants ... protesters taking up at their house saying ‘no peace, no sleep.’\"", "\"If you see anybody from that Cabinet in a restaurant, in a department store, at a gasoline station, you get out and you create a crowd and you push back on them and you tell them they’re not welcome anymore, anywhere,\" she added.", "Her comment was met with condemnation from Republicans and distance from some Democrats.", "Nancy Pelosi", "Pelosi’s alleged riot quote — \"I just don’t know why there aren’t uprisings all over the country. Maybe there will be\" — was said over two years ago about the Trump administration’s policy of separating migrant children from their parents at the U.S.-Mexico border.", "On June 14, 2018, Pelosi said that the National Association of Evangelicals told Congress that the U.S. refugee resettlement system was the \"crown jewel of American humanitarianism.\"", "\"And in order to do away with that crown jewel, they're doing away with children being with their moms,\" she said. \"I just don't even know why there aren't uprisings all over the country. And maybe there will be, when people realize that this is a policy that they defend.\"", "A Facebook post features statements made by four Democratic leaders and claims the comments are all direct quotes that were made \"when BLM was BURNING down cities and killing people in the streets!\"", "This is misleading. Some of the quotes are legitimate, and were made during or around the height of the Black Lives Matter protests over the summer.", "Some of the statements received backlash, but none specifically indicated that they meant anything besides peaceful protest. Harris, in particular, condemned violent rioters and said she supported peaceful protesters.", "Other comments were made years ago and were not referring to any looting or violent civil unrest that occurred during riots in 2020.", "The Facebook post contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Facebook post, Jane. 6, 2021", "YouTube, UNHINGED: Squad Member Rep. Pressley Calls For Targeting GOP Officials With \"Unrest In The Streets\", Aug. 15, 2020", "USA Today, Rep. Ayanna Pressley: 'What do you do when your very existence is resistance?', Jan. 3, 2021", "PolitiFact, No, Kamala Harris didn’t say she wants riots to continue, Sept. 4, 2020", "Vox, The controversy over Maxine Waters’s call for confrontation, explained, June 28, 2018", "HuffPost, Maxine Waters Warns Trump Cabinet: Steel Yourself For More Public Confrontations, June 25, 2018", "Real Clear Politics, Pelosi: \"I Don't Even Know Why There Aren't Uprisings All Over The Country\" Over Migrant Child Separation, June 14, 2018", "CNN, Fact check: Dishonest Trump video twists Democrats' quotes to make it sound like they endorsed riots. June 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]