["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate and former Vice President Joe Biden steps off a plane Tuesday, Sept. 15, 2020 at Tampa International Airport in Tampa, Fla., on a visit for campaign events. (AP)", "• Biden was waving to firefighters and ground personnel out of frame. ​", "• Two videos more clearly show Biden waving toward a firetruck at the other end of the field.", "On Sept. 15, Joe Biden arrived in Tampa, Fla., for a campaign event, and as he descended the stairs of the airplane, he waved.", "One video capturing the moment spread quickly on social media as Facebook users shared it with derisive captions suggesting Biden was waving to an empty field. However, the video truly took off when Fox News host Sean Hannity posted it to his account with the title, \"This Is Real: Biden Waves To An Empty Field.\"", "Yes, the video is real — but the field wasn’t empty.", "This Facebook post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "According to an Associated Press reporter who was there with Biden as he left the plane, the Democratic nominee was waving to a group of firefighters and personnel who were out of the  frame due to the camera angle.", "Another video of Biden descending the stairs clearly shows him waving in the direction of a firetruck at the other end of the field. And in yet another video shared by Bloomberg News reporter Tyler Pager, four people are seen standing near the fire truck facing him.", "We rate this post False.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "AP, \"Video does not show Biden waving to an empty field,\" Sep. 16, 2020", "Facebook post, Sep. 15, 2020", "Facebook post, Sep. 15, 2020", "Facebook post, Sep. 16, 2020", "Tweet, Sep. 15, 2020", "Tweet, Sep. 15, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]