["About this rating", "The Illegal Immigration Reform and Immigrant Responsibility Act of 1996 made it a federal crime for non-citizens to vote in national elections and classified any unlawful voting by non-citizens (in local, state, and national elections) as a deportable offense.", "Short of cases entailing fraudulent citizenship claims, the deportation of non-citizens who vote unlawfully is neither automatic nor mandatory. The decision to deport a non-citizen convicted of unlawful voting rests ultimately with an immigration judge who rules based on evidence and other considerations put before the court.", "Partisan sources primarily on the right -- including President Donald Trump -- allege that many thousands (Trump claimed \"millions\") of undocumented immigrants voted illegally in the 2016 presidential election.", "No evidence exists to support these claims. An advisory commission impaneled by President Trump to investigate election fraud in 2017 was disbanded less than a year later without having demonstrated that large-scale voting abuse occurred. As of August 2018, the U.S. Department of Justice (DOJ) had charged a total of 19 foreign nationals with voting illegally in the 2016 federal election. Academic studies have shown that voter fraud in general is a rarity in U.S. elections.", "Trump and his supporters have nevertheless kept up a drumbeat of alarm over the prospect of non-citizens illegally voting, with the president declaring as recently as January 2019 that immigrant voter fraud is \"rampant\" across the United States. In April and May 2019, a number of posts and memes shared on social media claimed that a federal law passed in 1996 requires that any non-citizen caught voting must be deported:", "The Illegal Immigration and Responsibility Act of 1996 - NOT REPEALED - non-citizens who vote MUST be deported. Imagine that...", "— BCH (@VoireDire12) May 11, 2019", "The Illegal Immigration Reform and Immigrant Responsibility Act of 1996 (IIRIRA) did contain two provisions specifically addressing voting by non-citizens (\"aliens\").  The first made it a federal crime for non-citizens to vote in elections involving candidates for national office. The second stated that any non-citizen who voted in violation of any federal, state, or local law was both \"excludable\" and \"deportable.\" Both of the statutes enacted in the legislation were revised and clarified over time but have not been repealed.", "In its current form, 18 U.S. Code Section 611 declares it unlawful for aliens to vote in federal elections, with certain carefully demarcated exceptions:", "§611. Voting by aliens\n(a) It shall be unlawful for any alien to vote in any election held solely or in part for the purpose of electing a candidate for the office of President, Vice President, Presidential elector, Member of the Senate, Member of the House of Representatives, Delegate from the District of Columbia, or Resident Commissioner, unless-\n   (1) the election is held partly for some other purpose;\n   (2) aliens are authorized to vote for such other purpose under a State constitution or statute or a local ordinance; and\n   (3) voting for such other purpose is conducted independently of voting for a candidate for such Federal offices, in such a manner that an alien has the opportunity to vote for such other purpose, but not an opportunity to vote for a candidate for any one or more of such Federal offices.\n(b) Any person who violates this section shall be fined under this title, imprisoned not more than one year, or both.\n(c) Subsection (a) does not apply to an alien if --\n   (1) each natural parent of the alien (or, in the case of an adopted alien, each adoptive parent of the alien) is or was a citizen (whether by birth or naturalization);\n   (2) the alien permanently resided in the United States prior to attaining the age of 16; and\n   (3) the alien reasonably believed at the time of voting in violation of such subsection that he or she was a citizen of the United States.", "Apart from this statute, federal law doesn't expressly prohibit non-citizens from voting, though the laws of all 50 individual states do (which has been the case since 1926). Thus, with the exception of a very few municipalities in certain states where local ordinances allow non-citizens to vote in school board elections or on other local matters, it is illegal for non-citizens to vote in the United States.", "For someone convicted of violating the federal prohibition on non-citizens voting in national elections, Section 611 imposes a fine and/or imprisonment of up to one year. However, it does not address the subject of deportation, which is covered under another U.S. statute and applies to aliens who violate state and local voting regulations as well as federal ones.", "8 U.S. Code Section 1227 (\"Deportable aliens\") lists the classes of non-citizens present in the United States who \"shall, upon the order of the Attorney General, be removed.\" Unlawful voting is covered in Subsection 6:", "(6) Unlawful voters\n      (A) In general\n      Any alien who has voted in violation of any Federal, State, or local constitutional provision, statute, ordinance, or regulation is deportable.\n      (B) Exception\n       In the case of an alien who voted in a Federal, State, or local election (including an initiative, recall, or referendum) in violation of a lawful restriction of voting to citizens, if each natural parent of the alien (or, in the case of an adopted alien, each adoptive parent of the alien) is or was a citizen (whether by birth or naturalization), the alien permanently resided in the United States prior to attaining the age of 16, and the alien reasonably believed at the time of such violation that he or she was a citizen, the alien shall not be considered to be deportable under any provision of this subsection based on such violation.", "Practically speaking, \"deportable\" in this instance doesn't mean precisely the same thing as \"must be deported.\" Non-citizens found guilty of so-called \"aggravated felonies\" (such as murder, sex crimes, drug trafficking, etc.) are subject to automatic, mandatory removal from the country, but non-citizens convicted solely of unlawful voting (unless they falsified citizenship documents for that purpose, which could result in an aggravated felony charge) are entitled to a hearing before an immigration judge if deportation proceedings are initiated against them. The judge must rule, based on the evidence and consideration of the non-citizen's application for relief or protection from removal (if any), whether to proceed with deportation.", "That said, the permissible exceptions (as cited in the statutes above) are quite narrow. The only conditions under which it is not a deportable crime for a non-citizen to vote are when the act occurred in a local election where permitted by local law, or when the non-citizen is the child of U.S. citizens, has been a legal permanent resident since before the age of 16, and reasonably believed at the time of the violation that they possessed citizenship. The latter exception aside, recent cases have demonstrated that neither the reasonable belief that one was a citizen at the time one voted nor unawareness that it is illegal to vote as a non-citizen is likely to spare someone convicted of the crime from deportation.", "So, while deportation is neither automatic nor a certainty in unlawful voting cases involving non-citizens, it is by law a deportable offense, and the most likely outcome if proceedings are initiated by the government is removal from the country. \"Illegal voting makes a person ineligible for citizenship, may cause them to lose their green card if they have one, and can put them into deportation proceedings where they may not have any ability to get relief from being ordered removed,\" William A. Stock, the national president of the American Immigration Lawyers Association, told us. \"It puts any non-citizen on the path to deportation and restricts most of the ways to get off that path.\"", "Brady, Kathy.   \"Practice Advisory: Aggravated Felonies.\"\r\n    Immigrant Legal Resource Center.   April 2017.", "Garcia, Michael John.   Immigration-Related Document Fraud: Overview of Civil, Criminal, and Immigration Consequences.\r\n    ILW.com.   5 September 2006.", "Gutierrez, Gabe and Rich Gardella.   \"Grandmother Deported for Voter Fraud Leaves U.S. in Tears.\"\r\n    NBC News.   5 August 2017.", "Levine, Sam and Ryan J Reilly.   \"Legal U.S. Immigrants Face Prison and Even Deportation for Voting.\"\r\n    HuffPost.   29 August 2018.", "Montgomery, Rick.   \"Illinois Priest Nearing Citizenship Now Faces Deportation. Because He Mistakenly Voted.\"\r\n    The Kansas City Star.   20 September 2018.", "Pakdaman, Kimia.   \"Non-Citizen Voting Rights in the United States.\"\r\n    Berkeley Public Policy Journal.   4 March 2019.", "Pilger, Richard C., ed.   Federal Prosecution of Election Offenses.\r\n    U.S. Department of Justice.   December 2017.", "Shear, Michael D. and Emmarie Huetteman.   \"Trump Repeats Lie About Popular Vote in Meeting with Lawmakers.\"\r\n    The New York Times.   23 January 2017.", "Tackett, Michael and Michael Wines.   \"Trump Disbands Commission on Voter Fraud.\"\r\n    The New York Times.   3 January 2018.", "Brennan Center for Justice.   \"Debunking the Voter Fraud Myth.\"\r\n    31 January 2017.", "Legal Information Institute.   \"U.S. Code, Title 8, Section 1227 -- Deportable Aliens.\"\r\n    Cornell Law School.   Accessed 21 May 2019.", "Legal Information Institute.   \"U.S. Code, Title 18, Part I, Chapter 29, Section 611 - Voting by Aliens.\"\r\n    Cornell Law School.   Accessed 21 May 2019.", "U.S. Congress.   Illegal Immigration and Immigrant Responsibility Act of 1996.\r\n    NAFSA: Association of International Educators.   Accessed 21 May 2019.", "U.S. Dept. of Justice.   \"Nineteen Foreign Nationals Charged for Voting in 2016 Election.\"\r\n    24 August 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]