["“Still think the Pandemic is Real?” says a December 4, 2020 Facebook post that includes an image comparing death tolls in the US over a five-year period, which range from 2.7 million in 2015 to 2.9 million in 2019, to 2,487,350 “as of November 16th 2020.”", "Another Facebook user who shared the image wrote: “Coronavirus saving more lives than deaths it caused.”", "Different versions of the post featuring the same numbers were shared on Facebook, Instagram and Parler, and surged in early December.", "The most common iteration was a screenshot from My Christian Daily, a website that included the statistics in a November 20 article complaining about California strip clubs being able to open but not churches.", "Although the numbers used in the graph are real, the comparison is misleading.", "As some users pointed out, the numbers come from the US Centers for Disease Control and Prevention (CDC), which regularly publishes statistics on mortality in the US.", "The CDC reported 2,712,630 deaths in the US in 2015, 2,744,248 in 2016, 2,813,503 in 2017, and 2,839,205 in 2018.", "However, final mortality counts for 2019 have not yet been released, and it is unclear what source was used for that year. The total of the CDC’s 2019 monthly provisional count comes close to the figure, with 2,855,000 deaths.", "As the posts say, the data for 2020 is incomplete, and was taken from the CDC’s provisional death count on November 16, then at 2,487,350.", "As of December 8, the provisional count had already risen to 2,685,404 deaths.", "Comparing deaths across time periods of different length is not statistically sound, Lauren Rossen, a CDC researcher who works on the agency’s Mortality and Morbidity Weekly Report, told AFP in an email.", "For a proper comparison, “we need to compare the number of deaths occurring in the first 44 weeks of 2020 with the numbers of deaths occurring over those same weeks of previous years,” she said.", "With this adjustment, “There have been more than 310,000 deaths in 2020 than in the same time period of 2019,” Rossen said.", "By compiling available weekly data for 2019 and 2020, Rossen found that there were 312,990 more deaths by November 2020 than in 2019.", "In a separate report, Rossen’s team found more than 299,000 excess deaths between January and October 2020, two thirds of which are attributable to Covid-19.", "“Covid-19 accounts for most of the excess deaths that we are seeing this year (about 2/3),” she said. As for the last third, “we see elevated numbers of deaths from a few other causes this year, including circulatory diseases and Alzheimer disease or dementia.”", "The figures do not account for population aging or growth over time, Rossen specified, so more research will be needed to determine the exact impact of Covid-19 on excess deaths in 2020.", "The Covid-19 toll has been the subject of multiple false claims, including that the US health authorities revised down the number of deaths caused by the pandemic.", "The United States has the world’s highest death toll due to Covid-19 -- more than 285,000 as of December 8, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]