["About this rating", "A bombastic, over-the-top commercial has left some TV viewers and internet users baffled by the authenticity of Trumpy Bear, a 22-inch stuffed animal with a striking resemblance to the 45th President of the United States.", "\"The fearless, super-plush American grizzly,\" is how a booming male voiceover describes Trumpy Bear in a two-minute commercial first posted to YouTube in July 2017. \"Even the toughest guys will love Trumpy Bear,\" the voice continues, as a woman is shown carefully tending to Trumpy's blond combover and red tie, which accompanies cuffs, collars and cuff-links to make up his immaculate corporate outfit.", "We have received several enquiries from readers about whether Trumpy Bear is a real product or — as one reader described it — just \"great satire.\"", "Trumpy Bear is real. The commercial is real, not a spoof (although some moments appear to have been written with tongue firmly in cheek). And the bear itself is a real product available for purchase.", "Exceptional Products, the Texas company that markets Trumpy Bear on television, also uses infomercials and television advertising to promote products like Hairdini, Save a Blade and Plaque Attack.", "In October 2017, the commercial began running on 10 TV networks, including Animal Planet and the Discovery Channel, according to the advertising and media news web site Ad Age.", "The product consists of the 22-inch tall stuffed animal and a 28-by-30-inch American flag blanket that can be stored in a zipped pouch inside Trumpy Bear himself, according to the product web site. Trumpy Bear costs $39.90, which can be paid in two installments of $19.95.", "We asked Exceptional Products about sales of Trumpy Bear, but the company declined to provide any details. Nonetheless, we know people have been buying the toy, in particular as a Christmas present according to several social media posts.", "Exceptional Products owns the trademark on Trumpy Bear, according to U.S. Patent and Trademark Office records, but the concept and design was invented by a V.L. Lange from a company called \"Reel Vision,\" a spokesperson for Exceptional Products told us.", "We were unable to find further details on Lange or their company, and they did not respond to an invitation to comment. However, Exceptional Products did send us the \"vision statement\" for Trumpy Bear, in which Lange emphasizes \"No, this is not a joke.\"", "In 1902 the teddy bear was born and named after President Teddy Roosevelt. When President Donald Trump was elected to office as the first non-politician president, I felt it was time to name an American fearless grizzly bear after our new Commander in Chief. I designed the Trumpy Bear in a recognizable image of our current president.", "This iconic bear should be viewed as the symbol that anyone can run for president of this great country of ours. The weight of the responsibilities that come with the presidency can be a burden that I, for one, could never endure.", "And no, this is not a joke. I want it to be perfectly clear that the men who served in our military spoke from their hearts in the Trumpy Bear commercial. Any vilification of a veteran should never be tolerated.", "While the TV commercial features a disclaimer emphasizing that President Donald Trump has not endorsed Trumpy Bear, it brings to mind another marketing effort that has emerged during the Trump era.", "In May 2017, the President himself began marketing the \"Big League Box\" to supporters — a monthly delivery of \"exclusive and vintage OFFICIAL Donald J. Trump merchandise\" for a subscription of $49 or more each month.", "Dumenco, Simon.  \"Trumpy Bear is Now Backed by a National TV Ad Campaign.\"\r\n  Ad Age.  25 October 2017.", "LaCapria, Kim.  \"Is the Trump Administration Selling Subscription 'Big League Boxes'?\"\r\n  Snopes.com.  31 May 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]