["About this rating", "On 8 January 2019, presidential biographer Jon Meacham tweeted what he described as a quote from the year 1924 made by then-Georgia Gov. Clifford Walker during a speech given at a Ku Klux Klan gathering:", "America should “build a wall of steel, a wall as high as Heaven\" against the flow of immigrants.--Georgia Gov. Clifford Walker, at a 1924 convention of the Ku Klux Klan, then a powerful force at a time of strain for the white working class. #PastIsPrologue", "— Jon Meacham (@jmeacham) January 8, 2019", "The quote spread across the Internet, stripped of its context and in meme form, prompting some readers to query whether the quote and its description were real:", "We confirmed that Walker did in fact make this remark in regards to immigrants at a KKK gathering. The statement was part of a speech called \"Americanism Applied\" and given by Walker at a \"Klonvocation\" in Kansas City, Missouri, in 1924. It can be found in a book called the Proceedings of the Second Imperial Klonvokation of the Knights of the Ku Klux Klan.", "The contents of that book have been uploaded to the Internet Archive, and we confirmed its authenticity with the Special Collections branch of the University of California at Davis' library, which also possesses a copy.", "Meacham's tweet was referencing a protracted partial shutdown of the federal government resulting from an impasse over a demand by President Donald Trump for a budget appropriation of $5.7 billion to fund wall construction along the U.S.-Mexico border. Trump had been stating on Twitter that his desired wall would be made of steel:", "A design of our Steel Slat Barrier which is totally effective while at the same time beautiful! pic.twitter.com/sGltXh0cu9", "— Donald J. Trump (@realDonaldTrump) December 21, 2018", "Although harsh immigration rhetoric and policies have primarily targeted Latino migrants, Walker's comments demonstrate the shifting idea of which immigrant groups are considered favorable. His declaration, in its entirety, stated: \"I would build a wall of steel, a wall as high as Heaven, against the admission of a single one of those Southern Europeans who never thought the thoughts or spoke the language of a democracy in their lives.\"", "Kinights of the Ku Klux Klan, Inc.   Proceedings of the Second Imperial Klonvocation of the Knights of the Ku Klux Klan, Held in Kansas City, MO in September 1924.\r\n    1924.", "Meacham, Jon.   The Soul of America: The Battle for Our Better Angels.\r\n    Random House, 2018.   ISBN 0399589813.", "Baker, Kelly J.   \"Make America White Again?\"\r\n    The Atlantic.   12 March 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]