["About this rating", "Phasing out the distribution of single-use plastic straws for environmental reasons has become a focus of government and business policy in recent years, and in July 2018 the giant Starbucks coffee chain announced that they intended to eliminate plastic straws from their stores by 2020. Shortly after Starbucks issued that announcement, an image was derisively circulated via social media that purportedly documented the company's (seemingly nonsensical) approach to the issue -- switching to paper straws individually enclosed in single-use plastic wrappers:", "The items shown in this picture can indeed be found at some Starbucks locations, but not as an offered alternative to plastic straws.", "In fact, Starbucks is not relying on paper straws to completely replace plastic straws at their stores. Rather, the company will be expanding their deployment of strawless lids in order to eliminate plastic straw use:", "Starbucks is announcing today that it will phase out plastic straws from its more than 28,000 stores worldwide by 2020, a decision that will eliminate more than 1 billion straws a year. In their place? The lid that (Emily) Alexander developed.", "The lid that is replacing the straws is also made of plastic, but its polypropylene content can be widely recycled. “By nature, the straw isn’t recyclable and the lid is, so we feel this decision is more sustainable and more socially responsible,” said Chris Milne, director of packaging sourcing for Starbucks. “Starbucks is finally drawing a line in the sand and creating a mold for other large brands to follow. We are raising the water line for what’s acceptable and inspiring our peers to follow suit.”", "Fortune magazine also noted that while most drinks at Starbucks will soon be served with strawless lids, the company will also use straws made of alternative materials (such as paper or compostable plastic) to be made available upon customer request.", "The straws shown in the viral social media image are not Starbucks' solution to the plastic straw issue; rather, they're \"flavored iced coffee\" straws (sometimes sold as \"Candy Straws\") which are available for purchase at some Starbucks locations:", "Starbucks also offers edible \"cookie straws\" often sold with their Frappuccino drinks. (And no, Starbucks is not planning on replacing all of their plastic straws with cookie straws either.)", "To sum up: Starbucks did announce a plan to eliminate plastic straws by 2020. This goal will primarily be accomplished by expanding the use of strawless lids, not by switching to paper straws individually wrapped in plastic.", "Kowitt, Beth.   \"Starbucks Will Eliminate Plastic Straws Globally by 2020.\"\r\n    Fortune.   9 July 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]