["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "•  The post wrongly conflates accommodations for transgender students with child molestation.", "• During the Obama administration, federal agencies issued guidance instructing schools to allow transgender students to use the facilities that correspond with their gender identity. The guidance was related to students and did not address adults.", "• There is no evidence President Donald Trump, or any part of his administration, have rescued 300 missing children.", "A Facebook post shared thousands of times falsely claims that President Donald Trump has rescued hundreds of children while his predecessors, including former vice president Joe Biden, put \"little girls\" in danger.", "\"Biden and Obama allowed grown men in restrooms with little girls. TRUMP has rescued over 300 missing children from pedifiles and perverts. Pick your President,\" one Sept. 16 Facebook post reads. (It misspelled \"pedophiles.\")", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post, which has echoes of a widely debunked conspiracy theory known as QAnon, paints a distorted picture of both Biden, now the Democratic presidential nominee, and the president he is seeking to unseat on Nov. 3.", "The claims that President Barack Obama and Vice President Biden — now the Democratic presidential nominee — allowed grown men into restrooms with young girls appears to stem from an accusation Republican Sen. Ted Cruz made after the Obama administration issued guidance to schools about civil rights protections for transgender students.", "A May 2016 letter to schools from the Justice and Education departments said that schools were not allowed to force students to use facilities that aligned with their sex assigned at birth:", "\"A school may provide separate facilities on the basis of sex, but must allow transgender students access to such facilities consistent with their gender identity. A school may not require transgender students to use facilities inconsistent with their gender identity or to use individual-user facilities when other students are not required to do so.\"", "The requirement prompted a lawsuit, and the debate about which bathrooms transgender individuals should be allowed to use emerged as a talking point during the 2016 presidential campaign.", "Cruz, a Republican who ran against Trump for the presidential nomination in 2016, claimed the Obama-era rule required schools to \"allow grown men and boys into little girls’ bathrooms.\" We rated Cruz’s claim Mostly False as the guidance was related to students, not adults.", "Once in office, Trump’s administration rescinded the guidance, saying the issue was best resolved \"at the state and local level.\"", "Biden has pledged to reinstate the guidance if elected.", "Nevertheless, the Obama-era rule that required schools to allow students to use the bathroom that corresponded with their gender identity applied to students. But the guidance said nothing about adult men, as the post claims.", "There is no evidence that Trump has \"rescued over 300 missing children from pedifiles and perverts.\" The claim is associated with QAnon, a widely discredited and baseless conspiracy theory that maintains leading Democrats and other public figures are Satan-worshiping pedophiles and that Trump is secretly working to stop them.", "We looked into a similar social media claim that Trump created a \"child protective force that found over 300 missing kids in less than 30 days,\" and rated it False.", "The U.S. Marshals service’s Missing Child Unit, working alongside local agencies, has safely located or recovered missing children for years, including while Trump was president. But many of the children were found where they belonged, and weren’t \"rescued\" from anyone, as the post claims.", "A Facebook post claims, \"Biden and Obama allowed grown men in restrooms with little girls. TRUMP has rescued over 300 missing children from pedifiles and perverts.\"", "Obama administration guidance required schools to allow transgender students to use the bathroom that corresponded with their gender identity, but the rule said nothing about allowing adults to do so as well.", "During the Trump presidency, the U.S. Marshals Missing Child Unit has conducted operations to locate missing children. But there is no evidence to suggest Trump \"rescued\" 300 children from perverts.", "We rate this post False.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Sept. 21, 2020", "PolitiFact, \"No, Trump doesn’t have a ‘child protective force’ searching for missing children,\" Sept. 16, 2020", "PolitiFact, \"Ted Cruz makes Mostly False claim about Obama directing men and boys into girls' bathrooms,\" June 26, 2016", "The Human Rights Campaign, \"100 Days Out: Trump v. Biden on LGBTQ Equality in Schools,\" July 23, 2020", "U.S. Department of Education and U.S. Department of Justice, \"Dear Colleague Letter on Transgender Students,\" May 13, 2016", "U.S. Department of Education, \"U.S. Secretary of Education Betsy DeVos Issues Statement on New Title IX Guidance,\" Feb. 22, 2017", "The Texas Tribune, \"Texas Seeks Temporary Block of Rules for Transgender Students,\" Aug. 12, 2016", "CBS News, \"Ted Cruz, Donald Trump spar over North Carolina transgender bathroom law,\" April 21, 2016", "Biden Harris website, \"The Biden Plan To Advance Lgbtq+ Equality In America And Around The World,\" accessed Oct. 1, 2020", "BBC News, \"Trump rescinds transgender bathroom rules from Obama era,\" Feb. 23, 2017", "CBS News, \"U.S. Marshals say they found 39 missing children in Georgia during two-week operation,\" Aug. 30, 2020", "The Detroit News, \"Boy, 14, found squatting in abandoned Detroit house,\" Oct. 9, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]