["About this rating", "In 2019, Democrats in the House Judiciary Committee voted against amendments to a gun background check law. Those amendments would require that ICE be notified when an undocumented immigrant fails a gun background check. Furthermore, in a later vote before the full House, most Democrats voted against a motion to include the same ICE notification provision in the bill. However, that was not the whole story...", "Those two votes in the committee were for procedural reasons, not on the substance of the ICE proposals. Furthermore, when the background check legislation came to a final vote, almost all Democratic House members voted for it, complete with the ICE notification requirements. Almost all Republicans voted against it.", "In early 2021, as U.S. Congress considered legislation to expand background checks for would-be purchasers of firearms, a meme spread widely on social media, accusing congressional Democrats of attempting to block a measure that would require the Immigration and Customs Enforcement (ICE) agency to be notified whenever a so-called \"undocumented immigrant\" (a person who is living in the country illegally) attempted to purchase a gun.", "The meme contained the following text:", "\"Judiciary Committee just offered an amendment that requires ICE be notified when an illegal immigrant tries to purchase a firearm Dems voted NO So the Dems just admitted they have no problem with people having guns. As long as they are not American citizens that are working class.\"", "The meme was often prefaced with the words \"I sure hope everyone is paying attention. There is no good explanation for this,\" and followed by the phrase \"Really think about that for a minute.\"", "As an illustration of the meme's popularity on Facebook, the following screenshot shows just a selection of posts from 2021:", "Despite being shared widely in 2021, the meme was actually two years old and referred to a separate (though related) piece of legislation called H.R. 8, which was considered by Congress in 2019. The meme itself originated in a tweet posted by @GregNorberg, who has promoted the QAnon cluster of conspiracy theories.", "Twitter has since suspended that account (Snopes asked Twitter why, but we have not yet received a response), but an archived version of @GregNorberg's Feb. 16, 2019, tweet is still available:", "And the photograph contained in the meme originated in a Feb. 13, 2019, Facebook post by U.S. Rep. Ben Cline, a Republican from Virginia, who wrote:", "\"I just offered an amendment in the Judiciary Committee that requires ICE be notified when an illegal immigrant tries to illegally purchase a firearm. Dems voted to kill it. This gun control bill #HR8 is not about public safety. It's about taking away the rights of law abiding citizens.\"", "In fact, Republican Judiciary Committee members offered two similar amendments on Feb. 13, both of which would have required the notification of the local FBI field office, local and state police, and ICE, whenever an \"undocumented immigrant\" failed a background check in attempting to buy a gun.", "Democrats on the committee did vote against those proposals but, as this fact check outlines, did so for procedural reasons. So the meme gave a poor description of the actions of Democrats on the Judiciary Committee. When the bill came before the full House chamber, Democrats did largely vote against the ICE notification requirement, but when it came to passing the legislation as a whole, with the ICE notification requirement then included, almost all Democrats voted for it, while their Republican colleagues almost all voted against it.", "On the whole, we are issuing a rating of \"Mixture\" for what is a complicated set of facts that a vastly oversimplified meme did not adequately explain.", "H.R. 8, the \"Bipartisan Background Checks Act of 2019,\" was introduced in the House on Jan. 8, 2019, by U.S. Rep. Mike Thompson, a Democrat from California. The Democratic-controlled House passed it on Feb. 27, but it died in the then-Republican-controlled Senate.", "If implemented, H.R. 8 would have expanded the prevalence of background checks for potential gun buyers. At present, the buying and selling of firearms through licensed sellers are governed by federal law and requires any licensed seller to contact the National Instant Criminal Background Check System (NICS) first, to ensure that the would-be buyer does not have a criminal record or is not excluded from owning a gun for other reasons.", "However, H.R. 8 would have expanded those requirements to private, unlicensed transactions, as the following summary — written by the non-partisan Congressional Research Service — explained:", "This bill establishes new background check requirements for firearm transfers between private parties (i.e., unlicensed individuals). Specifically, it prohibits a firearm transfer between private parties unless a licensed gun dealer, manufacturer, or importer first takes possession of the firearm to conduct a background check. The prohibition does not apply to certain firearm transfers, such as a gift between spouses in good faith.", "During a House Judiciary Committee meeting on Feb. 13, 2019, two Republican Congressmen put forward amendments that would have required the FBI, state and local police, and ICE to be notified any time an \"undocumented immigrant\" failed a background check when attempting to purchase a gun. It's not clear to which amendment the meme refers, so this fact check evaluates the accuracy of the meme in the context of each one.", "The first amendment came from Cline. The short committee debate on that amendment can be viewed below. Cline presented his amendment as being the same or similar to H.R. 4343, the \"Unlawful Gun Buyer Alert Act,\" a bill introduced by Congressional Democrats in 2017. However, that was a misleading characterization.", "H.R. 4343 \"[required] the national instant criminal background check system to notify certain law enforcement agencies when a firearm is transferred to a person who is subsequently determined to be prohibited from receiving or possessing a firearm.\" Those law enforcement agencies were specified as the FBI and state and local police. Cline's amendment, by contrast, also required that ICE be informed in the case of an \"undocumented immigrant\" who fails a background check.", "Democrats in the committee opposed the introduction of Cline's amendment but did so explicitly for procedural reasons. Firstly, U.S. Rep. Hank Johnson, a Democrat from Georgia, said Cline's amendment was \"not germane\" (that is, not relevant), adding:", "\"To encumber this bill, which is plain and simple, with extraneous matter dealing with ICE, makes that amendment non-germane. And for that reason, I would...ask that the amendment be ruled out of order.\"", "The committee chairman, U.S. Rep. Jerry Nadler, a Democrat from New York, agreed with Johnson, and ruled Cline's amendment out of order, saying it was \"way beyond the scope of the bill.\"", "In accordance with House committee rules, Cline appealed against Nadler's ruling, and in response, Democratic committee members put forward a \"motion to table\" Cline's appeal — that is, they moved to dismiss or kill Cline's appeal. That motion was carried, meaning Nadler's ruling was left to stand, and Cline's amendment was ruled out of order.", "It's important to note that a motion to table cannot be debated, so Democratic committee members who voted to dismiss Cline's appeal did not put forth their reasons. However, we do know that the only Democrats to speak about Cline's amendment opposed it for procedural reasons, arguing that it was not sufficiently relevant to the legislation, not that they personally disagreed with its contents.", "So the meme shared widely in February and March 2021 constituted a poor description of what happened to Cline's amendment. It claimed that:", "\"Judiciary Committee just offered an amendment that requires ICE be notified when an illegal immigrant tries to purchase a firearm[.] Dems voted NO[.] So the Dems just admitted they have no problem with people having guns[,] as long as they are not American citizens that are working class.\"", "That's not what happened. The Democrats on the committee dismissed Cline's appeal against the chairman's ruling that his amendment was not sufficiently relevant to the legislation to be in order. They never voted on the substance of the amendment itself, so the claim that their vote meant they \"admitted they have no problem with people having guns[,] as long as they are not American citizens that are working class,\" is not supported by the evidence.", "The next amendment in question was put forward a few hours later by U.S. Rep. Greg Steube, a Republican from Florida. The debate on that proposal can be viewed below. Steube introduced his amendment by claiming, as Cline did, that it was the same as H.R. 4343, which Democrats had proposed in 2017. He said his amendment \"takes H.R. 4343\" and \"puts that exact language\" into H.R. 8. That was misleading, since Steube's motion also added the requirement that, where an \"undocumented immigrant\" fails a NICS background check, ICE must be notified.", "U.S. Rep. Matt Gaetz, a Republican from Florida, tweeted out what appeared to be a copy of Steube's amendment:", "Nadler read Steube's amendment, then asked him to withdraw it so that it could be considered more carefully before being put to a vote. The chairman expressed no opposition to the substance of the amendment and, in fact, said: \"This looks, at first glance, like an amendment we might want to accept or work with.\"", "However, Steube refused to withdraw the amendment. Nadler advised that, \"There may not be a good reason not to accept it, I'm just not prepared to do it without having taken a good look at it.\" Steube then again falsely claimed that his amendment was \"exactly the language\" from H.R. 4343. Nadler again insisted: \"I am not opposed to it at this point, I may not be opposed to it, we may support it, but we do want to take a hard look at it.\"", "After some contentious back and forth, largely concerned with the extent to which Steube's amendment differed from H.R. 4343, the committee ultimately voted, along party lines, against the amendment.", "No Democratic member articulated opposition to the substance of Steube's ICE proposal, and some even expressed support for it, in principle. For example, U.S. Rep. Zoe Lofgren of California said: \"My initial reaction was 'I would like to accept this,' but we want to make sure how it fits in in the whole scheme of things.\"", "Furthermore, U.S. Rep. David Cicilline of Rhode Island, who introduced H.R. 4343 back in 2017, objected to Steube's claim that the ICE amendment was the \"exact same language\" as H.R. 4343.", "In response, Steube asked Cicilline \"Are you saying that if somebody is illegally trying to purchase a firearm, that you do not want ICE to be notified of that attempt of an illegal purchase of a firearm by an illegal immigrant?\" Cicilline replied unequivocally, \"No, I'm not saying that. What I'm saying is you ought not represent that I've introduced a piece of legislation, then you add a provision that you don't share with the committee, and you represent that it's the bill we've already passed. It is not. Facts matter.\"", "So when it comes to the Steube amendment, the meme is again inaccurate. Democrats on the committee voted against it because, in their view, it was introduced too late for them to give it full and proper consideration. The Democratic chairman explicitly and repeatedly said he was not opposed to the substance of the amendment, and might ultimately end up supporting it. Another Democratic member (Lofgren) said her initial response to reading the amendment was positive, and yet another Democratic member (Cicilline) was asked whether he was opposed to the substance of Steube's ICE proposal, and clearly and explicitly said \"No, I'm not saying that.\"", "Therefore, when it comes to the Steube amendment, the claim in the meme that Democrats had \"admitted they have no problem with people having guns[,] as long as they are not American citizens that are working class,\" is again not supported by the evidence.", "Two weeks later on Feb. 27, U.S. Rep. Doug Collins, a Republican from Georgia, proposed inserting the ICE notification requirement into H.R. 8. That proposal was adopted, with 26 Democrats joining their Republican colleagues.", "The whole bill, with the ICE notification requirement now included, was then put to a vote. All but eight Republican Congress members voted against the bill, even though by then it included the requirement that ICE be notified whenever an \"undocumented immigrant\" failed a background check. All but two Democrats voted for H.R. 8, and the bill was passed, before being introduced in the Senate where it failed to progress any further.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]