["Multiple online posts, for example this one published to Facebook March 17, 2019, and shared more than 650 times since, contain the false image.", "It purports to show a Hindi-language tweet from prominent Indian businessman Ratan Tata, the 81-year-old chairman emeritus of major conglomerate Tata Sons. Here is his profile on the Tata website.", "Translated to English, the purported tweet says: “No one can save that country from being ruined where the death of 65 of its soldiers increases the popularity of its Prime Minister.”", "The same or similar images containing the false tweet have been published elsewhere on Facebook, for example here and here, where it has been shared nearly 600 times since being published March 26, 2019, and on Twitter for example here.", "Below is a screenshot of one of the misleading posts:", "The image also includes Hindi text above the purported tweet that says, when translated to English: “Country's industrialist tweeted. Look at India's future through his thinking!”", "Tata’s name, profile picture, and a blue ‘verified’ tick appear in the false image, along with figures suggesting the tweet was shared thousands of times.", "His Twitter handle is given in the false post as “@Rntata200”. However a search on Twitter for Tata’s official account here reveals that his verified handle is actually “@RNTata2000”.", "The image below compares the false post (L) with a screenshot of Tata’s verified account (R), with the two different handles highlighted in red by AFP:", "The date given on the purported tweet is March 13, 2019. There is no record of Tata posting any tweet from his verified account on that date and all his recent tweets are in English, not Hindi.", "Tata did post a tweet on February 26, 2019, praising Modi’s leadership and hailing the Indian Air Force (IAF) for carrying out air strikes in Pakistan. Here is an AFP report on the air strikes also dated February 26.", "The tweet, embedded below, says: \"We congratulate the PM and the IAF for the successful air strikes on the terrorist training camps which Pakistan has claimed never existed! India is proud of the firm action taken in retaliation to the suicide attack on our soldiers a few days ago”.", "We congratulate the PM and the IAF for the successful air strikes on the terrorist training camps which Pakistan has claimed never existed! India is proud of the firm action taken in retaliation to the suicide attack on our soldiers a few days ago. @narendramodi", "There is a Twitter account with the handle @rntata200 here, but it is not verified and only has 27 followers whereas Tata’s official account has 7.6 million followers.", "The account’s only post is dated November 24, 2011, and is not the same as the one circulated in the false Facebook post. It says: “Cyrus P Mistry will be the next chairman of the TATA Group starting from december 2012. cyruspmistry.com”. The URL does not lead to a live website.", "Below is a screenshot of the Twitter account @rntata200:", "Debasis Ray, head of public affairs for the Tata Trusts in Mumbai, told AFP in an email dated April 8, 2019: “Mr. Ratan N. Tata’s twitter handle is @RNTata2000. You will have noticed that the post in question is from a handle -- @RnTata200.", "“It is a fake post from a fake handle.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]