["“Grand Station Hotel in Jeppestown burnt down by rampaging foreign Nationals. Built in 1912. It was declared a national monument. Uncontrolled violence and not a single arrest,” reads the caption on an August 3 Facebook post, which has been shared more than 1,300 times. We’ve archived the post here.", "Several more posts on social media similarly claimed the fire was started by “rampaging foreign nationals”, including here and here.", "But Nana Radebe, spokeswoman for emergency medical services (EMS) in Johannesburg, said there was no truth to this rumour. This was not arson, and initial investigations suggest the blaze was sparked by a faulty stove.", "“The fire was caused by stove elements,'' Radebe told AFP by telephone, adding that the appliance had exploded.", "Preliminary investigations suggest the fire had \"nothing to do with foreign nationals”, she said.", "“Our preliminary investigations, which are done by the City of Joburg EMS, said that it's the stove.\"", "Local reports here and here say the Grand Station Hotel housed numerous shops and nearly 40 residential rooms.", "The central business district of Johannesburg has been experiencing unrest since last week when protesters, reported to be foreign nationals, attacked the police during an operation against hawkers selling counterfeit goods and people illegally occupying some buildings -- see these tweets from David Makhura, premier of Gauteng province, and Johannesburg police chief David Tembe.", "Some foreign nationals who sell counterfeit goods and occupy buildings illegally in the Joburg CBD attacked our police with bottles and petrol bombs. This despicable crime against our state will never be tolerated. #OkaeMolao will respond in full force to defend rule of law", "⚠️ALERT⚠️\n\t\t\tRiots in the Joburg CBD. Foreign Nationals attacking police officials. Jeppe Str is closed off at Troye, Delvers & Von Wielligh. @JoburgMPD deployed. Traffic is congested in the InnerCity due to vehicles being diverted. Avoid #JHBTraffic pic.twitter.com/0aaT5ViQCh", "South Africa has suffered years of social tensions over immigration, with foreigners from other African countries finding themselves a repeated target of anger over unemployment, accused of taking up scarce jobs.", "AFP Fact Check has debunked various false social media posts which touch on these tensions, including here and here.", "The accusation that foreign nationals were responsible for the fire isn’t the only incorrect claim in the Facebook post.", "The post says the hotel was built in 1912. In fact, it was completed 16 years earlier in 1896 “to serve miners from the nearby Wolhunter mine”, according to the Heritage Register and this Johannesburg history blog.", "The Facebook post also says the site was declared a national monument, which is also not true. However, the building is protected by Section 34 of the National Heritage Resources Act. This states that \"no person may alter or demolish any structure or part of a structure which is older than 60 years without a permit issued by the relevant provincial heritage resources authority\".", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]