["A photo supposedly of a man urinating in front of a wall painted with murals of US President Donald Trump and Prime Minister Narendra Modi has been shared on social media. Twitter user Santosh Addagulla posted the image with the message, “Can’t believe my eyes”. The painting is part of the preparation for Trump’s visit to Ahmedabad on February 24, where Gujarat will be reportedly spending around Rs 80 crore for beautification and renovation of the city.", "Congress national social media coordinator Gaurav Pandhi posted an image of the same wall and exclaimed, “OMG! Is this for real?”. The wall is supposedly painted with the text, “यहां पेशाब करना मना है….यहां ना थूंके (Urinating is prohibited here….spitting is prohibited here -translated)”.", "Congress’s Salman Nizami posted two photos – an image of the same wall shot from a different angle and a picture of slum dwelling – with a message saying, “Parde ke peeche kya hai? Parde ke peeche…..! (What is behind the curtain? Behind the curtain -translated)”. His tweet has garnered close to 1,300 retweets so far.", "Alt News will fact-check the three images separately.", "Image 1: Morphed", "A Google reverse image search revealed that the image has been morphed. We found the same photograph in an article by American media outlet Los Angeles Times published on February 18, 2020. The outlet has credited the original photograph to news agency Associated Press, according to which the photograph was shot on February 18, 2020.", "As seen in the comparison below, the man in the viral image has been morphed into the photograph. It is noteworthy that one can spot the shadow of a tree in the image but there is no shadow of the man in the photoshopped image.", "Moreover, fact-checking outlet SMHoaxSlayer found an eight-year-old video from which a screengrab of the man urinating near a wall was possibly lifted and later photoshopped into the image of a newly-painted wall in Ahmedabad. The video is claimed to be from Delhi.", "Image 2: Morphed text", "From the original PTI photograph, it is evident that the text -‘spitting and urinating is prohibited here’- was later morphed into the viral image.", "Image 3: Old photo possibly from Mumbai", "With a Google reverse image search, Alt News was able to trace the image as far back as January 2008. The image was shared along with a blog post published on January 18, 2008. It is captioned, “Slum in Mumbai, India”. While Alt News was unable to independently verify if the image is from Mumbai, it is certainly old.", "Therefore, social media users and several Congress office-bearers shared morphed images of a wall painted ahead of US President Donald Trump’s visit to Ahmedabad, Gujarat.", "[Update: A video, with reference to a finding by SMHoaxSlayer, was added to the article on February 21, 2020.]", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]