["As businesses across the countryboard up their stores ahead of Election Day out of concern for possible violence, social media posts have emerged claiming Democratic vice presidential nominee Kamala Harris defended looting.", "\"KAMALA HARRIS says Looters are just feeding their hungry kids?\" reads an Oct. 28 Facebook post that has been shared over 1,800 times. \"I didn't know they could eat SHOES, WASHING MACHINES, and TV's??\"", "Similar versions of the claim have been posted to Facebook and Twitter.", "USA TODAY reached out to the users for comment on the source of the quote.", "Fact check: False Kamala Harris claim uses image from 2019 trip to Iowa", "There is no evidence that Harris has ever said \"looters are just feeding their hungry kids.\"", "A search for the quote on Harris' official campaign Twitter and Facebook page comes up with no results, nor does it appear on Politiwoops, a database of deleted tweets from politicians run by ProPublica.", "Harris' remarks at her recent campaign stops have focused on encouraging early voting and addressing climate change and federal assistance, according to reporting by the USA TODAY Network.", "There are no news reports of Harris saying people loot to feed hungry children. Chris Harris, Kamala Harris' communications director, told Check Your Fact that it is \"not a real quote.\"", "USA TODAY reported that Harris has previously said protests would not stop, however, she has condemned acts of violence, including looting.", "Fact check:Kamala Harris said protests aren't going to stop, but condemns violence", "Most recently, Harris and Democratic presidential nominee Joe Biden released a joint statement Oct. 27 following the death of Walter Wallace Jr., a Black man killed by Philadelphia police Oct. 26.", "\"No amount of anger at the very real injustices in our society excuses violence. Attacking police officers and vandalizing small businesses, which are already struggling during a pandemic, does not bend the moral arc of the universe closer to justice,\" the two Democrats said in the statement.", "Biden and Harris went on to call looting \"not a protest'' but instead a \"crime\" that \"draws attention away from the real tragedy of a life cut short.\"", "Harris also condemned looting in August following protests over the shooting of Jacob Blake in Kenosha, Wisconsin.", "\"We must always defend peaceful protest and peaceful protesters,\" Harris said. \"We should not confuse them with those looting and committing acts of violence.\"", "Fact check: Kamala Harris didn't break electioneering laws with a visit to the polls in Ohio", "There is no evidence or reports that Harris ever said looters are just feeding their hungry kids. Harris and Biden have both condemned looting and acts of violence. We rate this claim FALSE, because it is not supported by our research.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]