["By Saranac Hale Spencer", "Posted on November 16, 2017", "Q: Did President Donald Trump shut down a service dog training program for veterans?", "A: No. Walter Reed National Military Medical Center ended its contract with the program and told us that the president was not a factor.", "Did Trump shut down the Dogs for Wounded Warriors Program (and did he do it on Veteran’s Day)? I found this on Facebook.", "The Walter Reed National Military Medical Center has ended its partnership with a nonprofit organization that pairs service dogs with veterans. It wasn’t a White House decision.", "Nevertheless, a number of similarly designed websites recently published a story with the headline: “Trump Abruptly Shuts Down Dogs for Wounded Warriors Program, Leaving Vets High and Dry on Veteran’s Day!”", "Facebook users flagged the story as potentially false, and several readers asked us about it. The headline wrongly blames President Donald Trump for the canceled contract.", "The Warrior Canine Connection has indeed vacated its offices at Walter Reed and the Fort Belvoir Community Hospital after the medical center sent a stop-work order to MD Consulting, the primary contractor for the WCC. The order was sent on Oct. 27, Sandy Dean, a Walter Reed spokeswoman, told FactCheck.org.", "That means that the order was issued two weeks before Veterans Day, not on Veterans Day, as the false headline suggests.", "Warrior Canine Connection had worked with Walter Reed since 2009, and the organization’s contract with the military hospital was scheduled to go through 2019, Dean said.", "“We review our programs from time to time,” she said, and the medical center decided to “restructure the contract to enhance oversight of patient care.” She declined to elaborate, except to say that the decision to send the stop-work order was not influenced in any way by the president.", "In April, a military contract officer submitted a letter complaining about the condition of the dogs from Warrior Canine Connection, alleging that several dogs had appeared to be sick. In response, the organization invited a veterinarian to evaluate its facility and its animals. Her report, which Warrior Canine Connection provided to us, found that there were no significant issues.", "Walter Reed has an internal service dog program that is still in effect, Dean told us.", "Veterans with post-traumatic stress disorder or traumatic brain injuries help train golden retrievers and Labrador retrievers as service dogs that are then placed with disabled veterans through the Warrior Canine Connection. The dog training program’s effectiveness had been studied by the Uniformed Services University of Health Sciences.", "WCC, which is based in Boyds, Maryland, will continue to work with a Veterans Affairs’ medical center in Menlo Park, California, Rick Yount, the Warrior Canine Connection executive director, told FactCheck.org.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Dean, Sandy, spokeswoman, Walter Reed National Military Medical Center. Interview with FactCheck.org. 14 Nov 2017.", "“Trump Abruptly Shuts Down Dogs for Wounded Warriors Program, Leaving Vets High and Dry on Veteran’s Day!” Thepoliticalvoice.com. 11 Nov 2017.", "Warrior Canine Connection. Form 990. 16 Nov 2016.", "Yount, Rick. “Warrior Canine Connection.” Written Testimony before the House of Representatives Committee on Veteran’s Affairs Subcommittee on Health. 14 Jul 2015.", "Ryan, Kate. “Letter details complaints with program that pairs service dogs with vets.” WTOP.com. 11 Nov 2017.", "Porter, Claire. Report on the facilities at the Warrior Canine Connection. 26 Apr 2017.", "Congressionally Directed Medical Research Programs. “Is Training Service Dogs a Potential PTSD Therapy?” 26 Jun 2015.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]