["About this rating", "Mashur Abdallah Ahmed al-Sabri was among nine detainees transferred from Guantánamo Bay into Saudi Arabia's custody in April 2016; the prison's review board recommended the transfer in April 2015.", "President Obama had no hand in the selection of detainees to be transferred nor in al-Sabri's specific transfer; al-Sabri was not widely named as party to the USS Cole attack; al-Sabri's connection with the USS Cole attack was tangential, not direct; an individual believed to be directly linked with the attack was charged in a 2011 tribunal and remained at Gitmo.", "On 2 May 2016 the web site FrontPage Mag published an article reporting that President Obama freed a \"[USS] Cole cell terrorist,\" referencing the 12 October 2000 USS Cole attack during which 17 American servicemen died in Yemen:", "Walid bin Attash, a planner of the USS Cole bombing and who also played a role in the 9/11 attack, is still at Gitmo. His trial continues to drag on while he and his lawyers play games. Rahim Hussein al-Nashiri, another of the planners, is still awaiting trial. But Mashur Abdallah Ahmed al Sabri, one of the members of the USS Cole cell, has already been released by Barack Obama from Guantanamo Bay.", "Sabri was rated as a high risk terrorist who is ”is likely to pose a threat to the US, its interests, and allies”, but that was no obstacle for Obama who had already fired one Secretary of Defense for being slow to free dangerous Al Qaeda terrorists and was browbeating his latest appointee over the same issue.", "The very paperwork that was used as the basis for the decision to free Sabri describes him as “a member of a Yemeni al-Qaida cell directly involved with the USS Cole attack”. This cell “conducted surveillance” on the targeted vessel and “prepared explosives for the bombing”. Sabri had been arrested in Yemen for his involvement in the attack before he managed to make his way to Afghanistan.", "Al-Sabri was one of several Guantánamo Bay prisoners transferred to Saudi Arabia in a widely reported April 2016 negotiated deal with the country. A 16 April 2016 article did not specifically describe al-Sabri as linked to the USS Cole attack:", "US officials on Saturday described the nine [transferred] detainees, all Yemenis, as possessing close family ties to Saudi Arabia. Some, one official said, are “practically Saudis”.", "The transfer puts the residual Guantánamo detainee population at 80, the lowest it has been in its 14-year history.", "The transfer also clears another statistical milestone for the administration. There are now more detainees approved to leave Guantánamo, 26, than there are so-called “forever detainees”, the term lawyers use to describe those whom the administration has insufficient evidence to charge but claims are too dangerous to release.", "One of the detainees, Mashur Abdullah Muqbil Ahmed al-Sabri, was cleared for transfer by the administration’s quasi-parole board for Guantánamo Bay detainees in April 2015. The other eight were cleared in 2010 by a multi-agency review early in the Obama administration.", "Aside from al-Sabri and Ba Odah, the other men released on Saturday to Saudi Arabia are Ahmed Umar Abdullah al-Hikimi, Abdul Rahman Mohammed Saleh Nasir, Ali Yahya Mahdi al-Raimi, Muhammed Abdullah Muhammed al-Hamiri, Ahmed Yaslam Said Kuman, Abd al Rahman al-Qyati, and Mansour Muhammed Ali al-Qatta.", "Before his transfer in mid-April 2016, little was written about al-Sabri or the reasons for which he was detained in the controversial prison. A Google search restricted to on or before 1 February 2016 yielded just three hits -- all of which were misdated items concerning his transfer to Saudi Arabia. If al-Sabri was a major name linked with the USS Cole investigation, that was not reported between the October 2000 attack and his April 2016 transfer out of Guantanamo Bay.", "Other (and more credible) reporting did not link al-Sabri to the USS Cole bombing:", "The Defense Department expressed gratitude to the kingdom [of Saudi Arabia] in a statement on Saturday.", "\"The United States is grateful to the government of the Kingdom of Saudi Arabia for its humanitarian gesture and willingness to support ongoing U.S. efforts to close the Guantanamo Bay detention facility,\" the statement said.", "The Department of Defense identified the men as Ahmed Umar Abdullah Al-Hikimi, Abdul Rahman Mohammed Saleh Nasir, Ali Yahya Mahdi Al-Raimi, Tariq Ali Abdullah Ahmed Ba Odah, Muhammed Abdullah Muhammed Al-Hamiri, Ahmed Yaslam Said Kuman, Abd al Rahman Al-Qyati, Mansour Muhammed Ali Al-Qatta and Mashur Abdullah Muqbil Ahmed Al-Sabri.", "Al-Sabri was not among the most notable or notorious prisoners transferred to Saudi Arabia in April 2016. Extensive information about him was available via a New York Times project called \"The Guantánamo Docket,\" which includes detailed files on each detainee. Al-Sabri's file contained some mentions of the USS Cole bombing, but primarily tangential ones:", "Recommendation for Continued Detention Under DoD Control (CD) for ISN US9YM-000324DP (S) has demonstrated support for the hostilities of other detainees. Detainee was a member of a Yemeni al-Qaida cell directly involved with the USS COLE attack. Members of this cell conducted surveillance on the USS COLE and prepared explosives for the bombing. Detainee was recruited and facilitated through the al-Qaida network and traveled to Afghanistan (AF), where he received advanced training at al-Qaida facilities. Detainee is assessed to have served as a guesthouse facilitator (a position of trust and authority), associated with senior al-Qaida members, and probably swore bayat (oath of allegiance) to Usama Bin Laden (UBL). Detainee participated in combat in Afghanistan. [ADDITIONAL INFORMATION ABOUT THIS DETAINEE IS AVAILABLE IN AN SCI SUPPLEMENT.] JTF-GTMO determined this detainee to be o o o A HIGH risk, as he is likely to pose a threat to the US, its interests, and allies A LOW threat from a detention perspective Of MEDIUM intelligence value[.]", "That file didn't definitively link al-Sabri to the USS Cole bombing, and noted that intelligence officials considered him an unreliable source:", "Reporting indicates detainee had more of a leadership role than detainee is willing to admit. Detainee continues to downplay his significance and affiliations with other alQaida members. Detainee denies ever attending a terrorist training camp, but his name is included on applications for terrorist training. Although detainee has provided unique information about his associates who were linked to the USS COLE attack, he denies any involvement, contrary to reporting from other sources. He sometimes has claimed he was born in Taiz, YM and other times in Mecca, SA, demonstrating his willingness to mislead US intelligence officials on even the most basic detail.", "While closing the Guantánamo Bay detention camp was an initial and ongoing aim of the Obama administration, President Obama was not directly involved with the details of prisoner transfers. That is the function of a specific parole board-like committee, detailed in other pages about controversial Gitmo transfers.", "The decision to transfer al-Sabri was explained in a 17 April 2015 Periodic Review Board document [PDF], detailing a determination made one year before the April 2016 transfers:", "The excerpt above described the prisoner as having a \"low level of training\" with respect to al-Qaeda activities, noted he \"[renounced] extremist ideology,\" and affirmed that he was neither a leader nor mastermind for either al-Qaeda or the Taliban. The New York Times mentioned al-Sabri in passing in April 2016 during a story about the mechanics of the Saudi transfer:", "... finding places to transfer the large number of lower-level Yemeni detainees there has been a significant obstacle. American officials have been reluctant to repatriate them because Yemen is chaotic and has an active affiliate of Al Qaeda.", "But Saudi Arabia, which shares a border with Yemen, has a stronger government and security. It also operates a rehabilitation program for Saudis who have drifted into militant Islamism. The program tries to reverse their radicalization and help them reintegrate into peaceful society. It enlists their relatives to help and has a record of reducing — though not eliminating — the risk of recidivism, officials have said ... When Mr. Obama became president in 2009 and vowed to close the prison at the Guantánamo military base in Cuba, there were 242 detainees, 99 of them Yemenis. In separate trips to Saudi Arabia that spring, John O. Brennan, then Mr. Obama’s top counterterrorism adviser, and Robert M. Gates, who was the defense secretary, again raised the idea, according to another leaked cable and news reports. They were again rebuffed.", "Later in October [2-16], [Secretary of State John] Kerry visited Saudi Arabia again, but was told only that the Interior Ministry was still looking at the [prisoner transfer] request, officials said. But a positive sign came from Brian Neff, a lawyer for one of the Yemeni men, Mashur al Sabri.", "After a parolelike board approved Mr. Sabri’s transfer last April, Mr. Neff drafted a petition for his family to send to the Saudi government, asking it to take Mr. Sabri. In October, his relatives told Mr. Neff that Saudi officials had visited them to study whether that plan would work.", "Finally, a separate Guantánamo Bay prisoner was identified as the \"mastermind\" of the attack in a 2011 article. That prisoner remains in the detention facility:", "Dressed in prison clothes, Abd al-Rahim al-Nashiri, 46, appeared before the court for the first time since his arrest in 2002, smiling several times at the judge. It is the first such case to be held since US President Barack Obama reversed course and ordered the controversial military trials to resume.", "The charges against Nashiri allege he was head \"of the planning and preparation for the attack\" on the USS Cole on October 12, 2000, which killed 17 sailors and wounded 40 more.", "Al-Nashiri was charged with war crimes and has not been released from the site. It is possible that FrontPage Mag confused the newly-transferred al-Sabri with an individual with a similar name, but that person was not described as a current or former detainee. Unlike al-Sabri, al-Nashiri's file detailed strong links to the USS Cole attack.", "Al-Sabri was among nine prisoners transferred from Guantánamo Bay into Saudi Arabian custody in April 2016; al-Sabri's transfer was recommended by the PRB in April 2015. President Obama did not have any hand in the transfer of al-Sabri or any other specific prisoner, as that task remains the responsibility of the PRB. While al-Sabri's file mentioned a potential link to groups involved in the USS Cole attack, his own involvement was tenuous to nonexistent. Al-Sabri was not expressly \"freed,\" but released into custody in Saudi Arabia for further rehabilitation under a long-negotiated plan to empty the site of prisoners.", "Ackerman, Spencer.   \"Nine More Guantánamo Bay Prisoners Released As Population Dwindles To 80.\"\r\nThe Guardian.   16 April 2016.", "Almasy, Steve and Tom Kludt.   \"Nine Guantanamo Detainees Transferred To Saudi Arabia.\"\r\nCNN.   16 April 2016.", "Hussain, Murtaza.   \"Prisoner's Letters Document Tragedy And Hope Inside Guantanamo.\"\r\nThe Intercept.   18 April 2016.", "Savage, Charlie.   \"9 Guantánamo Prisoners From Yemen Are Sent To Saudi Arabia.\"\r\nThe New York Times.   16 April 2016.", "The Telegraph.   \"USS Cole Bombing 'Mastermind' Arraigned In Guantánamo.\"\r\n09 November 2011.", "The New York Times.   \"The Guantanamo Docket: Mashur Abdallah Muqbil Ahmed al Sabri.\"\r\n(Undated.)", "The New York Times.   \"The Guantanamo Docket: Abd al Rahim al Nashiri.\"\r\n(Undated.)", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]