["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Earlier this month, Rep. Vicky Hartzler, R-Mo., co-signed a letter urging President Donald Trump to bring drug production back to the U.S. and out of China.", "She’s been a consistent voice against Chinese-made pharmaceutical ingredients, co-introducing a bill last year that would require the Department of Defense to only buy U.S.-made medicine. She later praised action by Trump in March.", "On March 18, Trump issued an executive order and invoked the Defense Production Act. The law allows the government greater control over private companies in the name of national defense. Enacted in 1950, the law has been used thousands of times each year for everything from missiles to body armor, for the U.S.-Mexico border wall. In some cases, it gives the government priority on an order, say, for face masks. The act allowed Trump to order General Motors to make ventilators.", "In a news release two days after Trump’s order, Hartzler said she supported the move and would keep pressing the administration to use the DPA authority \"to ensure medical ingredients and raw materials for medications are produced in the United States.\"", "\"Right now, China controls 80% of all ingredients and raw materials going into our generic prescription drugs, allowing them the ability to cut off that supply chain in a moment of conflict,\" she wrote.", "We decided to look into it because 80% is a big chunk of our prescription drug ingredients.", "It’s a statistic that has come up in other places before, though in different ways. Last year, Senate Finance Chairman Chuck Grassley wrote that \"80% of (active pharmaceutical ingredients) are produced abroad, the majority in China and India.\"", "More recently, in 2020, a similar statistic has come up in ABC News, AP News, The Hill and Fox News.", "The earliest use of the statistic we could find was from a 1998 report by the Government Accountability Office, but it didn’t say the ingredients all came from China.", "So, what’s right, and how applicable is the figure today?", "First, we’ll define the materials Hartzler referred to:", "Raw materials are chemical compounds that are used to make other parts of medicine. While they can be used for other things, such as for packaging, raw materials can be mixed to create ingredients for prescription drugs, ranging from binding ingredients to active pharmaceutical ingredients.", "Active pharmaceutical ingredients are then the active and primary parts of prescription drugs, allowing the drug to do what it needs to do. So, for example, a generic painkiller uses ibuprofen. The ibuprofen is what ends up stopping the pain, so it’s the active pharmaceutical ingredient, but other ingredients are used in the pill, too.", "Hartzler’s team directed us to the 2019 U.S.-China Economic Security Review Commission Report to Congress. The report says a \"substantial portion of U.S. generic drug imports\" is imported.", "So, of this substantial portion, how many ingredients and raw materials come from China? That 2019 report didn’t say.", "In a 2010 project from the NSD Bio Group to the U.S. China Economic and Security Review Commission, \"the U.S. imports an estimated 80% of the raw ingredients contained in both products manufactured, sold and consumed in this country.\" The statistic, according to the report, was first generated by the Governmental Accountability Office in 1998.", "Does it mention what percentage of the raw ingredients come from China alone? No. It simply says that the raw ingredients are imported. Raw materials are a muddy area, too.", "The 2019 Review Commission Report gives many citations with an 80% figure, but only one refers to medicine-making active ingredients. Raw materials are mentioned in the report, but no statistics are given. And the report focuses on active pharmaceutical ingredients, not general ones.", "\"The United States sources 80% of its (active pharmaceutical ingredients) from overseas and a substantial portion of U.S. generic drug imports come either directly from China or from third countries like India that use (active pharmaceutical ingredients) sourced from China,\" the 2019 Review Commission Report says.", "So, a lot of generic drug imports are from China, but 80% of active ingredients are \"from overseas.\" We can agree that most of the active ingredients come from China; even these places overseas sometimes import the active ingredients from there. The report even says that India \"relies on\" China for 80% of India’s active pharmaceutical ingredients.", "And how much does the U.S. rely on? Again, that’s hard to say. The FDA does not track the distribution of ingredients, and drug companies do not have to cite where the active ingredients in their drugs came from.", "In 2019, Janet Woodcock, M.D., the director of the Center for Drug Evaluation and Research , a branch of the FDA, testified about protecting the U.S. medical supply chains. Woodcock said the FDA does \"not know whether Chinese facilities are actually producing APIs, how much they are producing, or where the APIs they are producing are being distributed worldwide, including in the United States.\"", "Woodcock said the FDA does \"not currently know whether (active pharmaceutical ingredient) manufacturing facilities are actually producing the drug, or in what volume.\" This is because facilities do not have to report how many active pharmaceutical ingredients they are producing.", "Tracking active pharmaceutical ingredients can be tricky; a country can create these ingredients and export them for the production of the finished drug. According to the testimony, making active pharmaceutical ingredients in India makes it anywhere from 30% to 40% cheaper for U.S. companies. A product may stop in more than one place to create a finalized product.", "In the testimony, Woodcock provided a breakdown of where the active pharmaceutical ingredient facilities are that contribute to the U.S. pharmaceutical market. The number of registered facilities that make these ingredients in China \"more than doubled between 2010 and 2019.\"", "By country, in 2019:", "Thirteen percent of the active pharmaceutical ingredient manufacturing facilities are from China.", "About 18% of these facilities are in India.", "And 28% are in the U.S.", "And in terms of prescription drugs, the World Health Organization lists 461 drugs as part of their Essential Medicine List, according to testimony. These meet the \"most important needs in a health system\" and include \"anesthetic, antibacterial, antidepressant, antiviral, cardiovascular, anti-diabetic, and gastrointestinal agents.\"", "The percentages of facilities that make active pharmaceutical ingredients for these drugs are fairly similar to that of the general international ones. Fifteen percent of active pharmaceutical ingredients manufacturing facilities for these essential medicines are from China. The U.S. has about 21%.", "Again, in both the general and essential-medicine active pharmaceutical ingredient facilities, this does not indicate how many ingredients are produced. Regardless, the U.S. still has more facilities than China making these ingredients for the American market.", "The 2017 FDA at a Glance confirms, saying \"approximately 80% of active pharmaceutical ingredients manufacturers are located outside of the U.S.\"", "Hartzler said, \"Right now, China controls 80% of all ingredients and raw materials going into our generic prescription drug.\"", "While a large part may come from China, putting it all at 80% does not add up.", "The 2019 Commission Report and the testimony say 80% of active ingredients are from overseas. The government reports credit the figure for all imports of raw materials, and the GAO says active ingredients are made in more than 150 countries.", "We rate this statement as Mostly False.", "Chemical and Engineering News, \"A whole new world for rare earths,\" Aug. 28, 2017", "\"2019 REPORT TO CONGRESS of the U.S.-CHINA ECONOMIC AND SECURITY REVIEW COMMISSION,\" accessed May 4, 2020", "Reason Magazine, \"Why You Shouldn't Trust Anyone Who Claims 80 Percent of America's Drugs Come From China,\" April 6, 2020", "Rep. Vicky Hartzler’s office, \"Hartzler Supports President Trump on Defense Production Act,\" March 20, 2020", "USCC, \"Testimony of Rosemary Gibson, Senior Advisor, The Hastings Center and Author Before the U.S.-China Economic and Security Review Commission,\" July 31, 2019", "USCC, \"Potential Health & Safety Impacts from Pharmaceuticals and Supplements Containing Chinese-Sourced Raw Ingredients Prepared for U.S. China Economic and Security Review Commission,\" accessed May 14, 2020", "RegisterCorp, \"U.S. FDA Drug Definitions,\" accessed May 12, 2020", "Katsura Chemical, \"What is an API?\" accessed May 11, 2020", "Food and Drug Administration, \"FDA at a Glance,\" Accessed May 10, 2020", "Government Accountability Office, \"FDA Has Improved Its Foreign Drug Inspection Program, but Needs to Assess the Effectiveness and Staffing of Its Foreign Offices,\" accessed May 5, 2020", "Food and Drug Administration, \"Safeguarding Pharmaceutical Supply Chains in a Global Economy,\" Oct. 30, 2019", "\"Testimony of Rosemary Gibson Before the Senate Committee on Small Business and Entrepreneurship The Coronavirus and America’s Small Business Supply Chain,\"  March 12, 2020", "Lawfare, \"What’s in Trump’s Executive Order on the Defense Production Act?\" March 20, 2020", "Council on Foreign Relations, \"What is the Defense Production Act?\" April 29, 2020", "United States Senate Committee on Finance, \"Grassley Urges HHS, FDA to Implement Unannounced Inspections of Foreign Drug Manufacturing Facilities,\" Aug. 7, 2019", "\"HEARING EXPLORING THE GROWING U.S. RELIANCE ON CHINA'S BIOTECH AND PHARMACEUTICAL PRODUCTS HEARING BEFORE THE U.S.-CHINA ECONOMIC AND SECURITY REVIEW COMMISSION,\" July 31, 2019", "CNN, \"What is the Defense Production Act?\" March 24, 2020", "Baltimore Sun, \"80% of chemicals for U.S. prescription drugs imported GAO says safety, purity not adequately policed,\" May 3, 1998", "The Hill, \"Trump must cut our dependence on Chinese drugs — whatever it takes,\" March 27, 2020", "Fox News, \"US pharmaceutical industry aims to wrest some drug production back from China,\" March 29, 2020", "New York Times, \"Coronavirus Spurs U.S. Efforts to End China’s Chokehold on Drugs,\" March 11, 2020", "AP News, \"US reports first drug shortage tied to virus outbreak,\" Feb. 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]