["About this rating", "In October 2019, during a month celebrated annually since the 1980s as Down Syndrome Awareness Month, Snopes received inquiries about the authenticity of a quote attributed to U.S. President Donald Trump. It was shared in meme form on social media as follows:", "\"Those thought to have Down syndrome also risk being subjected to the too-often terminations of their lives before birth. Every human life possesses immeasurable value, and my Administration will continue to embrace and defend the inherent truth that all of God's children should be loved and cherished.\"", "The quote is correctly attributed. It consists of two sentences drawn from Trump's Oct. 1 presidential message on Down Syndrome Awareness Month, presented in full below:", "Presidential Message on Down Syndrome Awareness Month, 2019", "Issued on: October 1, 2019", "During Down Syndrome Awareness Month, Melania and I join in celebrating the lives and achievements of Americans with Down syndrome. We thank individuals with Down syndrome for their incredible contributions to their families, their communities, and our great Nation, and we pledge to empower them to achieve their full potential. My Administration also renews its commitment to bring attention to and a deeper understanding of the challenges these remarkable Americans face, including their struggle against discrimination. Those thought to have Down syndrome also risk being subjected to the too-often terminations of their lives before birth.", "Each year, approximately 6,000 babies are born in the United States with Down syndrome. Though these newborns will experience many challenges, American innovation and research are helping these beautiful souls lead independent, full, and happy lives. My Administration is dedicated to fostering opportunities for persons with Down syndrome, so they are better able to participate in our workforce and pursue their dreams.", "Every human life possesses immeasurable value, and my Administration will continue to embrace and defend the inherent truth that all of God’s children should be loved and cherished. This month is an important opportunity for Americans to reaffirm our commitment to creating a society that better appreciates and respects the dignity of life at all of its beautiful and miraculous stages. We must devote our efforts to ensure that the United States continues to exhibit reverence for human life—both born and unborn. Together, we can create an inclusive Nation, one where Americans with Down syndrome are embraced in schools, workplaces, and communities—one where discrimination can no longer cast a shadow of inequality.", "Our country is incredibly enriched by Americans with Down syndrome. As a Nation, we are inspired by the spirit and exuberant joy with which these treasured Americans live each day.", "According to the Centers for Disease Control (CDC), approximately 6,000 babies (1 in 700) are born in the U.S. each year with Down syndrome, a genetic condition in which a person has an extra chromosome. It affects how an infant's body and brain develop, potentially creating both mental and physical challenges for persons born with the condition.", "Prenatal screening tests performed beginning at around 10 weeks' gestation can provide an estimate of the risk of a given child being born with Down syndrome, which may then factor into a parental decision to terminate the pregnancy. According to the most recent data available, the rate at which parents choose to terminate a pregnancy after a Down syndrome diagnosis is about 68 percent in the United States. A 2015 study estimated that between 2006 and 2010, approximately 3,100 Down syndrome-related elective pregnancy terminations were performed in the U.S. annually.", "De Graaf, Ger, Buckley, Frank, and Skotko, Brian G.   \"Estimates of the Live Births, Natural Losses, and Elective Terminations with Down syndrome in the United States.\"\r\n   American Journal of Medical Genetics.   29 March 2015.", "Kasprak, Alex.   \"Has Iceland Eliminated Down Syndrome Through Abortion?\"\r\n   Snopes.com.   15 August 2017.", "Natoli, Jamie L., et al.   \"Prenatal Diagnosis of Down Syndrome: a Systematic Review of Termination Rates (1995-2011).\"\r\n   Prenatal Diagnosis.   February 2012.", "Centers for Disease Control.   \"Data and Statistics on Down Syndrome.\"\r\n   19 September 2019.", "Centers for Disease Control.   \"Facts About Down Syndrome.\"\r\n   1 November 2018.", "WhiteHouse.gov.   \"Presidential Message on Down Syndrome Awareness Month, 2019.\"\r\n   1 October 2019.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]