["The same video clip, showing a young woman visiting a mosque, has been widely shared on Facebook in Arabic, French and Italian alongside captions wrongly identifying her as ‘Miss Russia’, while various versions also exist in English.", "“Miss Russia embraces Islam. Amazing!” reads one post sharing the video, archived here, which has been viewed nearly 4,000 times.", "This version with an Arabic-language caption has racked up more than ten million views, while an Italian version has been viewed nearly 100,000 times.", "Using the video verification tool InVID, we were able to run a reverse image search of the clip’s thumbnail image.", "That led us to earlier versions of the video -- the first one we could find dated back to 2015 on a Kazakh website, YVision. According to the Russian-language caption, it shows “a Ukrainian woman from Korovorograd (who) swore her allegiance to the faith in the Islamic Cultural Centre in Kiev”.", "To help confirm the location, we compared the room seen in the background of the video with photos of the Islamic Cultural Centre in Kiev, available on Google Maps. The scenes do appear to match -- you can see the same red carpet with distinctive white stripes running across it, and the same blue banners at the top of the walls.", "We contacted the Islamic Cultural Centre, who confirmed that the woman was indeed a young Ukrainian -- not a Russian beauty queen. Her name is Yelizaveta Bakmach, and she converted to Islam in 2015.", "There was previously a case in the headlines of a Russian beauty queen converting to Islam -- Oksana Voevodina, a former “Miss Moscow”. According to media reports, Voevodina changed religion before marrying the then king of Malaysia, Sultan Muhammad V, in November 2018.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]