["The image was published in this Facebook post on January 6, 2020.", "It shows a screenshot of a cropped online news article with the headline: “Extinction Rebellion member charged with starting Green Wattle Creek bushfire”.", "Below is a screenshot of the misleading post:", "The article reads: \"A 26-year old Man from Sydney has been charged with intentionally lighting four grass and scrub fires in the state's southeast in recent days. Police will allege the man lit fires on December 15 and January 1, and th[en] two on Saturday, all around the Anderson Fire Trail, Wentworth Falls.\"", "The Green Wattle Creek bushfire is one of the many blazes that have devastated Australia in recent months. The crisis, which was exacerbated by an unprecedentedly early and intense bushfire season, has claimed at least 28 lives since September 2019, AFP reported here.", "The image of the purported article was also shared here, here, here, here, here, here, here, here and here on Facebook; and here, here and here on Twitter.", "The claim is false; authorities confirmed that no one was charged in connection to the Green Wattle Creek bushfire.", "“It doesn't look like we have any records to suggest charges for this particular fire,\" a New South Wales Police spokesperson told AFP in an email on January 15, 2020.", "A New South Wales Rural Fire Service spokesperson added in an email to AFP that \"lightning is listed as the cause\" of the fire.", "AFP also determined that the purported image of the news article was doctored.", "A Google search of the text in the article led to a this article by 7 News, an Australian news outlet, which reported on an arrest made in connection to a different bushfire.", "The article's byline, citation, timestamp, header image and photo credit are identical to those seen in the doctored image.", "Below is a screenshot comparison of the image in the misleading post (L) and the 7 News story (R):", "However, the headline and the text have been manipulated. Certain details, such as the suspect’s age and hometown and the location of the bushfires, were altered or omitted.", "Below is a comparison of the text in the misleading Facebook post (above) and the 7 News report (below):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]