["Republican U.S. Sen. Ron Johnson announced his re-election bid on May 2, 2016 at Pacur, his plastics manufacturing company in Oshkosh, Wis. (Joe Sienkiewicz photo)", "Republican U.S. Sen. Ron Johnson, who is trailing but gaining on Democratic challenger Russ Feingold in the latest poll, announced April 29, 2016 he is launching a tour of Wisconsin as part of his re-election campaign.", "A routine notice. Until this line in his news release:", "\"Ron’s statewide tour will include stops at Pacur, the Oshkosh plastics manufacturing company he started in 1979.\"", "The statement suggests the company was started only by Johnson, or at least that he was main person who launched it.", "But that seems to contradict the established history of Pacur (pronounced liked packer), and is in conflict with some of Johnson’s own statements.", "It’s long been widely reported that Johnson was there at the beginning of Pacur.", "But with analysts saying he is among the most vulnerable Senate incumbents in the November 2016 elections, did Johnson’s campaign overstate his role in starting the company?", "After all, the name Pacur comes from Pat Curler -- Johnson’s brother-in-law.", "Rewriting history", "Questions first arose when Milwaukee Journal Sentinel investigative columnist Daniel Bice reported that Johnson had rewritten his own company history on Aug. 25, 2010.", "That was less than three weeks before the GOP primary and about 10 weeks before Johnson upset Feingold, an 18-year incumbent, in the 2010 Senate election.", "For nearly nine years, Bice wrote, Pacur carried this online description of its beginning:\n\nFounded in 1977, Pacur occupies a facility constructed specifically for sheet extrusion, which provides polyester and polypropylene sheet and rollstock to converters, distributors, and end users.", "The revised description, now carrying an asterisk, said the founding occurred two years later, in 1979.", "The asterisk pointed out that Pacur had a predecessor -- Wisconsin Industrial Shipping Supplies -- that came into existence in 1977 before it was renamed and restructured in 1979.", "In other words, Pacur grew out of an existing company, Wisconsin Industrial Shipping Supplies.", "That company was owned by Curler, the brother of Johnson’s wife.", "Johnson’s statements", "Johnson’s own statements haven't always been as credit-taking as the line in the news release.", "Some examples from the 2010 campaign:", "The Journal Sentinel reported that Johnson said he began working as Pacur's accountant and co-founder in July or August of 1979. The article stated that both companies were led by Curler, and that Curler was Johnson's initial boss.", "Pacur \"was an opportunity for (Curler) to get into business for himself, and I just kind of came along for the ride as the accountant,\" Johnson said in another Journal Sentinel article.", "Johnson had been calling himself a co-founder of the company, but later acknowledged he joined several months after Pacur was established, the Associated Press reported. He started as a machine operator and accountant and eventually became its president, the article said.", "More recent statements also reinforce the idea that Johnson, who bought Pacur in 1997, didn't start the company alone.", "Johnson’s official Senate website says he started the company with Curler.", "So did a tweet Johnson sent in in March 2016.", "Defending the statement in the press release, Johnson campaign spokesman Brian Reisinger told us Johnson \"helped build Pacur into a great Wisconsin success story, and we've never said anything counter to how it all began.\"", "Our rating", "Announcing a statewide tour in his campaign for reelection, a Johnson news release said Johnson \"started\" the Pacur plastics manufacturing company he owns.", "The claim contradicts Pacur’s own company history and Johnson’s prior statements, which make it clear he helped start Pacur with his brother-in-law, who was more involved in the founding. Johnson didn't do it alone. The news release doesn’t indicate an attempt by Johnson to rewrite history, but he is responsible for his campaign statements, and this one left out important details.", "For a statement that is partially accurate but needs more information, we rate the claim Half True.", "WisPolitics.com, Ron Johnson campaign news release, April 29, 2016", "Milwaukee Journal Sentinel, \"Senate candidate makes his own history,\" Aug. 30, 2010", "Milwaukee Journal Sentinel, \"Federal grant to Pacur's predecessor hinged on 11 new jobs,\" Sept. 22, 2010", "Milwaukee Journal Sentinel, \"Johnson leads race for GOP Senate bid,\" Sept. 4, 2010", "Associated Press, \"Wisconsin Senate race pits maverick against 'rich guy,’\" Oct. 22, 2010", "U.S. Senate, Ron Johnson biography, accessed May 1, 2016", "Twitter, Ron Johnson tweet, March 22, 2016", "Email, Ron Johnson campaign spokesman Brian Reisinger, May 2, 2016", "Email, Russ Feingold campaign spokesman Michael Tyler, May 2, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]