["A mainstream news organisation in South Africa tweeted an insert on November 14, 2018 stating that “bachelors from Nquthu in northern KwaZulu-Natal face an additional burden. They're expected to pay an annual tax, imposed by the local inkosi (chief)”.", "The video, which has been viewed over 6,500 and retweeted over 100 times, explains that once a man from Nquthu turns 18, he is expected to pay this amount every year until he marries.", "Several websites used the video to produce stories as seen here, a page which says the article has been shared over 8,000 times. Other mainstream publications also used the video and credited the original news source as seen here and here. The narrative was also published through community media here and its seven sister publications.", "“The rumour that has been spreading like wild fire has it that Inkosi Ngobese is fining unmarried males in villages around Nquthu R50 a year. This has proven to be false upon investigation by KZN Cogta which oversees traditional institutions in the province,” said the KZN Department of Cooperative Governance and Traditional Affairs (Cogta) in a statement.", "Member of the Executive Council for the KZN Cogta, Nomusa Dube-Ncube is cited saying “the provincial government will not allow any practice be it traditional or modern that violates the constitution and human rights of citizens.”", "Spokesman for the KZN Cogta, Lennox Mabaso told AFP that Inkosi Ngobese has an annual household levy of 50 rand in place, that was agreed upon by the community leaders. This is not enforced among those who cannot afford to pay.", "“In terms of Zulu custom there are certain levies that are linked to customary practices that are being paid however these must be properly regulated and cannot be directed or violate any demographic such as unmarried males as this will be a total violation of the South African constitution.”", "Mabaso says the money collected is for administration purposes and that it is audited. The money is deposited into a trust account and the community gathers to decide how it will be spent. “It’s not money that is going to Inkosi which is what is being portrayed.”", "Mabaso asks that those who claim to have been “bachelor taxed” come forward with evidence of this payment.", "“I’ve been working at this office for 15 years, the bachelor tax has never existed - it is a figment of imagination.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]