["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "After an Austin mayoral candidate proposed to permanently cut homeowner taxes, City Council Member Mike Martinez said the idea wouldn’t benefit most residents.", "Martinez, also a candidate for mayor, reacted after attorney Steve Adler said the council could have created a city homestead exemption, or tax break for homeowners, years before. \"We need to act,\" Adler said Aug. 4, 2014, according to an Austin American-Statesman news story that day.", "Adler called for a 20 percent exemption--as in a 20 percent cut to each home’s taxable value--at a city-estimated cost of $36 million a year.", "Martinez and a third mayoral aspirant, City Council Member Sheryl Cole, said Adler’s idea revealed his lack of governing experience. Martinez said: \"This would be $36 million that would benefit the wealthiest Austinites the most. The majority of Austinites rent and would see no financial benefit at all.\"", "We wondered about Martinez’s statement that most Austin residents rent, rather than own, the places they live. We did not delve into his contention that renters wouldn’t benefit from Adler’s proposal.", "To our inquiry, a Martinez campaign spokesman, Nick Hudson, pointed out a July 31, 2014, city report including an illustration stating that 183,000 of the city’s 331,000 households in 2012 (55 percent) were renters--a proportion in keeping with trends in 2000 and 2008, the report says. By contrast, 148,000 households, 45 percent, were owners.", "Hudson also forwarded a web link to a city-generated chart drawing on the 2010 U.S. Census indicating 51 percent of Austin’s residents were renters that year.", "To get our own fix on this, we queried Lloyd Potter, the Texas state demographer, who said by email Martinez’s claim is supported by the best available resource, American Community Survey data annually gathered by the U.S. Census Bureau.", "According to the surveys taken from 2010 through 2012, Potter said, 418,138, or 52 percent, of an estimated 799,183 Austin residents lived in rental units compared with 381,045 residents, or 48 percent, who were owners. He said the 2012 survey alone suggests 432,400, 53 percent, of the city’s 823,340 residents were renters compared with 390,940, nearly 48 percent, who were owners, Potter said.", "Separately, a bureau spokesman, Robert Bernstein, responded to our inquiry by emailing a chart based on the bureau’s 2012 survey suggesting there were more \"housing units\" rented in Austin than units that were occupied by owners. According to the survey, 183,080 of 330,838 housing units (55 percent) were renter-occupied with 147,758 (45 percent) being owner-occupied. (We suspect these figures were the basis of the information in the report noted by Martinez’s camp.)", "Occupied housing units", "2012 American Community Survey 1-Year Estimates", "Source: U.S. Census Bureau, 2012 American Community Survey (chart received by email from Robert Bernstein of the bureau).", "Our ruling", "Martinez said the majority of Austinites rent where they live.", "Government surveys show slightly more than half the city’s residents rent. We rate this statement True.", "TRUE – The statement is accurate and there’s nothing significant missing.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Report, \"2014 Comprehensive Housing Market Analysis,\" prepared for City of Austin by BBC Research and Consulting, Denver, July 31, 2014 (downloaded Aug. 14, 2014; web link received by email from Nick Hudson, consultant, Mike Martinez campaign, Aug. 13, 2014)", "Chart, \"Housing Tenure Data for Cities (plus population age data), Census 2010,\" U.S. Census Bureau, undated (downloaded Aug. 14, 2014; web link received by email from Hudson, Aug. 13, 2014)", "Email, Lloyd Potter, Texas state demographer, Aug. 13, 2014", "Email including web link to a chart showing owner-occupied and renter-occupied housing units, Austin, Texas, 2012 American Community Survey 1-Year Estimates, Robert Bernstein, public affairs specialist, U.S. Census Bureau, Aug. 13, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]