["By Eugene Kiely, Lori Robertson and Robert Farley", "Posted on March 1, 2018", "In a bipartisan meeting with members of Congress, President Donald Trump made false and misleading claims about his predecessors’ actions on gun control legislation and shootings in “gun-free zones.”", "During the meeting, Democrats repeatedly told the president that as a Republican he is in an unique position to convince other Republicans to buck the National Rifle Association and pass a gun-control bill. Trump agreed, describing himself at the meeting as the “biggest fan of the Second Amendment.”", "Sen. Christopher Murphy, a Connecticut Democrat, told Trump, “It’s going to have to be you that brings the Republicans to the table on this because right now the gun lobby would stop it in its tracks.”", "Trump: I like that responsibility, Chris. I really do. I think it’s time. It’s time that a president stepped up, and we haven’t had them — and I’m talking Democrat and Republican presidents. They have not stepped up.", "Past presidents have “stepped up,” but with mixed results.", "In 1993, President Clinton signed the Brady Handgun Violence Prevention Act — so named after former White House Press Secretary Jim Brady, who was severely wounded in an assassination attempt on President Ronald Reagan’s life in 1981. The law initially imposed a five-day waiting period before a licensed firearm dealer could sell or transfer a handgun, providing law enforcement with time to conduct background checks on prospective buyers. It also required the creation of an instant background check system, which was implemented five years after the Brady bill took effect.", "In 1994, Clinton signed the Violent Crime Control and Law Enforcement Act, which included a ban on certain semi-automatic weapons for 10 years. The ban expired in 2004, and Democrats — led by Sen. Dianne Feinstein of California — have attempted to revive it ever since. During the 2016 campaign, Trump opposed reinstating the ban, saying such weapons are needed for protection.", "President Obama had less success, although not for lack of trying. He proposed reinstating the ban as part of his 2013 plan to reduce gun violence. That plan also called for legislation requiring universal background checks for anyone trying to buy a gun and a 10-round limit for magazines. A divided Congress did not consider any of those proposals.", "Obama also proposed 23 “executive actions” that did not require legislative approval, such as a rule that required “federal agencies to make all relevant records, including criminal history records and information related to persons prohibited from having guns for mental health reasons, available to the federal background check system.” One of those agencies, the Social Security Administration, did enact a rule to expand its reporting requirements, but Trump signed legislation last year repealing it.", "Trump would have been right to say no meaningful legislation passed under Obama, but he ignores Clinton’s success in passing gun laws and minimizes Obama’s attempts when he says past presidents did not step up to address gun violence.", "Later in the meeting, Trump had this exchange with West Virginia Sen. Joe Manchin, a Democrat who co-sponsored a bipartisan bill with Republican Sen. Pat Toomey to expand background checks for prospective gun buyers. Again, the exchange illustrates Democrats pressing Trump, as a Republican, to take a lead in pushing legislation through a GOP-controlled Congress, and Trump again being dismissive of his predecessor.", "Manchin: Mr. President, the difference is this: There’s not a person in West Virginia that believes that you’re not going to defend their Second Amendment rights — not a person. With you taking a lead on something like this, it gives them the comfort that something reasonable — and this bill’s been vetted for over five years, and over 70, 80 percent, even, of gun owners say, “We like your bill, Pat and Joe. We’re just afraid that President Obama would take it further, and take more rights away.” That’s what I was running into in West Virginia.", "Trump: Or use that as an excuse not to sign it.", "Manchin: Well, this is not …", "Trump: Because he was not proactive in getting a bill signed, in all fairness.", "Trump misrepresents Obama’s actions leading up to the April 17, 2013, vote on a bipartisan compromise offered by Toomey and Manchin as an amendment to the Safe Communities, Safe Schools Act of 2013. Obama supported the bipartisan measure.", "He put out a statement on April 10, a week before the vote, that said he wished it were “stronger,” but nevertheless it represented “welcome and significant bipartisan progress.” He urged Congress to “finish the job,” and asked the Senate to “overcome obstruction by defeating a threatened filibuster, and allow a vote on this and other commonsense reforms to protect our kids and our communities.”", "A day later, he put out an official statement of support for the Safe Communities, Safe Schools Act, and that weekend he turned over his weekly address to the mother of a child who was killed in a mass shooting at Sandy Hook Elementary School in Newtown, Connecticut. The weekly address was part of a public lobbying campaign to pressure Congress to pass the bill.", "“Now that the Senate has agreed that commonsense gun safety reforms deserve a vote, they must finish the job and pass those reforms to protect our children and our communities,” the Obama White House said on a web page hosting the weekly address. “Now is the time for all Americans to help make this a moment of real change.”", "The bill received 50 votes from the Democratic caucus, but only four Republican votes — falling six votes shy of the 60 votes needed to end the filibuster.", "After the vote, Obama criticized the Senate for blocking “common-sense gun reforms,” calling the bill’s defeat “a pretty shameful day for Washington.”", "Contrary to Trump’s claim, Obama was proactive in trying to get the Manchin-Toomey legislation approved. And, contrary to Trump’s speculation, there was no indication that Obama would use his desire for more sweeping gun control measures as “an excuse not to sign” the Manchin-Toomey measure.", "The president used a disputed statistic on mass shootings in “gun-free zones” and repeated a false claim he had made during the 2016 campaign about the shooting at the Pulse nightclub in Orlando.", "Trump: But 98 percent of all mass shootings in the United States, since 1950, have taken place in gun-free zones, where guns were not inside the school or, as an example, you take the Pulse nightclub. If you had one person in that room that could carry a gun and knew how to use it, it wouldn’t have happened, or certainly not to the extent it did, where he was just in there shooting and shooting and shooting, and they were defenseless.", "Trump is wrong about the June 12, 2016, Pulse nightclub shooting in which 49 people were killed. There was indeed “one person” there who had a gun, “knew how to use it” and in fact did use it against the shooter.", "An Orlando police officer, Adam Gruler, was working security for the club that night, and he traded gunshots with the gunman, Omar Mateen, near the club’s entrance. Gruler had been a member of the Orlando Police Department since 2001.", "Here’s the OPD statement on the exchange of gunfire:", "OPD statement, June 12: On June 12, 2016, just after 2 a.m., an Orlando Police Officer working extra duty at the Pulse Nightclub, located at 1912 S. Orange Ave., responded to shots fired. Our officer engaged in a gun battle with that suspect and the suspect went deeper into the club where more shots were fired. The incident then turned into a hostage situation.", "Also, two of the responding officers were nearby and arrived not long after, firing at Mateen before he retreated to a club bathroom with hostages, several news reports said.", "Days after the shooting, Trump twice made the false claim that there were “no guns on the other side.”", "As for Trump’s claim that “98 percent of all mass shootings in the United States, since 1950, have taken place in gun-free zones,” that figure has been disputed. It comes from an updated 2014 report from the Crime Prevention Research Center, founded by economist John Lott, whose work is often cited by gun rights advocates.", "Calculating such a statistic depends on one’s definition of “mass shooting” and “gun-free zone.”", "Lott’s research cites “six mass public shootings since at least 1950 that have not been part of some other crime where at least four people have been killed in an area where general civilians are allowed to have guns.”", "But in the book “Rampage Nation,” Louis Klarevas, who teaches at the University of Massachusetts-Boston, identified 111 shootings since 1966 (where six or more people, not including the perpetrator, had been killed per incident, whether in a public or private place) and found 13 in a gun-free zone and five in a “gun-restricting zone” (where civilians can’t have guns but there is regular armed security). That would be just 16 percent of mass shootings in a gun-free or gun-restricted zone.", "To highlight one of the discrepancies: Lott says the 2015 shooting at an Oregon community college was in a gun-free zone, but as we found when researching the issue, that’s not exactly the case. While Umpqua Community College does have policies prohibiting firearms on campus, a college official told us those prohibitions “would not apply to those with valid concealed weapon permits pursuant to Oregon law.”", "Klarevas counts that incident as occurring in a gun-allowing zone.", "Trump joked (maybe?) that Republican Sen. Toomey didn’t include a provision to increase the minimum age to purchase some guns to 21 in his 2013 amendment because he was “afraid of the NRA.” Toomey later called that suggestion “ridiculous.” And, in fact, Toomey didn’t get any contributions from the NRA in his 2016 Senate race.", "As we explained, Toomey and Democratic Sen. Manchin were the co-authors of the 2013 Manchin-Toomey amendment, which would have expanded background checks to private sales by unlicensed individuals at gun shows and over the internet.", "In the bipartisan meeting this week, Trump asked legislators to use that Manchin-Toomey amendment as a starting point and to consider adding a provision that would raise the minimum age required to purchase some guns, like the one used in the Parkland, Florida, shooting, from 18 to 21. Trump asked Toomey if such a provision was considered for inclusion in the 2013 amendment.", "“We didn’t address it, Mr. President,” Toomey said.", "“You know why?” Trump said. “Because you’re afraid of the NRA, right?”", "The president was smiling, but it was a pointed comment.", "Manchin responded that raising the age to 21 wasn’t an issue back then, and such a provision never came up for a vote.", "On “Fox & Friends” the following morning, Toomey was asked about Trump’s jab. He called it “ridiculous.”", "The NRA strongly opposed the Manchin-Toomey amendment. NRA spokesman Andrew Arulanandam told us then that the vote on the Manchin-Toomey amendment “was considered a gun control vote” and that it would have “diminished 2nd Amendment rights.”", "Only four Republicans, including Toomey, voted for the amendment, which failed to move forward after a 54-46 vote.", "As a result of the legislation, Toomey’s rating with the NRA dropped from an “A” to a “C,” and the endorsements and contributions Toomey got from the NRA in previous House and Senate races disappeared. In 2016, the NRA stayed out of Toomey’s Senate race altogether; his Democratic opponent, Katie McGinty, had an “F” grade from the NRA. In that race, Toomey got the endorsement of a gun-control group, Everytown for Gun Safety, which ran ads supporting him.", "Later in the meeting, Trump boasted that while the NRA has “great power over you people [congressmen], they have less power over me. I don’t need it.”", "Democratic Sen. Chris Murphy: I think you underestimate the power of the gun lobby.", "Trump: No, I tell you what — the reason I had lunch with the NRA on Sunday — I called them; I said, you got to come over. I said, fellas, we got to do something. And they do have great power, I agree with that. They have great power over you people. They have less power over me. I don’t need it. What do I need?", "Trump may not need the NRA, but he got an awful lot of financial support from it in the presidential election. The nonpartisan Center for Responsive Politics wrote that while it is “not at all clear how much of a factor [Trump’s] embrace of the NRA’s hardline position on gun rights played into the outcome” of the election, the NRA’s $30.3 million investment in support of Trump and in opposition to Hillary Clinton was unmatched by any other outside group.", "Mike Spies and Ashley Balcerzak, Center for Responsive Politics, Nov. 9, 2016: In October alone, according to the Center for Public Integrity, roughly one out of every 20 television ads in Pennsylvania was sponsored by the NRA. That same month, the group paid for one in nine ads in North Carolina, and one of every eight in Ohio. … Trump won all three states.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]