["About this rating", "The 19th anniversary of the Sept. 11, 2001, terrorist attacks on New York City came with news that left many feeling outraged: The Trump administration had reportedly withheld money from a health care fund dedicated to New York City firefighters who had suffered from health problems as a result of their life-saving response to the World Trade Center.", "The story came from a New York Daily News scoop dated Sept. 10, 2020, reporting that the U.S. Department of Treasury had withheld an estimated $4 million from the FDNY World Trade Center Health Program. It went viral across the internet as many commemorated the anniversary of the attack.", "It's true that the Trump administration has been withholding money from the program, the result of what appears to be a bureaucratic blunder — namely, the way the Department of Treasury tracks and collects on debts owed to the federal government.", "In a letter dated Aug. 20, 2020, sent to U.S. Rep. Pete King, R-N.Y., the treasury department said that nearly $2 million had been withheld between August 2016 and May 2020 because of debts owed by New York City to the federal government.", "The letter was sent to King in response to an inquiry by the congressman, asking why funds for the program were being withheld.", "The Department of Treasury's letter to King stated that the department's Bureau of Fiscal Service is required to \"offset federal payments for the collection of delinquent debts owed to the United States.\" The Treasury Department's program to offset such debts uses a Taxpayer Identification Number (TIN) to link payees and debtors.", "\"Some payees — such as New York City — use a single TIN for many of their subdivisions, which can result in a payment for one component of the payee being subject to offset for a debt by another component of the payee,\" the letter stated. \"That is what happened in this case.\"", "FDNY Chief Medical Officer Dr. David Prezant, who also directs the affected 9/11 first responders' health program, told the Daily News that the amount docked from the program over the years was in the range of $4 million, not $2 million:", "Prezant said he was docked about half a million dollars each year in 2016 and 2017. Then it crept up to about $630,000 in 2018 and 2019. This year, Treasury has nearly tripled its extractions, diverting $1.447 million through late August, according to Prezant.", "Prezant also told the Daily News that he has been trying to get an answer from the federal government and the city for years as to why the money was being withheld, but received no response until King intervened.", "The funding issue became urgent with the onset of the COVID-19 pandemic, because while the city has been fronting the money for the 9/11 program that was withheld by the federal government, New York is now cash-strapped due to the coronavirus, the Daily News reported.", "\"The money that we don’t get means that physicians, nurses and support staff are not hired. We have not had to lay off anyone, yet, but we are at that brink,\" Prezant told the Daily News.", "We reached out to Prezant for comment but didn't hear back in time for publication. We also asked the Department of Treasury what was being done to remedy the situation and didn't receive an answer in time for publication.", "A total of 2,977 people died on Sept. 11, 2001, when hijackers flew jetliners into the World Trade Center's Twin Towers and the Pentagon. The attack took an especially heavy toll on New York's firefighters, 343 of whom died after running into the burning skyscrapers in Lower Manhattan, trying to rescue people when the buildings collapsed.", "After the attacks, many first responders became sick from the exposure that day to toxic substances released into the air by the crumbling buildings, as well as sustained traumatic injuries and mental health scars. Two FDNY firefighters died within a day of each other in December 2019 as a result of illnesses they suffered from responding to the scene of the terrorist attack.", "McAuliff, Michael.   \"EXCLUSIVE: Trump Administration Secretly Withheld Millions from FDNY 9/11 Health Program.\"\r\n    [New York] Daily News.   10 September 2020.", "McAuliff, Michael and Chris Sommerfeldt.   \"Trump Administration Admits Defunding FDNY’s 9/11 Healthcare Program.\"\r\n    [New York] Daily News.   11 September 2020.", "Stanglin, Doug.   \"343 NYC Firefighters Died on 9/11. Since Then, 200 Have Died from Ground Zero-Related Illnesses.\"\r\n    USA Today.   19 July 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]