["About this rating", "A supposedly amusing \"before and after\" graphic allgedly showing a young woman who got pregnant shortly after she posed in a t-shirt featuring a photograph of her muscular father and the warning \"Stay Clear Boys\" is frequently shared online with disparaging remarks about the pictured people:", "When this photoset was shared on Imgur in January 2018, for instance, it was posted with the claim that the daughter got pregnant in order to get \"payback\" on her overbearing father. A popular caption for this image set is \"It didn't work out too well, did it?\"", "Although both of these photographs are genuine, they do not feature the same woman.", "The image on the left first went viral in April 2015, when it was shared on Facebook by Brazilian jiu-jitsu champion Kit Dale. The image stirred up a little controversy at the time and many criticized Dale for being a bad father and forcing his daughter to wear what many saw as a misogynistic shirt. Dale, however, was not the man pictured in that photograph.", "As Dale wryly stated in a subsequent Facebook post, \"The awkward moment when you're named as the worst father of the year and you don't even have kids LOL.\"", "The first image actually shows a man named \"Gavin Gavlaarr Johnston\" and his teenage daughter:", "THIS IS ME PEOPLE?? I apologise mate, only started as a joke on FB, next thing i know it's escalated to this!!!", "She's my princess though....so it was joke no joke??", "Since this image originally went viral in 2015, Johnston has posted several images of himself and his not-pregnant daughter on Facebook. We also found the daughter's personal Facebook page (which we will not link to here, as we're uncertain of her age) and saw no indication that she was the pregnant woman pictured in the second photograph.", "So who is the second woman? The image of the pregnant teenager first went viral in January 2018 (nearly three years after the first image), when it was shared on Facebook in a post about a missing, seven-months pregnant runaway named \"Bree Elliott\" from Elkhart, Indiana:", "This is Bree Elliott and her boyfriend. She is 7 months pregnant, and has runaway. She has been gone more than. A day, and most likely in Elkhart or surrounding area. Please if any of you see her or know of her whereabouts, contact me or Beth Jessie asap.", "We have not been able to unearth too many details about Bree Elliott's disappearance, but a woman claiming to be her guardian posted a follow-up message on 20 January 2018 stating that Bree had returned home, and that she and her baby were in good health.", "These images show two entirely different people. The woman pictured in the \"stay clear boys\" shirt is the daughter of Gavin Gavlaarr Johnston, and that photograph was taken as early as April 2015. The second photograph didn't start circulating until nearly three years later and shows an entirely different woman named Bree Elliott.", "The Telegraph.   \"Stay Clear, Boys: Protective Dad Issues Daughter with Threatening T-Shirt.\"\r\n    23 April 2015.", "Urbanski, Dave.   \"The Picture This Dad Put on His Daughter’s T-Shirt to Warn Boys to ‘Stay Clear’ Has the Internet Going Nuts.\"\r\n    The Blaze.   23 April 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]