["The coronavirus pandemic and recent riot at the U.S. Capitol mean the presidential inauguration of Joe Biden will not follow all of the typical inauguration ceremony protocols.", "Biden made coronavirus precautions central to his campaign. And as his inaugural ceremony is taking place during the most deadly wave of the coronavirus, crowds were to be limited and mask wearing and social distancing enforced.", "On top of coronavirus accommodations, the country is watching a transfer of power unlike any other. Now former-President Donald Trump did not attend — the first outgoing president in decades not to do so — and D.C. is virtually on lockdown following a pro-Trump riot earlier this month.", "Misinformation has been at the center of the 2020 election cycle, and is continuing into Inauguration Day.", "Following the addition of a public art exhibition of American flags on the National Mall, false claims have been circulating about the intention of the exhibit.", "One Jan. 19 Facebook post claims, \"This is kind of hilarious in a really dark sort of tragic comedy way. Biden and his crew couldn't get real people to come to the inauguration so they planted flags to ensure it wouldn't look so empty.\"", "USA TODAY was not able to reach the person who made the claim for comment.", "Fact check:Photo captures House Speaker Nancy Pelosi thanking National Guard", "Due to the coronavirus pandemic, inaugural crowds will be limited and events that would have taken place in person, such as the traditional parade, will be televised virtually instead, USA TODAY reported.", "Perhaps the most notable change to the inaugural ceremony will be the absence of a crowd on the National Mall.", "Inauguration:What will the crowd size at Joe Biden's inauguration on Jan. 20 look like?", "In place of these crowds now stands a public art exhibition, made up of almost 200,000 American flags, which represent the Americans that will not be in attendance because of COVID-19.", "Biden ran an unconventional presidential campaign in order to keep coronavirus precautions at the forefront, making it unsurprising that his Inauguration Day will be upholding many of those same safety measures.", "Fact check:What's true about the 2020 election, vote counting, Electoral College", "We rate the claim that the Biden team planted flags on the National Mall to ensure it wouldn't look so empty as MISSING CONTEXT because without additional information it could be misleading. Due to the coronavirus pandemic and heightened security, Biden's presidential inauguration will be an unconventional, muted event.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]