["Rhinos in Kruger National Park in South Africa. (AP)", "• Images showing rhinos and elephants with pink horns are doctored from stock photos.", "• Some organizations have infused rhino horns with a mixture of poison and dye to deter poaching. However, this process only produces a slight discoloration on the outside of the horn.", "• Conservationists say that superficially staining tusks and horns is impractical.", "A Facebook post purports to show an unusual anti-poaching tactic: dyeing elephant tusks and rhino horns to lower their value.", "The post features photos of a rhino with a bright pink horn and an elephant with bright pink tusks.", "The text reads, \"One of the most brilliant things I've ever seen against poaching. They use the same pink dye that is used to mark stolen banknotes. This makes the ivory of the tusks unsaleable and cannot be cleaned. The animals are not harmed and this initiative is saving their lives.\"", "The images are doctored from stock photographs. An article published in Take Part could have contributed to this misinformation by including a photo of a rhino with a bright pink horn. This image was originally accompanied by a caption stating that the photo had been \"digitally altered.\"", "Some organizations like the Rhino Rescue Project have experimented with anti-poaching methods similar to the one praised by the Facebook post. One method infuses rhino horns with a mixture of poison and dye to make them dangerous for humans to handle. This process primarily affects the interior of the horn, producing only slight discolorations on the outside. It does not involve the same dye used to mark stolen banknotes.", "In a FAQ addressing these images, the Rhino Rescue Project wrote, \"Images like those doing the rounds on social media (of rhinos and elephants sporting digitally altered pink horns and tusks) create unrealistic expectations about what the technique entails and how it is intended to combat poaching.\"", "Lorinda Hern, co-founder of the Rhino Rescue Project told Yahoo News that dyeing the outside of a horn or tusk would be impractical and ineffective. \"A superficial staining would not deter poachers as it could easily be sanded down and the tusk still sold regardless,\" she said.", "A Facebook post says that rhino horns and elephants are being marked with \"the same pink dye that is used to mark stolen banknotes\" to prevent poaching.", "The photos on this post are doctored. Although some organizations have experimented with infusing rhino horns with a mixture of poison and dye, conservationists say that staining the outside of tusks and horns would be ineffective and impractical. And there’s no method that involves the dye used for marking banknotes.", "We rate this post False. ​", "Facebook post, Sep. 2, 2020", "Rhino Rescue Project, \"Infusion in action,\" 2019", "Rhino Rescue Project, \"FAQ,\" 2019", "Take Part, \"Pink poison, the surprising new trend that’s saving rhinos,\" Apr. 10, 2013", "Yahoo News, \"Pink tusks aren't real, but still help combat hunting of elephants for ivory,\" Jul. 28, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]