["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "PETA says it is interested in buying this remote-controlled CineStar Octocopter, a drone made by Aerobot. Photo from Aerobot.com.au.", "Drones are not just a tool of the United States military. Sen. Joe Negron, R-Stuart, says they are being used right now to monitor the movements of hunters overseas.", "Negron's pet project of the legislative session aims to curtail the use of nonmilitary drones by state and local law enforcement. Even though Negron's story about hunters doesn't directly impact his proposal, SB 92, he shared it recently to help explain the growing drone market.", "\"I don’t know how many of you saw the story about, and this is in another country so it’s beyond the jurisdiction of the Florida Legislature, but I think it’s PETA is using this really fancy drone to follow hunters around in some places in other countries to watch their hunting activities,\" Negron told reporters on April 10. \"You're going to see more and more creative uses of drones because the technology has become so affordable.\"", "Is PETA, or People for the Ethical Treatment of Animals, really taking their war against animal cruelty to the skies?", "It's planning on it.", "PETA announced in an April 8 press release titled \"PETA to acquire drones to stalk hunters\" that it is seeking drone technology to use in the United States. PETA said it wants to \"monitor those who are out in the woods with death on their minds.\"", "The group said it wants to capture video footage of \"slob hunters\" who drink while in possession of a firearm, fail to pursue maimed animals and use spotlights and hunting lures that are banned in some places. The group said it also intends to use drones over factory farms, fishing holes and other places \"where animals routinely suffer and die.\"", "\"The talk is usually about drones being used as killing machines, but PETA drones will be used to save lives,\" PETA President Ingrid E. Newkirk said in a statement. \"Slob hunters may need to rethink the idea that they can get away with murder, alone out there in the woods with no one watching.\"", "Newkirk later told CNN that PETA was also planning to fly drones overseas where the group is active.", "A blogger at AmmoLand.com reacted to the announcement with expected snark: \"Sounds to me like this will create a whole new shooting sport. ‘PETA Drone Target Shooting.’ \"", "So PETA says it is planning to use drones both domestically and abroad, but it hasn't yet. Negron got that mixed up. But other wildlife protection groups, such as the Ol Pejeta Conservancy in Kenya, have used drones to target illegal hunters in other countries.", "The World Wildlife Fund received a $5 million grant from Google to deploy technology, such as sensors, tags and \"conservation drones,\" that would help protect elephants, rhinos and tigers from wildlife traffickers and poachers. The group has already tested conservation drones over national parks in Nepal.", "Negron sent us a U.S. News and World Report story about a Belgian research team conducting unmanned aerial surveys in Burkina Faso. Drones are better than plane-based surveying because they cost less and can be deployed more easily, a researcher explained. However, drones have a limited flying time and the camera zoom is sometimes not effective. The researchers could not see antelopes or baboons but could count elephants.", "In this instance, Negron is right that drones are being used overseas, but he referenced hunters -- not illegal poachers -- when describing their target.", "For the record, Negron’s bill does nothing to prevent private groups from using drones in Florida. SB 92 would ban the use of drones by law enforcement unless they have a warrant or are responding to threat of terrorist attack. It also prevents information obtained by drones from being used in the courts as evidence.", "Another point: In the United States, flying a drone isn't as simple as buying one and putting it in the air. The Federal Aviation Administration regulates drone use by government entities and corporations. Because PETA is a nonprofit, it might be able to work around the rules by flying under model aircraft rules, which generally limit operations below 400 feet and away from air traffic.", "\"The caveat there is that some of the operations that they have talked about doing would appear to be difficult to do while maintaining sight of the unmanned aircraft,\" said FAA spokesman Les Dorr, pointing to model aircraft guidelines the group would have to follow.", "Our ruling", "Negron said he thought PETA is \"using this really fancy drone to follow hunters around in some places in other countries to watch their hunting activities.\"", "Negron, to our eye, conflates PETA's plan to use drones to watch hunters in the United States and abroad with other wildlife groups currently tracking poachers overseas with drones.", "But his main point is largely right. Animal rights groups are using drones to look for animal abuses. We rate his claim Half True.", "Florida Senate, SB 92, and Florida House, HB 119", "PETA press release, \"PETA to acquire drones to stalk hunters,\" April 8, 2013", "Email interview with Sen. Joe Negron, April 11, 2013", "New York Times, \"Taping of farm cruelty is becoming the crime,\" April 6, 2013", "Tampa Bay Times, \"Lawmakers want drones grounded in Florida,\" March 12, 2013", "PETA.org, \"PETA’s Game of Drones,\" accessed April 11, 2013", "Email interviews with Jenna Bonello, World Wildlife Fund spokeswoman, April 11, 2013", "Email interviews with Kaitlynn Kelly, PETA spokeswoman, April 11, 2013", "Mother Jones, \"Google-funded drones to hunt rhino poachers,\" Dec. 5, 2012", "World Wildlife Fund, \"World Wildlife Fund to push frontier of conservation with Google global impact award,\" Dec. 4, 2012", "Interview with Les Dorr, Federal Aviation Administration spokesman, April 11, 2013", "Federal Aviation Administration, Model Aircraft Operating Standards, June 9, 1981", "Federal Aviation Administration, Fact Sheet: Unmanned Aircraft Systems (UAS), updated April 10, 2013", "ConservationDrones.org", "NBC News Technology blog, \"Predator becomes prey: Google-funded drones hunt poachers in Africa,\" December 2012", "CNN, \"Drone ranger: Unmanned plan to spy on poachers,\" Jan. 30, 2013", "CNN, \"PETA eyes drones to watch hunters, farmers,\" April 11, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]