["About this rating", "In July 2020, some social media users started spreading a photograph of an older man kissing a young girl and claimed that it showed U.S. Sen. Chuck Schumer of New York with a child on the island of convicted sex trafficker Jeffrey Epstein:", "No evidence exists to support this claim. The rumor did not originate with any credible reports and is based solely on the notion that the above-displayed man bares a passing resemblance to the New York senator. We compared photographs of Schumer to the man in this photo, and it seems clear that they are two different individuals. For one, Schumer has a large freckle on his left cheek that is absent in the above-displayed picture.", "Also, a spokesperson for the senator told Politifact it was \"absolutely not\" Schumer in the photograph.", "While this picture may appear to show an illicit act at first glance (especially when it is shared along with the claim that it was taken on  Epstein's island), this image actually shows a harmless display of affection between a father and a daughter. On Aug. 21, the man in this photograph contacted Lead Stories to explain the real story behind the image.", "Lead Stories writes:", "On August 21, 2020, Lead Stories was contacted by the man who appears in the photo. He is the father of the child in the photo. Lead Stories saw other family photos where he appears with his wife and daughter. There is no question the man who contacted us is the man in the photo or that they are a family. For their privacy they will not be identified. He is distraught that these pictures are being circulated with such defamatory captions and requests that people take them down.", "This image has been attached to false claims about pedophilia since at least June 2019. These early posts, of course, were not accompanied by any evidence to support these claims. A few months later, the picture started circulating along with a caption claiming that it showed the fate of a young girl in Africa. One posting in French on Instagram associated the picture with an article from the British tabloid The Sun about a \"paedo paradise\" in Gambia. However, this photograph did not appear in The Sun's article.", "It wasn't until July 2020, more than a year after the photograph first started to spread online, that social media users started to claim it showed Schumer. This \"revelation\" wasn't based on credible reporting, police reports, or documentation showing that the senator was on the island owned by Epstein, a billionaire financier who committed suicide in jail while awaiting trial on new sex-trafficking charges. Rather, it appears someone noticed the person in the photograph looked somewhat like Schumer and passed along a rumor.", "Culliford, Graeme.   \"SICK SALES Inside ‘Paedo Paradise’ The Gambia Where Sex Beasts Are Buying African Children and Toddlers to Rape.\"\r\n    The Sun.   16 January 2020.", "Smith, Alex Duval.   \"European Paedophiles Flock to Gambian 'Smiling Coast.'\"\r\n    The Guardian.   3 July 2004.", "O'Rourke, Ciara.   \"Photo Shows 'Chuck Schumer Kissing this Child on Epstein Island!\"\r\n    PolitiFact.   18 July 2020.", "Updated [25 August 2020]: Updated with confirmation that this photograph shows a harmless display of affection between a father and a daughter.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]