["About this rating", "Abraham Lincoln was a skilled wrestler and was honored with an award from the National Wrestling Hall of Fame in 1992.", "Lincoln's wrestling exploits did not resemble modern-day professional wrestling, and he was not honored by the WWE.", "In the red corner, standing at six-foot-four (excluding the stovetop hat), with only one defeat in 300 matches, the reigning champion of New Salem County, and a future member of the National Wrestling Hall of Fame... ladies and gentlemen, we give you the Great Emancipator!", "By all accounts, Abraham Lincoln — yes, the sixteenth President of the United States — was indeed a skilled and accomplished wrestler. However, as with any good story, tales of his prowess in the ring have been exaggerated over the years — and never more so than in the Internet Age.", "Several rumors are regularly shared in a popular meme that features a rendering of Lincoln with a championship belt draped across his shoulder:", "Abraham Lincoln is honored in the National Wrestling Hall of Fame. As a young man, his long limbs and ability to rile up his opponents won him every match. He also liked to talk smack and once said to an entire crowd, \"I'm the big buck of this lick. If any of you want to try it, come on and whet your horns.\" Though he competed in about 300 matches, he was only defeated once.", "Another rumor is that Lincoln was a regional champion at 21:", "Abraham Lincoln, as a 21 year old in 1830, was the wrestling champion of his county in Illinois. At this time, where working at a store in New Salem, Illinois, Lincoln had a famous bout with Jack Armstrong, also a county wrestling champion. Lincoln won decisively when, after losing his temper when Armstrong began fouling him, he slammed Armstrong to the ground and knocked him out.", "There are a lot of moving parts behind Lincoln's wrestling history, let's try to examine these claims one by one.", "First up, the absurd artwork of Lincoln with a championship belt:", "Although the image may give the impression that Lincoln's wrestling matches were comparable to the glitzy modern-day stage productions from groups like World Wrestling Entertainment, Lincoln was a skilled wrestler — but he never hoisted a glamorous gold-encrusted belt, and he never strutted into a ring as fireworks went off behind him.", "So where did this glamorous portrayal of the Illinois Railsplitter come from? This is a composite of at least two different images and features a championship belt that belonged to WWE star Randy Orton:", "Did Abraham Lincoln win an Illinois County wrestling championship in 1830?", "This rumor appears to be based on a very loose translation of the word \"champion.\"", "One of the most famous stories about Lincoln's wrestling skills involves a match with a local tough named Jack Armstrong. Although the details of this fight are hazy at best — some accounts claim that Lincoln won, others that Armstrong did, but only by cheating — this appears to be the match at the root of this rumor.", "Armstrong is referred to as the \"champion\" of his group of friends, the Clary's Grove Boys, in various accounts about this fight. However, this seems to be an informal title. Armstrong was the toughest guy in town, the leader of his group, or, as John T. Stuart, Lincoln's first law partner, described him, the \"champion of his clan.\"", "That is, until he went up against young Lincoln:", "The Clary’s Grove Boys \"thought that had found only another subject by which this band could display its strength and prowess,\" observed John T. Stuart, who was Mr. Lincoln’s mentor and first law partner. \"The champion of the clan, Jack Armstrong was selected to wrestle with Lincoln and to show him that although six feet three he was no man at all compared with the ‘Boys.’ It did not take Jack long to discover that he had got hold of the wrong customer; and when it was evident that Lincoln was getting the better of their champion the whole Band pitched in and gave Lincoln several blows which had no very salutary effect on the strength of his legs. Lincoln however took all this in perfect good humor and by laughing and joking displayed such an excellent disposition that he at once won their hearts and was invited to become one of the company. This was the turning point in Lincoln’s life.\"", "Another version of this story can be found in the biography Abraham Lincoln: Redeemer President:", "When Offutt (Lincoln's boss at the time) began boasting that his new clear could whip any rough-houser in New Salem, several of them put their champion, Jack Armstrong, up to wrestle Lincoln. Just how the match was fought, or even who exactly won, is probably unsure Armstrong later admitted \"that he threw L. but did not do it fairly\"); what does seem sure is that Lincoln came away with the admiration and probably the store business, of even New Salem's roughest lot and the lifelong loyalty of the Armstrongs. \"He won us by his bearing and boldness,\" Royal Clary recalled, \"Jack and [Lincoln] were the warmest friends during life.\"", "Here's how David Herbert Donald described the fight in the biography Lincoln:", "None were wilder than the boys from Clary's Grove, a few miles to the west, whose leader was the stalwart Jack Armstrong ...", "When Offutt, enchanted with his new assistant, began boasting that Lincoln was not merely the smartest man in New Salem but also one of the strongest, the Clary's Gove boys called his bluff. They cared not at all about Linconl's mental superiority, but they dared him to test his strength in a wrestling match with their champion, Jack Armstrong. Lincoln was reluctant, because he said he did not like all the \"wooling and pulling\" of a wrestling match, but the urging of his employer and the taunts of his rivals obliged him to fight. In the collective memory of New Salem residents the contest was an epic one and various versions survived: How Armstrong defeated Lincoln through a trick; How Lincoln threw Armstrong; how Armstrong's followers threatened collectively to lick the man who had defeated their champion until Lincoln volunteered to take them all on, but one at a time. The details were irrelevant. What mattered was that Lincoln proved that he had immense strength and courage, and that was enough to win the admiration of the Clary's Grove gang. Thereafter they became Lincoln's most loyal and enthusiastic admirers.", "The descriptions of Armstrong as a champion are not actually referring to some official title, but instead that he was known as the toughest man in the area. So when Lincoln defeated him — if he actually did — during their storied bout, he may have usurped the informal \"champion\" title in the area, but this was not done in any official capacity.", "We reached out to researchers at the Abraham Lincoln Presidential Library Foundation for more information; they told us that Lincoln was never an official county wrestling champion in Illinois, but for a very good reason: \"County wrestling championships did not exist in Illinois in the 1830s.\"", "Was Lincoln honored by the National Wrestling Hall of Fame?", "A number of United States presidents have been honored by the National Wrestling Hall of Fame. In 1992, Lincoln was given the organization's \"Outstanding American\" award:", "Born in a log cabin in Kentucky, Abraham Lincoln received little schooling as his family moved through the wilderness, but he read and reread the Bible and the few other books he could get hold of. Growing up in Illinois, he clerked in a store, studied law, served in the Black Hawk War and took part in political talk of the day.", "In the rough and ready style of the frontier, \"catch as catch can\" wrestling was more hand-to-hand combat than sport. Lincoln, an awesome physical specimen at 6-feet-4, was widely known for his wrestling skills and had only one recorded defeat in a dozen years.", "The National Wrestling Hall of Fame has also honored other \"Presidential Grapplers\" such as George Washington, William Howard Taft, and Teddy Roosevelt. A mural of Lincoln's match with Armstrong adorns one of the walls in the museum's \"Lincoln Lobby\":", "The National Wrestling Hall of Fame is dedicated to athletes who practice a traditional version of the sport. Although the image include in this meme might suggest that Lincoln was a member of the WWE Wrestling Hall of Fame, that is not the case. The NWHF and the WWE Wrestling Hall of Fame are two distinct and separate organizations.", "Did Lincoln lose only one of nearly 300 matches?", "There is no official record for all of Lincoln's wrestling matches, making it impossible to say how many he won, lost, or even participated in. As noted earlier, even the details about Lincoln's most famous bouts are unclear.", "This rumor, however, is rooted in some truth. We know that Lincoln frequently engaged in wrestling matches and that he was especially skilled at the sport. In fact, when Lincoln was reminiscing about his wrestling days on the campaign trail in 1860, he told Risdon Moore, a college professor whose father served with Lincoln during the Black Hawk War, that he was undefeated until he was thrown by a man named Lorenzo Dow Thompson:", "Gentleman, I felt of Mr. Thompson, the St. Clair champion, and told my boys I could throw him, and they could bet what they pleased. You see, I had never been thrown, or dusted, as the phrase then was, and, I believe, Thompson said the same to the St. Clair boys, that they might bet their bottom dollar that he could down me. You may think a wrestle, or \"wrastle,\" as we called such contests of skill and strength, was a small matter, but I tell you the whole army was out to see it. We took our holds, his choice first, a side hold. I think realized from his grip for the first time that he was a powerful man and that i have no easy job. The struggle was a severe one, but after many passes and efforts he threw me. My boys yelled out \"a dog fall,\" which meant then a drawn battle, but I told my boys it was fair, and then said to Thompson, \"now it's your turn to go down,\" as it was my hold then, Indian hug. We took our holds again and after the fiercest struggle of the kind that I ever had, he threw me again, almost as easily at my hold as at his own. My men raised another protest, but I again told them it was a fair down. Why, gentlemen, that man could throw a grizzly bear.", "Lincoln's wrestling history is a mixture of fact and folklore. Although we don't know if this was truly the only match he lost in hundreds of fights (remember that some also claim he lost to Armstrong), we do know that the majority of accounts about Lincoln's wrestling matches end with Lincoln as the victor. Of course, this may have to do with the fact that many of these stories were retold as Lincoln was running for president, and may therefore have been presented by that time in a far more favorable light.", "Did Lincoln tell a crowd: \"I'm the Big Buck of this lick\"?", "This quote comes from the biography \"Abraham Lincoln: The Prairie Years,\" which was written by poet and author Carl Sandburg in 1926. Lincoln reportedly said this phrase after a raucous battle with his stepbrother, John Johnston, which was initiated by a man named William Grigsby. As Sandburg tells it, Lincoln defeated Johnston, went searching for Grigsby in the crowd, threw the man into the middle of the ring, and then sparked an all out brawl when he issued this challenge to the crowd:", "The two fighters, stripped to the waist, mauled at each other with bare knuckles. A crowd formed a ring and stood cheering, yelling, hissing, and after a while saw Johnston getting the worst of it. The ring of the crowd was broken when Abe shouldered his way through, stepped out took hold of Grigsby and threw him out of the center of the fight ring. Then, so they said, Abe Lincoln called out, \"I'm the big buck of this lick,\" and his eyes sweeping the circle of the crowd he challenged. \"If any of you want to try it, come on and whet your horns.\" Wild fist-fighting came and for months around the store in Gentryville they argued about which gang whipped the other.", "This is most likely not an exact quote from Lincoln. As with most of the stories about Abraham Lincoln's wrestling matches, however, it is rooted in truth.", "Dellinger, Bob.   \"Presidents Have Long Wrestling History.\"\r\n    National Wrestling Hall of Fame.   Accessed 2 May 2018.", "Fehrenbacher, Don.   Recollected Words of Abraham Lincoln.\r\n    Stanford University Press, 1996.    ISBN 0804726361.", "Sandburg, Carl.   Abraham Lincoln: The Prairie Years and the War Years.\r\n    Mariner Books, 2002.   2002. ISBN 0156027526.", "Guelzo, Allen.   Abraham Lincoln: Redeemer President.\r\n    Eerdmans Pub. Co., 1999.   ISBN 0802838723.", "Hubbard, Charles.   The Many Faces of Lincoln: Selected Articles from the Lincoln Herald.\r\n    Mayhaven Publishing, 1997.   ISBN 9781878044532.", "Mr Lincoln and Friends.   \"The Boys: Jack Armstrong (1804-1854).\"\r\n    Retrieved 1 May 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]