["A post published on May 28, 2020 on a Facebook page named “Truth & Facts” shared front pages of the Daily Nation, the Standard and the Star newspapers with digitally altered headlines.", "Similar posts were shared here and here.", "The doctored front pages featured alleged scandals involving senior political figures including Kenya’s deputy president William Ruto.", "The newspapers have dismissed the items as “fake” on their respective social media accounts and cautioned readers against believing them.", "? FAKE NEWS ALERT! ?\n\n\t\tTo get your favourite publication delivered straight to your door step, text or send a WhatsApp message to +254 722 716329 today.\n\n\t\t?️ https://t.co/r3GJnAGsQU pic.twitter.com/cs7YR1QyFr", "If it's not on our pages, it's fake. Avoid such by grabbing your favourite political newspaper now ---> https://t.co/lBK1m3bSBG pic.twitter.com/p7IhCVlWTj", "Avoid fake news by getting yourself a copy of the bold newspaper on https://t.co/C6ban4E2FI pic.twitter.com/6LjKhwfa8t", "The Standard newspaper told AFP Fact Check it had reported a similar matter to the Directorate of Criminal Investigations (DCI), a semi-autonomous body of the National police service responsible for the investigation of complex criminal cases.", "Under Kenya's tough cybercrime laws, a person found guilty of publishing false information faces a fine of up to five million Kenya shillings (approximately 47,000 USD) and up to 10 years in jail.", "“These are criminals as they are using our brand to spread propaganda… We are now pursuing legal action,” the Standard’s editor-in-chief Ochieng Rapuro said.", "He added that the fake headlines could harm the paper’s credibility because they create “doubt on products and what we are doing”.", "The bogus front pages tap into ongoing political strife as Kenya’s ruling Jubilee party faces internal power struggles. The tensions, reported by local media here and here, have resulted in some legislators being de-whipped over what has been described as “indiscipline and party disloyalty”.", "“In the Kenyan situation, politics is becoming divisive and intense and it is these political factions that are fighting and using the spaces to spread propaganda,” Rapuro said.", "The Daily Nation’s managing editor Pamela Sittoni also noted the fake front pages seemed part of a political campaign “because of the individuals whose names and pictures are being used”.", "Made to look genuine", "The doctored front pages used fonts, colours and layouts identical to the genuine ones. Only the splash story (the main headline) was altered while the other stories appearing on the front page that day remained unchanged.", "“If you look at the front pages that have been produced, they are fairly believable. So it is very easy for someone who does not have a good knowledge of fakes to believe that that is a fake edition of the paper,” Paul Ilado, the head of content at Radio Africa Group which owns the Star newspaper, told AFP Fact Check.", "The doctored headlines allege that the accounts of Kenya’s deputy leader had been frozen as part of a bribery probe and his wife had gone into hiding, while lawmaker Moses Kuria was accused of trying to hammer out secret political deals.", "AFP Fact Check has found no official evidence of Ruto currently being investigated. We have reached out to the DCI for comment and will update this article in case of a reply.", "While Ruto has been acquitted of corruption charges before, his political opponents continue to accuse him of unscrupulous dealings.", "Meanwhile, his wife Rachel Ruto appeared publicly on June 1, 2020, during Madaraka Day celebrations -- a holiday to commemorate the day Kenya gained internal self-rule.", "Kuria, the lawmaker who was described as a “double agent” in the post, dismissed the claim (in a local language) as “a desperate political move”.", "Africa Check editor Alphonse Shiundu, who has monitored the misinformation landscape in Kenya for several years, described the manipulated headlines as “stories that have existed on the social media grapevine but cannot be verified”.", "“These are stories that can be believed but cannot be verified. They have existed in the social media grapevine but have never been verified and so for banter, rumour and gossip they make very good fodder. However, if you are looking for news, it is not news because it is not verifiable and you can see it is all made up as there is no proof behind it,” Shiundu told AFP.", "Media battling the trend", "Manipulation of media content to score political points is a common trend in Kenya. During the 2017 general election, doctored front pages of the Daily Nation claimed a candidate vying for the gubernatorial seat had defected from his party. The claim, which was also circulated as a print edition in a county in western Kenya, aimed to hurt the candidate’s popularity.", "The Daily Nation flatly disowned the altered frontpage.", "“That was a classic disinformation move to make sure that the candidate did not get a political win. The motive was to delegitimise the politician and sow confusion in the public space so that the voters wouldn’t know what is true and what is false,” Africa Check’s Shiundu commented.", "Legal action", "Media organisations in Kenya are now stamping doctored publications with “fake news” labels and sharing them on their respective social media platforms in a bid to counter widely circulated claims which tend to be confusing to the audience.", "Readers are also encouraged to seek information only on the newspapers' official website and social media accounts, where front pages are normally shared.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]