["A video is viral on social media suggesting that American artist Madonna has sung the Hanuman Chalisa. “Hanuman Chalisa by Madonna”, tweeted Renuka Jain on April 25, with a video of a lady singing a devotional hymn (Hanuman Chalisa) to Lord Hanuman.", "Several other individual users on Twitter and Facebook have shared the video with an identical narrative.", "Alt News used Yandex’s reverse image search feature to determine the artist’s identity. Reverse image searching a frame from the viral video suggested that the name of the band could possibly be ‘Shanti People’.", "The vocalist, who is singing the Hanuman Chalisa, in the viral video is not Madonna as claimed. She is Uma Devi, a vocalist of the group named, Shanti People. We found the viral video posted on the band’s official Facebook page.", "Shanti People – Hanuman Jam (Live at Kyiv)", "First video from the concert Urban Mantras. To Be Continued …", "Shanti People – Hanuman Jam | Live at Kyiv 2015 | Atmasfera 360•", "Vocal – Natasha Uma Bass – Egor Bass Drums – Denis Shvets Tabla – Khola Wala (Nila Gopal)", "Video – ДОКУТОЛОКА Sound – Bogdan Gorlov", "Makeup and Hair style by Dara Dukhnovskaya", "Posted by Shanti People on Tuesday, 26 May 2015", "The caption along with the video on the Facebook page that can be seen in the screenshot posted below clearly states the identities of the individual artists, “Vocal – Natasha Uma”.", "Uma is from Russia and resides in Ukraine, according to her Facebook profile. In the comparison below, on the left is a still (from the video) which is that of Uma, the vocalist of Shanti People while on the right is the American pop star, Madonna.", "“Shanti People is a music band that mix ancient Vedic Mantras with contemporary electronic dance music (EDM)”, stated the about-us section of their official website. This video was earlier debunked by India Today.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]