["• The claims stem from a video analysis of the shooting that killed Ashli Babbitt that depends almost entirely on inference and speculation. The analysis provides no hard proof for its assertions.", "• There remains no evidence that antifa incited the attack on the Capitol. ​", "Some conservative news sites have latched onto a speculative analysis to blame antifa for provoking the fatal shooting of Ashli Babbitt by Capitol Police.", "\"Analysis concludes Antifa provoked shooting of Ashli Babbitt at Capitol,\" read the Jan. 12 headline of an article published by news site WorldNetDaily.", "\"HUGE! Analysis of video of Trump supporter Ashli Babbitt death in the Capitol shows antifa's actions led to shots being fired,\" read the headline of an article published by the Gateway Pundit.", "The articles were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The stories cite a video interview conducted by the Epoch Times, a Trump-supporting news outlet. On Jan. 13 in response to fact checks published by AFP and Lead Stories, WorldNetDaily issued a correction to the article and updated both the headline and subheadline.", "PolitiFact has already examined baseless claims that antifa, a broad left-wing coalition of anti-fascist activists, was behind the Jan. 6 storming of the U.S. Capitol. But we wanted to look more closely at this \"analysis\" that was getting a lot of attention on social media.", "The headline of the Epoch Times video does not directly mention antifa, but it suggests that \"coordinated actions\" resulted in Babbitt’s death. (It also misspells Ashli Babbitt’s name.)", "In the Epoch Times interview, Masako Ganaha, who is described as an independent journalist in Japan, discusses an analysis she did of two videos that documented the shooting of Ashli Babbitt. Babbitt was a U.S. Air Force veteran and Trump supporter from California who died after being shot Jan. 6 by Capitol Police as she joined rioters who overtook the Capitol, disrupting the congressional effort to certify electoral votes in the presidential election. The U.S. attorney’s office has announced that it has opened a federal excessive force investigation into her death.", "In the video, Ganaha points out what she considers to be signs of antifa involvement. Shortly before Babbitt’s shooting, Ganaha says, one rioter, who is wearing a yellow flag like a cape, hands a helmet to another rioter, who uses it to begin to smash the glass on the door to the Speaker’s Lobby. Ganaha says that the hand-off of the helmet illustrates that the two rioters are antifa activists working together to incite the crowd.", "After Babbitt is shot, the person who handed off his helmet is filmed running down a flight of stairs toward police officers and putting an article of clothing in a backpack, Ganaha says.", "\"He was leading the crowd and communicating with the other guy, and he was changing his appearance. How would a Trump supporter do that?\" Ganaha says.", "Ganaha does not provide any hard evidence for her assertions that the two rioters are antifa provocateurs. We reached out to her but haven’t heard back.", "Ganaha also points to John Sullivan, a controversial activist who filmed one of the videos, and describes him as a member of antifa who helped incite the crowd after the Babbitt shooting by repeatedly exclaiming that Babbitt was \"dead.\"", "PolitiFact looked into claims about Sullivan and found that while Sullivan was at the Capitol, he does not identify as antifa nor as a Trump supporter. Rather, he appears to be a polarizing figure on both sides of the political spectrum.", "Sullivan has told a number of news outlets, including PolitiFact, that he attended the Jan. 6 riot to document what happened. He has used anti-Trump and anti-police hashtags in Twitter posts, and he has been filmed using incendiary language in the past. However, Jade Sacker, a documentary filmmaker working on a project about Sullivan, and Sullivan himself have both denied claims that he is antifa-affiliated or that he led the charge on the Capitol.", "The claim builds off the unfounded conspiracy theory that antifa drove the attack on the Capitol.", "The rumor flies in the face of substantial reporting and documentary evidence. The march to the Capitol was weeks in the making, with plans indicating the potential for violence drawn up in the open on social media forums and pro-Trump websites. Video and photographs from the scene show Trump-branded paraphernalia and flags, and well-known far-right personalities and GOP politicians were filmed participating in the riot. Some even broadcast their involvement on live-streams.", "The FBI’s assistant director in charge of the FBI Washington field office, Steven D’Antuono, said in a Jan. 8 call with reporters that there was currently \"no indication\" that antifa activists had disguised themselves as Trump supporters and carried out the Capitol riot.", "An analysis claims that antifa provoked the shooting of Ashli Babbitt.", "The analysis consists of a series of speculative claims and inferences based on video of the Babbitt shooting.", "Those claiming that the pro-Trump mob at the Capitol was incited by antifa have provided no hard proof of their assertions. The claims ignore substantial reporting and documentary evidence that the crowd contained Trump supporters.", "We rate this Pants on Fire! ​", "John Sullivan on Twitter, accessed Jan. 8, 2021", "Jayden X on Twitter, accessed Jan. 8, 2021", "Jayden X on YouTube, \"Shooting and Storming Of The US Capitol In Washington DC (View Discretion Is Advised),\" Jan. 7, 2021", "Buzzfeed News, \"The FBI Says There's No Evidence Of Antifa Involvement In The Capitol Mob,\" Jan. 8, 2021", "Buzzfeed News, \"The Rioters Who Took Over The Capitol Have Been Planning Online In The Open For Weeks,\" Jan. 6, 2021", "CBS News, \"West Virginia lawmaker records himself storming the U.S. Capitol: 'We're in!,'\" Jan. 7, 2021", "Epoch Times, Video: Analysis of Ashli Babbit video suggests coordinated actions–interview with Masako, Jan. 11, 2021", "NBC News, \"Trump loyalists push evidence-free claims that antifa activists fueled mob,\" Jan. 6, 2021", "New York Times, How the Epoch Times created a giant influence machine, Nov. 12, 2020", "Newsguard, The Epoch Times", "PolitiFact, \"Face-painted man in horned fur cap at Capitol riot supports Trump and QAnon, not antifa,\" Jan. 7, 2021", "PolitiFact, \"High-Ranking California Republican Lawmaker Pushes Misinformation About Storming of U.S. Capitol,\" Jan. 6, 2021", "PolitiFact, \"No, facial recognition didn’t confirm antifa infiltrated Trump supporters at the Capitol,\" Jan. 7, 2021", "PolitiFact, Facebook posts wrongly claim left-wing activist, antifa ‘incited’ US Capitol mob, Jan. 8, 2021", "PolitiFact, \"Mo Brooks pushes baseless claim that antifa orchestrated Capitol riots,\" Jan. 7, 2021", "PolitiFact, \"There’s no proof antifa stormed the Capitol. The rumor spread quickly anyway,\" Jan. 7, 2021", "Various searches on the Social Media Analysis Toolkit, Jan. 7, 2021", "United States Capitol Police, \"Statement of Steven Sund, Chief of Police, Regarding the Events of January 6, 2021,\" Jan. 7, 2021", "U.S. Department of Justice, \"Statement of Acting Attorney General Jeffrey A. Rosen,\" Jan. 7, 2021", "U.S. Department of Homeland Security, \"Acting Secretary Wolf Condemns Violence at The U.S. Capitol,\" Jan. 7, 2021", "The Washington Post, \"How pro-Trump insurrectionists broke into the U.S. Capitol,\" Jan. 6, 2021", "The Washington Post, We looked for antifa at the Capitol — we couldn’t find any, Jan. 9, 2021", "WorldNetDaily, Analysis concludes Antifa provoked shooting of Ashli Babbitt at Capitol, Jan. 12, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]