["Videos of a woman shopping in a supermarket have been widely shared on social media. The person recording the videos says that it was shot at a Reliance store and the woman is being unruly. He narrates that she is touching everything on the shelves, sneezing while not wearing a mask and spitting inside a soft drink bottle. He also says that the police has been alerted.", "The videos have been shared with the following claim, “Rani bagh Reliance store m2k pitampura. Today morning One corona doubted lady without mask enter in store n now currently store is sealed so plz be careful.” Pitampura is in northwest Delhi.", "Rani bagh Reliance store m2k pitampura", "Today morning One corona doubted lady without mask enter in store n now currently store is sealed so plz be careful", "Posted by Manish Madan on Friday, 17 April 2020", "One Amit Deshpande, who identifies himself as a ‘men’s rights activist’ on Twitter shared another video of the incident and wrote, “A woman calling herself advocate was found in Reliance Mart, Rani Bagh, Delhi flouting social distancing rules, without mask, touching multiple products/ packets and removed her shirt when security took her out. #IndiaFightsCorona”", "A woman calling herself advocate was found in Reliance Mart, Rani Bagh, Delhi flouting social distancing rules, without mask, touching multiple products/ packets and removed her shirt when security took her out.#IndiaFightsCorona pic.twitter.com/JrZ2rRYkby", "— Amit Deshpande (@antidespondent) April 18, 2020", "The claim is also floating on WhatsApp.", "Upon closely watching the video, we get hints that the man recording the clips is not giving an accurate representation of the events. He says that the woman is spitting everywhere and touching fellow customers, which isn’t true. While she does seem to be in her own world, people around her are shopping per usual without any inconvenience from her end. Moreover, he also says that she spat inside a soft drink bottle but what’s visible is that she picked up a bottle from a rack, took a few sips and kept the bottle with herself. She did not put it back. The narrator is evidently giving an exaggerated version of what is happening before his eyes.", "In one of the videos, we also spot policemen inside the store.", "Therefore, we contacted Rani Bagh police station and were told, “The woman is mentally unstable and has been undergoing treatment for the last 10 years. The incident is unrelated to coronavirus. She stays close to the store in Harsh Vihar. We don’t know why she left home. Right now she is admitted at a mental hospital. She has a history and has been admitted to the mental hospital before as well. She hasn’t been tested for coronavirus.” We were also told the woman’s name which we are not adding to the report to protect her identity. However, the police confirmed that she does not hail from the Muslim community.", "Furthermore, the store hasn’t been sealed unlike being claimed on social media.", "A video of a mentally unstable woman inside a Reliance store in Delhi’s Rani Bagh has been shared with the false claim that an “advocate” was flouting lockdown rules and attempting to spread coronavirus.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]