["A 1:31 minute video showing an elephant being transported in a truck has gone viral on social media. In the video, the elephant struggles to stay inside the truck and tries to get off midway. Indu Makkal Katchi, right-wing Hindu nationalist party in Tamil Nadu, accused PETA India of torturing elephants. PETA India works under the aegis of the American animal rights organisation PETA. The video has been viewed over 58,000 times and retweeted over 3,700 times as of this writing. (archive)", "This is how PETA India took away kanchi mutt elephants.", "The elephant did not want to go, it jumped out of the truck, and the torture PETA did to take her away. @ShefVaidya pic.twitter.com/5cPRWFOS8O", "— Indu Makkal Katchi ( Official ) (@Indumakalktchi) August 2, 2020", "Facebook page ‘The Sanghi Millennial’ also posted the video with the same claim on August 8. The post also mentioned that the video is of 2019 and that PETA India continues to take away animals from temples in this manner. The video was viewed over 1,800 times. (archive)", "Video from Last year.", "This is how PETA India took away kanchi mutt elephants.", "The elephant did not want to go, it jumped out of the truck, and the torture PETA did to take her away.", "Now they want to take Lakshmi Elephant from Puducheri temple but Thanks to the efforts of Indu Makkal Katchi the temple has somehow managed to retain their elephant for now.", "PETA has filed a PIL in Madras highcourt to take away Lakshmi From Temple authorities . BJP MP Menika Gandhi is leading this movement.", "#ASK Yourself Do we really need these #Fake_Gandhis in BJP??", "Join my Telegram channel by clicking this link:-https://t.me/thesanghi", "Follow me on Instagram by clicking this link https://www.instagram.com/the.sanghi/", "Posted by The Sanghi Millenial. on Friday, 7 August 2020", "This video is being widely shared on Twitter and Facebook along with the accusation on PETA India. There were also a few verification requests on the Alt News mobile application.", "Ironically, Indu Makkal Katchi had tweeted this video on June 30 as well, but without any mention of PETA India. The tweet said that a female elephant named Sandhya was taken away by ‘the NGO’ a few years ago. “When a woman called her by her name, Sandhya broke the truck and jumped out, injuring herself,” read the tweet which carries a link to a Youtube video uploaded on July 12, 2016, which includes the same visuals from the video. The identical clip was also shared on a Facebook group on July 30, 2016, where the name of the elephant was said to be Sandhya.", "This is how the NGO took the Sandhya few years ago", "When the Mahot a woman came running and called out her name, Sandhya broke the truck and jumped out.", "Injuring her self.", "There is a full report on YouTube about how sandhya was tortured to take it away from the temple. pic.twitter.com/CSgKNn9Zxb", "— Indu Makkal Katchi ( Official ) (@Indumakalktchi) June 30, 2020", "According to media reports, an elephant named Sandhya stayed in Tamil Nadu’s famous Kamakshi temple along with two other elephants who helped in the operations of the Mutt. As per a report published by Deccan Herald on May 13 2016, the names of these three elephants are Sandhya (43), Indu (34) and Jyoti (22). The report also mentioned that the temple had decided to send the three elephants to Marakkanam camp, citing lack of space and unnatural flooring. Temple functionary Vishwanath Shashtri informed that the responsibility of taking care of the elephants has been laid on the Tree Foundation and that appropriate arrangements will be made for the elephants, including ample space and natural flooring. It also mentioned that of the three elephants, Sandhya got off the truck en-route and had to be kept in a nearby village for a few days. However, she was soon brought to Marakkanam camp and reunited with her mates, Indu and Jyoti.", "We also found an article published on September 28, 2019, by Bangalore Mirror which reported that the three elephants were taken to an elephant rehabilitation centre in Tiruchirappalli on September 27 2019. A judgement based on a PIL filed in the Madras High Court instructed that the three elephants should be sent to a habilitation centre through two private organisations. As per the report, the three elephants resided at the Marakkanam camp for around 3.5 years, under the care of the two organizations. However, the PIL filed in the high court claimed that the private organisations did not have the right to keep the elephants and that the animals have to be sent to the habilitation centre in Tiruchirappalli, which is operated by the forest department. The HC adjudicated in favour of the PIL.", "The New Indian Express reported on September 28, 2019, that the elephants were taken to the Marakkanam camp in 2016 under the care of two NGOs – Tree Foundation and Wildlife Rescue and Rehabilitation Center (WRRC), based on the wishes of the temple functionaries. However, as per the court order, the elephants were taken to the Elephant habilitation centre in Tiruchirappalli.", "No report mentions any link between the elephants and PETA India. On August 2, PETA India responded to Katchi’s tweet denying the claim and on August 7, it tweeted a letter dated May 30, 2016, which clearly mentions that the elephants were sent to Marakkanam camp by the temple.", "The timeline of the whole episode is the following – the temple functionaries sent the three elephants to Marakkanam camp in 2016. After residing there for three and a half years, they were shifted to the forest department’s elephant habilitation centre in Tiruchirappalli based on a judgement by the Madras High Court. The story has no connection whatsoever with PETA India. The video shared by Indu Makkam Katchi accusing PETA India is actually from 2016 when the elephants were being transported from the temple to Marakkanam camp.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]