["A proposed ban on transgender athletes playing female school sports in Utah would affect transgender girls like this 12-year-old swimmer seen at a pool in Utah on Feb. 22, 2021. (AP)", "A study of U.S. Air Force personnel found that after two years of taking hormones, the average transgender woman ran 1.5 miles 12% faster than the average cisgender woman.", "But the strength advantage of transgender women, based on push-ups and sit-ups performed in one minute, disappeared over that same interval.", "A study co-author said that in general, the advantage of transgender women continued to diminish the longer they were on testosterone blockers.", "President Joe Biden on his first day in office signed an executive order saying his administration would enforce laws that prohibit discrimination on the basis of gender identity or sexual orientation, and would address overlapping forms of discrimination.", "\"Children should be able to learn without worrying about whether they will be denied access to the restroom, the locker room, or school sports,\" Biden’s order said.", "In response, Sen. Roger Marshall, R-Kan., argued in a Fox News op-ed that Biden’s order would \"destroy women’s sports,\" because \"letting biological boys compete in biological girls’ high school and college sports\" would give them an unfair advantage.", "Marshall added that hormone treatment doesn’t level the playing field, citing a 2020 study of adults in the military as evidence.", "\"A recent study by the British Journal of Sports Medicine suggests that even after two years of hormone therapy, biological boys still maintain significant advantages over girls, including being 12% faster on the 1.5-mile run,\" wrote Marshall, a former OB/GYN in Kansas.", "PolitiFact decided to take a closer look at Marshall’s characterization of the study. We found that he cherry-picked the study’s findings and misrepresented its conclusions about the effect of hormone treatment. One of the study’s authors told us that he left out important context by focusing on just the speed test.", "Marshall’s office did not respond to our request for more information.", "We’ve looked at other claims that allowing transgender athletes to participate in scholastic sports would \"destroy girls’ sports\" and found little evidence for that.", "Gender refers to the cultural roles, behaviors, activities and attributes expected of people based on their sex, according to the Centers for Disease Control and Prevention. Biologists say that a person’s gender identity may be masculine, feminine, a combination of both or neither, or it may shift over time.", "Transgender describes people whose gender identity differs from the sex they were assigned at birth. Cisgender describes people whose current gender identity is the same as the sex they were assigned at birth.", "The study Marshall cited was not about scholastic or collegiate athletes. It centered on fitness test results and medical records of 29 transgender men and 46 transgender women who began receiving gender-affirming hormones in their mid-20s while in the U.S. Air Force. Researchers compared their pre- and post-hormone performance on speed and upper-body strength tests with the average performance of all women and men under age of 30 in the Air Force between 2004 and 2014.", "The study found that in a speed test based on a 1.5-mile run, the transgender women ran faster than the cisgender women, on average — 21% faster before taking hormones, and 12% faster after two years of hormones. So some advantage remained.", "But on strength tests, based on push-ups and sit-ups performed in one minute, the advantage for transgender women disappeared after two years.", "The study suggested that more than one year of testosterone suppression \"may be needed to ensure that transgender women do not have an unfair competitive advantage when participating in elite level athletic competition.\"", "\"In general, the advantage of trans women continued to diminish the longer they were on testosterone blockers,\" said Dr. Timothy Roberts, director of the adolescent medicine training program at Children’s Mercy Kansas City, and co-author of the study. \"So, for strength or technique-based competitions, Sen. Marshall is misrepresenting our research.\"", "The study said more research was needed to determine \"if guidelines for transgender inclusion in sports need to account for the athlete’s pubertal stage when testosterone or estrogen began.\"", "Anatomical differences triggered during puberty — such as height, pelvic architecture and leg bones — which do not respond to changes in testosterone post-puberty may explain why transgender women retained an advantage in running speed, the study said.", "But that advantage in distance running also needs context, Roberts said.", "While the average transgender woman is still faster than the average cisgender woman after two years on hormones, she is still slower than the top 9% of cisgender women runners, Roberts said.", "\"Advantage? Yes. Destroy women's sports? No,\" Roberts said. \"There are many things that put women's athletics in jeopardy, such as gender bias, lack of funding, unequal pay and unequal access to athletic opportunities, but trans women are not one of them.\"", "There’s no authoritative count of how many transgender athletes have competed recently in high school or college sports, because neither the NCAA nor most state high school athletic associations collect that information, according to the AP. Around 200,000 athletes compete in women’s college sports, and based on a researcher’s estimate, about 50 are transgender, the New York Times reported.", "Overall, there’s limited research on transgender athletes. The few studies available have been carried out in different populations and don’t consistently measure the same physiological factors or use the same outcome variables, so they cannot not easily be translated to a particular sport, said Katrina Karkazis, a cultural anthropologist and a senior research fellow with the Global Health Justice Partnership at Yale University.", "The problem with trying to do studies on athleticism in general is that there are too many variables to consider, including myriad biological factors, psyche, nutrition and training, Karkazis said.", "NCAA policy requires that transgender women complete one year of testosterone suppression treatment before competing on a women’s team.", "But the policy document says, \"according to medical experts on this issue, the assumption that a transgender woman competing on a women’s team would have a competitive advantage outside the range of performance and competitive advantage or disadvantage that already exists among female athletes is not supported by evidence.\"", "Marshall claimed that a study \"suggests that even after two years of hormone therapy, biological boys still maintain significant advantages over girls, including being 12% faster on the 1.5-mile run.\"", "The study he cited involved U.S. Air Force personnel who were mostly in their mid-20s, and it focused on only two measures: upper-body strength and running speed. After two years of taking hormones, the study found, the average transgender woman ran 12% faster than the average cisgender woman, compared with 21% faster before treatment.", "On a strength test, the same study found, the advantage of transgender women disappeared over that same interval. Experts say there’s limited research on transgender athletes, and little evidence that transgender women are dominating women’s sports.", "Marshall’s claim cherry-picks the findings of the study, and one of the authors of the study said he misinterpreted its conclusions.", "We rate the claim Mostly False.", "Fox News op-ed by Sen. Roger Marshall, R-Kansas, Sen. Roger Marshall: Biden's gender discrimination executive order will destroy women's sports, March 1, 2021", "NBC News, Trans women retain athletic edge after a year of hormone therapy, study finds, Jan. 5, 2021", "Email and phone interview, Dr. Timothy Roberts, director of the adolescent medicine training program at Children’s Mercy Kansas City, March 4, 2021", "Phone interview, Katrina Karkazis, a cultural anthropologist and a senior research fellow with the Global Health Justice Partnership at Yale University, March 5, 2021", "AP, Lawmakers can’t cite local examples of trans girls in sports, March 3, 201", "Roberts TA, Smalley J, Ahrendt D. Effect of gender affirming hormones on athletic performance in transwomen and transmen: implications for sporting organisations and legislators. British Journal of Sports Medicine Published Online First: 07 December 2020. doi: 0.1136/bjsports-2020-102329", "Jones, Bethany Alice et al. \"Sport and Transgender People: A Systematic Review of the Literature Relating to Sport Participation and Competitive Sport Policies.\" Sports medicine (Auckland, N.Z.) vol. 47,4 (2017): 701-716. doi:10.1007/s40279-016-0621-y", "Travers A, Deri J. Transgender inclusion and the changing face of lesbian softball leagues. International Review for the Sociology of Sport. 2011;46(4):488-507. doi:10.1177/1012690210384661", "WhiteHouse.gov, Executive Order on Preventing and Combating Discrimination on the Basis of Gender Identity or Sexual Orientation, Jan. 20, 2021", "Centers for Disease Control and Prevention, Adolescent and School Health: Terminology", "United Nations Free & Equal, FACT SHEET: Intersex", "NCAA Inclusion ofTransgender Student-Athletes, August 2011", "NCAA, Number of NCAA college athletes reaches all-time high, Oct. 10, 2018", "New York Times, Who Should Compete in Women’s Sports? There Are ‘Two Almost Irreconcilable Positions’, published Aug. 18, 2020, updated Aug. 19, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]