["About this rating", "The remote Rocky Mountain city of Casper, Wyoming, was rumored to be the home of a so-called “wind turbine graveyard,” a large swath of land where retired, non-recyclable wind turbine blades are buried in mass quantities.", "A social media post that was shared on Facebook nearly 2,000 times in early October 2020 claimed to bring attention and “open your eyes to the environmental issues with windmills” that had been “wasted and decommissioned.”", "Snopes readers asked our team to investigate the legitimacy of the Wyoming \"wind turbine graveyard,\" which we found to be real and reported on by a number of credible publications in 2020, including Bloomberg and NPR, as well as other publications that have more obvious agendas aimed at stopping the so-called “great wind power fraud.” (The photos shared in the social media post are also real and can be found on Getty Images here and here.)", "It is true that there is a landfill in Casper, Wyoming, that does accept decommissioned and damaged wind turbine blades and motors, both of which are not recyclable. However, it is important to highlight that up to 90% of a wind turbine is recyclable. That one-tenth of a windmill is not recyclable does not necessarily negate its overall green energy production over the course of its 20- to 25-year lifetime.", "Nearly an entire wind turbine can be recycled with the exception of its blades, which are largely made of composite and fiberglass materials and built to withstand some of nature’s most destructive forces, making them very difficult to recycle or crush in the first place. Because the average wind turbine in the United States measures about 280 feet tall, they are prone to environmental and natural damage, such as normal weathering from storm systems with high winds and hail, lightning strikes, and birds. Many wind farms will employ blade service technicians to repair damaged blades. However, when the cost of a repair outweighs its benefit — or the blade is simply not salvageable — they are disposed of in a variety of ways, including being buried.", "“Wind farms repurpose and recycle 90% of all the materials in a wind turbine; the only material not recyclable is fiberglass; the blades and motor housing are the only fiberglass components,” note Casper city records.", "City documents published in August 2020 outlined the Casper Regional Landfill (CRL) Wind Turbine and Motor Housing Project, which contains a construction and demolition cell built for special waste projects to generate revenue and keep landfill fees low for regional users. One of the uses of that cell is to house turbine fiberglass blades and motor housing units that are to be disposed of and buried in order to minimize landfill space above ground.", "CRL first began accepting decommissioned blades in May 2019 and expects to run until spring 2021. According to a Sept. 22, 2020, fact sheet (page 7) submitted to the city by Casper Public Services Director Andrew Beamer and Solid Waste Division Manager Cynthia Langston, the solid waste facility had received 1,124 turbine blades from three neighboring wind farms as of Sept. 16, 2020, totaling approximately $444,000 dollars in revenue for the fiscal year 2020. In the 2021 fiscal year, 250 shorter turbine blades have been received and another 250 are expected, for a total of $35,000 in anticipated revenue.", "Fiberglass is inert and considered nonhazardous when buried. To save space, the city said that 120-foot-long turbines are cut into three 40-foot lengths and the smaller sections placed within the larger pieces. Each turbine blade is then buried within a cell that measures a maximum of 44 cubic yards, or about the size of about three concrete mixer trucks.", "As of October 2020, the city of Casper only accepts waste from the state of Wyoming and any out-of-state customer wanting to dispose of blades in CRL would require a permit amendment filed with the Wyoming Department of Environmental Quality.", "\"Wyoming Utility Supports Recycling Wind Turbine Blades.\"\r\n    The Associated Press.   23 September 2020.", "Fike, Ellen.   \"Casper Regional Landfill Now Taking in Hundreds of Decommissioned Wind Turbine Blades.\"\r\n    Wind Watch.   7 October 2020.", "Griffith, Keith.   \"Not So Green Energy: Hundreds of Non-Recyclable Fiberglass Wind Turbine Blades are Pictured Piling Up in Landfill.\"\r\n    Wind Watch.   7 May 2020.", "Cosper, Caitlin.   \"Wind Turbine Blades Cause Issue with Waste.\"\r\n    Choose Energy.   Accessed 27 October 2020.", "\"The Big Cover Up: Wind Industry Burying Millions of Toxic Turbine Blades in Landfills.\"\r\n    Stop These Things.   13 May 2020.", "Martin, Chris.   \"Wind Turbine Blades Can’t Be Recycled, So They’re Piling Up in Landfills.\"\r\n    Bloomberg.   5 February 2020.", "\"Wind Turbine Heights and Capacities Have Increased Over the Past Decade.\"\r\n    U.S. Energy Information Administration.   29 Nov 2017.", "Cotton, Max.   \"An Update on Casper's Landfill Wind Turbines Project.\"\r\n    Wyoming News Now.   23 September 2020.", "Correction [Oct. 28, 2020]: A previous version of this article incorrectly stated that CRL had generated $440 million in revenue. That number is actually $440,000.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]