["About this rating", "As Sen. Marco Rubio (R-Fla.) came under scrutiny for his position on gun control in February 2018 following a mass school shooting in his state, a meme containing two quote ostensibly uttered by the senator about felons and their right to own guns gained renewed attention online:", "This meme was originally posted to the now defunct Facebook page \"Stop The World The Teabaggers Want Off\" in 2015. This Facebook group was well-known for creating fake quotes and attributing them to various politicians. A disclaimer in the group's \"About\" section read:", "This page is for entertainment purposes. It is NOT meant to be taken seriously. It is primarily satire and parody with a mix of political memes and messages.", "We found no record of Rubio uttering either of these phrases on the dates in the meme (or at any other time) in any credible publication. When we searched for Rubio's position on felons owning guns, we also found that the above quote may not represent the Senator's political stance on the issue. After the school shooting at Sandy Hook Elementary School in 2012, for instance, a spokesperson for Rubio said that the senator was open to gun control measures that would keep weapons out of the hands of criminals:", "“In the aftermath of the unspeakable tragedy in Newtown, Sen. Rubio, like millions of Americans, is looking for public policy changes that would prevent such a horrible event from happening again,\" Alex Conant, Rubio's communications director, said in a statement. \"He remains a strong supporter of the Second Amendment right to safely and responsibly bear arms. But he has also always been open to measures that would keep guns out of the hands of criminals and the mentally ill. The challenge with gun laws is that by definition criminals do not follow the law. For example, Connecticut's gun laws, some of the strictest in the nation, were not able to prevent this atrocity. Nevertheless, he supports a serious and comprehensive study of our laws to find new and better ways to prevent any more mass shootings.\"", "Rubio has not taken an official stance on restoring the voting rights of felons, as far as we can tell, but the senator's state does prevent millions of former criminals from voting. Furthermore, while campaigning for the senate in 2009, Rubio appeared to criticize his opponent, Charlie Crist, for \"restor(ing) the rights of felons to vote automatically in Florida.\" That was nearly a decade ago, however, and may not reflect Rubio's current stance on the issue.", "The Sun Sentinel.   \"Florida Should Restore Ex-Felon Voting Rights.\"\r\n    31 August 2016.", "Jennings, Natalie.   \"Rubio Open to Changes in Gun Laws.\"\r\n    The Washington Post. 17 December 2012.", "Berman, Ari.   \"Marco Rubio Wants You to Wait 6 Hours to Vote.\"\r\n    The Nation.   1 February 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]