["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ken Zarifis speaks during public comment time of the Austin Independent School District board of trustees meeting, Monday, Sept. 24, 2018. (Stephen Spillman / for American-Statesman)", "This week, the Texas Education Agency announced it would give parents a choice of sending their kids to classrooms or continuing to teach them online for the fall semester. Regardless of what they choose, in-person instruction will be offered on a daily basis, the education agency said, meaning many teachers will be back in schools come August.", "The news didn’t sit well with many educators across the state, including members of Education Austin, the area’s school employees’ union.", "During a July 8 press conference, Education Austin President Ken Zarifis criticized the agency’s decision.", "\"What is selfish is a commissioner that requires teachers and workers returned to unsafe environments,\" he said. \"That is the person that is selfish. All the while he has closed his offices at TEA through January. The hypocrisy of this is palpable.\"", "Similar allegations have circulated online since the TEA’s announcement, but are they true? Is the Texas Education Agency requiring teachers to return to work while their office is closed through January?", "TEA gives staffers choice to return this month", "When asked about the source of the info, Zarifis said he had seen it referenced in several social media posts and on the TEA website. Later, Zarifis said he misspoke, and said he was unable to find any post that mentioned the offices staying closed through January.", "The TEA website says agency employees began a mandatory telework policy on March 17, and the office is not accepting visitors at this time. But Morath and at least 30 other employees have been working in the office since March, according to TEA spokesman Frank Ward.", "\"Commissioner Morath and other Texas Education Agency staff whose job duties require them to be in the office have been working from the William B. Travis Building since March — just as they did before the pandemic hit,\" Ward said in an email.", "Also, starting this month, all TEA staff have the ability to return to the building on a voluntary basis this month, Ward said, but did not specify how many people had chosen to return so far.", "\"Based on local public health conditions, the individual and the family needs of our team, and the agency’s organizational needs, we are currently determining additional next steps for our staff for later this summer and beyond,\" he said.", "Meanwhile, the number of teachers who will be physically in classrooms this fall depends on the local needs of students and parents in each individual district, said Ward.", "While the agency is requiring districts to offer in-person classes, some parents may opt to keep their children at home, and thus, lower the demand for teachers who are physically in classrooms.", "Under Gov. Greg Abbott’s statewide mask mandate, all people on campus over 10 years old will be required to wear masks, presuming that the order is still in effect when classes resume.", "Our ruling", "The president of the Austin school employees’ union said the leader of the Texas Education Agency is requiring teachers to return to classrooms while keeping his offices closed through January.", "While the new rules for the fall semester do mean that some teachers will have to go back into school buildings, it doesn’t look like Morath is hunkering down through January — in fact, he’s been in-office since March, along with other staff who are deemed essential.", "Although it’s unknown how many TEA staffers are back in the office at this moment, they did have the option to begin returning this month.", "We rate this claim False.", "Ken Zarifis, at an Education Austin press conference, July 8, 2020", "Text message exchange with Ken Zarifis, July 9, 2020", "Email exchange with the press office in the Texas Education Agency, July 8, 2020", "Email exchange with TEA spokesman Frank Ward, July 9, 2020", "Phone calls with TEA spokesman Frank Ward, July 9, 2020", "The Texas Education Agency, \"TEA office hours during COVID-19.\" July 9, 2020", "Tweet from user @FrozenNoober, July 7, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]