["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "A message supposedly written by Spirit Halloween announcing they would not open their seasonal stores in 2020 was widely circulated on social media in the weeks leading up to the fall holiday:", "This message did not originate with Spirit Halloween. As of this writing, the horrific holiday store is still planning to open in time for Halloween 2020.", "Spirit Halloween addressed the rumor in a Facebook post dated June 28, writing:", "Dear Halloween Fans,", "We heard you're crushed, disheartened, and downright sad. Well, don't worry, the rumors aren't true.", "WE ARE BACK & WE GOT THIS COVERED", "We are safely preparing the best in-store experience possible and can't wait to welcome you back at our 1,400 locations Nationwide - popping up this August! It's been a challenging year, but we promise to keep the Halloween spirit alive.", "Come early, come often and help make this year the #BestHalloweenEver.", "A few days later, Spirit Halloween posted a message announcing that they were hiring for the upcoming season. The store's social media pages are also full of posts about their excitement for Halloween in 2020.", "The \"Store Locator\" page on the Spirit Halloween website also shows several locations scheduled to open before Halloween 2020. In the Chicagoland area, for instance, stores are scheduled to open in mid-August.", "Spirit Halloween did not announce that they were canceling planned store openings in 2020 due to the COVID-19 pandemic. As of this writing, the Halloween store is still scheduled to open its seasonal stores.", "Haidet, Ryan.   \"Spirit Halloween Rejects 2020 Closure Rumor, Company Says Stores Will Open Nationwide Soon.\"\r\n    ABC Action News.   28 August 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]