["About this rating", "Many licensed plumbers recommended salt as one of several ingredients to remove drain clogs and drain flies. In some recipes, it was advised to let the ingredients sit overnight.", "We were unable to find a consensus of licensed plumbers that advised pouring nothing but salt down drains at night once or repeatedly, as implied in an online advertisement. Further, the advertisements that said to \"pour salt down your drain tonight, here's why\" led to lengthy stories that never mentioned anything about pouring salt into drains at night.", "What are those online advertisements all about that say to \"pour salt down your drain tonight\"? We previously reported about ads that hinted at the effectiveness of pouring dish soap in toilets, tubs, and sinks. Dish soap, along with water heated to a low to medium temperature, can potentially help remove common and minor household clogs.", "A misleading advertisement.", "\"Pour Salt Down Your Drain Tonight, Here's Why\" was the text in an advertisement in December 2020, although it perhaps had first been displayed long before. Readers who clicked the advertisement were led to a 31-page slideshow story at the website The Delite. That story did not feature the same picture of salt being poured into a drain, nor did it include a tip about pouring salt down a drain at night, before bed.", "We looked into whether licensed plumbers recommended pouring salt down drains at night or at all. As we also mentioned in our dish soap story, it is potentially dangerous to pour boiling water into drains. Several Twitter users learned this the hard way.", "Red Lilly Plumbing published tips on unclogging drains, and the company's advice included mentions of salt. The Los Angeles-based licensed plumbers shared this helpful advice about the use of boiling water, vinegar, baking soda, and salt:", "Boiling Hot Water", "Clogged sinks can be remedied with boiling water. Hot water won’t do it — boiling is the key to dissolving any organic matter in your sink. Be advised though: Don’t use boiling water if you have PVC pipes, as the heat could cause the joints to loosen. In addition, make sure to never pour boiling water directly down a porcelain sink as it can crack. Use a large kettle or funnel to pour the boiling water down the drain if necessary.", "Vinegar and Baking Soda", "If boiling water alone doesn’t clear a sink, you can try using vinegar and baking soda. Start by pouring half a box of baking soda down your drain. Next, pour half a cup of vinegar down the sink and then stop the drain with a metal stopper —vinegar and baking soda produce a “volcanic” reaction. Allow this to sit for 30 minutes before pouring boiling water down the drain.", "Baking Soda and Salt", "Baking soda is great for cutting grease in clogged sinks. When it comes to clog removal, mix one part of baking soda with one part salt and four parts of boiling water. Dump this mixture down the drain and let it sit overnight. Flush your drain with hot water in the morning.", "Other licensed plumbers mentioned salt as well. Pittsburgh-based Terry's Plumbing advised using salt in a recipe for cleaning drains and letting it sit \"overnight.\" This was perhaps the sort of thing the online advertisement for The Delite was hinting at, even though it made no mention of this method in its 31-page story.", "The Roto-Rooter Plumbing company, which was founded in 1935, also published a YouTube video that showed salt can be effective in getting rid of drain flies:", "The video's description included more information:", "The good news is that you can eliminate pesky drain flies using items and products you probably already have in your house. For instance, salt, baking soda, vinegar, hot water, a pan, and a cup. Supplement these items with a pest strip and some flypaper, and you'll be able to catch all the adults that are buzzing around the area.", "Pour a cup of salt down the drain. Next pour a cup of baking soda into the drain. Then pour in a cup of vinegar. Let sit overnight. The next morning, pour in the hot water. If you have a stainless steel, cast iron, or copper sink, you can pour in boiling water. But if your sink is made of composite material, it could crack if you pour in boiling water, so just use hot tap water instead.", "Put out the flypaper or pest strips to catch the drain flies that are buzzing around the room.", "It's true that some licensed plumbers recommend salt as one of several ingredients that may help deal with clogs and drain flies. However, we were unable to find a consensus from professionals regarding pouring a little bit of salt down drains on a nightly basis, or on the regular in any way, as The Delite's advertisement appeared to be suggesting.", "Perhaps the best tip of all is to call a licensed plumbing company for advice.", "If you are a licensed professional and have feedback on this story, please let us know.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]