["The video was published here in a Facebook post on September 30, 2019. It has been viewed more than 18,000 times.", "The post’s caption states: “This afternoon at Keppel Shipyard cantenn,Myanmar vs China Shipyard workers.”", "Below is a screenshot of the misleading post:", "Keppel Shipyard is based in Singapore. Here is its official website.", "The claim is false, however; the video is being shared in a misleading context and actually shows an incident at a gas processing plant in Russia.", "AFP conducted a reverse image search of a keyframe extracted from the video using verification tool InVid and found this report published by Russian news site Steer.ru on September 12, 2019. It article describes a fight which broke out between workers at a gas processing plant in Amur Oblast, Russia.", "The report’s Russian-language headline translates to English as: “Workers started a vicious brawl in factory canteen: video.”", "The report’s first paragraph translates to English as: “A video of workers brawling in Amorskiy gas processing plant in Svobodny was picked up by social networks today. The internet exploded with images of Amorskiy plant workers brawling during lunchtime today at the canteen. The reasons the fight broke out are still unclear, however a number of active users say it may have been caused by personal tensions.”", "Svobodny is a town in Amur Oblast, Russia.", "A screenshot of the video was also included in this article published by Russian-language site 2x2.su on September 16, 2019.", "Below is a screenshot of the article:", "The article’s headline translates to English as: “Amorskiy plant workers fired after fight.”", "The photo’s caption translates to English as: “Management said gross violations of worker discipline lead to the dismissals.”", "The first two paragraphs translate to English as: “All workers who took part in the Amorskiy plant canteen fight were fired. The dismissals were made because gross violations of work discipline occurred.", "“Those involved in the incident were identified. It took place on September 12 in one of the canteens in the workers’ village on the construction site of the Amorskiy gas processing plant.”", "This is the plant where the fight was reported to have broken out.", "In an email to AFP on October 8, 2019, a representative from Keppel Corporation said the incident did not happen within the Keppel facilities in Singapore.", "The Singapore Police Force also stated the video in the misleading posts was not filmed in Singapore in this Facebook post on October 1, 2019.", "The post’s caption stated: “[MASS BRAWL DID NOT HAPPEN IN SINGAPORE]", "“The Police would like to clarify that the video circulating online that showed a mass brawl involving workers did not happen in Singapore.", "“Members of the public are advised not to spread untruths which can cause unnecessary public alarm.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]