["The image was published on Facebook here on March 16, 2021.", "The photo shows Prime Minister Rajapaksa shaking hands with Kavinda Jayawardena, an opposition member of parliament. Jayawardena is part Samagi Janabalawegaya, an opposition coalition led by prominent politician Sajith Premadasa.", "The Sinhala language text superimposed below the image translates: “Eight of Sajith's MPs cross over to the government”.", "The image was also shared alongside similar claims on Facebook here and here.", "The claim, however, is misleading.", "The image actually shows a meeting between Rajapaksa and Jayawardena in May 2019, when Rajapaksa was leader of the opposition.", "A reverse image search found the photo published on Rajapaksa’s official Facebook page here on May 06, 2019.", "The post is captioned: \"A copy of a letter prepared by the Catholic Members of Parliament of the UNP, containing suggestions on how to move forward as a nation following the deadly terrorist attacks on Easter Sunday was handed over to me by Member of Parliament Kavinda Jayawardena.\"", "Below is a screenshot comparison of the photo in the misleading post (L) and the 2019 photo from Rajapaksa’s Facebook page (R):", "SJB spokesperson Rasika Jayakody also denied a group of opposition lawmakers joining the governing coalition, telling AFP by WhatsApp on March 18, 2021, that the claim is “absolutely false”.", "There are also no credible media reports or official statements to support the claim.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]