["Sen. Bernie Sanders, I-Vt., argued in a CNN town hall that a major sign of inequality can be seen in how much people pay for housing.", "\"I believe something is wrong in America today when you've got millions of families paying 40, 50, 60% of their limited incomes to put a roof over their heads,\" Sanders said.", "Are millions of American families spending more on housing than almost anything else combined? We looked into the burden of housing for American families.", "Sanders was talking about renters, a spokesperson for the Sanders 2020 campaign told PolitiFact. The campaign cited a study from the National Low Income Housing Coalition that said 10.7 million renter households spent more than half of their income on housing in 2017.", "In 2016, households that spend over half of their total income in housing included about 11 million renters (out of 43.76 million renting households) and 7.5 million owners (out of 75 million owning households) nationwide, according to the Joint Center for Housing Studies at Harvard University. The center crunched the numbers from the American Community Survey data.", "These families are considered \"severely housing cost-burdened\" by the Department of Housing and Urban Development.", "The category of moderately cost-burdened (with 30 to 50% of income spent on housing) families add another 9.8 million to the renter households and 7.5 million to the owner households.", "HUD uses the 30% threshold to determine if a household is house cost-burdened — a rule long been applied in academic research that families should spend no more than 30% of income on housing.", "Rent burden, or the share of rent over household income, measures housing affordability and indicates quality of living. The median rent burden for American families was 25.4% in 2014, an analysis from the Organisation for Economic Co-operation and Development (OECD) found. The median mortgage burden is 15.9%. The United States has the 15th highest median rent and mortgage burden among its OECD counterparts.", "Over the years, the renters’ burden has not improved. Former HUD secretary Shaun Donovan in 2014 pushed for housing finance reforms, saying, \"This is the worst rental affordability crisis this country has ever known,\" according to HousingWire’s reporting.", "Heavier burden of rent has not only affected lower-income households. More higher-income families have become cost-burdened, according to a report by the Harvard Joint Center for Housing Studies.", "Studies by the Harvard Joint Center for Housing Studies suggest that in 2001, 42% of American renter households spent more than 30% of their income to put a roof over heads. In 2016, the percentage of households has grown to 47%.", "Sanders said that \"millions of families\" are paying \"40, 50, 60% of their limited incomes to put a roof over their heads.\"", "The most recent data shows that he’s right about both homeowners and renters all across the United States: there were about 18.5 million households spending more than 50% of their income on housing alone in 2016.", "We rate his statement True.", "CNN, Student asks Bernie Sanders about 'failures of socialism', April 22, 2019", "Pew Research Center, For most U.S. workers, real wages have barely budged in decades, Aug. 7, 2018", "Email interview with Kerry Donahue, Associate Director of Communications at Joint Center for Housing Studies at Harvard University, April 23, 2019", "Email interview with Sarah Ford, Deputy Communications Director for Sanders 2020 campaign, April 23, 2019", "Harvard Joint Center for Housing Studies, Measuring Housing Affordability:", "Assessing the 30% of Income Standard, Sept. 2018", "Joint Center for Housing Studies at Harvard University, Measuring The Nation’s Rental Housing Affordability Problems, June 2005", "Harvard Joint Center for Housing Studies, State of the Nation’s Housing 2018, Table W-22: State–Cost-Burden Rates for Renters and Owners: 2016", "Housing Costs Over Income, PDF and XLSX, Updated Feb.13, 2019", "Department of Housing and Urban Development, Rental Burdens: Rethinking Affordability Measures, Accessed April 23, 2019", "HousingWire, HUD’s Donovan: This is the worst rental crisis in this nation, ever, April 22, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]