["About this rating", "Much like the hubbub generated by a faux trailer for a Friends movie reunion, a pair of teasers released in January 2018 for a purported sequel to the movie Crocodile Dundee drew not only attention, but skepticism.", "Titled Dundee: The Son of a Legend Returns Home, the supposed film -- which also has its own web site and Internet Movie Database (IMDb) listing -- would star Danny McBride as Brian Dundee, the long-lost son of the titular Aussie adventurer (Paul Hogan).", "Thor star Chris Hemsworth is also billed to appear as Wally Jr., the son of the elder Dundee's sidekick.", "People magazine added to the speculation by publishing an \"exclusive\" story on 19 January 2018 to coincide with the posting of the first teaser, featuring a quote attributed to McBride:", "I'm not going to lie to you, to be a real Crocodile Dundee, I think 95% of it is the vest and then 5% is just being able to not fall down and stay on your feet.", "But the Sydney Morning Herald reported on 22 January 2018, citing unnamed sources, that the clips are actually teasing an advertisement for the Tourism Australia campaign that will air during Super Bowl LII on 4 February 2018. Hemsworth, a native of Melbourne, has been an ambassador for the campaign since January 2016.", "Also, while the teasers for the new Dundee bill it as a release from Screen Australia (which also released the original 1986 film and its 1988 sequel Crocodile Dundee II), it is not listed in the company's slate of upcoming releases filmed in the country.", "According to the Morning Herald, the teasers also drew suspicion because the director listed for them, Steve Rogers, is a veteran advertising director in Australia.", "We contacted Screen Australia seeking comment but had not heard back by press time.", "Hughes, William. \"What Is Up With This Fake-Ass Looking Trailer for Danny McBride as the Son of Crocodile Dundee?\"\r\nThe AV Club. 20 January 2018.", "Tourism Australia. \"Chris Hemsworth Announced as Tourism Australia's New Global Ambassador.\"\r\n25 January 2016.", "Russian, Ale. \"Danny McBride Is Crocodile Dundee's Son in Exclusive First Look at Mysterious Project.\"\r\nPeople. 19 January 2018.", "Moran, Rob. \"Crocodile Dundee Reboot Outed as Advertising Campaign for Tourism Australia.\"\r\nSydney Morning Herald. 23 January 2018.", "D&AD. \"The Secret Life of Steve Rogers.\"", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]