["A video of a woman brutally thrashing a little girl is being shared on social media. In the video, the woman can be seen holding the girl by her hair and beating her with what seems like a slipper. Columnist and author Tarek Fatah tweeted the video with the claim that the incident took place in Pakistan and that such kind of “severe beating” is normal among Punjabi families. Fatah tweeted, “Cruel Pakistani mother inflicts severe beating on her daughter. This is the fate of countless children in a practice seen as normative among most Punjabi families.” Alt News has not embedded the video in this report owing to its disturbing nature.", "The video has been making rounds on social media the past few days with several individuals demanding strict action to be taken against the woman. It has been circulating in the Pakistani social media ecosystem as well, gaining thousands of views. One Sania Abbasi posted the video on November 13, 2019.", "A few social media users also shared the video with claims suggesting it to be from India. Journalist Aadesh Rawal tweeted the video requesting Delhi police to take cognizance of the matter.", "It is being shared by multiple users on Facebook making an appeal to widely circulate the clip so that the woman is caught. “भाईयो अप सभी से हाथ जोड़ कर विनती है इसको पकड़वाने का काम करे जो इस मासूम सी बच्ची पर कहर ढा रही है,आपको इस बच्ची की दुआ लगेगी, इंसानियत के नाते ज्यादा से ज्यादा शेयर करे ताकि ये कमीनी पुलिस के हाथ लग सके। आपको मासूम बच्चो की दुआ लगेगी,” reads the complete text.", "Alt News found that the video is from Kathua district, Jammu & Kashmir. We came across a tweet by local journalist Ashish Kohli who informed that the video is from Nagri area of Kathua.", "Horrible Video Viral on Social Media.", "Cruel Mother brutality beating her daughter at Nagri area of Kathua #Jammu", "Police investigating the whole matter. pic.twitter.com/7ik9N4pjtJ", "— Ashish Kohli 🇮🇳 (@dograjournalist) November 16, 2019", "JK Media, a news organization based out of Jammu & Kashmir, reported that the video was found to be from Nagri after investigation. The girl, five years of age, was brutally thrashed by her own mother. According to the report, the police have summoned the parents of the child.", "Horrible Video Viral on Social Media.", "Cruel Mother brutality beating her daughter at Nagri area of Kathua.", "Posted by JK MEDIA on Friday, 15 November 2019", "J&K police have reportedly taken cognizance of the matter. According to them, the woman in the video was beating her daughter while the father was secretly shooting the video. A complaint has been lodged by the Child Welfare Committee. While the police are investigating the matter further, a family dispute could be the motive behind the crime. The parents have been detained.", "Follow Up : Horrible Viral Video of Nagri #Kathua", "Mother detained by Police who brutally thrashed her 5 years old daughter.", "Posted by JK MEDIA on Saturday, 16 November 2019", "A video of a woman thrashing her daughter was shared with the false claim that it was shot in Pakistan. However, the video is from Kathua, J&K and the police have detained the accused parents.", "[Update: The parents have been reportedly detained by the police. An earlier version of this article said that they were arrested. The same has been reflected in the report.]", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]