["A photograph circulating on social media, accompanied with an elaborate caption, claims that the Modi government kept its promise of transforming “Benaras into Kyoto, Japan and built such a magnificent building in Godowlia that it has become a topic of discussion for the entire world.” The post goes ahead to add, “सेक्यूलर मीडिया इस विकास को कभी नहीं दिखाएगी (secular media will never show you this development)”, and asks people to widely share the image so that “the ones criticising PM Modi shut up.”", "Shared from the Facebook profile of one R.S Nagar on July 10, the photograph had over 23,000 shares at the time of writing this article.", "Posted by R.S. Nagar on Tuesday, 10 July 2018", "It was also circulated by the Facebook page ‘Modi Mania’ on July 13 and attracted over 1,800 likes and 1,200 shares. The page has nearly 2.5 lakh followers.", "Individual users have also shared the photograph on Facebook.", "In 2016, the image, with the identical caption, was circulated by the Facebook page ‘Viskas Ke Bau’ as a satirical post. The tone itself gives away the humour – “गोदौलिया से हाईवे निकल कर सीधा अस्सी घाट जाता है| बीच में यह बिल्डिंग में से घुसते हुए बीएचयू की तरफ निलकता है। (The highway starts from Godowliya and directly goes to Assi Ghat. In the middle, it enters a building and directly reaches BHU).", "Alt News reverse searched the image on Google and found that the highway being shown is Nanpu bridge in Shanghai, China. The cable-styled bridge was the first bridge to cross the Huangpu River from central Shanghai and opened to the public in 1991.", "Infrastructural images from different countries are often circulated as an “Indian development”. Last year, Chhattisgarh PWD minister Rajesh Munat passed off a Vietnamese bridge as one in Raigarh; a digital impression of Rajkot Bus stand was circulated by many as the real image; the Ministry of Roads, Transport and Highways posted pictures of roadways from US and Canada on its parivahan website. As there have been several such instances in the past, one must always do a quick Google search before believing “development” photographs circulating on social media.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]