["“Hindu women in car. #DesertGOats caught Hindu man, they started threatening the family Horror situation, 4-5 #GOats, one hindu man and hindu woman, fear of murder of Hindu man and rape, murder of Hindu woman. They looted the Hindu man and women and ran away, This could be YOU..”", "A video showing an armed robbery has been shared on social media with the above narrative. The video clip is 45 seconds long and shows bike-borne assailants targeting an SUV before fleeing the spot. The below post is by a Facebook page ‘Kashmiri Hindu Front-KHF’.", "Hindu women in car. #DesertGOats caught Hindu man, they started threatening the family Horror situation, 4-5 #GOats, one hindu man and hindu woman, fear of murder of Hindu man and rape, murder of Hindu woman They looted the Hindu man and women and ran away, This could be YOU..", "Posted by Kashmiri Hindu Front – KHF on Tuesday, October 29, 2019", "The video was shared with an identical narrative on Twitter by a user Khushi Singh, who later deleted the tweet.", "It may be noted that there is no reference to the location of the incident. The messages simply allege that members of the Hindu community have been specifically targeted.", "Alt News took a frame from the video and reverse-searched it on Google. We found links to Pakistani websites, according to which the incident had taken place in Karachi. These links were from August 27, 2019.", "On further probing, we found the video clip posted on YouTube on a YouTube channel named after the news outlet Dawn. The video was titled, ‘Karachi mein 4 kam umar dakuon ki loot mar’ (‘4 underage robbers in Karachi’). According to a report by Geo News, four boys were involved in the robbery which took place at Hill Park in Karachi. Two boys, both minor, were arrested whereas two others were absconding. The incident had taken place on August 25, 2019.", "A video showing a robbery at gunpoint, which took place in Karachi in August 2019, has been shared on social media with a communal narrative, claiming that Hindus have been targeted.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]