["About this rating", "The legend of the \"well to Hell\" is one that particularly appeals to some Christian groups as offering confirmation that Hell (and therefore God) exists:", "Geologists working somewhere in remote Siberia had drilled a hole some 14.4 kilometers deep (about 9 miles) when the drill bit suddenly began to rotate wildly. A Mr. Azzacov (identified as the project's manager) was quoted as saying they decided that the center of the earth was hollow. Supposedly, the geologists measured temperatures of over 2,000 degrees in the deep hole. They lowered super sensitive microphones to the bottom of the well, and to their astonishment they heard the sounds of thousands, perhaps millions, of suffering souls screaming.", "Popular endings to the story have it that scientists (the symbols of atheism) ran screaming from the site in terror when confronted with such proof, or that since the discovery of Hell conversions to Christianity began occurring at an unprecedented rate.", "If there is a Hell under Siberia, scientists have yet to discover it. What we have here is an enthralling legend that's been spun off an actual event.", "In 1984, an article about an experimental well in Russia's Kola Peninsula appeared in Scientific American. The Kola well reached 12 kilometers into the ground, where scientists encountered rare rock formations, flows of gas and water, and temperatures up to 180°. (That's 180°, folks, not the 2,000° usually reported in any \"Scientists Discover Hell!\" screed. It was hot, but it wasn't hellishly so.)", "Those who did the actual drilling of this very real well did not break through to a hollow centre, and certainly no piteous screams of the damned were heard. That part of the story was pure embellishment added after this real event was turned into a legend. (Yes, we know that any number of web sites offer audio clips purporting to be the screams of the damned as recorded in the Well to Hell, and all of them sound like they could be the noise from a typical bar on a busy Friday evening.)", "The report on the digging of that well and the difficulties encountered during the project collided with someone's vision of what should have been found down there. A little exaggerating about depth and temperature, some fabrication about hollow centres and screams, and all of a sudden there was this great story to throw back at those who claim there is no God.", "Though it's impossible to pinpoint when the news story about a well in Russia transformed into a story about scientists breaking into Hell or who was responsible for that transformation, we do know that in 1989 the Trinity Broadcasting Network (TBN) aired a \"Scientists Discover Hell\" story and placed the event as happening in the Kola Peninsula. A Norwegian schoolteacher visiting California heard that broadcast and took the story back to Norway with him. He then mailed it to a Christian magazine in Finland. In the form of a letter from a reader, it reached a Finnish missionaries newsletter. From there it returned to the United States, reaching both the TBN people and other evangelists who then claimed they had gotten it from a respected Finnish scientific journal.", "In the spring of 1990, the legend as we now know it appeared in both Praise The Lord (February) and Midnight Cry (April). Debunkings of it showed up in Christianity Today (July) and Biblical Archaeology Review (November). Even so, the Weekly World News tabloid ran the story in 1992, this time setting it in Alaska and claiming thirteen oil rig workers were killed when the Devil came roaring up out of the ground.", "You can't beat that for embellishment.", "Brunvand, Jan Harold.   The Baby Train.\r\n    New York: W. W. Norton, 1993.   ISBN 0-393-31208-9   (pp. 105-108).", "Buhler, Rich.   \"Scientists Discover Hell in Siberia.\"\r\n    Christianity Today.   16 July 1990   (pp. 28-29).", "Morphew, Clark.   \"No Truths Behind Christian Myths.\"\r\n    Austin American-Statesman.   25 May 1996   (p. E2).", "Scott, Bill.   Pelicans & Chihuahuas and Other Urban Legends.\r\n    St. Lucia, Queensland: Univ. of Queensland, 1996.   ISBN 0-7022-2774-9   (pp. 59-60).", "The Big Book of Urban Legends.\r\n    New York: Paradox Press, 1994.   ISBN 1-56389-165-4   (p. 68).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]