["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Not even neighborhood social networking apps are safe from misinformation about the COVID-19 pandemic.", "A recent post on Neighbors, an app created by Ring — the company that makes video doorbells — claims that the United States military is using helicopters to \"spray pesticide against the Corona virus in the skies all over the country.\" A map on the post indicates that the user shared it in San Diego.", "\"So you must stay indoors after twelve o’clock at night and remove all clothes which are outside,\" the post reads. \"When you hear the sounds of airplanes at night, it is for you to know that it is related to this matter (COVID-19).\"", "A reader sent us a screenshot of the post, which was subsequently shared on Snapchat, on March 23. The text of the post has also been shared on Facebook.", "(Screenshot from Snapchat)", "We’ve seen several other chain messages that make false claims about the military’s actions against the coronavirus, so we decided to check this one out, too.", "There is no evidence that the U.S. military is using helicopters to spray coronavirus-killing pesticide on American communities. A similar hoax has been passed around in Pakistan, India, Malaysia, Egypt, the Philippines and the United Arab Emirates.", "On March 22, President Donald Trump said during a press briefing that the federal government is deploying additional National Guard assistance to New York, California and Washington to help slow the spread of the coronavirus. During the same briefing, Vice President Mike Pence said the government is also working with the military to charter flights for Americans abroad.", "Meanwhile, Navy ships have been sent to New York and California to provide additional health care support. The Army Corps of Engineers is building more medical facilities. And, according to the Military Times, more than 8,000 National Guard troops have been mobilized in all 50 states.", "That’s a significant activation of the military within U.S. borders, but it’s a far cry from using helicopters to spray pesticides on cities across the country.", "RELATED: 7 ways to avoid misinformation during the coronavirus pandemic", "Still, there is a historical precedent for using helicopters to distribute pesticides. In September, Rhode Island officials approved aerial spraying to kill mosquitoes, which had caused an outbreak of the eastern equine encephalitis (EEE) virus. Other states have taken similar actions, and the U.S. Air Force Reserve has an aerial spray program.", "But those efforts are aimed at limiting the populations of insects that carry diseases, not the diseases themselves. And while Chinese officials have used drones to disinfect surfaces potentially tainted by the coronavirus, experts told us there is no evidence that spraying pesticide from a helicopter would kill the virus on the ground in the U.S.", "\"That idea is pretty far-fetched,\" said Murray Isman, dean emeritus of the Faculty of Land and Food Systems at the University of British Columbia, in an email. \"There are no pesticides that specifically target viruses, and general antimicrobials that might have any effect (bleach, alcohol) would have to be applied in ridiculously high volumes.\"", "According to the Environmental Protection Agency, disinfectants qualify as \"antimicrobial pesticides\" since they are used to kill bacteria and viruses. The agency has listed dozens of products on its website that meet the criteria for use against the coronavirus.", "The chain message is inaccurate. We rate it False.", "If you receive a chain message that you want us to fact-check, send a screenshot to [email protected].", "Alt News, \"No medicine will be sprayed in the air to kill coronavirus; fake message viral,\" March 20, 2020", "Army Medical Department Journal, \"The US Air Force Aerial Spray Unit: a history of large area disease vector control operations, WWII through Katrina,\" 2008", "Centers for Disease Control and Prevention, Information on Aerial Spraying, accessed March 23, 2020", "C-SPAN, \"White House Coronavirus Task Force Briefing,\" March 22, 2020", "Egypt State Information Service, \"Armed Forces deny using military helicopters to spray disinfectants against coronavirus,\" March 17, 2020", "Email from Murray Isman, dean emeritus of the Faculty of Land and Food Systems at the University of British Columbia, March 23, 2020", "Environmental Protection Agency, List N: Disinfectants for Use Against SARS-CoV-2, accessed March 23, 2020", "Environmental Protection Agency, What are Antimicrobial Pesticides?, accessed March 23, 2020", "The Express Tribune, \"FACT CHECK: Viral message on army choppers spraying 'anti-corona pesticides,’\" March 19, 2020", "Fox News, \"Defense Secretary Mark Esper: In coronavirus fight, US military is on the front lines,\" March 23, 2020", "Gulf Business, \"UAE dismisses rumours that it is ‘spraying pesticides’ to curb spread of Covid-19,\" March 18, 2020", "KNSD, \"SD-Based Navy Hospital Ship to Aid Non-Coronavirus Patients in Los Angeles,\" March 22, 2020", "Manila Bulletin, \"PAF belies rumors on pesticide spraying to fight virus,\" March 22, 2020", "The Military Times, \"More than 8,000 Guardsmen have been mobilized in all states, 3 territories and Washington, DC\"", "New York Post, \"Navy hospital ship will be sent to New York to help battle coronavirus,\" March 22, 2020", "PolitiFact, \"Chain message is wrong about the National Guard, military and a nationwide quarantine,\" March 20, 2020", "PolitiFact, \"Fact-checking a chain message about a national quarantine on iMessage, WhatsApp,\" March 17, 2020", "The Providence Journal, \"R.I. to begin aerial spraying in response to EEE,\" Sept. 6, 2019", "Snapchat message, March 23, 2020", "The Star, \"Armed Forces: No pesticide spraying by military copter to combat Covid-19,\" March 19, 2020", "WJBK, \"EEE aerial spray in 14 Michigan counties to begin Monday night,\" Sept. 30, 2019", "World Economic Forum, \"3 ways China is using drones to fight coronavirus,\" March 16, 2020", "WSBT, \"Aerial spraying to be done in Berrien and Cass counties to combat EEE,\" Sept. 27, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]