["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Posting by \"Raise the Minimum Wage\" Facebook group", "The idea of raising the federal minimum wage from $7.25 per hour is becoming a hot button issue.", "Supporters say that wage is so low it forces the working poor to seek out food stamps to survive, adding to the burden of taxpayers and subsidizing the profits of low-paying companies such as Walmart and McDonalds. Critics say that raising the minimum wage kills jobs, makes it harder for companies to hire new workers, and adds to the costs of goods and services for everyone.", "(Nineteen states have their own minimum wage laws that exceed the federal base. Among them is Rhode Island, where the minimum wage, now $7.75, goes to $8 on Jan. 1.)", "Raise the Minimum Wage, a Facebook group that wants Congress to pass an $11 minimum wage, is criticizing Congress, claiming it’s quick to give itself pay increases but slow to raise the minimum wage.", "It posted a picture of the Internet's well-known \"Grumpy Cat\" accompanied by this message: \"Since 1988, Congress has raised its own salary 15 times 'to reflect rising costs.' But raised the minimum wage only three times.\" It has been shared more than 8,800 times.", "We wondered whether the data are correct.", "To count the number of minimum wage increases since 1988, we turned to the Wage and Hour Division of the U.S. Department of Labor. Its handy chart shows that in 1981, Congress had set the minimum wage at $3.35 per hour, where it remained until April 1, 1990, when it rose to $3.80.", "Since then, there have been six additional increases. That's seven in all, not three as the Facebook post asserts.", "And how often has Congressional pay increased?", "For that data, we turned to a Nov. 4, 2013 report by the Congressional Research Service, the nonpartisan think tank for Congress, which tracked pay going back to 1789.", "In 1988, members of Congress earned $89,500 per year.", "The following year, Congress passed a law establishing automatic pay increases for itself unless the House and Senate specifically voted to forego raises, which it has done repeatedly. The law was amended in 1991.", "Since then, members of the House have seen their annual pay increase 14 times. The Senate has received 15 increases, which is the number the Facebook post got correct. Members of both bodies now receive $174,000 per year, with leaders receiving additional pay.", "So where did Raise the Minimum Wage get the idea that there have only been three minimum wage increases? It comes from that fact that the seven increases were the result of three Congressional votes, in 1989, 1996 and 2007. By that standard, Congress has only voted twice to increase its pay, although those votes produced 15 pay hikes.", "One commenter on the Facebook page said, \"The minimum wage should be increased by the same percent each time Congress gets a pay raise.\"", "In fact, the minimum wage is now 116 percent higher than it was in 1988. By contrast, the pay for members of Congress has increased by 94 percent and inflation has increased by 97 percent.", "Our ruling", "A posting by the Facebook group Raise the Minimum Wage said, \"Since 1988, Congress has raised its own salary 15 times 'to reflect rising costs.' But raised the minimum wage only three times.\"", "Although Congress has scored 15 pay increases thanks to the automatic formula it adopted in 1989, it has also approved seven increases in the minimum wage during that period, not three.", "Because the posting ignores more than half the minimum wage increases since 1988 while giving the false impression that Congress has actively voted itself raises 15 times, we rate the statement Mostly False.", "(If you have a claim you’d like PolitiFact Rhode Island to check, e-mail us at [email protected]. And follow us on Twitter: @politifactri.)", "Facebook.com, \"Raise the Minimum Wage,\" accessed Nov. 27, 2013", "DOL.gov, \"History of Federal Minimum Wage Rates Under the Fair Labor Standards Act, 1938 - 2009,\" \"History of Changes to the Minimum Wage Law,\" and \"Minimum Wage Laws in the States - January 1, 2013,\" United States Department of Labor, Wage and Hour Division, all undated, all accessed Nov. 27, 2013", "FAS.org, \"Salaries of Members of Congress; Recent Actions and Historical Tables,\" and \"Salaries of Members of Congress: Congressional Votes, 1990-2013,\" Congressional Research Service, both Nov. 4, 2013, both accessed Nov. 27, 2013", "BLS.gov, \"CPI Inflation Calculator,\" Bureau of Labor Statistics, accessed Nov. 27, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]