["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Questions of partisan bias have been raised about the team of lawyers assembled by special counsel Robert Mueller (left) in his investigation of ties between Russia and the campaign of President Donald Trump. (USA Today)", "U.S. Rep. Sean Duffy, a northern Wisconsin Republican who has consistently backed Donald Trump, is making Democrat-bias allegations about a man who may pose a threat to Trump’s presidency: special counsel Robert Mueller.", "On Oct. 30, 2017, Mueller’s investigation produced its first criminal charges, its first guilty plea and the first public confirmation that an aide to Trump’s campaign sought an allegiance with Russians to gather \"dirt\" on Hillary Clinton.", "Duffy made his claim about Mueller the same day on CNN’s \"New Day\" show. He referred to Clinton, Trump’s Democratic rival in the 2016 election, and the Democratic National Committee, saying:", "First of all, I support the investigation; I’m not asking for it to end. But I do have concerns that Mueller’s bringing in Democrat campaign donors at a very high level …. And I think that’s a mistake on his part. Let’s bring in non-partisan folks that -- or at least don’t have a partisan record because I think you open yourself up to criticism in making it partisan.", "So, how many of Mueller’s lawyers have made campaign contributions to Democrats, and how much?", "And is there evidence of a partisan bias on Mueller’s team?", "The charges and plea", "Duffy’s interview was prompted by the most significant developments for the special counsel, who is investigating possible ties between Trump’s presidential campaign and Russia.", "Former Trump campaign chairman Paul Manafort and his business associate, Rick Gates, were indicted on a dozen felony counts, including money laundering. And George Papadopoulos, a foreign policy adviser to the campaign, pleaded guilty to misleading the FBI about outreach efforts to Russian government officials.", "Papadopoulos is accused of falsely telling the FBI he was not part of the Trump campaign when a person described as an \"overseas professor\" told him that Russians possessed \"dirt\" on Clinton, in the form of \"thousands of emails.\"", "As for Mueller, the special counsel’s office told us that it confirmed that Mueller is a longtime and current Republican. He is a former federal prosecutor who served as the FBI director under presidents George W. Bush and Barack Obama, from 2001 to 2013. He was a partner at the WilmerHale law firm when he was chosen as the special counsel by the U.S. Justice Department in May 2017.", "Previous claim about the team", "A month after Mueller’s selection, Trump implied the investigation was politically motivated, making a claim more extreme than Duffy’s in saying: \"I can say that the people that have been hired (for the independent Russia investigation) are all Hillary Clinton supporters, some of them worked for Hillary Clinton.\"", "PolitiFact National rated Trump’s statement Mostly False.", "At that point, the names of eight lawyers on Mueller’s team had been made public. Three had made campaign contributions to Clinton, but none had worked for her. One had defended the Clinton Foundation in court for WilmerHale. And another represented a Clinton aide, also for WilmerHale.", "The Justice Department looked into the contributions and employment histories of all of Mueller’s hires and determined them consistent with the rules of professional responsibility.", "Duffy's claim is a little more broad.", "Mueller’s team and their contributions", "Duffy’s office referred us to news reports on campaign contributions made by Mueller team members. The special counsel’s office told us that Mueller has 16 lawyers on his team, but that one of them has not been named publicly. That office provided us figures on how much the lawyers have given in total to Democrats and Republicans in federal campaigns. We also checked Federal Election Commission filings.", "Here’s what we found:", "Six of the 15 lawyers have not made campaign contributions to any political campaigns at the federal level.", "Among the lawyers who did make contributions, a total of $62,043 went to Democrats and $2,750 to Republicans, according to the special counsel’s office.", "In terms of Clinton specifically, election filings indicate that three lawyers gave her 2016 presidential campaign a total of $700; and three gave a total of $18,100 to either her 2016 campaign or her 2008 run for the presidential nomination.", "As for the implication of Duffy’s claim, here are points worth noting:", "One of the lawyers was a member of the team that won the 2015 conviction on federal corruption charges of Sheldon Silver, a Democrat who had been the longtime speaker of the New York State Assembly.", "The special counsel’s office pointed out to us that the legal standards for Justice Department hiring \"prohibit the use of political or ideological affiliations to assess applicants.\"", "On that point, the Washington Post Fact Checker reported, in a June 2017 fact check on this issue:", "Federal regulations prohibit the Justice Department from considering the political affiliation or political contributions of career appointees, including those appointed to the Special Counsel’s Office. So the implication that Mueller is making politically motivated hires is quite a stretch, as he is legally prohibited from considering their political affiliations.", "Our rating", "Duffy says Mueller \"has brought in Democrat campaign donors at a very high level\" on his team of lawyers.", "Six of the 15 lawyers who have been publicly identified have not made campaign contributions to any political campaigns at the federal level. But among the lawyers who did make contributions, a total of $62,043 went to Democrats and $2,750 to Republicans, according to the special counsel’s office.", "As for a Democratic bias in the investigation, Duffy doesn’t specifically make that charge. But Mueller himself is a longtime Republican. And he is prohibited from choosing lawyers based on political affiliations.", "For a statement that is partially accurate, our rating is Half True.", "div class='artembed'>", "YouTube, CNN interview of Sean Duffy (4:00), Oct. 30, 2017", "Email, Sean Duffy spokesman Mark Bednar, Nov. 2, 2017", "PolitiFact National, \"What you need to know about Manafort indictment, Papadopoulos guilty plea,\" Oct. 30, 2017", "PolitiFact National, \"Trump wrongly calls Mueller's staffers Clinton supporters, employees,\" June 26, 2017", "PolitiFact National, \"Trump wrongly calls Mueller's staffers Clinton supporters, employees,\" June 26, 2017", "Email, Special counsel’s office spokesman Peter Carr, Nov. 2, 2017", "Email, Wisconsin Democratic Party spokeswoman Melanie Conklin, Nov. 2, 2017", "Washington Post Fact Checker, \"Do Russia probe attorneys’ donations to Democrats threaten their independence?\" June 28, 2017", "Politico, \"Another prosecutor joins Trump-Russia probe,\" Sept. 15, 2017", "CNN, \"Special counsel team members donated to Dems, FEC records show,\" June 13, 2017", "FoxNews.com, \"Mueller probe: Meet the lawyers who gave $$ to Hillary, now investigating team Trump,\" July 24, 2017", "U.S. Department of Justice, \"An Investigation of Allegations of Politicized Hiring and Other Improper Personnel Actions in the Civil Rights Division,\" July 2, 2008", "Federal Election Commission, Advanced Transaction Query By Individual Contributor", "Email, Center for Responsive Politics senior researcher Douglas Weber, Nov. 2, 2017", "ABC News, \"Special counsel Robert Mueller has assembled a team of 16 seasoned prosecutors,\" Sept. 29, 2017", "Washington Post, \"FBI Nominee Lauded for Tenacity,\" July 30, 2001", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]