["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. first lady Michelle Obama speaks with Peace Corps. volunteers and students outside of the Liberian capital of Monrovia on June 27, 2016", "Pulitzer Prize-winning American journalist and author Tina Rosenberg recently drew attention to a shocking statistic about women’s education in the African country of Liberia.", "\"This is education in Liberia,\" Rosenberg wrote in the New York Times on June 14. \"A girl is more likely to be married by 18 than to know how to read.\"", "Liberia was devastated by civil war between 1989 and 2003. More recently, its schools were closed for six months following the outbreak of the Ebola virus in 2014. Our partners at Africa Check looked at the available survey data to determine the accuracy of Rosenberg’s claim.", "Recent data doesn’t support claim", "Rosenberg, who won the Pulitzer for non-fiction The Haunted Land: Facing Europe's Ghosts After Communism, told Africa Check that her claim was based on a Liberian database of statistics collected from the United Nations Children’s Emergency Fund (UNICEF). The database reported that 37.9 percent of children are married in Liberia by 18. That is fractionally higher than the female youth literacy rate of 37.2 percent, according to the UNICEF database.", "The problem is those figures come from 2007 reports and are out of date.", "The 37.9 percent figure for child marriage appears to track back to Liberia’s Demographic and Health Survey from 2007. The youth literacy figure is likely from a 2007 UNESCO Institute for Statistics’ estimate. The estimate covers women between the ages of 15-24, not just girls 18 and under.", "The most recent data comes from the country’s 2013 Demographic and Health Survey.", "Teen marriage rates in Liberia", "The Demographic and Health Survey presents data in five year increments for people aged 15 to 49. Women who are 18 fall into the youngest age group of 15 to 19. However, the survey is missing data for marriage rates for this age group.", "Instead, a United Nations Children’s Emergency Fund note on interpreting child marriage data recommends using the next age group: \"Looking at the group of women 20 to 24 years old is simpler and allows for the inclusion of all girls who were married or in union by age 18 within the closest time period for which complete data are available.\"", "Following this standard, the 2013 Demographic and Health Survey shows that 35.9 percent of Liberian women aged 20 to 24 reported being married by the time they were 18. This method is imperfect because it doesn’t tell us about the chances that a girl under 20 today will have been married by 18. However, it gives us the best estimate for youth marriage rates for a group of young women who could reasonably be called girls.", "Literacy rates in Liberia", "The 2013 survey reported a literacy rate of 64.2 percent for women between 15 and 24 years of age. Someone is considered literate if they went to high school or if they can read a whole sentence or part of that sentence.", "The literacy rate decreases slightly to 58.9 percent when you look at women ages 20 to 24.", "Other organizations define literacy more strictly. For example, UNESCO doesn’t include people who can only read part of a sentence in the literate population. If we apply UNESCO’s literacy definition to Liberian women aged aged 20 to 24, literacy drops to 51.2 percent – still much higher than the marriage figure of 35.9 percent.", "Our Ruling", "Rosenberg made the claim that a Liberian woman is \"more likely to be married by 18 than to know how to read.\"", "This claim relies on data from an old 2007 survey. Using a more recent survey and the closest age group for which data are available, the comparison doesn’t hold. Young Liberian women are more likely to know how to read than be married.", "We rate this claim Mostly False.", "This fact-check originally was published by Africa Check. Read their version of this story here.", "https://www.sharethefacts.co/share/6e872c6b-47c4-407b-a8f2-df36965f83bb", "AfricaCheck.org, \"Are Liberian girls more likely to be wives than literate by age 18?,\" 30 June 2016", "AfricaCheck.org, \"Is Zimbabwe’s adult literacy rate the highest in Africa?\" 22 May, 2015", "BBC.com, \"Ebola outbreak: Liberia schools reopen after six months,\" 16 February, 2015", "Liberia Institute of Statistics and Geo-Information Services, \"2013 Demographic and Health Survey,\" accessed 6 July, 2016", "Liberia Institute of Statistics and Geo-Information Services, \"2007 Demographic and Health Survey,\" accessed 6 July, 2016", "Reuters, \"Timeline: Liberia: from civil war chaos to fragile hope,\" 7 November, 2011", "The New York Times, \"Liberia desperate to educate, turns to charter schools,\" 14 June, 2016", "UNICEF, \"At a Glance: Liberia,\" 27 December, 2013", "UNICEF Data, \"Child Marriage,\" June, 2016", "UNESCO Institute for Statistics, \"Country profiles: Liberia,\" accessed 14 July, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]