["Twitter user Hardik Bhavsar shared an image of a Muslim man riding a scooter with his six family members. He used the hashtag #WeWantPopulationControlLaw while sharing the image. Bhavsar is followed by PM Narendra Modi, Home Minister Amit Shah and Railway Minister Piyush Goyal.", "Yes, we want #WeWantPopulationControlLaw pic.twitter.com/VJHtO0qP7G", "— Hardik Bhavsar (@Bittu_Tufani) September 21, 2020", "The same image was shared by @iArmySupporter, a parody account of journalist Pushpendra Kulshreshtha.", "We are demand Population control law.", "Demand you?", "RT you #WeWantPopulationControlLaw pic.twitter.com/zWXBlrkGqn", "— Pushpendra Kulshreshtha (@iArmySupporter) September 21, 2020", "This image is also being shared on Facebook and Twitter along with demands for a population control law in India.", "A Twitter user had tagged Alt News while posting the full image where a signboard in Bengali is visible. The board carries the words “হানিফ এন্টারপ্রাইজ ভাটিপাড়া-ঢাকা-চট্টগ্রাম” which translates to “Hanif enterprise Bhatiapara-Dhaka-Chottogram” which is in Bangladesh.", "@AltNews this image is from Bangladesh . Some people are using it to spread their propaganda.#Islamophobia pic.twitter.com/Bbd59DqT1X", "— iamsankha (@Sankhas20350289) September 21, 2020", "We found a Facebook post by Electric Bikers Association of Bangladesh from three years ago where the same image, but better quality, was shared. Here, the signboard is more clearly visible. It also carries a picture of a bus.", "A reverse search of the image with the keywords ‘হানিফ এন্টারপ্রাইজ ভাটিয়াপাড়া’ led us to a Bangladeshi transportation website where ‘Hanif Enterprise’ finds a mention. This is a bus service in Bangladesh.", "Thus an old image from Bangladesh where a man is riding a two-wheeler with six more people is being shared on Indian social media ecosystem to demand a population control law in India.", "Donate Now", "Aqib is monitoring and researching mis/disinformation at Alt News", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]