["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Fox News host Tucker Carlson celebrated the departure of former national security adviser John Bolton, saying the mustachioed war hawk was actually a lefty.", "\"If you’re wondering why so many progressives are mourning Bolton’s firing tonight, it’s because Bolton himself fundamentally was a man of the left,\" Carlson said Sept. 10 on his show.", "Carlson said Bolton was \"one of the most progressive people in the Trump administration\" and alleged that he \"promoted Obama loyalists within the National Security Council.\"", "\"There was not a human problem John Bolton wasn’t totally convinced could be solved with the brute force of government,\" Carlson said. \"That’s an assumption of the left, not the right.\"", "\"Don’t let the moustache fool you,\" he added.", "But it’s Carlson’s claims about the former national security adviser that are ridiculous. (Fox News did not respond to requests for comment.)", "First, a note about ideologies: In the United States, we tend to associate the terms \"left\" and \"right\" with the Democratic and the Republican Parties, respectively.", "In that context, Carlson’s claim is \"nonsense,\" said William LeoGrande, professor of government at American University, who previously served on staff for the Senate Democratic policy committee and the House Democratic caucus task force on Central America.", "\"Obviously it’s wrong if you’re defining it in terms of Democratic versus Republican politics,\" added Daveed Gartenstein-Ross, chief executive officer of Valens Global, a counter-terrorism consulting firm, and a former advisor for the Department of Homeland Security’s Office of Community Partnerships under both President Barack Obama and President Donald Trump.", "\"There’s no question that, based on the American political context, he would be considered a man of the right,\" Gartenstein-Ross said.", "That’s because Bolton has spent his entire career in conservative circles and served in every GOP presidential administration going back to President Ronald Reagan, LeoGrande said.", "Here are just a few examples of Bolton’s work prior to joining the Trump administration:", "• In high school, Bolton volunteered to campaign for Republican presidential candidate Barry Goldwater, who lost to President Lyndon Johnson in the 1964 general election.", "• Bolton spent the 1972 summer between law school semesters interning for Vice President Spiro Agnew of President Richard Nixon’s administration.", "• Bolton joined the Reagan administration in the Agency for International Development in 1981, serving a year as general counsel and a year in an administrative role. He later moved to Reagan’s Justice Department, where he was the assistant attorney general for legislative affairs from 1985 to 1988 and assistant attorney general for a year in 1988.", "• Bolton took over in 1989 as the State Department’s assistant secretary for international organization affairs under President George H.W. Bush. He held that post until 1993.", "• Bolton served in 2005 as ambassador to the United Nations under President George W. Bush, who appointed him on a \"recess appointment\" after the Republican-led Senate did not confirm his nomination.", "• Bolton flirted with running for president in 2012 before endorsing Sen. Mitt Romney.", "• Bolton worked for the conservative American Enterprise Institute and contributed to the Weekly Standard, a conservative magazine, for multiple years. He was also a contributor at Fox News, earning a salary of roughly $569,000 in 2017, per the Washington Post.", "• Bolton created a super PAC in 2013 that contributed millions of dollars to Republican congressional candidates in 2014, 2016 and 2018.", "Best known for his foreign policy views, Bolton has criticized international institutions like the United Nations and called for a more aggressive stance toward hostile countries such as North Korea and Iran. He was an outspoken critic of Obama, penning op-eds, a number of tweets and a book about his policies.", "But Bolton’s hawkishness — which Carlson described as a preference for \"the brute force of government\" — does not make him liberal, LeoGrande said. \"In the foreign policy field, Bolton’s speciality, the interventionists have been conservative Republicans.\"", "\"From Central America in the 1980s to the Middle East today, conservatives have been the ones who think that the United States can get its abroad way by ‘brute force,’\" he said.", "Here are some of Bolton’s recent statements about foreign policy:", "• In a 2018 Wall Street Journal op-ed, Bolton argued in favor of preemptively striking North Korea: \"It is perfectly legitimate for the United States to respond to the current ‘necessity’ posed by North Korea’s nuclear weapons by striking first.\"", "• In a 2015 New York Times op-ed, Bolton called for military action against Iran: \"Iran will not negotiate away its nuclear program. Nor will sanctions block its building a broad and deep weapons infrastructure. The inconvenient truth is that only military action … can accomplish what is required.\"", "• In a 2015 interview with the Washington Examiner, Bolton said he still believes invading Iraq was the right move: \"I still think the decision to overthrow Saddam was correct.\"", "• In a 2017 Telegraph op-ed, Bolton said Russia’s interference in U.S. elections is \"a true act of war, and one Washington will never tolerate.\"", "• In an address at the 2018 CPAC conservative conference, Bolton called for a \"massive military buildup\" and \"a comprehensive national debate on why preventing China from becoming the dominant world power\" should be a top concern for Americans.", "• In a 2018 address, Bolton said Cuba, Venezuela and Nicaragua represent a \"troika of tyranny\" and announced new sanctions against Venezuela.", "We also found no evidence to support Carlson’s claim that Bolton \"promoted Obama loyalists within the National Security Council.\" (The NSC did not respond to requests for comment.)", "The Washington Post and Politico detailed the shuffling that occurred after Bolton took over as national security adviser. Many officials left their posts, while others were moved to new roles. Bolton left some openings vacant and filled others with people from outside of government.", "For example, Bolton brought on Mauricio Claver-Carone, a political fundraiser and lobbyist, to replace a CIA officer as the NSC director for Latin America, according to the Washington Post.", "Similarly, he gave Richard Goldberg, an adviser for the Foundation for Defense of Democracies, a key post focused on Iran. He had Charles Kupperman, a former defense industry executive who once worked for Reagan, appointed as deputy national security adviser.", "But none of them were \"Obama loyalists,\" as far as we could tell.", "On the contrary, LeoGrande said Claver-Carone \"denounced Obama’s opening to Cuba and has a long history of lobbying for the hardline foreign policy positions of the Cuban-American right.\"", "Plus, government bureaucracies like the NSC are often full of career government officials who stay on staff from one administration to the next, Gartenstein-Ross said.", "\"If someone has served in the Obama administration, that doesn’t mean they’re an Obama loyalist,\" he said. \"It’s very typical for career civil servants to serve across administrations.\"", "Carlson said Bolton \"fundamentally was a man of the left.\"", "Bolton spent his whole career in Republican politics, and experts said his views have always tilted more to the American right than left.", "We found no proof that he had elevated \"Obama loyalists,\" either.", "We rate this statement Pants on Fire!", "Mediaite, \"Tucker Carlson Calls Bolton Ouster a ‘Great Day for America’: He’s ‘A Man of the Left,’\" Sept. 10, 2019", "John Bolton, \"Surrender Is Not an Option: Defending America at the United Nations,\" Nov. 2007", "The White House, \"John R. Bolton,\" accessed Sept. 10, 2019", "Congress.gov, \"The Nomination Of John R. Bolton To Be U.S. Representative To The United Nations With Rank Of Ambassador And U.S. Representative To The United Nations Security Council And U.S. Representative To Sessions Of The United Nations General Assembly During His Tenure Of Service As U.S. Representative To The United Nations,\" accessed Sept. 10, 2019", "The Department of Justice, \"Former Assistant Attorneys General,\" accessed Sept. 10, 2019", "Federal Election Commission, \"John Bolton Super PAC,\" accessed Sept. 10, 2019", "Center for Responsive Politics, \"John Bolton Super PAC,\" accessed Sept. 10, 2019", "The New York Times, \"Trump Ousts John Bolton as National Security Adviser,\" Sept. 11, 2019", "The Washington Post, \"Bolton moves to promote loyalists at the National Security Council,\" June 18, 2019", "The New Yorker, \"John Bolton on the Warpath,\" April 29, 2019", "The Washington Post, \"John Bolton puts his singular stamp on Trump’s National Security Council,\" March 4, 2019", "The White House, \"White House National Security Advisor Announces Senior Staff Appointment,\" Jan. 11, 2019", "The White House, \"Remarks by National Security Advisor Ambassador John R. Bolton on the Administration’s Policies in Latin America,\" Nov. 2, 2018", "Politico, \"Another top NSC official ousted under Bolton,\" July 13, 2018", "The Washington Post, \"John Bolton, famously abrasive, is an experienced operator in the ‘swamp,’\" March 23, 2018", "The Boston Globe, \"Seven John Bolton policy views you should know about,\" March 23, 2018", "The Wall Street Journal, \"The Legal Case for Striking North Korea First,\" Feb. 28, 2018", "American Conservative Union on YouTube, \"CPAC 2018 — John Bolton,\" Feb. 24, 2018", "The Washington Examiner, \"John Bolton: No regrets about toppling Saddam,\" May 14, 2015", "The New York Times, \"To Stop Iran’s Bomb, Bomb Iran,\" March 26, 2018", "CNN, \"John Bolton endorses Romney,\" Jan. 11, 2012", "Politico, \"Bolton eyes 2012 presidential run,\" Dec. 17, 2010", "Email interview with William LeoGrande, professor of government at American University, Sept. 10, 2019", "Phone interview with Daveed Gartenstein-Ross, chief executive officer of Valens Global, Sept. 10, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]