["The image was posted to a Facebook group called “Collective Action Against Bill Gates. We Wont [sic] Be POISONED!!!” here on February 4, 2021.", "The image features a photo comparison of two images.", "The bottom photo shows what appears to be the site of a rock formation and includes superimposed text that reads: “Pobitite [sic] Kamani, Bulgaria.”", "The top photo shows an identical rock formation, but in a red hue and with a black background. The superimposed text over the top image reads: “Original NASA photo of MARS.”", "The image comparison was also shared hundreds of times on Facebook here, here and here.", "The image comparison, however, was shared alongside a false claim.", "NASA told AFP in a February 6 email the top image in the purported comparison “is not a NASA photo of Mars”. The image is also not listed on NASA’s publicly available Mars Media Library as seen here.", "A reverse image search of the bottom photo in the image comparison found that it does appear to show a rock formation in Pobiti Kamani, which is a protected geological site in Bulgaria.", "The photo was published on travel blogs about Pobiti Kamani here and here. The rock formation matches those seen here in a YouTube video promoting tourism at Pobiti Kamani and here on the site’s Tripadvisor page.", "Google Maps also shows similar rock forms at the Pobiti Kamani site; seen in the 360 degree view below:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]