["About this rating", "The Freedom from Religion Foundation (FFRF) requested Bibles be removed from public university hotel rooms and further lobbied the hospitality industry to offer \"Bible-free\" rooms in hotels.", "The FFRF demanded that all Bibles be removed from all hotel rooms.", "On 4 December 2015 the Facebook page \"American Center for Law and Justice\" (ACLJ), a Christian advocacy group founded by Pat Robertson, published the above-reproduced image along with the following text:", "A radical group of atheists is demanding all hotels remove Bibles from their rooms, claiming the Bible \"may endanger your health and life.\"", "This is not only absurd, it's unconstitutional. Help us fight back: https://bit.ly/1N8YmlN", "The status update claimed a \"radical group of atheists\" had demanded \"all hotels remove Bibles\" from their rooms, and references to it in social media asserted that the Bible banners sought to \"ban the Bible in ALL hotel rooms.\" The link appended to the update pointed to an ACLJ petition titled \"Don't Ban the Bible. Defend It,\" which read (in part):", "Banning the Bible ... That's what one angry atheist group is trying to do in hotels at public universities.", "The anti-Christian Freedom from Religion Foundation (FFRF) is demanding that the Bible — placed by a Christian group — be banned from university hotel rooms.", "It's already had them banned from universities in Illinois, Wisconsin, and Iowa.", "FFRF extremists call the Bible \"obnoxious\" and insultingly claim that the \"[B]ible calls for killing nonbelievers.\" It even absurdly claims that it is \"unconstitutional to have them\" — Bibles — in university hotel rooms.", "FFRF is legally and constitutionally wrong. It's time to set the record straight.", "We've been defending constitutionally protected religious speech at the Supreme Court for decades. Now, we're sending these universities a critical legal letter to protect the Bible. Add your name today:", "The image asserted simply that \"angry atheists [were] trying to ban the Bible,\" while the status update maintained a \"radical group of atheists is demanding all hotels remove Bibles from their rooms,\" and the linked petition claimed \"[the] Freedom from Religion Foundation (a non-profit non-theist advocacy group) is demanding that the Bible ... be banned from university hotel rooms.\"", "The petition published on Facebook by the ACLJ specifically referenced \"university hotel rooms,\" which in turn suggested that the conflict in question pertained to religious materials and public institutions. On 30 October 2015, the FFRF had published a press release on the matter which stated that:", "Northern Illinois University quickly removed all bibles from the Holmes Student Center Hotel after receiving a letter from the Freedom from Religion Foundation stating that it was unconstitutional to have them there.", "FFRF Legal Fellow Ryan D. Jayne sent the letter on Oct. 20 to Norm Jenkins, director of the Holmes Student Center, stating, in part: \"Providing bibles to Holmes Student Center Hotel guests sends the message that NIU endorses the religious texts. Including bibles sends the message to non-Christian and non-religious guests that they should read the bible, and specifically the version of the bible provided: the Gideon Bible. Certainly, if guests want to read this religious text during their stay, they can bring their own copy or access any of the numerous churches or libraries near the university.\"", "The next day, Oct. 21, Gregory A. Brady, deputy general counsel for Governance and Administration at NIU, responded to FFRF by stating that the university \"will be removing any such bibles from their hotel guest rooms.\"", "As such, the 4 December 2015 ACLJ image meme was misleading at the time it was issued. The so-called \"Bible ban\" involved public universities and the issue of government endorsement of religious texts, not a call to remove all Bibles from all hotel rooms.", "On 2 December 2015, the ACLJ published an article titled \"Angry Atheists Demand Hotels Ban the Bible Comparing Scripture to Danger of Smoking\" which held that:", "The radical anti-Christian Freedom from Religion Foundation (FFRF) has launched a crusade to ban the Bible in hotel rooms. Now FFRF is moving beyond public university hotel rooms and demanding that all hotels remove the Bible from bedside tables.", "Again, removing the Bible from his room is not good enough.  This anti-Christian organization will not be satisfied until every Bible is banned from every hotel in America — and even then I'm sure they'll find a new place to hate.", "That article referenced a 12 October 2015 article about the issue of hotel rooms and Bibles published on the blog Patheos:", "FFRF has long complained about the Gideon Bibles. In the late 1980s we launched a national \"Bible Free Room\" campaign, with limited success. Although this is not a state-church issue (unless the hotel is owned by the state or the military), we consider it an important consumer complaint, much like asking for smoke-free rooms.", "The Gideon Bibles are not owned by the hotel. Many establishments are dunned into contributing to the Gideons International for the \"donation,\" which means that we guests are paying for them. The Gideons say that readers are welcome to take the book ... Why should we be posting complaints on their book? Can you imagine what would happen if the hospitality industry were placing The God Delusion in every room?", "To be clear, the 2 December 2015 ACLJ article referenced a think-piece suggesting (not demanding) that hotels offer Bible-free rooms for guests. However, on 7 December 2015 the FFRF issued a press release titled \"FFRF Requests 'Bible-Free' Hotel Rooms,\" which read in part:", "The Freedom from Religion Foundation ... is making a major consumer request to the hospitality industry, asking it to be more hospitable to non-Christian and nonreligious clientele by offering \"bible-free\" rooms.", "In early December, FFRF sent a letter to a number of companies, including Wyndham Worldwide, Intercontinental Hotel Groups (Holiday Inn), Choice Hotels International (Quality Inn), Hilton Worldwide, G6 Hospitality (Motel 6), Marriott International, Best Western, Carlson Rezidor Hotel Group (Radisson, Carlson, Country Inn) and Starwood Hotels and Resorts (Sheraton).", "FFRF does ask the hotel industry to follow the lead of Gansevoort Hotel Groups, which, to provide a friendlier environment, removed religious materials from guest rooms but provides such materials upon request. Many boutique hotels have likewise stopped serving as a conduit for Protestant missionaries. Travelodge (UK) removed bibles from more than 500 hotels last August \"in order not to discriminate against any religion.\"", "Whether the chain of press releases from ACLJ and FFRF regarding Bibles in hotel rooms (both public university lodging and otherwise) were part of a direct rhetorical escalation or simply coincidental was unclear. Further obfuscating the chain of debate were assertions that the FFRF sought to ban \"all Bibles\" from \"all hotel rooms\" at any point during the controversy.", "According to releases from both the FFRF and the ACLJ, the FFRF requested that Bibles be removed from hotel rooms at public universities in or around October 2015, and that request (framed as more broad that it actually was at the time by the ACLJ) was granted. Concurrently, the FFRF asked that commercial hospitality properties consider offering \"Bible-free hotel rooms\" to non-theists or non-Christian guests. Whether that request involved removal of Bibles from all rooms (with the books remaining available to guests who asked for them) was unclear, but the specific use of the term \"Bible-free rooms\" and the comparison to smoke-free hotel rooms suggested that the request extended to some (but not all) rooms.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]