["The photos were published on Facebook here on November 15, 2020.", "The post has been shared more than 900 times since.", "The photos are captioned: \"This is painful to see. Even if you don't know them it's heartbreaking to see them like this. Let's pray for them.\"", "The post circulated in the immediate aftermath of Typhoon Vamco, the deadliest storm to hit the Philippines this year.", "Social media users appeared to believe the photo showed Vamco victims, with some posting comments that claim to have identified the location as the hard-hit provinces of Cagayan and Isabela.", "The photos were also published alongside similar claims on Facebook here, here, here and here.", "However, this claim is misleading.", "First photo", "Google reverse image and keyword searches found the first photo was published in this report from the International Federation of Red Cross and Red Crescent Societies (IFRC) dated August 11, 2019, over a year before Typhoon Vamco hit the Philippines.", "The IFRC report reads, in part: “Several provinces in the center, central highlands and south of Vietnam have been impacted by floods following torrential rain over a number of days… These floods come on the heels of Tropical Storm Wipha which brought heavy rains to the north of Vietnam on 3 August 2019, causing nine deaths and damaging 284 houses in Thanh Hoa and Lang Son provinces.”", "The photo is captioned: “Houses damage due the from [sic] floods in several provinces in Vietnam.”", "Below is a screenshot comparison of the first photo in the misleading posts (L) and the photo in the IFRC report (R):", "The photo was also published with an accurate caption in this Vietnamese news report.", "Second photo", "Reverse image and keyword searches on Google found that the second photo also circulated in 2019 in reports about Storm Wipha in Vietnam.", "It was published by Vietnamese news organisation Zing News here on August 4, 2019.", "Part of the report translates to English as: “After Storm Wipha, Thanh Hoa was the most damaged province with 3 dead, 13 missing victims, 32 houses collapsed and swept away by flashfloods.”", "The photo is captioned: “The woman cried because she lost her home and her property. ‘In decades of living here, we have never seen such a terrible flood,’ she said.”", "Below is a screenshot comparison of the second photo in the misleading posts (L) and the photo in the Zing News report (R):", "The photo was also published with an accurate caption on an official Vietnamese government website here.", "Vera Files, a Philippine news organisation, also debunked a similar misleading claim about the two photos here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]