["A Facebook post, archived here and published on July 22, 2020, includes an image of what looks like a monument perched on the side of a mountain surrounded by arid land. Shared dozens of times, the caption in the post asks “who built this in africa (sic)”.", "People commenting on the picture suggest it may have been taken in Tigray, Ethiopia, a popular stop for tourists and a region where Ethiopians believe the Ark of the Covenant was brought from Jerusalem by King Solomon 3,000 years ago.", "The biblical references are not far off but reverse image searches show that the picture is only a composite and the impressive-looking structure is an imaginary depiction of an ancient site in Israel, not in Ethiopia or anywhere else in Africa.", "The image can be found on Wikimedia Commons, a database free for public use.", "Under the file name “Masada BW A.JPG”, the description of the image says that it is a “model of the northern palace”. Dated February 24, 2008, it is credited to Berthold Werner.", "“This is a retouched picture, which means that it has been digitally altered from its original version,” reads additional information on the image, before specifying that it is composed of two pictures -- “one for the palace and one for the background”.", "Werner, who died in 2017, maintained his own Wikimedia page where he published multiple images of new and old sites in Israel.", "Another Wikimedia page called Herod the Great replicates Werner’s image in a section labelled “Models of the Northern palace at Masada”.", "Indeed, Masada exists, in Israel and not Africa, but only as ruins.", "Originally an ancient fortress constructed between 37 BCE and 4CE by Herod in Israel’s Judean Desert, the site overlooks the Dead Sea. It was occupied by Jewish rebels after the Jewish revolt in the first century, also known as “the siege of Masada”, where it was defended against a Roman army for months.", "Masada today is a recognised heritage site and the model of Herod’s imagined northern palace used by Werner in his image can be viewed on-site or downloaded from the Unesco website here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]