["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Vice President Mike Pence and President Donald Trump at a roundtable on America's seniors in the White House Cabinet Room on June 15, 2020. (AP)", "• Oklahoma’s daily caseload has risen consistently in June, and to levels higher than at any point in the pandemic.", "President Donald Trump is receiving criticism for his decision to restart in-person, indoor rallies with an event in Tulsa on June 20. During a White House roundtable on June 15, Vice President Mike Pence defended Trump’s decision by praising Oklahoma’s response to the coronavirus pandemic.", "At a discussion of issues affecting older Americans, Pence said, \"The president and I have both spoken to (Oklahoma) Gov. Kevin Stitt in the last several days and even earlier today. And Oklahoma has really been in the forefront of our efforts to slow the spread. And in a very real sense, they've flattened the curve. And today, their hospital capacity is abundant. The number of cases in Oklahoma — it's declined precipitously, and we feel very confident going forward with the rally this coming weekend.\"", "However, Pence’s remarks represent an unduly optimistic reading of Oklahoma’s actual coronavirus data. (The Trump campaign and the White House did not respond to inquiries.)", "The state opened some businesses on April 24 and others on May 1.", "We looked at the raw data for Oklahoma from the Covid Tracking Project. The following chart shows both the daily number of new, confirmed cases in Oklahoma and the seven-day rolling average, which smooths out day-to-day variations in the data. (For instance, weekends often show artificially low totals because offices are closed.)", "The strongest evidence for Pence’s characterization comes in the early part of the period. From early March to early April, the daily case count skyrocketed, but then it eased and remained more or less in check through the end of May.", "This fits the pattern of \"flattening the curve,\" a term that gained currency early in the pandemic to describe a hoped-for phenomenon by which Americans would stay at home to stop the virus’ spread, thus keeping new infections from overwhelming the hospital system.", "However, Pence overstated the case.", "First, it’s incorrect to say that infections in Oklahoma \"declined precipitously.\" As the chart shows, it was, at best, a modest decline between early April and the end of May. It could be more accurately described as a plateau.", "Second, any \"flattening the curve\" period is old news. Over the most recent week, the number of new cases has increased every day and produced a spike beyond anything previously seen in Oklahoma. The seven-day rolling average for new infections is now more than double where it stood at the end of May, just before the spike began.", "\"It looks from the data that the number of cases is on the rise, and rising quite steeply,\" said Nicole Gatto, associate professor in the School of Community and Global Health at Claremont Graduate University.", "Tara C. Smith, a professor of epidemiology at Kent State University, agreed.", "\"The seven-day average doesn't look great for the most recent part of June,\" Smith said. \"They had slowed new cases for a while, but the trend now seems to be reversing.\"", "Equally important, the recent spike does not appear to be traceable to a big surge in testing. Here’s a chart of the seven-day rolling average of daily tests in Oklahoma:", "The number of tests conducted has generally risen over time. But the number of tests actually fell during the period when the number of new infections was spiking.", "Pence said, \"In a very real sense, (Oklahoma has) flattened the curve. ... The number of cases in Oklahoma — it's declined precipitously.\"", "This observation is outdated and inaccurate. In June, Oklahoma’s daily caseload has risen consistently, and to levels higher than at any point in the pandemic.", "We rate the statement False.", "Mike Pence, remarks at a White House roundtable, June 15, 2020", "COVID Tracking Project, data, accessed June 15, 2020", "New York Times, \"See How All 50 States Are Reopening,\" accessed June 8, 2020", "Yahoo News, \"Ahead of Tulsa rally, Pence says Oklahoma has 'flattened the curve' of COVID cases, but data shows otherwise,\" June 15, 2020", "Daily Beast, \"Mike Pence Lies About Oklahoma’s COVID-19 Numbers Ahead of Trump Rally,\" June 15, 2020", "The Guardian, \"Oklahoma coronavirus rate surges as Trump rally nears,\" June 16, 2020", "Email interview with Tara C. Smith, professor of epidemiology at Kent State University, June 16, 2020", "Email interview with Nicole Gatto, associate professor in the School of Community and Global Health at Claremont Graduate University, June 15, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]