["The video was published here on Facebook on October 28, 2020.", "The caption states: “Pak Army viral video Pakistani commando vs American commando Pakistani lion win #pakcommando #army.”", "However, this claim is false.", "A reverse image search of a logo visible in the video at its 39-second mark found the clip actually shows an event in the 60th World Military Pentathlon Championship hosted by the International Military Sports Council (CISM) in Brazil in 2013.", "Below is a screenshot comparison of the logo seen in the video (L) and the logo for 60th Military Pentathlon Championship (R):", "According to the list of results for the event, neither Pakistan nor America competed in the championships", "An earlier version of the same video showing the event was also published here on YouTube in 2016.", "The organisers of the World Military Pentathlon Championship said the video shows an event held during the competition in 2013.", "“I can confirm this video was taken during the 60th World Military Pentathlon Championships held in Brazil 2013 but it’s not an official video taken by us,” CISM Media and Communication Director, David Vandenplas, told AFP. He said that CISM did not possess any official footage of the event.", "Similar versions of the clip have circulated in the past under different, false claims.", "The video was posted here on TikTok in 2019 as a tribute to the Indian army and here on YouTube in 2018 claiming to show training exercises of the Indian army.", "It was also posted here on Facebook and here on YouTube in 2017 claiming to show para commando training by the Indian army.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]