["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A medical worker sprays people being discharged from the Island Clinic Ebola treatment center in Monrovia, Liberia. (AP Photo/Jerome Delay)", "The latest news on Ebola finally seems to be headed in the right direction. The World Health Organization declared Nigeria and Senegal to be Ebola-free. None of the people who lived in the apartment of Thomas Eric Duncan, the man who died in Dallas, have contracted the disease. Beyond the two nurses now in treatment, there are no reports that hospital staff who helped care for Duncan have the virus.", "While the situation in Sierra Leone, Liberia and Guinea remains dire, more equipment and medical professionals are arriving on the scene.", "Based on all this, MSNBC host Chris Hayes took an optimistic stance during his show on Oct. 20.", "\"It is a disease that can be wrestled to the ground and essentially snuffed out the way you might fight a forest fire,\" Hayes said. \"If there's sufficient resources in those three West African countries.\"", "Hayes’ guest, pediatrician and health care television personality Corey Hebert, backed up that view.", "\"We've had 27 outbreaks around the globe and they've never spread outside of the confines of the countries that were initially affected,\" Hebert said. \"So, it's not something that we have to worry about like in the movie Outbreak. It's not like that.\"", "The 1995 film Outbreak did pretty well at the box office, but our fact-check focuses on Hebert’s numbers, not his taste in movies. We emailed him to learn where he got his figures and did not hear back.", "We found two lists of Ebola outbreaks, and while it's pretty clear that Hebert overshot the number of outbreaks, his general point is accurate. In the past, thanks to public health efforts, the virus has not spread beyond the borders of the countries that were first affected.", "The Centers for Disease Control and Prevention lists a total of 34 incidents involving one strain or another of the Ebola virus since it was first identified in 1976 in Zaire. However, not every incident meets the definition of an outbreak. In places such as England, Italy and Russia, some people caught it in their labs. A strain of the virus infected some pigs in the Philippines and some workers there developed antibodies but never showed any symptoms. There were instances where just a single person died. If you discount exposures in the laboratory, infections of animals, you are left with 19 outbreaks before the current one. Add in the three lone deaths unrelated to a lab exposure, and the total is 22.", "The World Health Organization has its own list that doesn’t include lab or animal infections. Its list has 20 episodes and includes four incidents in which there was a single death or no deaths at all. Adjusting for those individual cases, the WHO’s outbreak count is 16. Here’s the WHO list:", "Year", "Country", "Cases", "Deaths", "2012", "Democratic Republic of Congo", "57", "29", "2012", "Uganda", "7", "4", "2012", "Uganda", "24", "17", "2011", "Uganda", "1", "1", "2008", "Democratic Republic of Congo", "32", "14", "2007", "Uganda", "149", "37", "2007", "Democratic Republic of Congo", "264", "187", "2005", "Congo", "12", "10", "2004", "Sudan", "17", "7", "2001-02", "Congo", "59", "44", "2001-02", "Gabon", "65", "53", "2000", "Uganda", "425", "224", "1996", "South Africa (ex-Gabon)", "1", "1", "1995", "Democratic Republic of Congo", "315", "254", "1994", "Cote d'Ivoire", "1", "0", "1994", "Gabon", "52", "31", "1979", "Sudan", "34", "22", "1977", "Democratic Republic of Congo", "1", "1", "1976", "Sudan", "284", "151", "1976", "Democratic Republic of Congo", "318", "280", "Source: World Health Organization", "In both tallies, each outbreak happened in just one country. The current crisis is the first where Ebola has hit several nations simultaneously. (Through Oct. 17, Ebola has affected seven countries and 9,216 people have been diagnosed with the virus. There are 4,555 reported deaths so far.)", "A likely explanation for the difference this time has to do with where the virus struck, and not the nature of the disease itself. According to a recent article in the New England Journal of Medicine, the latest outbreak started in Guinea in December 2013. That was a very unfortunate location with many residents and decent transportation.There are plenty of roads that allow the people in Guinea, Sierra Leone and Liberia to move easily among the three countries and between rural areas and dense urban centers. But the research team that wrote the article said that the biological characteristics of the virus are largely the same.", "Quick and robust public health measures could have stopped the Ebola outbreak early, but the steps that were taken fell short.", "\"The critical determinant of epidemic size appears to be the speed of implementation of rigorous control measures,\" the article authors wrote.", "Our ruling", "Hebert said there have been 27 outbreaks of of Ebola and in no case did the disease spread to a second country. His number is high. A more accurate figure would be between 16 and 22. However, he is correct in his main point, that past efforts have successfully contained the disease.", "The combination of an exaggerated number and an accurate assessment of the importance of the public health response leads us to rate this claim Mostly True.", "MSNBC, All In with Chris Hayes, Oct. 20, 2014", "Journal of the American Medical Association, The Ebola Epidemic: A Global Health Emergency, Sept. 17, 2014", "Centers for Disease Control and Prevention, Outbreaks Chronology: Ebola Virus Disease", "World Health Organization, Ebola virus disease, September, 2014", "New England Journal of Medicine, Ebola Virus Disease in West Africa — The First 9 Months of the Epidemic and Forward Projections, Oct. 16, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]