["The graphic was shared in this Facebook post on December 4, 2020.", "The quote is attributed to Eufemia Cullamat, a lawmaker in the Philippine House of Representatives under the Bayan Muna party-list group. Cullamat's daughter was killed during clashes between the Philippine army and New People's Army rebels in Surigao del Sur in November 2020.", "The purported quote, written in a mix of English and Tagalog, reads: \"My daughter's death has not been in vain. I am very proud of her. I wish the children of Zarate, Renato Reyes, etc. are like her too. / Bayan Muna Party-List Representative Eufemia Cullamat on the death of her daughter following an encounter between the military and members of the New People’s Army / November 29, 2020”.", "Zarate refers to Carlos Zarate, a fellow politician in the Bayan Muna group; while Renato Reyes is the secretary-general of the Bagong Alyansang Makabayan, an alliance of left-wing Philippine organisations.", "The same graphic was also shared on Facebook here, here and here alongside a similar claim.", "The claim is false.", "A combined reverse image and keyword search on Google found the original graphic published here on the Facebook account of ABS-CBN on November 29, 2020.", "It states: “It would not surprise me if my child joined the (New People’s Army) because of the continuing cruelty and abuse against us indigenous people by the (Armed Forces of the Philippines) and their paramilitary groups. Our family experienced this. I believe that she was fighting for a reasonable cause but she chose a different form.”", "Below is a screenshot comparison of the manipulated graphic in the misleading posts (L) and the original ABS-CBN graphic (R):", "Multiple local media reports carried the accurate quote: including this article by GMA News; this article by Philstar.com; and this article by Manila Bulletin.", "A representative for ABS-CBN told AFP via text message on December 14, 2020 that the  graphic in the misleading posts “did not come from ABS-CBN News.”", "ABS-CBN -- a critic of President Rodrigo Duterte -- slashed its operations after advertising revenues were ravaged by the loss of its free-to-air licence in May, AFP reported here.", "AFP Fact Check has previously debunked social media posts sharing manipulated ABS-CBN quote cards, here and here.", "As of December 16, 2020, there are no credible media reports that indicate Cullamat has made any such remarks about her daughter’s death or the children of fellow Philippine politicians.", "The misleading claim was also debunked by Philippine news organisation Rappler here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]