["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Andrew Cuomo delivers his State of the State address in Albany on Jan. 8, 2020. (Courtesy Gov. Andrew Cuomo/Flickr)", "In Gov. Andrew Cuomo’s 10th State of the State address last week, he claimed that under his administration, \"We have the lowest corporate tax rate since 1968.\"", "New York’s business climate has for years been the subject of criticism from business groups and conservative lawmakers, so we wondered about this claim.", "We approached Cuomo’s office, where spokesman Jason Conwall provided us with historical tax data.", "The Department of Taxation and Finance maintains this data, and a table titled \"History of Corporate Tax Rates in New York State, 1917-2009,\" shows that between 1968 and 1970, the corporate tax rate, also known as the corporation franchise tax, was 7 percent. The rate did not fall below 7 percent in later years, and in the final year, 2009, the rate was 7.1 percent.", "Since 2009, the rate changed once, when it was lowered to 6.5 percent, Conwall said. The 6.5 percent rate took effect on Jan. 1, 2016. Historically, New York has had separate rates for banks and insurance companies. The bank tax was merged into the corporate tax system in 2015.", "We reached out to observers of the state’s tax policies for context and to check for any conflicting data.", "The Tax Foundation, a national organization, studies federal and state tax policy and advocated for the Tax Cuts and Jobs Act supported by President Trump and congressional Republicans. The Tax Foundation confirmed Cuomo’s claim.", "\"New York saw remarkable improvement in both its corporate rate - bringing it down to 6.5 percent - and structure - cutting four corporate bases down to three - through tax reform in 2014,\" said policy analyst Janelle Cammenga.", "The Tax Foundation advocates for simpler tax codes, and Cammenga noted that New York’s complex individual income tax code affects so-called pass-through businesses, such as partnerships, sole-proprietorships, and limited liability companies.", "E.J. McMahon, founder and research director at the conservative Empire Center, also confirmed Cuomo’s claim. McMahon added that in the 12-county region in downstate New York served by the Metropolitan Transit Authority, a surcharge brings the tax rate to 8.34 percent there. But even with the surcharge, it’s still the lowest rate since 1970, McMahon said.", "At the left-leaning Fiscal Policy Institute, executive director Ron Deutsch confirmed Cuomo’s claim.", "Dave Friedfel, director of state studies at the Citizens Budget Commission, a nonpartisan research and advocacy organization in Albany and New York City, said that readers should be aware that companies in New York pay more than just the corporate franchise tax. In addition to the MTA surcharge, set by the state, New York City imposes a 8.85 percent corporate franchise tax.", "\"Overall, it’s good that New York State’s corporate franchise tax rates are lower than they were and are competitive nationwide, but it’s just a small part of the taxes paid by businesses in New York,\" Friedfel said.", "Cuomo claims that under his administration, New York has the lowest corporate tax rate since 1968.", "Though there are other taxes levied on businesses in New York, experts from the left and the right agree with Cuomo's assertion.", "We rate Cuomo’s statement True.", "Gov. Andrew Cuomo State of the State address transcript, Jan. 8, 2020, via Cuomo’s website. Accessed Jan. 9, 2020.", "Email conversation, Jason Conwall, spokesman, Gov. Andrew Cuomo, Jan. 13, 2020.", "New York State Department of Taxation and Finance, The Electronic New York State Tax Sourcebook: Data and Statistical Tables - Excel Format, Table 34: \"History of Corporate Tax Rates in New York State, 1917-2009.\" Accessed Jan. 13, 2020.", "Email conversation, E.J. McMahon, founder and research director, Empire Center for Public Policy, Jan. 13, 2020.", "Email conversation, Dave Friedfel, director of state studies, Citizens Budget Commission, Jan. 14, 2020.", "Email conversation, Fern Whyland, communications director, Fiscal Policy Institute, Jan. 14, 2020.", "Email conversation, Janelle Cammenga, policy analyst, Tax Foundation, Jan. 14, 2020.", "Tax Foundation report, \"State Corporate Income Tax Rates and Brackets for 2019,\" February 2019. Accessed Jan. 14, 2020.", "Tax Foundation report, \"New York Corporate Tax Overhaul Broadens Bases, Lowers Rates, and Reduces Complexity,\" April 14, 2014. Accessed Jan. 14, 2020.", "Ernst and Young report, \"Total state and local business taxes: State by state estimates for FY18,\" October 2019. Accessed Jan. 14, 2020.", "New York State Department of Taxation and Finance, report, \"Summary of Tax Provisions in SFY 2014-15 Budget,\" April 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]