["About this rating", "Since at least November 2020, a \"terrifying\" and \"ghoulish\" century-old photograph that depicted a group of girls in a linen factory has been featured in online advertisements. One advertisement said: \"One Detail Of This Photo Will Haunt Your Dreams... Take A Closer Look.\" Another read: \"This terrifying photo gave us nightmares... look closer and you'll see it.\" A third variation included the words: \"This photo gave us the creeps... Look closely and you'll see it.\"", "The photograph appeared to have been captured in the year 1900 (or circa 1900). There is no evidence that it was digitally altered, though it could have been manipulated during processing, printing, or reproduction at some earlier point in time. The photograph was available on the Getty Images licensing website with a helpful caption:", "Historical Geography. 1900. Ireland. Here are some happy Ulster girls from a linen factory of North Ireland's chief city. Irish linen long ago made a name for itself, and many of the finest handkerchiefs and lingerie come from this source. The flax fibre is derived from the stalk of the plant. Each girl in the photograph has round her waist a cord sustaining various implements used in her work. (Photo by: SeM/Universal Images Group via Getty Images)", "The photograph features 15 girls posing at a linen factory in what later became known as Northern Ireland. The girl on the right side of the image, second row from the bottom, appears to have something on her shoulder.", "While there appear to be \"ghoulish\" fingers on her shoulder, referred to by \"Inside Edition\" as a \"mysterious ghost hand,\" a helpful reader pointed out that it could simply have been the result of a long camera exposure. While instantaneous photography was invented prior to 1900 in the 19th century, some photographers continued to use a long exposure technique. One reader tweeted to us, and said: \"Looks like the hand of the woman behind her to the right, long exposure, she initially had her hand on her shoulder and then moved, you don't see a blur because the other woman's head is in the way.\"", "We also explored the possibility that the \"fingers\" on her shoulder could be some of the materials used in the linen factory. As the caption noted, \"each girl in the photograph has round her waist a cord sustaining various implements used in her work.\"", "Falling on the front side of the girl to the left of the girl in question is an example of the \"implements\" that they worked with, which somewhat resemble the \"fingers\" on the other girl's shoulder.", "We also noticed that fourteen out of the fifteen girls in the photograph have their arms crossed in front of them.", "A second photo from Getty Images also showed a linen factory in Belfast \"circa 1900.\" However, it was unclear if it was the same factory.", "According to Yahoo, the photograph was sent into the website Belfast Live by a woman named Lynda, who said that the woman with the \"fingers\" on her shoulder was her grandmother, Ellen Donnelly.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Dec. 5, 2020: We updated this story to add a more plausible explanation after a reader posited that the photograph could have been a long exposure.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]