["By Lori Robertson", "Posted on October 2, 2018", "The Department of Justice is siding with plaintiffs in a lawsuit that it said, if successful, would end Affordable Care Act protections for those with preexisting conditions. Yet, President Donald Trump claimed that “preexisting conditions are safe” and that he “will always fight for … patients with preexisting conditions.”", "The president made his comments during a rally in West Virginia to back the Republican Senate candidate, Patrick Morrisey, who is running against Democratic Sen. Joe Manchin. Morrisey, the state’s attorney general, is one of the plaintiffs in the lawsuit concerning the ACA.", "Trump, Sept. 29: I will always fight for, and always protect, patients with preexisting conditions. You have to do it. You have to do it. Some people think that’s not a Republican thing to do. I don’t care, and I’ll tell you what. All of the Republicans are coming in to that position now. All of them. And we’ll do it the right way too. Preexisting conditions are safe. OK? Just remember that. Preexisting — tell that to the fake news media when they write. Fakers.", "Trump’s comments contradict the Justice Department’s actions, which Trump approved, according to a June letter from the Justice Department to Congress on this lawsuit. We asked the White House press office for an explanation of the president’s remarks, but we have not yet received a response.", "As we’ve explained before, the suit was filed in District Court in Texas in February by 20 states (including West Virginia). It argues that because Congress eliminated the tax penalty associated with the ACA’s individual mandate — which is the requirement to have insurance — the mandate itself is now unconstitutional. And without the mandate, the entire health care law “must also fall.”", "The suit points to the Supreme Court’s 2012 decision that found the mandate was lawful under Congress’ power to tax. The elimination of the associated tax, the suit maintains, “renders legally impossible the Supreme Court’s prior savings construction of the Affordable Care Act’s core provision.” And, therefore it says, “the Court should hold that the ACA is unlawful.”", "In June, the Department of Justice said this was a “rare case” where it would not defend the federal government in the lawsuit. Instead, the DOJ largely agreed with the plaintiffs.", "Attorney General Jeff Sessions wrote in a June 7 letter to House Speaker Paul Ryan that he had made this decision “[a]fter careful consideration, and with the approval of the President of the United States.”", "Sessions explained that the administration didn’t agree that the entire ACA would have to be eliminated if the individual mandate provision is found to be unconstitutional. But it said two provisions would need to be eliminated: those guaranteeing that people can’t be denied coverage by insurers or charged more based on certain factors.", "Those provisions protect those with preexisting conditions from being denied a policy or charged higher premiums. Before the ACA instituted these protections, insurers could deny coverage, or charge more, based on health status on the individual market, where those without employer-based plans or public coverage buy their own insurance. Employer plans, pre-ACA, couldn’t deny plans to new employees, but they could exclude coverage for a particular preexisting condition for a limited period if the new employee had a gap in coverage. (See our July story on this issue for more on the pre-ACA protections.)", "The court in the Northern District of Texas allowed Democratic attorneys general from 16 states and Washington, D.C., to intervene in the case and defend the ACA. In early September, the judge in the case heard oral arguments on a preliminary injunction against the ACA requested by the plaintiffs.", "In late August, 14 Republican senators signed on to a GOP bill that would preserve protections against denial of coverage or higher premiums on the individual market by amending HIPAA, the law that granted such protections in the employer-based insurance market pre-ACA. Morrisey issued a statement to the Hill supporting the measure, saying: “We all agree pre-existing conditions need to be covered and I’m glad to see Congress doing its job to protect those who need it most.”", "No hearings have been held on the bill, and there is no indication if Trump supports it.", "We can’t predict what future steps the administration might take if the plaintiffs are successful in the Texas case. But it’s disingenuous for the president to say he “will always fight for, and always protect, patients with preexisting conditions,” when his Justice Department, with his approval, has decided not to fight — and instead side with the plaintiffs — in a lawsuit that could end such patient protections.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]