["About this rating", "Julian Assange has called upon the United States to \"renounce its witch-hunt against WikiLeaks\" and \"dissolve its FBI investigation.\"", "Assange's pleas long antedate the 2016 election and are unrelated to its outcome.", "On 16 November 2016 the web site Winning Democrats published an article implying that WikiLeaks founder Julian Assange was seeking a personal presidential pardon from Donald Trump as recompense for \"[s]abotaging Clinton]\":", "Julian Assange Finally Asks Trump for Payment for Sabotaging Clinton — A Full Pardon", "With the 2016 elections over and Trump as the President-elect, Julian Assange is finally asking for payment for his part in assisting the Trump campaign. Since 2011, Assange has been avoiding prosecution in the United States for leaking documents through his organization, Wikileaks, relating to foreign affairs with information that had been given “secret” classification by the U.S. government ... In light of his anti-Clinton sentiment and despite the fact that he once likened Trump to cholera, Assange is now appealing to Trump to pardon him — the fact that he is currently under investigation and hasn’t actually been convicted of anything notwithstanding.", "With a history of anti-semitism and misogyny behind him, Julian Assange would fit in well with the company Trump currently surrounds himself, including alt-right advocate Steve Bannon and of course, Trump himself.", "As Breitbart correctly noted, WikiLeaks has already been negotiating with American authorities for several years with respect to the organization's operations. On 19 August 2012, Assange issued a formal statement from the Ecuadorean Embassy in which he implored President Obama that:", "As WikiLeaks stands under threat, so does the freedom of expression and the health of our societies.", "We must use this moment to articulate the choice that is before the government of the United States of America.", "Will it return to and reaffirm the values it was founded on?", "Or will it lurch off the precipice dragging us all into a dangerous and oppressive world in which journalists fall silent under the fear of prosecution and citizens must whisper in the dark?", "I say that it must turn back.", "I ask President Obama to do the right thing.", "The United States must renounce its witch-hunt against WikiLeaks.", "The United States must dissolve its FBI investigation.", "The United States must vow that it will not seek to prosecute our staff or our supporters.", "The United States must pledge before the world that it will not pursue journalists for shining a light on the secret crimes of the powerful.", "There must be no more foolish talk about prosecuting any media organization, be it WikiLeaks or the New York Times.", "The US administration’s war on whistle-blowers must end.", "Thomas Drake, William Binney, John Kirakou and the other heroic US whistle-blowers must - they must - be pardoned and compensated for the hardships they have endured as servants of the public record.", "And the Army Private who remains in a military prison in Fort Leavenworth Kansas, who was found by the UN to have endured months of torturous detention in Quantico Virginia and who has yet — after two years in prison — to see a trial, must be released.", "(Assange currently resides at the Ecuadorian Embassy in London after seeking asylum from that country and is wanted by Swedish authorities over allegations of sexual assault, so he would not necessarily escape legal troubles personally if he were pardoned by the U.S. president.)", "In November 2010, the Program in Law and Journalism at New York Law School blog Legal As She Is Spoke argued WikiLeaks (and by extension, Assange) had \"committed no crime\" for publishing leaked documents pertaining to the U.S. conflicts in Iraq and Afghanistan. The piece stood in stark relief to items published in 2016 decrying WikiLeaks for its activity:", "Since August, when Wikileaks first published 91,000 classified documents relating to the Afghanistan War, and in October, when they published approximately 400,000 more relating to the War in Iraq, many conservative commentators have been clamoring for the Justice Department to prosecute Wikileaks for publishing classified information.", "But in the United States, generally publishing classified information is not a crime. The sort of information that a news organization can be prosecuted for publishing is limited to: nuclear secrets (Atomic Energy Act), the identities of covert agents (Intelligence Identities Protection Act), and certain forms of communications intelligence (Section 798 of the Espionage Act).", "Perhaps lamenting that the U.S. does not have an Official Secrets Act like the United Kingdom, right wing columnists have consistently misinterpreted these Acts, or have cited other provisions of our espionage laws which almost surely do not apply to Wikileaks.", "The most commonly cited statute by those who advocate prosecuting Wikileaks is Section 793(e) of the Espionage Act. In August, former Bush speechwriter Marc Theissen linked to this section in an article for the Washington Post when he wrote that Wikileaks is “a criminal enterprise” whose founder, Julian Assange, should be arrested by U.S. forces on foreign soil, international law be damned.", "But this provision does not apply to those who publish information.", "Section 793(e)reads “Whoever having unauthorized possession of, access to, or control over any document…relating to the national defense…willfully communicates… the same and fails to deliver it to the officer or employee of the United States entitled to receive it…[s]hall be fined under this title or imprisoned not more than ten years, or both.”", "As made clear in the Pentagon Papers case, the word “communicates” was never meant “to encompass publication” or to affect the press. Congress included the word “publish” in three other sections of the Act but intentionally left it out of 793. As the legislative history of this provision states, “Nothing in this Act shall ... in any way to limit or infringe upon freedom of the press or of speech as guaranteed by the Constitution of the United States.”", "Slate published an editorial titled \"Why I Love WikiLeaks\" on 30 November 2010 that lauded the site for \"shock[ing] us out of [] complacency,\" again with a tenor absent from coverage of the platform during the 2016 election:", "As Assange navigates from military and diplomatic exposés to financial ones this year, his Wall Street targets won't be able to shield their incompetence and misconduct with lip music about how he has damaged national security and violated the Espionage Act of 1917 and deserves capital punishment. But I'm sure they'll invoke trade secrets, copyright, privacy, or whatever other legal window dressing they find convenient. Rather than defending their behavior, they'll imitate Clinton and assail Assange's methods and practices.", "As the Economist put it, \"secrecy is necessary for national security and effective diplomacy.\" But it \"is also inevitable that the prerogative of secrecy will be used to hide the misdeeds of the permanent state and its privileged agents.\"", "Assange and WikiLeaks, while not perfect, have punctured the prerogative of secrecy with their recent revelations. The untold story is that while doing the United States' allies, adversaries, and enemies a favor with his leaks, he's doing the United States the biggest favor by holding it accountable. As I.F. Stone put it, \"All governments lie, but disaster lies in wait for countries whose officials smoke the same hashish they give out.\"", "We contacted WikiLeaks' Task Force, a subset of the organization dedicated to ensuring accuracy in reporting about the platform's activities. A volunteer with whom we spoke confirmed that WikiLeaks had beseeched the Obama administration for many years to cease investigating their activities and to pardon whistleblowers, adding that the organization \"publishes without [favor]\" and would never release or withhold information based upon the possibility of favorable treatment from any state or entity.", "Assange, Julian.   \"Official Statement by Julian Assange from the Ecuadorian Embassy.\"\r\n    WikiLeaks.   19 August 2012.", "Kew, Ben.   \"Julian Assange’s Lawyers to Appeal to Donald Trump for Presidential Pardon.\"\r\n    Breitbart.   16 November 2016.", "Shafer, Jack.   \"Why I Love WikiLeaks.\"\r\n    Slate.   30 November 2010.", "Timm, Trevor.   \"Wikileaks Has Committed No Crime.\"\r\n    Legal Is As She Spoke.   12 November 2010.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]