["About this rating", "On Feb. 27, 2020, The Beaverton published an article stating that U.S. Vice President Mike Pence, who had recently been put in charge of the Trump administration’s response to the new coronavirus outbreak, announced a \"conversion therapy\" program to \"convince infected Americans they don’t have the disease after all\":", "Drawing on the techniques he believes turn gay people straight, Pence claimed “No-one is born with coronavirus, so the key is making them hate everything about themselves. Then and only then will they reject their unhealthy attachment to this so-called respiratory virus.”", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "The Beaverton is a news satire and parody publication. All articles contained within this website and on its social media accounts, however similar to real events, are fictitious. When public figures or actual businesses are mentioned by name, the corresponding story details are invented. In all other cases, any resemblance to actual persons, businesses or events is entirely coincidental.", "This satirical piece is a reference to Pence's past support for \"institutions which provide assistance to those seeking to change their sexual behavior.\"", "\"Conversion therapy\" is the scientifically discredited practice that attempts to force LGBTQ people to conform to heterosexual norms. It is banned in some states.", "For background, here is why we sometimes write about satire/humor.", "Brown, Peter.   \"Mike Pence Introduces Program to Cure Coronavirus Carriers With Conversion Therapy.\"\r\n    The Beaverton.   27 February 2020.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]