["The Facebook post, published here on November 19, has been shared over 2,200 times and claims that the new legislation was passed in Parliament.", "The text-only post reads in part: “Any driver of the vehicle who touches the phone while driving or while the engine is running will be directly revoked for three months. The police will not tolerate or accept any excuses.”", "Below is a screenshot of the full post:", "Posts with a similar claim were shared on Facebook here, here, here, here, here, here, here, here and here.", "The claim is misleading; touching a phone while driving is illegal in Australia nationwide, but the punishment is a fine -- not the revocation of one’s license.", "Australia’s state and territory governments are responsible for making road laws, not the federal government, as per the country’s Constitution.", "While every state and territory in Australia has the authority to govern its own roads, it is illegal nationwide for drivers to freely use mobile phones while their car is moving or in a stationary position, such as waiting in a queue or at a traffic light.", "In most states and territories, drivers are only allowed to use their phones freely when the car is parked, regardless of whether the engine is running or not.", "It's the exception in the Australian Capital Territory, where an Australian Federal Police spokesperson advised in an email on December 5 that \"a vehicle’s engine needs to be off before a driver handles a mobile device, even one in a hands free cradle etc.\"", "A spokesperson for the Western Australian Road Safety Commission added in a clarification email to AFP on December 3 that “whether a vehicle is ‘stationary but not parked’ may be a matter of the police officer’s discretion.”", "Phones, however, can be used if they are securely mounted to the vehicle or operated by voice commands.", "Yet learner and provisional licensed drivers are prohibited from using phones at all, even hands free, in New South Wales, Victoria, Queensland, South Australia, Northern Territory, Tasmania, and the Australian Capital Territory. In Western Australia, learner and provisional drivers follow the same rules as fully licensed motorists.", "But across all Australian states and territories, there is no law mandating that a license be revoked as punishment for a driver caught touching their phone illegally.", "The actual monetary penalties for drivers caught illicitly using their phones are as follows:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]