["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Barack Obama's recent decision to halt plans for a missile defense system in Eastern Europe has opened the door for Republicans to rekindle an attack they've used before: that Democrats are weak on defense.", "Former Alaska Gov. Sarah Palin, in a Sept. 23, 2009, speech to investors in Hong Kong, joined Fox talk show host Sean Hannity, Republican chairman Michael Steele, and others in attacking Obama for being too soft on defense.", "\"Though we are engaged in two wars and face a diverse array of threats, it is the defense budget that has seen significant program cuts and has actually been reduced from current levels!\" she said.", "She added, \"the Defense Department received only one-half of 1 percent of the nearly trillion-dollar stimulus package funding — even though many military projects fit the definition of 'shovel-ready.' \" She went on to cite examples of defense projects that she said Obama wants to cut.", "We recently examined a claim by Hannity that Obama has cut defense spending (we found it Half True), but we wanted to see if Palin was right that a tiny sliver of stimulus spending will go toward defense projects.", "The total cost of the stimulus, known officially as the American Recovery and Reinvestment Act of 2009, is $787 billion.", "According to the Defense Department, $7.4 billion will be spent on defense projects when the spending from the economic stimulus package is all said and done. That works out to slightly less than 1 percent of its total cost. That's slightly higher than Palin's \"one-half of 1 percent,\" but still very much in the ballpark.", "The White House says that the $7.4 billion for the military in the stimulus bill comes on top of an already increased military budget (indeed, when we checked Hannity's claim, we found that Obama increased defense spending 3.9 percent from 2009 to 2010, while the budgeted amount for future years would essentially be flat). And the goal of the package was to directly stimulate the economy.", "So Palin's underlying point that Obama is going soft on defense is a bit of a stretch. The amount of defense spending in the stimulus bill is not a good measurement of the administration's overall commitment in that area. But she is correct that defense was a small portion of the stimulus and her number is off only slightly. So we find her statement to be Mostly True.", "Defense Department,  Information on the Recovery Act  , accessed Sept. 25, 2009   Recovery.gov,  Agency Summary, Department of Defense  , accessed Sept. 25, 2009   GOP.com,  Wasted Opportunity  , accessed Sept. 25, 2009   Sarah Palin's Facebook Page,  Thoughts from Hong Kong  , Sept. 23, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]