["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican presidential candidate Ben Carson speaks during a Distinguished Speakers Series event at Colorado Christian University on Oct. 29, 2015. (Photo by Justin Sullivan/Getty Images)", "Presidential candidate Ben Carson called for fewer government regulations at the Oct. 28 Republican debate.", "Responding to a question posed about whether the government should regulate pharmaceutical prices, the former neurosurgeon pivoted to talk about federal regulation more generally, saying more government involvement means more problems.", "\"Well, the average small manufacturer, whatever they're manufacturing, drugs or anything, if they have less than 50 employees, the average cost in terms of regulations is $34,000 per employee,\" Carson said. \"Makes it a whole lot easier for them to want to go somewhere else. So what we're going to have to start doing instead of, you know, picking on this group or this group, is we're going to have to have a major reduction in the regulatory influence that is going on.\"", "We wondered if Carson’s claim that regulations cost $34,000 a year per employee at small manufacturing firms was correct. We found that Carson got the figure from a report, but the figure itself is not bulletproof.", "The figure comes from a 2014 report commissioned by the National Association of Manufacturers -- a group that advocates for regulatory reform -- which concluded that smaller manufacturers bear a bigger regulatory burden than medium and large firms. The study found that manufacturing businesses with fewer than 50 employees face on average $34,671 per employee per year in regulatory costs. The average among manufacturing companies of all sizes, conversely, is $19,564, and the average among all U.S. businesses is $9,991.", "The researchers were W. Mark Crain and Nicole V. Crain, economists at Lafayette College. In short, the Crains calculated a figure for the total cost of regulations in the United States, estimated what proportion of that cost various economic sectors bear, and then calculated the per-employee cost within each sector using payroll data.", "Their 2014 manufacturing study largely builds off of one they produced for the Small Business Administration, a government agency, in 2010. Many critics viewed the 2010 study as flawed because of the imprecise way the Crains calculated the primary figure: how much regulations cost in total, which came out to about $1.7 trillion. The nonpartisan Congressional Research Service questioned the results in its own report.", "The gist is that they based it on the extent of regulation within the United States and economic growth, rather than the literal costs associated with particular regulatory policies. (For a detailed overview of the criticisms of the 2010 report, read this New York Times blog.)", "In an email to PolitiFact, Nicole Crain said they \"took criticisms seriously\" and adjusted the 2014 report as a result. One major change is that the researchers also surveyed manufacturers. They inquired about actual costs incurred by these firms, such as purchasing special equipment to meet regulations and the cost of hiring employees to monitor compliance. Crain said the survey results support the findings from the regulatory index analysis.", "\"The results obtained from these two distinctly different approaches were quite similar,\" she said.", "We couldn’t find any other quality studies that calculated a similar figure with which we could compare the Crains’ data, and the experts we asked weren’t aware of any either.", "The Crains’ methodology is on the right track, but the problem is that they don’t have good data to back it up, said Richard Williams, an economist at the Mercatus Institute at George Mason University, who reviewed the 2010 study. The federal government publishes thousands of rules every year, but there is reliable cost data about very few of them.", "While it’s uncertain what the actual costs are, the $34,000 figure that Carson cited might not be totally off-base for manufacturers with fewer than 50 employees, Williams said.", "\"This might be in the ballpark, but it might be a lot higher, but it might be a little lower,\" Williams said.", "This figure is so vague that it’s meaningless, said Brookings Institution senior fellow and economist Clifford Winston, noting that his work is generally critical of government regulation. There are so many rules and types of costs -- everything from the direct cost of hiring special employees to the indirect cost of lost efficiency -- that it’s difficult to develop a comprehensive number for how many dollars firms lose to federal regulations generally. Most researchers look at regulations much more narrowly, such as examining a specific regulation or business sector, he said.", "Further, the study doesn’t fully take into account the benefits of regulations, Winston said, adding that in some cases, the absence of regulations could be more expensive than the costs of compliance.", "Looking through the report, Winston said the figure cited by Carson is in no way a reliable snapshot of how much the average small manufacturer spends on regulatory compliance.", "Our ruling", "Carson said that among manufacturers with fewer than 50 employees, \"the average cost in terms of regulations is $34,000 per employee.\"", "Carson cited a figure from a 2014 report out of the National Association of Manufacturers. However, the methodology behind the report has some significant shortfalls, so it’s not necessarily reliable.", "We rate the claim Half True.", "CNBC, GOP debate transcript, Oct. 28, 2015", "National Association of Manufacturers, \"The Cost of Federal Regulation to the U.S. Economy, Manufacturing and Small Business,\" Sept. 10, 2015", "Small Business Administration, \"The Impact of Regulatory Costs on Small Firms,\" Sept. 1, 2010", "New York Times, \"Questions on a Study of the Cost of Federal Regulation,\" April 10, 2013", "Congressional Research Service, \"Analysis of an Estimate of the Total Costs of Federal Regulations,\" April 6, 2011", "Wall Street Journal, \"The Regulation Tax Keeps Growing,\" Sept. 27, 2010", "Email interview, Nicole V. Crain, visiting professor at Lafayette College, Oct. 29, 2015", "Phone interview, Brookings economist Clifford Winston, Oct. 29, 2015", "Phone interview, Mercatus Institute economist Richard Williams, Oct. 29, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]