["By Eugene Kiely", "Posted on August 7, 2020 | Updated on August 7, 2020", "As scientists work to find a safe vaccine for COVID-19, President Donald Trump and his Democratic challenger, Joe Biden, have made competing claims about the administration’s plans to carry out the daunting task of distributing hundreds of millions of vaccine doses:", "COVID-19, the disease caused by the novel coronavirus known as SARS-CoV-2, has infected at least 4.8 million people and killed more than 160,000 in the United States, according to the COVID-19 dashboard from Johns Hopkins University.", "While the race for a vaccine is on, the Trump administration must figure out how to distribute more than 300 million doses — possibly more than 600 million doses, if the vaccine requires two doses — to reach everyone in the country.", "Contrary to Biden’s claims, the administration has begun planning for the distribution of a vaccine and has a “command officer” in place.", "The Department of Health and Human Services announced on May 15 that Army Gen. Gustave Perna would be the chief operating officer of Operation Warp Speed — a joint project of HHS and the Department of Defense that aims “to accelerate the development, manufacturing, and distribution” of a COVID-19 vaccine. The goal is to have 300 million vaccination doses available by January.", "The Centers for Disease Control and Prevention, which is part of HHS, will recommend priorities for vaccination distribution. The CDC’s Advisory Committee on Immunization Practices in April formed a COVID-19 Vaccine Work Group to recommend priorities on how to distribute the vaccine. The National Academies of Sciences, Engineering, and Medicine and the National Academy of Medicine also have formed a committee to help the CDC “in planning for equitable allocation of vaccines against COVID-19.”", "HHS will use “traditional vaccine distribution networks” to deliver the vaccines, a senior HHS official told us on the condition that we not use the official’s name. The Defense Department will handle the logistics of distribution and manufacturing, including assembling the vaccination kits, according to a senior administration official who spoke anonymously at a July 30 background briefing.", "But there’s no evidence that the military is “fully set up” to distribute a vaccine or that it will play a major role in the actual distribution of the vaccines, contrary to Trump’s remarks on July 28.", "The amount of work that still remains to do was evident at the July 30 background briefing, where two senior administration officials described some of the biggest logistical challenges to delivering vaccines, such as planning “for a multitude of scenarios,” depending on the type of vaccine and the number of doses available; setting priorities when limited doses are available; and creating an IT system “to keep track of every individual in the country who’s getting” a vaccine. All of that work is in progress.", "“At this time, the administration is working through the exact algorithms for the distribution and allocation of potential COVID-19 vaccines as it will not fully understand the performance of the vaccines until phase III trials are complete,” the HHS senior official told us in an email on Aug. 4.", "Dr. Paul Offit, chair of vaccinology at the Perelman School of Medicine at the University of Pennsylvania and a member of the Food and Drug Administration’s vaccines advisory committee, said he believes there is a plan, but he doesn’t know what it is — even after attending two briefings with Defense Department officials involved in the planning.", "“I don’t know if there is or isn’t [a plan]. I’m choosing to believe there is a plan – I can’t image they don’t have a plan,” Offit said in a phone interview.", "“I don’t think it is fair for Joe Biden to say there is no plan,” Offit said. “It is fair to say we don’t know what the plan is, and we may never know,” because of the “secretive culture of the Defense Department.”", "In an interview on MSNBC’s “The ReidOut,” Biden criticized Trump’s leadership on preparations for vaccination delivery.", "Biden, July 20: In addition, I would suggest right now — and I have urged the president to do this — right now, there may be a vaccine, God willing, after the 1st of the year. We should have a command officer now. We should be spending $25 billion to put together exactly how that will be distributed to over 300 million Americans. How will we do that? Where will it go? How will we get it done well? It needs planning – planning. And without any planning between now and Election Day, now and the time we are sworn in, it’s going to make it incredibly more difficult to get anything done.", "Nine days later, Biden unveiled his plan for racial equality at a speech in Wilmington, and once again he challenged Trump “to put someone in charge” of vaccination preparedness.", "Biden, July 28: But I want to say it again, I’m going to keep saying it. The president, as we speak, should be starting and should have started three months ago to put someone in charge of how specifically, like waging a war. How are you going to distribute the vaccine when it arrives, when it arrives, when it’s there?", "On the same day, Trump described a U.S. military that is “fully set up” to carry out its mission to deliver vaccination doses across the country.", "Trump, July 28: We’ve dramatically ramped up production of materials needed for a vaccine and are on track to rapidly produce 100 million doses as soon as a vaccine is approved, which could be very, very soon, and 500 million doses shortly thereafter. So we’ll have 500 million doses. And, logistically, we’re using our military, our great military — a group of people; their whole life is based around logistics and bringing things to and from locations — and they’ll be able to take care of this locationally and bringing it where it has to go very, very quickly. They’re all mobilized. It’s been fully set up.", "When we asked what the former vice president meant by his remarks, the Biden campaign provided us with a long list of examples that it said showed “Trump’s handling of the development of a COVID-19 vaccine has been marked by empty promises and a distrust of science & medicine.” The list mostly consisted of news articles, from February through July, of Trump’s “empty promises” to have a vaccine “very soon.”", "The campaign also provided a “comprehensive vaccine plan,” co-authored by Ezekiel J. Emanuel for the left-leaning Center for American Progress. Emanuel is a member of Biden’s coronavirus task force who was the special adviser for health policy to the director of the White House Office of Management and Budget from January 2009 to January 2011.", "“It’s self-evident what the vice president means,” Biden spokesman Michael Gwin told us in an interview. “The scope and scale of the challenge before us to develop a safe and effective vaccine, to manufacture it and all of its parts, and deliver it safely and effectively in the midst of an active pandemic is an unprecedented challenge. This administration has shown itself incapable of planning or managing any of the aspects of this crisis, despite the people they have ostensibly put in charge.”", "The Biden campaign’s supporting materials and subsequent interviews with campaign officials cast doubt on the Trump administration’s ability to carry out the formidable task of distributing more than 300 million vaccine doses. But they do not support Biden’s claims that there hasn’t been “any planning” and there is no “command officer” in charge of the distribution of a COVID-19 vaccine.", "We also asked HHS to provide us with information on the administration’s plans to distribute vaccinations. The department sent us transcripts of Operation Warp Speed background briefings, an OWS fact sheet and list of contracts the administration has for the advance manufacturing of vaccine candidates.", "Likewise, the HHS materials don’t support Trump’s claim of the military being “fully set up” to distribute vaccines, but rather show an administration that still has a lot of planning to do. And the military will have just a “complementary role to the traditional vaccine distribution networks,” as the HHS official told us.", "Here we take a look at what we know so far about the administration’s plans for delivering a vaccine once it is available.", "The goal of Operation Warp Speed is to begin manufacturing a vaccine even before it is authorized or approved for use, as explained in an HHS fact sheet. That would allow for wide distribution of the vaccine more quickly once it is proven to be safe and effective and receives all necessary government approvals. (The FDA must authorize or approve the vaccine and manufacturing process.)", "“Rather than eliminating steps from traditional development timelines, steps will proceed simultaneously, such as starting manufacturing of the vaccine at industrial scale well before the demonstration of vaccine efficacy and safety as happens normally,” the fact sheet says. “This increases the financial risk, but not the product risk.”", "There are many people and agencies involved, including Perna, the Army general who was confirmed by the Senate earlier early July to be the chief operating officer of OWS. Moncef Slaoui, a former chairman of global vaccines at GlaxoSmithKline, is the project’s chief adviser.", "Perna had been the commanding general of the Army Materiel Command, which is responsible for logistics, prior to his appointment.", "In addition to the military, several federal agencies at the HHS are involved in the development and manufacturing of a vaccine, including the CDC, FDA, the National Institutes of Health and the Biomedical Advanced Research and Development Authority.", "Offit said he supports the concept of Operation Warp Speed. “I give credit to the administration for doing this,” he said. “Vaccine is ultimately our way out of this.”", "The administration has contracts with several pharmaceutical companies to mass produce their vaccine candidates at the government’s expense. On July 31, the administration announced a $2 billion agreement with Sanofi and GlaxoSmithKline that will, among other things, provide for the production of 100 million vaccine doses, with an option to purchase an additional 500 million. Similar contracts were announced Johnson & Johnson for 100 million doses of its vaccine candidate and AstraZeneca for 300 million doses.", "“If it doesn’t work, we throw it away,” Offit said of the vaccines that fail to win government approval. “That’s fine. I think that’s all good.”", "Offit, however, expressed concern that Trump might short-circuit the licensing process and pressure the FDA to issue an emergency use authorization for one or more vaccines prior to the Nov. 3 election.", "Under the EUA process, “the FDA Commissioner may allow unapproved medical products … to be used in an emergency to diagnose, treat, or prevent serious or life-threatening diseases,” as the FDA explains.", "As an example of his concern, Offit cited the FDA’s decision in March to issue an EUA for hydroxychloroquine and chloroquine for hospitalized COVID-19 patients, even though there was very little evidence that the drugs were safe and effective for COVID-19. Trump repeatedly advocated the use of the drugs for COVID-19, but less than three months later the FDA revoked its EUA because the drugs were found to pose a health risk and were “unlikely to be effective in treating COVID-19.”", "In a June 8 opinion piece, Emanuel and Offit says researchers estimate that it should take “at least another eight to 12 months to determine whether these coronavirus vaccines are effective.” They fear the FDA will issue an EUA for an unlicensed vaccine before the clinical trials are completed.", "The administration has sent mixed signals on when a vaccine could be available.", "Trump repeatedly has said a vaccine would be available “by the end of the year,” even suggesting recently that it may be ready well before the end of the year. “We’re balancing speed and safety, and we’re on pace to have a vaccine available this year, maybe far in advance of the end of the year,” he said at an Aug. 3 press briefing.", "Three days later, Trump in a radio interview with Geraldo Rivera said that it is “possible before” the election, “but right around that time.”", "NIH Director Dr. Frances Collins, who has called having a vaccine by the end of the year a “stretch goal,” told CNN’s Wolf Blitzer there’s not enough information yet to say when a vaccine may prove to be safe and effective.", "“I don’t have a crystal ball. I think it would be amazing if, by the end of this year, we were able to say we have at least one of these that’s safe and effective,” he said. “And I’m cautiously optimistic about that. But trying to put a finer prediction on the timetable right now, I don’t think any of us have enough information yet to know how that’s going to shake out.”", "The National Institutes of Health announced on July 27 that a phase three clinical trial has begun for the first vaccine candidate, which was developed by the biotech company Moderna Inc. and the NIH. About 30,000 volunteers who do not have COVID-19 are expected to participate in the trial, which will determine the safety and efficacy of the vaccine. A successful phase three trial is the final step needed for approval.", "On the same day, Pfizer and BioNTech announced it would start a phase two/three combined trial that also will involve up to 30,000 volunteers.", "There are five or six other vaccine candidates “that the federal government is actively involved with is going into phase three trials over the next few months,” Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases, said at an July 31 congressional hearing.", "Even though Collins said it would be “amazing” to have a vaccine by the end of the year, a senior administration official held out the possibility of a vaccine being available by mid-October.", "“This could be, you know, it’s theoretically possible we could have 10 million doses in the middle of October or the end of October. It may not be till the end of December, it may be in early January,” the official said at the July 30 briefing. “So the fine line we’re walking is getting the American people very excited about the potential of vaccines and then missing on expectations versus, you know, having a bunch of vaccines in the warehouse and not as many folks want to get it.”", "Once a vaccine candidate receives emergency use authorization or licensure from the FDA, the challenge will be to distribute the vaccines in a fair and equitable way.", "Who will be among the first to be vaccinated?", "The ACIP’s vaccine work group — which has 41 members and is chaired by Beth Bell, a clinical professor of global health at the University of Washington — has been working to answer that question since April.", "Dr. Sarah Mbaeyi, of the CDC’s National Center for Immunization and Respiratory Diseases, gave a presentation on COVID-19 vaccine prioritization at the work group’s June 24 meeting.", "“Although the goal is to offer vaccine to the entire U.S. population, identifying priority groups for COVID-19 vaccination is essential to support vaccine implementation planning,” Mbaeyi said at the meeting. “This planning needs to begin prior to vaccine approval so that vaccine can be distributed without delay once available.”", "The National Academies of Sciences, Engineering, and Medicine and the National Academy of Medicine announced on July 21 that they have formed a committee to assist the CDC and National Institutes of Health in developing an equitable distribution plan. It held its first meeting July 24.", "Mbaeyi said the work group will use a tiered approach to vaccine prioritization based in part on a planning document for flu vaccines. She called the document, which was updated in 2018, a “useful framework for adaptation for COVID-19 vaccine prioritization.”", "These proposed objectives will guide the work group in establishing priority groups for vaccinations:", "At the July 30 briefing, a senior administration official said one of the biggest challenges to developing priorities and distribution plans is the uncertainty of knowing what vaccines will be approved for use.", "Senior administration official, July 30: [W]hat I mean by uncertainty is we have to plan for a multitude of scenarios. Will the vaccine be effective in certain parts of the population and not effective in other parts of the population? What volume will we have at what period in time? Will we have simultaneous vaccines that we have to deal with? So, there is – will it be one dose or two doses? Some vaccines are one dose, some vaccines are two doses. The cold storage conditions under which we have to transport and store them are different by vaccine.", "So when you do the number of combinations of all of those variables, you have a lot of complexity. We believe we are planning for all of them and there’s a number of components associated with planning for all of them.", "The risk for severe illness from COVID-19 increases with age, so the elderly will be a priority — if the FDA-approved vaccine works for them, a senior administration official said in the briefing.", "The ACIP will make prioritization recommendations to the CDC director and HHS secretary “in a transparent evidence-based process,” Mbaeyi said at the June 24 meeting.", "In a July 27 interview on CNN, Fauci said that’s the “standard way” for setting priorities for vaccination distribution that has been enhanced by the input of other health officials and agencies.", "Beyond planning to deliver the vaccine to priority groups, the administration needs a plan for making doses available for everyone.", "On MSNBC’s “The ReidOut,” Biden questioned “exactly how” the vaccine “will be distributed to over 300 million Americans,” adding that “without any planning between now and Election Day, now and the time we are sworn in, it’s going to make it incredibly more difficult to get anything done.”", "It’s not true that there isn’t “any planning” for the mass distribution of vaccines; but no plan has been made public, and there have been mixed signals on how the administration will distribute vaccines.", "Trump claimed that the military is “fully set up” to deliver the vaccines, and a senior administration official at the July 30 briefing seemed to confirm that the Defense Department is handling “all the logistics.”", "“The DOD is handling all the logistics of getting the vaccines to the right place at the right time and the right condition,” the official said. “And it’s not just the logistics of distribution it is the logistics of manufacturing and the logistics of preparing for manufacturing as well. And it involves things like kitting,” referring to the assembling of the vaccination kits.", "“So, you know, we’re in receipt and we’ll continue to be in receipt of hundreds of millions of needles, and syringes and vials. And all of those need to be prepared properly by type of vaccine,” the officials said. “The DOD is handling all of those logistics.”", "An administration official said distribution will be different for COVID-19 vaccines.", "“[T]his is going to be unlike the influenza vaccine where it’s largely a poll system — meaning, oh you know, a CVS or a Walmart says, ‘Send us 1,000 doses of this,’ and then we wait for the next order to come in,” an administration official said at the July 30 briefing. “We are going to be pushing the vaccines out hopefully to nursing homes, to seniors who are not ambulatory and stuck in their homes, to frontline healthcare workers, to meat packing plants, name it.”", "The administration officials at the briefing offered assurances it will work, but no plans.", "“I would say for anyone who’s served in the military or known someone that does, I really think we excel at operational planning and I think the key way to address uncertainty is plan every detail with every contingency,” said a senior official, whose name is withheld at the administration’s request. “And I think — I hope that, frankly, the American public can be reassured that, you know, I don’t see how we could work details more than we have been to address all of those different contingencies based on vaccine, as well as we learn, you know, which vaccine works best for which type of person.”", "But when we asked HHS about distribution, a senior department official told us it would be using the “traditional vaccine distribution networks,” and the military may or may not have a “complementary role.” A 2019 report by Deloitte — “The role of distributors in the US health care industry” — said drug distribution “is highly concentrated among three traditional full-line distributors: AmerisourceBergen, Cardinal Health, and McKesson.” Since discussions are ongoing, HHS could not provide any information related to any pending contracts, the official said.", "HHS official, Aug. 4: HHS will likely work with the traditional pharmaceutical distribution networks to accomplish this nationwide effort. The timing of those contracted efforts will be driven by drug manufacturing timelines to ensure vaccines are available to be distributed as soon as the FDA approves an EUA or drug licensure.", "DOD may be called on to provide a complementary role to the traditional vaccine distribution networks where speed of response or distribution to remote sites requires DOD augmentation. DOD support may not be required at all and may be the exception, not the norm.", "HHS gave a similar response to McClatchy in a July 29 story sent to us by the Biden campaign.", "Biden’s point, the campaign said, is, “You can’t take the administration at face value.”", "“Trump said they are ‘all mobilized,’ quote ‘fully set up,’ [for distribution],” Gwin, a Biden spokesman, told us. “But you and I can’t fact check that. There is no plan.”", "This concerns Offit, too.", "“There wasn’t a clear plan for PPE, testing and contact tracing,” Offit said, referring to shortages of personal protective equipment to hospital workers, delays in making COVID-19 tests available to the public and the failure of contact tracing in the U.S. “And this is much harder than that.”", "Offit said he believes there will be two or three vaccines and some may require two doses, meaning that the distribution system requires tracking people to make sure they get a second dose. That would be done by the CDC, a senior administration official said in the July 30 briefing.", "“Things like postvaccination, tracking of patients will be handled as you could expect by the CDC,” the official said. “Some of the communications through the state and the state relationships [with] the state public health organizations will be handled through the CDC.”", "One administration official said there is “a huge IT component” to the administration’s plans to distribute the vaccines and track those who receive doses.", "“We will be leveraging a lot of private partners who already have a good deal of that in place,” the official said. “We are under negotiation with several of them, but suffice it to say, we are not developing all that from scratch.”", "When we asked HHS for details on its information technology plans, we were told “the administration is working to conclude a number of contracts,” which will be made public “as soon as it is possible.”", "Offit said if one vaccine turns out to be more effective than another vaccine for certain population groups, such as the elderly, there will be “different recommendations for different groups.” That will also complicate the CDC’s vaccination plans. Most vaccines are dispensed at such locations as hospitals, doctor’s offices, pharmacies, schools and at work, but the pandemic has largely shut down schools, and millions of Americans are working remotely or not working at all.", "“That is the challenge here,” Offit said. “What is going to be the point of care? How do you ID that people walking up to you are in a priority group, and how do you make sure there is a second dose?”", "Offit added, “I think even if they are incredibly detailed about how they are going to do this – it is still incredibly hard to do this.”", "Update, Aug. 7: We added the the “comprehensive vaccine plan,” co-authored by Ezekiel J. Emanuel, was written for the Center for American Progress.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]