["As talk builds around former Starbucks CEO Howard Schultz’s possible presidential run, claims about the coffee giant’s hiring practices have resurfaced.", "A Facebook post shares a rumor that Schultz said he prefers to hire immigrants in the country illegally before hiring U.S. veterans.", "The post says, \"On the former CEO of STARBUCKS who thinks he can be President: In 2017 if you remember right, stated he would hire an illegal immigrant before he would hire a VET .. Let that sink in folks and share the heck out of this.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There is no evidence that Schultz ever said he would hire immigrants over veterans, and his actions toward veterans and their families also prove otherwise. This claim is a twist on Starbucks’ 2017 pledge to hire 10,000 refugees in the wake of President Donald Trump’s travel ban from Muslim-majority countries. Unlike immigrants who are in the country illegally, refugees go through an application and screening process through the U.S. State Department’s refugee admission program.", "Starbucks did receive some backlash for the decision, with people calling for boycotts and for the company to hire veterans instead. But Starbucks was already in the process of doing that. In 2013, the company announced it would hire 10,000 veterans and military spouses by 2018.", "The Starbucks Armed Forces Network (AFN), an internal veteran group that provides support for its current and former military employees and their partners, responded to critics in an open letter.", "The group wrote that Schultz helped lead the veteran-hiring initiative, contributed personal finances and visited military bases as the company helped establish \"military family stores at over 30 bases around the country\" and said that \"less than four years into the commitment, Starbucks has hired over 8,800 veterans and spouses and counting.\"", "By late March 2017, the company announced it had hit its goal of hiring 10,000 veterans and active-duty spouses a year early and set a new goal of reaching a total of 25,000 veterans and spouses by 2025.", "A post shared on social media claims that in 2017 Schultz said he would rather hire \"an illegal immigrant\" over a U.S. veteran.", "We found no record of Schultz saying that. The rumor is a misunderstanding of a Starbucks pledge to hire 10,000 refugees.", "The company has an internal veterans group and announced it had reached its previous goal of hiring 10,000 veterans and their spouses in March 2017, and it pledged to expand that number.", "We rate the post False.", "Facebook post, Feb. 17, 2019", "CNN, Howard Schultz must sell his Starbucks shares if he runs for president, Feb. 16, 2019", "Starbucks.com, Starbucks Makes Global Commitment to Hire 10,000 Refugees by 2022,", "Accessed Feb. 19, 2019", "Starbucks.com, A Message to Customers from Starbucks Armed Forces Network, Feb. 2, 2017", "Reuters, Starbucks responds to criticism over refugee hiring blowback, Feb. 2, 2017", "Fox News, Starbucks veterans group stands by CEO's refugee hiring plan, Feb. 3, 2017", "Seattle Times, Starbucks sets new hiring goals, including employing 25,000 veterans by 2025, March 22, 2017", "Council on Foreign Relations, How Does the U.S. Refugee System Work? Accessed Feb. 19, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]