["The four-minute 36-second clip has been viewed more than 5,000 times after being published on Facebook here on May 9, 2020.", "The caption of the now-deleted post reads: “Black leopard in Sri Lanka”.", "The same footage was shared with a similar claim on Facebook here. It was also published on YouTube here and here alongside a similar claim that the sighting occurred in the Horton Plains, a national park in southern Sri Lanka.", "These claims are false.", "A Google reverse image search with keyframes extracted using InVID-WeVerify, a digital verification tool, found that the footage had circulated in social media posts about a black leopard sighting in south India in 2010.", "It was published on YouTube here on March 31, 2010, with the title “Black Panther - Ghost of the Hills”.", "The description of the video reads in part: “This might be the first ever video footage of the Black panthers also known as Black leopards shot  in their natural Habitat in India. Black Panthers seen in the video have been observed over a period 6 months and video has been shot through out a month. This video has been shot by my good friend Sivlingam who is very passionate of wildlife and also a great birder too...” [sic]", "Below is a screenshot comparison of the video in the misleading post (L) and the YouTube clip (R):", "HB Varun, the YouTube user who uploaded the video, also told AFP the footage was shot in Tamil Nadu, a state in south India.", "“It was shot by my friend as mentioned in the video description on Youtube,” Varun, who is an animal photography enthusiast from Bangalore, India, told AFP on May 11, 2020, via Facebook Messenger. “It is shot in Nilgiris...near to Kotagiri town in Tamil Nadu...It was shot in 2005 by my friend...I uploaded this in 2010.”", "Black leopards, which are believed to be extinct in Sri Lanka, made national headlines in October 2019 thanks to new footage that showed what appeared to be a black leopard in the country.", "Wildlife experts, however, later determined that the footage merely showed an \"ordinary leopard displaying a colour variant”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]