["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "The weekend of April 17-19 saw a number of demonstrations take place in cities across the U.S. in protest of continued lockdown orders intended to limit the spread of the COVID-19 coronavirus disease. According to the BBC.", "Those taking to the streets say that the stringent measures restricting movement and businesses are unnecessarily hurting citizens.", "Protesters say the stay-at-home measures imposed by state governments to control the spread of Covid-19 are an overreaction.", "Some have also come bearing firearms as gun rights groups have been among the organisers, citing infringements on civil liberties.", "Some also say keeping these restrictions in place too long will cause long-term damage to local economies.", "For the most part the anti-lockdown protests were peaceful, although a few unseemly incidents of a non-violent nature did take place. For example, social media posts claimed that a few people in Columbus, Ohio, had taken advantage of the demonstration to display an anti-Semitic message:", "Unfortunately, this image was all too real, as Cleveland.com reported:", "A photo from the stay-at-home protest at the Statehouse is gaining traction on Twitter for its anti-Semitic message.", "The photograph captured two men in a minivan. One held a sign with an illustration of a rodent with the Star of David on its side and the words “The Real Plague.”", "The protest movement against coronavirus restrictions has been a mishmash of people. Some adhere to public health officials’ guidance of distancing themselves at least 6 feet apart and wearing masks. They want to return to work. On the more extreme are others who call coronavirus a hoax.", "But the anti-Semitism might drown out all their messages.", "Ohio state Rep. Casey Weinstein, who had previously tweeted the above photograph along with the comments \"There is a long, scary and disgusting history of blaming Jews for plagues and disease. NOT ON MY WATCH\" and \"I’ll call this out and stand right up to antisemitism wherever and whenever I see it!\" also tweeted a second photograph of the two men wielding the anti-Semitic sign:", "Weinstein was also quoted by Cleveland.com as stating that: \"I think it’s important to call that [anti-Semitism] out. I’m not going to let that pass. I’m not. There are people out there exercising their rights. By no means am I saying they’re all anti-Semitic, they’re all racists, but there is an element there. I’m glad to support everyone’s First Amendment right to express their view, and I will gladly exercise mine to push back on anti-Semitism whenever and wherever I see it.\"", "Hancock, Laura.   \"Some Ohio Coronavirus Protesters Using Anti-Semitic Symbolism.\"\r\n    Cleveland.com.   19 April 2020.", "BBC News.   \"Coronavirus Lockdown Protest: What's Behind the US Demonstrations?\"\r\n    21 April 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]