["Sen. Rick Scott, R-Fla., speaks after being selected to chair the National Republican Senatorial Committee, the campaign arm for Senate races. (AP Photo/J. Scott Applewhite)", "The Paris Climate Agreement relies on public reporting, not firm penalties, to keep countries on track.", "Its accountability rules are the same for all nations.", "China emits more carbon dioxide than the U.S., but per person, the U.S. emits more than China.", "President Joe Biden has been systematically undoing former President Donald Trump’s policies on climate change. Case in point — Trump took the United States out of the Paris Climate Agreement. On Biden’s first day, he signed paperwork to bring the United States back in.", "Under the Paris agreement, about 200 nations promised to set goals to cut their greenhouse gas emissions. Each nation decides for itself what its goal will be. The hope is that cumulatively, those reductions would limit global temperature increases to no more than 2 degrees Celsius above pre-industrial levels.", "Sen. Rick Scott, R-Fla., who chairs the National Republican Senatorial Committee, criticized Biden’s move.", "\"We have to stop joining deals that are bad for America,\" Scott said in a statement to the press. \"President Biden is throwing the U.S. back into the Paris Agreement just to appease his liberal friends. This deal does nothing to hold real polluters, like Communist China and India, accountable.\"", "There’s debate over how well the agreement’s overall approach will meet the challenge of climate change. Here, we focus on Scott’s claim that the agreement puts the U.S. at a disadvantage because it does nothing to hold \"real\" polluters like China and India accountable.", "Under the agreement, each country submits a set of greenhouse gas reduction targets called a Nationally Determined Contribution. Countries have been sending these to the United Nations since they launched the agreement in 2015, with new or updated goals due in 2020, and every five years after that.", "For example, in its 2016 plan, China said that by 2030, it would lower carbon dioxide emissions per unit of GDP by 60% to 65% compared with 2005 releases. So, although its emissions would rise as its economy grew, they wouldn’t rise as much as they would have if everything worked the way it did in 2005. China said it would aim for carbon dioxide emissions to peak in about 2030.", "India set a more modest goal of cutting emissions by 33% to 35% per unit of GDP by 2030. Both China and India had additional goals on their list.", "Scott said the agreement has no way to hold nations accountable if they stray from meeting their goals.", "Benjamin Zycher, resident scholar at the American Enterprise Institute, a market-oriented think tank, said Scott has a point.", "\"The Nationally Determined Contributions are strictly voluntary,\" Zycher said. \"There is no enforcement mechanism.\"", "Zycher is no fan of the Paris agreement. But even those who think it holds promise agree that it lacks teeth.", "\"There are no penalties other than naming and shaming if these pledges are too weak or are not fulfilled,\" said Michael Gerrard, director of the Sabin Center for Climate Change Law at Columbia Law School.", "Countries are required to report their progress publicly. Law professor Daniel Bodansky at the Arizona State University College of Law said transparency matters, and those progress reports are not simply taken on faith.", "\"The agreement provides for both expert and peer review of these reports,\" Bodansky said.", "Holding to international norms is a form of pressure, Bodansky argued. Zycher countered that China is autocratic and can ignore domestic and international pressure more easily than the United States, Canada and Europe.", "Gerrard said Scott’s reference to China and India was misleading.", "\"It implies that China and India are subject to weaker requirements than the U.S.,\" Gerrard said. \"That is incorrect.\"", "The agreement’s compliance rules might be weak, but they apply equally to all participating countries. The Biden administration will determine how ambitious the U.S. goals will be when it rejoins the agreement. At this point, we don’t know what those will be.", "Gerrard and Bodansky both fault Scott for calling China and India the \"real polluters.\" The actual rankings are more complicated. As this chart shows, by one measure, China releases more carbon dioxide than the U.S. By another, the U.S. tops China.", "\"The United States is the second biggest emitter of greenhouse gases in the world, and has higher per capita emissions than either China or India,\" Bodansky said. \"It is misleading to point the finger at China and India and label them as the real polluters.\"", "By the yardstick of carbon dioxide releases relative to the size of the economy, the latest numbers come from 2016 World Bank data. China was at the top with 0.5 kilograms per dollar of GDP, with India and the U.S. tied at 0.3 kilograms per dollar of GDP.", "We reached out to Scott’s office and did not hear back.", "Scott said the Paris Climate Agreement is bad for the United States because it fails to hold \"real polluters\" such as China and India accountable.", "People who study the agreement agree that it lacks teeth to hold each country to its carbon dioxide reduction goals. But its rules apply equally to all nations. China and India are treated the same as the U.S.", "China emits almost twice as much carbon dioxide as the U.S., but per person, the ranking is flipped, and the U.S. emits twice as much as China. By both standards, India emits much less than either country.", "The Paris agreement lacks strict enforcement, but Scott’s comparisons to China and India are misleading. We rate this claim Mostly False.", "WCTV, Florida Senator Rick Scott on Paris Climate Agreement: ’a bad deal for Americans’, Jan. 20, 2021", "United Nations Climate Change, The Paris Agreement, accessed Jan. 25, 2021", "U.N. Climate Change, China first NDC submission, Sept. 2, 2016", "U.N. Climate Change, India first NDC submission, Oct. 1, 2016", "Global Carbon Project, Global carbon budget, Dec. 11, 2020", "World Bank, CO2 emissions (kg per PPP $ of GDP), 2016", "Review of European Community and International Environmental Law, The Legal Character of the Paris Agreement, 2016", "Factcheck.org, Will Paris have a ‘tiny’ effect on warming?, June 14, 2017", "Email exchange, Daniel Bodansky, regents professor, Sandra Day O'Connor College of Law, Arizona State University, Jan. 25, 2021", "Email exchange, Michael Gerrard, professor and director, Sabin Center for Climate Change Law,  Columbia Law School, Jan. 25, 2021", "Interview, Benjamin Zycher, resident scholar, American Enterprise Institute, Jan. 25, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]