["The photo, which shows rows of people wearing a vest with the Japanese flag, was shared here on Facebook on February 1, 2020.", "Below is a screenshot of the misleading post, which has been shared more than 1,800 times:", "The caption states: “1.000 Medical Team from Japan, go to help Wuhan.”", "This image was also shared alongside a similar claim here on Twitter.", "Since its emergence in Wuhan in late 2019, the novel coronavirus has killed at least 425 people, including one in the Philippines, and infected over 20,400 people across China, AFP reported here.", "However, the claim about a Japanese medical team travelling to Wuhan is false.", "A reverse image search of the photo in the misleading Facebook post led to this report published on China’s state-run China Internet Information Center. The report is credited to Xinhua news agency and dated May 21, 2008.", "Below is a screenshot of the report:", "The photo's caption reads: “Members of Japanese medical team walk to board at the Narita airport in Chiba Prefecture, Japan, May 20, 2008. A 22 member Japanese medical team flew to Chengdu, capital of the quake-hit southwest China's Sichuan Province on Tuesday.”", "A 7.9-magnitude earthquake struck Sichuan on the afternoon of May 12, 2008, killing more than 87,000, AFP reported here.", "Below is a screenshot comparison of the photo in the misleading post (L) and the photo in the China Internet Information Center report (R):", "The same photo was also published in local media reports on the Japanese medical team’s dispatch to China in 2008 here and here.", "Moreover, the Embassy of Japan in Manila refuted claims that a Japanese medical team of some 1,000 personnel was sent to provide assistance in Wuhan.", "“Upon checking, please be informed that this report is not true,” the embassy told AFP via email on February 3, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]