["The claim was posted here on Facebook on March 16, 2021.", "“Global pharmaceutical company AstraZeneca is preparing to file a damage suit against domestic media outlets that would cost them multi million won,” the Korean-language post reads.", "Major South Korean newspaper Chosun Ilbo “will need to pay 50% of that cost,” it said.", "The claim was also shared on Facebook here, here and here.", "But the claim is missing context.", "Contacted by AFP, a spokesperson at AstraZeneca’s Seoul office said the posts were groundless.", "“The claim is utterly false. We have reported it to the South Korean health authorities as fake news,” the spokesperson said during a phone interview on March 18, 2021.", "A surge in misinformation about vaccines has prompted concern in South Korea, with the ruling Democratic Party pushing for legislation to punish media organisations and websites that contribute to the spread of false news.", "Major South Korean media organisations have said any such regulations would constitute an attack on free speech.", "The misleading Facebook posts began circulating after this report by South Korean news site Gobal News was published March 14, 2021.", "“There is a growing concern that domestic media outlets might face a damage suit from international companies,” the Korean-language report claims.", "“Some South Korean domestic media outlets have reported that Austria has halted use of AstraZeneca Covid-19 vaccines after the European country had one death. But it turned out to be untrue. Austria halted use of specific doses of batch, but domestic media outlets omitted that information while translating foreign reports.”", "The Gobal News report singled out Chosun Ilbo's reporting, pointing to this article, which does not explain until paragraph six that the Austria vaccine halt only applied to one batch of the AstraZeneca jab.", "Chosun Ilbo did not respond to an AFP request for comment.", "Austria did suspend distribution of one batch -- the ABV 5300 batch -- of the AstraZeneca vaccine on March 8, 2021 following the death of a 49-year-old nurse from “severe blood coagulation problems” days after receiving the jab, AFP reported here.", "Authorities said the decision was taken as a precaution as there was no evidence of a causal link between the jab and the woman's death. Here is the official government announcement.", "Austria resumed distribution of the ABV 5300 batch on March 19, 2021, after a European Medicines Agency report found there was no evidence of a problem related to specific batches of the vaccine.", "Disputes over media reports in South Korea are typically dealt with by the Press Arbitration Commission (PAC) before they are taken to court, Lim Ju-hea, head lawyer at Seoul-based Yours Law Office, told AFP.", "“People could request the PAC to revise, block or even take down news reports in question. It takes much less time than bringing the matter to the court,” she said during a phone interview with AFP on March 19, 2021.", "“I would say this is a more ‘preferred’ way for those who experience such issues,” Lim added.", "Media companies in South Korea are liable for any damage caused by false reports only when it can be proven in court that they intentionally ran such reports to slander or cause damage, she said.", "Keyword and government record site searches did not find any previous cases where international companies have filed lawsuits for damages against domestic media in South Korea.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]