["About this rating", "In late February 2020, as a new coronavirus spread worldwide, a letter providing advice on avoiding a viral infection was shared and memed heavily. The letter is attributed to pathologist James Robb who described himself as \"one of the first molecular virologists in the world to work on coronaviruses.\" The letter itself provides common-sense solutions to preventing disease transmission:", "1) NO HANDSHAKING! Use a fist bump, slight bow, elbow bump, etc.", "2) Use ONLY your knuckle to touch light switches. elevator buttons, etc.. Lift the gasoline dispenser with a paper towel or use a disposable glove.", "3) Open doors with your closed fist or hip - do not grasp the handle with your hand, unless there is no other way to open the door. Especially important on bathroom and post office/commercial doors.", "4) Use disinfectant wipes at the stores when they are available, including wiping the handle and child seat in grocery carts.", "5) Wash your hands with soap for 10-20 seconds and/or use a greater than 60% alcohol-based hand sanitizer whenever you return home from ANY activity that involves locations where other people have been.", "6) Keep a bottle of sanitizer available at each of your home's entrances. AND in your car for use after getting gas or touching other contaminated objects when you can't immediately wash your hands.", "7) If possible, cough or sneeze into a disposable tissue and discard. Use your elbow only if you have to. The clothing on your elbow will contain infectious virus that can be passed on for up to a week or more!", "The portion of the missive that garnered the most attention, however, was the pathologist's recommendation of zinc lozenges:", "Stock up now with zinc lozenges. These lozenges have been proven to be effective in blocking coronavirus (and most other viruses) from multiplying in your throat and nasopharynx. Use as directed several times each day when you begin to feel ANY \"cold-like\" symptoms beginning. It is best to lie down and let the lozenge dissolve in the back of your throat and nasopharynx. Cold-Eeze lozenges is one brand available, but there are other brands available.", "This portion of the letter apparently resulted in memes suggesting the product Cold-Eeze was a \"silver bullet\" that would \"kill coronavirus\":", "We reached out to Robb to ask if he was the author of this letter. Via email, he told us that he did indeed write it, but that it was never meant to be for anyone besides family and close friends, and that it was not intended to be an advertisement for any specific product:", "It was my email to my family and close friends ONLY. Someone put it on their Facebook page. It was intended to be a monologue - not a dialogue. I do not use any social media and may have been too naive about what \"sharing\" means today.", "His history with coronaviruses is accurately recounted. In the late 1970s, as professor of pathology at the University of California, San Diego, Robb published some of the earliest descriptions of coronaviruses. He also published a book chapter on this class of viruses for \"Comprehensive Virology.\"", "While Robb does recommend zinc lozenges (of any brand, he told us), he would not describe the product as the silver bullet solution to the outbreak:", "In my experience as a virologist and pathologist, zinc will inhibit the replication of many viruses, including coronaviruses. I expect COVID-19 [the disease caused by the novel coronavirus] will be inhibited similarly, but I have no direct experimental support for this claim. I must add, however, that using zinc lozenges as directed by the manufacturer is no guarantee against being infected by the virus, even if it inhibits the viral replication in the nasopharynx.", "In general terms, research suggests that zinc may be able to inhibit the spread of some viral infections, but the question remains scientifically unsettled. A 2010 study using cell cultures published in PLOS One found evidence that increasing intracellular zinc concentrations \"can efficiently impair the replication of a variety of RNA viruses\" including coronaviruses. According to the Cochrane Database of Systematic Reviews, \"trials conducted in high-income countries since 1984 investigating the role of zinc for the common cold symptoms have had mixed results.\" The common cold is, in some cases, caused by a virus also classified as a coronavirus.", "Because the letter was written by him, we rank this claim as “Correctly Attributed\" to Robb. For more tips on protecting against the coronavirus, visit the Centers for Disease Control and Prevention tip sheet here.", "Bond, Clifford W., et al.   \"Pathogenic Murine Coronaviruses II. Characterization of Virus-specific Proteins of Murine Coronaviruses JHSMV and A59V.\"\r\n    Virology.   30 April 1979.", "Robb, James A. and Clifford W. Bond.   \"Coronaviridae.\"\r\n    Comprehensive Virology.   1979.", "te Velthuis, Aartjan J. W., et al.   \"Zn2+ Inhibits Coronavirus and Arterivirus RNA Polymerase Activity In Vitro and Zinc Ionophores Block the Replication of These Viruses in Cell Culture.\"\r\n    PLOS Pathogens.   4 November 2010.", "Singh, Meenu and Rashmi R. Das.   \"Zinc for the Common Cold.\"\r\n    Cochrane Database of Systematic Reviews. &nbsp 18 June 2013.", "Centers for Disease Control and Prevention.   \"Common Human Coronaviruses.\"\r\n    Accessed 2 March 2020.", "Centers for Disease Control and Prevention.   \"Coronavirus Disease 2019 (COVID-19): Prevention and Treatment.\"\r\n    Accessed 2 March 2020.", "Correction [13 March 2020]: Clarified that human coronaviruses are just one of several potential causes of the common cold.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]