["The video was shared in this Facebook post on January 17, 2020. It has since been viewed more than 470,000 times and shared over 26,000 times.", "The post’s Hindi caption translates to English as: \"All the women are receiving money for freedom from Congress workers on the spot\".", "Below is a screenshot of the misleading Facebook post:", "The post was shared two days after an unverified video, alleging female participants at Delhi's Shaheen Bagh protest demonstration were being paid 500 rupees per day to protest, was shared by the ruling Bharatiya Janata Party's head of social media Amit Malviya.", "Hundreds of grandmothers, housewives and students have been sittting and sleeping across the main road in the Shaheen Bagh district of Delhi, fighting the country's new citizenship law. Here is an AFP report on the situation.", "The new law, approved December 2019, was spearheaded by the ruling Bharatiya Janata Party.", "AFP has debunked multiple pieces of disinformation about the Citizenship Amendment Act (CAA) – for example, here, here and here.", "The claim about footage showing women queueing to receive payment is another example of content being shared in a misleading context.", "The video was also published alongside the same claim here, here, here and here on Facebook and here, here and here on Twitter.", "A reverse Google image search of keyframes extracted from the video using InVID, a digital verification tool, found the same clip published here on YouTube on March 2, 2017, nearly three years before protests began against India’s new citizenship law.", "The video’s description alleges that the footage shows Congress party workers “bribing voters with money” in Manipur.", "However, Congress told AFP that the video shows a religious rite at a funeral in 2017 for a party member in Manipur.", "“Distributing money on deaths or marriages is a part of rituals in Manipuri culture, but this is unfortunate that the video has been circulated to claim that the Congress is bribing the people for anti-CAA protests,” Ningombam Bupenda Meitei, a party spokesperson from Manipur, said by phone on January 21, 2020.", "People in the video can also be heard speaking Meitei, the local language of Manipur, and several are wearing Congress flags and apparel.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]