["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "From left, Kenny Rogers and Dolly Parton share a laugh on the red carpet prior to the \"All In For The Gambler: Kenny Rogers' Farewell Concert Celebration\" at Bridgestone Arena on Wednesday, Oct. 25, 2017 in Nashville, Tenn. (AP)", "Singer Dolly Parton praises President Donald Trump as outperforming his predecessors -- or at least that’s what a fake story on Facebook proclaims.", "\"Singer Dolly Parton: \"Trump in one year is already better than 16 Years’ of Bush, Obama ‘Put Together,’\" stated a Jan. 22 headline on Americanproud.info.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news. It is. The story took a quote by a consultant who served in George W. Bush’s administration and and falsely attributed it to Parton.", "Earlier this month, Brett Decker spoke about consumer confidence and the economy. in a radio interview with Breitbart.", "\"Trump in one year is already better than 16 years of those guys put together,\" he said.", "The Americanproud.info story also used an actual quote by Parton in an interview with CNN in August 2016, but omitted the full context of her comments.", "\"We’re doing good,\" Parton told CNN. \"We got a woman that could go in the White House, so we’ve certainly come a long way in that respect.\"", "Americanpround.info included that snippet in its report, but went on to say that Parton \"saw the light\" and later called Hillary Clinton \"nuts\" and that her campaign has been \"just crazy.\"", "In reality, all those comments were actually from the same CNN interview, but Americanproud.info distorted what Parton actually said.", "When asked about Clinton and Trump, here’s Parton’s full remarks:", "\"I don't know where they're going to land but I think they're both nuts\" she said, joking that \"it's like watching the OJ Simpson trial. You just believe whoever's up next. Whoever testified last is who you believe.\"", "In the CNN interview, Parton doesn’t come across as committed to either candidate. CNN paraphrased her as saying she might not know who she will vote for and that it's time that both Trump and Clinton stopped talking about each other.", "In June 2016, the New York Times asked Parton how she felt about a female presidential nominee.", "\"Well, I think that that would be wonderful. Hillary might make as good a president as anybody ever has. I think no matter if it’s Hillary or Donald Trump, we’re gonna be plagued with PMS either way — presidential mood swings! But I personally think a woman would do a great job. I think Hillary’s very qualified. So if she gets it, I’ll certainly be behind her.\"", "After much publicity about that quote, Parton issued a statement.", "\"My comment about supporting a woman in the White House was taken out of context. I have not endorsed Hillary Clinton nor Donald Trump. I try not to get political but if I am, I might as well just run myself 'cause I've got the hair for it, it's huge, and they could always use more boobs in the race.\"", "Proclaiming that a celebrity now loves Trump or hates Clinton is a common theme in fake news stories. We debunked an article that said Sandra Bullock said to Clinton \"if you don’t like our president you can leave and never come back again\" and that \"Julia Roberts claims ‘Michelle Obama isn’t fit to clean Melania’s toilet’ \" We rated both statements Pants on Fire.", "In this case, the story that said Parton said, \"Trump in one year is already better than 16 years of Bush, Obama put together\" is also fake news. A consultant actually made a statement that virtually mirrors that quote.", "We rate this story Pants on Fire.", "American News, \"Singer Dolly Parton: \"Trump in one year is already better than 16 Years’ of Bush, Obama ‘Put Together,’\" Jan. 22, 2018", "Breitbart, \"Brett Decker: ‘Trump in one year is already better than 16 years’ of Bush, Obama ‘put together,’\" Jan. 6, 2018", "CNN, \"Dolly Parton on 2016 candidates: 'I think they're both nuts,'\" Aug. 26, 2016", "New York Times, \"Dolly Parton Is Proud of Her Gay Fans and Hillary Clinton,\" June 24, 2016", "USA Today Network, \"Emmy Awards - Parton at the center of Trump flap,\" Sept. 19, 2016", "White House Writers Group, Brett M. Decker, Accessed Feb. 1, 2018", "Snopes, \"Did Dolly Parton Say: 'Trump In One Year Is Already Better Than 16 Years of Bush, Obama Put Together’?\" Jan. 22, 2018", "Factcheck.org, \"Parton Me? Dolly Didn’t Praise Trump,\" Jan. 30, 2018", "PolitiFact, \"No, Sandra Bullock didn't disparage Hillary Clinton,\" Jan. 4, 2018", "PolitiFact, \"Julia Roberts did not say Michelle Obama 'not fit to clean Melania's toilet,'\" Dec. 28, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]