["About this rating", "Former Democratic presidents Jimmy Carter and Bill Clinton, as well as current president Barack Obama, have endorsed Hillary Clinton and criticized Donald Trump.", "Although former Republican presidents George W. Bush and George H.W. Bush have not endorsed Donald Trump, neither have they have criticized him or warned Americans not to vote for him.", "On 17 September 2016, the Facebook page Point Counter Point posted an image suggesting that for the first time in history, all living ex-presidents — and the current president to boot — have united to \"warn Americans no matter what do not vote for Trump\":", "Of course this circumstance (if true) would be something of a shallow precedent, given that the current campaign is Donald Trump's first bid for public office, and therefore no ex-presidents would ever have had occasion to urge Americans not to vote for him before.", "In any case, the Point Counter Point graphic featured images of two former Democratic presidents (Bill Clinton and Jimmy Carter) two former Republican presidents (George W. Bush and George H.W. Bush) and current president Barack Obama as among those who supposedly urged Americans not to vote for Donald Trump", "Certainly President Obama and President Clinton have both frequently criticized Donald Trump while supporting Hillary Clinton during the 2016 presidential campaign, and when President Jimmy Carter endorsed Hillary Clinton during the Democratic National Convention he said that Trump had violated some of the \"most important moral and ethical principles on which our nation was founded.\"", "The two living Republican former presidents, however, have largely refrained from commenting on the 2016 presidential race, both stating through their spokespeople that they do not intend to offer any endorsements:", "For the first time since his own presidency, George H.W. Bush is planning to stay silent in the race for the Oval Office — and the younger former president Bush plans to stay silent as well.", "Bush 41, who enthusiastically endorsed every Republican nominee for the past five election cycles, will stay out of the campaign process this time. He does not have plans to endorse presumptive GOP nominee Donald Trump, spokesman Jim McGrath [said].", "“At age 91, President Bush is retired from politics,” McGrath wrote in an email. “He came out of retirement to do a few things for Jeb [Bush], but those were the exceptions that proved the rule.” His son Jeb Bush dropped out of the GOP presidential race in February [2016].", "Bush 43, meanwhile, \"does not plan to participate in or comment on the presidential campaign,\" according to his personal aide, Freddy Ford.", "While the silence of former presidents from Trump's own party — who normally would (and did) endorse previous Republican candidates — could be considered a tacit rejection (or even a stinging rebuke) of the current nominee, neither the elder nor the younger Bush has openly criticized Trump since he became the GOP nominee, much less warned Americans not to vote for him.", "Second-hand scuttlebutt has it, though, that the elder Bush confided in a family friend he would be voting for Hillary Clinton.", "Ngo, Emily.   \"Obama Stumps for Clinton in Philadelphia, Criticizes Trump.\"\r\n    Newsday.   13 September 2016.", "Moye, David.   \"Bill Clinton Destroys Donald Trump In One Sentence On ‘Daily Show.'\"\r\n    The Huffington Post.   16 September 2016.", "Hains, Tim.   \"Jimmy Carter Addresses DNC, Blasts Trump's Lack Of 'Ethical Principles.'\"\r\n    Real Clear Politics.   26 July 2016.", "Rudner, Jordan.   \"Bush 41, 43 Have No Plans to Endorse Trump.\"\r\n    Texas Tribune.   4 May 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]