["The image was published here on Facebook on January 15, 2019. It has been shared more than 47,000 times.", "The post caption reads: “This is the Suit of Armour King Henry VIII had made for his Cat Dagobert”.", "Henry VIII was King of England from 1509 until 1547.", "The photo was also published alongside a similar claim on Facebook here, here, here, here and here, on Twitter here, here, here, here and here, and on Pinterest here, here and here.", "The claim is false.", "A reverse image search on Google found a series of photos that appear to show the same armour at a different angle, published here on May 24, 2016 on the official website for Ripleys, a US-based attractions franchise.", "The photo's caption reads: “Medieval cat armor created by Jeff de Boer”.", "Jeff de Boer is a Canadian artist. On his Twitter profile, he describes himself as “best known as the guy that makes armour for cats and mice”.", "His creations have received considerable international media coverage, including this report on CBC Canada and this report on Russia’s RT television network.", "Below is a screenshot comparison of the misleading post (L) and Ripleys’ photo (R):", "In response to the misleading claim, de Boer told AFP in an October 23, 2020 email that he did make the armour pictured in the social media posts for a Ripley’s Believe It or Not! Museum in the US in 1992.", "The false claim was also debunked by fact-check website Hoaxeye here on January 20, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]