["Protests against the Citizenship Amendment Act (CAA) entered the third month in February 2020. Communal clashes between those against the law and pro-CAA groups led to the death of at least 45 people in Delhi. Misinformation on social media, however, continues to promote hate. In the latest spree, a video where dead bodies of a baby and a woman are dug out from the ground is circulating on social media. A Twitter user Major Muhammad Arif (@marifthahim) shared the clip and wrote, “Muslims are being buried alive in India.”", "Muslims are being buried alive in India. 😭😭😭 pic.twitter.com/KghAvgCtP5", "— Major Muhammad Arif TI(M) (R) (@marifthahim) February 29, 2020", "The video is being shared with the same claim by several users on Twitter and Facebook.", "Alt News reverse-searched keyframes from the video on Google and found a report from West Bengal published by eisamay.indiatimes.com on January 31, 2020. According to the report, the incident took place in Haluguch village under the jurisdiction of Islampur police station in North Dinajpur. A man named Akbar Ali allegedly murdered his wife and month-and-a-half-year-old baby after a domestic spat. Ali buried the dead bodies near his residence which were dug out after villagers suspected wrongdoing. The enraged locals also set Ali’s house on fire but he managed to escape.", "We also found a video report by News18 Bangla which describes the complete incident.", "Therefore, an incident from West Bengal where a man allegedly murdered and buried his wife and child was communalised on social media and presented as a case related to Delhi riots.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]