["About this rating", "Swimmers discovered a dead shark on a Florida beach in 2015.", "The image distorted the size of the animal to suggest a much larger shark was killed.", "The shark's cause of death.", "In early September 2016, photographs of a half-eaten shark began circulating along with captions saying that it was an enormous dead shark pulled out of the water in Daytona Beach, Florida. Going by images alone and without context, it was easy to believe that a large, crudely bisected shark was dragged from the waters.", "An 18 August 2015 article reported of the find (which was on Butler Beach, not Daytona):", "People taking surf lessons on Butler Beach were in a for big surprise when they entered the water Saturday.", "At around 12:30 p.m., Dakota Dodson, a surf instructor for the St. Augustine Surf School, noticed a fin sticking out of the water and went to investigate.", "\"At first, I only saw the fin, so I just assumed it a live shark. But then I realized it was only half of one,\" he said.", "The half-eaten carcass, measuring about 2.5 feet, was found floating in knee-deep water, Dodson said.", "The circumstances of how the shark died remain unclear, but experts believe it was likely eaten by another shark.", "\"It's most likely it was bitten in half by another shark — sharks have to eat, too,\" said Tara Dodson, environmental supervisor for St. Johns County.", "The shark carcass was reportedly around 30 inches long, and wasn't the massive predator the viral photos suggested. An additional image illustrated the size of the half-eaten shark more accurately:", "Carpenter, Jenna.   \"Half-Eaten Shark Found By Surfers At Butler Beach.\"     St. Augustine Record.   19 August 2015.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]