["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Voters cast their ballots at the University of Wisconsin-Milwaukee on Nov. 8, 2016, an election that spurred a recount. (Milwaukee Journal Sentinel/Pat A. Robinson)", "It’s widely expected that after a recount of 3 million ballots under way in Wisconsin, Donald Trump will still have won the state.", "But what if 300,000 more Wisconsinites had voted in the presidential election?", "That number is 11 times higher than Trump’s 22,000-vote margin over Hillary Clinton, based on the original counts.", "The specter of a different result was raised widely on Twitter beginning Nov. 9, 2016, the day after the election. It came with this claim (which used a vote-margin figure that had been quoted in some news reports):", "Trump won Wisconsin by 27,000 votes. 300,000 voters were turned away by the state’s strict Voter ID law. There is your \"rigged\" election.", "By Dec. 6, 2016 -- midway through the $3.5 million recount, paid for by the campaign of Green Party presidential nominee Jill Stein -- the tweet was still being retweeted.", "(Stein, by the way, earned a Pants on Fire for her claim that Wisconsin uses outlawed voting machines.)", "There’s no evidence that 300,000 Wisconsin voters were turned away from the polling places because they didn’t have photo identification.", "But it’s worth noting, with the emergence of fake news, that the figure isn’t pulled out of thin air.", "The law, and lawsuits", "In 2011, the Republican-controlled Wisconsin Legislature adopted and GOP Gov. Scott Walker signed a law requiring residents to show a photo identification in order to vote. A drivers license, state ID card, passport and other forms of ID were among those that would meet the law. Voters could request a free state ID for voting from the state Department of Motor Vehicles.", "(Wisconsin is one of seven states with a so-called strict photo ID law, according to the National Conference of State Legislatures. Eight other states have a photo ID law that’s labeled as non-strict.)", "The same year, and again in 2012, various groups filed lawsuits. After a two-week trial, U.S. District Judge Lynn Adelman in 2014 struck down the law. The Milwaukee judge said the requirement that voters show photo IDs at the polls established an unconstitutional burden on the right to vote and violated the federal Voting Rights Act because its effects hit Latinos and African-Americans harder than whites.", "As part of his ruling, Adelman determined that about 300,000 registered voters in Wisconsin -- about 9 percent of all registered voters -- lacked the type of identification needed for voting. He said his finding was based primarily on expert testimony from Leland Beatty, a statistical marketing consultant in Texas who was hired by the plaintiffs. Beatty, the judge wrote, estimated the number of registered voters who did not have a drivers license or state ID card.", "After more litigation, the law was eventually reinstated in 2015.", "2016 election", "So, how many people were turned away in the 2016 presidential election for lack of photo ID?", "In Wisconsin, according to the state Elections Commission, there were 2,975,313 votes cast for president in 2016 (prior to the recount), down 93,121 votes or 3 percent from 2012.", "The Milwaukee election director said the drop of 41,000 included \"some of the greatest declines\" in areas \"we projected would have the most trouble with voter ID requirements.\" He also acknowledged, however, that some of the drop-off had to do with the candidates and less enthusiasm for the candidates.", "But no statistics are kept on the number of people who were turned away at polling locations on election day for lack of photo ID.", "In any case, it’s almost certain the figure is not 300,000.", "Adelman himself noted that although he found the voter ID law would \"deter or prevent a substantial number\" of the 300,000 from voting, \"a more precise measurement is impracticable. There is no way to determine exactly how many people (the law) will prevent or deter from voting without considering the individual circumstances of each of the 300,000 plus citizens who lack an ID.\"", "Political scientist Barry Burden, director of the Elections Research Center at the University of Wisconsin-Madison, told us: \"There is no evidence that 300,000 people were turned away in the November 2016 election. We will never know the precise impact of the voter ID law on turnout. It is almost certainly not true that all 300,000 or so people who are registered but lack ID tried to vote this year.\"", "Simply put, while it’s likely that some voters were turned away at the polls, others no doubt obtained a photo ID and cast their ballots.", "Snopes.com, which in its fact check of this statement issued a rating of \"unproven,\" concluded that \"even if the 300,000 figure was an accurate estimate of Wisconsin residents who back in 2014 possibly could not vote because they did not have the correct identification, that number was not a head count of residents who actually did or would have set out to vote on Nov. 8, 2016, only to be turned away.\"", "After that fact check, the originator of the tweet wrote a blog post acknowledging there isn’t evidence to back up the claim.", "Our rating", "Tens of thousands of times, Twitter users repeated this statement: In Wisconsin, \"300,000 voters were turned away by the state’s strict voter ID law\" in the 2016 presidential election.", "A federal judge in 2014 determined in a civil rights lawsuit that some 300,000 registered voters in Wisconsin lack the photo identification necessary to comply with Wisconsin’s voter ID law. But there is no evidence that anywhere near that number of people were turned away from the polls in the 2016 presidential election for lack of a proper photo ID.", "We rate the statement False.", "Twitter, Dan Arel tweet, Nov. 9, 2016", "Patheos.com, Dan Arel blog post, Nov. 14, 2016", "Snopes, \"Milwaukee Brooders,\" Nov. 14, 2016", "Email, freelance writer Dan Arel, Dec. 5, 2016", "Email, former Wisconsin elections director Kevin Kennedy, Dec. 6, 2016", "Email, Wisconsin Elections Commission public information officer Reid Magney, Dec. 6, 2016", "Milwaukee Journal Sentinel, \"Federal judge strikes down Wisconsin's voter ID law,\" April 29, 2014", "Email, political scientist Barry Burden, director of the Elections Research Center at the University of Wisconsin-Madison, Nov. 16, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]