["“Breastfeed milk with BLOOD and PUS. This is what they sell you. This is what you drink,” warns one Facebook post that was shared more than 45,000 times since it was published in 2016. Its author, vegan YouTuber Sonia Sae, also invites internet users to consider that “any plant based milk will be healthier and more ethical than cow's breastfeed milk.”", "More recently, Sae's post gained a new virality in Spanish-speaking corners of the internet.", "The photo in Sae's post is a screenshot of a video posted in December 2013 by a dairy farmer from Gloucestershire, in England.", "At the beginning of the video, a man with a British accent can be heard explaining that he is about to milk three cows ready to give milk for the first time after giving birth. According to the narrator, the cows have been separated from the rest of the herd because in the days following calving, they secrete a liquid called colostrum that is thick and creamy, and \"you can't really sell it anyways.”", "Health regulations in Canada, Mexico, and the United States, do not allow the commercialization of milk containing colostrum, nor the sale of colostrum as milk. However, farmers such as the one in the YouTube video, store this liquid because it is an essential part of the diet of newborn calves. Thanks to its nutritional value, colostrum can also be processed and sold as a dietary supplement for human use.", "The farmer further explains that one of the cows has a little bit of blood on its udders due to a blood vessel rupture, and that milking it would likely result in a pinkish liquid.", "The screenshot circulating on Facebook was taken at 3:29 of the video, when the pink liquid from one of the cows arrives in the transparent container. The video also shows that the other two bovines produce a white liquid.", "Liliana Peralta, director of the food engineering department at La Salle University in Bogota, Colombia, told AFP that “what is written in the image caption about whitening milk doesn’t happen, (this process) doesn’t exist!”", "“The Facebook photo does show milk and blood. But this doesn’t occur with all of the milk, only when cows do not have sufficient hygiene and develop mastitis or other illnesses,” Peralta explained during a phone interview.", "“If the cow has mastitis, it is normal that when the time comes to milk it, blood comes out and milk takes on a pink color. But this milk can’t be sold and regulations (of the dairy industry) mandate that it be discarded. The same thing occurs with pus: it is possible for an ill cow to give milk that contains pus, but those cows are separated from the herd and their production is thrown away,” the professor said.", "Peralta also stressed that “raw milk does contain bacteria, hence the importance of the pasteurization process, which is now applied in the entire world.” Lastly, she added that “milk does not contain carcinogenic elements.”", "Although the viral image did show a container full of blood-contaminated milk, the assertion that milk from cows normally contains blood and must be whitened prior to commercialization is false.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]