["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An anti-fascist protester holds a flag on the Christian Science Plaza on July 11, 2020, in Boston. (AP)", "The FBI has made no such public statement.", "Antifa is not a designated terrorist organization.", "Social media posts that claim teachers make up the bulk of antifa activists need to get schooled.", "In a July 20 text post, one Facebook user wrote: \"Teachers are the number one occupation of the Antifa terrorist organization according to the FBI.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) We reached out to the original poster for a comment, but they haven’t responded.", "(Screenshot from Facebook)", "Antifa stands for \"anti-fascist.\" It’s a broad, loosely affiliated coalition of left-wing activists that’s been around for decades and had a resurgence since the election of President Donald Trump. Republicans have blamed antifa activists for the violent protests that erupted after the death of George Floyd in late May.", "Versions of the Facebook post have been circulating since at least November 2019, according to the Associated Press. They’ve been shared widely in pro-Trump and conservative groups since June, according to CrowdTangle, a social media insights tool owned by Facebook.", "We previously reported that antifa is not a designated terrorist organization. But has the FBI said the movement is popular with teachers?", "No — there is no evidence to support the Facebook post.", "We could find no publicly available records from the FBI or other intelligence agencies that link antifa to teachers.", "FBI Director Christopher Wray mentioned the movement in his June 4 remarks about civil unrest around the country, but he did not say anything about teachers. And it’s unclear to what extent antifa was involved in violent protests against police brutality.", "We reached out to the FBI for a comment, but we haven’t heard back. The agency told the AP that its focus is \"not on membership in particular groups but on individuals who commit violence.\"", "There is evidence that, in general, teachers’ political views skew left. But we could find nothing to back up the claim that they are overrepresented in the antifa movement.", "We rate the Facebook post Pants on Fire!", "Associated Press, \"FBI did not say teacher is the most common occupation of antifa activists,\" July 9, 2020", "CrowdTangle, accessed July 22, 2020", "Education Week, \"Survey: Educators' Political Leanings, Who They Voted For, Where They Stand on Key Issues,\" Dec. 12, 2017", "Facebook post, July 20, 2020", "FBI, \"FBI Director Christopher Wray’s Remarks at Press Conference Regarding Civil Unrest in Wake of George Floyd’s Death,\" June 4, 2020", "PolitiFact, \"Ask PolitiFact: What is antifa, and why is it all over my timeline?\" July 2, 2020", "PolitiFact, \"Despite Trump talk, antifa has not been designated as a terrorist organization,\" July 21, 2020", "PolitiFact, \"Florida congressional candidate blames antifa for violence without evidence,\" June 26, 2020", "PolitiFact, \"The death of George Floyd: What you need to know,\" May 29, 2020", "Verdant Labs, \"Democratic vs. Republican occupations\"", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]