["About this rating", "For years Facebook users have been seeing posts advertising giveaways for the Kroger grocery store chain such as \"Get $55 in Free Groceries\" coupon offers.", "However, such posts are just versions of the common \"free coupon\" or \"free gift card\" scams that frequently plague social media. On more than one occasion the Kroger Company has taken to Facebook to warn customers that these coupon offers are not an authorized promotion and to advise them not to visit sites promoting them:", "These fake coupon and gift card offers are typically scams that promise rewards to anyone who follows a simple three-step process: Share the message on Facebook, leave a comment, and like the message. These three steps ensure the scam message circulates to thousands of people on Facebook.", "@SocialNewsDaily That offer is a scam -- we are not affiliated w/ that website. Our Digital Coupons can be found at https://t.co/rvO3m1IXTf.", "— Kroger Support (@KrogerSupport) October 15, 2014", "Previous versions of the scam, for example, featured a similar message that invaded Facebook promising a $250 gift card. The message redirected to a web page that was not affiliated with Kroger despite the fact that it was adorned with the company's logo:", "This page instructed shoppers to follow \"three simple steps\" in order to get a free gift card. Once the steps were completed, however, users were not greeted with a coupon code. Instead, they were asked to fill out a brief survey and provide personal information such as home address, telephone number, e-mail address, and date of birth. Users were also required to sign up for credit cards or enroll in subscription programs in order to obtain their \"free\" gift cards.", "Kroger has repeatedly warned their customers not to fall victims to this form of scam:", "These fraudulent surveys are quite popular on Facebook, and if you frequently use that social network there is a good chance that you'll run into one of these survey scams again. A July 2014 article from the Better Business Bureau lists key factors for identifying fraudulent Facebook posts:", "Don't believe what you see. It's easy to steal the colors, logos and header of an established organization. Scammers can also make links look like they lead to legitimate websites and emails appear to come from a different sender.", "Legitimate businesses do not ask for credit card numbers or banking information on customer surveys. If they do ask for personal information, like an address or email, be sure there's a link to their privacy policy.", "When in doubt, do a quick web search. If the survey is a scam, you may find alerts or complaints from other consumers. The organization's real website may have further information.", "Watch out for a reward that's too good to be true. If the survey is real, you may be entered in a drawing to win a gift card or receive a small discount off your next purchase. Few businesses can afford to give away $50 gift cards for completing a few questions.", "Patterson, Emily.   \"Customer Survey Scam Lures Victims with Gift Card.\"\r\n    Better Business Bureau.   4 July 2014.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]