["About this rating", "In the fall of 2008, the United Nations Security Council passed Resolution 1838, which called on nations with vessels in the waters near Somalia to apply military force to repress acts of piracy along that coastline. While pirates had been plying their trade in area since the early 1990s, the rate of such incidents had markedly increased by 2007 and 2008. Pirates either overrun ships and take their cargoes or they kidnap passengers to hold for ransom.", "Attention was focused on this issue by two incidents that occurred in April 2009: six armed pirates in a speedboat attacked the Italian cruise ship Melody  off the coast of Somalia (but were foiled when the Melody's captain ordered his security crew to fire back), and Somali pirates seized the Maersk Alabama, a relief ship laden with supplies destined for Somalia, Uganda, and Kenya. The Maersk Alabama's captain, Richard Phillips, was taken hostage; and when his life appeared in danger, U.S. Navy snipers killed three of the four pirates and effected his release.  These successful defensive acts against Somali pirates were widely applauded by those who favor countering aggression with aggression over slowly negotiating for the release of hostages taken captive by pirates and then forking over hefty ransoms for their safe return.", "This mood of hearty approval over those responses may have inspired a satirical piece about pirate-hunting cruises aboard luxury yachts plying the coast of Somalia, trolling for buccaneers to blast to smithereens:", "THE ULTIMATE ADVENTURE CRUISE", "To The Point Cruise Line is excited to offer the ultimate adventure cruise along the pirate-infested coast of Somalia!", "We board our luxury cruise ship in Djibouti on the Gulf of Aden near the entrance to the Red Sea, and disembark in Mombassa, Kenya, seven adrenaline-charged days later.", "Starting at $5,200 per-person (double occupancy, inside room) and $6,900 (veranda complete with bench rest), you'll relax like never before.", "That's because you are welcome to bring your own arsenal with you.  If you don't have your own weapons, you can rent them from our onboard Master Gunsmith. Enjoy reloading parties every afternoon with skeet and marksmanship competitions every night!", "But the best fun of all, of course, is Pirate Target Practice.", "For the object of the cruise is to sail up and down the Somali Coast waiting to get hijacked by pirates.  The weapons rental costs are as follows.", "Rent a full auto M-16 for only $25/day with ammo attractively priced at $16 per 100 rounds of 5.56 armor-piercing:", "On a budget? Rent a full-auto scope-mounted AK-47 for only $9/day with 7.62 ball ammo at $12 per 100 rounds:", "Hello! Nothing gets a pirate's attention like a Barrett M-107 50-cal sniper rifle; only $59/day with 25 rounds of armor-piercing ammo affordably priced at only $29.95.", "Need a spotter? Our professional crew members can double as spotters for only $30/hour (spotting scope included, but gratuities are not.)", "Want to make a real impact?  Rent an RPG for only $175/day with three fragmentation rounds included!", "Also included:  Free complimentary night vision equipment - and throughout the night, coffee, pastries and snacks are always available on the main deck from 7pm until 6am.", "Our deluxe package comes complete with gourmet meals and all rooms offer a mini-bar.", "But that's not all! Twin mounted miniguns are available for rental at only $450.00 per 30 seconds of sustained fire!", "We guarantee that you will experience at least two hijacking attempts by pirates or you'll receive an instant $1,000 refund upon arrival in Mombassa.", "How can we make that guarantee? We operate at 5 knots just beyond 12 nautical miles off the coast of Somalia, thus in international waters where pirates have no rights whatever. In fact, we make three passes through the area's most treacherous waters to ensure maximum visibility by Somali \"mother ships\".", "We repeat this for five days, making three complete passes past the entire Somali Coast.  At night, the boat is fully lit and bottle rockets are shot every five minutes with loud disco music directionally beamed shoreside to attract maximum attention.", "Testimonials from previous participants in the Somali Cruise:", "\"Six attacks in 4 days were more than I expected. I bagged three pirates, my wife nailed two, and my 12-year old son sank two boats with the mini-gun. This wonderful cruise was fun for the whole family\"\n— Fred D., Cincinnati , OH", "\"Pirates 0, Passengers 32! Well worth the trip! Can't recommend it highly enough!\"\n— Ben L., Bethesda , MD", "\"I haven't had this much fun since flying choppers in ' Nam. Don't worry about getting shot by pirates... they never even got close to the ship with the crap they shoot and their lousy aim... reminds me of a drunken juicer door-gunner we picked up from the motor pool in Phu Bai!\"\n— Dan J. - Denver , CO", "Come on board and bag your own clutch of genuine Somali pirates!  But cabin space is limited so you need to respond quickly.  Reserve your package before May 31st and get a great bonus - 100 rounds of free tracer ammo in the caliber of your choice.  So sign up for the Ultimate Somali Coast Adventure Cruise now!", "Luxury yachts offer pirate hunting cruises", "Luxury ocean liners in Russia are offering pirate hunting cruises aboard armed private yachts off the Somali coast.", "Wealthy hunters pay £3,500 per day to patrol the most dangerous waters in the world hoping to be attacked by raiders.", "When attacked, they retaliate with grenade launchers, machine guns and rocket launchers, reports Austrian business paper Wirtschaftsblatt.", "Passengers, who can pay an extra £5 a day for an AK-47 machine gun and £7 for 100 rounds of ammo, are also protected by a squad of ex special forces troops.", "The yachts travel from Djibouti in Somalia to Mombasa in Kenya.", "The ships deliberately cruise close to the coast at a speed of just five nautical miles in an attempt to attract the interest of pirates.", "\"They are worse than the pirates,\" said Russian yachtsman Vladimir Mironov. \"At least the pirates have the decency to take hostages, these people are just paying to commit murder,\" he continued.", "That satirical item was a 7 May 2009 article written for, and posted to, the humor section of the web site To the Point News. The joke was subsequently picked up and reworked by another web site, Somali Cruises.", "As an editor at the Cruise Critic web site observed of this improbable business scheme:", "Common sense would likely tell most of us that the idea is ridiculously absurd. The last time we checked, killing people is illegal, and arming blood-thirsty, inexperienced cruise passengers with high-powered weapons is probably not a good idea. (It's also doubtful that John Doe would have much success filing a travel insurance claim after accidentally blowing off his own foot with an M-16.)", "Nonetheless, after the Ananova online news site presented the Somali pirate cruise send-up as a factual item, several other news outlets and publications (including Canada's National Post newspaper) picked up the story and ran it as true, thereby fostering belief that the spoof \"pirates cruises\" were a real offering.", "Ananova.   \"Luxury Yachts Offer Pirate Hunting Cruises.\"\r\n    25 June 2009.", "CNN.   \"Italian Cruise Ship Thwarts Pirate Attack.\"\r\n    26 April 2009.", "National Post.   \"Armed Private Yachts Offering Pirate-Hunting Cruises Off Somalia.\"\r\n    25 June 2009.", "Sunday Mercury.   \"Crazy World.\"\r\n    28 June 2009   (p. 26).", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]