["The outbreak of novel coronavirus (COVID-19) has led to medical advisories circulating on social media. Alt News recently debunked a viral text falsely accredited to the UNICEF. This was also shared by businessman and Priyanka Gandhi’s husband Robert Vadra. Among the claims raised in the text was that coronavirus is large in size – “cell diameter 400-500 micro” – thus, any mask prevents its entry.", "UNICEF:", "The corona virus is large in size with a cell diameter of 400-500 micro, so any mask prevents its entry so there is no need to exploit pharmacists to trade with muzzles.", "The virus does not settle in the air, but on the ground, so it is not transmitted by the air. pic.twitter.com/QWhwOeRUC0", "— Lisha 3.0🇮🇳 (@Lisha_Cryptic) March 4, 2020", "However, a contradictory claim has also been raised by several people. The U.S. Surgeon General advised against the use of masks.", "Seriously people- STOP BUYING MASKS!", "They are NOT effective in preventing general public from catching #Coronavirus, but if healthcare providers can’t get them to care for sick patients, it puts them and our communities at risk! https://t.co/UxZRwxxKL9", "— U.S. Surgeon General (@Surgeon_General) February 29, 2020", "Viruses are acellular – without a cell body. Their major constituents are genetic material such as RNA. Therefore, the details about the cell size in the viral text stand invalid. Coronaviruses are ~125 nm in size (Fehr & Perlman, 2015), where one nanometre (nm) is 1/1000 of a micrometre (μm).", "[READ: WHO guidelines on when and how to use masks.]", "Despite that, they are one of the largest known RNA viruses (Sexton et al. 2016), still smaller than bacteria and human cells. The figure below (adapted from Lumen, microbiology) gives a visual representation of the virus size in comparison with atoms, proteins and lipid molecules and bacteria, plant and animal cells.", "Thus, coronavirus can penetrate through masks through tiny viral clusters as well as through the eyes. However, masks on an infected person can prevent water droplets with coronavirus from dispersing into the air. This air transmission is the main method through which the coronavirus or other viruses infecting the respiratory tracts are transmitted.", "However, The Time magazine reported from David Hui, a respiratory medicine expert at the Chinese University of Hong Kong who studied the 2002 to 2003 outbreak of severe acute respiratory syndrome (SARS) extensively, says it’s “common sense” that wearing a mask would protect against infectious diseases like COVID-19 if “you are standing in front of someone who is sick”.", "Also, patients with COVID-19 often have mild symptoms or a complete lack of symptoms but may be contagious to other people unknowingly. Thus masks can be an effective strategy in enclosed areas to prevent the spread of infections to other people.", "Hence, the virus size itself is small enough to penetrate the pores of a fabric mask. Since the virus may get transmitted via aerosols (clusters of the virus in the air droplets) if an infectious person coughs or sneezes, the clusters can be caught in a mask. Thus infected people wearing masks is an effective way to prevent the spread. However, since the infection can be asymptomatic in some individuals, it is better to use masks in enclosed or public places, specifically with older people as they get severely affected by the infection.", "Although, thee virus can also be transmitted through eyes as air droplets are the main mode of virus transmission. In case of any symptoms such as dry cough, fever, sore throat and breathing difficulties, it’s imperative that the individual self isolates and seek medical attention.", "Are there cases of #coronavirus #COVID-19 in your country/city? Know who should wear face masks pic.twitter.com/8Jd4DlUpns", "— WHO South-East Asia (@WHOSEARO) March 6, 2020", "Donate Now", "A video of a ladder moving on its own, purportedly from Jharkhand, is viral on…", "In a 2-minute video, a man recommends a “technique” to prevent infection from Omicron, the…", "A video of a set of iron nails that appear to melt after being placed…", "Several social media users have shared an image that shows two columns — ‘Cepa/variante’ (Spanish…", "A 90-second video of a man dissecting a banana has been shared on the internet…."]