["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "\"If you can get arrested for hunting or fishing without a license, but not for entering and remaining in the country illegally — you might live in a country that was founded by geniuses but is run by idiots.\"", "That’s one of many examples in a list posted to Facebook on Nov. 19 and falsely attributed to comedian Jeff Foxworthy. The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Foxworthy is famous for his \"You might be a redneck if…\" jokes, but searching online we couldn’t find any credible evidence that he penned this list that touches on abortion, Muslims and federal debt.", "Rather, we found users on web forums crediting someone named Fritz Edmunds with the list.", "Snopes, which fact-checked this claim back in 2013, also noted that \"the original compiler of this appears to be Fritz Edmunds, who posted it to his ‘Politically True’ blog back in Feb. 3, 2013 (albeit with a disclaimer noting that ‘some of the ideas were from an email that did not contain a copyright’).\"", "The link to that post is now dead but the url includes the words \"channeling Jeff Foxworthy.\"", "We rate it False.", "Facebook post, Nov. 19, 2019", "JeffFoxworthy.com, You might be a redneck if…, visited Jan. 7, 2019", "247sports.com, You might live in a nation founded by geniuses but run by idiots, May 11, 2016", "PoliticallyTrue.com, Channeling Jeff Foxworthy…, Feb. 3, 2013", "The Florida Times-Union, Fact check: Was comedian Jeff Foxworthy author of viral essay?, Sept. 25, 2015", "Snopes, ‘A country founded by geniuses, but run by idiots,’ quote, May 31, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]