["First-time parliamentarian, TMC’s Nusrat Jahan, recently celebrated Durga Puja with her husband Nikhil Jain in Kolkata. Soon after, news reports by mainstream media flashed headlines stating that a Darul Uloom Deoband cleric ‘Mufti Asad Qasmi’ attacked Jahan for participating in the celebrations of a Hindu festival.", "The headline of an article in Firstpost read, “‘Nusrat Jahan defaming Islam’: Muslim cleric from Darul Uloom Deoband slams TMC MP for attending Durga Puja celebrations”. This was a syndicated PTI feed, same as the news reports published by many other news organisations – Moneycontrol, The Wire, Times of India, Free Press Journal, The Hindu, Outlook and News18.", "Darul Uloom Deoband is one of the oldest Islamic universities in India. “The institution never makes personal statements on any individuals. If it does give opinions on an issue, it is always through a press note,” spokesperson of Darul Uloom Deoband, Ashraf Usmani, told Alt News.", "Mufti Asad Qasmi, whom the media posed as a cleric from Darul Uloom Deoband, is not associated with the institution. Incidentally, this wasn’t the first time he has been featured on TV to comment on Nusrat Jahan’s life choices. He was also invited to news studios in July this year when the media created a controversy about Jahan adorning vermillion in the Parliament after her marriage to a Jain. Qasmi’s personal statements were first reported as the views of Islamic clerics, then as opinions of Darul Uloom Deoband and lastly, as a fatwa issued against Jahan.", "Alt News had spoken to Asad Qasmi at length in July when he had clarified that he is not associated with Darul Uloom Deoband in any manner but used to be a former student in the institution. Qasmi is currently a Mufti in Deoband. You can read Alt News’s detailed report on the misinformation here.", "In other words, an obscure Mufti was chosen to give a statement on Nusrat Jahan’s Durga Puja celebrations which created a controversy out of thin air.", "“Islam doesn’t need people who assume Muslim names and defame Islam and Muslims,” Mufti Asad Qasmi, a cleric associated with Darul Uloom Deoband, told TV news channels,” reported PTI. As mentioned earlier, this was republished by multiple media outlets.", "However, there were also a few media organisations that published independent reports on the misinformation. “Mufti Asad Qasmi, a cleric associated with Darul Uloom Deoband, accused Nusrat of defaming Muslims and Islam,” wrote Financial Express. Similar reports were carried out by India TV and Swarajya.", "According to an India Today report, Mufti Asad Qasmi, a cleric associated with Darul Uloom Deoband, told media, “She [Nusrat Jahan] had also married outside religion. She should change her name and religion. Islam doesn’t need people who assume Muslim names and defame Islam and Muslims.”", "India Today also covered the ‘issue’ on multiple television broadcasts. While Darul Uloom was not mentioned during the shows, journalist Shiv Aroor, anchoring the channel’s daily program ‘5ive’, said, “Clerics have called her Unislamic.” He further added, “Remember this is not the first time that Nusrat Jahan has been attacked by certain clerics. Soon after taking oath in the Lok Sabha, a fatwa was issued against Nusrat for wearing sindoor and chanting Vande Matram.” Aroor’s statements were incorrect on all counts – the opinions of one Mufti were represented as views of Islamic clerics on the whole. He also referred to a piece of misinformation, the fatwa story, which was debunked months ago.", "After Aroor’s introduction, Mufti Asad Qasmi was brought on the show where he made the outrageous statements attributed to him. This was followed by Shia Waqf Board Head and VHP Vice-President condemning Qasmi’s words. The channel also got a hold of Jahan. A reporter asked the MP, “Are you ready for another controversy?” The show was concluded with nearly a half an hour debate on the subject while the channel flashed ‘Nusrat vs Clerics’ on television screens.", "Times Now also broadcast shows on the topic. While its report said that the cleric was associated with Darul Uloom, the same wasn’t mentioned during the TV broadcast. Anchor Rahul Shivshankar opened the show with the statement, “There has been a major controversy.” Subsequently, he too talked about an earlier ‘fatwa’ issued in Jahan’s name for “adorning symbols of a Hindu bride”.", "Hindi media outlets also did not leave behind the ‘controversy’. Navbharat Times, Jansatta, News18 Hindi, Punjab Kesari, NDTV Hindi, Zee News, Prabhat Khabar, Lokmat News, Oneindia Hindi, Webdunia Hindi, Asianet News Hindi, IBC 24 and Newstrack – all published reports with the ‘Darul Uloom Deoband’ angle.", "However, several other news channels claimed that the Mufti is associated with ‘Itehaad Ulema-hind’. This included ANI, Republic TV, NDTV English and News18 Hindi. Incidentally, News18 also brought in a fatwa angle.", "Right-wing website Opindia also published a misreport with a fatwa angle and wrote, “The cleric Mufti Azad Wasmi of the prominent Darul Uloom Deoband slammed the TMC MP for embracing Hindu traditions and grimly suggested her to change her religion instead of bringing disrepute to Islam.”", "In conclusion, the media reached out to an unknown Mufti from Deoband, who was likely to give controversial statements on Nusrat Jahan’s participation in a Hindu festival, and created news out of nothing. While some media platforms falsely linked the cleric to Darul Uloom Deoband, others associated him with an obscure organisation ‘Itehaad Ulema-hind’. While it is possible that he has links to the latter, what is most confounding is that there were also those outlets which couldn’t decide, therefore, carried two different reports – one mentioning Itehaad Ulema-hind and the other, Darul Uloom Deoband. For instance, NDTV claimed in its English report that Qasmi belonged to Itehaad Ulema-hind but the channel’s Hindi report associated him with Darul Uloom Deoband. News18 also published two different Hindi articles – 1, 2 – along similar lines. The Times of India also carried two different reports – 1, 2. This mismatch in reports can be linked to PTI and ANI reporting the story differently. PTI had claimed that Qasmi was associated with Darul Uloom while ANI linked him to Itehaad Ulema-hind.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]