["By Saranac Hale Spencer", "Posted on August 31, 2018", "Q: Were “412 Michigan Muslims arrested in fed’s ‘largest bust in U.S. history'”?", "A: No. Only about 30 of those arrests were made in Michigan, and there is no evidence all of the individuals arrested were Muslim.", "Misinformation doesn’t really have a shelf life.", "A lot of false and misleading stories don’t include specific dates, so they can keep circulating — sometimes for years — as they are copied and reposted by unreliable websites.", "One such story that was recently posted on topalertnews.com actually dates back to last summer, when it was first published on the now defunct, but once prolific site freedomdaily.com.", "The headline is the same on both stories: “412 Michigan Muslims Arrested In Fed’s ‘LARGEST BUST IN U.S. HISTORY’ After Uncovering Deadly Hidden Secret.”", "But it’s not true.", "What is true is that in July 2017, federal officials arrested 412 people across the country in what the Department of Justice said at the time was the “largest health care fraud enforcement action in Department of Justice history.”", "Every year since at least 2013, federal officials have conducted a “national health care fraud takedown,” which results in more arrests each year. The outcome of the 2018 bust was announced on June 28 — it netted 601 arrests.", "But the misleading story circulating online is about the 2017 bust. Those defendants — including 115 doctors, nurses and medical professionals — were arrested for their alleged involvement in a scheme that bilked Medicare, Medicaid and TRICARE (a health insurance program for veterans) out of $1.3 billion.", "Charges were filed in 23 states and Puerto Rico.", "A total of about 30 people were charged in Michigan; the state with the highest number of arrests was Florida.", "The charging documents don’t mention the religion of the defendants, but the misleading story dedicates its first two paragraphs to expressing an opinion about the effect of Muslim immigrants on the state of Michigan.", "It says: “Now thanks to the hordes of Muslims taking over the state, Michigan can add another ‘accomplishment’ on their list, as the Justice Department is dubbing what just went down in this state the ‘largest scam in United States history.'”", "Michigan has a reputation for having a large Muslim population, but Muslims make up about 1 percent of the state’s adult population, according to a 2015 study from the Pew Research Center.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "“412 Michigan Muslims Arrested In Fed’s ‘LARGEST BUST IN U.S. HISTORY’ After Uncovering Deadly Hidden Secret.” TopAlertNews.com. 24 Aug 2018.", "Department of Justice. Documents and Resources from the July 13, 2017 national health care fraud takedown press conference. 13 Jul 2017.", "Department of Justice. “2017 National Health Care Fraud Takedown.” 13 Jul 2017.", "Department of Justice. “National Health Care Fraud Takedown Results in Charges Against 601 Individuals Responsible for Over $2 Billion in Fraud Losses.” 28 Jun 2018.", "Cwiek, Sarah. “What explains Michigan’s large Arab American community?” Michigan Radio. 9 Jul 2014.", "Pew Research Center. Religious Landscape Study. May 2015.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]