["A video clip of journalist Abhisar Sharma has been shared widely on social media. In the video clip, Sharma can be seen handing over a piece of paper to a person while speaking to them about issues regarding the upcoming election. The clip has been shared by several prominent social media accounts, with the claim that Sharma is bribing villagers to speak against Prime Minister Narendra Modi. In the video itself, in the top right corner, the words ‘Abhisar Sharma – Distributing $ to villagers to speak in his favour?’ have been superimposed.", "रामनाथ गोयनका पत्रकारिता अवार्ड विजेता ये पत्रकार Video के अंत में बुज़ुर्ग को क्या दे रहे हैं ? ध्यान से देखो ये कहते है-ये Article की Clip दे रहे हैं बुज़ुर्ग को😂😂 जनता क्या इतनी बेवक़ूफ़ है? भाई Clip या Slip कुछ भी देते रहो,लेकिन जीतेगा चौकीदार ही💪@BJP4India @narendramodi pic.twitter.com/cQTZHflfnA", "— Major Surendra Poonia (@MajorPoonia) March 27, 2019", "Army veteran Major Surendra Poonia is among those who have posted this video clip. Poonia’s message along with the clip reads, “This Ramnath Goenka award winning journalist, what is he handing over to the elderly person at the end of the video? Look closely. He says he is giving an article clip to the person. Are people fools? Whether you give clip or slip, only Chaukidar will win” (translated). The video clip posted by Major Poonia is 1:30 minutes long, whereas a short video clip of seven seconds too has been shared on Twitter by the handles @padhalikha and @being_humor.", "Wtf camera to off karwa deta dalle Abhishar Sharma 😂😂😂😂 pic.twitter.com/6OEe2xzHBX", "— Chowkidar Maithun 😎 (@Being_Humor) March 27, 2019", "The above tweet was retweeted over 4700 times. The claim was also quote-tweeted by Vikas Pandey.", "Abhisar must have taken 1000 from Congress and is giving only 100 Rs to the villager. Ek jhatke me 900 ka ghotala! https://t.co/2Z8ZiHPzcK", "— Vikas Pandey Chowkidar (@MODIfiedVikas) March 27, 2019", "From the account of @pokershash alone, the video has been viewed in excess of 56,000 times so far. The tweet has now been deleted. The video has also been tweeted with the same claim by the handle @smokingskills_ and also by Shefali Vaidya.", "It has also been uploaded on Facebook, posted by a page Tolerant Indians, which has a following of over 225,000 and also by the page The Genuine Truth, which is followed by over 370,000 Facebook users.", "Abhisar Sharma has clarified via a tweet that he had handed over not money but a newspaper clipping to the elderly person seen in the video. In his defence, Sharma has tweeted the same video which shows the elderly person handing over a newspaper clip to him. Later, he is seen handing back the same piece of paper.", "Friends this is the full video where its clear that a villager handed over a newspaper clipping and I handed it back to me , but trolls backed by @MODIfiedVikas have been trying to run a fake propaganda( no surprises) फर्ज़ी चौकिदारों झूठ से बचो pic.twitter.com/kTQ82xD9HM", "— Abhisar Sharma (@abhisar_sharma) March 27, 2019", "Looking at the video in its entirety makes it evident that the piece of paper handed over by Abhisar Sharma to the person is a newspaper clipping and not a currency note.", "Sharma has even threatened legal action against the handle @pokershash which had posted the video with the false claim and later deleted it. @pokershash has however issued an apology regarding the same.", "Dont delete this tweet Ch SHASHANK…I am right away filing a police complaint against you for posting defamatory stuff.i was handing back the news article the old man gave me. I can prove it. Can you prove it in court. Have a good day 😊. Just wait https://t.co/LXZxMS4Le4", "— Abhisar Sharma (@abhisar_sharma) March 27, 2019", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]