["About this rating", "Evangelical preacher Billy Graham died on 21 February 2018. His death led to much commentary about his legacy, including a meme that appeared on social media bearing the claim that Graham once said \"All homosexuals should be castrated\":", "Graham was famously anti-gay, describing homosexuality as sinful and perverse, as reports about his legacy described:", "Let’s consider for a moment his attitude towards gay people, illustrated rather well by an exchange of letters in 1974. A woman wrote to Graham, asking him about the love she felt for another woman. He began by quoting Paul’s letter to the Corinthians: “Make no mistake: no fornicator or idolator, none who are guilty either of adultery or of homosexual perversion … will possess the kingdom of God” (1 Corinthians 6:9).", "He added that homosexuality was an “ungodly spirit of self-gratification” and famously went on to say “we traffic in homosexuality at the peril of our spiritual welfare. Your affection for another of your own sex is misdirected and will be judged by God’s holy standards.”", "BillyGraham.org, features two questions about the preacher's position on same-sex relationships. One addresses whether gay people are born that way, and another entry discusses marriage:", "The Bible provides God’s blueprint for marriage and for His good gift of sex in Genesis 2:24. The gift is only to be enjoyed within a marriage between a man and a woman.", "There are no exceptions suggested, such as homosexual partnerships. From Genesis on, the Bible praises the marriage of a man and a woman, but it speaks only negatively of homosexual behavior whenever it is mentioned.", "The strongest possible sentiment attributed to Graham was a condemnation holding same-sex attraction was an \"ungodly spirit of self-gratification.\"", "A 1973 controversy did involve Graham and the specter of castration, mentioned in the 2005 book The Leadership Secrets of Billy Graham. In it, he is quoted as having said: \"I think when a person is found guilty of rape, he should be castrated. That would stop him pretty quick\":", "Records exist that show Graham both made and apologized for the early 1970s remark about castrating convicted rapists, but no such evidence appeared of any similar commentary about same-sex relationships in an extensive review of Graham's relationship with the gay community published immediately after his death.", "Brammer, John Paul.   \"Billy Graham Leaves Painful Legacy For LGBTQ People.\"\r\n    NBC News.   22 February 2018.", "Krattenmaker, Tom.   \"Today's Evangelicals Should Be More Like Billy Graham. We All Should Be.\"\r\n    USA Today.   22 February 2018.", "Myra, Harold and Marshall Shelley.   The Leadership Secrets Of Billy Graham.\r\n    Zondervan, 2005.   9780310565888.", "Robertson, Douglas.   \"The Outpouring Of Grief For Evangelist Billy Graham Is Disturbing Given His Homophobic Views.\"\r\n    The Independent.   22 February 2018.", "JET Magazine.   \"Black Clerics Won't Accept Billy Graham's Retraction.\"\r\n    26 April 1973.", "Billy Graham Evangelical Association.   \"Does The Bible Approve Of Some Homosexual Relationships?\"\r\n    1 June 2004.", "Billy Graham Evangelical Association.   \"Are Homosexuals Born That Way?\"\r\n    1 June 2004.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]