["About this rating", "The idea that United States citizens can gain access to secret funds because of a government-created \"strawman\" is a persistent myth —  and one was debunked long ago as a get-rich-quick scheme promulgated by shysters with links to far-right groups:", "When your birth certificate was monetized and converted into a UNITED STATES Government Bond shortly after your birth by your Mother, your net worth became unlimited, into Billions of Dollars, without your, nor your Mother’s, and Father’s, knowledge.", "When the UNITED STATES declared bankruptcy in 1933 under the bankruptcy (Straw man) law known as HJR 192, pledged all Americans as collateral (debt slaves) against the national debt to the International Bankers; gave all the land to the international bankers (Federal Reserve Corporation); and confiscated and outlawed all the gold except for one ounce for each person; thus, eliminating the lawful means (Gold and Silver Coins) by which you could legally pay your debt, the UNITED STATES also assumed legal responsibility for providing a new way for you to pay.", "In 1933, the UNITED STATES Government declared that they would pay all of YOUR debts with the money they receive from your labor, birth certificate, and Social Security registered number by what is known as your Reserve Account worth Billions!", "The UNITED STATES Corporation Government did that by providing what is known as the Exemption Account.", "The bankers loan credit and not money, because there has not been any lawful money since 5 June 1933.", "The Exemption Account is your exemption from having to pay for anything.", "In practical terms, though, this meant giving each American something to pay with, and that something is your credit.", "This secret has been hidden for over 79 years.", "Your value to society was then and is still calculated using actuarial tables.", "At birth, average value bonds were created from your birth certificate.", "I understand that this is currently between one and two million dollars at your birth when your mother unknowingly gave her baby, you, away to the UNITED STATES Government.", "These birth certificate bonds were collateralized by your birth certificate and your mother’s maiden name under an Act of Congress in 1921.", "Then your birth certificate bond became a negotiable instrument just like any security instrument under UCC Article 3, code of commercial law in which the world trade falls under.", "The bonds are hypothecated and traded on the stock market until their value is unlimited for all intents and purposes.", "People all over the world buy and sell your bond every day over the stock markets as investments.", "All that credit created is technically, and rightfully, yours.", "In point of fact, you should be able to go into any store in America and buy anything and everything in sight, telling the clerk to charge it to your Exemption Account, which is identified by a nine-digit number that you will recognize as your Social Security number, without the dashes.", "It is your EIN, which stands for Exemption Identification Number from the UNITED STATES CORPORATION of America.\"", "The \"strawman,\" the theory states, is an entity created by an alleged 1933 \"House Joint Resolution\" marking U.S. residents as collateral for the country's loans. Though it is unclear how prevalent it is today, the FBI has classified the idea of birth certificate \"redemption\" as a common form of bond fraud:", "Proponents of this scheme claim that the U.S. government or the Treasury Department control bank accounts—often referred to as “U.S. Treasury Direct Accounts”—for all U.S. citizens that can be accessed by submitting paperwork with state and federal authorities. Trainers and websites will often charge large fees for “kits” that teach individuals how to perpetrate this scheme. They will often imply that others have had great success in discharging debt and purchasing merchandise such as cars and homes. Failures to implement the scheme successfully are attributed to individuals not following instructions in a specific order or not filing paperwork at correct times.", "This scheme predominately uses fraudulent financial documents that appear to be legitimate. These documents are frequently referred to as “bills of exchange,” “promissory bonds,” “indemnity bonds,” “offset bonds,” “sight drafts,” or “comptrollers warrants.” In addition, other official documents are used outside of their intended purpose, like IRS forms 1099, 1099-OID, and 8300. This scheme frequently intermingles legal and pseudo legal terminology in order to appear lawful. Notaries may be used in an attempt to make the fraud appear legitimate. Often, victims of the scheme are instructed to address their paperwork to the Secretary of the Treasury.", "Filing these types of \"frivolous tax submissions\" can incur a $5,000 fine, though authorities give offenders 30 days to retract the documents. The Treasury Department's office of the Inspector General published an example of a \"sight draft\" while warning that they were being used \"in an attempt to pay for everything from cars to child support\":", "The Treasury also provided us with an April 2009 guidance they sent to financial institutions advising them how to report loan modification scams, which included a description of a hidden \"account\" being used as a bogus payment:", "A homeowner maintains that he/she does not need to pay a mortgage because the loan contract is invalid, or the customer attempts to pay with a bogus sight draft, Federal Reserve Bank/Treasury letter, or check that accesses a “Treasury Direct Account.” Such homeowners may be committing fraud or may have been duped by individuals who claim government-related contracts are illegitimate. Other homeowners may have unsuspectingly paid for illegitimate or bogus pay-off documents.", "A spokesperson for the Treasury told us on 17 January 2017 that these types of scams have not been a \"recent issue of concern\" for the department's investigators. However, they are still reported to its financial crimes enforcement division.", "The Southern Poverty Law Center stated in a 2002 report that the redemption \"movement\" can be traced back to a South Dakota man, Roger Elvick, who has ties to the Aryan Nations and other white supremacist organizations:", "Elvick first started spreading his crackpot vision in the 1980s, when he was the national spokesperson for Committee of the States, a white supremacist group Elvick started with William Potter Gale, who had previously founded the Posse Comitatus, a violent anti-Semitic organization.", "By 1990, Redemption groups advised by Elvick were active in 30 states and several provinces of Canada, and had tried to pass more than $15 million in bad checks. Elvick was eventually convicted of personally passing more than $1 million in sight drafts, and, in a separate case, of filing fraudulent IRS forms. He spent most of the 1990s in federal prison.", "Elvick was indicted again in Ohio in 2003 and charged with corruption, extortion, and forgery, but his courtroom behavior derailed his trial:", "During preliminary hearings, Elvick frustrated court officials by denying his identity, claiming the court had no jurisdiction over him or his straw man, and constantly interrupting with unfathomable questions about procedure. A judge ruled Elvick mentally unfit to stand trial and committed him to a correctional psychiatric facility, where he was diagnosed with an \"unclassified mental disorder\" and underwent nine months of treatment before facing trial. Elvick then surprised prosecutors by changing his plea to guilty.", "The inspector general's office for the Department of Housing and Urban Development, noted the use of \"UCC\" (Uniform Commercial Code) in a 2015 bulletin concerning right-wing sovereign citizen groups, pointing out members commonly use the term in fraudulent documents:", "FBI.   \"Common Fraud Schemes — Redemption/Strawman/Bond Fraud.\" \r\n     Accessed 12 January 2017.", "Legal Information Institute.   \"26 U.S. Code § 6702 — Frivolous Tax Submissions.\" \r\n    Accessed 12 January 2017.", "Office of the Inspector General, U.S. Department of the Treasury.   \"Bogus Sight Drafts/Bills of Exchange Drawn on the Treasury.\" \r\n    Accessed 12 January 2017.", "Southern Poverty Law Center.   \"His 'Straw Man' Free, A Scammer Finds the Rest of Him Isn't.\" \r\n      27 July 2005.", "Office of Inspector General, U.S. Department of Housing and Urban Development.   \"Integrity Bulletin.\" \r\n    Summer 2015.", "Alexander, Dean C.   \"The Sovereign Citizen Movement: Threats and Responses.\" \r\n    Security Magazine.   1 June 2016.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]