["The three-minute, 30-second video was posted on Facebook here on July 29, 2019. It has since been viewed 12,000 times.", "The post’s caption reads: “Dont use Amul ice creams,it contains pig fat(e471)…”", "Speaking in Hindi, the man in the video says: “Today, I am going to tell you an important thing about Amul and it’s ice cream. Pig is haram in Islam but this fat is being sold in every Indian locality as it is sold through Amul ice cream and in every product manufactured by Amul. This ice cream contains an ingredient E-471 which is made from pig fat. I request everyone to boycott this ice cream, we are consuming pig and not ice cream. Both Hindus and Muslims should collectively boycott these products. All the Amul products should be banned. Boycott Amul ice cream and Amul products.”", "Amul is an Indian dairy company based in the western state of Gujarat.", "E471 is a food additive that is used as an emulsifier, stabiliser, thickener and gelling agent.", "The clip, which has circulated since at least 2018, was also published on Facebook here and here, and on TikTok here, where it has been viewed around 118,000 times.", "Another clip, which shows a different man making a similar claim, was shared on Facebook here, here, and here.", "However, the claim is false.", "In a document posted on its website, Amul states: “Since the inception, Amul is dealing in only and only vegetarian products as indicated by the vegetarian logo on all the Amul products.", "“All the ingredients used by Amul viz. colours, stabilizers, emulsifiers, additives, enzymes in cheese, are of 100% vegetarian origin.", "“E-471 can be manufactured both from plant oils (soybean oil or palm oil) as well as from fat derived from animal sources.", "“Amul uses the emulsifier E-471 in ice cream for stabilization and emulsification of fat with other milk components strictly from plant oils only, which is indicated by the vegetarian logo on any ice-cream pack. Amul ice-cream is Halal certified”.", "R.S. Sodhi, managing director of Amul, gave the same clarification in this video posted on the official YouTube channel of Amul India on September 6, 2018. The video is titled: “#Amul Ice Crean is 100% Vegetarian.”", "According to this document issued by the Jamiat Ulama Halal Foundation, a Muslim organisation in India that issues halal certificates in accordance to Islamic dietary laws, Amul products are certified as halal, including its ice cream products.", "Below are screenshots of the halal certificate given to Amul (L) and the list of Amul ice cream products certified as halal (R):", "Gulzar Ahmed Azmi, general secretary of the Jamiat Ulama Halal Foundation, confirmed to AFP by phone on March 9, 2021, that his organisation has certified Amul products as halal.", "The company Lucid Colloids India, which supplies the E-471 ingredient to Amul, has also received a halal certification from the Jamiat Ulama Halal Foundation.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]