["About this rating", "In December 2018, a rumor that Sweden had begnu referring to \"Christmas\" as \"Winter Celebration\" in an effort to appease their \"extremist\" Muslim population started to circulate on social media:", "This errant rumor was not based on any official decree from the Swedish government, but rather on a single innocuous headline published by the Swedish newspaper Sydsvenskan on 2 December 2018.", "The Swedish news outlet used the headline \"Malmö flyttar vinterfirandet till Stortorget av säkerhetsskäl\" for their report on a location change of an annual celebration held in the city of Malmö. Anti-Islam web sites such as Jihad Watch and Voice of Europe noticed that the newspaper used the term \"vinterfirandet\" (winter celebration) instead of \"Julen\" (Christmas) in their headlines and started pushing the notion that Sydsvenskan used secular terms in order to avoid offending Muslims.", "These critics apparently failed to notice that variations of the word \"Julen\" were used repeatedly in the article in question. In fact, the subhead alone included two mentions of Christmas -- \"Julen\" translates to Christmas and \"juldagarna\" refers to Christmas Day:", "The complete headline and subhead can be loosely translated as follows:", "Malmö moves the winter celebration to Stortorget for safety reasons", "Last Christmas, Malmö put up terrorism barriers around the Gustav Adolf Square. This year, the city will be moving its winter celebrations to the safer Stortorget [public square]. Here, Steve Angello's charity project for Malmö will be reported and the Winter Games will begin after Christmas.", "Furthermore, we examined several other articles published by Sydsvenskan to see if they habitually replaced references to \"Christmas\" with \"Winter Celebration,\" and we found that they have an entire Christmas (Julen) section with articles about Christmas songs (jullåt), Christmas trees (julgransodlingar), Christmas gifts (julklappar), and even a Christmas calendar (julkalender).", "This rumor can also be debunked by visiting the official website of the Swedish government. The site contains a few pages that explain various customs and traditions to foreign visitors, including one page chock full of Christmas references:", "Christmas in Sweden is a blend of domestic and foreign customs that have been re-interpreted, refined and commercialized on their way from agrarian society to the modern age.", "Today, most Swedes celebrate Christmas in roughly the same way, and many of the local customs and specialities have disappeared, although each family claims to celebrate it in true fashion in their own particular way.", "The food you eat at Christmas may still depend on where you live in the country, or where you came from originally. But here, too, homogenization has set in, due in no small part to the uniform offerings of the department stores and the ready availability of convenience foods. Few have time to salt their own hams or stuff their own pork sausages nowadays.", "Ingmar Bergman’s Oscar-winning film Fanny and Alexander, although set in the late 1800s, nevertheless reflects Swedish Christmas celebrations today: a bright and lively occasion, full of excess, good food and happiness, but also a time during which family secrets tend to surface.", "Sats, Lotta.   \"Malmö Flyttar Vinterfirandet Till Stortorget av Säkerhetsskäl.\"\r\n    Sydsvenskan.   2 December 2018.", "Cat, Laura.   \"Christmas Called 'Winter Celebration' in Swedish Media and the Swedes Are Sick of It.\"\r\n    Voice of Europe.   6 December 2018.", "Spencer, Robert.   \"Sweden: Christmas Called 'Winter Celebration' to Avid Offending Muslims, Security High to Head Off Jihad Massacres.\"\r\n    Jihad Watch.   9 December 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]