["Several Twitter and Facebook users have shared a wedding photo of a woman and a man. As per viral claims, Bharatiya Janata Party (BJP) leader Kapil Mishra’s sister married Shahzad Ali.", "This slideshow requires JavaScript.", "The same picture was also shared last year by Facebook user Sanam Shaikh who wrote in Hindi, “The one who started the Hindu-Muslim riots in Delhi, Kapil Mishra, his sister is wedded to Shahzad Ali.” This post was shared over 2,500 times. (archived link)", "[Hindi message: दिल्ली में हिन्दू #मुसलमान के बीच दंगे कराने वाले #कपिल मिश्रा की बहन ने की #शहज़ाद अली से शादी कपिल_मिश्रा_और भक्तो_को_नया_जीजा_मुबारक_हो]", "On February 23, 2020 the national capital witnessed communal riots hours after BJP leader Kapil Mishra issued an ultimatum to the police—either clear out of the streets where protests against the controversial Citizenship Law were held or Mishra and his followers would step in themselves.", "Twitter user @Dkashfaque had also tweeted the viral image last year along with identical Hindi text. It was retweeted over 400 times. (archived link)", "Alt News received several requests to fact-check this on our WhatsApp helpline number (+917600011160) and on our official Android application.", "The viral image has a watermark that reads ‘coastaldigest.com’. Alt News performed a reverse image search on Google and found that the image was published by Coastal Digest, a Mangalore-based news website, in 2016. As per the article, the image shows the wedding rituals of Hindu-Muslim couple Ashita and Shakeel at Taj Convention Hall in Bannimanta locality of Mysore. The report added that the marriage was held peacefully amidst tight security due to threats from “Hindutva extremists”.", "Their wedding was also reported by The Indian Express which said that local Bajrang Dal and BJP members opposed the marriage as Ashita had decided to convert to Islam.", "Alt News reached out to Kapil Mishra who shared his statement given to fact-checking organisation Boomlive. “I have three sisters of which two are married. Neither my sisters nor the distant ones are married to a Muslim,” he clarified.", "Thus a five-year-old wedding photo of a Hindu-Muslim couple in Mysore has gone viral with the false claim that BJP Delhi leader Kapil Mishra’s sister married a Muslim man.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]