["A message about Employees’ Provident Fund Organisation (EPFO) offering benefits worth Rs 80,000 is being shared on social media. It claims that workers who have worked between 1990 to 2019 will be able to avail the benefit, provided their name is listed on the website (https://socialdraw.top/epf). “The workers who worked between the 1990 and 2019, have the rights to get the benefits of ₹80 000 by EPFO of INDIA. Check if your name is in the list of the people who have the rights to withdraw this benefit: https://socialdraw.top/epf”, reads the complete message.", "Several people have raised concerns over the authenticity of the message.", "@epfoaindia @EPFONarimanPt @HRDMinistry This kind of msg is viral on WhatsApp please check and confirm the same. The workers who worked between the 1990 and 2019, have the rights to get the *benefits of ₹80 000 by EPFO of INDIA*. Check if your name is in the list of the people", "— Bharat Magadum (@bharatm22) October 26, 2019", "EPFO’s official Twitter handle has called out the fake website.", "Beware of FAKE OFFERS by Websites/Telecalls/SMS/email/Social Media, ASKING TO DEPOSIT MONEY into any Bank Account towards Claim Settlement/Advance/Higher Pension/ or any other service provided by #EPFO.#Fraud #FakeCalls #Lottery pic.twitter.com/ekuvhcyJsq", "— EPFO (@socialepfo) October 29, 2019", "There are several red flags through which social media users can identify that the website is fake.", "We found that the website is impersonating the official EPFO website. Government websites generally end with the domain name, .gov.in, whereas this website ends with .top domain. EPFO’s official website is www.epfindia.gov.in.", "The top portion of the website –socialdraw.top/epf– is designed to resemble the official EPFO website by posting a screenshot of the same. None of the categories like UMANG, e-passbook, ECR/Returns/Payments is clickable.", "The website asks users to answer a set of questions, like ‘are you 18 years old’, ‘did you work in the period between 1990 to 2019’, ‘are you currently working somewhere’, and so on. Subsequently, the user is asked to send the message to other people on WhatsApp, until a supposed threshold limit is reached. This is the typical method applied by shoddy websites to dupe people online and extract their personal information.", "Moreover, according to WHOIS, this website was created in mid-October this year.", "Alt News had debunked a similar fake website impersonating as Honda’s website, which claimed that the company is giving away 300 Activa 5g scooters for free on Diwali.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]