["About this rating", "The \"Dab,\" a dance move reportedly created by the group Migos, became a viral phenomena in 2015 after NFL superstars such as Cam Newton started using the move during their end zone celebrations. But according to internet lore, the \"world's first dab\" was performed by a soldier aboard a warship back in  1932:", "Although this image has been circulating online for several years, it certainly can't be traced back to the 1930s. This photograph was actually captured in the summer of 2016 and shows a group of extras from the feature film Dunkirk.", "A black-and-white filter was applied to the original image (possibly among several other edits) to make it look as if it were a photograph taken in the 1930s. Here's a side-by-side comparison of the original photograph from the set of the movie& Dunkirk (right) and the edited version (left):", "We haven't been able to determine who originally took this photograph. However, we did find a video of the Dunkirk dab that was posted by Richard Oost on 11 July 2016. According to Oost (who has several other behind-the-scenes images from Dunkirk on his Facebook page), this picture captured a group of extras entering the Port of Urk in the Netherlands.", "The viral dab can be glimpsed at the 1:05 mark of the following video:", "It's unclear where the \"1932\" claim came from, as the movie Dunkirk is based on a real incident from World War II which took place in 1940:", "Lamarre, Carl.   \"Migos Break Down the Dab's Origin on ESPN's Sportscenter.\"\r\n    Billboard.   30 March 2017.", "Ducey, Kenny.   \"A History of Cam Newton and The 'Dab.'\"\r\n    Sports Illustrated.   7 February 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]