["The photo of the helicopter was posted on February 17, 2021, by a Facebook account called “Eririogu Nwa Biafra”. The post has been shared almost 700 times.", "“Breaking New! Nigeria Army is currently attacking ESN with war helicopter in Orlu Imo state. They had declared war in our land (sic),” reads the caption.", "The Facebook account is known for promoting the activities of Nigeria’s separatist movement, the Indigenous People of Biafra (IPOB), whose leader, Nnamdi Kanu, formed the Eastern Security Network (ESN) last December to “protect” the country’s southeast region.", "The image was also shared alongside a similar claim in this Facebook post, as well as in this publication by a pro-Biafran website, Daily Time TV.", "Clashes erupted between the Nigerian army and the ESN in the city of Orlu last month and at least one person was killed in the unrest, AFP reported.", "Orlu is located in Nigeria’s southeast. The area has long been home to separatist groups, and tensions between federal security forces and the indigenous Igbo population are high.", "Matters escalated again last week with the deployment of armed forces and helicopters to search the area for an ESN base.", "However, the image is being passed off as part of the military operation in Orlu when, in fact, it was taken near the capital Abuja three years ago.", "AFP Fact Check ran a Google reverse image search and found the picture belongs to AFP and was published for illustrative purposes in a Nigerian daily newspaper, Vanguard, in May 2018.", "The Vanguard article described military airstrikes against the Nigerian Islamist group, Boko Haram, using the country’s newly acquired Mi-35M helicopter gunship.", "AFP Fact Check confirmed that the image, still available in our archives, was taken by AFP photographer Stefan Heunis on April 17, 2018.", "The caption reads: “Members of the Nigerian Special Forces Unit rappel from a helicopter during the African Land Forces Summit (ALFS) military demonstration held at General Ao Azazi barracks in Gwagwalada on April 17, 2018.” Gwagwalada is an area council just west of Abuja and more than 400 kilometres from Orlu.", "AFP Fact Check previously debunked similar social media posts in 2019 that claimed the same photo showed the Nigerian Air Force supplying weapons to Fulani herders in Enugu, southeastern Nigeria.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]