["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In unveiling an attack ad against Democrat Russ Feingold, who is challenging Republican U.S. Sen. Ron Johnson in a rematch of their 2010 contest, a group backing Johnson said it was spending $2 million to air the TV spot.", "The central claim in the ad from the Freedom Partners Action Fund -- a Super PAC whose funders include billionaire industrialists Charles Koch and Wisconsin’s Diane Hendricks -- is that then-senator Feingold received a memo in 2009 detailing serious problems at the VA Medical Center in Tomah, Wis.", "Deaths of veterans were later linked to the over-prescription of painkillers at the facility.", "But there are several issues with the ad:", "The person who wrote the memo -- and added a notation saying it was hand delivered to Feingold -- reversed herself several months before the ad was released, saying the memo never had been delivered to Feingold after all.", "After the ad began running, three Wisconsin television stations pulled it when Feingold’s campaign demanded it be taken down for being inaccurate.", "Then Freedom Partners produced a new version of its ad. This time, the ad didn't say Feingold received the memo; instead it said the memo was marked as having been delivered.", "Whether Feingold ever received the memo seven years ago may never be known.", "Freedom Partners points out it is relying on the memo writer’s original contention that Feingold did receive it.", "But -- as Freedom Partners itself seems to confirm by revising its ad -- there isn’t evidence that Feingold did receive the memo.", "The ad", "The original ad, titled \"The Real Story,\" was posted online May 2, 2016. It features whistleblower Ryan Honl, a former employee at the Veterans Administration clinic in Tomah, which is about 100 miles northwest of Madison. Honl describes falsified records and other problems at the clinic, then makes the accusation about Feingold.", "\"I found out that Russ Feingold got a memo in 2009 that outlined veteran harm and nothing was done,\" Honl says.", "As he speaks, a copy of the memo appears on the screen.", "The focus is the hand-written notation that says the memo was hand-delivered to Feingold and two other Wisconsin Democrats -- U.S. Rep. Ron Kind and then-Rep. Dave Obey. Animation is used to draw a red circle around Feingold’s name.", "Honl continues, saying: \"Russ Feingold ignored veterans' concerns while veterans were dying at the facility. All those veterans who’ve come back wounded, and they die at the hands of politicians who look the other way. I just want the voters to know the real story.\"", "The memo", "The memo was revealed by USA Today in October 2015, after it had been reported that a 35-year-old Marine died at the facility in 2014 after doctors prescribed him a fatal mixture of drugs.", "The memo was written by Lin Ellinghuysen, president of a local union at Tomah, to another union official. \"(M)any of the veterans served at this facility are prescribed large quantities of narcotics,\" she wrote, adding that it had become a \"significant\" and \"serious\" concern.", "But Obey and representatives of Kind and Feingold told USA Today they had no recollection -- or record of -- receiving the 2009 memo. Obey told the newspaper that such correspondence would have been destroyed when members of Congress leave office.", "In addition, Ellinghuysen told USA Today \"we can't confirm\" the memos were delivered to the three offices and that she had \"mistakenly operated on that assumption.\"", "Ellinghuysen has since gone further, stating to PolitiFact Wisconsin that the memo was not delivered to Feingold or Kind. She said the union official she sent the memo to told her he did not make the deliveries.", "The aftermath", "The memo has continued to be used in the run-up to the November 2016 election. But no evidence of whether Feingold received it has emerged.", "In January 2016, the Wisconsin Republican Party released audio of an interview Ellinghuysen did with a local sheriff’s deputy in 2009. She says on the recording that she had spoken to members of Wisconsin's congressional delegation in 2008 and they were aware of \"unreported, unexpected deaths\" at the VA hospital.", "But the recording doesn’t say who exactly Ellinghuysen talked to in Washington. And in any case, it doesn’t bear on whether Feingold received the memo cited in the Freedom Partners ad.", "In May 2016, after the three TV stations stopped running the Freedom Partners ad, the group released its revised version of the ad. In the new version, Honl says multiple memos outlining veteran harm, including the one from 2009, were marked delivered to Feingold and nothing was done.", "That’s a key change.", "The original ad states Feingold received the 2009 memo. The revised ad refers to multiple memos, but claims only they were marked as being received by Feingold (and the marking was done by the memo writer).", "Our rating", "Freedom Partners says in a TV ad that Feingold \"got a memo in 2009 that outlined veteran harm\" at a Wisconsin VA facility \"and nothing was done.\"", "Whether the memo was ever delivered to Feingold, who was then a U.S. senator, may never be known. But Freedom Partners cites no evidence that it was delivered.", "And it made a revised version of the ad that essentially walks back its claim, now saying the memo was marked as delivered, not that Feingold actually received it.", "Because there isn’t evidence that Feingold received the memo, we rate the claim False.", "Political TV Ad Archive, Freedom Partners’ \"The Real Story\" TV ad", "Email, Freedom Partners spokesman Geoff Holtzman, May 10, 2016", "Email, Lin Ellinghuysen, May 4, 2016", "Email, Russ Feingold campaign spokesman Michael Tyler, May 9, 2016", "Milwaukee Journal Sentinel, \"Russ Feingold says ad blaming him for VA inaction is misinformed,\" Jan. 20, 2016", "Milwaukee Journal Sentinel, \"Koch-funded group revises anti-Feingold ad on Tomah scandal,\" May 9, 2016", "Milwaukee Journal Sentinel, \"Three TV stations pull Tomah ad critical of Russ Feingold,\" May 8, 2016", "Milwaukee Journal Sentinel, \"New audio: Union official said Wisconsin lawmakers told of Tomah VA deaths in 2008,\" Jan. 25, 2016", "YouTube, Freedom Partners revised ad, May 9, 2016", "USA Today, \"Tomah VA rep sought Feingold, Kind’s help in ‘09,\" Oct. 17, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]