["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a speech hammering the theme that Sen. John McCain would not offer much change from the last eight years under President George W. Bush, Sen. Joe Biden hit on what many consider a low point of the Bush presidency: the federal government's slow response to Hurricane Katrina.", "\"When George Bush said we shouldn't investigate why the government's response to Hurricane Katrina was so incompetent, John McCain stood with him,\" Biden said in a speech in St. Clair Shores, Mich., on Sept. 15, 2008.", "It's true that McCain joined other Republicans in the Senate to fend off Democratic efforts led by Sen. Hillary Clinton to create an independent commission to examine the federal, state and local response to Hurricane Katrina.", "On Sept. 14, 2005, McCain and 53 other Senate Republicans rejected an effort by Clinton to establish the commission by attaching an amendment to a spending bill. Republicans said the move violated Senate rules by attempting to legislate policy via a spending bill.", "Less than five months later, on Feb. 2, 2006, McCain joined with 52 Senate Republicans in a vote to kill a Clinton effort to attach a similar amendment to a tax bill.", "Both votes came down entirely along partisan lines. And they came at a time of particularly bitter recriminations over the federal response to Hurricane Katrina, while the White House was refusing to release certain documents or to make senior officials available for sworn testimony before Congress, citing the confidentiality of executive branch communications.", "But it's misleading to suggest that McCain opposed all efforts to investigate the government's response to Katrina.", "Republicans in the GOP-controlled Senate threw their support behind a probe by the Homeland Security and Governmental Affairs Committee, which looked into the federal role in hurricane preparedness and its response. Republican leaders expressed faith in the bipartisan investigation and derided Democratic efforts to charter an independent commission to conduct a parallel inquiry. An aide to then-Majority Leader Bill Frist, R-Tenn., called amendments to establish an independent Katrina commission \"taxpayer-funded flatulence that would just waste time and money to distract from the inquiry already well under way in the Senate.\"", "And Republicans did offer to create a bipartisan congressional committee consisting of senators and representatives to examine the hurricane response. But Democrats took a pass, saying it wouldn't be truly bipartisan because as minority party they wouldn't have subpoena power.", "Biden is correct that McCain did not support the Democratic plan to create an independent commission to investigate the government's response to Katrina. But McCain didn't oppose all investigation. He supported the Homeland Security investigation. It may not have been the kind of investigation the Democrats wanted. It may not have had the independence Democrats wanted. But it was an investigation. And so we rate Biden's statement Half True.", "New York Times,  Text: Biden's Remarks on McCain's Policies,\"  Sept. 15, 2008", "PolitiFact,  \"With two notable exceptions\"", "YouTube.com,  McCain on Katrina investigations", "Politico,  \"McCain's Katrina Claim Gets Rapidly Fact-Checked,\"  by Jonathan Martin, June 4, 2008", "Times-Picayune,  \"Two Key Senators Go to Bat for N.O.,\"  by Jeff Duncan, March 11, 2006", "New York Times,  \"White House Declines to Provide Storm Papers,\"  by Eric Lipton, Jan. 25, 2006", "Associated Press,  \"Senate Kills Bill for Katrina Commission,\"  by Lara Jakes Jordan, Sept. 14, 2005", "CQ Today, \"Reid Ponders Reviving Katrina Commission on Defense Bill, Raising Tensions,\" by John M. Donnelly, Nov. 4, 2005", "CQ Almanac, 2005 and 2006", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]