["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The biological research lab with a logo similar to the fictional lab from the “Resident Evil” video game is based in Shanghai, more than 500 miles from Wuhan, China.", "There’s no evidence that the 2019 coronavirus that was first detected in Wuhan was created in a lab. It likely has its origins in bats, according to the CDC.", "An image making the rounds on social media draws a supposedly eerie connection between the outbreak of the coronavirus in Wuhan, China, and the fictional virus that triggers the dangerous mutations at the center of the plot for \"Resident Evil,\" a Japanese video-game series.", "The image says that the fictional lab responsible for the virus in the \"Resident Evil\" franchise has the same logo as a real-life lab in Wuhan, where the coronavirus was first detected.", "The problem with that claim: The Chinese lab with that logo is actually based in Shanghai, a roughly nine-hour drive from Wuhan.", "\"In ‘Resident Evil’ the Umbrella Corporation releases a virus that infects the people of Raccoon City,\" the image, posted to Facebook as early as Jan. 27, says. \"A biological research lab with the exact same logo as the Umbrella Corporation can be found in the city where the coronavirus outbreak originated. Corona is an anagram for Racoon.\"", "A screenshot of a Facebook post about the coronavirus and a fictional lab from the \"Resident Evil\" video game. We rate this claim False.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Without getting too far into the details of \"Resident Evil,\" it’s clear that the post is inaccurate, as other fact-checkers have noted.", "In fact, the post gives itself away. Beneath the logo for the biological research lab identified in the image is the company’s real name, Shang Hai Ruilan Bao Hu San Biotech Limited.", "The company does have a blue-and-white logo that closely resembles the red-and-white logo from the fictional lab in \"Resident Evil.\" But according to the company’s website, the lab is based in Shanghai, which is more than 500 miles by car away from Wuhan, per Google Maps.", "What’s more, there’s no evidence that the novel 2019 coronavirus was created in a lab. We’ve debunked a number of claims — like the Facebook post in question — that suggested the new virus was artificially made in Wuhan or elsewhere.", "According to the Centers for Disease Control and Prevention, the new coronavirus is a \"beta coronavirus\" similar to severe acute respiratory syndrome, or SARS, and Middle East respiratory syndrome, or MERS. All three viruses are believed to have their origins in bats.", "We rate this post False.", "Facebook post, Jan. 27, 2020", "Check Your Fact, \"Fact Check: Viral Image Claims to Show a Wuhan Lab with the Same Logo as the Fictional ‘Resident Evil’ Lab,\" Feb. 12, 2020", "Full Fact, \"This company is based in Shanghai, not Wuhan,\" Jan. 30, 2020", "Snopes, \"Is the ‘Umbrella Corporation’ Logo Oddly Similar to a Wuhan Biotech Lab’s?\" Jan. 29, 2020", "Shang Hai Ruilan Bao Hu San Biotech Limited, \"About,\" accessed March 2, 2020", "Fandom, \"Resident Evil Wiki,\" accessed March 2, 2020", "PolitiFact, \"Health misinformation site promotes conspiracy about coronavirus,\" Feb. 10, 2020", "PolitiFact, \"Clorox bottles don’t prove the coronavirus was 'developed' before the outbreak,\" Jan. 30, 2020", "PolitiFact, \"Websites spin unproven link between Canada, China about coronavirus outbreak,\" Jan. 28, 2020", "PolitiFact, \"No evidence that Chinese officials will say coronavirus was leaked from a lab,\" Jan. 28, 2020", "PolitiFact, \"Fact-checking hoaxes and conspiracies about the coronavirus,\" Jan. 24, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]