["About this rating", "One prominent class of rumor associated with the 2016 U.S. presidential campaign was the notion that various prominent people had foretold the unlikely political ascendancy of Donald Trump decades in advance, everyone from President Ronald Reagan to Nirvana frontman Kurt Cobain.", "In early 2017, another example of this class of rumor hit social media, holding that former Beatle John Lennon had opined in 1981 that \"the only way we are going to get ourselves out of the messes we've created for ourselves is to find strong and independent leaders ... perhaps a businessman\":", "The implication of this item was obvious: Lennon had presciently discerned, some thirty-five years in advance, the surprising rise of Donald Trump (a businessman who had never held any public office) to the Republican Party nomination and, ultimately, the White House.", "The notion that John Lennon actually said anything like the statement attributed to him above in 1981 (or at any other time) has several questionable aspects, however:", "1)  John Lennon was shot to death in December 1980, so he couldn't have said anything in 1981.", "2)  Nearly every word of every interview and public statement John Lennon gave during his adult lifetime has been documented and analyzed, yet we found no evidence that this putative quotation of his had been recorded and reproduced anywhere prior to its online appearance in 2017.", "3)  This statement doesn't even sound like something John Lennon would have said — if there was one group he held greater disdain for than politicians, it was businessmen.  When the Beatles were attempting to gain a controlling interest in their publishing company, Northern Songs, in 1969, Lennon famously derailed negotiations at one point by reportedly proclaiming that he was sick of \"being fucked around by men in suits sitting on their fat arses in the City.\"", "If the former Beatle had proposed looking to someone other than politicians for leadership, his suggested alternative likely would have been anyone other than businessmen.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]