["About this rating", "The celebrity political endorsement is a common trope in the online misinformation sphere. During the 2016 U.S. presidential election campaign, and continuing afterwards, junk news web sites famously produced fake stories claiming that Pope Francis had endorsed then-candidate Donald Trump (as well as Bernie Sanders), that left-wing filmmaker Michael Moore had also endorsed Trump, and that actors Denzel Washington and Brad Pitt had as well.", "In September 2018, Facebook users shared a fabricated Trump endorsement meme from Madonna, who purportedly said she \"regretted\" voting against Trump in 2016 and intended to support him in 2020:", "In reality, Madonna said nothing of the sort on Fox News (or anywhere else), in September 2018 (or at any other time). The singer and actor has been on poor terms with Donald Trump for many years (as outlined by Rolling Stone magazine) and has spoken out against him since his election.", "In January 2017, Madonna spoke at the Women's March in Washington, D.C., a mass demonstration for women's rights and progressive causes centered around opposition to the newly sworn-in president. She called Trump's election a \"horrific moment of darkness\" and said she had \"thought an awful lot about blowing up the White House\" (a phrase she later clarified was intended as a metaphor). In response, Trump called Madonna \"disgusting\":", "﻿Neither party has expressed a significant change in attitude towards the other since then.", "Spanos, Brittany.   \"Donald Trump vs. Madonna: Everything We Know.\"\r\n    Rolling Stone.   27 January 2017.", "Kreps, Daniel.   \"Madonna Clarifies 'Out of Context' Remark from Women's March.\"\r\n    Rolling Stone.   22 January 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]