["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Some of the 298 passengers who died aboard Malaysia Airlines Flight 17 were HIV/AIDS researchers and advocates headed for the 20th International AIDS Conference in Australia, a fact President Barack Obama mentioned after the plane was shot down over eastern Ukraine.", "Obama also said in July 18 comments about the crash that \"the United States of America is going to continue to stand for the basic principle that people have the right to live as they choose.\"", "That touched a nerve with Bryan Fischer, director of issues analysis of the conservative American Family Association. Fischer claimed that Obama was using the MH 17 downing as a platform to legitimize gay relationships.", "\"Obama politicizes deaths of AIDS researchers on Malaysian plane. We know how to stop AIDS: persuade men not to have sex with men,\" Fischer said in a message on Twitter that was retweeted 66 times and attracted national attention.", "His comments were lambasted by writers of The Daily Beast, Salon and Patheos. Still, Fischer doubled down in another tweet and column. We wanted to dig into the facts behind his claim that the way to stop AIDS is to \"persuade men not to have sex with men.\"", "Fischer’s evidence", "Experts say Fischer’s idea of an AIDS solution is highly flawed.", "But Fischer stood by his claim in an interview with PunditFact, citing a report from UNAIDS that the rate of HIV is 19 times higher among men who have sex with men than the adult population. Also, he said that while his tweet isolated on men having sex with men, he made a somewhat broader argument on his radio show.", "\"We know how to stop the HIV/AIDS epidemic. Persuade men not to have sex with men,\" he said on his radio show Focal Point. \"Persuade prostitutes to go straight, and persuade people not to shoot up with drugs. If we can get everybody persuaded to do that, then the epidemic begins to diminish overnight.\"", "Dr. Stefan Baral, a Johns Hopkins Bloomberg School of Public Health epidemiology professor and director of the Key Populations Program of the Center for Public Health and Human Rights, said Fischer’s post on Twitter reveals a misunderstanding about human nature and societal behavior.", "\"His recommendation is akin to making recommendations for people not to drive cars for fear of car accidents or riding a bike for fear of falling,\" Baral said in an email. \"In other words, this is a natural and healthy normal practice that in the context of an additional determinant induces risk. It would not be dissimilar from saying that there would be no cervical cancer if heterosexual people didn’t have sex.\"", "HIV/AIDS overview", "There is no cure for AIDS or HIV, the virus that leads to AIDS and ravages the body’s immune system if untreated.", "The statistics are staggering. About 35 million people have HIV in the world, including about 3.3 million children and 1 million Americans, according to the Foundation for AIDS Research, or amfAR. Among Americans, about 50,000 are newly infected each year, and 18 percent do not know they have the virus.", "In 2012, 1.6 million people died from AIDS, which was a 30 percent drop from 2005, according to UNAIDS.", "In the United States, gay men contract the virus at disproportionate rates to their share of the American population. In 2010, men who have sex with men comprised 78 percent of new HIV infections among men -- 63 percent of all new infections -- even though they made up just 4 percent of the male American population, according to the CDC.", "Still, preventing men from having sex with men (if that were even feasible) will not end HIV/AIDS in the United States. About 20 percent of Americans infected with HIV in 2010 were women, mainly through heterosexual sex, according to the CDC.", "HIV is carried through body fluids. The virus is passed when HIV-infected fluids enter the bloodstream of someone else, such as through contact with a cut or sore, sharing needles or syringes, or through the vagina, rectum, mouth, or tip of the penis.", "In the United States, anal sex is the highest-risk behavior for spreading HIV, followed by vaginal sex, sex with multiple partners and sharing needles with someone infected with HIV.", "Mother-to-child transmissions are not common in the United States thanks to widespread HIV testing of pregnant women and drugs that prevent the virus from affecting a child. Neither is getting the virus through blood transfusions and organ donations and transplants, which are intensely tested for HIV.", "But what’s true for Americans is not true for other people in the world.", "World picture", "About 70 percent of all people infected with HIV live in sub-Saharan Africa, about 24 million people. This region is also home to the most children living with HIV whose infections originated during pregnancy, childbirth of consuming breast milk, according to AIDS.gov.", "Globally, the dominant form of transmission is heterosexual sex, said Sophie Barton Knott, UNAIDS spokeswoman. Nearly half of people with HIV are female, and most were infected through heterosexual sex. Most of the 50.9 percent of men with HIV got it through heterosexual sex, too, she said.", "The highest rates of AIDS among 15- to 24-year-olds is among women in many parts of the world, said Seth Faison, spokesman for The Global Fund to Fight AIDS, Tuberculosis and Malaria. And in Eastern Europe, the highest transmission rates of AIDS are among people who inject drugs.", "\"Men who have sex with men are a high-risk group, but not the only one,\" he said.", "The bottom line?", "Preventing men from having sex with men will not end AIDS.", "Faison said the criminalization of same-sex activity actually can increase transmission rates. Being gay is a crime in at least 76 countries, and in those places, gay men are less likely to receive treatment, testing and prevention.", "The CDC also says stigma and homophobia are likely one factor behind the rise in HIV infections among young gay men in the United States.", "\"In effect, efforts to ‘persuade men not to have sex with men’ is counterproductive,\" Faison said. \"It will not stop AIDS.\"", "Our ruling", "Fischer said, \"We know how to stop AIDS: persuade men not to have sex with men.\"", "Though men who have sex with men are at the highest risk of contracting HIV/AIDS in America, this is not a serious solution to ending a pandemic disease. Not in the United States, and certainly not worldwide.", "Women, children, and men who don’t have sex with men are also at risk, and women make up about half of people worldwide who have HIV/AIDS.", "Fischer’s claim is ridiculous. It rates Pants on Fire.", "Interview with Seth Faison, spokesman of The Global Fund to Fight AIDS, Tuberculosis and Malaria, July 22, 2014", "Interview with Sophie Barton-Knott, UNAIDS spokeswoman, July 24, 2014", "Interview with Dr. Stefan Baral, epidemiology professor at Johns Hopkins School of Public Health, July 26, 2014", "Interview with Bryan Fischer, July 22, 2014", "American Family Association Focal Point with Bryan Fischer", "PolitiFact Tennessee, \"Examining ‘Don’t say gay’ bill sponsor’s claims about AIDS, gay men, risk of sexual activity,\" Feb. 5, 2012", "PolitiFact Tennessee, \"Knoxville Republican says AIDS came from man having sex with monkey then another man,\" Feb. 3, 2012", "PolitiFact Virginia, \"Bob Marshall: Homosexual activity cuts life expectancy by 20 years,\" June 7, 2012", "New York Times, \"Leading AIDS researcher killed in Malaysia Airlines crash,\" July 19, 2014", "Interview with Donni Small, CDC spokeswoman, July 21, 2014", "Patheos", "Centers for Disease Control and Prevention, 2011 HIV surveillance report and factsheet, accessed July 21, 2014", "Centers for Disease Control and Prevention information for HIV/AIDS transmission and statistics, accessed July 21, 2014", "American Psychological Association’s Psychology and AIDS Exchange newsletter, \"Discrimination and homophobia fuel the HIV epidemic in gay and bisexual men,\" April 2012", "Philly.com, \"HIV Diagnoses down in U.S. except for young, gay males: CDC,\" July 19, 2014", "The Global Fund to Fight AIDS, Tuberculosis and Malaria, HIV/AIDS information", "UNAIDS, \"The Gap Report,\" accessed July 22, 2014", "CIA Factbook, \"People living with HIV/AIDS,\" accessed July 29, 2014", "World Health Organization HIV/AIDS fact sheet, accessed July 29, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]