["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump sat with congressional leaders for an open conversation about cutting a deal on the fate of about 700,000 undocumented young immigrants whose parents brought them to America as small children. Trump said last September that an Obama-era policy of Deferred Action for Childhood Arrivals (DACA) would end this March unless Congress acted.", "\"President Obama, when he signed the executive order, actually said he doesn't have the right to do this,\" Trump said Jan. 9, 2018. \"You have to go through Congress. Whether he does or whether he doesn't, let’s assume he doesn’t. He said it.\"", "We looked at Obama’s Rose Garden speech announcing the new policy that allowed those who qualified to register and apply for two-year deferrals.", "Obama didn’t say that he lacked the right to act. In contrast, he emphasized his authority to set priorities until Congress approved the DREAM Act, a measure that would formalize the legal status of this group of immigrants.", "\"In the absence of any immigration action from Congress to fix our broken immigration system, what we’ve tried to do is focus our immigration enforcement resources in the right places,\" Obama said June 15, 2012. \"This is not a path to citizenship.  It's not a permanent fix.  This is a temporary stopgap measure that lets us focus our resources wisely while giving a degree of relief and hope to talented, driven, patriotic young people.\"", "Obama did urge Congress to act, saying, \"There is still time for Congress to pass the DREAM Act this year, because these kids deserve to plan their lives in more than two-year increments.\"", "It has been a theme among Republicans and conservatives that before he penned DACA, Obama had said that he was bound by law to pursue deportations. The Speaker of the House John Boehner posted a list of 22 times when Obama said \"he couldn’t ignore or create his own immigration law.\"", "Indeed, Obama did tell a Univision audience Oct. 25, 2010, that \"I'm president, I'm not king.\"", "But he continued on to say, \"If Congress has laws on the books that says that people who are here who are not documented have to be deported, then I can exercise some flexibility in terms of where we deploy our resources, to focus on people who are really causing problems as opposed to families who are just trying to work and support themselves.\"", "In March 2011, he again told Univision, \"there are enough laws on the books by Congress that are very clear in terms of how we have to enforce our immigration system that for me to simply through executive order ignore those congressional mandates would not conform with my appropriate role as president.\"", "And then he said, \"That does not mean, though, that we can't make decisions, for example, to emphasize enforcement on those who’ve engaged in criminal activity.\"", "In the fall of 2011, he said, \"I just have to continue to say this notion that somehow I can just change the laws unilaterally is just not true.\"", "Then he added, \"What we can do is to prioritize enforcement, since there are limited enforcement resources, and say we’re not going to go chasing after this young man or anybody else who’s been acting responsibly and would otherwise qualify for legal status if the DREAM Act passed.\"", "Whether Obama’s action was legal or not, he consistently left open the option to focus enforcement on more dangerous illegal immigrants. Where he was particularly vague, however, was on the scope of his flexibility and the tools at his disposal.", "DACA took a major step by creating a formal process for applicants, but he justified it as an extension of the concept of selective enforcement.", "In announcing DACA, Obama emphasized that it was a temporary policy. He did not issue an executive order. Rather, the policy was released by the Department of Homeland Security.", "Later in his presidency, Obama expanded the approach of deferred action to families, and for various reasons, that was blocked by the courts. There is no question that his interpretation of his authority grew over time.", "Trump said that when Obama signed the executive order on DACA, he acknowledged that he didn’t have the right to do it.", "The smaller errors in that statement are that Obama didn’t sign an executive order, and that when he announced the new policy, he didn’t say that he lacked the authority.", "The bigger issue is that in 2010 and 2011, Obama reserved the right to enforce immigration laws selectively. His emphasis was on deporting criminals who were undocumented, rather than undocumented students or workers who presented no threat to public safety.", "To be sure, Obama drove home the point many times that his hands were tied and that he had to follow the law. His words about his legal flexibility were vague and gave no hint about the DACA program, an approach that took the idea of selective enforcement to a new level.", "We rate this claim Mostly False.", "CNN, White House press conference, Jan. 9, 2017", "White House, Remarks by the President on Immigration, June 15, 2012", "Los Angeles Times, Transcript of President Barack Obama with Univision, Oct. 25, 2010", "White House, Remarks by the President at Univision Town Hall, March 28, 2011", "White House, Remarks by the President in an \"Open for Questions\" Roundtable, Sept, 28, 2011", "Office of the Speaker of the House of Representatives, 22 Times President Obama Said He Couldn’t Ignore or Create His Own Immigration Law, Nov. 19, 2014", "Heritage Foundation, DACA Is Unconstitutional, as Obama Admitted, Sept. 8, 2017", "Time, TRUMP, OBAMA, DACA AND THE STRICT LIMITS ON PRESIDENTIAL POWER, Sept. 13, 2017", "PolitiFact, What have courts said about the constitutionality of DACA?, Sept. 11, 2017", "PolitiFact, Obama's immigration heckler wrong on presidential powers, experts say, Nov. 26, 2013", "Factcheck.org, Obama’s Immigration Amnesia, Nov. 18, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]