["About this rating", "On 13 August 2016, the US Daily Mail web site published an article reporting that Alabama senator Fred Q. Calhoun had penned an open letter to the International Olympic Committee (IOC) because he was upset that the state of Georgia, but not other states (such as Alabama), was allowed to compete in the Olympic games:", "Friday afternoon, Alabama State Senator Fred Q. Calhoun, (R-Delbert, Ala.) published an open letter to the International Olympic Committee’s President, Thomas Bach, complaining that it was unfair for the committee to allow only one U.S. state to participate as an independent team in this year’s Summer Olympic Games.", "“As I was watching last night’s Olympic games with my family, I was stunned to see that Georgia was permitted to participate as an independent entity,” penned the freshman lawmaker.", "“Alabama athletes are among the world’s most talented and passionate competitors…  On behalf of the nearly 5 million people who call the Yellow Hammer State home, we request that Alabama be allowed to compete in future Olympic games — just as you’ve permitted the State of Georgia to do,” concluded the state senator.", "This story was just a fabrication, however — the country of Georgia's Olympic team was not confused by any Alabama official with a team from the neighboring American state of the same name.", "Although the US Daily Mail does not carry a readily available disclaimer identifying their content as fake news, the web site's slogan is \"news that hasn't happened yet\":", "There are several other ways to tell that this story is bogus. Mainly, there is no Alabama state senator named Fred Q. Calhoun:", "Furthermore, the image that accompanied this fake news story (which can be seen at the top of this article) was taken during the 2010 Winter Olympic Games in Canada, not at the 2016 Summer Olympics Games in Rio de Janeiro.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]