["Hours after former President Pranab Mukherjee addressed RSS cadres at an event in Nagpur, a photograph began circulating on social media in the late hours of June 7. It was alleged that BJP and RSS, sniffing an opportunity, had in an organised campaign, photoshopped an image of Mukherjee of the event.", "Real 1 n fake 2 ye kalakari bjp itcell ….kuch to sharm rakho..jo bola hai wo ni bataynge.@MahilaCongress @ChitraSarwara @sushmitadevmp @chouhan_sumitra @INCIndia @IYC @RahulGandhi @neetuvermasoin @DeependerSHooda @rssurjewala @Sharmistha_GK @INCHaryana @HaryanaPMC pic.twitter.com/YZQvohHmOG", "— Ruchi Sharma (@RuchisharmaINC) June 7, 2018", "The above tweet is by Ruchi Sharma who is a Congress leader and the IT cell incharge of the party for Haryana. Sharma had tagged Sharmistha Mukherjee, daughter of Pranab Mukherjee in this tweet. Sharmistha Mukherjee had, prior to the event, expressed consternation over her father’s decision to attend it. She referred to this tweet by Sharma in a tweet she posted at 11:03 pm on June 7.", "See, this is exactly what I was fearing & warned my father about. Not even few hours have passed, but BJP/RSS dirty tricks dept is at work in full swing! https://t.co/dII3nBSxb6", "— Sharmistha Mukherjee (@Sharmistha_GK) June 7, 2018", "As can be seen in the two images posted in the tweet above, the picture on the left is the actual picture, whereas the one on the right has been photoshopped. The trademark RSS cap which is part of the organisation’s official attire has been added to Mukherjee’s head and a hand has been added to the frame to show him doing the traditional RSS salutation.", "These two juxtaposed images have been posted by Congress leaders and supporters on Twitter, reiterating that this kind of mischief by the sangh is exactly what had been feared.", "The photograph was also added to an article written by suspended Congress leader Manishankar Aiyar and published on the website of NDTV. This was pointed out by a Twitter user.", "Hi dear @ndtv, don’t use morphed picture of our former President Shri @CitiznMukherjee. I can understand you guys are angry with him for attending an RSS event. But still, using a photoshopped picture to show ur hatred is so down-market! cc: @Nidhi @sunetrac @soniandtv pic.twitter.com/qNd7YruIG8", "— Rahul Kaushik (@kaushkrahul) June 8, 2018", "NDTV promptly took the picture down and apologised for the error. Suparna Singh, CEO of NDTV in a conversation with Alt News said, “NDTV ran a story on the morphed photo. The inauthentic photo was accidentally used for half an hour this morning in an opinion piece by Mani Shankar Aiyar. We apologize for the error.” Meanwhile, the RSS in a press release strongly condemned the photoshopped image, calling it a ‘dirty trick by divisive political forces’ which are out to malign the organisation.", "Alt News was alerted by a social media user about the possible source of the photograph. According to this user, it was first tweeted by one Mihir Jha.", "@free_thinker I think this is handiwork of Mihir k jha. SS taken from Google search. I think twit deleted. pic.twitter.com/hDG55J9Qs1", "— #At Least One Should Die# (@richard49step) June 8, 2018", "Alt News checked the Twitter account of Mihir Jha, and found that his profile has restricted access. Jha in his ‘Bio’ section mentions “Proud to be followed by PM @narendramodi”. Using the exact text provided in the screenshot sent to us, we found the link to the tweet. On clicking the link, we found that the tweet has been deleted. We accessed the cached version of the deleted tweet and managed to obtain a screenshot of the same.", "The time shown in this tweet is 7:07 am. This is because of a timezone difference as the tweet was probably cached from a server which resides in the Pacific Time Zone (California, USA) which is 12 and a half hours behind Indian Standard Time. To determine the exact time of the tweet we looked at the source code of the tweet to find the unix time of the tweet. Unix time is the number of seconds elapsed since 1 January 1970. The epoch time for the tweet by Jha is 1528380453 as can be seen in the screenshot below.", "Unix time 1528380453 converted to Indian Standard Time is 7:37 pm on June 7th. Jha’s tweet was therefore posted at 7:37 pm.", "Interestingly, only 23 minutes before this image was tweeted, i.e. at 7:14 pm IST, Jha had tagged another user @atheistkrishna in a tweet in which he posted the original photograph. Jha had tweeted to @Atheist_Krishna “Can u put one black cap on his head and change hand gestures? Asking for a friend from Congress IT Cell”. @Atheist_Krishna is followed on Twitter by BJP’s IT cell head Amit Malviya.", "One Abhi Jha (@DarrKeAage) replied to the tweet with the now infamous photoshopped image.", "The account @DarrKeAage no longer exists on Twitter. It has been deleted.", "On the evening of June 8, India Today had reported that Mihir K Jha is the man who is behind the photoshopped picture of Pranab Mukherjee.", "Man behind Pranab Mukherjee’s morphed photo at RSS event, tracked down. India Today’s deputy editor Balakrishna brings us more on this #TTP Live: https://t.co/4fqxBVUizL pic.twitter.com/drbAN00W3Z", "— India Today (@IndiaToday) June 8, 2018", "In most such cases where the Congress party and/or its leaders are targeted, Alt News has observed that such photoshopped images are circulated widely in an organised manner through a number of Twitter accounts and hundreds of pages on Facebook that are followed by millions of members. The right-wing ecosystem on social media is formidable, and operates in a synchronised manner to generate trends. It is this ecosystem that is often referred to as the dirty tricks department of the RSS and BJP.", "In this particular instance, Alt News found that the pages and accounts which Alt News has tracked for regularly posting misinformation had not shared this photoshopped image. However, evidence points to Mihir K Jha being the first to refer to tampering of the photograph and subsequently posting it on Twitter. It may be reiterated that Jha is followed by Prime Minister Narendra Modi on Twitter.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]