["About this rating", "In March 2021, photographs emerged online which appeared to show New York Gov. Andrew Cuomo pacing outside his official residence in Albany, talking on his cellphone while draped in a blanket and holding what some social media users speculated was a bottle of beer.", "At the time, Cuomo faced mounting pressure to resign, including from fellow Democrats, amid a series of allegations of sexual misconduct against him. The photographs, published on March 12, appeared to provide a stark visual record of the lowest ebb in Cuomo's decade as governor.", "Multiple Twitter and Facebook users posted the photographs, claiming that they showed Cuomo nursing a beer:", "In reality, it was not clear what the bottle contained, but it strongly appeared to be a brand of mineral water produced in New York state. Snopes asked Cuomo's press office for clarification on the contents of the bottle, but we did not get a response in time for publication. If we receive further relevant information or evidence, we will update this fact check accordingly. For now, we are issuing a rating of \"Unproven.\"", "On March 12, the Reuters agency published more than a dozen photographs, all taken earlier that afternoon by photographer Angus Mordant, that showed Cuomo walking on the grounds of the New York State Executive Mansion — the governor's official residence — in Albany. The pictures showed Cuomo draped in a blanket or shawl, speaking on his cellphone, and holding what appeared to be a blue glass bottle:", "Most of the photos gave no clear indication of the type or brand of the bottle, but one in particular provided a close-up view that strongly suggested Cuomo was drinking water, not beer.", "That photograph — later used by the The New York Times and posted to Instagram by the photographer himself — can be seen below:", "A closer look at the bottle shows clear visual similarities with the design of the Saratoga brand of mineral water:", "We also attempted to find beer brands with a similar design on a blue bottle but to no avail. Thus, it strongly appears that Cuomo was carrying a Saratoga brand bottle of mineral water — and not a beer — in the March 12 photographs. However, the definition in the pictures is not quite high enough to allow a definitive identification, and as a result, we are issuing a rating of \"Unproven\" for now.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]