["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Trump administration has cited China's trade relationship with North Korea as a key lever to deter the regime from producing a nuclear missile capable of striking the U.S.", "\"We must all do our share,\" Secretary of State Rex Tillerson told the U.N. Security Council April 28. \"But China, accounting for 90 percent of North Korean trade, China alone has economic leverage over Pyongyang that is unique, and its role is therefore particularly important.\"", "Tillerson’s remarks, which included a call for fresh economic sanctions, came at a time of heightened tensions between the United States and North Korea.", "As a U.S. Navy strike group steamed toward the Korean Peninsula -- where 28,500 American troops stationed in South Korea are on alert following the latest provocations from Pyongyang -- President Donald Trump on April 27 warned of a possible \"major conflict\" if diplomatic efforts fail.", "We’ve previously looked at Trump’s claim about the degree of control Beijing wields over Pyongyang. With Tillerson citing Chinese-North Korean trade relations as a vital diplomatic pressure point, we decided to explore how much China accounts for North Korea’s overall trade with the outside world.", "Finding accurate data for the secretive regime is a bit tricky since no North Korean equivalent of Trade.gov with troves of trade data exists, as Pyongyang treats this information as a state secret. But so-called \"mirror statistics,\" an accounting of data reconstructed from other countries’ reports, offer a workaround, albeit a flawed one, since the statistics don’t capture some transactions.", "The available data tell a story of growing dependence on Chinese trade over roughly the past two decades as economic sanctions levied by the UN and individual countries, as well as other factors, have seen North Korea’s trade with other partners fall drastically.", "In 2000, China, South Korea and Japan each accounted for about a fifth of the regime's overall trade, with the rest of the world making up the remaining roughly two-fifths. Since then, China’s slice of the pie has more than quadrupled, according to Stephan Haggard, professor of Korea-Pacific Studies at the University of California-San Diego.", "\"As sanctions have reduced South Korean and Japanese trade basically to nothing, trade has naturally become focused more on China,\" Haggard said. \"The rest of the world has not picked up the slack.\"", "Marcus Noland of the Peterson Institute for International Economics agreed that China’s current position as an outsize trade partner of North Korea is largely a function of Pyongyang’s strained relations with its neighbor to the south -- but he noted this could change if political winds shift.", "\"The reason that the percentage is so high is that South Korea, which was North Korea’s second largest trade partner, imposed sanctions and trade between the two countries is virtually nil,\" Noland said. \"If South Korea were to resume trade relations (as it might in the next administration) China’s share of North Korean trade would fall, but China would still be the country’s principal trade partner.\"", "Bilateral disputes led to Tokyo imposing sanctions that went even further than UN restrictions, said Haggard, who noted that the commercial risk associated with North Korea and its poor record on honoring property rights have also dissuaded potential trade partners.", "As South Korean and Japanese trade with Pyongyang fell, China’s economy boomed, fueling increased trade with North Korea -- a relationship unfettered by bilateral sanctions, as Beijing has traditionally viewed the regime as an ally. China has also been accused of being less compliant with UN sanctions than other countries.", "As a result of these factors, the consensus among experts we spoke to is that China now accounts for roughly 90 percent of North Korean trade.", "Source: Stephan Haggard, professor of Korea-Pacific Studies at the University of California-San Diego. UNSCR refers to United Nations Security Council Resolutions.", "\"Yes, China accounts for more than 90 percent of North Korea’s recorded trade,\" Noland said. \"They are the primary supplier of oil and the marginal supplier of grain. If China wanted to, it could bring North Korea to its knees.\"", "\"It has the economic leverage, but has been unwilling to use it, perhaps because it fears destabilizing the regime,\" he added.", "Our ruling", "Tillerson said, \"China account(s) for 90 percent of North Korean trade.\"", "China’s role as an outsize trade partner of North Korea is a relatively new development. Since 2000, trade with the rest of the world has dropped off, as Chinese trade has risen. While the ratio is subject to change based on political factors, China now accounts for around 90 percent of North Korean trade.", "We rate Tillerson’s statement True.", "PolitiFact, \"Donald Trump exaggerates when he says China has 'total control' over North Korea,\" Jan. 21, 2016", "Reuters, \"Trump says 'major, major' conflict with North Korea possible, but seeks diplomacy,\" April 28, 2017", "Washington Post, \"Tillerson calls for ‘painful’ measures to punish North Korea,\" April 28, 2017", "Washington Post, \"North Korea fires another ballistic missile, the 75th of Kim Jong Un’s tenure,\" April 28, 2017", "The Hill, \"Navy strike group arrives in Sea of Japan,\" April 29, 2017", "ABC News, \"What you need to know about the missile defense system US is setting up in S. Korea,\" April 26, 2017", "Email interview with Stephan Haggard, professor of Korea-Pacific Studies at the University of California-San Diego, April 28, 2017", "Email interview with Marcus Noland of the Peterson Institute for International Economics, April 28, 2017", "Email interview with Joseph de Thomas, professor of international affairs at Penn State University, April 28, 2017", "Email interview with Robert Ross, China scholar at Boston College and Harvard University, April 28", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]