["About this rating", "On 4 June 2019, Yahoo! Finance reported that as a result of the 2017 Tax Cuts and Jobs Act (TCJA) enacted by the Trump administration, \"the IRS pulled in an additional $93 billion for 2018 from taxpayers on individual income taxes than it did for 2017.\" With the tax law being a hot partisan topic, many readers who saw the headline online asked us whether it was true.", "In that article, Yahoo! Finance reported:", "The IRS collected $1.97 trillion in gross collections (the amount before refunds) for 2018. That figure stood at roughly $1.87 trillion for 2017. Refunds did increase this year — but not by much. The IRS refunded about $398 billion to taxpayers for 2018. For 2017, it was roughly $386 billion.", "And after refunds, the IRS collected about $93 billion more from individual American taxpayers than it did in 2017. Interestingly, that number stands close to the tax break amount that corporations received from the TCJA in 2018. Last year, big businesses paid $91 billion less in taxes than they had in 2017, prior to the new law’s passage.", "The numbers reported by Yahoo! Finance are accurate, cited from figures published by the IRS in its 2018 Data Book. Collections data for fiscal years 2017 and 2018 can be viewed in the following table, while 2017 refund data can be downloaded by clicking  here:", "However, it's still too early to tease out the long-term effects of the new tax law from 2018 data, according to Matthew Gardner, senior fellow and corporate tax expert at the Institute on Taxation and Economic Policy (ITEP), a non-partisan nonprofit organization that researches tax policy.", "Republicans had wanted to tell the story about new tax cuts fueling economic growth that would offset lost revenue, while Democrats had been eager to frame the new law as a gift to the country's wealthiest individuals and large corporations at the expense of average Americans.", "As Yahoo! finance reporter Kristin Myer pointed out on the news outlet's show \"The First Trade,\" it appeared that taxpayers had \"filled the gap\" left by corporate tax cuts in 2018.", "\"I would absolutely agree that if you look at the tax bill as written, unambiguously this is a shift away from taxing corporations toward taxing individuals,\" Gardner said.", "Gardner is a critic of TCJA because it cut the corporate tax rate from 35 percent to 21 percent without fixing loopholes that corporations have long exploited. \"We needed corporate tax reform, and we didn’t get it. We just got corporate tax cuts,\" Gardner told us. However, irregularities that occurred in both fiscal years 2017 and 2018 can paint a misleading picture of the long-term impact of the TCJA.", "Among others reasons, 2017 tax filings were artificially depressed because the IRS granted filing extensions to victims of natural disasters such as Hurricane Harvey in Texas. Conversely, filings were up in 2018 when those delayed tax returns were finally submitted.", "Furthermore, the law went into effect on 1 January 2018, meaning it wasn't in force for the entirety of the fiscal year, which starts in October. \"I wouldn't take these fiscal year ’18 data very seriously as an indicator of what the tax cuts are doing in any sense,\" Gardner said. \"No one should expect to fully see those effects emerge in the 2018 fiscal year. We have to wait until next year to really get a look at the impact on collections.\"", "Politicians on both sides of the aisle were anxious to see how the new law would affect tax refunds because, as Bloomberg reported, \"Getting a tax refund is a springtime tradition that Americans love as much as Easter candy.\" And as Yahoo! observed, \"In the end, many Americans saw modest increases in their paychecks throughout the year, but didn’t notice. Instead, as people filed, many bemoaned getting smaller-than-anticipated refunds or even being hit with a 'surprise' tax bill.\"", "Democratic lawmakers seized on the lower refunds, with Senate Minority Leader Chuck Schumer (D-New York) stating, according to Yahoo!, that \"Many Americans depend on their tax refund to pay bills and make ends meet, but this tax season, working families will see smaller than expected returns and surprise tax bills -- because the Trump administration used smoke and mirrors in a shallow attempt to exaggerate the impact of their tax law on middle class families for political reasons.\"", "Myers, Kristin.   \"American Taxpayers Paid Over $90 Billion More Under Trump Tax Law.\"\r\n    Yahoo! Finance.   4 June 2019.", "Davison, Laura.   \"Shrinking Tax Refunds Cast a Shadow on Trump’s Signature Law.\"\r\n    Bloomberg.   15 March 2019.", "Lee, Jasmine C. and Sara Simon.   \"How Every Senator Voted on the Tax Bill.\"\r\n    The New York Times.   19 December 2017.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]