["Democrats in New York responded with glee to the news that President Donald Trump is trading in his status as a New Yorker to declare himself a resident of Florida. Gov. Andrew Cuomo declared \"good riddance,\" to which Trump’s son, Donald Trump Jr., said, \"Nice soundbite. Now do the tens of thousands of other successful New Yorkers and businesses fleeing your idiotic policies every week. I’ll wait.\"", "Nice soundbite. Now do the tens of thousands of other successful New Yorkers and businesses fleeing your idiotic policies every week. I’ll wait.Also I don’t remember this sentiment ever stopping you from coming to @realDonaldTrump’s office begging for $. I was there. GOOD TIMES https://t.co/jDbK3k9daY", "The possible reasons behind the president’s decision to leave New York have been discussed and debated, but it has brought into the news once again New York’s longtime reputation as a place that people leave.", "But is Trump Jr. correct? Are \"tens of thousands\" of people leaving every week?", "We turned to the U.S. Census Bureau, which tracks migration among states. Last year, 458,014 people left New York for other states, an average of 8,808 people a week. Some 254,447 people moved into New York, so the result is a net out-migration of 203,567. The weekly average of people leaving drops to 3,915. In 2017, the results were similar.", "This is consistent with what PolitiFact New York reported in 2017, that New York lost a net 191,367 people to other states between July 2015 and July 2016, or 3,680 people every week, on average. During that year, New York had a higher net out-migration than any other state.", "When evaluating migration between states, it’s important to note in-migration too, said E.J. McMahon, founder and research director of the conservative Empire Center for Public Policy.", "The raw \"out\" number is misleading, McMahon said. Census data show that Florida lost even more people to other states — 470,977 in 2018 alone. Texas lost almost the same number. The crucial question is how many moved into those states, he said. Florida, which departing New Yorkers prefer over any other state, took in 587,261 from other states, for a net migration gain of 116,284.", "On the question of whether \"successful\" people leave, Professor Cristobal Young, who studies migration at Cornell University, said that people with incomes of $100,000 or greater do leave New York, but that their departure \"creates a vacancy in opportunity, that other people fill and prosper from.\"", "In 2017, from a base population of 3.7 million top earners, around 48,000 moved to New York, while around 84,000 left New York for other states, for a net out-migration of about 36,000, Young said.", "However, New York in general does not see a decline in top earners despite this migration, because the domestic production of top earners is very high, in other words, many more people become successful in New York, raising the number of top earners, he said.", "We did not rate Trump Jr.’s assertion that businesses are also leaving New York in droves, because comprehensive data on business moves between states are not available.", "\"In general, businesses don’t simply ‘leave’ any state in large numbers,\" McMahon said. \"When they are large enough, they can be sold to a firm in another state, or they expand into another state, or they contract or consolidate into another state, or they simply go out of business.\"", "A spokesman for Donald Trump Jr. declined to comment for this factcheck.", "Earlier this year, more than a quarter of New Yorkers surveyed told pollsters from Quinnipiac University that they expected that they would have to leave in the next five years for better economic opportunities elsewhere.", "The March poll found that 35 percent of voters surveyed expected they would have to leave. However, expecting to leave and \"fleeing\" are two different things. There are roughly 12 million registered voters in New York, and 35 percent is 4.2 million. Spread out over five years, that would be 16,000 people per week.", "Trump Jr. claimed people are leaving New York because of \"idiotic policies\" enacted by Cuomo. However, the reasons for migration are difficult to pin down. Earlier this year, PolitiFact Florida fact-checked why New Yorkers are drawn to Florida and did not find enough evidence to show to what extent taxes play a role. Some research suggests that family, the weather and jobs are prime motivators.", "Donald Trump Jr. tweeted that \"tens of thousands\" of people leave New York every week.", "Census data show that when counting only the people who move to other states, the number reached 8,808 per week on average in 2018. That figure falls to 3,915 when including the number of people moving into New York from other states.", "We rate Trump Jr.’s claim False.", "Tweet, @DonaldJTrumpJr, Nov. 1, 2019.", "The New York Times, \"Trump, Lifelong New Yorker, Declares Himself a Resident of Florida,\" Oct. 31, 2019. Accessed Nov. 5, 2019.", "New York Post, \"This is President Trump’s ‘Why I’m leaving New York’ essay,\" Oct. 31, 2019. Accessed Nov. 5, 2019.", "New York Post, \"Trump leaving New York is only a postscript on a long exodus of high earners,\" Edmund J. McMahon, Nov. 1, 2019. Accessed Nov. 5, 2019.", "U.S. Census Bureau, report, \"Moves to and From the South and West Dominate Recent Migration Flows,\" April 29, 2019. Accessed Nov. 5, 2019.", "U.S. Census Bureau, data, \"State-to-State Migration Flows,\" Tables for 2018, 2017. Accessed Nov. 5, 2019.", "Democrat and Chronicle, \"New Yorkers fleeing for Florida more than any other state,\" April 29, 2019. Accessed Nov. 5, 2019.", "PolitiFact Florida, \"Are New Yorkers really fleeing to Florida over taxes?\", March 29, 2019. Accessed Nov. 4, 2019.", "PolitiFact New York, \"It’s true: A lot of people are leaving New York,\" 2017. Accessed Nov. 5, 2019.", "Interview, Jason Conwall, spokesman, Gov. Andrew Cuomo, Nov. 5, 2019.", "New York State Department of Labor, Worker Adjustment and Retraining Notification Fact Sheet, July 2019. Accessed Nov. 6, 2019.", "New York State Department of Labor Worker Adjustment and Retraining Notification database, notices Oct. 28, 2018-Oct. 28, 2019. Accessed Nov. 6, 2019.", "Email interview, Jill Aurora, director of communications, state Department of Labor, Nov. 7, 2019.", "Email interview, Cristobal Young, Ph.D., associate professor, Department of Sociology, Cornell University, Nov. 8, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]