["About this rating", "In late January 2019, a chain message with the subject “Why Does Trump Want This Wall So Badly?” began to spread through inboxes, on social media, and on Reddit. The answer, according to an anonymous author, was that “the steel slats Trump wants to use ... are manufactured in the U.S. by a steel mill co-owned by a Russian-Israeli billionaire named Roman Abramovich.”:", "Why Does Trump Want This Wall So Badly? Answer: Roman Abramovich. The steel slats Trump wants to use for his \"Wall of Shame\" are manufactured in the US by a steel mill co-owned by a Russian-Israeli billionaire named Roman Abramovich.", "No surprise, Abramovich is close friends with Trump and Putin. Trump chose 480 sq ft steel rails for his newest \"design\" because Abramovich's mills are the only ones capable of producing them. This also explains why Trump put a tariff on steel from other countries. He eliminated any and all competition, guaranteeing Abramovich the contract.", "The Wall is not about security. It's a smoke screen. It is a shady business deal between Trump and Russia. It is about MONEY. When Trump is involved, it is always about money. He's lining his pockets, and the pockets of our enemies, while selling out hardworking Americans and our country. It just cannot be any clearer.", "These three paragraphs blended factual statements about Abramovich with unverified assertions to create a narrative at odds with reality. For this narrative to be true, each of the following statements would need to be true:", "It is true that Abramovich is a well-connected Russian oligarch with some ties to the Trump family, and it is true that Abramovich owns the only mill in the United States capable of producing 480-foot, steel rails (a product touted for its utility in the train industry). However, President Trump, who has changed his view multiple times on what his wall should look like, has not once made “480-foot steel rails” an immutable part of that plan. This conspiracy theory hinges primarily on that final false assertion.", "Roman Abramovich is a Russian-Israeli billionaire who, among other things, owns the Chelsea Premier League football club and is also the largest shareholder of the multinational, Russian-based steel company Evraz. After being granted Israeli citizenship in May 2018, Abramovich became the world's richest Israeli. He is identified as a Russian oligarch (based on his “closeness to the Russian regime and ... net worth”) and appears on a U.S. Treasury list produced as part of sanctions legislation President Trump reluctantly signed into law. Abramovich's presence on this list does not necessarily mean he is subject to U.S. sanctions, though.", "Abramovich is friendly with the Trump family, mainly through his wife, Dasha Zhukova. In 2014, Ivanka Trump and Jared Kushner spent four days in Russia at the invitation of Zhukova, where “they sat at the same table along with a few other people during a high-powered fundraising dinner for Moscow’s Jewish Museum,” according to Bloomberg. Jared Kushner, Bloomberg reported, had also been invested in an art business whose founding partner was Zhukova, and “Ivanka Trump, Kushner and his brother, Joshua, have accompanied Zhukova to sporting events in the New York area.” Zhukova, a Politico reporter noted, attended the Trump inauguration as a guest of Ivanka Trump.", "Abramovich’s steel background has inspired past speculation about possible quid-pro-quos between the Trump administration and Russia, and it is likely that this current Abramovich-border wall theory rests on the speculation caused by Abramovich’s factual involvement in the Keystone XL pipeline.", "On 24 January 2017, just days into his presidency, President Trump signed two executive orders: the first order reversed President Obama’s decision to revoke a permit for the Keystone XL Pipeline, and the second order mandated that, “to the maximum extent permitted by law,” the pipeline be made with steel “produced in the United States.”", "Evraz had already produced 40% of the steel for the existing sections of Keystone XL, the climate-focused DeSmog Blog reported, and Terry Cunha, a spokesperson for TransCanada, which is behind Keystone XL project, acknowledged to DeSmog that Evraz stood to benefit if construction resumed on the pipeline. Critics argued that the language in the “manufactured in the USA” executive order left significant room for Evraz to be the likely supplier of steel for Keystone XL should the project ever overcome its current legal hurdles, as Evraz operates three steel mills  in the United States.", "Those friendly relations, Abramovich’s influence over the global steel market, and previous Trump administration legislation beneficial to the oligarch’s interests created a strong factual base on which to build a flimsy fictional narrative. There is no question that any form of a border wall, regardless of design, will involve large quantities of steel which could theoretically be produced by a U.S.-based, Evraz-owned steel mill. But the supposed “smoking gun” link in support of the notion that the steel it will have to produced by Evraz is that President Trump’s latest wall machination supposedly requires the use of “480 sq ft steel rails” (which we interpret to mean “480-foot-long steel rails”, as the latter is actually a real commodity).", "Such a requirement would certainly be provocative, as it does appear that one Evraz-owned steel mill in Colorado is the only such facility within the United States capable of producing that length of rail. The train industry is quite interested in these super-long rail lengths, as they reduce the amount of welding required for track construction or repairs. In November 2006, the Denver Post reported on Evraz’s acquisition of the Colorado-based Rocky Mountain Steel company, stating that it would become the only American facility to produce those 480-foot-length rail sections:", "Portland-based Oregon Steel Mills Inc., owner of Rocky Mountain Steel Mills in Pueblo, [Colorado], announced it has agreed to be acquired by Russian steelmaker Evraz Group SA. ... The mill announced last week that it is considering building a new rail mill, which would be the first in the nation capable of making rails up to 480 feet long.", "The only problem? We have not identified a single instance of President Trump's stating a requirement that the border wall use 480-foot-length steel rails, nor have we found any rationale for why such a length would be efficacious in border wall construction. Trump’s descriptions of his proposed border wall have shifted repeatedly since it was first raised as a talking point on 5 August 2014, and such descriptions have never been heavy on technical specifics. During most of the 2016 presidential campaign Trump described his barrier as a concrete wall, but in an about-face he said in late 2018 that the wall would be made with “artistically designed steel slats,\" tweeting a rudimentary design of such a “Steel Slat Barrier” on 21 December 2018:", "A design of our Steel Slat Barrier which is totally effective while at the same time beautiful! pic.twitter.com/sGltXh0cu9", "— Donald J. Trump (@realDonaldTrump) December 21, 2018", "Using this schematic and some basic math, the Washington Post's Philip Bump calculated that the barrier proposed by President Trump in this version of his plans would be built using 28.4-feet-high by 10-inch-wide steel slats with 13-inch spikes on top, separated from each other by a 9-inch gap. None of this, to our ears, screams “480 sq foot steel rails.”", "The notion that Trump and Abramovich are corruptly colluding to provide a massive contract for a Russian-based steel company via a steel southern border wall (whose existence, let alone design, has yet to be approved in Congress) appears to be unfounded speculation rooted in a manufacturing requirement for the wall that Trump never actually stated.", "InsideTrack (Union Pacific Blog).   \"Long Rail Is a Game Changer.”\r\n    27 March 2015.", "Forbes.   \"#140 Roman Abramovich.”\r\n    Accessed 30 January 2019.", "Avriel, Eytan.   \"Israel's 30 Richest in 2018.”\r\n    Haaretz.   15 June 2018.", "United States Treasury.   \"Report to Congress Pursuant to Section 241 of the Countering America's Adversaries Through Sanctions Act of 2017 Regarding Senior Foreign Political Figures and Oligarchs in the Russian Federation and Russian Parastatal Entities. [Unclassified].”\r\n    29 January 2018.", "Fox News.   \"Senate GOP, Dems Agree on New Sanctions on Russia.”\r\n    13 June 2017.", "Baker, Stephanie et al.   \"Billionaire Ally of Putin Socialized with Kushner, Ivanka Trump.”\r\n    Bloomberg.   17 August 2017.", "Federal Register.   \"Construction of the Keystone XL Pipeline.”\r\n    24 January 2017.", "White House.   \"Presidential Memorandum Regarding Construction of American Pipelines.”\r\n    24 January 2017.", "Horn, Steve and Itai Vardi.   \"How a Russian Steel Oligarch and Putin Ally Is Profiting from the Keystone XL Pipeline.”\r\n    DeSmog.   13 February 2017.", "Kemp, John.   \"Trump Probably Can't Require Pipelines to Use U.S. Steel: Kemp.”\r\n    Reuters.   25 January 2017.", "Thompson, Jonathan.   \"A Judge Just Dealt a Potentially Fatal Blow to Keystone XL.”\r\n    High Country News.   15 November 2018.", "Hubbard, Russell.   \"To Boost Safety, Union Pacific Using Superlong Rail Lengths to Replace Worn Track.”\r\n    Omaha World-Herald.   30 June 2015.", "Dunn, Julie.   \"Parent of Pueblo Steel Mill Sold to Russian firm.”\r\n    Denver Post.   20 November 2006.", "Nixon, Ron, and Linda Qiu.   \"Trump’s Evolving Words on the Wall.”\r\n    The New York Times.   18 January 2018.", "Bump, Phillip.   \"Based on Trump’s Detailed Diagram of His Slat Wall, Here Is Some Advanced Mathematics.”\r\n    The Washington Post.   23 December 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]