["About this rating", "The IRS is opening tax filing season more than two weeks later than in 2020 due to tax law changes resulting from COVID-19 relief legislation, meaning those who typically file early will get tax refunds later than normal.", "However, the IRS anticipates that \"nine out of 10 taxpayers will receive their refund within 21 days of when they file electronically with direct deposit if there are no issues with their tax return.\"", "It's unclear how many taxpayers who file 2020 tax returns by the April 15 deadline will experience delays.", "On Jan. 6, 2021, the IRS announced that it would begin tax season on Feb. 12 — later than the usual end-of-January start — citing a change in tax law that came with a federal COVID-19 relief package passed in late 2020:", "The February 12 start date for individual tax return filers allows the IRS time to do additional programming and testing of IRS systems following the December 27 tax law changes that provided a second round of Economic Impact Payments and other benefits.", "This programming work is critical to ensuring IRS systems run smoothly. If filing season were opened without the correct programming in place, then there could be a delay in issuing refunds to taxpayers. These changes ensure that eligible people will receive any remaining stimulus money as a Recovery Rebate Credit when they file their 2020 tax return.", "As the above statement confirms, it is true that the IRS moved the opening of tax filing season from Jan. 27 in 2020 to Feb. 12 in 2021, a difference of more than two weeks. As noted above, the IRS cited changes to the tax law included in the second round of COVID-19 relief, signed by U.S. President Donald Trump on Dec. 27, 2020.", "But the statement adds:", "Overall, the IRS anticipates nine out of 10 taxpayers will receive their refund within 21 days of when they file electronically with direct deposit if there are no issues with their tax return. The IRS urges taxpayers and tax professionals to file electronically. To avoid delays in processing, people should avoid filing paper returns wherever possible.", "As CNBC reported, \"Normally, the filing period begins in late January, allowing early birds to submit their returns and get their refunds.\"", "Ed Zollars, a CPA and partner with the accounting firm Thomas, Zollars & Lynch in Phoenix, told CNBC, \"You can’t get your refund until the IRS opens filing, and there are people who get refunds who are used to filing as soon as they open up.\"", "We left a message for the IRS asking about potential delays in tax refunds, but didn't hear back in time for publication. It's inevitable that at least some people who typically file taxes in late January will experience a delay in receiving their return.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]