["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A duck’s quack does echo, despite a claim making the rounds on Facebook. It's just a little hard to hear.", "If a duck quacks in a forest and no one is around to hear it, does it echo? Not according to an Aug. 28 Facebook post claiming \"a duck’s quack doesn’t echo and nobody can figure out why.\"", "But online animal facts should be read with some skepticism — even if they come from a page that calls itself Knowable. This particular post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "That’s because a duck’s quack does echo, though it’s difficult to hear.", "Trevor Cox, an acoustic engineering professor at the University of Salford in Manchester, investigated the myth that a duck’s quack doesn’t echo when he heard from journalists asking him if it was true, according to a 2003 story in the Guardian.", "He conducted experiments with a duck named Daisy, which quacked in an anechoic chamber designed to suppress all sound reflection and in a reverberation chamber designed to produce an echo, and then tested his hypothesis running virtual trials in outdoor and concert hall conditions.", "Cox said he thinks the no-echo myth stems from the fact that a duck’s quack is relatively quiet and its echo just isn’t heard.", "But it’s not non-existent, and somebody figured that out.", "We rate this Facebook False.", "Facebook post, Aug. 28, 2019", "The Guardian, Acoustics professor proves ducks do echo, Sept. 8, 2003", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]