["About this rating", "On 14 August 2017, the right-wing Facebook page Hostility Against Tyranny posted a meme containing the following invented quotation by Democratic Congresswoman Maxine Waters:", "My fear is if North Korea nukes us, Trump gonna get us into a war.", "Two days later, right-wing web site Overpasses for America reposted the meme on Facebook. As of 18 August 2017, it had been shared more than 73,000 times on Facebook.", "The quotation is entirely fabricated. The meme does not present a source, and we could find no record of Maxine Waters ever having said this, despite searching the Congressional Record, an archive of her press releases and statements, and Google News.", "The obvious logical error (after a nuclear attack, the United States would naturally be at war) also indicates that this is no more than a fake quote designed to harm the Congresswoman's reputation.", "Maxine Waters has been the target of several previous fake stories and fabricated quotes. This one was likely inspired by a 10 August 2017 interview with the entertainment and gossip web site TMZ, which attracted criticism from some conservatives.", "The California Congresswoman advocated diplomacy as a solution to the current North Korean crisis, prompting Townhall to report that \"Maxine Waters Thinks U.S. Should Give North Korea 'Things That They're Asking For.'\" (This article was later republished by Fox News.)", "Although she did open the door to such an outcome, what she actually said was that, in the context of an effort to deescalate tensions and reduce the risk of nuclear war, American diplomats should consider whether it might be possible for North Korea to get certain \"things that they're asking for.\"", "Whether or not you share Maxine Waters' preference for a negotiated resolution to the current crisis, it's worth noting that all successful agreements necessarily end with each side getting something they want.", "TMZ.  \"Congresswoman Maxine Waters: 'Avoid War With North Korea at All Costs.'\"\r\n  TMZ.com.  10 August 2017.", "Barkoukis, Leah.  \"Genius: Maxine Waters Thinks U.S. Should Give North Korea 'Things That They're Asking For.'\"\r\n  Townhall.  11 August 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]