["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Federal law recognizes marriage across the board, but benefits for civil unions are spottier", "No other state recognizes the term “domestic union”", "Critics of a bill that would have replaced Missouri marriage licenses with \"contracts of domestic union\" said it was an end-run around the 2015 U.S. Supreme Court decision legalizing same-sex marriage.", "The bill’s sponsor, Rep. Adam Schnelting, R-St. Charles, said he just wants the government out of the marriage business.", "The bill, HB2173, which died in the House Rules Committee on March 5, also would have eliminated the mandate requiring a judge or minister to perform a ceremony solemnizing the marriage. Schnelting does not know whether he will reintroduce the bill in next year's session.", "In pushing the changes in a Missouri Times op-ed last month, Schnelting wrote \"HB2173 does not alter state or federal benefits.\"", "We reached out to Schnelting and asked him how it could be guaranteed that domestic unions, which have no federal definition, could qualify for federal benefits.", "Schnelting responded that contracts of domestic union are the legal equivalent of marriage and \"treats everyone equally under the law.\"", "That’s a big claim. Our research shows it doesn’t pan out.", "Problems begin with the phrase \"domestic union.\"", "The state and federal governments define marriage as a legal contract between two spouses. That contract opens the door to an expansive list of federal benefits including Social Security, Medicare, joint tax returns and employment benefits.", "Schnelting and his bill define a domestic union as the legal equivalent of marriage. But there is no other state that recognizes that term.", "So, let’s consider alternatives: Groups that condemn the bill for undermining marriage equality such as the Missouri chapter of The American Civil Liberties Union and PROMO, an LGBTQ advocacy group, have focused on existing terminology of \"domestic partnerships\" and  \"civil unions.\"", "Both include two individuals who consistently live together and have a personal relationship. These marriage-alternative unions were often utilized by same- sex couples seeking legal benefits prior to the 2015 Supreme Court ruling.", "Unlike marriage, civil unions and domestic partnerships are not recognized in all 50 states. They are also not recognized by the federal government and thus are not eligible for most federal benefits.", "In states where domestic partnerships and civil unions are recognized, individuals can receive benefits that parallel those of marriage such as healthcare benefits from employers. These benefits differ greatly by state.", "Following the Supreme Court ruling, several states including New Hampshire, Delaware and Connecticut converted all civil unions into marriages.", "Domestic unions, like civil unions and domestic partnerships, are not recognized under federal law, so eligibility for federal benefits depends on the state.", "For example, the United States Social Security Administration’s website states it recognizes \"some\" civil unions and domestic partnerships for determining entitlement  to Medicare, Social Security and Social Security Income. However, it recognizes marriages in all states.", "The Department of State also does not consider individuals in domestic partnerships or civil unions as spouses for immigration purposes.", "Additionally, the Internal Revenue Service does not consider civil unions or domestic partnerships as married for purposes of federal tax benefits. These marriage alternative unions cannot apply for joint tax returns.", "We couldn’t find any example of marriage benefits specific to Missouri that would be affected.", "Schnelting wrote that replacing marriage licenses with domestic union contracts \"does not alter state or federal benefits.\"", "While domestic unions could be recognized in Missouri as legally equivalent to marriage, there is no guarantee that the other states would recognize the union, or the dissolution of the union as such. And, with no federal definition, there is also nothing in federal law qualifying domestic unions for the expansive list of spousal benefits, privileges and rights.", "With that, we rate this claim Mostly False.", "Missouri House of Representatives, \"House Bill No. 2173,\" February 24, 2020", "The Missouri Times, \"Opinion regarding the matter of HB 2173,\" February 24, 2020", "Email Interview, Daneille Spradley, Digital Communications Associate for ACLU Missouri, March 2, 2020", "National Conference of State Legislators, \"Civil Unions and Domestic Partnership Statutes,\" July 25, 2019", "PROMO, Facebook,, February 17, 2019", "NOLO, \"Marriage Rights and Benefits,\" February 26, 2020", "The City of St.Louis, \"Domestic Partnership Registry,\" February 27, 2020", "FindLaw, \"Same-Sex Marriage, Civil Unions, and Domestic Partnerships,\" February 26, 2020", "Missouri Revisor of Statutes, \"Marriage, validity and Recognition,\" February 28, 2020", "Justia, \"Domestic Partnerships and Civil Unions,\" March 4, 2020", "The United States Social Security Administration, \"Same-Sex Couples,\" March 8, 2020", "The United States Department of State, \"US Visas for Same-Sex Spouses,\" March 9, 2020", "The International Revenue Service, \"Answers to Frequently Asked Questions for Registered  Domestic Partners and Individuals in Civil Unions,\" March 8, 2020", "ACLU of Missouri, Twitter, February 26, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]