["“KZN Counselor launching safety lights Emahlabathini. ANC is very disrespectful,” reads a March 28 Facebook post, along with three images of a ribbon-cutting ceremony outside a hut.", "The photos have also been used in various articles (here's an archive link to one of them) falsely claiming that they show a mud hut commissioned by an unnamed Kenyan politician to rehouse a widow.", "Another post claimed the photos were taken in Nigeria.", "On Twitter, a post sharing the photos -- retweeted more than 1,000 times -- proposed that a competition should be held between politicians in Kenya and Nigeria for the ‘stupidity crown’.", "In fact, the photos show the Tanzanian Minister of Energy, Medard Kalemani, during a visit to the northwestern Kigoma region of the country. His ministry had tweeted two of the photos on March 26.", "The Swahili tweet from the official account, which is linked to from the ministry website, quotes Kalemani as saying that every Tanzanian citizen has the right to access electricity and urges contractors not to discriminate against residents based on where they live.", "\"Wakandarasi wa umeme msibague makazi ya wananchi wakati wa uunganishaji umeme vijijini. Kila mwananchi ana haki ya kupata umeme\". Waziri wa Nishati, Dkt Medard Kalemani\n\t\t# ziarani Kigoma. pic.twitter.com/bFsDNjeeOt", "All three photos were posted Jamiiforums.com, a Tanzanian message board site, on March 28, in a post that said they showed an electricity project.", "A statement posted on the Tanzanian energy ministry’s website said that Kalemani toured the Kasulu District, Kigoma Rural and Buhigwe district in northwestern Tanzania to inspect the third phase of a rural electricity distribution project. Kalemani also officially launched the connection of electricity in some villages during his tour.", "South Africa is set to hold a general election  in a little over a month on May 8, and the looming date has come with the spread of more politically-motivated misinformation.", "Report any #SAElections2019 digital disinformation at our new online platform, https://t.co/OXup5Lhy53. This includes any false, inaccurate or misleading info designed to affect participation in & the outcome of the elections. Disinformation destroys democracy. Report it! pic.twitter.com/86egAdlQih", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]