["“And once Trump’s gone and we have regained our rightful place in the White House, look out if you supported him and endorsed his actions, because we’ll be coming for you next,” reads a quote attributed to Harris in Facebook posts shared on August 11, 2020.", "“After We Impeach, We Round Up the Trump Supporters,” more ominous versions of the quote add.", "While most social media posts using the quote in August 2020 claimed that Harris made her vengeful promise on April 30, 2020, some alleged the quote was from June 18, 2020.", "The same quote had already made rounds on social media in August 2019, but was not real then and is not real in 2020.", "The quote was invented for an article published on August 7, 2019 on the satirical news website, bustatroll.org.", "The fictional piece claimed: “While giving a speech on the effectiveness of zero punishment prosecutions, she (Harris) veered off script to talk about impeaching our president and describe in detail one ‘crime’ she would not hesitate to punish.”", "“Everything on this website is fiction,” a disclaimer warns on the website’s “About Us” section.", "The disclaimer adds that bustatroll.org “is a subsidiary of the ‘America’s Last line of Defense’ network of parody, satire, and tomfoolery.” The ambiguous nature of this network’s tone has led much of its content to be taken seriously by online users.", "There are no records of Harris at a Democrat fundraiser for Criminal Justice Reform on April 30, 2020. Harris’s public communications that day focused on legislation aiming to combat racial and ethnic disparities caused by the COVID-19 pandemic.", "There is also no evidence Harris said the quote on June 18. Her main public appearance that day focused on a Supreme Court ruling blocking Trump’s attempt to end the Deferred Action for Childhood Arrivals program.", "After Biden announced Harris as his running mate on August 11, 2020, making her the first black and Asian-American vice-presidential candidate, AFP Fact Check also found posts falsely suggesting that the California senator could not be president because her parents were born outside the US.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]