["About this rating", "The 2020 Iowa caucuses on Feb. 3, 2020, didn't go quite as smoothly as organizers had hoped. Issues with a new app-based reporting system led to delays and confusion about the final results. To make matters worse, organizers had to deal with an influx of prank calls from internet trolls.", "NBC News reported:", "The phone number to report Iowa caucus results was posted on a fringe internet message board on Monday night along with encouragement to “clog the lines,” an indication that jammed phone lines that left some caucus managers on hold for hours may have in part been due to prank calls.", "Shortly after the caucuses ended on Feb. 3, and just as news started to break that there were problems with the final results, messages started to appear on the internet forum 4chan urging people to call the number for Iowa caucuses reporting and clog the lines:", "The exact intent of these calls varied from one person to the next. Some of the posts on 4chan stated that they were trying to tie up the lines in order to further delay the results.", "One person wrote:", "\"Clog the lines, make the call lads, after 54 minutes they answered and l was able to tie up the call another ten minutes with the woman who answered because she called me sir and l demanded to speak to a supervisor who would use my correct pronouns of \"they /them\" before l would report my caucus results. Im currently on hold with my second clogging phone call, the music they play is a nice little guitar jam.\"", "Others suggested that they should report fake results. One user thought it would be funny to report 1,488 votes for Andrew Yang (the number 1488 is the combination of two white supremacist symbols: \"14\" is short hand for the 14-word slogan and \"88\" stands for \"Heil Hitler,\" or the eighth letter of the English alphabet).", "Others seemed to be solely interested in causing chaos. For instance, at least two people claimed that they called the hotline and then called the person who answered the phone a racial slur.", "While it's not possible to definitively determine the political affiliations of those involved with this stunt (users on 4chan are anonymous), it's clear that most had an anti-Democrat agenda.", "Mandy McClure, the communications director for the Iowa Democratic Party, said that the group experienced an \"an unusually high volume\" of calls and that some of the callers appeared to be \"supporters of President Trump.\"", "Bloomberg reported:", "On Thursday morning, the Iowa Democratic Party confirmed it “experienced an unusually high volume of inbound phone calls to its caucus hotline,” which included “supporters of President Trump who called to express their displeasure with the Democratic Party.”", "“The unexplained, and at times hostile, calls contributed to the delay in the Iowa Democratic Party’s collection of results, but in no way affected the integrity of information gathered or the accuracy of data sets reported,“ the party statement said.", "While supporters of U.S. President Donald Trump may have been involved in this prank, no evidence exists that this act of sabotage was directed by the Trump campaign. Tim Murtaugh, a spokesperson for the Trump campain, told Bloomberg:", "\"Don’t know anything about that but maybe Democrats should consider using an app of some kind next time. Democrats are engulfed in the worst election embarrassment in modern history and they’re looking for someone to blame. It’s pathetic.\"", "As both Murtaugh and the Iowa Democratic Party noted, these calls weren't the sole problem with the Iowa caucuses, and no evidence exists that these calls impacted the final results. Rather, it appears the calls were more of a nuisance and may have contributed to a longer delay in the final vote count.", "Here are a few other messages we found on 4chan promoting this \"prank.\"", "Collins, Ben; Barrett, Maura; Hillyard, Vaughn.   \"'Clog the Lines': Internet Trolls Deliberately Disrupted the Iowa Caucuses Hotline for Reporting Results.\"\r\n    NBC News.   5 February 2020.", "Pager, Tyler and Jennifer Epstein.   \"Trump Fans Flooded Iowa Caucus Hotline, Democrats Say.\"\r\n    Bloomberg.   5 February 2020.", "Raymond, Adam.   \"Iowa Dems: Pro-Trump Trolls Clogged Phones Lines, Worsening Caucus Debacle.\"\r\n    The Intelligencer.   6 February 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]