["“Forest fires are caused by poor management. Not by climate change,” says one post, shared more than 12,000 times on Facebook since September 9, 2020. It says the Creek Fire and other blazes in California are the result of failures to clear “brush and dead overgrown trees” from the land.", "A second post, also shared more than 12,000 times on the social network, attributes the fires to “bad forestry practices” and “not the climate change hoax.”", "And a third post writes off global warming as a factor in the wildfires, blaming a “total lack of forest maintenance” for the devastation.", "The posts reflect a political divide on the disaster. Democrat-run California is sharply at odds with Trump, a Republican and climate change skeptic.", "One Facebook post shared cartoons suggesting that Democrats and “left-wing environmentalists” have blocked the “logging or brush clearing” that has turned forestlands into “dangerous firetraps.”", "The online posts mirror comments from Trump who, during a visit to Sacramento, California, attributed fires there and along the West Coast to “forest management” and failures by local authorities to rake forest floors and clear dead timber.", "In a testy exchange with officials in California, who asserted that climate change had contributed towards the fires, Trump responded: “I don’t think science knows, actually.”", "But independent research endorsed by the federal government in the US National Climate Assessment in 2018 says otherwise. The study said that “climate change is altering ecosystems and their services through major vegetation shifts and increases in the area burned by wildfire” in the southwest.", "Experts on climate, fires and weather patterns told AFP that the blazes in California, Oregon and Washington were down to multiple factors, but that global warming had played a central role.", "Noah Diffenbaugh, a climate professor at Stanford University, cited the National Climate Assessment from two years ago, and said poor forest management alone could not explain the tenfold increase in land being burned across the western US these past four decades.", "“It is not true that global warming is playing no role,” he said by phone.", "“Research indicates that around half of that increase in area burned is due to long-term warming through the effects of temperature on the dryness of the vegetation.”", "Meanwhile, Diffenbaugh added, more people are moving from towns to rural areas, increasing the likelihood of accidental fires -- highlighted by the ongoing El Dorado blaze in southern California, which was triggered by a firework at a family event.", "Michael Goss, an earth sciences researcher at Stanford University, said via email that “warmer, drier conditions brought about by climate change, and associated drying of fuels, absolutely increases the risk of fast, destructive wildfire spread in California.”", "And Bruce Riordan, director of the Bay Area Climate Adaptation Network in northern California, said by email that while some fires are raging through woodlands “many have been in grasslands and other vegetation regimes that have nothing to do with forest management.”", "West Coast infernos have burned more than five million acres this year and killed dozens of people.", "Scott Stephens, a fire science professor at the University of California at Berkeley, said via email that better forest management “would enable more of our forests in California to withstand fire and climate change.”", "Still, he added: “Climate change is certainly real and is impacting fire here.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]