["After Cyclone Amphan hit large parts of coastal areas in India and Bangladesh this month, an image of a dilapidated road started circulating on social media. Twitter user Rezwan posted the image with the message, “Cyclone #Amphan ripped off road carpeting in rural Bangladesh. Is it the power of the winds or poor construction to blame?”", "Another user NH Pranto tweeted the same image without mentioning any country. On May 23, Facebook page Shantipur posted the image with the Bengali message, “এই প্রথম দেখলাম ঝড়ে রাস্তা উড়িয়ে নিয়ে চলে গেছে..”. The post has been shared more than 2,500 times.", "Alt News has also received fact-check requests on its mobile application.", "With the help of Google reverse image search, Alt News found that the image was posted by Malaysia-centric Facebook pages (1, 2) in December 2019.", "Ni la salah orang melayu Kalau pakai siper tu Bile berjalan. Kaki tu jangan la seret Kimak punye asadi", "Posted by LANDO Zawawi – Brotherhood Malaysia on Thursday, 26 December 2019", "The image on the left – image shared as of damaged roads in Bangladesh – has been juxtaposed with the image on the right – image shared by Malaysian pages in December 2019 – in the comparison posted below.", "While we are unable to establish the context and the origin of the image, it is evident that it is unrelated to the recent Cyclone Amphan in Bangladesh as it was first shared on social media by Malaysia-centric Facebook pages.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]