["About this rating", "It's true that Burger King posted the message \"Women belong in the kitchen\" on Twitter on International Women's Day 2021; however, it was only the first tweet in a three-tweet thread announcing a new scholarship program for aspiring female chefs.", "However ham-handed its execution, in context the tweet wasn't necessarily inappropriate for International Women's Day, given that its spirit was ironic and the full thread announced a program to uplift women in the restaurant industry.", "On March 8, 2021, the official United Kingdom Burger King Twitter account posted an oddly misogynistic-seeming message in celebration of International Women's Day. Burger King wrote: \"Women belong in the kitchen.\"", "While this message appeared quite sexist at first glance — fast food rival KFC even responded via their \"KFC Gaming\" account with a message telling Burger King to delete their tweet. The attention-grabbing message was just the first in a three-tweet thread in which the company announced a new scholarship for aspiring female chefs.", "Here's Burger King's full thread:", "Burger King wrote:", "Women belong in the kitchen.", "If they want to, of course. Yet only 20% of chefs are women. We're on a mission to change the gender ratio in the restaurant industry by empowering female employees with the opportunity to pursue a culinary career. #IWD", "We are proud to be launching a new scholarship programme which will help female Burger King employees pursue their culinary dreams!", "It appears that many people may have missed the other two messages in Burger King's thread. At the time of this writing, Burger King's \"women belong in the kitchen\" tweet has been retweeted more than 125,000 times. The other two messages have less than 10,000 tweets combined.", "When KFC Gaming, the Twitter account for the restaurant chain's gaming division (yes, KFC has their own console), called out Burger King for this seemingly sexist tweet, Burger King elaborated on what they were trying to accomplish with this message. In short, it was kind of a bait and switch. This sexist message was supposed to bring attention to the fact that the culinary industry is comprised mostly of men.", "Burger King truly did post \"Women belong in the kitchen\" on International Women's Day in 2021. This attention-grabbing tweet was the first message in a three-tweet thread in which the restaurant announced a scholarship program for aspiring women chefs -- in hindsight, perhaps not the best to to frame such an announcement.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]