["The photo was published here on Facebook on January 11, 2020.", "It shows a photo of a crowd at a rally. One woman can be seen carrying a placard that reads: “DUTERTE FOR US PRESIDENT! MAKE AMERICA GREAT AGAIN”.", "Below is a screenshot of the misleading post:", "The Tagalog-language caption translates to English as: “Look: Americans really want President DUTERTE to be their leader!!! The americans clamor: ‘DUTERTE, PLEASE SAVE AMERICA!’”", "The same photo was also published here and here on Facebook, alongside a similar claim.", "The claim is false; the image has been doctored from a photo of an anti-government protest in Washington DC in 2009.", "A reverse image search on Google combined with a keyword search found this entry on the conservative blog “Looking at the Left”, published September 12, 2009.", "The post reads, in part: “Protesters flooded Washington today in what people in the crowd are calling 'a conservative Woodstock'.\"", "\"This event had been promoted as a taxpayer 'tea party' but the crowd’s concerns were wide ranging”.", "Below is a screenshot of the post:", "The photo caption reads: “In the very center of the photo, above the Silence is Consent – Can You Hear Us Now sign, you can see Pennsylvania Ave., which at this time is totally blocked with protesters who cannot move forward to the Capitol area. Sorry, full up.”", "Below is a screenshot comparison of the doctored photo in the misleading posts (L) and the photo in the 2009 blog post (R):", "This hoax, featuring the same doctored photo, has circulated on social media since at least September 2016. It was debunked here and here by social media users.", "Philippine media organization Vera Files also fact-checked the photo in this January 22, 2020 report.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]