["About this rating", "Spurned lovers seeking revenge on Valentine’s Day have an opportunity for one more jab at their former partners during the 2021 “Cry Me a Cockroach!” event hosted by the San Antonio Zoo.", "The second annual fundraising event offers participants the opportunity to name a cockroach or rodent after their ex-partners before the animals are fed to larger predators.", "“You will be able to symbolically name a cockroach after your ex, and we will serve it up as an enrichment treat to one of our animals for only $5,” wrote the zoo. “If your ex was a snake, you can name a pre-frozen rat after them, and we will feed it to a reptile for $25!”", "https://www.youtube.com/watch?v=qsou_6acfnU&feature=youtu.be \n\nThe non-profit San Antonio Zoo is operated by the San Antonio Zoological Society, and the wildlife facility went viral in 2020 when it hosted its inaugural feeding frenzy fundraiser. And in 2021, not only will participants have the ability to name a rodent after their ex, but they will be able to watch it being devoured live on Valentine’s Day on the zoo’s Instagram, Twitter and Facebook pages.", "As of this writing, Digital Marketing Manager John Garcia said that there were 993 total donors, though he said that the number continued to increase with every data refresh. Of those, 764 donations were for roaches, 209 for rats and 20 for vegetables. By comparison, the zoo received more than 5,300 donations for its 2020 fundraiser.", "You can order your cathartic creepy crawlies here:", "Update [Feb. 1, 2021]: This article was updated to include the total number of donations to the fundraiser.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]