["About this rating", "On June 15, 2020, a screenshot of an actual Craigslist advertisement seeking \"Excited and enthusiastic MINORITY Actors and Actresses\" to \"hold signs\" at an event in Tulsa, Oklahoma began to make the rounds on social media.", "Twitter users attempted to make the connection that the ad was hiring minorities to work at President Donald Trump's upcoming rally, which was re-scheduled for June 20, 2020, after it was originally planned for Juneteenth, a day commemorated as the end of slavery in the United States. The announcement of the rally's location also sparked controversy because Tulsa was the site of the 1921 massacre of hundreds of Black people by a white mob.", "The ad also placed the location for the gig at \"Third St near Denver Ave,\" which is across the street from the Bok Center where Trump's rally will be held. The ad also offered $10 as compensation, but it's unclear whether that amount is hourly, or for one day of work.", "While many factors connect the ad to the location and date of the Trump rally, Snopes is unable to contact the original source for the ad, and thus can't determine whether this was an attempt to hire actors with minority backgrounds to hold up signs at the rally.", "The ad was taken down by Craigslist administrators on June 15, 2020. Snopes was unable to contact the person who posted the ad, but has contacted Craigslist for comment, and will update this post if we receive a response.", "As of June 15, the page said \"This posting is being held for review.\" On June 16, it was flagged for removal, presumably for a terms of use violation:", "Social media posts calling out supposed Craigslist ads that solicit paid actors to show up as supporters frequently pop up before Trump rallies. Snopes identified one from November 2019 as \"Unproven.\" We also investigated others from July 2016 and August 2017 that were rated \"Unproven,\" and one from October 2018 we rated as \"False.\"", "Since we are unable to prove whether the Craigslist ad seeking minority actors and actresses is in any way connected to the Trump rally being held on the same date, we rate this claim \"Unproven.\"", "DonaldJTrump.com.   \"Make America Great Again! Rally - Tulsa, OK.\"\r\n   20 June 2020.", "Emery, David.   \"Did a Craigslist Ad Solicit Paid Attendees to Donald Trump’s Rally in Erie, Pennsylvania?\"\r\n   Snopes.   13 October 2018.", "Huberman, Bond.   \"Did a CraigsList Ad Seek Actors to Play Trump Supporters in Phoenix?\"\r\n   Snopes.   22 November 2019.", "Lacapria, Kim.   \"DNC Hiring ‘Actors’ via Craigslist to Replace Delegates.\"\r\n   Snopes.   27 July 2016.", "Macguill, Dan.   \"Was a Crowd Hire Company Involved in Protests Against a White Supremacist Rally?\"\r\n   Snopes.   15 August 2017.", "Reston, Maeve.   \"Trump Makes a Rare Retreat by Rescheduling Juneteenth Rally in Tulsa.\"\r\n   CNN.   13 June 2020.", "Schneider, Dan.   \"1-800-HIRE-A-CROWD.\"\r\n   The Atlantic.   22 July 2015.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]