["It's not often that we can check a Miss USA contestant with our Truth-O-Meter. So when Miss California USA Carrie Prejean, the runner-up in the Miss USA competition, likened her much-discussed, pageant-night response to a question about gay marriage to President Barack Obama's beliefs, we decided it was time.", "The similarity of the statements made by Miss California and Obama was raised during a May 12 news conference in which pageant owner Donald Trump announced that Prejean could retain her crown as Miss California USA even though she failed to reveal she had posed in her underwear as a teenager. The Donald also came to Prejean's defense about her gay marriage comments.", "\"It's the same answer that the president of the United States gave,\" Trump said. \"She gave an honorable answer. She gave an answer from her heart.\"", "Said Prejean: \"I was given a question asking for my opinion and I stated my honest belief. Not only do I hold this belief but, as Mr. Trump said, the president of the United States, the secretary of state and many Americans agree with me in this belief.\"", "Let's roll the tape on Prejean's statement during the Miss USA competition on April 19, 2009.", "One of the celebrity judges, Perez Hilton, asked whether other states should follow Vermont's lead in legalizing same-sex marriage.", "Here's the part of Prejean's answer that matters: \"I think in my country, in my family, I think that I believe that a marriage should be between a man and a woman. No offense to anybody out there, but that's how I was raised.\"", "Controversy followed.", "So let's see how that stacks up to Obama's stated position on same-sex marriage:", "* \"You know, I believe that marriage is between a man and a woman.\" (an interview with ABC's Jake Tapper, June 16, 2008)", "* \"I believe that marriage is the union between a man and a woman. Now, for me as a Christian, it's also a sacred union. You know, God's in the mix.\" (an interview with Rev. Rick Warren, Aug. 16, 2008)", "* \"I believe marriage is between a man and a woman. I am not in favor of gay marriage.\" (an MTV interview, Nov. 1, 2008)", "Sounds about the same to us.", "Now, we should note that with all of these quotes during the presidential campaign, Obama quickly followed up by noting his support for civil unions.", "The Jake Tapper interview is as representative of Obama's fuller position as any. In it, Obama said, \"I'm a strong supporter of civil unions. ... You know, I believe that marriage is between a man and a woman, but I also think that same-sex partners should be able to visit each other in hospitals, they should be able to transfer property, they should be able to get the same federal rights and benefits that are conferred onto married couples. And so, you know, as president, my job is to make sure that the federal government is not discriminating and that we maintain the federal government's historic role in not meddling with what states are doing when it comes to marriage law.\"", "Compare that to Prejean's comments to Fox's Greta Van Susteren on April 30.", "\"My thought on civil unions? You know what, Greta, I don't have the answers to everything. I'm not running for political office. I don't have the answers to everything, you know, in the world out there. But I think that there should be rights for people, you know, especially in California. I think that people that are homosexual should have some rights, you know, hospital rights, and things like that.\"", "Granted, her answer may not be as nuanced as Obama's. As she said, she's not running for public office. Still, her fuller position also sounds an awful lot like Obama's.", "But what Prejean said after the pageant isn't the issue. Prejean and The Donald said the position she took the night of the pageant is consistent with President Obama's position. And we rate that claim True.", "Politico,\n\n\"Donald Trump on Miss California: Same as Barack Obama\"\n\nby Alexander Burns, May 12, 2009", "YouTube,\n\n\"Miss USA California Responds To Gay Marriage Question From Perez Hilton,\"\n\nApril 19, 2009", "MTV.com,\n\n\"Barack Obama Answers Your Questions About Gay Marriage, Paying For College, More,\"\n\nby Chris Harris, Nov. 1, 2008", "ABC News,\n\n\"Transcript: Jake Tapper Interviews Barack Obama,\"\n\nJune 16, 2008", "CNN.com,\n\nSaddleback Presidential Candidates Forum\n\n, Aug. 17, 2008", "Chicago Tribune, \"Obama would consider missile strikes on Iran,\" by David Mendell, Sept. 25, 2004", "Fox News, \"On the Record\" interview of Prejean by Greta Van Susteren, April 30, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]