["On February 21, Uttar Pradesh Chief Minister Yogi Adityanath joined the BJP’s Vijay Yatra organised in Kasaragod, Kerala. A picture showing a massive crowd of people forming a human flag in the shape of a lotus is widespread on social media. It was claimed that the BJP’s symbol was formed to welcome Adityanath in Kerala. BJP leader Manish Singh tweeted the photo but later took it down.", "Twitter user Apurva Singh wrote, “Lotus is blooming. #KeralaWelcomesYogiJi”. Her tweet gained over 2,000 retweets and more than 12,000 likes as of this writing. It was later deleted but an archived link can be found here.", "Several others have shared the picture with the hashtag #KeralaWelcomesYogiJi.", "This slideshow requires JavaScript.", "A keyword search led us to a report by The Indian Express published on April 7, 2015. “To celebrate its 35th foundation day, the BJP created a spectacle at a college ground in Dahod by forming a huge party flag with around 25,000 supporters.” The human flag was therefore formed in Gujarat six years ago on the BJP’s foundation day.", "The Quint had uploaded a video report on the celebrations.", "An image of BJP workers who formed a human flag in Gujarat in 2015 has been shared with the false claim that the flag was formed to welcome Yogi Adityanath in Kerala.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]