["This post was published on Facebook on March 26, 2020. It has been shared some 420 times.", "The text reads, in part: “Coronavirus: All Hope is not lost!", "“Observations have made scientists and medical experts come up with the knowledge that the pH (acidic or alkalinity level) for corona virus to survive in the body varies from 5.5 to 8.5.", "“Therefore, to beat corona virus, we need to take more of an alkaline foods/fruits that are above the pH level of the virus.", "“Some of them are:\n\t*Lemon - 9.9pH*\n\t*Lime - 8.2pH*\n\t*Avocado - 15.6pH*\n\t*Garlic - 13.2pH*\n\t*Mango - 8.7pH*\n\t*Tangerine - 8.5pH*\n\t*Pineapple - 12.7pH*\n\t*Dandelion - 22.7pH*\n\t*Orange - 9.2pH*", "“How do you know you have coronavirus?\n\t1. *Itchy throat,*\n\t2. *Dry throat,*\n\t3. *Dry cough.*\n\t4. High temperature\n\t5. Shortness of breath", "“So if you notice these symptomsin [sic] you or someone near you:\n\t* QUICKLY squeeze in lemon juice into warm water and drink it.", "“*Constantly feed on the alkaline fruits/food mentioned above.”", "The text was published with an unrelated picture of Russian President Vladimir Putin attempting to put on gloves with the assistance of a person in a hazmat suit.", "Below is a screenshot of the misleading Facebook post:", "The claim was shared in multiple languages on other Facebook posts, including here, here and here; on Twitter here, here and here; and on YouTube here.", "However, the claim is false; health experts say there is no evidence that eating alkaline foods can help prevent or cure COVID-19.", "As of April 2020, the WHO states there is no “cure” for COVID-19.", "“While some western, traditional or home remedies may provide comfort and alleviate symptoms of COVID-19, there is no evidence that current medicine can prevent or cure the disease,” it said.", "Professor Dr Lee Yeong Yeh, a gastroenterologist at the School of Medical Sciences, Universiti Sains Malaysia, told AFP by email on April 10, 2020, the claim in the misleading posts was “absolutely false”.", "“Eating alkaline foods does not alter pH in human cells or the virus,” he said. “Alkaline diet, typically vegetables and fruits, provides potassium and magnesium in addition to fibres and prebiotic properties. However, the diet won’t affect cellular pH since pH is highly regulated by the cellular system. Viruses like SARS-CoV-2 that causes COVID19, depends on cellular pH to reproduce. Certain drugs may affect cellular pH and therefore help in killing the virus but diet does not. Furthermore, the foods described in the rumour were not exactly alkaline. It is more important to eat healthy and balanced foods, and by doing so, it will help the body immunity.”", "Associate Professor Dr Chan Yoke Fun, a virologist and senior lecturer at the Department of Medical Microbiology, Faculty of Medicine, University of Malaya, told AFP by email on April 10, 2020 that consuming alkaline foods would have no impact on the virus if someone becomes infected with it. “SARS-CoV-2 is extremely stable at pH 3 to 10 and will not be readily destroyed at those pH,” she said. “Therefore, if we are infected, the virus will still multiply despite whatever pH of food or water you consume.\"", "Dr Cory Couillard, a risk communication consultant from the WHO, also told AFP by email on April 17, 2020, that there is not “sufficient data” to prove “an alkaline diet can protect specifically against COVID-19 or not”.", "“However, eating a healthy and nutritious diet helps your immune system to function properly,” he said. “Fruits and vegetables are an important part of eating healthy. WHO recommends consuming a minimum of 400g (i.e. five portions) of fruits and vegetables per day.”", "The WHO has released food and nutrition tips for those who are undergoing self-quarantine and isolation, which includes recommendations on types of foods to consume for a healthy diet.", "While most of the symptoms of COVID-19 listed in the misleading post are genuine, here are some of the most common ones according to WHO.", "The misleading post also provides a purported range of pH for certain foods, but the pH levels cited are incorrect.", "For example, the post states lemon has a pH level of 9.9, but according to the United States Geological Survey (USGS), it has a pH level of 2, making it acidic.", "According to the USGS website, “pH is a measure of how acidic/basic water is... The range goes from 0 - 14, with 7 being neutral. pHs less than 7 are acidic while pHs greater than 7 are alkaline (basic)”.", "Below is a screenshot of a pH scale on the USGS website:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]