["In the wake of protests against the Citizenship Amendment Act (CAA), an image of Assam Chief Minister Sarbananda Sonowal where he is being escorted by security personnel is getting circulated on social media. Facebook user Rajiv Tyagi posted the photograph with the claim that he had to escape from his residence’s terrace.", "A few more individuals on Facebook posted the same image with a similar claim. A tweet by one Aakash has garnered close to 200 retweets.", "अपने ही घर के पिछवाड़े से भागते इस व्यक्ति को पहचानते हैं..?", "हिंट : एक राज्य के मुख्यमंत्री हैं।#AssamRejectsCAB #CABAgainstConstitution #CAB_नहीं_चलेगा pic.twitter.com/Hdnc0jKYIN", "— Aakash_UK (@Aakash_UK) December 13, 2019", "We found that the image has a watermark of Assamese news channel Prag News. Subsequently, Alt News did a relevant keyword search (“inspection Sonowal”) on their YouTube channel and found a video posted on May 1, 2019. The chief minister was on a visit to JICA project in Guwahati. The project aims to provide clean drinking to the people of the city. At 32 seconds in the video, one can find the same frame which is circulating on social media.", "Here is a screenshot of the viral frame from the video.", "On April 30, Sarbananda Sonowal tweeted photograph from his inspection visit at the site of Guwahati Water Supply Project.", "Inspected the site of Guwahati Water Supply Project and took stock of ongoing works.", "Directed officials to expedite works so that the project can be completed at the earliest and benefit citizens. pic.twitter.com/b3C2Ws83vy", "— Sarbananda Sonowal (@sarbanandsonwal) April 30, 2019", "It may be noted that according to a report by news agency United News of India, CAB protesters had attacked houses of RSS and BJP leaders including the CM’s house. “Chief Minister Sarbanada Sonowal’s house which is located at Dibrugarh in Upper Assam came under attack yesterday night as protestors pelted stones at his house,” stated the report published on December 13, 2019. An old image of the Assam CM was shared with the claim that he had to escape from his house during protests.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]