["A viral photo posted to Facebook claims to depict accused pipe bomb suspect Cesar Sayoc with a “Democrat Donor.” But that fellow he's with is an old soccer buddy and there's no evidence he's a political donor.", "A viral photo depicting Cesar Sayoc, a supporter of President Donald Trump who was charged Monday with five federal crimes in connection with 14 explosive packages sent to Democrats and CNN, claims he’s pictured with a \"Democrat Donor.\"", "The photo shows Sayoc smiling next to a man, and has been shared thousands of times by users on Twitter, Facebook and 4Chan. In an Oct. 27 Facebook post that was shared over 44,000 times, a user named Alan Reynolds posted the photo and wrote:", "\"PIPE BOMBER SUSPECT pictured last year with Izzy Hernandez. Sayok does not appear destitute. In addition, why would a Trump enthusiast attend a banquet and have a photo OP with a Democrat Donor/Supporter? Facebook keeps trying to take down this photo,,,pls share this ASAP!\"", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Reynolds’ did not immediately reply to a message asking for evidence to justify his claim.", "Conservative pundit Ann Coulter even shared the image on Oct. 28, retweeting a tweet that included it, and wrote, \"Why do Facebook & Twitter immediately delete accounts of nuts at all? So we can rely on the media to tell us what they've posted? Why not let everyone see?\"", "Facebook and Twitter removed Sayoc’s social media accounts Friday, The New York Times reported.", "While the image appears to show Sayoc, it’s unclear who the man smiling next to him in the photo is. Users on message boards like 4Chan have pointed out that it’s possibly a North Carolina soccer coach named Israel Hernandez.", "Indeed, it appears Sayoc did have a personal relationship with a man named Israel \"Izzy\" Hernandez: They were soccer buddies.", "The New York Times reported that Sayoc attended Brevard College in North Carolina, \"for a year beginning in the fall of 1980 and played on the soccer team but did not graduate, according to a spokeswoman.\"", "In a digital archive of Brevard College’s 1981 yearbook, \"The Pertelote,\" a student named Cesar Sayoc appears on pages 152 and 155, in a team photo and playing soccer.", "The caption of one photo reads, \"Cesar Sayoc extends after a shot to the goal.\"", "A student named Cesar Sayoc also appears in Brevard College’s 1982 yearbook on pages 77 and 136, again in photos of the school’s soccer team.", "Following Sayoc’s arrest, former Brevard College soccer coach Don Scarborough on Oct. 26 spoke to WRAL-TV  NBC affiliate in Raleigh, North Carolina, about his experience coaching Sayoc. In it, Scarborough mentions that North Carolina Soccer Hall of Famer Israel \"Izzy\" Hernandez was on the same team as Sayoc and that the two were \"friends.\"", "\"Cesar was just one of the guys. I mean looking back on it, I think that soccer team that he was on for two years was the best family and the only family that maybe he had during his life. And to hear what has happened in the last while with Cesar is just heartbreaking,\" Scarborough told WRAL-TV.", "Scarborough said the last time he saw Sayoc was about \"four or five years ago\" when Sayoc visited Brevard to attend Scarborough’s induction into the Athletic Hall of Fame. In that same  According to the Brevard College Tornados’ website, Scarborough was inducted in 2015.", "A profile on a coach named Israel \"Izzy\" Hernandez, who was inducted into the North Carolina Soccer Hall of Fame in 2009, says that he spent his first two years of college from 1980-82 at Brevard College — the same time that Scarborough was a coach and that Sayoc was on the soccer team.", "A 2007 Sports Illustrated article also profiles Hernandez’s coaching achievements. And in 2006, the News & Observer in Raleigh, NC, published a profile of the Cuban-born Hernandez, a piece that included his full name: Israel Abel Hernandez, then age 44.", "We searched campaign donor records and couldn’t find donations by anyone that seemed to fit the profile of Israel Abel Hernandez, who appears to be Sayoc’s old soccer buddy.", "The Federal Election Commission database of individual political contributions show 27 recent campaign donations made by people named Israel Hernandez — six made during 2017-18 and 21 made in 2016-17. Of those, none of the people named Israel Hernandez are from North Carolina.", "We searched the FEC’s database a little more, this time going all the way back to 1985-86 and found no one from North Carolina by the name of Israel Hernandez who made any campaign donations in any of those years. Nor did we find any documentation by donations of anyone by the name of \"Izzy Hernandez\" in any of the years going back to 1985-86.", "Similarly, opensecrets.org, which draws its data from the FEC, shows no record of any political donations coming from an Israel or Izzy Hernandez from North Carolina for any election cycle going back to 1990.", "The voter who is registered under the name \"Israel Abel Hernandez\" — the same full name of soccer coach and Brevard College alumnus who was profiled in 2006 in the News & Observer — is listed as politically \"unaffiliated.\"", "We tried to reach Izzy Abel Hernandez, but were not able to locate him by phone.", "A viral photo claims that pipe bomb suspect Cesar Sayoc was photographed with a Democratic donor named Izzy Hernandez. We don’t know for sure who the man in the photo is. But his photo resembles those of a man named Israel Hernandez, a former soccer coach who played soccer on the same teams Cesar Sayoc once played on and later became inducted into the North Carolina Soccer Hall of Fame.", "While it does appear Sayoc is pictured with a man named Israel \"Izzy\" Hernandez, we don’t find any indication that Hernandez is a Democrat or a donor to Democratic campaigns.", "We rate this claim Mostly False.", "Alan Reynolds’ Facebook post, Oct. 27, 2018", "@WhoWolfe’s tweet, Oct. 28, 2018", "4Chan thread, Oct. 28, 2018", "Ann Coulter’s tweet, Oct. 28, 2018", "New York Times, \"Living in a Van Plastered With Hate, Bombing Suspect Was Filled With Right-Wing Rage,\" Oct. 26, 2018", "CNN, \"Pipe bomb suspect Cesar Sayoc formally charged at first court appearance,\" Oct. 29, 2018", "Digital NC, \"The Pertelote,\" 1981", "Digital NC, \"The Pertelote,\" 1982", "WRAL-TV, \"Former soccer coach speaks about bomb mailing suspect,\" Oct. 26, 2018", "WRAL-TV, \"Soccer coach says Sayoc was part of family at Brevard,\" Oct. 26, 2018", "North Carolina Soccer Hall of Fame, \"Israel \"Izzy\" Hernandez,\" accessed Oct. 29, 2018", "Flickr album from Brevard College Distinguished Alumni event held Oct. 2, 2015, accessed Oct. 31, 2018", "Sports Illustrated, \"A coach for all seasons,\" Nov. 29, 2007", "The (Raleigh, NC) News & Observer, \"Quiet Coach Amasses State Crowns in Soccer,\" Dec. 17, 2006", "Federal Election Commission campaign finance data database, accessed Oct. 30, 2018", "Center for Responsive Politics, OpenSecrets.org campaign finance database, accessed Oct. 30, 2018.", "North Carolina State Board of Elections and Ethics Enforcement voter registration search, accessed Oct. 30, 2018", "The (Raleigh, NC) News & Observer, \"Area Coaches Among NCHSAA’s Top 100,\" June. 21, 2013", "New York Times, \"Cesar Sayoc’s Path on Social Media: From Food Photos to Partisan Fury,\" Oct. 27, 2018", "Matt Dees voicemail, Oct. 30, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]