["About this rating", "On 31 January 2017, just days after President Donald Trump signed an executive order  Times.com.mx published an article appearing to report that an Islamic State leader was captured as a result of President Donald Trump's 27 January 2017 executive order on immigration, earning profuse apologies from former Attorney General Sally Yates as a result:", "Terror suspect, Rasheed Muhammad, was arrested on Tuesday, January 31, at approximately 1:32AM EST at John F. Kennedy International Airport. This marks the first successful story following President Trump’s executive order to protect the nation from foreign terrorist entry into the United States. Muhammad, 32, was questioned due to the heightened security measures that resulted from the presidential executive order. The suspect attempted to enter the country with a tourist visa and claimed to be visiting family in order to attend this year’s Super Bowl LI.", "Former Attorney General, Sally Yates, who was ousted by President Trump after failing to support the executive order, released a public apology via popular social media, Snapchat.", "“I would like to express a sincere and utter apology to President Donald J. Trump. Due to unforeseen circumstances, there is no way I could have predicted the outcome of the situation. If afforded the opportunity to continue my position as Attorney General, I would be more than ecstatic to comply.”", "According to the story, Yates' apology was issued via self-deleting messaging application Snapchat (making it impossible to substantiate) and Federal Bureau of Investigation director James Comey said that the FBI was waiting to release an official press statement.", "The photograph published with the story came from 2009, and shows Najibullah Zazi, not \"Rasheed Muhammad,\" who does not appear to exist.", "Times.com.mx's claim that an Islamic State operative named Rasheed Muhammed was captured at Kennedy airport in the wake of the entry ban is not the first time the site has spread fake news. Also in January 2017, the outlet reported that drug kingpin El Chapo donated millions of dollars to the campaign of Hillary Clinton. This, too, was false.", "The site is one of several that mimics the web addresses and graphics of mainstream news organizations in order to more effectively spread hoaxes.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]