["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former Hewlett Packard CEO Carly Fiorina said marijuana is more potent today than decades ago. (Screengrab)", "The Republican presidential candidates sparred over many issues in the CNN debate, including the potency of pot.", "On drug policy, there was talk about expanded rehabilitation and prison reform to reduce the number of nonviolent prisoners. When it came to marijuana, one candidate, New Jersey Gov. Chris Christie took the hardest line, saying he would enforce a federal ban nationwide.", "Kentucky Sen. Rand Paul favored allowing states like Colorado do as they please. So did former Florida Gov. Jeb Bush, who explained his position by acknowledging his own use. \"So, 40 years ago, I smoked marijuana, and I admit it. I'm sure that other people might have done it and may not want to say it in front of 25 million people. My mom's not happy that I just did.\"", "Former Hewlett Packard CEO Carly Fiorina shared the view that states should decide for themselves, but she offered an important caution.", "\"The marijuana that kids are smoking today is not the same as the marijuana that Jeb Bush smoked 40 years ago,\" Fiorina said.", "We thought it would be good to explore whether pot has become more potent since the 1970s. This is something we’ve looked at before.", "The main psychoactive agent in marijuana is THC, or delta-9-tetrahydrocannabinol. When researchers discuss the potency of marijuana, they typically are measuring the concentration of THC.", "THC levels differ depending on the part of the plant used, and how it is processed for consumption. In addition to marijuana, there are materials such as sinsemilla (the flowering tops of unfertilized female plants), hashish or cannabis resin, and hash oil (a concentrated extract from cannabis plants). Hashish oil tends to have much higher concentrations of THC than marijuana or even sinsemilla. Both of these have become more popular in recent years.", "But what about marijuana itself? Has weed as we once knew it become more potent?", "The answer is yes. THC levels are on the rise, and they have been for quite some time.", "The University of Mississippi Potency Monitoring project analyzed tens of thousands of marijuana samples confiscated by state and federal law enforcement agencies since 1972. The average potency of all seized cannabis has increased from a concentration of 3.4 percent in 1993 to about 8.8 percent in 2008. Potency in sinsemilla in particular has jumped from 5.8 percent to 13.4 percent during that same time period.", "Back in the late 1970s , the mean potency for marijuana was about 3 percent, Mahmoud ElSohly, director of marijuana research with the monitoring project, told us in an interview for a prior fact-check.", "Further, the number of samples confiscated with a THC concentration greater than 9 percent has increased significantly, from 3.2 percent in 1993 to 21.5 percent of the 1,635 marijuana samples collected in 2007.", "But while the average is up due to the availability of marijuana with a higher THC count, the high mark in potency (somewhere around 25-27 percent) remains relatively unchanged in the last couple decades and isn’t likely to increase, ElSohly said.", "For the average adult recreational or habitual user, there’s uncertainty about what rising THC levels mean.", "Only a handful of studies have looked at how users smoke marijuana with varying THC levels. Several of these studies noted that when test subjects were using more highly concentrated marijuana, they often smoked less than they did when consuming product with a lower THC level.", "In that regard, THC would seem to mimic how people consume beverages with different alcohol content: People tend to drink whiskey in shots, wine by the glass and beer by the mug. Marijuana may work the same way, said Carl Hart, a psychology professor at Columbia University who studies the effects of psychoactive drugs.", "Roger Roffman, a social work professor at the University of Washington and author of the upcoming book Marijuana Nation, noted that there has been little research on the impact of potency in cannabis at the levels seen today, especially in products like hash oil, meaning we don’t know everything about its potential impact.", "Our ruling", "Fiorina said the marijuana kids smoke today is not what it was 40 years ago. Studies back that up. THC potency is up, with a growing fraction of seized marijuana having a concentration of 9 percent or more. There is some evidence that users smoke less when the pot is more potent, but that doesn’t detract from Fiorina’s main point.", "We rate this claim True.", "CNN, Republican presidential debate, Sept. 16, 2015", "PolitiFact, Has the potency of pot changed since President Obama was in high school?, Jan. 24, 2014", "Politico, \"Patrick Kennedy to Barack Obama: Pot has changed,\" Jan. 21, 2014", "The New Yorker, \"Going the distance,\" Jan. 27, 2014 (available online prior to publication date)", "Journal of Forensic Sciences, \"Potency Trends of D9-THC and Other Cannabinoids in Conﬁscated Cannabis Preparations from 1993 to 2008,\" Sept. 2010", "National Institute on Drug Abuse, \"Sixty percent of 12th graders do not view regular marijuana use as harmful,\" Dec. 18, 2013", "United Nations Office on Drugs and Crime, \"Why does cannabis potency matter?\" 2009 World Drug Report", "CNN, \"Is super weed, super bad?\" Aug. 9, 2013", "University of Washington Alcohol and Drug Abuse Institute, \"Potency of Marijuana,\" accessed Jan. 22, 2014", "National Highway Traffic Safety Administration, Drugs and Human Performance Fact Sheet: Marijuana, accessed Jan. 22, 2014", "Washington Post, \"The Choom Gang: President Obama’s pot-smoking high school days detailed in Maraniss book,\" May 25, 2012", "CNN, \"Marijuana potency surpasses 10 percent, U.S. says,\" May 14, 2009", "Addiction, \"Cannabis potency and contamination: a review of the literature,\" Published 2008", "International Journal of Drug Policy, \"Differential responses to cannabis potency: A typology of users based on self-reported consumption behaviour,\" Published 2007", "Drug Abuse Warning Network, \"National Estimates of Drug-Related Emergency Department Visits, 2004-2011,\" accessed Jan. 23, 2014", "Email interview with Kara Kukfa at Next Chapter, Patrick Kennedy's website, Jan. 21, 2014", "Phone interview with Carl Hart, professor of psychology at Columbia University, Jan. 22, 2014", "Phone interview with Roger Roffman, professor of social work at University of Washington, Jan. 22, 2014", "Phone and email interview with Mahmoud ElSohly, professor of Pharmaceutics at University of Mississippi, Jan. 23, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]