["“He is a real #NAZI. His name is George Soros,” claims the Facebook publication featuring a black-and-white photo of a young Nazi officer.", "Another similar meme calls on people to remember that Soros, a philanthropist billionaire who funds the grantmaking Open Society Foundations, is actually a Nazi, “next time the Soros-funded liberals call you a racist, fascist, or Nazi.”", "However, a reverse image search reveals that the man in the photo is Oskar Groening, also known as the “Bookkeeper of Auschwitz.”", "Groening was a Nazi SS guard who worked as an accountant in Auschwitz. Groening sorted and counted the money taken from those killed in the concentration camp and shipped it back to his superiors in Berlin, according to AFP reporting at the time of his death.", "The photo used as proof of Soros’ past as a Nazi guard is from the Museum of Auschwitz-Birkenau, and is available here.", "“I can only confirm that the black and white picture shows Oskar Groening,” Pawel Sawicki, media officer for the Auschwitz Memorial in Poland, told AFP.", "Groening died in 2018 at 96, without having served his sentence for being an accessory to murder, of which he was found guilty in July 2015.", "Soros, who was born in Budapest, Hungary in 1930, would have been 9 years old at the time the first prisoners arrived at Auschwitz in June 1940.", "AFP Fact Check first identified Soros being falsely associated with this image in November 2019. In June 2020, the claim resurfaced on Facebook and Instagram.", "It circulated thousands of times along with other false claims about a connection between Soros and Antifa protesters, as nationwide demonstrations called for an end to police brutality against African Americans following the death in police custody of George Floyd, an unarmed black man.", "Soros is the subject of many online conspiracy theories. Many falsely claim that Soros works with other rich and powerful individuals around the globe to create a “globalist” new world order that would destroy the concept of borders and nationalities.", "Here are other AFP Fact Check debunks related to Soros.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]