["About this rating", "The post-Easter weekend of April 17-19, 2020, fell in the midst of both the COVID-19 coronavirus pandemic and a public controversy over whether social-distancing rules should be relaxed and some public facilities (such as beaches) reopened to public use, if only on a limited basis:", "As a divide appeared to deepen between Americans who want to reopen the country and those who urge continuing social distancing to slow the spread of coronavirus, one microcosm of the debate centered on some newly reopened Florida beaches.", "Despite the fact that bustling stores, trails and parks don’t seem to evoke the same level of outrage among stay-at-home advocates, enough social media users were upset by beaches reopening in the Jacksonville area that the #FloridaMorons hashtag started trending on Twitter late Friday and early Saturday.", "Some Twitter users said they feared the reopenings would lead to crowds and an uptick in cases that could extend quarantine durations. They criticized the government officials who made the decision as well as the residents and visitors who went to the beach.", "Others spoke out in support of the beach reopenings, some of them saying Floridians need fresh air and exercise, and others stating that grocery store shoppers are closer to each other than the beachgoers have been so far.", "The news reporting on that controversy caused a controversy of its own, however. Some social media users asserted that photographs showing crowds of beach-goers in Jacksonville that were used to illustrate news articles were simply stock photos or unrelated pictures that did not reflect the reality of the situation:", "Although it's possible a photograph of Jacksonville beaches from the weekend of April 17-19, 2020, might have been inappropriately used somewhere to illustrate a story about a different part of the U.S. (such as California), the pictures seen here are correctly represented as to time and place (i.e., taken in Jacksonville in mid-April 2020). Here are those photographs and their accompanying captions, as stored in the database of the Getty Images visual media company:", "JACKSONVILLE BEACH, FLORIDA - APRIL 17: People are seen at the beach on April 17, 2020 in Jacksonville Beach, Florida. Jacksonville Mayor Lenny Curry announced Thursday that Duval County's beaches would open at 5 p.m. but only for restricted hours and can only be used for swimming, running, surfing, walking, biking, fishing, and taking care of pets. (Photo by Sam Greenwood/Getty Images)", "JACKSONVILLE BEACH, FL - APRIL 17: People crowded the beaches in its first open hour on April 17, 2020 in Jacksonville Beach, Fl. Jacksonville Mayor Lenny Curry opened the beaches to residents for limited activities for the first time in weeks since closing them to the public due to the Coronavirus (COVID-19) outbreak. Jacksonville Beach became the first beach in the country to reopen. (Photo by David Rosenblum/Icon Sportswire via Getty Images)", "It is true, though, that as demonstrated in the following Facebook post, factors such as camera positioning, angle, and lens type can substantially affect the viewer's perception of how far apart pictured objects are, so a beach that looks crowded in one photo may appear sparsely populated in another:", "Theisen, Tiffini.   \"Decision to Reopen Some Florida Beaches Causes Controversy.\"\r\n    Orlando Sentinel.   18 April 2020.", "Boyer, Emily.   \"Uproar Reaction Over Social Distancing at Beaches a Matter of Perspective.\"\r\n    WJXT-TV.   20 April 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]