["A video has been posted on Twitter, along with the claim that clashes have taken place between Assam police and Indian army personnel, purportedly over the National Register of Citizens (NRC). The final list of the NRC was recently released, and over 19 lakh people from Assam failed to make the cut.", "clashes between India Army & Assam police in India Occupied Assam", "This is the start of the beginning of the end of India pic.twitter.com/0f822Y4skP", "— Younis Baloch (@YouniisBaloch) September 2, 2019", "The above tweet is by a Pakistani social media user and has been retweeted over 750 times since it was posted on September 2. The video clip is 45 seconds long, and shows a scuffle taking place between men in police uniforms and men in military fatigues. It has also been posted and shared on Facebook by a page, Apna Pakistan.", "The video clip has a logo of Hindi TV news channel News Nation on the top left corner. Moreover, at 37 seconds in the video, a man can be heard saying, “Delhi mein kya hua?” (What happened in Delhi?- translation). On the basis of these clues and with the use of specific key words, Alt News managed to find the same video clip on the website of News Nation. The incident is of February, 2018.", "According to reports, a clash had erupted on February 26, 2018 between army personnel and Delhi police near the Delhi cantonment area, when a Delhi police constable entered a restricted area, allegedly in an inebriated state. Army personnel had claimed that the cop was drunk, and that he misbehaved with a senior army officer present there. Delhi police meanwhile had rubbished the claim, although a probe into the same was ordered.", "An old video of February 2018 depicting a clash between army and police personnel in Delhi, was falsely shared as unrest in Assam over the NRC.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]