["By Saranac Hale Spencer", "Posted on November 22, 2017", "Q: Has the Food and Drug Administration announced that vaccines cause autism?", "A: No. FDA statements are grounded in scientific evidence. There is no evidence that vaccination is linked to autism.", "FDA ANNOUNCED THAT VACCINES ARE CAUSING AUTISM! Is this true?", "The Food and Drug Administration credits vaccines for the decline of many infectious diseases over the last century, and more than a decade of peer-reviewed studies show there is no link between their use and autism.", "However, a story perpetuating the myth that vaccines cause autism has prompted several questions to FactCheck.org and has been getting popular on Facebook, where it was flagged by the social network’s users as potentially false. It is.", "The headline on the story says: “NOW IT’S OFFICIAL: FDA Announced That Vaccines Are Causing Autism!”", "But the FDA has made no such announcement, and the only evidence that the story gives to support its claim is the label from a vaccine called Tripedia, which was discontinued in 2011.", "That evidence is pretty weak, since the label for Tripedia lists autism along with 10 other “adverse events” that were voluntarily reported by doctors or parents who had their children get the shot. Autism was not found to be among the effects identified in the studies of that drug before it went to market.", "Importantly, the label also says: “Because these events are reported voluntarily from a population of uncertain size, it is not always possible to reliably estimate their frequencies or to establish a causal relationship to components of Tripedia vaccine.”", "Further illustrating why relying on voluntary reporting is a problem, the label also notes that 13 out of the nearly 15,000 infants who were in a study of the vaccine in Germany died — one of them in a car crash and another accidentally drowned.", "Tripedia, which was first approved for use in the U.S. in 1992, was a vaccine for diphtheria, tetanus and whooping cough that had trace amounts of the mercury-based preservative thimerosal. It had such a small amount of that ingredient — less than 0.3 micrograms — that the Centers for Disease Control and Prevention said it would have no biological effect and could be treated as a thimerosal-free product. But for those who believe there is a connection between vaccines and autism, thimerosal has served as an enduring link since the late 1990s.", "In 1998, Andrew Wakefield, a British gastroenterologist, published a fraudulent paper that was retracted when the study could not be replicated and he was found to have engaged in unethical conduct. That paper, which was published in The Lancet, offered the now discredited conclusion that the measles, mumps and rubella vaccination was linked to autism. The Lancet not only retracted that paper, but the General Medical Council in the United Kingdom stripped Wakefield of his ability to practice medicine for his dishonesty and irresponsibility in the paper.", "But he had already planted the seed for the idea that vaccines could cause autism and it was then picked up and trumpeted by some politicians and, perhaps most loudly, by celebrity-turned-activist Jenny McCarthy.", "In fact, there is no evidence that vaccines cause autism. (We covered this and related vaccine issues in 2015, when Sen. Rand Paul claimed that he had heard of “many” children that developed “profound mental disorders” after receiving vaccinations.)", "Similarly, there is no link between thimerosal and autism. However, as a precaution, the FDA recommended taking that ingredient out of all vaccines in 1999. “Between 1999 and 2001, thimerosal was removed or reduced to trace amounts in all childhood vaccines except for some flu vaccines,” according to the CDC.", "The story that is currently circulating on Facebook is tinged with conspiracy theory. It suggests that the “pharmaceutical mafia” is using vaccines to cause a “depopulation of our planet.” But it is just the most recent version of the story. Claims based on the Tripedia label have been making the rounds on the internet since at least 2008.", "The company that made Tripedia, Sanofi Pasteur, has replaced it with DAPTACEL, which contains no thimerosal, according to the CDC.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Food and Drug Administration. Vaccines for Children — A Guide for Parents and Caregivers. 27 Mar 2017.", "Food and Drug Administration. Thimerosal and Vaccines. Accessed 17 Nov 2017.", "Centers for Disease Control and Prevention. Selected Discontinued U.S. Vaccines. Aug 2011.", "“NOW IT’S OFFICIAL: FDA Announced That Vaccines Are Causing Autism!” Globalliving.org. 14 Nov 2017.", "Tripedia package insert. FDA.gov. Dec 2005.", "Centers for Disease Control and Prevention. Thimerosal Table. CDC.gov. 11 Dec 2013.", "Baker, Jeffrey. Mercury, Vaccines, and Autism. American Journal of Public Health. Feb 2008.", "General Medical Council. Fitness to Practise Panel Hearing. BrianDeer.com. 28 Jan 2010.", "Levitan, Dave. “Paul Repeats Baseless Vaccine Claims.” FactCheck.org. 3 Feb 2015.", "Centers for Disease Control and Prevention. Vaccines Do Not Cause Autism. 23 Nov 2015.", "Centers for Disease Control and Prevention. Timeline: Thimerosal in Vaccines (1999-2010). 28 Aug 2015.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]