["By D'Angelo Gore", "Posted on October 20, 2017", "Rep. Frederica Wilson said that White House Chief of Staff John Kelly got the facts wrong when he said that Wilson took credit for getting the funding for an FBI office in Miramar, Florida. The evidence supports Wilson.", "South Florida’s Sun-Sentinel posted video of Wilson’s full remarks at the building’s April 10, 2015, dedication ceremony. It shows the Democratic representative of Florida’s 24th Congressional District never mentioned the building’s funding in her roughly 9-minute speech. She explained how she, at the FBI’s request, worked with Democrats and Republicans in Congress to quickly get the building named after two FBI agents killed in the line of duty.", "Kelly made his remarks at a press briefing at the White House on Oct. 19, where he addressed questions about phone calls President Donald Trump has made to the families of fallen U.S. soldiers.", "Wilson, two days before that, had criticized the president for “insensitive” comments she said she heard him make in a phone call to the widow of Sgt. La David Johnson, one of four American soldiers killed in an attack in Niger on Oct. 4", "Kelly said that he was “stunned” that Wilson had listened in on the call, and went on to tell a story about the FBI building’s dedication ceremony at which he said a congresswoman “stood up there … and talked about how she was instrumental in getting the funding for that building.”", "Kelly, Oct. 19: I’ll end with this: In October — April, rather, of 2015, I was still on active duty, and I went to the dedication of the new FBI field office in Miami. And it was dedicated to two men who were killed in a firefight in Miami against drug traffickers in 1986 — a guy by the name of Grogan and Duke[sic]. Grogan almost retired, 53 years old; Duke[sic], I think less than a year on the job. Anyways, they got in a gunfight and they were killed. Three other FBI agents were there, were wounded, and now retired. So we go down — Jim Comey gave an absolutely brilliant memorial speech to those fallen men and to all of the men and women of the FBI who serve our country so well, and law enforcement so well.", "There were family members there. Some of the children that were there were 3 or 4 years old when their dads were killed on that street in Miami-Dade. Three of the men that survived the fight were there, and gave a rendition of how brave those men were and how they gave their lives.", "And a congresswoman stood up, and in the long tradition of empty barrels making the most noise, stood up there and all of that and talked about how she was instrumental in getting the funding for that building, and how she took care of her constituents because she got the money, and she just called up President Obama, and on that phone call he gave the money — the $20 million — to build the building. And she sat down, and we were stunned. Stunned that she had done it. Even for someone that is that empty a barrel, we were stunned.", "Kelly didn’t mention Wilson by name, but it was clear from the context of his remarks that he was referring to her.", "Wilson, in an interview on CNN’s “New Day” the next morning, said that Kelly told a “lie.”", "Wilson, Oct. 20: I heard him say that I bragged that I secured the money for the building of the FBI building in Miramar and that’s a lie. You know, I feel sorry for Gen. Kelly. He has my sympathy for the loss of his son, but he can’t just go on TV and lie on me. I was not even in Congress in 2009 when the money for the building was secured. So that’s a lie. How dare he? However, I named the building at the behest of Director [James] Comey with the help of Speaker [John] Boehner, working across party lines. So he didn’t tell the truth and he needs to stop telling lies on me.", "Wilson is right. She didn’t take office until January 2011, months after the government had already put out a construction contract for the building, which reportedly cost close to $200 million, way more than the “$20 million” that Kelly said.", "“The bidding for federal projects takes place after Congress has secured the funding,” as the Miami Herald reported.", "Plus, as we mentioned already, video of Wilson’s speech at the 2015 ceremony shows that she never brought up the subject of the building’s funding or took credit for it. She told the audience how Democrats and Republicans worked together to get legislation passed that would name the building after Benjamin Grogan and Jerry Dove, two FBI agents who were killed in a gun battle with bank robbers in 1986.", "Wilson said that she was given about four weeks’ notice that the FBI wanted to have the building named in honor of the former agents prior to the dedication ceremony. She said that she then went to then-Republican House Speaker John Boehner for help with the bill she introduced. Boehner, she said, “went into attack mode and in two days pulled it out of committee, brought it to the floor for a vote.”", "After that, she said, Florida Sens. Bill Nelson, a Democrat, and Marco Rubio, a Republican, were helpful in getting the bill “hotlined” through the Senate, allowing President Barack Obama to sign the bill into law on April 7, 2015 — three days before the ceremony.", "“It is a miracle to say the least,” Wilson said about the quick process, “but it speaks to the respect that our Congress has for the Federal Bureau of Investigation.”", "Kelly got it wrong, even though the White House says it stands by his account. White House Press Secretary Sarah Sanders said that Wilson “had quite a few comments that day that weren’t part of that speech … that were also witnessed by many people that were there.”", "In the video, Wilson didn’t say that “she was instrumental in getting the funding for that building.”", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]