["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "When Bill Clinton wasn’t retelling how he courted his wife, he filled his Democratic convention speech, later published on Medium, with a long list of Hillary Clinton’s achievements in public life.", "When he got to her time as secretary of state, he applauded her work on HIV/AIDS.", "\"She tripled the number of people with AIDS in four countries whose lives are being saved with your tax dollars,\" Clinton said. \"Most of them in Africa, going from 1.7 million lives to 5.1 million lives, and it did not cost you any more money. She just bought available FDA-approved generic drugs.\"", "We decided to take a closer look at those treatment gains and the price tag that came with them. Clinton’s statement is a bit unclear, first referencing a tripling in four countries, then giving the top-line treatment numbers that span many nations.", "We reached out to Clinton’s office for clarification. His staff told us that Clinton was talking about the overall HIV/AIDS treatment activities of the President’s Emergency Plan for AIDS Relief, or PEPFAR.", "We took his essential claim to be that thanks to his wife, treatment tripled and costs held steady. That’s not perfectly accurate, but it's close.", "PEPFAR started under President George W. Bush and President Barack Obama kept it going. Hillary Clinton can take some credit for PEPFAR’s achievements because it is a State Department program.", "One of PEPFAR’s major goals is to get as many people as possible into treatment, primarily in Africa but on other continents, too. There is no cure for AIDS, still, antiretroviral drugs can slow down the HIV virus in the body, sometimes for many years.", "In 2013, the Government Accountability Office, the auditing arm of Congress, looked at how efficiently PEPFAR was getting those antiretrovirals to people in need. That report backed up Clinton’s statement, but it only covered the years between 2005 and 2011.", "Here’s why that’s important.", "Hillary Clinton served as secretary of state from 2009 through January 2013. For a full view of what PEPFAR did on her watch, we got the numbers through 2012.", "Drawing on the GAO report, PEPFAR’s own reports, and numbers we got from PEPFAR staff, we found these trends:", "The charts tell us that the number of people in treatment rose from 2.1 million at the end of 2008 to 5.1 million by the end of 2012 (fiscal years). That number more than doubled, but it didn’t quite triple as Clinton said.", "However, that increase did come without additional tax dollars. Using constant 2009 dollars, treatment spending fell dramatically for two years, and then returned to the 2009 level.", "When you put the two trends together, the big picture is that the United States used the same amount of money to deliver about 250 percent more treatment.", "Eric Goosby, the head of PEPFAR during those years and now professor of medicine at the University of California San Francisco, said the George W. Bush administration laid the groundwork for those gains.", "\"It takes a lot time to find the places to set up treatment, and get all the pieces in place to deliver it,\" Goosby told us. \"We benefited from all of that.\"", "But Goosby also points to the rapid shift to generic drugs after 2009.", "\"We went from buying 90 percent brand name antiretroviral drugs to less than 3 percent,\" Goosby said. The generic drugs were much cheaper.", "The program also cut costs by cutting out air delivery and moving goods by land and sea.", "\"This saved millions of dollars and allowed for an uninterrupted expansion of the number of patients on treatment,\" he said.", "The chart above shows that on Hillary Clinton’s watch, the costs per patient were driven down by more than half — from $673 when she took control to $338 when she left.", "The question is, does she deserve the credit?", "Mead Over, a senior fellow at the Center for Global Development, a Washington policy center, urges a bit of caution. Over told us that while a lot of the work is done by State Department agencies, not all of it is. The Centers for Disease Control and Prevention and the National Institutes of Health and other agencies also play a role.", "But at the end of the day, Over told us the secretary of state sets the priorities and in this case, the priority was to expand treatment at a lower cost per person.", "There's evidence that Clinton wasn't just phoning it in. AIDS activists counted her as an ally.", "Mark Harrington, executive director of the Treatment Action Group, a New York-based advocacy organization, said he would give Clinton a lot of credit for what happened. Harrington said she built stronger reporting ties with PEPFAR than her predecesor and had a clear picture of what was needed. Harrington gave one example of how that led to her direct involvement.", "\"She helped clear the way for the switch from using expensive international NGOs to deliver services, to working with in-country partners and ministries of health,\" Harrington said. \"There was a concern about corruption, and she made it very clear to foreign leaders that that could not happen. And it’s really surprising for a program this big that it hasn’t.\"", "Harrington also noted that Clinton was engaged with HIV/AIDS before she became secretary. When she was in the Senate, she met with activists and advocated for the programs and funds they sought.", "Our ruling", "Bill Clinton said when Hillary Clinton was secretary of state, she tripled the number of people with AIDS whose \"lives are being saved,\" and it didn’t cost taxpayers any more money.", "Clinton took some liberties with the numbers. Treatment rose rapidly by about 250 percent. That’s not quite triple. But Clinton was right that those gains came without additional spending in inflation-adjusted dollars.", "And while Hillary Clinton can’t take full credit, outsiders said she did set the overall direction for how the program should move forward and intervened in specific ways to help it do more at a lower cost.", "We rate this claim Mostly True.", "https://www.sharethefacts.co/share/aaf90740-0469-4739-9301-56482efa914b", "Medium, Bill Clinton Democratic National convention speech, July 26, 2016", "President’s Emergency Plan for AIDS Relief,2013 Report on Costs of Treatment, 2013", "Government Accountability Office, PEPFAR: Per-Patient Costs Have Declined Substantially, but Better Cost Data Would Help Efforts to Expand Treatment, March 2013", "President’s Emergency Plan for AIDS Relief, Annual reports to Congress, accessed Aug. 5, 2016", "Journal of the American Medical Association, Use of generic antiretroviral agents and cost savings in PEPFAR treatment programs, July 21, 2010", "Email interview, Mead Over, economist and senior fellow, Center for Global Development, Aug. 5, 2016", "Interview, Eric Goosby, professor of medicine, University of California San Francisco, Aug. 6, 2016", "Interview, Mark Harrington, executive director, Treatment Action Group, Aug. 9, 2016", "Email interview, David Haroz, spokesperson, President’s Emergency Plan for AIDS Relief, Aug. 5, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]