["About this rating", "A 2016 Human Rights Watch report analyzed ICE death reviews of 18 adults who passed away while under detention by U.S. immigration authorities at various facilities between 2012 and 2015.", "We found no documentation supporting the claim that any migrant children, much less 18 of them, died while in the custody of the U.S. Border Patrol during the administration of President Barack Obama.", "On 24 December 2018, an 8-year-old Guatemalan boy died while in the custody of U.S. Customs and Border Protection (CBP) agents, the second time in a month that an undocumented immigrant child had perished under the same circumstances.", "Facing widespread scrutiny and criticism for the deaths, Secretary of Homeland Security Kirstjen M. Nielsen released a statement saying a dramatic increase in illegal border crossings had pushed the U.S. immigration system \"to a breaking point.\"", "\"It is now clear that migrants, particularly children, are increasingly facing medical challenges and harboring illness caused by their long and dangerous journey,\" Nielsen said. By way of comparison, she said, before these two incidents occurred more than a decade had elapsed since a child had passed away in CBP custody.", "Oddly, word was going around on social media at precisely the same time to the effect that no fewer than 18 migrant children had, in fact, died in the Border Patrol's custody during the Obama administration.", "The rumor appears to have first emerged on Christmas Day and to have gone viral on Twitter the following day. This example is a tweet responding to actress Alyssa Milano's criticism of the Trump administration's immigration policies:", "I’m honestly baffled where the outrage was when 18 children died under the @BarackObama administration??? https://t.co/yrgBR3NDjw", "— Jojo Parks (@jwaters33312) December 26, 2018", "Almost none of the posts cited sources to support the claim, and the few that did linked to dubious sources such as the partisan blog Pacific Pundit, wherein a post dated 26 December alleged, on the basis of no evidence whatsoever, that \"18 children died while in the custody of Obama's Border Patrol\":", "The biggest way to avoid children dying while in custody of the border patrol is to not take them on dangerous, thousand mile journeys in the first place. We know the illegal alien invaders want their welfare checks, but they should at least think of the children who are suffering, with two dying.", "To the media, the two children dying is like a major, breaking news event. Never mind the fact the kids were probably sickened on their journey north because of the parents.", "Oh and during the Obama years, 18 children died in the custody of the border patrol, yet back then the media didn’t seem to care. In fact, I can’t recall the media publishing one story about the 18 kids who died because of Obama.", "The Pacific Pundit post cited a tweet which consisted of nothing but a repetition of the claim in question:", "Did you know that during the Obama administration 18 children died while in custody of Border Patrol?", "Where was the media outrage then?", "— Michael J. Morrison (@OfficeOfMike) December 26, 2018", "We scoured the archives of more reputable news sources for matching claims and were unable to find reports of any undocumented immigrant minors dying in OBP custody during the Obama administration. However, we did find a July 2016 report from the watchdog group Human Rights Watch that looked into death reviews released by ICE in June 2016 covering 18 deaths of adults who perished while under detention by U.S. immigration authorities between 2012 and 2015 (i.e., during Obama's second term):", "The 18 death reviews cover deaths at 13 facilities. Those who died include citizens of Mexico, Honduras, El Salvador, Canada, Jamaica, Antigua-Barbuda, Mozambique, and Guatemala, some of them lawful permanent residents and others unauthorized migrants, including at least six who sought protection under refugee law. All of the detainees who died were between 24 and 49.", "We found, moreover, that in December 2018 some high-profile partisan websites had repeated the gist of the Human Rights Watch report in the wake of the recent death of a migrant child. For example, the Daily Caller ran an article on 18 December headlined \"18 Deaths of ICE Detainees Acknowledged Under Obama — But Not Investigated,\" and Town Hall ran a report on 27 December titled \"Where Was the Media Outrage When 18 Migrants Died in Custody Under the Obama Administration?\"", "(The Human Rights Watch report actually stated that ICE had acknowledged the deaths of 31 detainees since May 2012, but the agency had only released death reviews for 18 of them so far. An earlier report from the ACLU examined another eight in-custody deaths -- all of adults -- out of the 56 that had reportedly taken place during the Obama administration to date.)", "Given the lack of any other sources that could have inspired the specific claim of 18 migrant children dying on Obama's watch, it seems most likely that the falsehood stemmed from a misconstrual (unintentional or otherwise) of news and opinion articles based on the 2016 Human Rights Watch report.", "Merchant, Nomaan.   \"Deaths of 2 Children Raise Doubts About U.S. Border Agency.\"\r\n    Associated Press.   26 December 2018.", "Picket, Kerry.   \"18 Deaths of ICE Detainees Acknowledged Under Obama -- But Not Investigated.\"\r\n    The Daily Caller.   18 December 2018.", "Vespa, Matt.   \"Where Was the Media Outrage When 18 Migrants Died in Custody Under the Obama Administration?\"\r\n    Town Hall.   27 December 2018.", "Human Rights Watch.   \"U.S.: Deaths in Immigration Detention.\"\r\n    7 July 2016.", "Pacific Pundit.   \"18 Children Died While in Custody of Obama's Border Patrol -- Media Silent.\"\r\n    26 December 2018.", "American Civil Liberties Union.   \"Fatal Neglect: How ICE Ignores Death in Detention.\"\r\n    Accessed 27 December 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]