["About this rating", "In May 2018, social media users began reporting a new Target gift card scam in the form of a viral message that typically read something along the lines of \"Text TARGET to 83361 and claim a free Target gift card\":", "On Facebook, these messages follow a formula: a greeting followed by the text scam and a smiling emoji. This suggests the involvement of bots, and that some users' Facebook accounts may have compromised. At least one person whose account posted a similar gift card scam subsequently said that the message was posted without their knowledge to every Facebook group of which they were a member:", "As noted by sites such as IDTheftInfo.org, such messages are a form of \"smishing\" scam:", "This type of scam is known as “smishing”, a type of “phishing” scam where the scammer sends you a text message, instead of an e-mail.  If you click on the link in the text message, you’ll be required to provide personal information such as your credit card number or social security number before you can claim any gift card.", "If the link provided in any text (or e-mail) message doesn’t lead you directly to a page on the company’s main website, it’s more likely than not that the offer is a scam.  The most popular website being used in this particular smishing scam, for example, is www.walmartgift.mobi (rather than the store’s actual site, which is www.walmartstores.com).", "Walmart does give away legitimate gift cards to the winners of drawings for receipt surveys, and these drawings take place four times per year.  However, the winners of these gift cards are always notified by certified mail, not via email or text message.", "Almost all the Facebook posts we found came with photographs of food to give a false impression that the \"gift card\" has allowed its recipients to splash out on a bounty of Target products. In reality, we were able to confirm that many of these images are taken from other sources — some from years ago — and used to add credibility to the scam.", "This particular scam is similar to previous insidious hoaxes relating to free gift cards from Walmart and other retailers. On its web site, Walmart offered this advice to anyone who receives suspicious or unsolicited communications:", "Don't respond or reply to an email, phone call, or text message that:", "A spokesperson for Walmart confirmed by telephone that the previous similar \"83361\" gift card offer was a scam and \"not legitimate.\"", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]