["About this rating", "Another video seemingly offered to malign refugees started to spread online in August 2018, in this case one purportedly showing a group of dark-skinned people smashing glass cases and stealing foodstuffs from\na small café. The video bore the caption \"Refugees Welcome to Spain,\" an apparent nod to the \"Refugees Welcome\" sign that was hung on Madrid City Hall a few years prior:", "This video (the original footage can be viewed below) does not feature refugees, was not recorded in Spain, and does not depict a recent incident.", "This footage was actually taken in a cafeteria at Tshwane University of Technology in Pretoria, South Africa in November 2015. At the time, students at several South African Universities were engaged in protests against fee hikes and inadequate funding.", "The South African Independent Online (IOL) news outlet reported that 16 protesting students at two Tshwane University of Technology (TUT) campuses were arrested for the incident depicted in this video and were released the following day:", "The Gencor Hall, the main exam centre at the South campus, along with the information centre and two security vehicles, were torched.", "The protests started to take an ugly turn when protesting students vandalised a cafeteria at the South campus. That same day, police arrested 16 students in connection with the violence, but released them a day later.", "South African History Online provided the context behind that student protest:", "Student protests at public universities and colleges over financial exclusions speak directly to the issue of inadequate governmental and other funding into education in South Africa. An estimated R900-million per annum for student funding is needed for TUT to function as an institution that still works for qualifying students requiring financial aid.", "NFAS, a loan and bursary scheme the government introduced in 1999 to give financially poor matrics access to university education, provides only a portion of this amount to students who need financial aid at TUT. For example, in 2014, the state scheme funded half the university students that qualified for its loans and bursaries at TUT. NSFAS was still unable to fund an estimated 10 000 students across TUT’s campuses who needed and qualified for financial aid in 2014, despite having obtained an additional allocation of R1-billion for that year; of which R270-million was allocated for TUT.", "In 2015, the situation was further exacerbated as the NSFAS allocation excluded that portion. The 2015 SRC estimated that over 20 000 returning students across the University’s six campus regions, were excluded that year. Many of these students were funded by NSFAS in 2014, but were left out in 2015, and were not allowed to register without an upfront payment and were also barred from receiving their results without settling their debt.", "Students at institutions including the Vaal University of Technology, the University of Johannesburg, the University of Venda and the Walter Sisulu University were also facing similar issues around the same time.", "Academic activities at the university were suspended for the remainder of the school year after the protests turned violent in November 2015. YouTuber Arphalia Meyer contemporaneously posted a series of videos of the protesters looting the campus, with the video that formed the basis of the later viral \"Refugees Welcome to Spain\" clip being put online on 23 November 2015.  That original video was accompanied by the caption \"Security cam footage of the mob looting Kantina, the tuck shop on campus at TUT PTA. It's clear enough that this was premeditated and they are no strangers to it\":", "This footage was taken at a University in South Africa and shows a group of students vandalizing a cafeteria amidst protests in 2015 against inadequate school funding. It has nothing to do with Spain or refugees, and it was nearly three years old when it was re-captioned and circulated online.", "South African History Online.   \"Student Protests at Tshwane University of Technology -- Timeline.\"\r\n    Retrieved 16 August 2018.", "El Pais.   \"'Refugees Welcome,' Reads Sign on Madrid City Hall.\"\r\n    8 September 2015.", "Makhetha, Tankiso.   \"Two TUT Campuses Shut Down.\"\r\n    IOL.   24 November 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]