["About this rating", "On 31 July 2016, the web site Associated Media Coverage published an article  reporting that the U.S. government was introducing a new regulation requiring all motorcycles be outfitted with speed governors capped at 75 MPH by January 2017:", "The government has implemented a new regulation requiring a governor to be placed on all motorcycles by mid-January 2017. The purpose of the mandatory governor would be to prevent motorcyclists from exceeding a speed of 75 miles per hour. The regulation aims to drastically reduce the amount of annual motorcycle fatalities in the United States.", "When asked why the regulation would only allow motorcyclists to maintain a speed below 75-miles per hour, [U.S. Department of Transportation representative James] Littleton made the following comment to reporters, “This is a crucial safety regulation that should have been implemented at least 20-years ago, now that we are finally implementing it, we want to ensure we do it right. With the exception of a few states that allow for 80-miles per mile freeway driving (Idaho, Montana, South Dakota, Utah, and Wyoming) and Texas who allows for speeds of up to 85-miles per hour on the freeway, most states allow a maximum speed of 75-miles per hour. We wanted to make it easy for motorcyclists in most all states to easily obey their respective posted speed limit.”", "Officials expect all motorcyclists and motorcycle manufactures to be in compliance with the new regulation by mid to late January 2017, however may file for a temporary 30, 60, or 90-day extension under select circumstances. According to Littleton, citations and fines will be imposed on both motorcyclists and motorcycle manufactures who fail to remain in compliance with the regulation.", "The sensational claim was one of several hoaxes recently promulgated by the Associated Media Coverage fake news site, the most popular of which pertained to purported laws that would affect specific subsets of the population (such as motorcyclists or e-cigarette users). The site spread a similar false claim about a motorcycle curfew in March 2016, falsely reported a looming FDA e-juice ban, fabricated a claim about several jurisdictions codifying a \"two pet maximum\" ordinance, and concocted a story about a transgender bathroom controversy-related shooting.", "While many fake news sites include disclaimer notices informing readers that their content is not credible, Associated Media Coverage does not. As such, many of the less ostentatious claims (such as the 75 MPH motorcycle speed governor one) spread on social media amid a targeted audience.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]