["A video is going viral in which burqa clad women are singing bhajans. While sharing this, it is being claimed that Muslim women in Dubai are singing Ram Bhajan and their husbands are supporting them by clapping. Many users on Twitter have made similar claims while sharing this video.", "Twitter user Munna Yadav shared the video with the same claim. He also said, “If it had happened in India, Islam would be in danger.”", "#दुबई_में मुस्लिम महिलाएं मस्जिदों में राम भजन करने के लिए एक नई पहल करती हैं और उनके शेख पति ताली बजाकर ताली बजाकर", "उनका साथ देते हैं, अगर भारत में होता तो इस्लाम खतरे में पड़ जाता। शेयर करें और 125 करोड़ लोगों तक पहुंचाएं… 👌👌#viralvideo pic.twitter.com/sldHUDw0Lk", "— Munna_Yadav (@Munna_YadavUP) March 22, 2023", "Another user, Girdhari Lal Indoriya, shared the video with a similar caption.", "👌👌👌👌👌👌👌👌👌 दुबई में मुस्लिम महिलाएं मस्जिदों में राम भजन करने के लिए एक नई पहल करती हैं और उनके शेख पति ताली बजाकर ताली बजाकर उनका साथ देते हैं, अगर भारत में होता तो इस्लाम खतरे में पड़ जाता। शेयर करें और 125 करोड़ लोगों तक पहुंचाएं……..*👇1/2 pic.twitter.com/yKJJZoEjSE", "— girdhari lal lndoriya (@Ind1Staking) March 18, 2023", "In 2021, it was viral on Twitter.", "🏹🚩 जय सनातन 🚩🏹जय श्री राम", "*दुबई में मुस्लिम ओरतो ने नई पहल करते हुए मस्ज़िद में राम भजन प्रस्तुत किया और उनके शेख पतियों ने ताली बजाकर लय बद्ध उनका साथ दिया, हिन्दुस्तान में होता तो इस्लाम खतरे में आ जाता। शेयर किजिये और 125 करोड लोगो तक पहुचाये..* 👇👇👇 pic.twitter.com/8Nftq00iTX", "— Jitendra Kr Sharma(काँकौरिया)(जीतू भईया) (@JeetuSharma80) March 7, 2021", "Even before that, in 2019, a user called P K Jadeja, whose bio describes him as a President’s award winning retired police officer, tweeted the video with the same claim.", "दुबई में मुस्लिम ओरतो ने नई पहल करते हुए मस्ज़िद में राम भजन प्रस्तुत किया और उनके शेख पतियों ने ताली बजाकर लय बद्ध उनका साथ दिया, हिन्दुस्तान में होता तो इस्लाम खतरे में आ जाता। शेयर किजिये और 125 करोड लोगो तक पहुचाये…👇🏻 pic.twitter.com/FX06ln7PQb", "— P K Jadeja (Ex DSP) (@Peekaay23) June 30, 2019", "Several Facebook users shared the video back then.", "In fact, Alt News found that this video along with this claim had been posted by a right-wing Facebook page Azaad Bharat in November 2018, and the share count exceeded 9,000.", "A simple search on Google with the keywords ‘mosque bhajan’ reveals a YouTube video of ABP News, which had fact-checked this claim twice on its ‘Viral Sach’ programme, first in August 2016 and later in February 2018. This suggests that this claim has been circulating on social media for at least four years or more. The same had been fact-checked by The Quint.", "The video is not from a mosque in Dubai as claimed, but from Prasanthi Nilayam, the ashram of spiritual guru Sathya Sai Baba at Puttaparthi in Andhra Pradesh. The event which took place in 2012 was attended by devotees from Bahrain, Iran, Kuwait, Oman, Qatar, Saudi Arabia, Syria, Turkey and the United Arab Emirates, according to a July 2013 report by Colombo Telegraph titled “Sai Baba’s Arabic-Islamic Flavour”. The entire video of the cultural event is posted below.", "In conclusion, the video of burqa-clad women singing bhajans is not from a mosque in Dubai, but from a cultural event organized at Sathya Sai Baba’s ashram in Puttaparthi, Andhra Pradesh.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…"]