["“We’re the first generation to feel the impact of climate change, and the last generation that can do something about it,” says a February 15, 2021 Facebook post that includes the two photos on the page of “Thinking Minds,” which describes itself as an “education website.”", "The post includes several photos from various regions of the world, but most prominent are two labeled “Amazonia,” purportedly from 2009 and 2019.", "The incorrectly dated images are also featured on the Facebook page of this environmental group and this one which calls itself “the official Facebook page of our Home Planet Earth.”", "A search for “Amazonia 2019” using social media analysis tool CrowdTangle showed similar posts had circulated that year as well. The popular hashtag #10YearChallenge led to a series of posts using side-by-side photos to point out environmental destruction that had occurred over a decade, but as with this post, AFP found that not all of the photos were shot in exactly the same place, or exactly 10 years apart.", "The “2019” Amazonia image, showing a patch of green isolated among deforested red soil, is in fact from 15 years prior to the stated date.", "A Google reverse image search led to the original, which environmental group Greenpeace confirmed to AFP was taken by one of its photographers on September 4, 2004 in Brazil’s Mato Grosso state.", "“It’s taken in an area cleared illegally for soya production,” a US-based Greenpeace spokesman, Ryan Schleeter, said by email. Mato Grosso is considered the capital of Brazil’s agribusiness sector. In 2004, it was the state hardest-hit by forest loss, and is still among the worst affected.", "A Google reverse image search for the photo labeled as being from 2009 showed that it has been carried by stock photo agencies, but none gave a date for when the picture was taken, nor did they give a more specific location other than Brazil.", "The picture was credited to photographer Gustavo Frazao. He confirmed in brief Instagram messages that the photo is his, saying he took it “on Amazon,” and that it “is not from that year 2009,” but rather several years later.", "The iStock by Getty Images agency shows an upload date of March 24, 2017 for the photo, and a reverse image search using TinEye found no examples of the image before March 2017.", "“Ideally it would be best to have a picture from the year they mention in the post, but these dynamics still take place in the Amazon, so the message itself is not wrong,” Cristiane Mazzetti, Forest Campaigner with Greenpeace Brazil, said by email.", "The Amazon region is one of the world’s most vital ecosystems. When its trees die or burn, they release their carbon back into the environment. In that way, deforestation is not a symptom of climate change -- as implied in the posts -- but a contributor to global warming.", "About 62 percent of the Amazon rainforest is in Brazil, where deforestation fell between 2004 and 2012 through policies including the creation of protected areas and measures that reduced forest conversion for soy crops, Mazzetti said.", "But deforestation began to worsen again after the country’s Congress in 2012 approved a new forestry law that gave amnesty to farmers who had illegally cleared forests, Mazzetti said, citing data from the Brazilian space agency’s PRODES monitoring program.", "The policies of President Jair Bolsonaro have added to the problem, leading in 2020 to the highest deforestation rate since 2008, she added. Bolsonaro, a climate change skeptic, was elected in 2018.", "A study released in December 2020 found that, across the nine countries and a French territory which the Amazon covers, deforestation totalled 513,016 square kilometers between 2000 and 2018.", "From a 2003 peak when more than 49,000 square kilometers of forest were razed, forest loss declined to about 17,700 square kilometers in 2010, said the report from RAISG, a consortium of civil society organizations.", "“However, since 2015 deforestation has begun to rise, and in 2018 more than 31,269 square kilometers of forest were cut down, the equivalent of one third of Portugal,” it said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]