["On October 2, TMC MP Derek O’Brien visited Uttar Pradesh to show solidarity with the alleged Hathras gang-rape victim’s family. Since then several social media users questioned his intentions and alleged that O’Brien doesn’t condemn atrocities in West Bengal. In this context, a photograph of a dead body hanging from a tree has been circulating on social media. “Punished for working for the BJP,” is inscribed on the man’s T-shirt. Several Twitter users posted the image claiming that a BJP worker was recently murdered by TMC goons.", "On the same day, Twitter user @arpispeaks wrote, “This is Trilochan Mahato, an 18-year-old boy from West Bengal. TMC activists murdered him and wrote on his T-shirt ‘This is a punishment for joining BJP’. And today TMC MP Derek O’Brien has gone to UP to talk about law and order. Do you see their disgusting politics?” This tweet gained over 7,000 retweets since it was posted. (archived link)", "(Translated from ये पश्चिम बंगाल का एक 18 साल का लड़का त्रिलोचन महतो है। जिसका TMC कार्यकर्ताओं ने हत्या कर दी और उसके टीशर्ट पर लिख दिया ‘ये भाजपा में शामिल होने का सज़ा है।’ और आज TMC सांसद डेरेक ओ ब्रायन यूपी गए है कानून व्यवस्था पर ज्ञान छिलने। घिनौनी राजनीति देख रहे हो इनके?)", "ये पश्चिम बंगाल का एक 18 साल का लड़का त्रिलोचन महतो है। जिसका TMC कार्यकर्ताओं ने हत्या कर दी और उसके टीशर्ट पर लिख दिया ‘ये भाजपा में शामिल होने का सज़ा है।’ और आज TMC सांसद डेरेक ओ ब्रायन यूपी गए है कानून व्यवस्था पर ज्ञान छिलने। घिनौनी राजनीति देख रहे हो इनके? pic.twitter.com/ngUylAHKfW", "— Arpita Jana ♓ (@arpispeaks) October 2, 2020", "Similarly, several other users posted the image implying it is a recent incident — @reclusiveIndian (archived link), @Aj15891 (archived link), and @aviral_mitta (archived link).", "This slideshow requires JavaScript.", "On October 5, BJP Bengal Vice President Arjun Singh claimed that Titagarh councillor, a strong voice against the ruling Mamata Banerjee government, was shot dead in the state. Kreately embedded the tweet by @arpispeaks in an article published the same day. The outlet claimed that the murder recently took place. Alt News has documented Kreately spreading misinformation on multiple occasions in the past. Its article gained over 1,500 retweets since October 5. (archived link)", "TMC कार्यकर्ताओं ने एक लड़के की हत्या कर टीशर्ट पर लिख दिया ‘ये भाजपा में शामिल होने का सज़ा है।’https://t.co/TLPtgHLPV2", "— Kreately (@KreatelyMedia) October 5, 2020", "The screenshot below highlights the section which states that the incident was recent (ताजा घटना).", "Alt News performed a reverse image search on Google and found that multiple media outlets had carried this image in their article. According to DNA, this is a 2018 incident that took place in the Purulia district of West Bengal.", "As per the report, the man in the viral image is 20-year old Trilochan Mahato, whom the BJP had claimed as its member. “An unsigned handwritten note in Bengali found near the body of the 20-year-old victim said that he was “punished for working for the BJP” during the recent rural polls in the state. The same was scribbled behind the T-shirt worn by Trilochan at the time of his death,” said the report.", "Home Minister Amit Shah had also tweeted the image two years ago.", "Deeply hurt by the brutal killing of our young karyakarta, Trilochan Mahato in Balarampur,West Bengal. A young life full of possibilities was brutally taken out under state’s patronage. He was hanged on a tree just because his ideology differed from that of state sponsored goons. pic.twitter.com/nHAEK09n7R", "— Amit Shah (@AmitShah) May 30, 2018", "On June 24, 2018, Punjabi Mahato (45) was arrested in connection with the murder.", "BJP Worker Trilochan Mahato murder case: A 45-year-old man was arrested earlier today in connection with the case. Body of Trilochan Mahato was found hanging from a tree in Balarampur’s Khudigora jungle (West Bengal) on May 30, 2018.", "— ANI (@ANI) June 24, 2018", "Therefore, an old incident was revived to give a false impression that it happened recently.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]