["One of the posts was this entry, which has been shared more than 1,900 times since it appeared on Facebook on January 5, 2019.", "The translated caption reads: \"God has willed it and no one can argue. Sulawesi people are flocking to the streets to support Mr. Jokowi in his re-election bid. Hopefully, he will win the election and enter his second term without trouble.\"", "Indonesia holds presidential elections in April that pit Widodo, popularly known as Jokowi, against Prabowo Subianto, a former military general who lost to Jokowi in the 2014 election.", "Using a Google Reverse Image search, AFP found that the images do not show a re-election campaign rally on Sulawesi island, as claimed in the post.", "The main and second photos were taken from an article in Indonesia’s Tribunnews.com which was dated May 11, 2014, and titled “JOKOWI joins a healthy walk event attended by thousands of Makassar citizens.”", "The two photos have an identical caption which translates as: “Presidential candidate endorsed by the Indonesian Democratic Party of Struggle, Joko Widodo, commences the ‘Healthy Walk With The People’ event at Sudirman street, Makassar, South Sulawesi, Sunday, May 11. The event was organised by the Team  of  Friends of  Eastern Indonesians and was joined by around 350,000 participants.”", "The third photo was taken from this July 29, 2018 article by Gosulsel.com, showing Widodo at a  similar event in Makassar -- this one was in connection with the Asian Games.", "The article, when translated to English, states: “(The) healthy walk event was joined by hundreds of thousands of Makassar citizens and was held as part of the promotion of the massive Asian Games event, which starts on August 18, 2018.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]