["About this rating", "A meme circulated on social media in late 2019 attributed four outrageous statements to various Democratic politicians, including 2020 presidential candidates former U.S. Vice President Joe Biden and Sen. Elizabeth Warren:", "All of these quotes are fabricated and do no reflect anything actually said by any of the persons listed.", "The quote attributed to Rep. Sheila Jackson Lee of Texas about \"homicide\" being \"the leading cause of murder\" originated with a now-defunct satire site called The Habanero of Texas. On Dec. 4, 2015, that site published a spoof article which read as follows:", "Congresswoman Sheila Jackson Lee [D-Houston] held an informal press conference today announcing that her administration, through great efforts and much expense, had completed a decade-old study that focused on the cause of murders in the United States. She was reported as saying that the results were predominantly leaning towards “homicide” as being the primary cause for the murders. The congresswoman was quoted as saying,", "“Datas (sic) uncover (sic) today give us a clearer portrait of a couple of possible cause (sic) for murder, but let’s be clear.. Changes in the atmospheres (sic) and combustibles (sic) also play a roles (sic) in how peoples (sic) are behave (sic). By continuing homicide (sic) and climate changes (sic) we are ascend (sic) ourselves to vulnables (sic), and we cannot deny that, Nor shall we, Nor shall I, Nor shall we all, So say we all (sic). End homicide and end climate change, and we end murder. THIS, we know.”", "For background, here is why we sometimes write about satire/humor.", "The Habanero of Texas.   \"Dem Sheila Jackson Lee Identifies ‘Homicide’ as Leading Cause of ‘Most’ Murders in America.\"\r\n    4 December 2015.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]