["About this rating", "On Feb. 2, 2021, the legal team representing former U.S. President Donald Trump in his second impeachment trial in the Senate presented their defense argument with a document containing a glaring misspelling.", "The brief was attached to this tweet posted by CNN reporter Jim Sciutto. In the salutation addressed to the Senate, \"United States\" is misspelled. Sciutto circled the mistake in yellow:", "Trump is facing impeachment for a second time over accusations he incited a deadly riot at the U.S. Capitol on Jan. 6, 2021. Five people died in the ensuing violence, including Capitol police officer Brian Sicknick. Two officers took their own lives in the aftermath and 140 officers, who were overrun by rioters as they stormed the building, were injured.", "The rioters were acting on a disinformation campaign aggressively promoted by Trump and his supporters, including members of Congress, that falsely claimed the November 2020 election was beset by a massive voter fraud conspiracy.", "Trump was previously impeached in December 2019 by the U.S. House of Representatives, which charged him with abuse of power and obstruction of Congress after Trump was accused of attempting to blackmail Ukraine into digging up dirt on his then-political opponent Joe Biden by withholding military aid. Trump was acquitted by the Senate, which was then under Republican control and did not allow new evidence or witnesses.", "If you or someone you know is experiencing a mental health, suicide or substance use crisis or emotional distress, reach out 24/7 to the 988 Suicide and Crisis Lifeline (formerly known as the National Suicide Prevention Lifeline) by dialing or texting 988 or using chat services at suicidepreventionlifeline.org to connect to a trained crisis counselor.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]