["The first television ad from Senate hopeful Deborah Ross, a North Carolina Democrat challenging Republican Sen. Richard Burr, paints Burr as a self-serving politician.", "It shows Ross talking on the phone with an actor playing Burr, lounging in a posh office.", "\"You took millions from special interests, went there and cashed in, voted to cut your own taxes and raise taxes on working folks,\" Ross tells the fictional Burr in the ad.", "A press release announcing the ad was even more direct: \"While Burr’s own wealth has tripled since he has been in the Senate, he has voted to raise taxes on the middle-class and working families while cutting them for millionaires like himself.\"", "The ad’s claim is a mouthful, but it makes some hefty allegations.", "We wondered if it was true that Burr became a millionaire in Washington then voted to cut taxes for millionaires like himself. And did he also vote to raise taxes on middle class and working families?", "Burr’s growing wealth", "The ad says Burr \"took millions from special interests, went (to D.C.) and cashed in.\"", "That’s a bit misleading, since special interests can’t give directly to politicians. That’s called bribery, and there’s no evidence Burr has taken bribes. But his campaigns have received millions from special interests.", "When Burr first ran for Senate in 2004, he received the most PAC contributions of any Senate candidate, according to a News & Observer report.", "This year, not much has changed. Burr’s campaign is the No. 1 recipient of contributions from the tobacco and pharmaceutical industries, according to the Center for Responsive Politics. Through June 30, 82 percent of the $8.7 million he has raised came from political action committees or large individual donors.", "By comparison, 74 percent of the $3.9 million Ross raised has come from PACs and large donors.", "Burr’s successful campaigning gives him a congressional salary of $174,000. That salary – plus investments in real estate and the stock market – helped Burr become a millionaire during his two decades in the House and Senate.", "He served in the House from 1995 to 2005, and in the Senate since 2005. In that time he has made about $3.6 million in pre-tax salary.", "We don’t know exactly how much he’s worth because of the rules about what liabilities and assets members of Congress do and don’t have to report.", "Roll Call, which compiles an annual ranking of members of Congress by minimum possible wealth, said Burr was worth a minimum of $1.6 million last year, ranked 44th in the Senate and 152nd overall. He was worth about $500,000 in 2004, when he first ran for Senate, according to the Center for Responsive Politics.", "Taxes on the wealthy", "Ross’ claim about Burr’s record on taxes is nearly identical to a claim made in a 2012 Wisconsin Senate race that PolitiFact rated Half True. Four years have passed, though, and we were curious if there was any new information.", "Both that previous claim and Ross’ ad cited votes cast in 2011 and 2012 in support of Rep. Paul Ryan’s budget proposals.", "Neither budget passed. But Ross spokesman Austin Vevurka said the ad specifically talked about what Burr voted to do, not what he has done.", "And the ad is correct that Burr did vote to cut taxes on wealthy people like himself. Ryan’s plans both years would’ve lowered the tax rates of all the highest income brackets, including Burr’s.", "Not counting his stocks, in 2012 Burr made $174,000 in Senate salary and owned real estate that brought in income somewhere between $115,002 and $1,050,000, according to his financial disclosure forms.", "His taxes would’ve dropped substantially had the budget passed, as it would’ve created just two income tax brackets: 10 and 25 percent. The income tax system, at that time and now, has six brackets and reaches nearly 40 percent at the top.", "Burr’s votes to help his fellow millionaires haven’t all been unsuccessful. In 2012, he and other Senate Republicans blocked discussion on the so-called Buffett Rule, which would’ve raised taxes on wealthy investors. That wasn’t a vote to cut taxes, but it was a vote to keep them at the same level.", "Taxes on the middle class", "The question of whether Burr voted to increase taxes on middle class or working people is trickier.", "That’s because Ryan’s budgets promised to cut income tax deductions and loopholes – but did not provide many specifics about what would be cut and what would remain, leading to speculation.", "\"Depending on which think tank you ask about the Ryan Budget, you will get a different answer,\" said Burr’s communications director, Becca Watkins. \"This is because the Ryan budget suggested tax simplification, but it did not specify how taxes should exactly be changed.\"", "Watkins is right. However, Ryan’s budget was clear that it would’ve kept the low tax rates on capital gains, dividends and other investment wealth.", "As a result, Peter Orszag, a banking executive and former budget wonk under both Bush and Obama, wrote in 2012 that of what remained to be cut, \"most of the other big tax breaks — such as the mortgage interest deduction, state and local tax deductibility, and pension and health tax benefits — help the middle class.\"", "That same year, an analysis found that households earning between $50,000 and $100,000 would see their taxes increase by $1,358 annually if Ryan’s budget passed, and upper middle class households making between $100,000 and $200,000 would see an increase of $2,681.", "However, like anything else analyzing the budget, that report had to rely on speculation. It also was commissioned by a Congressional committee led by Democrats.", "Ross did cite one piece of evidence the previous Half True claim did not – a 2013 study that found tax reforms that Burr voted for that year (which, yet again, failed) would have possibly raised taxes on middle class families. But again, its numbers were speculative and it was done by a liberal think tank. It also acknowledged there could’ve been ways to avoid increasing taxes on the middle class, such as increasing the deficit.", "Watkins said Burr didn’t think Ryan’s budgets were \"perfect,\" but he feared budgets proposed by Democrats would’ve led to even higher taxes.", "\"To suggest he supports increasing taxes on the middle class is baseless,\" she said.", "Our ruling", "Ross said Burr \"took millions from special interests, went there and cashed in, voted to cut (his) own taxes and raise taxes on working folks.\"", "The part about special interest money needs clarification. The part about tax cuts for the wealthy is accurate, but the part about raising taxes on the middle class is purely speculative – it could be right or it could be wrong, and we simply can’t know for sure.", "The ad’s claims are partially accurate but need additional information, so we rate this claim Half True.", "Email interview with Austin Vevruka, Ross spokesman", "Email interview with Becca Watkins, Burr spokeswoman", "The News & Observer, Aug. 22, 2016, \"Ross’ first TV ad hits Burr as insider\"", "The Heritage Foundation, May 2011, \"Ten Myths of Ryan’s House Budget Plan\"", "Paul Ryan’s 2012-13 budget plan", "Report by the chairman’s staff of the U.S. Congress Joint Economic Committee, June 2012, \"Winners and Losers: Understanding the Ryan Plan’s Potential Tax Implications for America’s Workers\"", "Senators’ financial disclosures can be found by searching here", "Center for Responsive Politics, graph of Burr’s estimated net worth over time compared to the Senate average", "Roll Call, Wealth of Congress Index, 2015", "Center for Responsive Politics, fundraising and spending figures for 2016 N.C. Senate race", "Salaries for the U.S. House and Senate through history", "Center on Budget and Policy Priorities,March 2013, \"The Ryan Budget’s Tax Cuts: Nearly $6 Trillion in Cost and No Plausible Way to Pay for It\"", "PolitiFact, Aug. 27, 2012, \"Baldwin says Thompson wants to give millionaires a tax cut while raising taxes on the middle class\"", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]