["BJP MLA Indu Tiwari from Jabalpur, Madhya Pradesh tweeted a 19-second video alleging that it shows journalist Ravish Kumar. “Do you recognise this messiah journalist? He is known for imparting his personal takes on journalism to the world. He believes today’s journalism is a joke,” wrote Tiwari. The video shows a reporter rolling on the street.", "इस मसीहा पत्रकार को पहचानते हैं? ये दुनिया को पत्रकारिता पर ज्ञान देने की खान हैं। इन्हें आजकल की पत्रकारिता इन्हें मज़ाक़ लगता है। क़ैदें हैं रविश कुमार। @SushantBSinha @anuraagmuskaan @KapilMishra_IND @TajinderBagga @Rajput_Ramesh @DChaurasia2312 @SureshNakhua @beingarun28 pic.twitter.com/zm260NbCmN", "— Indu Tiwari (@indutiwarijbp) September 29, 2020", "The same video was shared by journalist Sushant Sinha. While not mentioning any names, he wrote, “Do you recognize this messiah journalist? (Hint: He is known to impart his knowledge on journalism to the world)”. (archived link to the tweet) Singh describes himself as a Google-certified fact-checker.", "इस मसीहा पत्रकार को पहचानते हैं? (Hint: ये दुनिया को पत्रकारिता पर ज्ञान देने की खान हैं) pic.twitter.com/sxXHhKPbw1", "— Sushant Sinha (@SushantBSinha) September 29, 2020", "The clip has also been tweeted by several Twitter handles claiming it features Ravish Kumar. Among these handles were @choga_don, @Humor_Silly, and @coolfunnytshirt. Twitter user @BefittingFacts also mocked Kumar by sharing a screenshot taken from the viral video along with some other pictures of the journalist.", "Dances on road, Drives E Rikshaw, Rides Rikshaw Gets Shaved and now gives moral lecture. pic.twitter.com/qXorlLtQ7B", "— Shash (@BefittingFacts) September 29, 2020", "This video is viral on Facebook with this claim.", "The clip widespread on social media is part of a bloopers video posted by NDTV on YouTube in August 2013. The video is a compilation of amusing moments featuring NDTV anchors and reporters in 2006.", "A closer look at the clip indicates that the correspondent holding the mic is not Ravish Kumar, but Jammu and Kashmir-based journalist Fayaz Bukhari.", "Alt News contacted Bukhari who confirmed it was him in the video. “There was a Congress rally which came under fidayeen (suicide) attack in May 2006. I was reporting live after the attack but all of a sudden there was heavy firing and I was in the open doing the live broadcast without any cover. The camera persons had taken cover and I was the only one who was exposed to fire. I ducked and rolled to get cover, same as the other camera persons, to save myself from any direct fire,” he explained.", "We checked the archive of the 2006 shooting incident in Kashmir. The Associated Press (AP) had uploaded a video of the attack on YouTube in 2015. The organisation reported that seven people died while 20 were injured in the shootout. The video shows journalists and cameramen trying to protect themselves from the gunfire.", "We noticed that a camera on a tripod in the AP video is the same as the one seen in the background of the viral video. The visual similarities confirmed that the NDTV clip pertained to the 2006 attack.", "An article in Outlook Magazine from May 2006 also covered the suicide attack.", "Thus, the viral clip does not feature Ravish Kumar but Jammu and Kashmir journalist Fayaz Bukhari. While NDTV included the clip in a bloopers video, a reporter attempting to save himself from a terror attack is hardly amusing.", "Alt News also reached out to Ravish Kumar who informed that multiple people have inquired about the video. “It is the person circulating the video who should be questioned. They would’ve known the context had they asked for the complete video. I was not at the spot. Had I been there, I would’ve tried to find out the reporter’s reasons [for rolling on the ground]. You cannot share this video and veil the antics of Arnab Goswami and pliable journalists who follow his suit. I knew the clip featured Mr Fayaz Bukhari from Srinagar. What should the people who fell for the video do? They should at least think about how the ones who release such clips consider them gullible enough to believe anything. This is the entire model. Keep bluffing and confusing people. I am both amused and feel a sense of pity for the ones who fell for the clip. They must be exposed to countless such misleading videos. May God give them wisdom.”", "The video was shared on social media to mock journalist Ravish Kumar who often finds himself in the crosshairs of misinformation. But another point worthy of mention is NDTV’s insensitivity toward journalist Fayaz Bukhari reporting on the aftermath of a terror attack. That NDTV picked up a clip of his attempts to save himself from gunfire is unfortunate. It should not have found a place in a bloopers video meant for humour.", "Donate Now", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]