["Today’s federal debt pales in comparison to what the government owed during World War II, according to U.S. Rep. Rush Holt.\n\nThe congressman said in a recent telephone town hall meeting that despite facing mounds of debt in 1944, the United States made major investments in education. Yet now, lawmakers are talking about cutting federal aid for education when the nation’s debt is half of what it was 67 years ago, he claimed.\n\n\"In 1944, this country was in debt like we had never been before or have been since. I'll repeat that. We were in debt more than twice as much as we are now,\" Holt (D-12th Dist.) said on Dec. 6.\n\nThe U.S. had more than twice as much debt in 1944 as it does now? Not by any measure.\n\nThe problem is Holt said debt, when his spokesman said he meant deficit.\n\nHere’s the difference between the two:\n\nDeficit is the shortfall in a year. If the government spends more than it takes in, the difference is the deficit.\n\nDebt is what the government owes from the accumulation of past deficits and surpluses.\n\nAfter many years of spending beyond its means, the federal government’s gross debt is more than $15 trillion. That figure includes debt held by the public and intragovernmental holdings, essentially money the government owes itself.\n\nSome economists prefer to focus on debt held by the public, since it is what the government has borrowed from outside entities. We’ll compare how both measures of debt have fared between 1944 and now.\n\nAt the end of fiscal year 1944, as the U.S. was embroiled in World War II, total debt stood at more than $204 billion. Nearly $185 billion of that was held by the public, according to data from the White House Office of Management and Budget. As a percentage of gross domestic product, a yardstick of a nation’s economy, the total debt in 1944 was 97.6 percent and debt held by the public was 88.3 percent.\n\nAs of Dec. 13, the nation’s total debt amounted to more than $15 trillion, of which nearly $10.4 trillion is publicly held. By the most recent data released by the U.S. Bureau of Economic Analysis, that debt represents more than 99.2 percent of gross domestic product and nearly 68.5 percent of gross domestic product, respectively.\n\nSo, by those measures, Holt’s claim is off.\n\nThomas Seay, a spokesman for Holt, said the statement was \"intended as a reference to the annual U.S. budget deficit as a percentage of GDP – that is, to how quickly America was falling into debt.\"\n\nIn 1944, the deficit measured up to 22.7 percent of the nation’s economy, according to the Office of Management and Budget. In fiscal year 2011, the deficit was 8.7 percent of gross domestic product, according to the Congressional Budget Office.\n\nStill, as Gerald Lynch, a professor of economics at Purdue University, noted in an email, \"If the congressman wanted to say we were racking up debt then at a rate twice what we are today, then that would be ok to refer to the deficit to gdp ratio. To say that we were in twice as much debt is not correct.\"\n\nOur ruling\n\nHolt claimed that in 1944 \"we were in debt more than twice as much as we are now.\"\n\nBy any measure of the debt, the congressman’s statement is wrong. A spokesman said Holt meant to talk about the deficit but he used the word debt..\n\nWe rate the statement False.", "To comment on this ruling, go to NJ.com.", "Office of Rep. Rush Holt, Recording of telephone town hall meeting, Dec. 6, 2011\n\nEmail interview with Thomas Seay, communications director for U.S. Rep. Rush Holt, Dec. 12, 2011\n\nU.S. Treasury Department, Historical Debt Outstanding – Annual, accessed Dec. 12, 2011\n\nOffice of Management and Budget table, \"Historical Tables,\" accessed Dec. 12, 2011.\n\nU.S. Bureau of Economic Analysis, National Income and Product Accounts Gross Domestic Product, 3rd quarter 2011, accessed Dec. 12, 2011\n\nEmail interview with Gerald Lynch, professor of economics at Purdue University’s Krannert School of Management, Dec. 14, 2011\n\nCongressional Budget Office, The U.S. Federal Budget: Infographic, Dec. 2011", "Congressional Budget Office, Federal Budget Deficit for Fiscal Year 2011: $1.3 Trillion, Nov. 8, 2011", "U.S. Department of Treasury, Bureau of Public Debt,  \"The Debt to the Penny and Who Holds It,\" accessed Dec. 15, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]