["About this rating", "Pinkeye, or conjunctivitis, is a known but rare symptom of COVID-19, particularly among children.", "However, this symptom is not very common according to studies, and having pinkeye does not necessarily mean that one has COVID-19.", "When Republican U.S. Vice President Mike Pence and Democratic vice presidential candidate Kamala Harris took to the election debate stage on Oct. 7, 2020, viewers noticed something unusual about Pence. His left eye appeared pink, resulting in speculation over whether he had pinkeye, also known as conjunctivitis, which is a bacterial or viral infection that causes an inflammation of the membrane lining one’s eyelid and covering the white part of the eyeball.", "Eagle-eyed viewers of the debate honed in on Pence's face:", "We received questions from our readers over whether pinkeye was a symptom of COVID-19. Although the White House said that Pence tested negative for COVID-19 prior to the debate, and we could not confirm if he had contracted either disease, we know that pinkeye is one possible — but rare — symptom of COVID-19.", "The World Health Organization (WHO) has said that COVID-19 can spread through the eyes through droplet transmission: “Droplet transmission occurs when a person is in in close contact [...] with someone who has respiratory symptoms (e.g., coughing or sneezing) and is therefore at risk of having his/her mucosae (mouth and nose) or conjunctiva (eyes) exposed to potentially infective respiratory droplets.”", "The infection also spreads when one touches infected hands to one's eyes.", "An analysis from May 2020 looked at the prevalence of conjunctivitis in COVID-19 patients across different studies, and found that out of 1,167 patients, 1.1 percent had conjunctivitis, and for those who were severely ill, the rate was higher at 3 percent. The study also stated:", "Recent studies showed that conjunctivitis could be a manifestation of COVID‐19. Because the eye could be considered as a direct potential portal of entry for the virus, it is of interest to analyze the association between conjunctivitis and the severity of COVID‐19; scarce and conflicting data have been reported. In particular, only three studies in Chinese population described this topic, with different results. Xia et al did not find an increased incidence of conjunctivitis in severe COVID‐19; they performed a prospective study in 30 COVID‐19 patients to assess the presence of the virus in the tears. Conversely, Guan et al, who retrospectively analyzed clinical characteristics of 1099 COVID‐19 patients, and Wu et al, who retrospectively investigated the ocular characteristics of 38 COVID‐19 patients, reported an increased incidence of conjunctivitis in patients with severe disease.", "A September study stated that conjunctivitis is “not a common manifestation of the disease, but contact with infected eyes could be one route of transmission.”", "According to the American Academy of Ophthalmology (AAO), it might be possible for coronavirus to cause a pinkeye infection, but it is rare. They cited an August study that looked at children in Wuhan, China, who were infected with COVID-19. Out of 216 hospitalized children, 49 had “ocular manifestations, including conjunctival discharge, eye rubbing, and conjunctival congestion. Children with systemic symptoms or cough were more likely to develop ocular symptoms, which were mild, and recovered or improved with minimal eye drops or self-healing.”", "But Sonali Tuli, clinical spokesperson for the AAO, added that the above study did not conduct a swab of the children's eyes: “Lots of things can cause conjunctivitis, such as colds, different viruses and bacteria. Without a swab, we can’t confirm that the reported eye symptoms were really caused by the coronavirus.” The AAO concluded that if children had pinkeye and were not exposed to someone with COVID-19, then it was unlikely that the virus caused the pinkeye.", "Update: On Oct. 8, 2020, news broke that the White House doctors had cleared the vice president of pinkeye, and according to an official, Pence had suffered from a broken blood vessel in his eye.", "We can confirm that pinkeye is a known but rare symptom of COVID-19, particularly because the virus can enter the body through the eye. We therefore rate this claim “Mostly True.”", "Aldous, Peter and Craig Silverman.   \"Mike Pence's Eye Prompted A Lot Of Chatter. Here Are The Facts About COVID-19 And Pinkeye.\"\r\n   Buzzfeed.   7 October 2020.", "Amesty, María A et al. “COVID-19 Disease and Ophthalmology: An Update.”\r\n   Ophthalmology and Therapy vol. 9,3.   2020.", "Elkind, Elizabeth.   \"Pence's Negative COVID-19 Test Could be \"Meaningless,\" Doctor Warns Ahead of VP Debate.\"\r\n   CBS News.   7 October 2020.", "Hazanchuk, Vered.   \"Pinkeye May Be a Symptom of COVID-19 in Children, New Study Suggests.\"\r\n   American Academy of Ophthalmology.   27 August 2020.", "Loffredo, Lorenzo et al.   \"Conjunctivitis and COVID-19: A Meta-Analysis.”\r\n   Journal of Medical Virology, 10.1002/jmv.25938.   24 April 2020.", "Mayo Clinic.   \"Pinkeye (Conjunctivitis).\"\r\n   Accessed on 8 October 2020.", "Mukamal, Reena.   \"Eye Care During the Coronavirus Pandemic (COVID-19).\"\r\n  American Academy of Ophthalmology.   22 May 2020.", "Nan Ma et al.   \"Ocular Manifestations and Clinical Characteristics of Children With Laboratory-Confirmed COVID-19 in Wuhan, China.\"\r\n   JAMA Ophthalmology.    26 August 2020.", "Orr, Gabby.   \"What Caused Mike Pence’s Bloody Eye.\"\r\n   Politico.   8 October 2020.", "World Health Organization.   \"Modes of Transmission of Virus Causing COVID-19: Implications for IPC Precaution Recommendations.\"\r\n   29 March 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]