["About this rating", "On 16 September 2018, Christine Blasey Ford identified herself publicly as the woman who wrote a confidential letter to Senator Dianne Feinstein alleging that Supreme Court nominee Brett Kavanaugh, in the presence of his classmate Mark Judge, had sexually assaulted her in the 1980s when he was a student at Georgetown Prep, leading to tense negotiations about if and when Ford would testify before the Judiciary Committee. Following Blasey Ford’s disclosure, several attempts were made to insinuate that Blasey Ford had confused Kavanaugh with another man, something she categorically denied as a possibility.", "The first prominent presentation of this argument was offered in a now-deleted, defamatory, and false Twitter thread from Ed Whelan, the president (currently on leave) of the conservative think tank the Ethics and Public Policy Center. In a series of Tweets, Whelan utilized comments left on Facebook posts, floor plans found on the real estate website Zillow, and yearbook photographs to accuse (by name) another Georgetown Prep classmate of the assault, based primarily on his physical similarities with a young Kavanaugh. Through her lawyers, Blasey Ford dismissed this possibility:", "“I knew them both, and socialized with” the classmate, [Blasey Ford] said. She noted that she had once even visited the classmate in the hospital. “There is zero chance that I would confuse them.”", "Whelan later apologized for the incident and was placed on a leave of absence from the Ethics and Public Policy Center.", "“I made an appalling and inexcusable mistake of judgment in posting the tweet thread in a way that identified Kavanaugh’s Georgetown Prep classmate,” Mr. Whelan Tweeted on 21 September 2018. “I take full responsibility for that mistake, and I deeply apologize for it. I realize that does not undo the mistake.”", "On 26 September 2018, the night before Blasey Ford was scheduled to testify before the Senate Judiciary Committee, committee chair Chuck Grassley released a report that had the effect of suggesting, for a second time, that Blasey Ford's memories were confused. According to this report, between 24 and 26 September 2018, two separate men reached out to the committee claiming that they were in fact the person who assaulted Blasey Ford. The report, a timeline of investigative actions which Grassley maintained his committee undertook, included three references to these two individuals:", "24 September 2018: Committee staff have first interview with a man who believes he, not Judge Kavanaugh, had the encounter with Dr. Ford in 1982 that is the basis of his complaint. He submitted a written statement earlier in the day.", "25 September 2018: Committee staff have a second interview with a man who believes he, not Judge Kavanaugh, had the encounter with Dr. Ford in the summer of 1982 that is the basis of her allegation. He described his recollection of their interaction in some detail.", "26 September 2018: Committee investigative staff spoke via phone with another man who believes he, not Judge Kavanuagh, had an encounter with Dr. Ford in 1982 that is the basis of her allegation. He explained his recollection of the details of the encounter.", "The allegations made by these men, though offered “in some detail” in one case, have not been publicly outlined, and it is not clear if both of these men allege themselves to be the primary assailant, or if one of them alleges to have been the second man in the room at the time of the assault. For obvious reasons, both men cannot be correct if they both assert to be the person allegedly confused for Brett Kavanaugh.", "On 27 September 2018, during her sworn testimony, Ford was asked several times under oath if she could have confused Kavanaugh for someone else, and each time she emphatically and categorically denied such a possibility, first in an exchange with Senator Feinstein:", "FEINSTEIN: I want to ask you one question about the attack itself. You were very clear about the attack. Being pushed into the room, you say you don’t know quite by whom, but that it was Brett Kavanaugh that covered your mouth to prevent you from screaming, and then you escaped. How are you so sure that it was he?", "FORD: The same way that I’m sure that I’m talking to you right now. It’s — just basic memory functions. And also just the level of norepinephrine and epinephrine in the brain that, sort of, as you know, encodes — that neurotransmitter encodes memories into the hippocampus. And so, the trauma-related experience, then, is kind of locked there, whereas other details kind of drift.", "FEINSTEIN: So what you are telling us is this could not be a case of mistaken identity?", "FORD: Absolutely not.", "In an exchange with Senator Patrick Leahy, Ford reiterated this point and provided additional information about the person whom Ed Whelan falsely accused of the assault, indicating she knew this other man well at that time:", "LEAHY: Now, how did you know Brett Kavanaugh and Mark Judge? And is it possible that you had mixed them up with somebody else?", "FORD: No, it is not. And the person that was blamed [by Whelan] for the incident is actually the person who introduced me to them originally. So he was a member of Columbia Country Club. And I don’t want to talk about him because I think it’s unfair, but he is the person that — that introduced me to them.", "LEAHY: But you — you would not mix up somebody else with Brett Kavanaugh, is that correct?", "FORD: Correct.", "LEAHY: Or Mark Judge.", "FORD: Correct.", "In response to a question from Senator Dick Durbin about her level of certainty that Kavanaugh was the assailant, Dr. Ford said she was 100% certain:", "DURBIN: Dr. Ford, with what degree of certainty do you believe Brett Kavanaugh assaulted you?", "FORD: One hundred percent.", "DURBIN: One hundred percent.", "No additional information has yet been made available regarding the claims put forward by the two men interviewed by the Senate Judiciary Committee staff.", "Brown, Emma.   \"California Professor, Writer of Confidential Brett Kavanaugh Letter, Speaks Out About Her Allegation of Sexual Assault.\"\r\n    The Washington Post.   16 September 2018.", "Forgey, Quint.   \"Ed Whelan Taking 'Leave of Absence' After Posting Kavanaugh Theory.\"\r\n    Politico.   23 September 2018.", "Fandos, Nicholas.   \"Conservative Pundit Points Finger at Another Man to Deflect from Kavanaugh.\"\r\n    The New York Times.   21 September 2018.", "Senate Committee on the Judiciary.   “Summary of Actions by Chairman Grassley and the Senate Judiciary Committee Related to Allegations Made and Disputed Regarding Judge Brett Kavanaugh.\"\r\n    26 September 2018.", "The Washington Post.   “Kavanaugh Hearing: Transcript.\"\r\n    27 September 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]