["By Eugene Kiely and Robert Farley", "Posted on August 16, 2017", "President Donald Trump held a contentious press conference in which he answered critics who said he waited too long to condemn the white nationalists who staged a protest in Charlottesville, Virginia, on Aug. 12 that turned violent. Here we put into context some of the statements that the president made in his defense:", "Trump answered questions about the white nationalist rally in Charlottesville for the first time at a press conference on Aug. 15.", "At the event, the president discussed his first response to the Charlottesville violence on Aug. 12. The president held a bill-signing ceremony at about 3:30 p.m. on Aug. 12 — about four hours after the Virginia governor declared a state of emergency and about two hours after a speeding car plowed into counterprotesters. That attack killed one person and injured many others.", "In his Aug. 12 remarks, the president blamed “many sides” for the violence in Charlottesville. “We condemn in the strongest possible terms this egregious display of hatred, bigotry and violence on many sides, on many sides,” Trump said at the time. It wasn’t until two days later that he condemned “the KKK, neo-Nazis, white supremacists, and other hate groups.”", "Asked why he waited “so long” to publicly denounce white nationalists for the violence, Trump said that he was waiting for more information, claiming “a lot of the event didn’t even happen yet, as we were speaking.”", "Trump, Aug. 15: Here’s the thing. When I make a statement, I like to be correct. I want the facts. This event just happened. In fact, a lot of the event didn’t even happen yet, as we were speaking. This event just happened.", "Trump went on to say that when he spoke about Charlottesville at the bill signing he didn’t even know that Duke, the former Ku Klux Klan grand wizard, was at the rally. “I didn’t know David Duke was there,” he said. “I wanted to see the facts.”", "We don’t know what the president knew at the time of his remarks, but we present here a timeline of events. We note a few things: Trump’s bill-signing event was at 3:30 p.m. — about five hours after the violence first broke out, about four hours after the declaration of emergency, three hours after the state police started to make arrests, and nearly two hours after the car attack.", "The driver of the car hadn’t been identified when Trump spoke at the bill signing. But videos of the car attack were widely reported before Trump spoke, and witnesses described it as “absolutely intentional,” as Fox News reported.", "As for Duke, CNN aired an interview with the former Klan leader at about two hours before Trump spoke. In the interview, Duke called the rally a “turning point,” saying those at the rally were going to “fulfill the promises of Donald Trump.” Duke had also tweeted about the rally — including a pair of tweets criticizing Trump at about an hour-and-a-half before Trump’s remarks.", "Jason Kessler, a Charlottesville resident, organized the rally. Kessler is the founder of Unity & Security For America, a group described by the Southern Poverty Law Center as “a nativist, white nationalist group.” Richard Spencer, a leading white nationalist, was scheduled to speak at the rally.", "Here’s the timeline of events on Aug. 12:", "7:39 a.m. – David Duke, the former Klan leader, tweets, “Today will be a historic day, remembered as the moment everything changed. #Charlottesville #UniteTheRight”", "8:30 a.m. – Demonstrators begin to gather. The Virginia State Police posts a photo at 8:40 a.m. on its Twitter account of men carrying weapons and wearing fatigues. “Participants for today’s rally at Emancipation Park in Charlottesville begin to arrive. #cvilleaug12”", "10:30 a.m. – First outbreak of violence.", "11 a.m. – CNN leads its 11 a.m. hour with footage of the clashes between the protesters and counterprotesters. White nationalists can be seen holding wooden shields, carrying weapons and wearing helmets.", "11:28 a.m. – Virginia governor declares a state of emergency.", "11:37 a.m. – Virginia State Police tweets, “UPDATE: Unlawful assembly declared at Charlottesville rally #cvilleaug12”", "11:55 a.m. – Police start to make arrests. State police tweets at 11:55 a.m., “Arrests are being made following declaration of unlawful assembly at Emancipation Park in Charlottesville. #cvilleaug12”", "12:40 p.m. – Protesters and counterprotesters gather at nearby Justice Park.", "1:02 p.m. – Corinne Geller, a spokeswoman for Virginia State Police, says in an interview with Fox News that “all sides” had engaged in throwing bottles and other debris in what had been — as of that point — a violent, but non-fatal confrontation.", "1:19 p.m. – Trump tweets, “We ALL must be united & condemn all that hate stands for. There is no place for this kind of violence in America. Lets come together as one!”", "1:31 p.m. – CNN airs an interview with Duke at the rally, which he said represents a “turning point.” The former Klan grand wizard said, “We’re going to fulfill the promises of Donald Trump. That’s what we believed in. That’s why we voted for Donald Trump, because he said we’re going to take our country back. And that’s what we gotta do.”", "1:40 p.m. – A driver, later identified as James Alex Fields Jr., speeds down Fourth Street and into a crowd of counterprotesters who are marching in the street. Fields then throws the car in reverse and speeds away.", "2:01 p.m. – On Twitter, Duke criticizes Trump’s tweet calling for everyone to “condemn all that hate stands for.” Duke retweets Trump’s post and writes, “So, after decades of White Americans being targeted for discriminated & anti-White hatred, we come together as a people, and you attack us?”", "2:03 p.m. – Duke posts a second tweet to Trump. In it, Duke says, “I would recommend you take a good look in the mirror & remember it was White Americans who put you in the presidency, not radical leftists.”", "2:14 p.m. – Virginia State Police posts a photo of the crash scene, saying “several pedestrians” were struck and that there were “multiple injuries.”", "2:49 p.m. – Fox News posts a video of the car attack. The Fox News reporter says that witnesses described the attack as “absolutely intentional.”", "3:30 p.m. – CNN reports it had “now confirmed from Charlottesville Mayor Mike Signer that one person has died, in fact, today during the violent events in the city.”", "3:33 p.m. – Trump speaks about Charlottesville at a bill-signing ceremony. He blames “many sides” for the violence.", "4:18 p.m. – Fox News tweets that the driver was in custody for “intentional collaborated car attack in #charlottesville.”", "5 p.m. – Shortly after 5 p.m., a Virginia State Police helicopter monitoring the rally crashes and two state troopers are killed.", "We would also note that Trump hasn’t always waited for “the facts” before weighing in on a tragedy.", "For example, Trump wasted little time in speculating that terrorism was to blame for the disappearance of an EgyptAir plane carrying 66 people over the Mediterranean in the early morning hours of May 19, 2016. “Looks like yet another terrorist attack,” Trump tweeted less than 12 hours after the plane went missing.", "Looks like yet another terrorist attack. Airplane departed from Paris. When will we get tough, smart and vigilant? Great hate and sickness!", "— Donald J. Trump (@realDonaldTrump) May 19, 2016", "The cause of the crash still remains unknown. In May, French investigators contradicted earlier reports that traces of explosives were found on the bodies of victims. And in June, it was reported that French authorities were looking into the possibility that the crash may have been caused by an overheated mobile device in the cockpit.", "The day after the mass shooting at a nightclub in Orlando on June, 12, 2016, Trump made a series of inaccurate statements related to the incident.", "In an interview on CNN, Trump said “many people” thought the Orlando shooter, Omar Mateen, “was a whack job,” but they didn’t report him. In fact, Mateen’s co-workers in 2013 reported that he boasted of having terrorist ties, and the FBI investigated and interviewed him.", "In the same interview, Trump specifically singled out Muslims for failing to cooperate with law enforcement. He said, “For some reason, the Muslim community does not report people like this.” That was wrong, too.", "Mohammed A. Malik, who had known Mateen since 2006, wrote in the Washington Post on June 20, 2016, that he contacted the FBI in 2014 after he learned that Mateen had been watching videotapes of “Anwar al-Awlaki, the charismatic Yemen-based imam who helped radicalize several Muslims.” Malik said he wrote his op-ed to refute Trump’s claim that “the Muslim community does not report people like this.” Malik writes, “I’m just tired of negative rhetoric and ignorant comments about my faith.”", "A day after the Orlando shooting, Trump also repeated the baseless claim that “many people,” including neighbors of the earlier San Bernardino shooters, saw “bombs all over the floor” of the apartment, but did not report it to authorities because of concerns about racial profiling. There is still no evidence of that.", "FactCheck.org Rating:", "Read More", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]