["Gov. Rick Perry has expressed reservations about Arizona's hard-line immigration law which requires legal immigrants to carry documents identifying their legal status and which critics say encourages unconstitutional racial profiling.", "Boyd Richie, chair of the Texas Democratic Party, also disagrees with the Arizona law, though Richie doesn't think much of Perry. \"For 10 years as governor, Rick Perry has played politics when leadership was needed on border and immigration issues,\" Richie said in a press release issued April 30, \"from wasteful border cameras that cost $153,800 per arrest to his failure to involve border sheriffs in developing plans to prevent violence in their communities.\"", "We're not gauging if the video cameras lining the 1,200-mile Texas-Mexico border are wasteful; that's an opinion. Besides, toss in 24 additional reported arrests attributed in some way to the cameras since The Texas Tribune developed the per-arrest estimate and the so-called cost per arrest becomes $80,000 — an average that stands to decrease as arrests mount.", "We're focusing on whether Perry has failed to involve sheriffs in border security plans — especially the \"spillover violence contingency plan\" developed last year. Perry's office earlier spearheaded two other law enforcement initatives on the border, Operation Linebacker in 2006 and Operation Border Star in 2007.", "On behalf of Richie's claim, Democratic spokeswoman Daniela Santoni sent us a March 17 letter to Perry from Elfrain Valdez, mayor of Del Rio and chairman of the Texas Border Coalition, which advocates for security on the Texas-Mexico border. Valdez airs frustration that Perry hadn't consulted coalition members before activating the first phase of the state's spillover violence plan March 16. That move upped law enforcement, sent two helicopters to the border and put Ranger Reconnaissance and SWAT teams on standby. The day before, gunmen had killed two Americans in Ciudad Juarez, Mexico, across the border from El Paso.", "Valdez writes: \"Along with my elected colleagues on the border, I have watched with interest the announcement that you are activating the first phase of your Spillover Violence Contingency Plan. We live on the border and have responsibility for our communities and our citizens. However, at this point we are learning about your plans along with everyone else.\"", "Santoni also forwarded several news stories, two covering the coalition's discontent and echoing border leaders' concerns that violence hasn't spilled from Mexico into Texas. The third, a March 22 article in The Tribune, says Perry didn't alert Hidalgo County Sheriff Lupe Trevino and others before activating the spillover violence plan — with El Paso being the only city alerted before the activation.", "Perry spokeswoman Katherine Cesinger disputed the report, telling us the spillover violence plan \"was developed in early 2009 with input from our local and federal law enforcement partners to prepare for the possibility of violence spilling over into the United States.\"", "Separately, Don Reay, executive director of the Texas Border Sheriff's Coalition, said Perry may have \"failed to include the mayors, but he certainly didn't fail to include law enforcement agencies.\" Sheriffs of the 18 border counties formed the group in 2005 to lobby for funding for border security.", "We didn't attempt to reach every border sheriff, but law officers in Hudspeth County, east of El Paso, Terrell County, adjacent to Big Bend National Park, and Hidalgo County, more toward the east end of the border, said the governor's office has kept them well informed, partly through e-mails sent from their respective Joint Operational and Intelligence Centers — there are five, in El Paso, Laredo, Del Rio, Victoria and Rio Grande Valley.", "Hidalgo County Sheriff Trevino, whose community is adjacent to frequent gun battles in Reynosa, Mexico, said information flow from Perry's office could have been better when the spillover plan was implemented in March, but generally communication \"between the state and the local and the federal agencies, at least in my area, is excellent. We receive daily briefings, we are on top of everything, we have great coordination, we have very frequent meetings where we discuss trends.\"", "When we told Richie's camp that at least some sheriffs disagree with Richie's statement, Santoni stood by the party's original cache of news articles. She added: \"We consider the activation of a plan a central component of the development of a plan.\"", "All told, where does that leave Richie's statement that Perry failed to involve border sheriffs in developing plans to prevent violence in their communities?", "Lacking, only partly because most of Richie's evidence stems from border mayors who said Perry didn't notify them before activating the state's spillover security plan. Besides, Richie was absolute in his wording, suggesting that Perry didn't involve border sheriffs at all.", "Not so, we're persuaded. According to what we heard, the governor has worked with border sheriffs on security plans.", "We rate Richie's statement as False.", "Texas Democratic Party, Press release: Richie: Arizona law threatens basic American rights, Rich Perry tries to have it both ways, April 30, 2010", "The Texas Tribune, $153,800 per arrest, April 20, 2010", "The Texas Tribune, Spillover politics, March 22, 2010", "The Monitor, Senators call for opennes in contingency plans for violence along the U.S. Mexico border, March 18, 2010", "Pro News 8, City leaders left out of the loop of Perry's plan for the border, March 18, 2010", "Office of the Governor, Gov. Perry orders first phase of Texas spillover violence contingency plan, March 16, 2010", "Austin American-Statesman, Border group gets $3.8 million grant: Perry gives coalition money for overtime, hiring, equipment and operational costs, July 29, 2006", "E-mail interview with Daniela Santoni, deputy communications director, May 3, 2010", "Interview with Katherine Cesinger, deputy press secretary at the governor's office, April 30 and May 7, 2010", "Interview with Don Reay, executive director, Texas Border Sheriff's Coalition, May 3, 2010", "Interview with Robert Wilson, lieutenant, Hudspeth County, May 4 and May 6, 2010", "Interview with Lupe Trevino, sheriff, Hidalgo County, May 6, 2010", "Interview with Jose Rodriguez, regional commander, Department of Public Safety, May 6, 2010", "Interview with William McDonald, sheriff, Terrell County, May 4, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]