["About this rating", "On 10 October 2016, the conservative \"news-aggregation\" web site Observatorial falsely claimed that President Barack Obama said he deserved to be memorialized, publishing an article under the headline \"Obama DEMANDS: 'I Deserve A Monument To Preserve My Legacy As The First Black President' that opened as follows:", "Obama recently has reportedly been quoted saying, “Being the first black president and all, don’t you think I deserve a monument. I mean, there's plenty of monuments dedicated to racist white people.", "Obamas [sic] comments have faced criticism on the right, pointing out that anyone who calls for a monument of themselfs [sic] is consiquently [sic] undeserving of one, Though many activists praise and support this idea, and are already in the process of planning for Obama to be potentially added to Mt. Rushmore.", "There is no record of President Obama's having made any remarks such as these, and no source was identified for them in the article. The piece went on to falsely claimed that unnamed activists \"are already in the process of planning for Obama to be potentially added to Mt. Rushmore,\" a statement that is nothing more than another long-debunked piece of fake news.", "The Observatorial article referenced two genuine stories, even though it linked to neither of them. The first was published on the conservative college news site The College Fix on 23 May 2013 and was based on a survey of ten professors at George Washington University, three of whom, the story stated, felt that President Obama might someday be honored on a monument, though not anytime soon:", "“Historical judgments take time to form and Obama is still in office,” history and public policy professor Edward Berkowitz told The College Fix. “It could be that he will be one of the great presidents, worthy of having his likeness carved on a mountain, but certainly not yet.”", "The Observatorial also made reference to a Facebook page devoted to the idea of putting President Obama on Mount Rushmore before citing a Huffington Post op-ed piece by Bill Lucey musing over whether that could really happen:", "Mount Rushmore and Mr. Obama are invoked so frequently in the same sentence that I began to wonder if in fact there is a movement in place to chisel the 44th president on the South Dakota mountainside", "In fact, it cannot:", "According to the U.S. National Parks, there’s simply no room for any more additions to Mount Rushmore. Besides, the rock that surrounds the sculpted faces is not suitable for additional carving. David Barna, chief spokesman of the National Park Service, informs me that when Gutzon Borglum, the sculptor of Mount Rushmore died in 1941, his son Lincoln Borglum closed the project and indicated that no more carvable rock existed.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]