["“Giant Tiger has announced that everyone who shares this link will receive $250 coupon for Grocery! TODAY ONLY” the posts claim.", "They direct users to a website, archived here, which is not affiliated with the Canadian-owned chain.", "When users click on the site, it asks them to answer a series of questions and seeks to collect personal information.", "Eventually it prompts users to share the link on Facebook, tagging 5 friends and writing “Thanks!” in the comments field.", "“Giant Tiger Stores Limited has been made aware that there is a fraudulent Facebook promotion circulating,” the company told AFP on April 30, 2020 via Facebook Messenger.", "“These scams intentionally impersonate a trusted brand to leverage goodwill and avoid suspicion.”", "The company urged people who had participated in the alleged promotion, particularly anyone who had shared credit card details, to contact the Royal Canadian Mounted Police Anti-Fraud Centre at 1-888-495-8501.", "AFP Fact Check has debunked other fake “free offers” on Facebook, including non-existent coupons from global retail giant Walmart and wholesaler Costco.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]