["A 44-second clip is viral on social media where a group of policemen can be seen manhandling women. A parody account dedicated to journalist Pushpendra Kulshreshtha @KPUSHPENDRA15 shared the clip and claimed that it shows Pakistani policemen thrashing Hindu women, a minority in the country. The video is circulating in the view of protests against the Citizenship Amendment Act (CAA) which seeks to provide a legal route for non-Muslim minorities from Pakistan, Bangladesh and Afghanistan to apply for Indian citizenship.", "[Message in Hindi: पाकिस्तान में हिन्दू अल्पसंख्यको पर अत्याचार, हिन्दू महिलाओं को बुरी तरह मारते घसीटते पाकिस्तान के मर्द पुलिसकर्मी और यहां कुछ हराम के पिल्ले रौंहिग्याओ और बांग्लादेशियों को अपना अब्बू बनाने के लिये CAA का विरोध कर रहे हैं….]", "पाकिस्तान में हिन्दू अल्पसंख्यको पर अत्याचार, हिन्दू महिलाओं को बुरी तरह मारते घसीटते पाकिस्तान के मर्द पुलिसकर्मी और यहां कुछ हराम के पिल्ले रौंहिग्याओ और बांग्लादेशियों को अपना अब्बू बनाने के लिये CAA का विरोध कर रहे हैं…. pic.twitter.com/v1JA7Q34mn", "— पुष्पेन्द्र कुलश्रेष्ठ (SO) February 13, 2020", "The clip is massively viral on Facebook.", "Alt News broke the video into multiple keyframes using InVID and reverse-searched one of the frames on Google. This led us to a January 4, 2019 broadcast by Pakistan-based channel News 24 HD. According to its report, policemen in Punjab brutally thrashed women.", "A keyword search redirected us to a January 6, 2019 report in Dawn which said, “According to police sources, Haleema Bibi, wife of Nazir, her sister-in-law Anwari Bibi and four others were present in their house in Mohallah Rehmanabad when ASI Ghulam Mohammad Jappah, with two constables and a private person, Aashi Jappah, forced their entry on the pretext of arresting a suspect.” The report also added that three cops were suspended.", "Therefore, the claim that Hindu women were beaten is baseless.", "A Pakistani journalist Tayyab Ahmad Jutt shared the suspension letter of the three policemen – an officer and two constables.", "چنیوٹ کے سب انسپکٹر غلام محمد کانسٹیبل افتخار اور ریاض کو معطل کردیا چنیوٹ پولیس وزیراعلیٰ پنجاب عثمان بزدار کا چنیوٹ کے علاقے میں خواتین پر پولیس اہلکاروں کے تشدد کے واقعہ کا نوٹس۔ pic.twitter.com/FAYGCYQDbc", "— Tayyab Ahmad Jutt (@TayyabAhmadJut1) January 5, 2019", "An old incident from Pakistan’s Punjab was thus revived and communalised on social media in the view of protests against the CAA.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]