["About this rating", "Tobacco enemas were a real and at one time popular medical practice thought to have been able to revive people who had drowned or were otherwise catastrophically ill.", "However, the phrase \"blow smoke up your ass\" appears to have its origins more recently, in the 1960s, and there is no evidence linking it to the long-ago practice of tobacco enemas.", "The topic of tobacco enemas has periodically provided media outlets seeking a quirky history and science feature with colorful material. An oft-mentioned tale, for example, is the 1746 case of a man who, in an effort to save his drowned wife, inserted the stem end of his tobacco pipe into her rectum, covered the lit bowl with paper, and \"blew hard\" — allegedly reviving her.", "Many of these stories or anecdotes invoke the phrase \"blow smoke up your ass\" — commonly interpreted to mean acts of deception such as telling someone what they want to hear, or insincerely flattering them — to draw a connection between the tobacco enema practice and the phrase. Others have invoked the phrase to point out that  humans indeed once considered blowing smoke into a human's ass to have been a perfectly reasonable practice:", "Two questions are raised by such assertions: First, were tobacco enemas real and what if, anything, did they accomplish? Second, does the phrase \"blow smoke up your ass\" come from this practice. Below, we address both questions.", "Tobacco enemas, according to a 2012 report in the British Columbia Medical Journal (BCMJ), were pioneered by native Americans. In the 1700s, according to the report, \"word of this treatment crossed the water to England, and volunteer medical assistants with the society began to use the procedure to treat half-drowned London citizens who were pulled from the Thames River.\"", "The procedure was thought to resuscitate people who were \"apparently dead\" —  a fairly broad medical classification that often referred to victims of drowning. Richard Mead, an influential English physician who lived from 1673 to 1754, is often credited with popularizing the practice in Europe, and was cited in the case report describing the husband who inserted his pipe into his wife's rectum to resuscitate her after she drowned.", "The practice was erroneously thought \"to accomplish two things; first, warming the drowned person, and second, stimulating respiration,\" according to the BCMJ article. As explained in a 2002 article in the medical journal The Lancet, \"the mainstay of treating the 'apparently dead' was warmth and stimulation\":", "Rubbing the skin was one method of stimulation, but injecting tobacco smoke into the rectum was generally thought more powerful. Since its introduction from the New World by Sir Walter Raleigh (1552–1618), tobacco has had a place in the pharmacopoeia for its warming and stimulating properties. It was useful in counteracting cold and lethargy, either in an individual’s constitution, or brought on by particular afflictions", "In fact, tobacco enemas had what could be called a cultural moment in the late 1700s and early 1800s, and their history is inexorably linked to the Royal Humane Society, a charity that is still active and that \"grants awards for acts of bravery in the saving of human life and also for the restoration of life by resuscitation.\" As discussed in The Lancet:", "The 18th century saw a growing sense of national responsibility for health and welfare. One curious result was the founding of so-called humane societies, devoted to resuscitating the victims of drowning or other mishap. …  Similar organisations sprang up in Venice, Hamburg, Milan, St Petersburg, Vienna, Paris, and London. This last society, The Institution for Affording Immediate Relief to Persons Apparently Dead from Drowning, was founded in … 1774. Eventually, in 1787, it became the Royal Humane Society and provided resuscitation kits, including tobacco enemas, at various points along the Thames.", "When we think about tobacco, we generally think of people inhaling its smoke via a pipe or cigarette or chewing on its leaves. Both processes deliver the chemical nicotine, among thousands of others, into the bloodstream, either via the lungs or through absorption in the gum of a tobacco chewer's mouth. Once in the bloodstream, nicotine easily reaches the brain. Mechanically speaking, the insertion of tobacco smoke into the rectum, which has a large number of blood vessels, would accomplish a similar end goal — the delivery of nicotine to the bloodstream.", "The medical practice of blowing tobacco smoke into a person's butt fell out of favor when, in 1811, nicotine was discovered by English scientist Ben Brodie to be toxic to the heart.", "Given the factual existence of tobacco enemas as a cure for apparent death, one might think anything is possible, especially the notion that the phrase \"blowing smoke up your ass\" has its origins in that now defunct practice. But there appears to be no link between the two.", "We reached out to Peter Sokolowski, editor at large at Merriam-Webster, to ask if he had any insight into the origins of the phrase. By email, Sokolowski told us that expressions or idioms are \"notoriously difficult to track down reliably\" and that dictionaries cannot always \"consistently explain how they came to be.\" The best they can do, he said, is \"explain what these idioms mean.\" The phrase is generally interpreted to mean flattering someone insincerely or telling them what they want to hear, both forms of deception.", "That said, Sokolowski directed us to Green's Dictionary of Slang, which purports to be \"the largest historical dictionary of English slang.\" That reference pinpoints the first published use of the phrase as being in the 1965 book \"Tiger in the Honeysuckle,\" published by crime novelist Elliot Chase. On page 244 of that novel, the character Chris Haines says, \"I knew you didn’t call me in here to blow smoke up my ass.\"", "While Snopes cannot verify if this is truly the first published instance of the phrase, other research methods support a roughly 1960s origin for the phrase as well. The Google Books Ngram viewer is a free tool that searches a massive corpus of English language texts, tracing the popularity of words and phrases over time. Below we show the results for the top three sentences that begin with \"blow smoke up your ...\" Blowing smoke up your \"ass\" is by far the most common usage, and that usage did not begin until the 1960s, as shown in the graph below:", "While the 1960s were no doubt an experimental time for many Americans, the practice of tobacco enemas, to the best of our knowledge, was not popularly practiced at this time. \"The distance between that date [1965] and the end of the purported medical practice lead me to think that a direct connection would be difficult to establish and prove,\" Merriam-Webster's Sokolowski told us.", "Snopes also reached out to Rob Kyff, author of several books on the origin of words and phrases and who has a syndicated column, \"The Word Guy.\" We asked if he had heard anything tying the phrase to the medical practice. He told us that he had no specific insight into the \"blow smoke up your ass\" claim, but that \"many 'folk' origins of word origins simply aren’t true.\" He provided us with the example of the phrase \"dead ringer,\" which he said people falsely claim \"has something to do with people being buried with strings attached to little above-ground bells so they can ring them if they’ve been mistakenly buried alive.\"", "While we cannot prove a negative, Snopes is confident, based on the lack of pre-1900 references and the idiom's current definition — which is consistent with the etymologic association between \"smoke\" and deception — that the saying and the medical practice are unrelated.", "Because blowing tobacco smoke into a person's ass was a real medical practice, but because no evidence supports an association between the phrase \"blow smoke up your ass\" and this discredited cure for \"apparent death,\" we rank this claim \"Mostly false.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]