["On Jan. 8, 1790, President George Washington delivered the first – and shortest – annual message from a president to Congress in U.S. history.", "His message began a tradition of the president providing information to Congress on the condition of the country, rooted in the U.S. Constitution, that evolved to include legislative proposals. It took until 1947 before it officially was called the \"State of the Union.\"", "A Facebook user, though, recently noted that President Joe Biden has not delivered his first State of the Union address. That user falsely claims that “it was supposed to be done by” Feb. 20.", "While the U.S. Constitution says the president “shall from time to time give to the Congress Information of the State of the Union, and recommend to their Consideration such Measures as he shall judge necessary and expedient,” it does not set a timeline.", "The last six presidents also have not delivered an official State of the Union during the year in which they were inaugurated, according to the Congressional Research Service.", "The user did not immediately respond to a request for comment.", "More:Fact check: Biden 'embarrassment' comment in Munich is from 2019, specific to child separation policy", "Both Washington and President John Adams delivered what was then known as the President’s Annual Message to Congress in person, according to a Congressional Research Office report, but President Thomas Jefferson abandoned that practice in 1801, in favor of a written message.", "It took more than 100 years for a president to again deliver their message in the form of a speech before Congress. President Woodrow Wilson revived the speech, still known as the Annual Message, in 1913.", "Presidents swung between personal appearances and written messages until they mostly began adhering to the in-person tradition after President Franklin D. Roosevelt did so in 1934.", "Prior to 1934, presidents delivered their messages around December, but the ratification of the 20th Amendment changed the opening time for congressional sessions, and the messages moved to January and February, the report said.", "Recent tradition has been for presidents to deliver a message to a joint session of Congress, but not an official State of the Union, in their inauguration year. The previous  six presidents have done that, according to the report.", "In 2017, President Donald Trump did not deliver a State of the Union, but instead an “Address Before a Joint Session of Congress.”", "While the Constitution requires the president to provide an update on the country, it doesn’t set a deadline, saying only that the message must come “from time to time.”", "The U.S. House of Representatives and the U.S. Senate pass a House concurrent resolution effectively scheduling a day and time for the president to speak to a joint session of Congress.", "Trump’s State of the Union was delayed in 2019 after a standoff with House Speaker Nancy Pelosi because of an ongoing government shutdown.", "White House Press Secretary Jen Psaki said on Feb. 16 that Biden’s first appearance before a joint session “was never planned to be in February,” even though Biden said in January that it would be, according to Axios.", "Pelosi said on Feb. 11 that a joint session wouldn't likely be convened until after Congress passes a COVID-19 relief bill, potentially delaying Biden’s first address until March, Roll Call reported.", "“We won’t be doing any of that until we pass our COVID bill. That’s the first order of business,” she said.", "The claim that Biden was supposed to deliver a State of the Union address to Congress by Feb. 20, 2021, is FALSE. The U.S. Constitution requires only that the president update Congress “from time to time,” and does not set a formal deadline. In-person speeches have become the norm since the mid-20th century, but at least the previous six presidents did not deliver a formal State of the Union during the year in which they were inaugurated. Instead, the president has delivered a speech to a joint session of Congress. That has not yet been convened in 2021.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]