["In this image from video, Eva Longoria, serving as moderator, speaks during the first night of the Democratic National Convention on Aug. 17, 2020. (DNC via AP)", "The Treasury Department announced it would begin phasing out paper checks for Social Security and other federal benefits by 2013.", "Roughly half a million people still receive their checks in the mail, but the vast majority (63 million) do not.", "The Postal Service played a supporting role in the opening night of the Democratic National Convention, with several speakers warning about the state of the country’s mail system under President Donald Trump.", "Eva Longoria Bastón, an actor and activist who hosted the DNC’s first night, portrayed the Postal Service as important to many demands of American life, delivering birthday cards and entitlement benefits alike.", "\"Social Security beneficiaries count on the post office to get their checks,\" she said.", "But that’s not quite right. Most recipients receive their benefits electronically.", "The Treasury Department announced in April 2010 that it was phasing out paper checks in an effort to save money and cut back on paper waste.", "\"Treasury will require individuals receiving Social Security, Supplemental Security Income, Veterans, Railroad Retirement and Office of Personnel Management benefits to receive payments electronically,\" the agency said in a news release. \"Individuals will be able to receive benefits either through direct deposit into a bank account or Treasury's Direct Express debit card.\"", "The department said that the move was expected to save more than $400 million and 12 million pounds of paper in the first five years.", "In a subsequent release, the Social Security Administration announced that anyone applying for benefits on or after May 1, 2011, would receive their payments electronically. Those who were already getting paper checks had until March 1, 2013, to switch to direct deposit. If they didn’t, they would receive their benefits through the Direct Express card program, a debit card where they could access payments without a bank account.", "But some people still receive their benefits the old fashioned way, thanks to mail delivery.", "Nearly 550,000 people are receiving paper Social Security checks in August, according to Social Security Administration data. That number goes up to about 848,000 if you include Supplemental Security Income.", "But the vast majority — over 63 million — access their benefits via direct deposit.", "Longoria Bastón said, \"Social Security beneficiaries count on the post office to get their checks.\"", "That’s true for some beneficiaries, but not for most.", "Around half a million people still receive paper checks in the mail. The vast majority — more than 63 million — get their payments electronically. The transition to electronic deposits started more than 10 years ago during the Obama administration to cut back on paper waste.", "The statement is partially accurate but omits important context. We rate it Half True.", "The Hill, Trump says no Post Office funding means Democrats 'can't have universal mail-in voting', Aug. 13, 2020", "Treasury.gov,  Treasury Goes Green, Saves, Green Broad New Initiative Will Increase Electronic Transactions, Save More Than $400 Million, 12 Million Pounds of Paper in First Five Years Alone, July 13, 2011", "Social Security Administration, \"No Check - Go Direct\", April 27, 2011", "Social Security Administration, Social Security (Title II) Direct Deposit Participation In The United States, Accessed Aug. 17, 2020", "Godirect.gov, Accessed Aug. 17, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]