["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Bill Clinton applauds as Judge Ruth Bader Ginsburg prepares to speak in the Rose Garden of the White House, June 15, 1993 after the president announced he would nominate Ginsburg to the Supreme Court. (AP)", "Ruth Bader Ginsburg was formally nominated and confirmed as a Supreme Court justice in about 42 days in 1993.", "The presidential election took place the year before, in 1992.", "The recent death of U.S. Supreme Court Justice Ruth Bader Ginsburg leaves a critical vacancy on the country’s highest court.", "With the Nov. 3 presidential election so close, Democrats are insisting that the next justice be nominated by the victorious candidate. Many Republicans, on the other hand, say President Donald Trump should pick Ginsburg’s successor immediately. The debate is a replay of a fight that took place in 2016, when a seat came vacant during President Barack Obama’s last year in office.", "Invoking another period in history, a Facebook post claims that Ginsburg herself was nominated and confirmed to the court a little over a month before an election.", "\"Fun Fact,\" the post says. \"RBG was nominated and confirmed 43 days before an election.\"", "This is inaccurate.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "It took 42 days for Ginsburg to be confirmed once her nomination was submitted to the Senate. But those were not the 42 (or 43) days \"before an election.\" Ginsburg’s nomination and confirmation happened the year after the national election.", "The process began about eight months after President Bill Clinton won his first presidential election.", "Clinton announced Ginsburg as his Supreme Court nominee on June 15, 1993, to fill the seat vacated by retiring Justice Byron White. The Senate received the nomination on June 22, and on Aug. 3, 1993 confirmed Ginsburg as an associate justice on the court with a vote of 96-3. That was 42 days after the Senate received the nomination.", "We rate this post False.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more", "Facebook post, Sept. 19, 2020", "SupremeCourt.gov, press release, Sept. 18, 2020", "Senate.gov, Senate Roll Call vote for Ruth Bader Ginsburg nomination, Aug. 3, 1993", "Reuters, How Trump could replace Ruth Bader Ginsburg on Supreme Court, even before election, Sept. 18, 2020", "CNN, Here's how long it's taken to confirm past Supreme Court justices, Sept. 19, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]