["“Muslim leaders in France strongly criticise decision to ban the slaughter of poultry animals in line with Islamic principle,” reads a March 20, 2021 tweet of an article about a decision to “ban” halal slaughter of poultry in France.", "The headline of the article has since been updated by Turkish state-owned media TRT, and the article no longer describes France’s move as a ban.", "But many tweets denounced the supposed measure as another example of discrimination, with one even claiming that all halal meat had been banned and calling for a boycott of France.", "The claim also circulated in an Arabic-language article on Al-Jazeera, the headline of which claimed that “France’s Muslims reject decision to prohibit ‘halal slaughter.’”", "Turkey’s official Anadolu news agency also shared the claim, in French.", "However, reports of a ban are false.", "The claims appear to stem from a March 18, 2021 press release from the Great Mosques of Paris, Lyon, and Evry, which have their own halal certification system.", "The document, which was signed by the three mosques’ leaders, states that “starting in July 2021, the Halal ritual slaughter of poultry in France will no longer be authorized.”", "The press release says the feared ban is the result of a technical note from the French Ministry of Agriculture, which oversees poultry slaughter in France.", "The ministry did publish a note regarding poultry slaughter on November 23, 2020 but it said the document aimed to provide detail on how various slaughter methods, including halal, are to take place in France.", "“This directive details different poultry slaughter practices within slaughterhouses and outlines methods for official control in respect of” EU legislation, the document’s summary reads.", "In an interview with AFP, Kamel Kabtane, president of the Lyon mosque, said: “The directive as it is written does not ban (halal slaughter), but it will greatly lower the quantity of poultry produced.”", "“With these norms, it will become impossible for Muslims to consume” according to their religious rules.", "Halal slaughter in France is allowed as a religious exemption to legislation passed by the EU in 2009. That law regulates how animals should be immobilized and stunned before slaughter, to avoid pain and minimize their distress.", "Marion Giroud, spokeswoman for the Ministry of Agriculture, said by email that the exemption for halal slaughter was decreed on December 28, 2011 and the November directive \"simply brings further precision to the former conditions for its application and control.\"", "She added, “No end to the exemption was pronounced as a result of this directive.”", "EU legislation mandates that poultry must lose consciousness and sensibility after they are stunned, and maintained in that state until death. Two types of ritualistic slaughter are authorized in France as exemptions to this rule.", "In one case, the animal is not stunned, but must be immobilized and in a way that does not let its weight rest on the legs or head before slaughter.", "In the second case, the waterbath stunners used to deliver an electroshock to the animal may have a lower intensity than allowed by the EU.", "The new French directive requires that the loss of consciousness must be controlled all the way to the animal’s death.", "Kebtane said: “Very few slaughterhouses have the restraining conditions that the ministry requires, and not all companies will be able to get the necessary equipment.”", "There are currently roughly 8,000 animals slaughtered per hour, but the restraining devices would only allow the slaughter of 3,000 per hour, he said.", "“You see the difference.”", "Officials from the Paris and Evry mosques did not respond to requests for comment.", "With its large Muslim population, France is the hub for halal production and distribution in Europe, according to the US Department of Agriculture.", "The claims are circulating against the backdrop of legislation passed by France’s lower house of parliament in February 2021 to address what President Emmanuel Macron called “Islamist separatism,” or the perceived shutting off from mainstream secular society by certain French Muslims.", "Critics saw the legislation as further stigmatizing the country’s millions of followers of the faith, and pushing them to cling more closely to their religious or community identities.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]