["About this rating", "Pope Francis is reportedly a tango fan -- but does the octogenarian Holy Father dance merengue? A video making the rounds on social media has fooled some into thinking that the Pope danced merengue (which some mistook for salsa) on a 2017 visit to Colombia:", "This footage shows a man dressed up in a pope costume at a Halloween party. In the video, you can clearly see Halloween decorations (a large spider and cobwebs) on the ceiling and a couple dressed as skeletons on the dance floor:", "Facebook user Fredy Gonzalez posted the earliest iteration of the video that we could find on 1 November 2017 (the day after Halloween). Gonzalez joked that the video showed \"the reality of the Pope's visit\" to Colombia, which had occurred a few months before. When some commenters didn't seem to understand the joke, Gonzalez said in Spanish, \"Haha don't get bitter that it's fake. The Pope is Argentine -- why would he dance with that Colombian flavor?\"", "In case it still wasn't clear, he added:", "Pope Francis, is that you?", "Although the quality of this footage deteriorated as it was circulated around the internet, the original footage gives a pretty clear view of the \"dancing pope,\" who appears to be much younger and taller than Pope Francis.", "The Pope's actual visit was well-documented, and no genuine news sources made mention of the Holy Father attending a Halloween party to do the merengue.", "Staudt, Jared.   \"From Deep Within: Pope Francis’ Love for Tango.\"\r\n    National Catholic Register.   7 October 2015.", "CNN.   \"Pope Francis visits Colombia.\"\r\n    10 September 2017.", "Staudt, Jared.   \"From Deep Within: Pope Francis’ Love for Tango.\"\r\n    National Catholic Register.   7 October 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]