["Four videos have been shared multiple times on Facebook and Line Messenger alongside a claim that they show a fire caused by an oil pipeline explosion in the United Arab Emirates (UAE) city of Dubai on August 16, 2020. The claim is false; the videos have all separately circulated online before mid-August, in reports about earlier fires in Egypt and the UAE.", "The claim and videos were shared via Line messenger on August 16, 2020.", "The Thai-language message translates to English as: \"Breaking news, reported from Dubai, big fire happening, it is believed that the fire was started by an oil pipeline explosion, there are many injuries and deaths.\"", "The same videos were also shared here, here, here and here on Facebook, alongside a similar claim.", "The claim is false; the videos have circulated online before August 16, 2020.", "First video", "A reverse image search on Google using keyframes extracted with InVID-WeVerify, a digital verification tool, found the same video published here on the website of a UAE-based newspaper, The National, dated March 1, 2019.", "The report’s headline states: “Hero of Cairo train fire: I acted without thinking, then went back to work”.", "The article tells the story of a cafeteria worker who risked his life to save victims injured in a runaway train crash at Cairo’s Ramses rail station.", "Below is a screenshot comparison of the first video in the misleading Line message (L) and the video in The National’s report (R):", "Second video", "A reverse image search of a screenshot from the second video found an identical clip published here on the Facebook page of Mexican news website SéUnoNoticias on August 6, 2020.", "The Spanish headline translates to English as: “Ajman market in the United Arab Emirates burns”.", "According to this report by UAE-based English language newspaper Gulf News, some 125 shops were destroyed in a massive fire at a market in Ajman, UAE, on August 5, 2020. No casualties were reported, as the market had been closed for months as part of a COVID-19 safety measure.", "Below is a screenshot comparison of the second video in the Line message (L) and the video in the SéUno Noticias post (R):", "Third video", "A separate reverse image search of a keyframe extracted from the third video led to this tweet by Russia Today (RT), a Russian state-controlled television network, published on August 6, 2020.", "The tweet reads: “HUGE blaze breaks out at food market in #Ajman, #UAE”", "Below is a screenshot comparison between the third video in the misleading Line message (L) and the RT tweet (R):", "Fourth video", "A combined keyword and reverse image search found the same video published in this July 15, 2020 report by UK television channel Sky News about an oil pipeline explosion in the Egyptian capital of Cairo.", "Its headline reads: “Egypt: Seventeen people injured in oil pipeline explosion on Cairo motorway”", "Below is a screenshot comparison between the fourth video in the misleading Line message (L) and the video on the Sky News report (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]