["By Robert Farley, Eugene Kiely, Brooks Jackson and Lori Robertson", "Posted on June 22, 2017 | Updated on July 5, 2017", "The 2020 presidential campaign is more than 1,200 days away, but President Donald Trump held yet another Make America Great Again rally — this time in Cedar Rapids, Iowa. And, as he did in past campaign speeches, Trump spoke for a long time and reeled off numerous false and misleading claims:", "The president visited Iowa on June 21, making an official stop first at Kirkwood Community College in Cedar Rapids to talk about agriculture. Later that evening, Trump spoke to a large crowd in the nearby U.S. Cellular Center at a political rally organized by his campaign.", "At his rally, Trump exaggerated when he claimed that his administration had deported MS-13 gang members “by the thousands.” It is by the hundreds, not thousands.", "Trump, June 21: The other thing that I have to tell you. You have a gang called MS-13. … These are true animals. We are moving them out of the country by the thousands, by the thousands.", "Trump is referring to the Mara Salvatrucha, or MS-13, a gang that was formed by Salvadoran immigrants in Los Angeles in the 1980s. In April, Attorney General Jeff Sessions said that there are 10,000 MS-13 gang members in the United States. That made us skeptical of the claim that “thousands” already had been deported.", "We asked the White House how many gang members have been removed under the Trump administration, but it declined to comment.", "However, the Washington Post on May 24 wrote that this year the U.S. has deported 398 gang members to El Salvador “compared with 534 in all of 2016, according to Salvadoran government statistics.” Those figures represent members of all El Salvador gangs, such as MS-13 and the 18th Street gang. MS-13 is “primarily El Salvadoran,” according to a 2005 National Gang Threat Assessment report by the National Alliance of Gang Investigators Association, though it’s possible there are members from other countries.", "Danielle Bennett, a spokeswoman for the U.S. Immigration and Customs Enforcement, told us in an email that so far in fiscal year 2017 — from Oct. 1, 2016, to June 4, 2017 — ICE has removed 2,798 gang members. But that includes all gang members, not just MS-13 members. She said ICE “does not track gang removals by specific gang,” so it does not know how many of the 2,798 were MS-13 members. The 2,798 removals also span both the Obama and Trump administrations, so not all of the FY 2017 deportations occurred under Trump.", "By contrast, there were 2,057 gang members deported in fiscal 2016, so there has been an increase this fiscal year. We don’t know how much of that is attributable to Trump’s policies, but Bennett said that ICE under the Trump administration “does specifically target MS-13 members for arrest and removal.” That appears to be corroborated by the statistics from El Salvador published in the Post.", "Bennett also said that ICE Homeland Security Investigations has made 602 criminal arrests and 170 administrative immigration arrests of MS-13 members so far in fiscal year 2017, as of June 4. But those figures include arrests made under both administrations, and the criminal arrests include citizens and noncitizens alike. For example, ICE reported last month that it arrested 104 MS-13 gang members as part of a six-week anti-gang enforcement operation that resulted in 1,378 arrests from March 26 to May 6. But nearly two-thirds of all those arrested were U.S. citizens, so most would not have been eligible for deportation.", "Trump can take credit perhaps for cracking down on gang members and increasing the deportation rate of gang members from El Salvador. But he exaggerates when he says he is deporting MS-13 gang members “by the thousands.”", "Update, July 5: The U.S. has deported 580 gang members to El Salvador in the first half of 2017, from Jan. 1 to June 30, according to the Salvadoran government. That figure includes all gang members, not just those with MS-13.", "FactCheck.org Rating:", "Read More", "In the farming state of Iowa, Trump repeatedly played on the mythical claim that the federal estate tax is keeping family farms from being passed on to the next generation of farmers.", "First, in his speech at Kirkwood Community College in Cedar Rapids, the president said:", "Trump: I want to make sure the next generation of Americans has that opportunity [to live on a farm] as well.  And, in particular, that includes your children and your grandchildren, and [we are] working very hard to get rid of the death tax so that those farms can be passed on.", "And at his rally later that evening, he said the estate tax should go because, “You should have a right to pass your farm onto your children and onto your grandchildren.”", "The fact is, however, that more than 99 percent of all farms are expected to be passed on without paying any estate tax at all. Repeal of the federal estate tax would benefit only the very wealthiest multimillionaires. And even the few who owe any tax may spread payments out over more than a decade.", "A March 15 study by the Economic Research Service of the U.S. Department of Agriculture estimated that 38,328 farms would become part of estates in 2016, of which only 0.42 percent — 161 estates — would owe any estate tax at all.", "All of those would be multimillion-dollar farms; only estates worth $5.45 million or more must file a return, and most of them don’t owe any tax. For those who do owe tax, the study estimated that the average effective rate would be 20 percent — with the option of spreading payments over 14 years.", "Separate research by the nonpartisan Tax Policy Center puts the number even lower. TPC estimates that only 50 farms and closely held businesses will pay any estate tax in 2017.", "And regardless of whether the number is 161 or 50, those farm estates that owe any tax at all have the option to spread installments over 14 years at reduced interest rates.", "When we wrote about this estate-tax myth in 2015, we reached out to Neil Harl, an Iowa State University professor of economics and agriculture, who has been studying the estate tax’s impact on small businesses and farms for decades.", "“I have been involved in this area since 1958 and I have never seen land that had to be sold to pay the federal estate tax and I have conducted more than 3,400 seminars in 43 states which included federal estate tax planning,” Harl wrote to us in an email. The italics were his. And for this article, we checked back with him, and he said that is still the case.", "“The lobbyists early on, I am told, concluded farmers as a group are more highly respected than billionaires, at least on this issue,” he added.", "FactCheck.org Rating:", "Read More", "Trump wrongly claimed that “all” insurance companies have left the individual market in Iowa. In fact, Medica Health announced on Monday that it would stay in the market statewide.", "The president further claimed that insurers are “leaving all of the states.” There are currently 44 counties in three states with no insurer for 2018, according to the Kaiser Family Foundation.", "Trump: In fact, I was just told by your great governor and ex-governor that your insurance companies have all fled the state of Iowa. Pretty sad, isn’t it? Well, they’re — I’ll tell you what, they’re going from every state. They’re leaving all of the states.", "Iowa’s individual insurance marketplace — where those who get Affordable Care Act subsidies buy their own insurance — has had a shaky outlook for 2018. Before Medica’s announcement on Monday, the state was unsure if the insurance carrier would participate next year. Two other insurers — Aetna and Wellmark — had already said they wouldn’t sell plans on the state marketplace in 2018, leaving Medica as potentially the sole statewide insurer. (Gundersen Health Plan sells policies in five of the state’s 99 counties, Iowa’s Insurance Division says.)", "Iowa’s Insurance Division said it was “unlikely these carriers will remain” in 2018 and proposed on June 12 to the federal Centers for Medicare & Medicaid Services a “stopgap measure” to retool the state’s ACA marketplace, where 72,000 Iowans now get coverage. That stopgap measure would change the income-based tax credits to age- and income-based assistance; create one plan rather than the metal levels of the ACA (bronze, silver, gold, platinum); and add funding to a state reinsurance program to help insurers cover high-cost individuals.", "Iowa’s Insurance Division confirmed to FactCheck.org that Medica was the only insurer to file 2018 proposed rates by this week’s deadline; Gundersen did not.", "Medica’s announcement was widely reported, and it said its 2018 plans would come with a 43 percent average premium increase. Iowa Insurance Commissioner Doug Ommen said the state would still move forward with the stopgap proposal, and he expressed concern about Medica’s average rate increase driving away younger and healthier policyholders.", "Medica CEO John Naylor told CNBC on June 16 that the company wanted certainty from the federal government on whether cost-sharing subsidies for low-income individuals would continue. In late May, the Trump administration and House of Representatives asked for a 90-day delay to the federal lawsuit on the matter, according to Politico.", "“When the federal government set out certain rules, our expectations are that these rules are followed,” Naylor told CNBC. “So as we look at pricing we need to know are those rules going to be enforced in 2018.”", "Trump greatly exaggerated when he claimed that insurance companies are “leaving all of the states.” As of June 21, there were 44 counties, with 31,268 insurance enrollees, at risk of having no insurance carrier for 2018, according to an analysis by the Kaiser Family Foundation, which relied on state rate filings and media reports. Those counties are in three states: Ohio, Missouri and Washington. However, the analysis notes that the insurer Centene said it would expand its insurance business in several states, including those three, but hasn’t detailed exactly where.", "“Insurer participation in 2018 will not be finalized until fall of 2017,” KFF says.", "FactCheck.org Rating:", "Read More", "Trump again claimed he has reversed the trend of coal mining job losses, and misleadingly pointed to the opening of a new coal mine in Western Pennsylvania as evidence that his policies have led to a resurgence in coal mining. Neither of those is true.", "Trump, June 21: And we’ve ended the war on clean, beautiful coal. And we’re putting our miners back to work. In fact, you read about it, last week a brand new coal mine just opened in the state of Pennsylvania, first time in decades, decades. We’ve reversed – and 33,000 mining jobs have been added since my inauguration.", "In fact, there has been an increase of about 1,000 coal mining jobs since January, according to the Bureau of Labor Statistics. For some perspective, there has been a total loss of nearly 40,000 coal mining jobs over the last five years.", "How does Trump get to 33,000? After talking specifically about coal mining, Trump cites a figure for all mining jobs – including gas, oil, metal ores, coal and nonmetallic mineral mining and quarrying. There have been 32,600 total mining jobs added since January. We wrote about this issue once before when EPA Administrator Scott Pruitt tried a similar sleight of hand.", "As for the grand opening of the Corsa Coal Company’s Acosta Deep Mine near Pittsburgh on June 8, that had nothing to do with Trump’s efforts to roll back coal regulations. As we wrote when Trump made similar boasts earlier this month, development of the Acosta mine began in September, two months before Trump’s election victory.", "Industry experts also tell us it is not emblematic of a resurgence of coal mining.", "The Acosta mine produces a particular type of coal that is used to make steel. That’s a bit of a niche market in the coal industry, accounting for just 10 percent of coal production in the U.S. There has been a surge in demand for this kind of coal because of production problems overseas.", "However, the vast majority of coal produced in the U.S. is thermal coal, the kind used to generate electricity. Consumption of that kind of coal has declined by nearly 18 percent between 2012 and 2016, mostly due to the surge in cheaper natural gas production driven by the shale revolution and to competition from renewable energy.", "Environmental regulations — which Trump has targeted — also hurt coal mining, but according to an April report from Columbia University’s Center on Global Energy Policy, those regulations were a “significantly smaller factor” in the shrinking of the coal industry. Industry experts say Trump’s efforts to roll back those regulations might stem the decline in coal consumption, but would not bring coal mining jobs back to levels seen even a few years ago.", "FactCheck.org Rating:", "Read More", "Trump touted his decision to withdraw from the Paris Agreement, which he said would have been an economic “catastrophe” for the U.S. The agreement, which took effect last year, was signed by 195 countries and primarily aims to keep warming “well below 2°C above pre-industrial levels” and to pursue “efforts to limit the temperature increase to 1.5°C.”", "The president pushed back at critics who said the pact is nonbinding.", "“And they all say it’s nonbinding,” he said. “Like hell it’s nonbinding. When we get sued by everybody because we thought it was nonbinding, then you can tell me it was nonbinding.”", "There are aspects of the agreement that are legally binding. Todd Stern, a former U.S. special envoy for climate change, explained in a press conference shortly before the agreement was reached that countries must submit “nationally determined contributions” that outline their emissions targets and report actions taken to meet those targets. But meeting emissions targets wasn’t one of the legal requirements.", "Stern, Dec. 2, 2015: We’ve made our position clear all year long that we support an agreement that’s legally binding in many respects, including the elements of accountability of the agreement, the requirement to put forward a target, to do it with information that clarifies it, the obligation to report and be reviewed on your inventories and the actions you’re taking in order to meet your target. Any number of rules and so forth. So a whole number of elements that are legally binding, but not the target itself.", "Stern wrote a May 8 op-ed for the Washington Post urging Trump to stay in the Paris Agreement. He said the president should “keep in mind that — as much as I would be sorry to see any retrenchment — countries can adjust their emissions targets downward. The agreement permits it, and I know because I helped negotiate that flexibility.”", "FactCheck.org Rating:", "Read More", "Trump said he was promoting legislation that would bar new immigrants from receiving welfare for five years, but a 20-year-old law already does that. He introduced his proposal after promising to preserve the “safety net” for people who “truly need help.”", "Trump, June 21: But others don’t treat us fairly. That’s why I believe the time has come for new immigration rules which say that those seeking admission into our country must be able to support themselves financially and should not use welfare for a period of at least five years. And we’ll be putting in legislation to that effect very shortly.", "But as The Hill pointed out, such a law already exists. The Personal Responsibility and Work Opportunity Reconciliation Act, signed into law in 1996 by then-President Bill Clinton, states that immigrants are “not eligible for any Federal means-tested public benefit for a period of 5 years beginning on the date of the alien’s entry into the United States.” That would include such benefits as food stamps, Medicaid and Social Security.", "As USA Today noted, there are some exceptions in the law for children and pregnant women, refugees, and active duty military or veterans. It’s possible, the story notes, that Trump is seeking to toughen the restrictions, or to eliminate some exceptions. Trump’s proposed FY 2018 budget notes that refugees are exempt from the five-year waiting period, and stresses the need to control the cost of benefits paid to immigrant-headed households. But it offered no details on how that would be accomplished beyond reducing the number of refugees, curbing illegal immigration and increasing merit-based legal immigration.", "We reached out to Trump’s press office for clarification, but it declined to provide any information on the record.", "FactCheck.org Rating:", "Read More", "Trump also repeated the claim that the U.S. already has spent $6 trillion in the Middle East since 2001. It hasn’t.", "Trump, June 21: After decades of rebuilding foreign nations all over the world, we are now rebuilding our nation. As of a few months ago, our country has spent $6 trillion in the Middle East, wasted. … We started 16 years ago and it’s in far worse shape than it was 16 years ago by many times over. So, we spent all of this money, all of these lives.", "Actually, the U.S. has spent about $1.7 trillion through fiscal year 2016, which ended Sept. 30, 2016, according to a February report by the nonpartisan Congressional Research Service.", "During the campaign, Trump made the $6 trillion figure a talking point. For example, in Philadelphia, he gave a speech in which he said, “We must declare our independence from a failed establishment that has squandered $6 trillion on foreign wars in the Middle East that never end and that we never win and that have made us less safe.”", "His campaign at the time cited a Reuters news article about a study that projected the wars in Iraq and Afghanistan will cost the U.S. $6 trillion “over the next four decades.” The story said the cost estimate included “future commitments, such as the medical and disability claims of U.S. war veterans.”", "It may be that the wars eventually will cost the U.S. $6 trillion. However, Trump said the U.S. “has spent $6 trillion” (past tense) as of “a few months ago.” That’s not accurate.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]