["A Facebook claim about President Donald Trump's authority to dispatch federal forces to quell violence in \"liberal-run states\" has been shared thousands of times.", "Political organization The Silent Majority posted the claim to its page on Sept. 5. The organization takes a \"common sense\" approach to today's political issues, according to its Facebook profile page.", "The meme starts out by saying, \"The president does not have authority to go into these liberal cities and stop the rioting. I have seen literally hundreds of posts saying he does. This is not the case.\"", "It then states that the 10th Amendment of the Constitution restricts the president from \"sending troops or law enforcement into a state without a written request by the governor of that state.\"", "Democrats claim otherwise, the meme says, because they want the public to think Trump could put a stop to the \"rioting\" in states where large anti-police brutality protests have formed if he wanted to. \"The Governors of these liberal states refuse to accept (Trump's) help — but want you to believe he is allowed to help when his hands are tied,\" the post reads.", "Page followers shared the meme in replies to posts by The Silent Majority. Facebook user Joan Savo Stevens responded to a post about the alleged damage to public property by Portland, Oregon, protesters with the meme.", "Stevens told USA TODAY she did not create the meme and could not remember where it came from. \"Who cares?\" she said.", "More:Fact check: Joe Biden has condemned protest-related violence all summer", "The 10th Amendment of the Constitution states, \"the powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people,\" according to the Constitution Annotated, an official website hosted by Congress.", "The amendment allows the states rights and powers to establish laws protecting the safety, health and welfare of the public not delegated to the federal government, according to the Cornell Law School Legal Information Institute.", "The Posse Comitatus Act of 1878 further prohibits the federal military from participating in domestic law enforcement, according to USA TODAY.", "But there have been prior instances where a president has sent in federal law enforcement over the objection of state or local officials, despite the Supreme Court's assertion that the federal government lacks a general police power, according to Jonathan Entin, professor emeritus of law at Case Western Reserve University.", "In an email to USA TODAY, Entin referenced federal troop deployments during the desegregation of Central High School in Little Rock, Arkansas, in 1957 and the University of Mississippi in 1962 as examples.", "\"The federal government has fairly broad authority to act in ways that supersede or override state law,\" Entin said, adding that constraints imposed by local statutes and the good judgment of federal officials do more to limit federal involvement at the local level than \"the plain language of the Tenth Amendment.\"", "The Insurrection Act of 1807 also gives a president authority to deploy the military or federalize the National Guard in states that cannot control insurrections or that defy federal law.", "More:Fact check: National Guard was activated most often during the Civil Rights Era", "The Insurrection Act was last invoked in 1992 by President George H.W. Bush during rioting in Los Angeles, USA TODAY reported.", "On May 30, days after George Floyd died in Minneapolis police custody, Trump tweeted that leaders in \"liberal\" states should do more to calm unrest in their cities or the federal government would intervene.", "In June, Trump threatened to deploy troops to quell protests against police brutality. He signed an executive order on June 26 with the stated intent to protect public monuments, memorials and statues from \"violent mobs incited by a radical fringe.\"", "Anarchists and left-wing extremists \"have led riots in the streets, burned police vehicles, killed and assaulted government officers as well as business owners defending their property, and even seized an area within one city where law and order gave way to anarchy. During the unrest, innocent citizens also have been harmed and killed,\" the order states.", "More:What powers does the President have to control order? A look at the Insurrection Act", "Federal officers were present the next day at the federal courthouse in Portland, The Oregonian/OregonLive reported, without the approval of local officials, including Portland Mayor Ted Wheeler.", "USA TODAY reached out to the Department of Homeland Security and the Department of Defense for comment.", "Sen. Ron Wyden, D-Ore., objected to sending federal officers to Oregon according to USA TODAY.", "Local officials said their presence \"inflamed tensions\" between protesters and law enforcement. In one incident, the officers tackled and detained protesters, seizing gas masks, chemical sprayers and other supplies after a reported shooting. Agents also detained protesters in unmarked vans, USA TODAY reported.", "Portland protesters brought a lawsuit against the Trump administration, alleging federal officers violated their constitutional rights by using nonlethal weapons against peaceful demonstrators, according to USA TODAY.", "More:Fact check: Federal agents in Portland are not mercenaries provided by Erik Prince", "Oregon Gov. Kate Brown reached an agreement with federal authorities in late July to begin a \"phased withdrawal\" of agents from the city after \"repeated requests,\" according to a press release. In a July 29 tweet, Brown said the officers \"acted as an occupying force & brought violence.\"", "\"From Day One, I have pressed the Trump administration to withdraw its occupying army from my hometown. I will watchdog today’s announcement to ensure that it happens, and is not the administration’s usual penchant for fiction,\" Wyden said of Brown's announcement.", "In a letter to Congress, the mayors of Chicago; Seattle; Portland; Albuquerque, New Mexico; Kansas City, Missouri; and Washington, D.C., asked lawmakers to pass legislation that would block the administration from deploying \"unidentified federal agents\" to cities without consulting local officials, USA TODAY reported.", "“This administration's egregious use of federal force on cities over the objections of local authorities should never happen,” the letter states, according to Politico.", "On the same day Brown announced federal officers' withdrawal from Portland, the Justice Department announced plans to expand the federal crime initiative Operation Legend by sending nearly 100 federal agents and officers to Detroit, Cleveland and Milwaukee to help local law enforcement combat violent crime, according to USA TODAY.", "Named after 4-year-old LeGend Taliferro, whose shooting death is unsolved, Operation Legend kicked-off in Kansas City in August. Mayors of the cities where agents will be deployed responded with skepticism in the wake of federal presence in Portland.", "Tim Keller, Democratic mayor of Albuquerque, said local leaders did not request federal help, USA TODAY reported.", "\"We always welcome partnerships in constitutional crime fighting that are in step with our community, but we won’t sell out our city for a bait-and-switch excuse to send secret police to Albuquerque. Operation Legend is not real crime fighting; it’s politics standing in the way of police work and makes us less safe,” Keller said.", "We rate this claim PARTLY FALSE, based on our research. It is true that the 10th Amendment allows the states rights and powers to establish laws protecting the safety, health and welfare of the public not delegated to the federal government. But the idea that the amendment prevents the federal government from intervening at all is false.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more"]