["President Donald Trump waves as he leaves a campaign rally at Waukesha County Airport in Waukesha, Wisconsin on October 24, 2020. A large Thin Blue Line flag is visible behind the president.(Getty Images).", "A Thin Blue Line flag was used as a backdrop for President Trump’s Oct. 24, 2020 rally in Wisconsin.", "A Facebook post labeled it an “anti-Black Lives Matter flag.”", "The flag has been associated with the pro-police Blue Lives Matter movement, which arose to counter the Black Lives Matter effort.", "It is possible to support police and the Black Lives Matter movement, but Trump has condemned protests tied to the latter.", "As the 2020 election heads into its final days, a Facebook post is claiming that President Donald Trump had replaced the American flag with an \"anti-Black Lives Matter\" flag at a recent Wisconsin rally.", "At issue: A Thin Blue Line flag that was prominently featured behind Trump at an Oct. 24, 2020 rally in Waukesha. The flag essentially is a black-and-white version of the American flag, with a single red stripe replaced by a blue one.", "That blue stripe is meant to symbolize police officers as the \"thin blue line\" between order and chaos.", "The Facebook post featured a screenshot of a Twitter post by author and Dartmouth College English professor Jeff Sharlet, that included a photo and read: \"Tonight in Wisconsin. First the anti-Black Lives Matter flag flew outside his rallies, then beside the American flag. Now it has replaced the American flag. That’s significant.\"", "Alongside the screenshot, the Facebook post read: \"Trump flew the anti-Black Lives Matter flag at his rally in Wisconsin. So much for not disrespecting the troops …\"", "The post in question was shared by a group called \"The Other 98%\" -- a left-leaning nonprofit, according to its bio on Facebook -- the day after the rally. The post has been shared more than 2,500 additional times and reacted to by more than 7,200 people.", "This post was flagged as a part of Facebook’s efforts to combat false news and misinformation on its News feed. (Read more about our partnership with Facebook.)", "So was the flag really flying behind Trump during his Waukesha rally?", "And is it an \"anti-Black Lives Matter\" flag?", "In a review of photos of the Oct. 24, 2020 Waukesha rally taken by the Milwaukee Journal Sentinel, the Thin Blue Line flag is hung prominently behind the risers behind behind the podium where Trump spoke.", "The flag was featured very prominently at the rally -- a change from the last several Wisconsin rallies that Trump has held in other cities.", "In Janesville on Oct. 17, 2020, the flag was featured on one side of the stage, while a larger American flag was featured on the other side of the stage, photos from the Journal Sentinel showed. In Mosinee on Sept. 17, 2020, Trump spoke in front of Air Force One and no flags were prominently displayed, according to photos by the Journal Sentinel.", "So the portion of the post that says that the flag was featured prominently -- and more prominently than at earlier rallies -- is on the money.", "But what about the meaning of the flag?", "The flag has been popularized by the company \"Thin Blue Line USA,\" which also sells clothing emblazoned with the symbol. According to the company’s website, the flag is meant to be a sign for \"promoting compassion and support for our nation’s police officers.\"", "The company began marketing the flag in 2014 amid the Blue Lives Matter movement, which itself was launched in response to the Black Lives Matter movement.", "The Black Lives Matter movement arose in 2013 after the acquittal of George Zimmerman, who killed teen Trayvon Martin in Florida, according to the movement’s website. Black Lives Matter has been invoked around the country this year during massive protests that were launched by the death of George Floyd at the hands of Minneapolis police officers.", "In a June 8, 2020, article by The Marshall Project headlined \"The Short, Fraught History of the ‘Thin Blue Line’ American Flag,\" Andrew Johnson, president of Thin Blue Line USA said: \"The flag has no association with racism, hatred, bigotry. It’s a flag to show support for law enforcement—no politics involved.\"", "According to the article:", "Jacob said the flag was not a direct reaction to the first Black Lives Matter protests—an idea suggested by a previous origin story in Harper’s—but he allows he may have first seen the thin blue line image after those protests spurred the circulation of pro-police imagery online. \"That’s maybe why it came to my eyes,\" he said.", "Whatever the intended meaning of the flag, it has come to carry different connotations to different people", "At protests in Charlottesville in 2017, where white supremacist groups and supporters gathered to protest the removal of Confederate statues throughout the country, the blue-line flag was featured alongside Confederate flags, according to an Aug. 18, 2017 report from USA TODAY. (The company disavowed its use in Charlottesville)", "A July 31, 2020 NPR report highlighted a fight between a Massachusetts fire department flying the flags in honor of fallen police officers, and community members who felt the flag was an overt display of racism.", "A June 9. 2020 Politico report said even police officers have mixed reactions to the symbol, with some departments banning it outright, while others display it on government-owned vehicles.", "The Politico report also noted that the flag is controversial because of its likeness to the American flag, and because of the U.S. Flag Code, which states: \"The (American) flag should never have placed upon it, nor any part of it, nor attached to it any mark, insignia, letter, word, figure, design, picture or drawing of any nature.\"", "When asked why the flag was placed behind the president, Wisconsin Trump Victory --  the state’s Trump campaign group -- did not respond.", "To be sure, it is possible to support police officers and the Black Lives Matter movement.", "But Trump himself has been harshly critical of the Black Lives Matter protests this summer, labeling them as violent and claiming they were stoked by anti-government elements.", "A Facebook post claims an \"anti-Black Lives Matter\" flag replaced the American flag behind Trump during a Waukesha campaign rally.", "To be sure, the flag itself violates the U.S. Flag Code, and should not be considered a legitimate U.S. flag by those standards.", "In terms of the Facebook claim, The image and description -- that the flag has taken on greater prominence at the Trump rallies in Wisconsin -- is on target. And the Thin Blue Line flag has become a prominent part of the pro-police Blue Lives Matter movement -- which arose to counter the Blak Lives Matter movement.", "That said, while it is possible to support both, Trump has made clear he opposes the Black Lives Matter protests -- and made that opposition, and a strong law-and-order message, a prominent part of his re-election campaign. So, those attending the rally or seeing the images could easily see the flag as an \"anti Black Lives Matter flag.\"", "We rate the claim Mostly True.", "Facebook post by The Other 98%, October 25, 2020", "Tweet by Jeff Sharlet, October 24, 2020", "Milwaukee Journal Sentinel, \"Donald Trump continues Wisconsin push, hoping he can replicate 2016 formula,\" Oct. 24, 2020", "Milwaukee Journal Sentinel, \"Trump tells thousands in Janesville that Wisconsin is key to winning ‘the whole ball game,’\" Oct. 17, 2020", "Milwaukee Journal Sentinel, \"Donald Trump tears into Joe Biden in return visit to Wisconsin,\" Sept. 17, 2020", "Thin Blue Line USA, About page, Oct. 26, 2020", "USA TODAY, \"‘Thin Blue Line’: What does an American flag with a blue line mean?\" Aug. 18, 2017", "Blacklivesmatter.com, Oct. 27, 2020", "Politico, \"The short fraught history of the ‘Thin Blue Line’ American flag,\" June 9, 2020\nThe Marshall Project, \"The Short, Fraught History of the ‘Thin Blue Line’ American Flag,\" June 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]