["“If Democratic presidential nominee Joe Biden wins the election but cannot serve his full term, vice presidential nominee Kamala Harris would assume the role of president and House Speaker Nancy Pelosi would become vice president. LET THAT SINK IN,” an October 9, 2020 Facebook post reads.", "Other examples of the claim can be found here and here.", "However, the 25th Amendment of the Constitution, which covers presidential succession, indicates that the posts are false.", "According to Section 1 and 2, a vice president becomes president if the latter dies, resigns or is removed from office. However, it says the appointment of a subsequent vice president must be approved by a majority vote in both the House and Senate.", "The Constitution does not specify who exactly should fill the position of vice president, Adam Winkler, Professor at UCLA School of Law specializing in constitutional law, told AFP.", "He said Pelosi could theoretically be chosen by Harris in that scenario, although it would be “highly unlikely” for Harris to “pick a person of Pelosi’s age to serve.”", "“Under a federal law, the Speaker of the House is third in line for the presidency if both the president and the vice president are incapacitated, but that law does not provide that the Speaker of the House becomes the vice president in any circumstances,” he said.", "This is also stated in the section of the United States Code entitled “Vacancy in Offices of Both President and Vice President; Offices Eligible to Act.”", "“If, by reason of death, resignation, removal from office, inability, or failure to qualify, there is neither a President nor Vice President...then the Speaker of the House of Representatives shall, upon resignation as Speaker and as Representative in Congress, act as President,” the text reads.", "The misleading claim gained in popularity after Pelosi proposed a commission to assess presidential capacity on October 9, 2020 -- a move that highlighted concerns about Donald Trump's health weeks before the election.", "The proposed bill would establish a 16-member bipartisan panel of medical experts and former executive branch officials. With Republicans controlling the Senate, it is however highly unlikely that the bill will become law.", "Pelosi pushed back criticism and insisted the commission was “not about President Trump,” who had just returned to the White House after he was treated in hospital for Covid-19.", "Pelosi has been targeted by various misleading claims in the run-up to the US election on November 3. AFP Fact Check previously debunked other claims about the House Speaker here, here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]