["An image has been shared hundreds of times on multiple Facebook posts alongside a claim it shows a newspaper article about an interview with Sri Lanka’s State Minister Sarath Weerasekera. The purported newspaper page features a headline that says the minister “feels that conserving forests is futile”. The claim, however, is false; the page has been doctored from an August 30, 2020, edition of the Sri Lankan newspaper Sunday Lankadeepa, with the headline changed.", "The image was published on September 4, 2020, here on Facebook, where it has been shared more than 230 times.", "It shows a purported newspaper page of the Sri Lankan newspaper Sunday Lankadeepa, with a Sinhala headline that translates to English as: “I feel that conserving forests is futile”. The article itself is blurred.", "The Sinhala text overlay under the doctored page reads: “Rear Admiral Dr. Sarath Weerasekera’s interview with Sunday Lankadeepa/ August 30, 2020”.", "Sarath Weerasekera is the incumbent state minister for provincial councils and local governments in Sri Lanka.", "The image was also shared here, here, here, here, here and here on Facebook, alongside a similar claim.", "The claim, however, is false.", "In response to the posts, a spokesperson for Sunday Lankadeepa told AFP by phone on September 9, 2020, the misleading image shows Page 15 of the August 30, 2020 edition of their newspaper.", "The spokesperson added that the original headline in the report reads: “I feel the provincial council system is futile”.", "The original copy can be seen here on the website of PressReader, a digital newspaper distribution company.", "Below is a screenshot of the original newspaper page:", "The Sinhala headline of the original report indeed reads: “I feel the provincial council system is futile”.", "Below is a screenshot comparison of the doctored page in the misleading post (L) and the original newspaper report (R):", "State Minister Weerasekera also addressed the claim here on his Facebook page on September 5, 2020.", "The post features the misleading image, with a “FAKE” stamp over it.", "He wrote: “It is one thing to disagree in politics... But it is another to circulate false claims about an opinion you do not agree with.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]