["The video was published here on Facebook on January 22, 2020.", "It has been viewed more than 300 times.", "It shows a man wearing scrubs cutting into an organ to reveal hundreds of ‘balls’ inside.", "Below is a screenshot of the misleading post:", "The post’s Thai caption translates to English as: “Wow! The finale of bubble tea! Just seeing it directly that the stones in the gallbladder look like this! I have a goosebump! goodbye greasy food, fried food, and pearls.. I am scared!!!!!!”", "The video was also shared here, here, here, here, here, here, here, here, here on Facebook and here on Twitter, alongside a similar claim.", "Bubble tea is a tea-based drink with origins in Taiwan. The drink is often served over a bed of tapioca pearls, chewy balls made from the root of cassava plants, as stated in this report published by British tea manufacturer Twinings.", "Comments by some Thai Facebook users on the misleading post suggested they believed the video showed the gallbladder of someone who had drunk too much bubble tea.", "One person wrote: “It’s so scary, the kids like to drink [bubble tea].”", "Another commented: “Quit drinking”", "Below is a screenshot of the comments:", "This video has been shared in a misleading context; health experts, including the US-based doctor who took the original video, told AFP “it is not possible” for tapioca pearls to collect in gallbladders and directly cause gallstones in the human body.", "AFP found the video was originally published on the Instagram page of Dr. Kenichi Miyata, a surgeon based in California, US, dated January 9, 2020.", "He told AFP by direct message on Instagram on February 13, 2020 that he filmed the video. He directed AFP to this explanation video on his YouTube channel, titled “boba cannot collect in the gallbladder.”", "“Boba” is another word for bubble tea, according to the Merriam-Webster dictionary.", "At the video’s 17-second mark, he says: “On January 9, 2020 I posted a video of me cutting up a gallbladder that had bile and gallstones spill out, which reminded me of one of my favourite drinks, boba tea. Because of that I labelled that video ‘bag of boba’, because that’s what it reminded me of.", "“Unfortunately some people have interpreted that as me coming across a gallbladder full of tapioca balls, or boba. I am here to clarify that that is not the situation, and that it is not possible for that to happen.”", "Below is a screenshot of his video:", "Dr Asara Thepbunchonchai, a specialist in Hepatobiliary and Pancreatic Surgery at Thailand’s Rajavithi Hospital told AFP on February 12, 2020 that drinking bubble tea is “not the direct cause of gallstones in the human body.”", "She said: “Drinking bubble tea can make people gain weight or maybe the risk factor that causes diabetes but it’s not the direct cause of gallstones in the human body.", "“In fact, there are many risk factors that cause gallstones such as gender, age, ethnicity, weight, patients that have problems with obesity, rapid weight loss on low-calorie diets, and patients diagnosed diabetes or metabolic syndrome. Even those who have red blood cell-related disease such as hemolytic anemia can be exposed to a high risk of gallstones.”", "Ramathibodi Hospital in Thailand has issued this information sheet on gallstones which lists five factors that can increase risk of gallstones, and none include drinking bubble tea.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]