["The photo was published on Facebook here on March 22, 2020.", "The image shows a section of a Hindi textbook titled “common cold” that includes the Hindi words for “coronavirus” underlined in red. The section also lists “aspirin, anti-histamines and nasal spray” as recommended medicines to treat the virus.", "Below is a screenshot of the misleading post:", "The post’s Hindi-language caption translates to English as: “I've searched for many books to find a cure for COVID-19, but I found the cure in a class 12 school textbook. This is not a new disease, it's been here for years mentioned in this textbook. Sometimes it happens that people look for cures in well-researched books but forget to check school books. Book name: Modern Zoology by Dr Ramesh Gupta.”", "The photos were also shared alongside a similar claim on Facebook here and here and on Twitter here and here.", "The claim is misleading; the textbook does not refer to treatments for the new strain of coronavirus which was first detected in the Chinese city of Wuhan in December 2019.", "Keyword searches found that Dr. Ramesh Gupta, the cited author of the textbook, published the book in 1987. At the time, Gupta headed the department of Zoology at the Shri Jai Narain P.G. College in Lucknow, India.", "Dr. V.K. Dwivedi, a former colleague of Gupta's, told AFP that Gupta died more than one decade ago and explained that his textbook discusses the general family of coronaviruses.", "Gupta \"only mentioned the types of virus that cause the common cold and he mentioned basic treatment, it has nothing to do with the novel coronavirus, which as of now has no treatment,\" Dwivedi said.", "The WHO describes COVID-19 as a viral disease “caused by the most recently discovered coronavirus”, adding that the virus and disease was “unknown before the outbreak began in Wuhan, China, in December 2019.”", "It also maintains that no treatment for COVID-19 has been discovered: “To date, there is no specific medicine recommended to prevent or treat the new coronavirus (2019-nCoV)”.", "Below is a screenshot of the WHO release:", "India’s official Press Information Bureau also addressed the misleading claims circulating online in this tweet on March 22, 2020.", "The statement, which shows the photo shared in the misleading posts overlaid with a “FAKE” stamp, reads: “Beware of misleading treatment messages on the coronavirus”.", "कोरोना वायरस पर उपचार के भ्रामक संदेशो से सावधान रहें | #coronavirus infection पर हमेशा सटीक जानकारी के लिए स्वास्थ्य एवं परिवार कल्याण मंत्रालय, भारत सरकार के दिशानिर्देशों को पढ़े | pic.twitter.com/h34a6AygeC", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]