["This May 8, 2019, Facebook post, which has been shared more than 51,000 times, contains three images that show damaged buildings. The same photos were also found in this May 9, 2019, Facebook post that has been shared more than 27,000 times.", "Below is a screenshot of one of the posts:", "The first image shows a building broken into two parts with some men in black observing the ruins.", "The other two images show devastated buildings from a distance. The same buildings appear in both the second and third image, but the third shows some of them in more detail.", "Translated to English, the Indonesian-language caption of the first Facebook post reads:\n\t“Israel was rocked by an earthquake ..\n\tTel Aviv is devastated ..\n\tTheir attacks to Palestine have been reciprocated directly by God ..”", "Tel Aviv is one of Israel’s main cities. Here is the city’s official website.", "AFP conducted reverse image searches on Yandex and Google to trace the origin of the images.", "A search on the first image that shows men standing in front of a collapsed building returned a number of news articles, including this February 28, 2010, report by German newspaper Hannoversche Allgemeine Zeitung.", "The same image was published as the article’s main photo and credited to German news agency Deutsche Presse-Agentur (dpa), whose website is here.", "Below is a screenshot of the article:", "Translated to English, the caption of the main photo in the German-language article reads: “Collapsed houses, destroyed streets: An apartment complex collapses in Concepcion. Numerous roads and bridges, as in Santiago, are destroyed. Credit: dpa.”", "The headline of the article, translated into English, reads:\n\t“Major earthquake kills 700 people\n\tA major earthquake hit Chile and killed more than 700 people. The second largest city, Concepcion, was the worst hit.”", "This AFP photo taken in November 2011, taken a year after the quake hit, also shows the same building from a different angle.", "Below is a screenshot of the photo as it appears on the AFP Forum website:", "Below is a side-by-side image comparing the building as shown in the Facebook post (L) and the AFP photo (R), with similar features circled in red:", "The other two photos in the Facebook post that show a devastated city were in fact taken in Beichuan, in China’s Sichuan province, which was hit by a quake in 2008.", "The same image was published by CNN in this May 4, 2009 article.", "Below is a screenshot of the image in the CNN article:", "The caption of the CNN photo reads: “Rubble litters Beichuan, China, nearly a year after an earthquake killed thousands.”", "Below is an image comparing the two photos in the Facebook post (L) and (R) and the CNN photo (Bottom), with similar features circled in red:", "The same buildings can also be seen in this Getty Images photo taken May 12, 2009 and this Kyodo News photo, taken on May 12, 2013, in Beichuan, China.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]