["About this rating", "Amid an ongoing public debate over protests by National Football League players over social and racial injustice, a report emerged in October 2017 that four black players had given the league a \"sick ultimatum,\" in an effort to \"force white fans\" to engage in community activism.", "On 22 October 2017, the Freedom Daily web site published an article claiming:", "...Unfortunately, [Seattle Seahawks' Michael] Bennnett isn’t stopping their [sic] with his outlandish racism. He’s now demanding that all fans and the NFL comply with his anti-American and anti-cop views, with the with the ridiculous ultimatum he gave to the NFL this week.", "Similarly to how the NFL dedicates an entire month to breast cancer awareness, Bennett, along with several other protesting athletes want the entire month of November to be officially recognized by the NFL’s as a month to protest America’s police officers, and the the “oppression” that blacks feel with living in in our country.", "The article is centered around a memo reportedly sent to NFL commissioner Roger Goodell by four players: Philadelphia Eagles safety Malcolm Jenkins and wide receiver Torrey Smith; Seattle Seahawks defensive end Michael Bennett; and former Buffalo Bills and Baltimore Ravens wide receiver Anquan Boldin.", "In September 2017, Yahoo! Sports published what appears to be an authentic copy of the memo. However, Freedom Daily's description of it is grossly inaccurate and falsely claims that the four men gave the NFL an \"ultimatum\" (they did not), made demands (they did not), and that those demands related to fans (the memo did not once mention fans).", "Jenkins, Smith, Bennett, and Boldin wrote to Goodell to request (not demand) that the commissioner and the league lend their support to a coalition of players interested in community relations and activism, particularly in the areas of criminal justice reform and engagement with police.", "Specifically, the players suggested that the NFL could take part in visits to prisons, meetings with legislators on the state and national level, interviews and op-eds, engagement with nonprofit and grassroots organizations, and so on.", "To be clear, we are asking for your support. We appreciate your acknowledgment on the call regarding the clear distinction between support and permission. For us, support means:  bear all or part of the weight of; hold up; give assistance to, especially financially; enable to function or act. We need support, collaboration and partnerships to achieve our goal of  strengthening the community.", "The four players did request that the NFL dedicate the month of November to such activities, but asked that it serve as \"a month of Unity\" and community relations, in order to move the broader debate away from the national anthem protests.", "To counter the vast amount of press attention being referred to as the “national anthem protests” versus the large amount of grass roots work that many players around the league have invested their time and resources, we would like to request a league wide initiative that would include a month dedicated to a campaign initiative and related events. Similarly to what the league already implements for breast cancer awareness, honoring military, etc, we would like November to serve as a month of Unity for individual teams to engage and impact the community in their market.", "At no point in the memo published by Yahoo! Sports do the four players threaten Goodell, offer an ultimatum, or even allude to negative consequences in the event of his inaction or failure to support their efforts.", "Similarly, the memo contains no mention of fans (white or otherwise), or any obligations or expectations being placed on fans by the NFL. Therefore the two central claims in the Freedom Daily article are entirely false.", "Freedom Daily is a disreputable web site with a long history of sensationalist, inflammatory, and inaccurate reporting.", "Robinson, Charles.  \"Memo: NFL Players Ask Roger Goodell for Support in Racial Equality Campaign.\"\r\n  Yahoo! Sports.  20 September 2017.", "Robinson, Charles.  \"The Memo 4 Players Sent NFL Commissioner Roger Goodell.\"\r\n  Yahoo! Sports.  20 September 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]