["About this rating", "Juliane Koepcke was the lone survivor of a plane crash in 1971.", "The origins of a viral image frequently attached to Juliane Koepcke's story are unknown. This photograph most likely shows an actress in the movie about Koepcke, \"Miracles Still Happen,\" not Koepcke herself.", "The amazing story of teenager Juliane Koepcke has served as the basis of a full-length feature film, a documentary, and a book. Most internet users, however, have probably heard of Koepcke in the form of an internet meme featuring a photograph supposedly showing the 17-year-old plane crash survivor and a short piece of text summarizing her story:", "17 year-old Juliane Koepcke was sucked out of an airplane in 1971 after it was struck by a bolt of lightning. She fell 2 miles to the ground, strapped to her seat and survived after she endured 10 days in the Amazon Jungle", "While the story of Koepcke is undoubtedly true, we have a few unanswered questions about this photograph. This image most likely doesn't show Koepcke, but an actress from the 1974 movie about Koepcke, \"Miracles Still Happen.\"", "On Christmas Eve, 1971, Koepcke boarded LANSA Flight 508 (a Lockheed L-188A Electra turboprop plane) with her mother and 84 other passengers. The flight left from Lima, Peru, and was scheduled to land in Pucallpa, Peru, but was struck by a bolt of lighting. The plane went into a nose dive, broke into pieces, and Koepcke, who was still strapped to her seat, soon found herself outside of the plane plummeting approximately 9,000 feet (about 1.7 miles) into the Amazon jungle.", "Koepcke talked to the BBC about the ordeal in 2012:", "When we saw lightning around the plane, I was scared. My mother and I held hands but we were unable to speak. Other passengers began to cry and weep and scream.", "After about 10 minutes, I saw a very bright light on the outer engine on the left. My mother said very calmly: \"That is the end, it's all over.\" Those were the last words I ever heard from her.", "The plane jumped down and went into a nose-dive. It was pitch black and people were screaming, then the deep roaring of the engines filled my head completely.", "Suddenly the noise stopped and I was outside the plane. I was in a freefall, strapped to my seat bench and hanging head-over-heels. The whispering of the wind was the only noise I could hear.", "I felt completely alone.", "I could see the canopy of the jungle spinning towards me. Then I lost consciousness and remember nothing of the impact. Later I learned that the plane had broken into pieces about two miles above the ground.", "I woke the next day and looked up into the canopy. The first thought I had was: \"I survived an air crash.\"", "Koepcke was seriously injured in the fall. She broke her collar bone, had deep cuts on her arms and legs, and had torn a ligament in her knee that made it difficult for her to walk. If there was one thing Koepcke had on her side, it was the fact that she had some experience in the jungle. Her parents worked at a research station in the Amazon and in the year before the crash where she \"learned a lot about life in the rainforest\" and found that it wasn't the \"green hell that the world always thinks.\"", "Koepcke spent 10 days alone in the jungle. She traveled down a small stream, thinking that it was her safest option, and eventually came across a boat and a path leading into the rainforest. Koepcke, who said that she was almost too weak to walk by the end of the ordeal, pushed forward into the jungle until she found a small hut. After cleaning her wounds with gasoline, she fell asleep. The next day, she was found by villagers and soon thereafter was rescued:", "By the 10th day I couldn't stand properly and I drifted along the edge of a larger river I had found. I felt so lonely, like I was in a parallel universe far away from any human being.", "I thought I was hallucinating when I saw a really large boat. When I went to touch it and realised it was real, it was like an adrenaline shot.", "But [then I saw] there was a small path into the jungle where I found a hut with a palm leaf roof, an outboard motor and a litre of gasoline.", "I had a wound on my upper right arm. It was infested with maggots about one centimetre long. I remembered our dog had the same infection and my father had put kerosene in it, so I sucked the gasoline out and put it into the wound.", "The pain was intense as the maggots tried to get further into the wound. I pulled out about 30 maggots and was very proud of myself. I decided to spend the night there.", "The next day I heard the voices of several men outside. It was like hearing the voices of angels.", "The crash of Lansa Flight 508 is listed in the Guinness Book of World Records for having the \"Highest death toll (91) caused by lightning (in-flight).\" While Koepcke was the only person to ultimately survive the ordeal, there's evidence that some other passengers (including Koepcke's mother) survived the initial crash. They were unable to seek out help as the teen had, however, and perished before rescue crews arrived.", "Here's an article from Dec. 29, 1971, about the crash:", "Wed, Dec 29, 1971 – Page 34 · The Indianapolis Star (Indianapolis, Indiana) · Newspapers.com", "And here's an article from Jan. 4, 1972, about Koepcke's rescue:", "Tue, Jan 4, 1972 – Page 21 · The Daily Times-News (Burlington, North Carolina) · Newspapers.com", "Tue, Jan 4, 1972 – Page 22 · The Daily Times-News (Burlington, North Carolina) · Newspapers.com", "The story of Koepcke is undoubtedly true. However, it's unlikely that the photograph that frequently accompanies this claim truly shows her during this harrowing ordeal. Although we have been unable to definitively determine the origins of this photograph, it most likely shows a promotional image for the 1974 movie \"Miracles Still Happen,\" a dramatization of Koepcke's story.", "Susan Penhaligon, the actress who played Koepcke in \"Miracles Still Happen,\" told us that she is not the pictured woman. However, she added that the dress in the photo is similar to the won she wore in the film and that this may be a promotional image for the movie that featured an unknown model.", "Here's a comparison between the viral image (left) and a still of Penhaligon as Koepcke in the 1974 movie:", "While we have not been able to definitively source this viral image, it is true that Juliane Koepcke survived 10 days alone in the Amazon rainforest after falling nearly two miles during a plane crash.", "MacDonald, Katherine.   \"Survival Stories: The Girl Who Fell From the Sky.\"  \r\n  Reader's Digest.   Retrieved 5 November 2019.", "UPI.   \"2 Patrols Hunt Airline Debris.\"\r\n    29 December 1971.", "Heath, William.   \"Survivor of Crash Found After 12 Days.\"\r\n    Associated Press.   4 January 1972.", "Koepcke, Juliane.   \"Juliane Koepcke: How I Survived a Plane Crash.\"\r\n    BBC.   24 March 2012.", "Updated [15 April 2021]: Updated to note that the viral image does not show actress Susan Penhaligon.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]