["About this rating", "In April 2017, not long after the United States announced that it had detonated the Massive Ordnance Air Blast, or MOAB (also colloquially called the \"Mother of All Bombs\"), the Facebook page \"Cold Dead Hands\" shared a video of a large explosion:", "LEAKED FOOTAGE: The MOTHER of all bombs being dropped in Afghanistan today.", "The United States military did drop a A GBU-43/B MOAB on ISIS targets in Afghanistan in April 2017. This video, however, does not show that explosion.  The video is from at least 2015, when it was first shared along with the claim that it shows an ammunition depot exploding after it was hit by an airstrike in Sanaa, Yemen.  While we were unable to authenticate whether that was completely true, video from the New York Times shows a similar blast:", "An airstrike apparently carried out by the Saudi-led military coalition set off a huge explosion on Monday morning in Sana, the capital of Yemen, flattening homes close to the site and shaking buildings as far away as the outskirts of the city. At least 25 people were killed, according to witnesses and medical officials.", "The explosion occurred around 10:30 a.m. in the Faj Attan area of the city, near a mountaintop air defense base that warplanes had been bombing for days. Residents speculated that a bomb had struck an underground munitions depot, which might have explained why the blast seemed like an earthquake at first, before erupting into a fireball seen for miles around.", "On 14 April 2017, the Pentagon released the first (and so far only) video of the 2017 MOAB explosion in Afghanistan:", "#Breaking: Pentagon releases video of the “mother of all bombs” being dropped in Afghanistan pic.twitter.com/GaXwhpWDmb", "— TODAY (@TODAYshow) April 14, 2017", "Starr, Barbara.   \"First on CNN: US Drops Largest Non-Nuclear Bomb in Afghanistan.\"\r\n    CNN.   14 April 2017.", "Kalfood, Mohammed Ali.   \"At Least 25 Die as Airstrike Sets Off Huge Blast in Yemen.\"\r\n    The New York Times.   20 April 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]