["The claim was shared in this post, published on February 9, 2021 on a Facebook page with more than 22,000 followers.", "“State Bank asks Pakistani banks to deduct Rs 2.5 on each ATM transaction,” it reads.", "The text claims that the State Bank of Pakistan (SBP) has “asked all banks to charge customers Rs2.5 on each transaction and balance inquiry through ATM machines” from February 1, 2021.", "“The amount is received as the cost of slips taken by customers after each transaction,” it said.", "Similar claims were also published here and here on Facebook and here on Twitter.", "However, the claim is false.", "While bank network 1Link has introduced a charge on printing paper ATM receipts for environmental reasons, this measure has not been imposed by the State Bank of Pakistan.", "1Link represents 38 banks in Pakistan and operates ATMs across the country.", "Several banks issued clarifications via social media and text messages to customers stating the SBP had not imposed the charge on ATP receipt.", "Major Pakistani bank Habib Bank Limited tweeted that the SBP “has not given any instructions on charging customers for printing of ATM receipts”.", "“This is a “GO GREEN” initiative by 1Link to encourage customers to avoid unnecessary use of paper and keep the environment clean,” it said.", "An AFP correspondent in Islamabad also received a text message from MCB Bank asking customers to “disregard any message saying SBP has directed Banks to charge fees on printing of receipts”.", "Contacted by AFP, Malik Saad Ahmed, manager of customer support of 1Link’s payment and switch system, also confirmed that the SBP has not asked banks to impose the fee.", "\"Customers could choose between paying 2.50 rupees for a paper receipt or a free receipt by text message,\" 1Link said in a statement on February 9, 2021.", "\"This initiative is part of a 'Go-Green' exercise to reduce litter and lower the cost of printed receipts, which are usually discarded immediately. In addition, sensitive customer information is left for others to peruse,\" it said.", "Several Pakistani media outlets reported on the false claim about the new ATM fee; for example The Express Tribune here, ARY television here, The Business Recorder here and Pakistan Today here.", "AFP previously debunked false claims that the SBP had temporarily limited cash withdrawals.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]