["The photo has been shared more than 200 times since it was posted here to Facebook on August 12, 2019.", "Translated to English, the traditional Chinese caption reads: “Lights have been turned off at the airport, which is closing. Don’t know if the air-conditioners will be switched off too.”", "The photo was taken at Hong Kong International Airport’s Arrivals Hall A, as seen in this AFP image.", "Pro-democracy protesters staged a sit-in at the Hong Kong airport on August 12, 2019, as the city’s ongoing democracy demonstrations entered the tenth consecutive week.", "This August 12, 2019 AFP report states in part: “The protesters streamed into Hong Kong airport and quickly transformed the arrivals hall at one of the world's busiest transport hubs into a sea of black.", "“The massive protest forced the cancellation of all flights in and out of Hong Kong airport.”", "Below is a screenshot of the post:", "The same photo has been shared here and here on Facebook, here on Twitter and here on Hong Kong forum HKGolden alongside an identical claim.", "A similar claim in Korean is seen here and here alongside the same photo.", "The claim is false; Hong Kong airport confirmed no lights were turned off on August 12, 2019.", "Airport Authority’s Media Relations team confirmed with AFP in an email dated August 15: “According to our record, all lighting operated as normal on 12 August.”", "Zooming in on this higher-definition version of the photo tweeted by a Hong Kong journalist, the clock under the “A” sign reads 5:10.", "Below is a screenshot of the photo with the clock circled in red:", "Lights were on in this Associated Press livestream video that shows the protest at the airport from 4:55 pm through 5:51 pm August 12, 2019.", "The AP video was taken near a 7-Eleven convenience store just to the left of Arrivals Hall A, as seen in the map of the airport below:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]