["About this rating", "On 9 August 2017, Twitter user Ismail Kidd Noorzai posted a photograph to his Twitter page showing what appeared to be a display of firearms for sale at Walmart, with a sign directly over the display reading, \"Own the school year like a hero\":", "Oh @Walmart ??‍♂️ pic.twitter.com/SLdROB4KYF", "— Ismail Kidd Noorzai (@ismailkidd) August 9, 2017", "The image ignited a round of internet outrage, with its placement causing some viewers to link it to mass shootings in schools that have become somewhat endemic throughout the United States:", "Holy shit, WalMart. pic.twitter.com/FiMdAms0c3", "— jordan ?? (@JordanUhl) August 9, 2017", "Reports about the image took off in both mainstream news outlets and liberal blogs. Initially, Walmart representatives took to the chain's official social media channels to say the store location captured in the photograph had been ascertained as Evansville, Indiana, and they assured concerned Twitter users that they had removed the sign from the gun display area in that store:", "That it was truly awful. ? We immediately removed the sign from the display as soon as we found out the store location. -Vik", "— Walmart (@Walmart) August 9, 2017", "But the next day, Walmart spokesman Charles Crowson told us the company was still investigating whether the photograph was authentic, and they said the store location had not been definitively determined (but was not Evansville):", "Not only are we trying to confirm the store location, we’re trying to confirm the validity of the photograph itself. There was some miscommunication between the store and our social media team and we later learned it was not in Evansville, Indiana. We are now looking for the proper store.", "All possibilities are being explored, whether it be customer prank, an associate mistake or digital editing. We’re not ruling anything out", "Noorzai told us he initially stumbled across the picture on Reddit on a board dedicated to humor, in which some readers opined that the image was a prank perpetrated by a store employee or a worker mistak:", "One time I told a new employee in the backroom \"hey, go put this out on floor for me\" meaning \"put this out on the sales floor on the right shelf\". A few minutes later, there the item was sitting literally on the floor just outside the stockroom. This was basically my reaction when I realized what I had said to him.", "The phrase \"own the school year like a hero\" is associated with a back-to-school advertising campaign and does not have any connection to firearms sales. It is unclear whether the sign was placed near the display by mistake, or if the perspective of the photograph made it appear to be closer to the gun display than it really was.", "Crowson sent us Walmart's official statement on the incident, which says:", "What’s seen in this photograph would never be acceptable in our stores. We regret this situation and are looking into how it could have happened.", "Wattles, Jackie.    \"Walmart Apologizes for Sign Marketing Guns as Back-to-School Items.\"\r\n      CNN.    9 August 2017.", "Brennan, Christopher.    \"Outrage After Walmart Puts 'Own the School Like a Hero' Sign Above gun Sale.\"\r\n      [New York] Daily News.    9 August 2017.", "Cano, Stephanie.    \"Walmart Sign Over Gun Display Causes Uproar on Social Media.\"\r\n      Click2Houston.    9 August 2017.", "Bodner, Brett.    \"SEE IT: Walmart Builds Tasteless 9/11 Tribute Display Out of Packs of Coke.\"\r\n      [New York] Daily News.     8 September 2016.", "Broadbent, Elizabeth.    \"Hey Walmart, Suicide Is Not a Costume.\"\r\n     ScaryMommy.com.", "A spokesman for Walmart followed up with us to point out the company is currently investigating the incident and that contrary to what was said on Walmart's official Twitter page, the location of the incident hasn't been ascertained.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]