["“Here’s the ventilators that was sent to New York. Stuck in a warehouse. Democrat Governor Cuomo? Why?” says text accompanying a photo of boxes on trolleys inside a warehouse in this post.", "However, statements from New York agencies and officials in charge of ventilator deployment contradict the claim.", "The photo was shot on March 24, 2020 at the New York City Emergency Management (NYCEM) warehouse in Brooklyn, during a press conference held by mayor Bill de Blasio.", "It was taken by photographer Scott Lynch for Gothamist, a local news website.", "Justin Bennett, an NYCEM spokesman, told AFP by email that the 400 ventilators visible in the photo were received and transferred by the agency within 24 hours.", "The equipment was “received by NYC Emergency Management on the evening of 3/23 and then transferred to the NYC Department of Health on 3/24 for distribution to area hospitals,” Bennett said.", "A New York Daily News journalist present at the scene reported that the March 24 press event “ended with ventilators being loaded onto trucks bound for King’s County Hospital.”", "Patrick Gallahue, a press officer for New York City’s health department, also said ventilators from the federal government had been received and distributed.", "“The City has now received all 2,500 ventilators promised by the federal government and has distributed nearly all of them to hospitals in need,” Gallahue said to AFP in an email.", "The photo was shared thousands of times while the question of ventilator availability in New York -- the US state with the highest number of cases -- is under heavy scrutiny.", "Cuomo announced on April 2 that the state could run out of these machines, which are used to induce respiration for patients with a condition affecting normal breathing, within six days.", "The misleading posts began to be shared the day after President Donald Trump tweeted that ventilators sent by the federal government were “found in New York storage,” urging the state to distribute them.", "Trump was responding to March 24 calls from Cuomo for more ventilators for his state. The governor directly addressed the president’s concerns on March 28 by explaining that the state was centralizing all available equipment in preparation for the apex of the pandemic and releasing ventilators to hospitals in need.", "On April 2, Cuomo announced that his state had received 4,400 ventilators from the federal government, and had distributed 2,200.", "All unused ventilators in the state will be centralized and deployed to hospitals that need them, he said.", "“There could be several hundred excess ventilators in hospitals that don’t have a COVID response,” the governor said during his April 3 briefing.", "There were 57,159 confirmed COVID-19 cases in New York State on April 3, according to state authorities. The number of confirmed coronavirus deaths surpassed 50,000 worldwide as the United States, Spain and Britain grappled with their highest tolls yet.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]