["About this rating", "An image purportedly showing NASA astronaut Chris Hadfield holding a bag of marijuana aboard the International Space Station (ISS) was posted by the \"Pictures in History\" Facebook page in November 2018, along with a caption stating that the astronaut was testing the effects of the drug in space:", "Although followers might expect to see genuine historical images being posted by a social media page named \"Pictures in History,\" that account frequently shares manipulated or miscaptioned images. In this case, an image of Hadfield holding a bag of Easter Eggs was doctored in order to make it appear as if the astronaut were showing off a pouch of marijuana", "The genuine image was originally posted to Hadfield's Twitter account on Easter in 2013:", "Not only is the image of Chris Hadfield holding a bag of marijuana fake, but it's unlikely that any similar (but genuine) photographs of astronauts with drug paraphernalia exist, as NASA has been a drug-free workplace since at least the mid-1980s.", "Astrophysicist Neil deGrasse Tyson has also warned against drug use aboard the International Space Station, arguing that it could be deadly for astronauts to get stoned in space:", "\"The problem is, in space now, many things will kill you. So, if you do anything to alter your understanding of what is reality, that's not in the interest of your health. If you want to get high in space, lock yourself in your cabin, and don't come out. 'Cause you could break stuff inadvertently.\"", "Koren, Marina.   \"Reefer Madness at NASA.\"\r\n    The Atlantic.   21 November 2018.", "Specktor, Brandon.   \"Neil deGrasse Tyson Reminds Us Why Smoking Weed in Space Is a Bad Idea.\"\r\n    Live Science.   17 September 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]