["About this rating", "In 1975, young lawyer Hillary Rodham was appointed to represent a defendant charged with raping a 12-year-old girl. Clinton reluctantly took on the case, which ended with a plea bargain for the defendant, and later chuckled about some aspects of the case when discussing it years later.", "Hillary Clinton did not volunteer to be the defendant's lawyer, she did not laugh about the case's outcome, she did not assert that the complainant \"made up the rape story,\" she did not claim she knew the defendant to be guilty, and she did not \"free\" the defendant.", "In May 2016, the image macro shown above began circulating on Facebook, holding that back in 1975 a young Hillary Clinton (then Hillary Rodham) had \"volunteered\" to represent a 42-year-old man (Thomas Alfred Taylor) who was accused of raping a 12-year-old girl, that Clinton told the judge in the case that the complainant \"made up the rape story because [she] enjoyed fantasizing about older men, that Clinton \"got [the] rapist freed,\" and that Clinton later admitted she knew the defendant was guilty and \"laughed about\" the outcome of the case. Although Hillary Clinton was indeed involved in a case of this nature, the aspects of the case presented in the image were largely inaccurate or exaggerated.", "As Hillary Clinton wrote in her 2003 biography Living History, she didn't volunteer to represent the defendant, but rather was appointed to the case by the judge:", "[Prosecuting attorney Mahlon Gibson] called me to tell me an indigent prisoner accused of raping a twelve-year-old girl wanted a woman lawyer. [Prosecutor Mahlon] Gibson had recommended that the criminal court judge, Maupin Cummings, appoint me. I told Mahlon I really didn’t feel comfortable taking on such a client, but Mahlon gently reminded me that I couldn’t very well refuse the judge’s request.", "That assertion was backed up by the prosecuting attorney, Mahlon Gibson, as noted in a 2008 Newsday article about the case:", "On May 21, 1975, Tom Taylor rose in court to demand that Washington County Judge Maupin Cummings allow him to fire his male court-appointed lawyer in favor of a female attorney. Taylor, who earned a meager wage at a paper bag factory and lived with relatives, had already spent 10 days in the county jail and was grasping for a way to avoid a 30 years-to-life term in the state penitentiary for rape.", "Taylor, 41, figured a jury would be less hostile to a rape defendant represented by a woman, according to one of his friends. Cummings agreed to the request, scanned the list of available female attorneys (there were only a half dozen in the county at the time) and assigned Rodham, who had virtually no experience in criminal litigation.", "“Hillary told me she didn’t want to take that case, she made that very clear,” recalls prosecutor Gibson, who phoned her with the judge’s order.", "Rodham immersed herself in Taylor’s defense as the law school’s spring semester came to an end. “She worked a lot of nights on it,” said Van Gearhart, her teaching assistant at the law clinic in 1975. “I remember her doing that because she wanted to show that she was willing to take court appointments, hoping that the bar would help us in getting established as a clinic.”", "Gibson said the same thing during a 2014 CNN interview about the case, adding that Hillary had attempted unsuccessfully to get the judge to remove her from the case:", "Gibson said that it is “ridiculous” for people to question how Clinton became Taylor’s representation.", "“She got appointed to represent this guy,” he told CNN when asked about the controversy.", "According to Gibson, Maupin Cummings, the judge in the case, kept a list of attorneys who would represent poor clients. Clinton was on that list and helped run a legal aid clinic at the time.", "Taylor was assigned a public defender in the case but Gibson said he quickly “started screaming for a woman attorney” to represent him.", "Gibson said Clinton called him shortly after the judge assigned her to the case and said, “I don't want to represent this guy. I just can't stand this. I don't want to get involved. Can you get me off?”", "“I told her, ‘Well contact the judge and see what he says about it,’ but I also said don't jump on him and make him mad,” Gibson said. “She contacted the judge and the judge didn't remove her and she stayed on the case.”", "Documents from the 1975 case include an affidavit (p. 34) sworn by Clinton, from which the \"in court, Hillary told the judge that I made up the rape story\" portion of the claims was derived. That affidavit doesn't show, as claimed, that Hillary Clinton asserted the defendant \"made up the rape story because [she] enjoyed fantasizing about men\"; rather, it shows that other people, including an expert in child psychology, had said that the complainant was \"emotionally unstable with a tendency to seek out older men and to engage in fantasizing about persons, claiming they had attacked her body,\" and that \"children in early adolescence tend to exaggerate or romanticize sexual experiences.\"  Clinton therefore asked the court to have the complainant undergo a psychiatric exam (at the defense's expense) to determine the validity of that information:", "“She was vigorously advocating for her client. What she did was appropriate,” said Andrew Schepard, director of Hofstra Law School’s Center for Children, Families and the Law. “He was lucky to have her as a lawyer ... In terms of what’s good for the little girl? It would have been hell on the victim. But that wasn’t Hillary’s problem.”", "As for the claim that Hillary Clinton \"knew the defendant was guilty,\" she couldn't possibly have known that unless she were present when the incident in question occurred. It's also largely irrelevant given that under Hillary Clinton's handling of the case, the defendant pled guilty rather than going to trial and asserting his innocence.", "As Newsday observed, the case was a \"hopelessly convoluted\" one in which the facts were far from straightforward and in which another person (a juvenile) was also charged:", "The case, [Hillary] quickly learned, was hopelessly convoluted, hinging on the accounts of three people — Taylor, the girl and a 15-year-old boy — who all had reasons to withhold details.", "Finding out precisely what happened in the pre-dawn hours of May 10, 1975, is difficult three decades later, particularly since Taylor died in 1992 of a heart ailment. But a basic outline can be reconstructed from interviews, court documents, witnesses’ statements and the Washington County sheriff’s original case file, obtained under the Freedom of Information Act.", "Sometime around midnight, the girl was sleeping over at a friend’s house in Springdale when Taylor and his 20-year-old cousin walked in, asking if anyone wanted to take a drive. The sixth-grader, who says she was bored and wanted to buy a soda, jumped into Taylor’s beat-up red 1963 Chevrolet pickup truck.", "Soon after, they picked up the 15-year-old boy and drove to a liquor store, where Taylor bought a pint of Old Grand-Dad whiskey, which he mixed for the girl in a cup of Coca-Cola, according to the boy, now a 48-year-old Army veteran. (Newsday is withholding the boy’s name because he was charged in the case as a juvenile offender.)", "After a few hours at a local bowling alley, the foursome crammed into Taylor’s truck and drove to a weedy ravine off a busy two-lane highway connecting the sister cities of Fayetteville and Springdale, according the sheriff’s department account.", "Taylor and the older man went off for a walk, leaving the 12-year-old and the teenager alone in the cab. In a statement to police, the 15-year-old said he removed his pants and admitted to having sex, revealing the encounter only after being pressed by investigators.", "Moments later, he said he left and Taylor approached the truck, climbing on top of the girl. The girl let out a scream, according to the police report, and he claims to have seen Taylor hitching up his pants.", "The victim, the boy reported, turned to both of them and yelled, “You all planned this, didn’t you?”", "At 4:50 a.m., the girl walked into a local emergency room, badly shaken. The doctor’s report noted that she had injuries consistent with rape.", "Taylor was a tight-lipped client, never wavering from his claim that he’d driven all the passengers home that night without stopping in the ravine, according to Dale Gibson. (Taylor was less guarded around his 15-year-old companion, who recalls the older man whispering “Let’s keep our stories straight” when the two met in county jail.)", "Audio tapes from the 1980s of Hillary Clinton describing the case to journalist Roy Reed surfaced in 2014 and were incorporated into a video clip associated with the image macro's claims:", "The audio on these tapes is difficult to understand, but Clinton can be heard describing the case as \"terrible.\" She did audibly laugh or chuckle at points, not about \"knowing that the defendant was guilty\" or \"getting a guilty guy off\" (which makes little sense, given that the defendant pled guilty) but rather while musing about how elements of the case that might ordinarily have supported the prosecution worked in the defendant's favor (i.e., observing that the defendant's passing a polygraph test had \"forever destroyed her faith\" in that technology):", "Finally, Hillary didn't \"free\" the defendant in the case. Instead, the prosecuting attorney agreed to a plea deal involving a lesser charge that carried a five-year sentence, of which the judge suspended four years and allowed two months credit of time already served towards the remaining year:", "Additionally, according to Newsday it was the complainant and her mother who pushed the state to make a quick plea deal rather than have the former go through the ordeal of a court trial, with the mother actively interfering in the investigation to bring about that result:", "The victim says it was her mother, who had recently been abandoned by her husband, who pushed for a quick plea deal to avoid the humiliation of having her daughter testify in open court. The mother, who died several years ago, was so eager to end the ordeal she coached her daughter’s statements and interrupted interviews with police, Sgt. Dale Gibson [the department’s lead investigator] recalls.", "“We both wanted it to be over with,” the victim told Newsday. “They kept asking me the same questions over and over. I was crying all the time.”", "Even now, that outcome is not unusual for violent criminal charges: 2014 statistics show that 97% of criminal cases (including rape) are resolved by plea bargain, and only 3% go to trial. The ratio of plea bargains to trials was similar in 1970 [PDF].", "Additionally, that 1975 criminal case came before the widespread adoptions of rape shield laws that now protect rape victims in court from some forms of questioning. A case brought in 1975 would have been subject to much weaker legal protection for the accuser than today.", "As Hillary Clinton said while looking back on the case during a 2014 interview for Mumsnet: \"I had a professional duty to represent my client to the best of my ability, which I did.  He later pled guilty to a lesser included offense. When you're a lawyer you often don't have the choice as to who you will represent. And by the very nature of criminal law there will be those you represent you don't approve of. But, at least in our system, you have an obligation. And once I was appointed I fulfilled that obligation.\"", "Newsday closed their 2008 article on this case by reporting that the (unnamed) victim had experienced subsequent legal problems but bore Hillary Clinton \"no ill will\":", "In 2005, while working in a laundry, the victim stole several hundred dollars worth of checks from her boss to buy drugs. She is now living in a halfway house and looking for work.", "Despite these problems, she bears Hillary Rodham Clinton no ill will and was eager to read “Living History” — at least pages 72 and 73, which contain her case.", "Eight years later, in 2016, the UK's Daily Mail identified the victim (who had previously spoken anonymously to the Daily Beast) as Kathy Shelton and quoted her as saying that she \"cannot forgive Hillary Clinton for defending her rapist\" and that she was unaware for many years that Hillary Clinton was the person who had represented the defendant in her case:", "'It's put a lot of anger back in me,' said Shelton, now 54, in an exclusive interview at her Springdale, Arkansas, home. 'Every time I see [Clinton] on TV I just want to reach in there and grab her, but I can't do that.'", "For decades, Shelton said she had no idea that Clinton was the same woman as the lawyer who defended her rapist in 1975.", "Clinton, Hillary Rodham.   Living History\r\n    New York: Simon & Schuster, 2003.   ISBN 0-743-2222-45   (pp. 72-73).", "Dervan, Lucian E. et. al.    \"The Innocent Defendant’s Dilemma:\r\nAn Innovative Empirical Study of Plea Bargaining’s Innocence Problem.\"\r\n    Journal of Criminal Law and Criminology.    Winter 2013.", "Goodman, Alana.    \"The Hillary Tapes.\"\r\n    Washington Free Beacon.     15 June 2014.", "Rakoff, Jed S.    \"Why Innocent People Plead Guilty.\"\r\n    The New York Review of Books.     20 November 2014.", "Washington County Circuit Court.    \"State of Arkansas v. Thomas Alfred Taylor.\"\r\n    18 July 1975     (page 34).", "Thrush, Glenn.   \"Election 2008: For Young Clinton, A Case of Clashing Ideals.\"\r\n    Newsday.   24 February 2008.", "Merica, Dan.   \"Prosecutor in Controversial Case Says Clinton Had No Choice But to Defend Rapist.\"\r\n    CNN.   25 June 2014.", "Boerma, Lindsey.   \"Hillary Clinton Stands by Her Defense of 1975 Rape Suspect.\"\r\n    CBS News.   8 July 2014.", "Goodman, Alana.   \"Child Rape Victim Comes Forward for the First Time in 40 Years ...\"\r\n    Daily Mail.   9 August 2016.", "Rogin, Josh.   \"Exclusive: ‘Hillary Clinton Took Me Through Hell,’ Rape Victim Says.\"\r\n    The Daily Beast.   20 June 2014.", "Kim LaCapria is a former writer for Snopes.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]