["About this rating", "In January 2016, the above-reproduced piece began appearing in our inbox. According to the e-mail, its content was written by \"the political correspondent for Bloomberg [who] wrote extensively about Obama even before he was elected and he did it with facts and more facts.\" Initially, however, no name or source publication appeared in the e-mail forward. The item wasn't particularly popular until February 2016, when it suddenly carried a new attribution— The New Yorker magazine:", "The author is the political correspondent for Bloomberg and wrote extensively about Obama even before he was elected and he did it with facts . This article is a reminder that history shows presidential candidates are often elected based on the state of the union and mood of the people in a particular election cycle. If either Hillary or Bernie is elected, better start preparing for the collapse of America as we know it. The author seems to understand that and is sending a warning.", "However, there were many inconsistencies. The author of the piece was still only described, not named, and we were unable to find a published article by The New Yorker that matched the item. The piece also didn't seem to be written in the same style as the rest of the pieces in that magazine. The earliest versions of the item included the Bloomberg claim, but lacked the subsequent The New Yorker element. Around the same time, other versions began to appear, all with the same publication claim.", "As it turned out, it wasn't written by anyone at The New Yorker or Bloomberg, and didn't appear anywhere in either publication.  The piece was small-government advocate and President Obama birth certificate conspiracy theorist Don Fredrick's work, and was originally published on his blog, The Complete Obama Timeline. Readers apparently confused Fredrick with Bloomberg Politics writer Don Frederick (not Fredrick), a completely different person with no relation to the writer of the Trump piece.", "While some readers obviously found Fredrick's opinion piece agreeable, it originated neither with The New Yorker nor Bloomberg's Don Frederick.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]