["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Hillary Clinton takes part in the PBS NewsHour Democratic presidential candidate debate at the University of Wisconsin-Milwaukee on Feb. 11, 2016. (Win McNamee/Getty Images)", "During her opening statement at the Democratic presidential debate in Milwaukee, Wis., Hillary Clinton tried to channel the frustration that has led many voters to consider backing her opponent, Bernie Sanders.", "\"I know a lot of Americans are angry about the economy, and for good cause,\" Clinton said. \"Americans haven’t had a raise in 15 years.\"", "Many individual American households have seen their incomes rise since the turn of the century. But we’ll take a look at the most basic measure of how well Americans more generally are doing income-wise -- namely, median household income, adjusted for inflation.", "As shown in the following graph from the Federal Reserve Board of St. Louis, inflation-adjusted median household income generally rose between 1984 and 1999, then began falling starting in 1999 and 2000.", "Specifically, median household income, adjusted for inflation, rose from $48,664 in 1984 to $57,843 in 1999 -- a 19 percent increase over 15 years.", "Then, over the next 15 years it fell to $53,657, a decline of 7 percent.", "So by this measure, Clinton is correct.", "Other statistics are somewhat less clear-cut.", "Consider the median usual weekly earnings for full-time wage and salary workers age 16 and over. Here’s the St. Louis Fed’s graph for that statistic:", "Using this measure, wages are up slightly since 2000. That’s a raise, but it’s a pretty modest one of 2 percent over the past 15 years. That compares to a 6 percent increase between 1984 and 2000.", "In one sense, wages are a reasonable yardstick to use in judging Clinton’s claim, since this statistic focuses on people who are employed full-time on a wage and salary basis -- the very kind of people who would be in line to \"get a raise\" if employers were so inclined.", "On the other hand, median household income is the broadest measure of income growth. Many households either see a share of their income in government transfer payments, such as Social Security, or from investments, rather than wages or salaries, and this income is not reflected in the the second statistic we looked at. Because median household income encompasses a wider range of income sources, it’s reasonable for Clinton to base her statement on that measurement.", "Our ruling", "Clinton said, \"Americans haven’t had a raise in 15 years.\" Using inflation-adjusted median household income, she’s right. There has actually been a decline of 7 percent over that period.", "However, earnings of wage and salary workers have risen over that period -- by about 2 percent. That’s a tepid increase. But, it is an increase.", "On balance, we rate Clinton’s statement Mostly True.", "Hillary Clinton, remarks during the Democratic presidential debate in Milwaukee, Feb. 11, 2015", "Federal Reserve Board of St. Louis, \"Real Median Household Income in the United States,\" accessed Feb. 11, 2016", "Federal Reserve Board of St. Louis, \"Employed full time: Median usual weekly real earnings: Wage and salary workers: 16 years and over,\" accessed Feb. 11, 2016", "PolitiFact, \"Economy is 'too weak to raise income levels,' says Nikki Haley in State of the Union response,\" Jan. 12, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]