["About this rating", "Individuals who had official roles in the 2016 Trump campaigns in Kentucky and Oklahoma are currently in jail for crimes including child sex trafficking: Oklahoma campaign chair Ralph Shortey and Tim Nolan, a Trump delegate who has described himself as the chair of the Campbell County, Kentucky Trump 2016 campaign.", "Tim Nolan was not the Kentucky campaign chair for Trump’s 2016 campaign.", "Following widespread coverage of politically well-connected financier Jeffrey Epstein’s July 2019 arrest for crimes including the sex trafficking of minors, claims of similar crimes committed by members of Trump’s 2016 campaign went viral:", "It is true that two prominent Trump 2016 campaign workers, Ralph Shortey and Tim Nolan, are currently in jail for crimes related to the sex trafficking of minors, but it would be incorrect to say that Nolan was the Kentucky state campaign chair.", "Ralph Shortey is a former Oklahoma state senator who served as the Oklahoma campaign chair for Donald Trump’s 2016 Presidential Campaign. On November 30, 2017, as part of a deal with prosecutors, he pleaded guilty to one count of child sex trafficking:", "Shortey, a 35-year-old married father of three, resigned from the state Legislature in March after being charged with several felonies, including engaging in child prostitution, after police found him in a hotel room with a 17-year-old male. Shortey's attorney, Ed Blau, confirmed that his client will plead guilty to a charge of child sex trafficking in exchange for U.S. prosecutors' dropping three child pornography charges against him. [...] While the age of consent in Oklahoma is 16, child prostitution statutes apply to anyone under 18.", "On September 17, 2018, Shortey was sentenced to 15 years in prison. He had faced a sentence of up to life in prison.", "Tim Nolan is a former Kentucky judge and conservative activist who volunteered with Trump’s 2016 campaign in multiple capacities, including as a state-level Trump delegate and ballot observer, and who described himself as Campbell County, Kentucky’s Trump 2016 election chair. The latter claim, though repeated in multiple news reports, has been disputed by local Republicans following Nolan's arrest for multiple sex crimes.", "According to the Cincinnati Enquirer, “Nolan's brash style made him one of the more visible campaigners for President Trump in Northern Kentucky, though since his arrest many in the campaign publicly questioned his claim of heading the campaign in Campbell County.”", "In April 2016, Nolan was charged with forcing a minor to engage in commercial sex, an accusation that came from a 16-year-old student at Campbell County High School who, with her mother, lived on a rented trailer on Nolan’s property. In the United States, sex trafficking is defined as commercial sex induced by force, fraud or coercion, or involving a minor under the age of 18. The accusation lead to the discovery of a host of other sex crimes that spanned over a decade:", "The charges against Nolan involved 19 women, seven of which were under 18, and go back as far as 2004. All but two were addicted to opioids, [Assistant Attorney General Barbara] Whaley said. He would often visit a local woman's shelter ... and \"was a frequent volunteer at drug court,\" to meet women addicted to opioids, said [Whaley, who served as the special prosecutor in the case].", "In February 2018, Nolan accepted a plea deal that stipulated 20 years in prison. In May, he was sentenced and is currently in jail.", "Brammer, John Paul.   “Trump's Oklahoma Campaign Chair to Plead Guilty to Child Sex Trafficking.”\r\n    NBC News.   20 November 2017.", "KJRH Oklahoma City.   “Ex-Senator Ralph Shortey Sentenced to 15 Years in Prison in Child Sex Trafficking Case.”\r\n    17 September 2018.", "Wartman, Scott.   “Tim Nolan Was a Judge. Tim Nolan Was a Conservative Activist. Tim Nolan Was a Human Trafficker.”\r\n    Cincinnati Enquirer.   26 March 2018.", "Wartman, Scott.   “Trump Supporters Distance Themselves from Ex-judge Charged With Rape.”\r\n    Cincinnati Enquirer.   18 May 2017.", "Wartman, Scott.   “Former Judge Tim Nolan Sentenced to 20 Years. 'You ... Made Me Lose Hope' One Victim Tells Him.”\r\n    Cincinnati Enquirer.   3 May 2018.", "Malo, Sebastien.   “Ex-Trump Campaign Official Charged With Human Trafficking.”\r\n    Reuters.   2 May 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]