["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This half-page ad from the American Action Network ran Dec. 7 and 8, 2015 in the Milwaukee Journal Sentinel.", "A national  \"dark money\" group ran a pro-Paul Ryan ad in the Milwaukee Journal Sentinel that credits conservatives for slashing the federal deficit.", "Conservatives? A Democrat has been in the White House since 2009 and Democrats have controlled the U.S. Senate for most of the time since then. Of course, House Republicans such as Ryan have played a key role in the federal budget.", "So let’s see what the American Action Network is talking about.", "The network’s ad", "The Washington, D.C.-based group, founded in 2010 by former Republican U.S. Sen. Norm Coleman of Minnesota, says it promotes \"center-right solutions to our nation’s challenges.\"", "It is a so-called dark-money nonprofit in that it is not required to disclose the names of its donors. The group ran ads against Democrat Russ Feingold in 2010, who lost his U.S. Senate seat later that year to Republican Ron Johnson.", "The group’ half-page ad ran in the Journal Sentinel on Dec. 7 and 8, 2015 and is said to be part of a $3 million national campaign. The attention-getting photo at the top of the ad shows 26 older white people and carried this headline: \"What’s the top priority of the new leadership in Congress? Fighting for the conservative principles that keep America strong.\"", "The ad also featured a picture of Ryan and urged readers to thank the newly installed speaker of the House for \"making America stronger.\" It said the Janesville Republican is working with conservatives in Congress to \"rein in runaway spending,\" then made this claim:", "\"Under conservative leadership, Congress has reduced the federal deficit by 60 percent – nearly $800 billion.\"", "Network’s evidence", "As a reminder, the federal deficit is the difference in a given year between the government’s receipts and its expenditures. That’s different from the debt, an accumulation of deficits that is approaching $19 trillion.", "To back its claim, the American Action Network compared the deficit in 2010 to 2015, citing figures from a gold-standard source, the nonpartisan Congressional Budget Office.", "We’ll note that the federal fiscal year starts Oct. 1 and ends Sept. 30. For example, fiscal 2015 started Oct. 1, 2014 and ended Sept. 30, 2015.", "Here are the annual deficits during that period.", "Fiscal year", "Federal budget deficit", "2010", "$1.29 trillion", "2011", "$1.3 trillion", "2012", "$1.09 trillion", "2013", "$680 billion", "2014", "$483 billion", "2015", "$439 billion", "American Action Network told us it picked 2010 as the starting point because at that time, Democrats controlled the Senate and the House (as well as the White House), before Republicans took control of the House in 2011.", "Spokeswoman Emily Davis told us: \"Given Democrats' record and budget plans, does anyone honestly believe that the deficit would be the same today or better without Republicans leading the House?\"", "OK. But Democrats dominated the federal government during the period the group cites:", "Year", "Party in the White House", "Party in control of U.S. Senate", "Party in control of U.S. House", "2010", "Democratic", "Democratic", "Democratic", "2011", "Democratic", "Democratic", "Republican", "2012", "Democratic", "Democratic", "Republican", "2013", "Democratic", "Democratic", "Republican", "2014", "Democratic", "Democratic", "Republican", "2015", "Democratic", "Republican", "Republican", "So, it would be difficult to give total credit to the minority party for deficit reductions, which is what American Action Network does.", "Other factors more important", "When Obama said in his State of the Union address in January 2015 that the country has seen \"our deficits cut by two-thirds,\" PolitiFact National’s rating was Mostly True.", "Like American Action Network, Obama was correct with his figures. But his claim was more general, whereas the network specifically credited conservatives for deficit reduction.", "That not only is problematic in that Republicans had relatively little power compared to Democrats, but because the overall economy has a much bigger impact on deficits than governmental actions such as spending cuts do.", "Steve Ellis, vice president of the nonpartisan Taxpayers for Common Sense, told us Republicans deserve credit for trimming increases in spending that would have been in place had Democrats maintained control of the House. At the same time, the Budget Control Act of 2011 was also approved by the Democratic-controlled Senate and by Obama.", "Experts also say the deficit has come down in recent years at least as much because of the improving economy, which drives tax revenues up and lessens spending on programs such as food stamps and Medicaid.", "Economist Alan Auerbach, director of a tax policy and public finance center at the University of California, Berkeley, told us the higher revenues -- especially from individual and corporate income taxes -- had a much bigger impact on deficits than any changes made by the Congress or the president.", "Obama, of course, and perhaps to a lesser extent GOP leaders in Congress, could claim some, but not all, of the credit for the improved economy.", "Our rating", "American Action Network said: \"Under conservative leadership, Congress has reduced the federal deficit by 60 percent – nearly $800 billion.\"", "The deficit reduction is actually somewhat larger for the period cited by the network, 2010 to 2015.", "But for most of that period, Republicans controlled only the House. Meanwhile, Democrats controlled the Senate for nearly the entire period, with fellow Democrat Obama in the White House. And the recovering economy, boosting tax revenues, has played a greater role as politicians in bringing deficits down.", "The statement contains an element of truth but ignores critical facts that would give a different impression -- our definition of Mostly False.", "American Action Network, Milwaukee Journal Sentinel ad, Dec. 7 and 8, 2015", "Email exchange, American Action Network communications director Emily Davis, Dec. 8, 2015", "PolitiFact National, \"Barack Obama claims deficit has decreased by two-thirds since taking office (Mostly True),\" Jan. 20, 2015", "PolitiFact National, \"Barack Obama says deficit fell from 10 percent of GDP to 3 percent on his watch (Half True),\" Oct. 6, 2014", "PolitiFact Wisconsin, \"In Wisconsin visit, Barack Obama brags that he reduced federal deficit by two-thirds (Mostly True),\" July 8, 2015", "PunditFact, \"Liberal group blames Bush for raising deficits, Obama for lowering them (Half True),\" Aug. 27, 2015", "Interview, University of California, Berkeley, professor of economics and law Alan Auerbach, Dec. 9, 2015", "Congressional Budget Office, \"Monthly budget review,\" Nov. 6, 2015", "U.S. House of Representatives, \"Party divisions of the House of Representatives, 1789-Present,\" accessed Dec. 9, 2015", "U.S. Senate, \"Party division in the Senate, 1789-Present,\" accessed Dec. 9, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]