["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Editor’s note: We first fact-checked this statement on July 25, 2012, and rated it Mostly True. After the shooting in Newtown, Conn., on Dec. 14, 2012, other people repeated this statistic, and new criticism of the 40 percent figure emerged. At the request of readers, we looked at the statement again, did additional reporting, and changed our rating to Half True on Jan. 30, 2013. The original item is archived here; the fact-check below reflects our additional reporting and new rating.\n\nAs the nation absorbed the news about the shooting deaths in a Colorado movie theater, New York Mayor Michael Bloomberg was scathing in his criticism of the National Rifle Association. On CBS’ Face the Nation in July 2012, Bloomberg accused the NRA of being \"adamant about no controls on weapons.\"\n   \nHe said the pro-gun group leans on Congress and the White House and blocks funding for officials to enforce laws to keep guns out of the hands of criminals and the mentally unstable.\n   \n\"We don't need more laws. We need a couple of fixes,\" Bloomberg said. \"There's a loophole where you can sell guns without a background check at a gun show, 40 percent of guns are sold that way, same thing on the Internet. … The NRA has opposed anything.\"\n\nHere, we will check Bloomberg’s statement that \"you can sell guns without a background check at a gun show, forty percent of guns are sold that way, same thing on the Internet.\" His phrasing is a little awkward, but his staff told us he meant that 40 percent of guns are sold without a background check, either at gun shows or on the Internet.\n   \nCurrent law\n   \nBuying a gun has required a background check since the Brady Act took effect in 1994. (James Brady was badly wounded during the 1981 assassination attempt on President Ronald Reagan; he was Reagan’s press secretary.) Under the law, federally licensed dealers must verify that a buyer has not been convicted of a serious crime or declared mentally incompetent or is blocked for any of about 10 reasons. Typically this is done online and takes less than a day.\n   \nBut only licensed dealers must do this. The law doesn’t apply to private sellers at gun shows, flea markets, or people who post firearms for sale on the Internet. If a private seller suspects that a buyer would be disqualified under federal rules, then they can’t go through with the sale. But there is no background check, and no one needs to file any paperwork.\n   \nBloomberg’s office pointed us to a 1997 study by the National Institute of Justice on who owns guns and how they use them.The researchers estimated that about 40 percent of all firearm sales took place through people other than licensed dealers. They based their conclusion on data from a 1994 survey of more than 2,500 households. But it’s important to note that of the 2,568 households surveyed, only 251 people answered the question about the origin of their gun.\n\nWe asked Philip Cook, a Duke University professor who co-authored the study, if he thinks that 40 percent estimate -- which is now more than 15 years old -- is still a current, reliable estimate of secondary market gun sales.\n   \n\"The answer is I have no idea,\" Cook said. \"This survey was done almost 20 years ago. … It’s clear there are a lot of transactions that are not through dealers. How many, we’re not really clear on it. … We would say it’s a very old number.\"\n\nOther scholars had similar views. Paul Blackman is a retired criminologist and former research coordinator for the NRA Institute for Legislative Action. \"Personally, I think your safest bet is to say that no one knows, but that the vast majority of crime guns come from some other source than gun shows,\" he told us.\n\nOn the other hand, not much has changed in the gun market in the past two decades.\n\n\"It’s a fairly stable market. That is to say, gun stores have had their part, police supply stores have had their part, and then there are the gun shows and private dealings about which we know very little,\" said Robert McCrie, of the John Jay College of Criminal Justice. \"There’s the knowledge that the market has been more vigorous and probably that higher vigor has been reflected in gun shows and private sales in tandem.\"\n   \nMcCrie said, \"The 40 percent seems about right.\"\n   \nGary Kleck, whose research has provided the foundation for less restrictive concealed carry laws, told PolitiFact the 40 percent estimate is \"probably still reasonably valid today.\"\n\nLittle other evidence\n   \nIn 1999, the Bureau of Alcohol, Tobacco, Firearms and Explosives released a report on gun shows. Investigators found that a quarter of the vendors were private sellers, not licensed dealers, and reported that \"felons and other prohibited persons who want to avoid Brady Act checks and records of their purchase buy firearms at these shows.\" They said guns from such shows had been used in drug crimes.\n   \nWe called the ATF and asked if there was anything more recent. They had nothing new to add. We called the National Rifle Association and the National Shooting Sports Foundation, groups that oppose new efforts to track gun transactions. Neither organization responded.\n   \nThe City of New York commissioned an investigation of Internet gun sales in 2011. The report said on 10 websites, it found over 25,000 weapons for sale.The report said that over 60 percent of sellers allowed a purchase to move forward even when the alleged buyer said he didn’t believe he would pass a background check.\n\nOur ruling\n   \nBloomberg said 40 percent of gun sales take place through gun shows or the Internet, without a background check.\n   \nThe best information on the informal gun market is based on a survey and is about 15 years old (the data used in the survey is almost 20 years old). There’s no question that many guns are bought with no background check, but there’s not sufficient current evidence to say that the proportion is 40 percent of all sales.\n   \nBloomberg’s statement is partially accurate but leaves out that important detail: Half True.", "New York Mayor Michael Bloomberg, CBS News, Face the Nation, July 22, 2012\n   \nPolitiFact, Frank Lautenberg say loophole allows individuals convicted of domestic violence to purchase guns, May 3, 2012\n   \nPolitiFact, Sen. Janet Howell says it’s easier to buy guns in Virginia than vote, February 27, 2012\n   \nAssociated Press, James Holmes, Aurora Shooting Suspect, Used Internet for Arsenal, July 23, 2012\n   \nKMTV, James Holmes Passed All Background Checks, July 21, 2012\n   \nSeattle Times, Suspected shooter bought guns legally, July 20, 2012\n   \nU.S. Department of Justice, Guns in America: National Survey on Private Ownership and Use of Firearms, May, 1997\n   \nBureau of Alcohol, Tobacco, Firearms and Explosives, Gun shows: Brady checks and crime gun traces, January 1999\n   \nEmail interview, Josh Horwitz, Coalition to Stop Gun Violence\n   \nBureau of Alcohol, Tobacco, Firearms and Explosives,Federal Firearms Regulations Reference Guide, 2005\n   \nBureau of Alcohol, Tobacco, Firearms and Explosives,Firearms FAQ,\n   \nFederal Bureau of Investigation, General Information Fact Sheet,\n   \nCity of New York, Point, Click, Fire: An Investigation of Online Gun Sales, December, 2011\n   \nHuffington Post, The truth about gun sales, January 9, 2012\n   \nCoalition to Stop Gun Violence, Gun show loophole,\n   \nNational Review, The Media Botches Aurora, July 23, 2012\n   \nGovtrack.us, Full text S. 436, 2011\n   \nNational Rifle Association, Bad Barrett - F rated,\n   \nNRA-ILA, NRA criticizes Delaware private sale legislation, June 2, 2011\n   \nNRA, Ever wonder what a loophole looks like?,\n   \nNR-ILA, Wisconsin: GOP leader blasts proposal to bar private sales, July 14, 2011\n\nMSNBC transcript, Jan. 24, 2013, via Nexis\n   \nWhite House website, Remarks by the President and the Vice President on Gun Violence, Jan. 16, 2013\n   \nJohns Hopkins Center for Gun Policy and Research, \"The Case for Gun Policy Reforms in America,\" October 2012\n   \nGallup Politics, \"Americans Back Obama's Proposals to Address Gun Violence,\" Jan. 23, 2013\n   \nPolitiFact, \"Mayor Michael Bloomberg says 40 percent of guns are sold without a background check,\" July 25, 2012\n   \nNational Institute of Justice, \"Guns in America: National Survey on Private Ownership and Use of Firearms,\" May 1997\n   \nNational Review, \"Gun Sales and Background Checks: Obama’s Bogus 40 Percent Stat,\" Jan. 17, 2013\n   \nFBI website, National Instant Criminal Background Check System fact sheet, accessed Jan. 18, 2013\n   \nEmail interview with James Jacobs, director of the Center for Research in Crime and Justice at New York University School of Law, Jan. 18, 2013\n   \nInterview with Philip Cook, Duke University, Jan. 22, 2013\n   \nInterview with David Kopel, University of Denver, Jan. 23, 2013\n   \nEmail interview with Gary Kleck, Florida State University, Jan. 22, 2013\n   \nInterview with Robert McCrie, John Jay College of Criminal Justice, Jan. 22, 2013\n   \nEmail interview with Paul Blackman, retired criminologist and NRA researcher, Jan. 22, 2013\n   \nInterview with Jay Corzine, University of Central Florida, Jan. 23, 2013\n\nEmail interview with Jaclyn Schildkraut, School of Criminal Justice at Texas State University (San Marcos), Jan. 22, 2013\n   \nEmail interview with Kimberly A. Vogt, sociologist at the University of Wisconsin-La Crosse, Jan. 22, 2013\n   \nNRA website, \"Private Sales Restrictions and Gun Registration,\" Jan. 17, 2013\n   \nWashington Post, \"The stale claim that 40 percent of gun sales lack background checks,\" Jan. 21, 2013\n   \nWashington Post, \"Update: Obama claim on background checks moved from ‘verdict pending' to 2 Pinocchios,\" Jan. 25, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]