["“Effective March 1, 2021, the Covid lockdown in Canada is over,” reads a document accompanying a February 20, 2021 Facebook post, which is no longer available. “We the citizens of Canada are now back in charge of our lives”.", "More versions of the claim have been shared hundreds of times on Facebook in English and French and on Instagram.", "But the claim is false.", "Each Canadian province has a different approach when it comes to Covid-19 health restrictions, a spokesman for Health Canada told AFP in an email, adding that the document included in the posts is not official.", "Since the beginning of the pandemic, Covid-19 has infected more than 858,000 people and killed more than 21,800 in Canada, according to the federal government.", "AFP Fact Check takes a look at the state of Covid-19 public health measures in each province.", "As of February 26, 2021 Alberta is in what it calls “Step 1,” which prohibits all indoor social gatherings and restricts outdoor social groups to 10 people.", "Steve Buick, spokesman for Alberta’s Health Ministry, told AFP in an email on February 25 that “we may announce Step 2 by or on March 1, to be effective on that day or later.”", "Step 2 allows for a “potential easing” in some areas, including retail, hotels, indoor fitness and children's sport and performance. It does not mean a complete lifting of all public health measures.", "Buick said: “We may go ahead as per that description or change the details,” and he noted “even if we go ahead, it’s subject to reversal if warranted by the trend in cases.”", "British Columbia has “province-wide restrictions” including a ban on social gatherings and mandatory mask-wearing in many public indoor spaces.", "Stephen May, a spokesperson for BC Ministry of Health, said in a February 25 email that ”British Columbia has not announced any changes to our current public health order.”", "Manitoba’s most current public health order was announced on February 9, 2021 and went into effect on February 12. It included the easing of certain restrictions, including the partial re-opening of restaurants and of select sports facilities.", "“Our current public health order states that it is in effect until 12:01 am on March 5, 2021,” Kailey McCaffrey, a spokeswoman for the government of Manitoba, said in a February 25 email.", "All parts of New Brunswick are in phase “Orange,” according to the government website. This means the province considers there to be a “significant risk that Covid-19 is no longer under control.” Mandatory mask-wearing and other restrictions are in effect.", "“Until there is a vaccine, community public health measures should be followed to help stop the spread of Covid-19,” the website says.", "New Brunswick’s premier expects to see vaccine supply ramp up in the coming weeks, according to the Canadian Broadcasting Corporation.", "The province says that the Covid-19 vaccine will be \"more widely available\" starting in July and it expects to reach 75 percent of the population vaccinated between July and September.", "There is no indication that public health measures will be lifted in Newfoundland and Labrador on March 1, 2021.", "For most of February, the province had been at Alert Level 5, according to the government’s website, which meant that social gatherings were limited and some sports and other facilities were closed.", "That remains the case, but on February 26, 2021 the government announced that most regions of the province will go to Alert Level 4, meaning some businesses will be able to reopen.", "Nova Scotia’s directives include social distancing and a limit on gatherings, according to the government’s website.", "There is no indication that such measures will be lifted on March 1, and on February 25 the provincial government expressed concerns that cases could rise in the coming days.", "Different regions in Ontario have varying public health practices in place depending on the state of the pandemic, according to the government website. For example, Toronto has a “stay-at-home” order, the strictest measure which means that people “should only go out for necessities” such as work, school, or groceries.", "The provincial government expects to make a decision about any changes for Toronto “depending on the trends in public health indicators closer to March 8,” according to the government website.", "Prince Edward Island is at the “Caution” level, according to the government website as of February 26, 2021, with measures including limits on social gatherings.", "These restrictions were last updated on February 16 and remain in effect “until further notice,” according to the website.", "Marie-Louise Harvey, a spokeswoman for Quebec’s Health Ministry, said in a February 25 email that “the public health measures will not be lifted on March 1st.”", "Quebec, which evaluates the risk level region by region, has strict Covid-19 controls in force, including a curfew and a ban on social gatherings.", "“There has been some slight easing in the last few days, but the situation is still fragile and it is still important to respect the public health measures,” she added.", "Doug Dahl, a spokesman for Saskatchewan Health Authority, said in a February 25 email that “the current public health orders in Saskatchewan were extended to March 19,” as previously announced.", "These directives include mandatory mask wearing and limits on social gatherings.", "AFP Fact Check has debunked hundreds of false and misleading claims about the coronavirus pandemic, available here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]