["About this rating", "Around 5 p.m. EDT on March 16, 2021, a 21-year-old white man allegedly shot and killed eight people -- six of whom were Asian women -- at three Atlanta-area spas. The investigation into the mass shooting remained ongoing, as of this report.", "As word of the tragedy spread online, however, people flooded social media with messages of sympathy for the deceased. Many posts classified them as unknowing victims of the country's increasing xenophobia, given a surge of attacks against Asian Americans that coincided with the COVID-19 outbreak in the U.S, or pervasive violence against women.", "Among such posters was Aaron Rupar, a journalist at Vox. A couple of hours after the incident, for instance, he blamed former U.S. President Donald Trump's characterization of the coronavirus as a reason for growing hate crimes against Asian Americans, and tweeted:", "\"[I] don't think it's a coincidence that Trump spent the better part of a year using a virus as a slur against Chinese people while hate crimes against Asian Americans spiked by 150 percent.\"", "Rupar was referring to Trump's repeated insistence on calling the coronavirus the \"Chinese virus\" -- going against widely accepted public health guidelines that warn against titling disease outbreaks after nations or regions of the world to eliminate stigmatization -- and 2020 hate crime statistics in 16 U.S. cities compiled by the Center for the Study of Hate and Extremism at California State University.", "About 20 minutes later, Rupar added:", "The underlying claim was true — as authorities in the Atlanta area embarked on a manhunt to catch the suspect on the evening of March 16, Trump referred to the coronavirus as the \"China virus\" on Fox News.", "But let this be clear: No evidence explicitly connected the former president's use of the term on national television with the tragedy unfolding simultaneously in Georgia. Furthermore, it was unclear whether he was even aware of the mass shooting when he said \"China virus\" while talking about unrelated matters -- specifically, his presidential administration's approach to the American economy. The interviewer did not ask him about the Atlanta-are shooting.", "Here's what happened:", "Between roughly 6 p.m. and 8:30 p.m. EDT, according to The Associated Press, the victims' bodies were reported inside massage parlors, and authorities arrested the suspected gunman -- Robert Aaron Long, of Woodstock, Georgia -- as he was driving on the interstate.", "Meanwhile, at 7 p.m. EDT, Trump called in for a phone interview with Fox News' Maria Bartiromo, a recording of which Snopes obtained via the media outlet's website and is displayed below.", "Throughout much of the interview, the former president lambasted his successor's approach to immigration, criticized election security, and took credit for the ongoing efforts to provide COVID-19 vaccinations to every American willing to get one. Then, at approximately the 5-minute mark, he said:", "[The economy] was recovering under my administration -- twice. We got it to a level that the world has never seen before. We were the envy of the world and then when we got hit by the, as I call it, 'the China virus' -- COVID -- it obviously went down along with every other economy. And then we were the first to get it back up.", "You can watch the segment here:", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]