["A video of a crowd attacking a man adorning a scarf of the Bharatiya Janata Party (BJP) and another video of men dressed in white heckled by an unruly mob was shared by Facebook page ‘Godi Media’ on July 18 with the claim that a BJP leader was thrashed in Bihar during campaigning for the upcoming elections. The videos drew over a million views and close to 30,000 shares as of this writing. The second video starts after 11 seconds in the post.", "Bjp mla", "ब्रेकिंग न्यूज़ बिहार बिहार के स्मार्टसिटी पटना में भाजपा बिधायक के लात जुटा के मसीन में जम कर हुई जनता के द्वारा कुटाई रोड नही तो वोट नही को लेकर हुआ था विवाद नेता जी केद्वारा गलत सब्दो के कारण हो गई कुटाई", "Posted by गोदी मीडिया on Saturday, 18 July 2020", "A Facebook page ‘RC Kar’ also shared the videos garnering close to 4 lakh views.", "#BJP MLA kutai", "ब्रेकिंग न्यूज़ बिहार बिहार के स्मार्टसिटी पटना में भाजपा बिधायक के लात जुटा के मसीन में जम कर हुई जनता के द्वारा कुटाई रोड नही तो वोट नही को लेकर हुआ था विवाद नेता जी केद्वारा गलत सब्दो के कारण हो गई कुटाई", "Posted by RC Kar on Saturday, 18 July 2020", "The same has also been shared on Twitter.", "ब्रेकिंग न्यूज़ बिहार बिहार के स्मार्टसिटी पटना में भाजपा बिधायक के लात जुटा के मसीन में जम कर हुई जनता के द्वारा कुटाई रोड नही तो वोट नही को लेकर हुआ था विवाद नेता जी केद्वारा गलत सब्दो के कारण हो गई कुटाई pic.twitter.com/t39OlPqvys", "— Ajruddin Siddique (@AjruddinSidique) July 18, 2020", "This video dates back to 2017 when BJP West Bengal President Dilip Ghosh was chased and heckled in Darjeeling. The incident was reported across media platforms, including ABP News that ran the same clip which is currently viral.", "A BJP delegation led by the party President was visiting the city after a 104-day strike for a separate Gorkhaland state was withdrawn by GJM. Ghosh was in Darjeeling on October 5, 2017, when he was allegedly thrashed by supporters of GTA chairman Binay Tamang.", "Alt News had fact-checked this video when it was viral ahead of the 2019 Lok Sabha elections.", "A YouTube search led us to the second video. According to ABP News, BJP leader Babul Supriyo was with his supporters in West Bengal’s Asansol in October 2016 when they spotted a few men with cows. Supriyo’s clique presumed that they were cow smugglers and misbehaved with the men. Angered locals attacked Supriyo’s supporters. The channel stated that Supriyo was also hurt in the attack.", "According to Livemint, “The unrest on Wednesday [October 19, 2016] started after a BJP worker was assaulted by TMC supporters. Supriyo said cattle traders were illegally dealing in livestock with the support of a local TMC leader. Things came to a head when Supriyo became the target of stone-pelting. He was rescued by the police.”", "Old videos of BJP leaders Dilip Ghosh and Babul Supriyo attacked in West Bengal was shared with the false claim that BJP leaders were attacked in Bihar ahead of the upcoming elections.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]