["Republican Sen. Lindsey Graham, a prominent ally of President Donald Trump, made headlines this week after a series of phone calls to elections officials in three pivotal states: Georgia, Nevada and Arizona.", "His actions prompted indignant posts on Facebook from the left-leaning page Occupy Democrats.", "\"In addition to Georgia, Lindsey Graham admits he also tried to manipulate vote counts in Nevada and Arizona to help Trump,\" its post reads. \"Just another member of the self-proclaimed Party of Law and Order proving he really has no respect for Law and Order.\"", "Occupy Democrats has not responded to a request from USA TODAY for comment.", "On Monday, Georgia Secretary of State Brad Raffensperger told the Washington Post that he spoke with Graham onNov. 13 about the state's signature-matching laws.", "Raffensperger said Graham asked him if political bias might have influenced poll workers to accept ballots with nonmatching signatures. Graham also inquired as to whether Raffensperger had the power to toss mail-in ballots in counties with high rates of nonmatching signatures.", "To Raffensperger, it appeared that Graham was suggesting he find a method to throw out ballots that had been lawfully cast.", "“It sure looked like he was wanting to go down that road,” Raffensperger told the Post.", "That night on CNN Politics, Raffensperger provided more details about the call.", "\"He asked if the ballots could be matched back to the voters,\" he said. \"I got the sense it implied that then you could throw those out for any, if you look at the counties with the highest frequent error of signatures. So that's the impression that I got.", "\"It was just an implication of, 'Look hard and see how many ballots you could throw out,'\" Raffensperger added.", "Graham said it was \"ridiculous\" to claim that he suggested Raffensperger should toss legal ballots. He said he simply wanted to understand the state’s signature-matching requirements, per the Washington Post.", "“The main issue for me is: How do you protect the integrity of mail-in voting, and how does signature verification work?” Graham said. “If he feels threatened by that conversation, he’s got a problem. I actually thought it was a good conversation.”", "He also said on CNN Politics that he was \"surprised\" to hear how Raffensperger interpreted their conversation.", "\"What I'm trying to find out was how do you verify signatures on mail-in ballots in these states that are the center of attention?\" Graham said. \"So like when you mail in a ballot, you got to have some way to verify that the signature on the envelope actually matches the person who requested the ballot.\"", "\"It seems to me that Georgia has some protections that maybe other states don't have, where you go into the portal to get your ballot,\" he added.", "More:Fact check: Claim that voting noncitizens affected 2020 election outcome is unverified", "On Tuesday, Gabriel Sterling — the election implementation manager in Georgia, who works under Raffensperger and participated in the call — told CNN Politics that he heard Graham ask about the possibility of tossing ballots, too.", "\"What I heard was basically discussions about absentee ballots and if a potentially ... if there was a percentage of signatures that weren’t really, truly matching, is there some point we could get to, we could say somebody went to a courtroom could say well, let’s throw (out) all these ballots because we have no way of knowing because the ballots are separated,\" Sterling said.", "Sterling said the comments \"might have gone a little to the edge of\" what others deem acceptable, but said he understood why Raffensperger and Graham had different interpretations of their conversation.", "Legal experts told The New York Times that it was doubtful that Graham’s actions could lead to criminal charges or represented a violation of the ethics rules that govern the Senate.", "Still, three attorneys filed a complaint about the matter to the Senate Select Committee on Ethics on Wednesday, according to the Associated Press.", "The complaint was filed by Walter Shaub, a former top ethics watchdog for the federal government under President Barack Obama; Richard Painter, the top ethics lawyer under President George W. Bush; and Claire Finkelstein, who heads the University of Pennsylvania's Center for Ethics and the Rule of Law.", "On Tuesday, while speaking with reporters in the U.S. Capitol, Graham said he had also spoken with officials from Nevada and Arizona.", "“Yeah, I talked to Arizona, I talked to Nevada,” he said, per Politico.", "Graham said he was speaking with the officials in his capacity “as a United States senator who is worried about the integrity of the election process nationally, when it comes to vote by mail.”", "\"If we're going to expand voting by mail, which we probably will, I want to make sure that we're taking the precautions necessary to validate signatures like we do if you show up on Election Day,\" he said.", "Graham said his central question was who verifies the signatures, per USA TODAY.", "He also defended his right to ask for more information on state laws, per CNN Politics.", "\"What I'm very concerned about is that if you're going to continue to vote by mail that we need to know what systems work and what don't,\" Graham said. \"It's up to the people of Georgia. I think I have every right in the world to reach out and say how does it work? And that's what I did.\"", "Unlike Georgia, it was not immediately clear to whom Graham had spoken in Arizona and Nevada.", "Arizona Secretary of State Katie Hobbs tweeted that she had not spoken with him, and Nevada Secretary of State Barbara Cegavske released a similar statement.", "Graham later clarified that he spoke with Arizona’s Republican Gov. Doug Ducey, not Hobbs. As for Nevada, he said he had been and had been \"briefed about what they do in Nevada\" but could not \"remember by who.\"", "Patrick Ptak, a spokesman for Ducey, told the Arizona Republic that the call with Graham was simply to learn more about the state's process.", "“He was calling about the certification process for ballots and Arizona’s system. Senator Graham has been praiseworthy of Arizona and our process,\" Ptak said in a phone interview. \"He did not ask for anything, to my knowledge. It was a call about how Arizona does things.\"", "Based on our research, the claim that Sen. Lindsey Graham \"tried to manipulate vote counts\" in Georgia, Arizona and Nevada is PARTLY FALSE. It's true that Georgia Secretary of State Brad Raffensperger said Graham appeared to suggest he find a method to throw out ballots that had been lawfully cast, though Graham disputes that characterization. It's also true Graham also made calls to officials in Arizona and Nevada, but no one — including one of the officials he spoke with — suggested that he \"tried to manipulate vote counts\" in either state.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]