["The image of the purported text message was published on Facebook here on April 27. It has been shared more than 350 times.", "The message reads: \"The COVIDsafe App has detected you are now +20km from your nominated home address. Please register your reason for travel by calling 1300 1MY GOV (+61 1300 169 468) within 15 minutes of receiving this SMS (10:12am AEST Monday 27 April 2020). Thank you.”", "COVIDSafe was designed to facilitate COVID-19 contact-tracing in Australia. It was launched on April 26 as part of the government’s plan to ease social distancing restrictions. More than two million Australians downloaded and registered for the app within 24 hours of its release, Health Minister Greg Hunt said in this press release on April 28.", "Below is a screenshot of the misleading post:", "Images of the purported text message were also shared hundreds of times on Facebook here, here, here and here alongside a similar claim.", "The claim is false.", "“This is a hoax message,\" a spokesperson for the Department of Health told AFP in an email on April 28. \"It is abhorrent that scammers would attempt to use the COVIDSafe app, a public health tool, to try and catch out Australians.", "“The COVIDSafe App does not have any geolocation capability, it does not track your location, only the proximity of your phone to other people’s phones that have downloaded the app and cannot monitor a person’s location at any time.”", "The app, as AFP reported, instead uses smartphones’ Bluetooth function to detect other users nearby and can alert users if they were in close proximity to someone who tested positive for COVID-19.", "The spokesperson added that the app “does not register a person’s home address” and that personal information is only released to relevant health officials with users’ authorisation.", "Scamwatch, a website run by the Australian Competition and Consumer Commision, also told AFP in an email on April 28 that the “text message is a hoax.” The consumer watchdog has published several other instances of scam text messages related to COVID-19 on its website here.", "A spokesperson for the Australian Federal Police told AFP in an email on April 28 that police were “aware of an alleged hoax involving the COVIDSafe App\" and were \"currently investigating the matter.\"", "The hoax circulated as the government continued its efforts to alleviate privacy concerns related to COVIDSafe.", "Health Minister Hunt stressed in his April 28 statement that “no one, not ever the user”, can access the app’s encrypted Bluetooth interaction records.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]