["About this rating", "A Facebook post claiming that it was legal for people in Texas to use deadly force to protect Confederate statues from being vandalized was widely shared on social media in August 2017:", "The Facebook post, which has since been deleted, was featured in several articles that made false (and potentially dangerous) claims. The web sites I Am A Texan and Liberty Park Press, for instance, both shared this message as if it was an official warning from a Texas police department. But that is not the case. In fact, the Tioga Police Department, where Ryan worked as an \"unpaid reserve officer,\" dismissed Ryan shortly after this post went viral.", "The web site Political Mayhem took the claim even further, sharing it in an irresponsible, inflammatory piece titled \"HELL YEAH! This State Just Gave Citizens Authority To SHOOT Protesters ON SIGHT Who Destroy Monuments.\"", "First of all, the laws Ryan cited are not new. Second, they do not actually give people in Texas the right to use deadly force to protect statues from vandalism.", "Legal analyst Gerald Treece told Houston TV station KHOU that although the legal codes Ryan cited are real (you can read them in full here and here), they do not give people the rights that Ryan claimed. For instance, Chapter 9.41 explicitly deals with \"one's own property.\" Statues in public parks would not fall into this category. Treece also said that it was unlikely for Confederate statues to be considered \"tangible, movable property\":", "\"That's just not the law,\" said Treece. The Texas Penal Code allows for the use of deadly force when protecting people's private property.", "\"I can used deadly force against you if you're using deadly force or if there's a fear of deadly force against me,\" said Treece. But statues in public parks aren't private property.", "\"If the question in a classroom came up, 'Professor, can I shoot someone at night putting magic marker on a statue?', I would say no, a thousand times no,\" said Treece.", "Texas Penal Code 9.43 clearly states the private property being protected with deadly force needs to be \"tangible and moveable.\" A statue doesn't meet that qualification either.", "\"It's not tangible, moveable property, owned by anybody, but the government,\" said Treece.", "The Granbury Police Department also weighed in, saying that the claim that you can use deadly force to stop someone from vandalizing a statue was \"absolutely not true,\" and adding that using deadly force to protect property (your own or others' is only legal under certain conditions):", "With all of the current talk and controversy involving the statue of General Granbury, there has been a significant escalation in talk that we feel we must address. There is a person claiming to be a police officer and instructor (unknown if he is or is not) who is posting inaccurate information on social media sites. The posts in question are interpreting chapter 9 of the Texas Penal Code to allow a person to use deadly force against another for simply vandalizing a statue. This is absolutely not true.", "The specific section being argued starts with TX Penal Code Section 9.42, which states a person can use deadly force to stop another person from committing Criminal Mischief at night. That section covers a person protecting their own property and is part of a prerequisite for protecting a third party’s property, which is covered under Section 9.43. Unfortunately, there is a very important part of 9.42 that is being missed. That is a requirement that, in addition to seeing a person commit Criminal Mischief at night, the person using the force must reasonably believe the following:", "(A)The land or property cannot be protected or recovered by any other means, or", "(B) The use of force other than deadly force to protect or recover the land or property would expose the actor or another to a substantial risk of death or serious bodily injury.", "When the entire statute is read, it becomes obvious this issue is not nearly as simple as some would have you believe. It is not legal to shoot someone for simply vandalizing a statue, regardless of what some are claiming. There must be other factors involved to justify deadly force. Additionally, you must ask yourself if it is worth it to take a life over a piece of property which doesn’t even belong to you, even if the action may be legally justified.", "The Granbury Police Department does not recommend confronting anyone under these circumstances. We ask that you call 911 and be the best witness you can be. If you can continue to watch the suspect(s) safely, please do so until officers arrive.", "As with any other issues, please feel free to call the police department with any questions at 817-573-2648.", "Bottom line: It is not legal to use deadly force in Texas to prevent a person from vandalizing a statue.", "De Bruijn, Eline.   \"Mckinney Gun Instructor Loses Volunteer Cop Job After Advocating 'Deadly Force' for Monument Vandals.\"\r\n    Dallas News   22 August 2017.", "Benito, Marcelino.   \"Verify: Can You Shoot Someone to Stop Statue Vandalism?\"\r\n    KHOU-TV   22 August 2017.", "Osborne, Ryan.   \"You Can’t Shoot Confederate Statue Vandals, Granbury Police Warn.\"\r\n    Star-Telegram   22 August 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]