["About this rating", "The photograph is real. The \"OK\" hand gesture has been adopted by some as a symbol for white power — in some cases facetiously — but it can also still signify \"OK.\"", "It's unclear what U.S. Sen. David Perdue's intent was when using this gesture.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In January 2020, as a runoff election in Georgia approached, a photograph that supposedly showed U.S. Sen. David Perdue of Georgia making a white power symbol started recirculating on social media:", "This is a genuine photograph of Perdue and two unidentified volunteers. It is also true that the hand gesture they are making in this picture has been adopted as a symbol of white power. However, as this symbol is a bit ambiguous (it is sometimes flashed facetiously and is also still widely used as an \"OK\" hand gesture), we can't definitively determine Perdue's intent when he made the gesture.", "This photograph was first posted on Facebook by Jasper E. Preston in October 2020, along with a caption claiming that it showed Perdue with two volunteers from the Paulding County Teenage Republicans who were door-to-door canvassing for the campaign. Preston claims that Perdue and these two volunteers were showing the number \"three\" in a way of celebration after each of these volunteers made nearly 3,000 voter contacts.", "Very proud of these kids. They work so hard, and represented the Paulding County Teenage Republicans today at the Team Trump and Perdue, buses tour. Senator Perdue was very proud of these two for each having made nearly 3,000 voter contacts each knocking doors. Then what did they do? Go right back to knocking doors.", "No pomp and circumstance, no boasting, they don't get the front seat, they just work. And it humbles me everyday to have these two as interns with the Trump Victory Campaign.", "While this explanation — that Perdue was making a symbol for the number \"three\" — may indeed be accurate, there's room for skepticism. For one, making 3,000 voter contacts in a day by knocking on doors seems difficult, if not impossible.", "Door-to-door canvassing isn't particularly efficient. If a volunteer knocked on 20 doors an hour (a highly efficient rate of one house every three minutes) it would take them 150 hours (far exceeding the hours in a single day) to knock on 3,000 doors. But it's possible that the above-quoted text meant to say that these volunteers knocked on 3,000 doors over the course of the campaign, or that this feat was accomplished by all of the volunteers. It should also be noted that while the above-displayed hand gesture features three fingers (pinkie, ring, and middle), the more common way to show this number in the United States is with the pointer, middle, and ring fingers.", "While the hand gesture in this photo is supposedly representing the number three, it is frequently associated with two different ideas: \"OK\" and \"White Power.\"", "The \"OK\" hand gesture, formed by pressing the pointer and thumb together in the shape of a circle while raising the other three fingers, has been around for centuries. However, in recent years, this symbol has been adopted by the white power movement.", "The Anti-Defamation League writes that internet trolls started to incorporate the OK symbol as a hate symbol in 2017 as a \"joke,\" but that this hand gesture became an earnest symbol for white power in the following years.", "By 2019, at least some white supremacists seem to have abandoned the ironic or satiric intent behind the original trolling campaign and used the symbol as a sincere expression of white supremacy, such as when Australian white supremacist Brenton Tarrant flashed the symbol during a March 2019 courtroom appearance soon after his arrest for allegedly murdering 50 people in a shooting spree at mosques in Christchurch, New Zealand.", "As this hand gesture has different meanings depending on its use, it can be difficult to determine someone's intent when using the gesture. For purposes of this article, we can say that the above-displayed photograph is real and that the displayed hand gesture has been used as a symbol of white power. However, this hand gesture can also be used to symbolize \"OK.\" Further, this photograph was originally posted with the claim that, in this case, it represented the number three.", "We reached out to Perdue's office for comment and will update this article accordingly.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]