["About this rating", "The Forest Hill High School band did indeed perform a skit in which student performers, wielding toy guns, appeared to hold police officers hostage.", "The performance appears to have depicted police officers being held at gunpoint but not being shot, in keeping with its status as a parody of the 2002 film John Q.", "In October 2018, controversy surrounded a half-time performance by a Jackson, Mississippi, high school band when viral social media posts, as well as local and national news reports, appeared to show students holding toy guns and \"shooting\" other students dressed as police officers.", "Evangelical Christian activist Joshua Feuerstein shared a screen shot from video footage of the performance, writing:", "SHOOTING COPS!!! This is the HALF TIME show performed by Forest Hill High School where young black students SHOOT police officers in a dramatized skit!!!", "ARE YOU KIDDING ME???? This is ACCEPTABLE???\nSHARE THIS until something is done about it!", "In another widely-shared Facebook post, Lisa Grantham pointed out that two police officers had recently been shot dead in Brookhaven, where the football game took place:", "A post on the web site DefenseMaven.io asserted that the performance had depicted the \"execution of SWAT officers.\"", "These posts prompted multiple inquiries from readers about the facts surrounding these images and the performance itself.", "The Forest Hill High School band did indeed perform a show which depicted law enforcement officers being held at gunpoint by other student performers during half-time of the Forest Hill Patriots football game held at Brookhaven High School on 5 October 2018.", "Footage of the performance was streamed live on Facebook by Nick Hodges. The relevant section begins at around the 8:35 mark, and lasts around 35 seconds:", "The fallout from the performance was significant. On 6 October, Jackson Public Schools Superintendent Errick Greene apologized for the half-time show, which he said had been \"based loosely on the movie 'John Q'\" and \"depicted a hostage scene that included toy guns.\"", "Greene said the school district had \"taken some initial actions in response,\" including starting an investigation:", "According to Jackson television station WAPT, the office of Jackson mayor Chokwe Antar Lumumba confirmed that the Forest Hill band's director Demetri Jones had been placed on administrative leave. In response to our request for confirmation of this action, a Jackson Public Schools spokesperson told us \"we do not discuss personnel matters.\"", "In a separate statement, Lumumba expressed his \"sincerest regrets\" to the people of Brookhaven:", "I offer my sincerest regrets to the Brookhaven community for the insensitivity that [was] portrayed during the Friday evening halftime show. There is an active investigation into the circumstances that led to this performance,\" said Mayor Chokwe Lumumba. \"While I do not believe that there was a malice [sic] intent on behalf of the students that participated in this halftime show, I understand that we are ultimately not defined by the things that we set out to do, but rather how we respond to the things that actually do take place. It is the responsibility of adults to offer guidance to youth. Our students should have been instructed that this was neither the time or place for that performance.", "Brookhaven mayor Joe Cox called the half-time show \"a horrific display of disrespect\" and referenced the deaths of Brookhaven police officers Zach Moak and James White, who were killed in a shootout on 29 September:", "In the 2002 thriller movie John Q, Denzel Washington played a desperate father who, with no ability to pay for a heart transplant for his son, took hostages at a hospital at gunpoint, demanding that his son be placed at the top of the organ recipient list.", "It is worth noting that Washington's character did not actually shoot any law enforcement officers in the movie, just as the Forest Hill parody does not appear to have depicted the shooting of any police officers, but rather an armed hostage-taking.", "The image used by Feuerstein and others in their social media posts depicted student performers holding SWAT members at gunpoint as the officers held their hands up -- not \"shooting cops,\" as Feuerstein claimed, or the \"execution of SWAT officers,\" as DefenseMaven.io claimed:", "﻿", "Berg, Christopher.   \"High School Band Depicts Execution of SWAT Officers Week After 2 Officers Killed.\"\r\n    DefenseMaven.io.   6 October 2018.", "Arms, Earl.   \"Forest Hill Band Director on Leave After Controversial Performance.\"\r\n    WAPT.   9 October 2018.", "McCarthy, Waverly and ShaCamree Gowdy.   \"Mayor of Brookhaven, Other Officials React to Forest Hill Band Performance at Brookhaven High School.\"\r\n    WLBT-TV.   5 October 2018.", "Apel, Therese.   \"Brookhaven Cpl. Zach Moak Died Trying to Save Fellow Officer James White.\"\r\n    The [Jackson] Clarion-Ledger.   4 October 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]