["As President Donald Trump is in the final stretch of his bid for reelection, some of his supporters are pointing to accomplishments the president supposedly has achieved since he took office in 2017.", "“President Donald Trump over the last week did the following, but you probably won't hear about it from the News,” the Facebook post reads, accompanied by three muscle-flexing emoji and an American flag emoji.", "The post then lists 10 supposed accomplishments, from making vaccines voluntary to busting global trafficking rings. The original poster did not respond to USA TODAY’s request for comment.", "Here’s a breakdown of each claim.", "Every state in the U.S. requires children to be vaccinated against certain diseases as a condition for attending school. Those laws have been put in place by state governments, not the federal government.", "For example, all states require vaccinations against DTaP, MMR and polio to attend any school, while the HPV, influenza and Hepatitis A and B vaccines are required by some states, but not all.", "All school immunization laws offer exemptions to children for medical reasons, and 45 states plus Washington, D.C., grant exemptions for religious reasons, according to the National Conference of State Legislatures. Just 15 states allow exemptions for philosophical reasons.", "More:Scientists worry FDA could be pressured to approve COVID vaccine before it's fully tested", "It’s possible this claim stemmed from comments the president made at a May 15 press briefing regarding the production of the COVID-19 vaccine.", "“We’re looking for a full vaccine for everyone that wants to get it,” Trump said. “Not everybody is going to want to get it.”", "At that same press conference, Trump indicated the military may be involved in the distribution of the vaccine, asserting that once the vaccine is ready the government will “deploy every plane, truck and soldier required to help distribute it to the American people as quickly as possible.”", "Trump’s claim about military distribution was later refuted by White House and Defense Department officials, according to McClatchy DC. USA TODAY found no evidence indicating the military will check the purity of the vaccine.", "Our rating: False", "Trump announced in April that he planned to stop funding the World Health Organization.", "“Today I’m instructing my administration to halt funding of the World Health Organization while a review is conducted to assess the World Health Organization’s role in severely mismanaging and covering up the spread of the coronavirus,” Trump told reporters April 14. “…As the organization’s leading sponsor, the United States has a duty to insist on full accountability.”", "Whether the president can actually stop funding WHO is another question. Congress holds the country’s spending power, so if Congress mandates aid to WHO by statute, Trump has no constitutional authority to deny it, according to an \"Expert Forum\" analysis published by the American Constitution Society, a left-leaning organization. However, current appropriations laws give the administration some flexibility over WHO funding, so the administration may have the authority to withhold funding until Congress eliminates that flexibility, the analysis explains.", "The U.S. still owes WHO money, too.", "AFP reported that as of May 31, the U.S. owed WHO $203 million in outstanding assessed contribution fees, according to a WHO status report. As of Aug. 31, the U.S. owes WHO about $99 million, that report states, indicating the U.S. has paid WHO since Trump’s claims were made.", "Our rating: Missing context", "The TRACE Act, introduced by Rep. Bobby Rush, D-Ill., in May, is still active.", "The bill would provide $100 billion in grants to organizations that perform COVID-19 testing, tracing and at-home services. Eligible entities include some health centers, nonprofit organizations and some hospitals and schools, according to Congress’ summary of the bill. It also could be used to pay staff or purchase personal protective equipment.", "Fact check:'Plandemic' sequel makes false claims about Bill Gates", "It was referred to the House Committee on Energy and Commerce on May 1. To become law, next, the bill will need to pass out of the committee and pass in the House and Senate. Then, it will need to be signed by the president.", "USA TODAY has previously reported that Bill Gates was not involved in crafting the bill.", "\"In our home state of Washington, our staff have provided advisory support to public health officials on their COVID-19 response efforts,” the Gates Foundation told USA TODAY in a statement. “This has included participating in discussions about epidemiological approaches, such as testing, isolation, contact tracing and quarantine. The Gates Foundation has not provided grant funding to expand contact tracing in the U.S.”", "Our rating: False", "ID2020 is not Bill Gates’ project, and Trump hasn’t canceled it.", "Dakota Gruener is ID2020’s executive director. She launched the ID2020 Alliance program after working at Gavi, the Vaccine Alliance, where she worked as the right hand woman to the CEO, according to her staff bio.", "More:'It helps the world': Bill Gates pushing to get US back to fighting coronavirus globally", "Founding partners of the program include Microsoft and Gavi, which is where the Gates connection comes in. Gates co-founded Microsoft, and Gavi receives funding from the Bill and Melinda Gates Foundation.", "Our rating: False", "The Trump administration launched a website in May asking for examples of Americans being censored on social media platforms like Facebook, Twitter and YouTube.", "At the time, the form asked users to submit their name, phone number and whether they are a U.S. citizen, USA TODAY reported. Then it asked for incidents of censorship.", "More:Trump White House solicits examples of social media censorship", "\"SOCIAL MEDIA PLATFORMS should advance FREEDOM OF SPEECH. Yet too many Americans have seen their accounts suspended, banned, or fraudulently reported for unclear 'violations' of user policies,\" the White House website reads.", "The website says it is no longer accepting new responses.", "Our rating: True", "Trump did not sign an executive order requiring states to reopen, according to the Federal Register, which archives executive orders, and even if he did want to open states, it’s not likely he’d have the power to do so.", "\"Trump has no authority to ease social distancing, or to open schools or private businesses,\" Kathleen Bergin, a professor at Cornell Law School, told NPR. \"These are matters for states to decide under their power to promote public health and welfare, a power guaranteed by the 10th Amendment to the Constitution. Despite what he claims, no president has absolute authority over domestic policy, and he certainly has no power to override the type of measures that have been taken across the country that have proved successful in flattening the curve.”", "The idea of taking legal action against governors’ COVID-19 lockdown plans, however, was raised by Attorney General William Barr in April, USA TODAY previously reported.", "\"We’re looking carefully at a number of these rules that are being put into place,\" Barr said in an interview with conservative talk show host Hugh Hewitt on April 21. \"And if we think one goes too far, we initially try to jawbone the governors into rolling them back or adjusting them. And if they’re not and people bring lawsuits, we file statement of interest and side with the plaintiffs.\"", "At a later press briefing, Trump did not dismiss the idea.", "“It would depend on the state, it would depend on the circumstances of the state,” Trump said when asked about Barr’s directive to federal prosecutors April 27, The Daily Beast reported.", "Our rating: Partly false", "The president did issue an executive order intended to secure the country’s bulk-power system, but the order does not allow the White House to “take over” electrical grids.", "The order seeks to protect the U.S.’ electricity system from cyber and other attacks, Reuters reported.", "More:Californians look to home batteries as backup for unreliable electric grid", "“It is imperative the bulk-power system be secured against exploitation and attacks by foreign threats,” Energy Secretary Dan Brouillette said in a press release. “This Executive Order will greatly diminish the ability of foreign adversaries to target our critical electric infrastructure.”", "The order makes no mention of assuming control over all electrical grids, and also does not mention “internet servers,” “broadcasting systems” or “electronic systems.”", "Our rating: Partly false", "It’s true that Trump deemed places of worship as essential early on in the coronavirus pandemic.", "“Today, I’m identifying houses of worship — churches, synagogue, and mosques — as essential places that provide essential services,” Trump said at a May 22 press briefing. “Some governors have deemed liquor stores and abortion clinics as essential but have left out churches and other houses of worship. It’s not right. So, I’m correcting this injustice and calling houses of worship essential.”", "It’s also true that some mayors are fining churches or church-goers, like in Chicago and Greenville, Mississippi. The Mississippi fines have since been canceled.", "Our rating: True", "More:Online prayers, social distancing in the pews: Christian leaders debate how to do church amid pandemic", "A resolution that calls for “scientific and collaborative field missions” to trace COVID-19’s transmission path, pushed by Australia and the European Union, was backed by 116 countries, Reuters reported.", "Trump tweeted in support of the move on May 18, “We are with them!” That same day, China agreed to an independent investigation, but only after the pandemic “has been brought under control,” Chinese president Xi Jinping said at a virtual WHO meeting.", "Our rating: True", "USA TODAY previously reported that there have been 8,559 arrests related to human trafficking made by the Federal Bureau of Investigation and the Immigration and Customers Enforcement’s Homeland Security Investigations.", "Fact check:Over 8,000 US trafficking arrests since 2017 have not included members of Congress", "Claims that human trafficking arrests have skyrocketed during Trump’s presidency are false, an in-depth analysis by FactCheck.org found.", "Trump has, however, been a vocal advocate for ending trafficking. He has signed several laws intended to bolster efforts to eradicate the crime and gave more than $35 million in Justice Department grants to nonprofit organizations that provide housing for human trafficking victims this month.", "Our rating: False", "We rate the claim that President Donald Trump achieved this list of 10 things as PARTLY FALSE because some claims were not supported by our research. Three of the claims are true, four are false, one is missing context and two are partly false.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]