["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Rob Woodall is passionate about the Fair Tax – a plan to replace the patchwork of federal income taxes with a \"flat\" 23 percent sales tax – so it’s not surprising that it was on his mind when he took to the well of the House earlier this month.", "Woodall introduced a Fair Tax bill in January, after which it was assigned to the House Ways and Means Committee, where it sits today. Woodall wanted to dislodge it.", "The two-term Republican from Lawrenceville calls the Fair Tax a \"plan of hope.\"", "\"It is a plan to remove the heavy hand of government from your personal pocketbook and put you in charge of your finances and your life,\" he says on his congressional website.", "In his 7,400-word speech, Woodall made his case for ditching our current system for a flat tax. If we did, we’d actually be playing catch-up, Woodall said.", "\"I look at what's happened in those former Soviet Bloc countries, Mr. Speaker,\" Woodall said April 16 in a House speech. \"Do you know those former Soviet Bloc countries have all moved to flat taxes?\"", "It is particularly galling to Woodall that the countries of the late Evil Empire have adopted this Reagan-era notion ahead of the United States. That is, of course, if it’s true.", "A small problem with checking Woodall’s claim is his terminology.", "There is the former Union of Soviet Socialist Republics, which is one set of countries, and there’s the Eastern Bloc, which included much of Eastern Europe. \"Soviet Bloc\" is a kind of hybrid of the two, but out of caution, we will assume Woodall was talking about the 15 countries left behind when the USSR dissolved.", "Many of those countries have adopted the flat tax, but five – Armenia, Azerbaijan, Moldova, Tajikistan and Uzbekistan – have not.", "Woodall declined to elaborate on the speech when PolitiFact contacted his office. His office pointed PolitiFact to a story in The Economist listing the 10 former Soviet republics with flat taxes.", "Daniel Mitchell, a flat tax advocate and senior fellow at the Libertarian Cato Institute, said Woodall was mistaken when he claimed every former Soviet nation had adopted the flat tax, but he said the idea has been \"amazingly pervasive\" in that part of the globe. Mitchell suspects their experiment with communism may be a reason.", "The former Soviet states have been governed by people that are less susceptible to class warfare ideology. That's been a big factor, he said in an email exchange. \"After suffering for decades under communism, there's less sympathy for a redistributionist agenda.\"", "That outlook made it easier to embrace a flat income tax, rather than a system that is graduated by income level, Mitchell said.", "Estonia, a country of 1.3 million, was the first of the former Soviet republics to pass a flat tax in 1994, with Lithuania and Latvia close behind. Since then, Russia and six other former Soviet countries have joined suit.", "Mitchell said competition for international investment has been a factor.", "\"Among the policy elite, the flat tax was seen as leading to more domestic growth, but I think they mostly saw the flat tax as a shortcut way of attracting capital from the outside,\" he said. \"Sort of a shortcut to more prosperity.\"", "The trend is not restricted to the former Soviet states. Some former satellite states have instituted a flat tax and some, such as Slovakia, had it and then scrapped it.", "A final bit of context: Those nations with a flat tax still tax income. Woodall’s Fair Tax would tax sales, which is a different conversation.", "So Woodall was mistaken when he said all \"Soviet Bloc\" countries have embraced the flat tax. Many former communist countries, however, have adopted flat taxes, which was his larger point.", "We rate the congressman’s claim Half True.", "Staff writer Karishma Mehrotra contributed to this article.", "U.S. Rep. Rob Woodall’s congressional website, \"FairTax: Unleash America’s Economy,\" April 24, 2013", "Email interview with Dan Mitchell, senior fellow, Cato Institute, April 24, 2013", "Forbes, \"The Rise of the Flat Tax Gives Us Morning in Albania,\" Nathan Lewis. Sept. 29, 2011, www.forbes.com/sites/nathanlewis/2011/09/29/the-rise-of-the-flat-tax-gives-us-morning-in-albania/", "Indiana University School of Public and Environmental Affairs SPEA Insights, \"Economic Impact of a ‘Flat’ Tax: What have we learned from the Russian Experience?\" Denvil Duncan. February 2012, www.indiana.edu/~spea/faculty/policy_briefs/duncan_economic_impact_flat_tax.pdf", "Tour Armenia website, \"The Tax System in Armenia,\" 2013, www.tacentral.com/economy.asp?story_no=9", "Tax-News.com, \"Slovakia scraps flat tax,\" Ulrika Lomas, Dec. 7, 2012, www.tax-news.com/news/Slovakia_Scraps_Flat_Tax____58665.html", "Flat Tax: Essays on the Adoption and Results of the Flat Tax Around the Globe. Blog by Alvin Rabushka, senior fellow, Hoover Institution, Stanford University, http://flattaxes.blogspot.com/", "The Economist, \"The case for flat taxes,\" April 14, 2005, www.economist.com/node/3860731", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]