["“MASSIVE EXPOSE! Karnataka minister M B Patil’s letter to Sonia Gandhi reveals that Global Christian Council and World Islamic organisation masterminded the division of Lingayats in Karnataka!” Postcard News has done it again. Barely a month after its founder Mahesh Hegde was released on bail after his arrest for circulating fake news, the fake news website has circulated a photoshopped letter which it claims was written by M B Patil, President of Bijapur Lingayat Association, to Sonia Gandhi.", "The letter alleged that Patil held talks with Global Christian Organisation and World Islamic Organisation to formulate the strategy for the upcoming Karnataka and the 2019 general elections. The alleged “Divide-Hindus-Unite-Muslim” strategy aimed to “unite the Christian and Muslim votes and divide the Hindus on the basis of caste and sub-caste.”", "Another social media user @RituRathaur who has a following of over 100,000 and regularly shares content from Postcard News too tweeted about this letter, and later deleted it.", "With an eye on Karnataka elections Postcard News appealed to its readers, “They are using Christian and Muslim to target Hindus and destroy this Nation to come back to power which needs to be stopped.”", "The hilariously fake letter is targeted at readers completely incapable of critical thinking. Not only are the language and contents of the letter a dead giveaway, a quick Google search reveals that ‘Global Christian Council’ and ‘World Islamic Organisation’ do not exist. The fake news brigade has not only faked the letter, it has also concocted the names of the organisations. Looking for the names of these organisations on Google leads back to Postcard News site. No prominent websites were found which represent either of the organisations.", "Karnataka minister, M B Patil has also confirmed to Alt News that the letter is fake.", "“I came to know through my son and some friends who sent me the PostCard News story related to Sonia Gandhi about a letter with my signature. There is all sorts of nonsense written in it, creating a conspiracy theory. I am going to take this to the logical end and will resort to legal action of criminal defamation”, said M B Patil in a conversation with Alt News.", "Postcard News always follows a simple ‘shoot and scoot’ strategy. The moment the article was challenged and Karnataka police was tagged, the article and Mahesh Hegde’s tweet disappeared from the internet. The story has also been deleted from the Postcard News website.", "Anything coming from Postcard News is hard to swallow, but there are enough people who seem to fall for it. The fake letter is also doing rounds on WhatsApp.", "Are these documents circulating in WhatsApp true #MBPatil @siddaramaiah @RahulGandhi ?", "OR", "Is this a sinister plan to divide Hindus as written by MB Patil to Sonia? Do you want to take over all Hindu Mutts if you come back to power?", "Dear Hindus safety 1st#votebjp2savekarnataka pic.twitter.com/4feQ8CTn5u", "— Dr Jagadish J Hiremut (@Kaalateetham) May 11, 2018", "Mahesh Hegde, the man behind Postcard News is followed by PM Modi on Twitter. When Hegde was arrested in March 2018 for spreading fake news about a Jain monk attacked by Muslim youth, multiple BJP members had expressed solidarity and issued statements in his support. These included Union Minister from Karnataka Anant Kumar Hegde and BJP Karnataka General Secretary C T Ravi. With this kind of official patronage that serial offenders receive from those in power, it is unlikely that the volume of fake news around us is going to come down in the near future. Social media users have to be careful about believing such pieces of outlandish news, particularly when they come from known peddlers of fake news.", "Donate Now", "Follow @free_thinker", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]