["About this rating", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "A video supposedly showing riots taking place in the Mall of America went viral on Twitter, causing \"Mall of America\" to trend on the social media platform in late May 2020.", "The shaky video shows a couple of people moving in the camera's direction, while a black car drives between stalls as onlookers watch. There appear to be a number of scattered items on the floor. One comment attached to the video reads, \"be focused on the main thing which is protesting, this is not protesting.\" Another comment reads, \"they took a whole ass car in moa (Mall of America),\" in reaction to the incident:", "The comments in the above video are likely referring to protests that erupted in Minneapolis on May 27, 2020, after the death of a black man named George Floyd while he was in custody of Minneapolis police. Two days earlier, Floyd died after being handcuffed and pinned to the ground by a police officer. A video taken by a bystander at the scene showed the police officer, who is white, pressing his knee onto Floyd's neck for several minutes while Floyd pleaded \"I can't breathe.\" The video went viral on social media. In the days that followed, Minneapolis residents took to the streets to protest police brutality and racial injustice.", "But the video is actually not from the Mall of America, located about 15 minutes away in Bloomington. It's video of a 2019 incident in a Chicago-area mall.", "A clearer and longer Twitter video posted on September 20, 2019 shows the same car driving past a Forever 21 store, and then through what appear to be the same areas we see in the above video. An individual in what appears to be a grey shirt runs toward and past the camera, identical to the edited and colored video claiming to be from the Mall of America in May 2020. See below:", "The Mall of America was also closed at the time due to the COVID-19 coronavirus disease pandemic. On May 22, 2020, they tweeted about reopening on June 1, 2020. From their website:", "According to NPR, the incident in the September 2019 video took place in Woodfield Mall, about 14 miles from Chicago's O'Hare International Airport. A man drove his SUV through the mall, and was soon arrested by police. Initial reports about the incident mistakenly suggested an active shooter was in the mall. But the incident did result in panic, with people running away from the vehicle and shouting for it to stop. NPR shared a link to the original video from Woodfield Mall:", "\"A video posted on Twitter Friday shows the black Chevrolet Trailblazer erratically weaving through the mall as bystanders run from the vehicle and yell at the driver to stop. After crashing into a Hollister store, the car backs up, stops for a moment and continues driving.\"", "Even though Mall of America is not in Minneapolis, was scheduled to be closed until at least June 1, 2020, and the video in question was from a separate incident, social media users continued to discuss \"rioting\" taking place there. With that in mind, we rate the video \"Miscaptioned.\"", "Jany, Libor.   \"Minneapolis police, protesters clash almost 24 hours after George Floyd's death in custody.\"\r\n   Star Tribune.   27 May 2020.", "The New York Times.   \"George Floyd Protests in Minneapolis: Live Updates.\"\r\n   28 May 2020.", "Tuerk, Alexander.   \"SUV Drives Through Chicago Area Mall, Prompts False Claims Of Active Shooter.\"\r\n   NPR.   21 September 2019.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]