["About this rating", "On 14 December 2015 Fox News published an article titled \"ISIS killing babies with Down syndrome, activists claim.\"  The site, noting that \"[source] information and [a] video have not been confirmed,\" reported:", "ISIS militants have reportedly authorized the terror group's members to kill newborn babies with Down syndrome, as well as other disabled children, Iraqi activists claimed on Sunday.", "According to the group known as Mosul Eye, 38 babies have already been killed since the religious decree was issued ... The babies were suffocated or given lethal injections, according to Mosul Eye.", "Britain's Daily Mail published a 14 December 2015 article titled \"How much more depraved can ISIS get? Group's Sharia judges order children with Down's syndrome and other disabilities to be killed in chilling echo of the Nazis\":", "ISIS's Sharia judges order children with Down's syndrome to be killed https://t.co/3NfY80kZUy pic.twitter.com/B2WpWcRIcv", "— Daily Mail Online (@MailOnline) December 14, 2015", "That article maintained:", "ISIS have issued a fatwa which orders children with Down's syndrome and other disabilities to be killed in a chilling echo to the workings of the Nazis, it is claimed. Sharia judges have apparently ruled that ISIS followers are authorised to 'kill newborn babies with Down's Syndrome or congenital deformities and disabled children' in their latest sickening act.", "In the absence of credible information, the site turned to internet commenters to flesh out its reporting:", "Responding to Mosul Eye's statement about ISIS possibly using similar methods to those in the Nazi era, hundreds replied to condemn their barbaric actions. One user described ISIS as 'worse than the Nazis', adding: 'I have just shed tears for these babies. I have two children with special needs, my heart is breaking. Another said: 'OMG, i see so much similarities with nazi Germany,' while another person commented: 'What danger do these poor babies impose on isil?!'", "Although Daily Mail used \"apparently\" and \"it is claimed\" to buttress its reporting, the outlet didn't emphasize that the information was gleaned from a single blogger's Facebook post. Fox News and multiple concurrent reports cited a group called \"Mosul Eye\" as the source for the unverified claims. The original 13 December 2015 post and video (embedded below) claimed:", "Exclusive - Mosul Eye #IAmDisabledTheCaliphWillKillMe ISIL issues \"Fatwa\" to exterminate children with Down's Syndrome Through monitoring and following the death incidents of children with Down's Syndrome and congenital deformities, we were able to learn that the Shar'i Board of ISIL issued an \"Oral Fatwa\" to its members authorizing them to \"kill newborn babies with Down's Syndrome and congenital deformities and disabled children\". The Fatwa was issued by one of ISIL's Shar'i judges, a Saudi judge named \" Abu Said Aljazrawi\". The information indicate that most of the children born with Down's Syndrome are those of foreign fighters who married Iraqi, Syrian and Asian women. We recorded more than 38 confirmed cases of killing babies with congenital deformities and Down's Syndrome, aged between one week to three months. They were killed by either lethel injection or suffocation. Some of those killings took place in Syria and Mosul. This displaced child from Mosul, ISIL issues a Fatwa to kill him. As if it is not enough for ISIL to kill men, women and the elderly, and now, they kill children #IAmDisabledTheCaliphWillKillMe #ISILSchools #WeDoNotWantToBeLeftAlone #TheCaliphDoesNotFeelCold", "Exclusive - Mosul Eye#IAmDisabledTheCaliphWillKillMeISIL issues \"Fatwa\" to exterminate children with Down's...", "Posted by Mosul Eye on Sunday, December 13, 2015", "Mosul Eye appeared to be the sole source of the claims that ISIS militants killed 38 disabled children, and the appended video simply depicted two children, neither of whom appeared to be killed or harmed for the duration of the footage. Additionally, neither child depicted in the video appeared to have Down syndrome.", "While the claim that ISIS was killing disabled children and children with Down syndrome appeared in multiple international news reports, no one was able to substantiate the rumors. Iterations commonly reported that 38 children had thus far been killed by \"lethal injection\" or \"suffocation,\" but no information about the dozens of children purportedly killed was included in any report. Moreover, an attached video simply depicted two children (one of whom appeared to be disabled, and was using a wheelchair), neither of whom was harmed or killed in the clip.", "[article-meta]", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]