["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Biden’s form of travel has nothing to do with the legitimacy of his presidency. The post simply repeats variations of elaborate claims that have no credible evidence or basis in truth.", "Joe Biden was duly sworn in as the 46th president of the United States on Jan. 20, despite false claims that the outgoing administration formulated a scheme with the military that would have kept Donald Trump as president for another four years.", "Many who believed these QAnon conspiracies have realized the so-called \"storm\" was never coming. But on social media, some are still trying to hold on to the baseless conspiracy theory in the face of evidence that shows otherwise.", "One post shared widely on Facebook claims that Biden took a private jet to Washington D.C. for his inauguration, an indication, the post says, that Biden is not the legitimate president and that the military will soon take over the government.", "\"That’s why they didn’t send a government plane for the President-Elect,\" the lengthy post says, \"because they know he is not a legitimate President and, once he was sworn in, the government became illegitimate (belligerent) and the military is now responsible for restoring legitimate civilian government.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Biden is in fact, the legitimate president, and the military is not taking over the government.", "Biden, once a devoted Amtrak commuter, originally planned to travel to Washington by train from Delaware, but that plan changed when it was deemed too great a security risk. So he took a private jet, which was also a break from tradition.", "Usually the outgoing administration provides a government plane to bring the president-elect to Washington for the inauguration. Trump, who refused to acknowledge Biden’s victory until early January, opted to not attend the inauguration, becoming the first outgoing president in more than a century to skip the event.", "We reached out to the White House, but couldn’t confirm whether the Trump administration offered to provide transportation to the Bidens. CNN reported that \"a source familiar with the matter\" said the government didn’t offer the Bidens a plane, but did not provide further details.", "Regardless, Biden’s form of travel has nothing to do with the legitimacy of his presidency. The post is simply repeating variations of claims for which there is no credible evidence or factual basis.", "We rate it False.", "RELATED: Don't fall for rumors about a Trump-led military takeover, emergency alerts", "Facebook post, Jan. 20, 2021", "PolitiFact, How we know Joe Biden won the 2020 presidential race, Nov. 13, 2020", "CNN, CNN explains why Biden's flight to DC is so unusual; The Bidens are flying a private plane to Washington, marking another break in protocol, Jan. 19, 2021", "Time, As Trump Plans to Skip Biden's Swearing In, Here Are 3 Other U.S. Presidents Who Dodged Their Successors' Inauguration,  Jan. 19, 2021", "Curbed, Biden’s Amtrak Ride to His Inauguration Has Been Derailed, Jan. 14, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]