["About this rating", "Partisans typically seize on and play up every verbal miscue made by their political opponents, but in recent years former vice president and 2020 Democratic presidential candidate Joe Biden has acquired a reputation for being something of a gaffe machine. That wasn't always the case, however, as Newsweek wrote in a June 2020 profile of the long-serving politician:", "Biden has become infamous, both as vice president during the Obama administration and in his current presidential campaign, for garbled statements and inappropriate remarks ...", "Yet between his stuttering youth and his current occasionally irascible elder statesman status, Biden rose to prominence with a reputation for being an exceptional speaker given to soaring prose and inspirational sentiment. (Yes, really.) A 1985 profile in the Philadelphia Inquirer cited a group of politicos who regarded Biden as, \"with the possible exception of Jesse Jackson, the most spellbinding orator in the Democratic Party.\" In February 1986, the Washington Post columnist Mary McGrory noted Biden was \"much in demand as a star speaker, one guaranteed to rouse Democrats from the melancholy torpor in which they have languished.\"", "Nonetheless, in May 2020 numerous pundits began circulating a clip from a Biden television interview in which the presidential candidate supposedly proclaimed, \"I'm going to beat Joe Biden\":", "[W]hen former Vice President and 2020 hopeful Joe Biden was asked to speak directly Democrats aligned with Senators Bernie Sanders and Elizabeth Warren’s progressive agendas, he wasted no time saying he’s “going to beat Joe Biden” before laying out several areas of his policies.", "That clip was a short excerpt taken from an interview Biden gave with CNBC's \"Squawk Box\" on May 22, 2020, and according to the transcript of that interview, Biden actually said he was \"going to be Joe Biden.\" Given the obvious similarity in pronunciation between \"be\" and \"beat,\" it's not possible to definitively determine exactly which word Biden uttered during that interview, but in the full context of the conversation at that point, Biden's use of \"be\" made perfect sense, while his saying \"beat\" would have been a rather bizarre non sequitur.", "Biden was responding to a question in which host Joe Kernen questioned how, given his status as a \"moderate,\" Biden might appeal to Democrats who initially supported more progressive Democratic rivals Elizabeth Warren and Bernie Sanders. Biden's response was to assert that he had built up a record over 40 years in public service, and he was going to stick with that record -- that is, he was going to \"be Joe Biden\" and not try to mirror the positions of Elizabeth Warren or Bernie Sanders:", "JOE KERNEN: I'm great. You know, some pundits, democratic pundits, sir, say that Sanders and Warren's voters are essential for you to win. I know you've probably seen that. But some aren't quite there yet. Others point out though, that your candidacy surged when it became apparent to mainstream Democrats that Sanders might be the nominee. And, and then they flock to you, a more moderate perhaps candidate. Are you prepared now to say you're going to govern as a progressive and enact programs in the mold of Sanders and Warren? And if so what does that say to either moderate Democrats or Independents or even some Republicans dissatisfied with President Trump?", "VICE PRESIDENT JOE BIDEN: I'm prepared to say that I have a record of over 40 years. And that I'm going to be Joe Biden. Look at my record. The fact is that some areas that I think, for example, I think health care is a right not a privilege. I do not support Medicare for All. I will not support Medicare for all. But I do support, making sure that Obamacare is around with a public option, for those who can afford, those who qualify for Medicaid and they don't get in their state, they would be able to buy it and be able to automatically enroll in the public option, Medicare, that would -- but I do not support, you know, forgiving debt loan for every single solitary person no matter where you went to school. But I do support the idea that if in fact you have student debt as a consequence of going to a public university, and your income is under $125,000, it should be forgiven. I do believe that anyone going to school, that in fact goes to a public university and or Community College, they should be able to go for free if income is under $125,000. My wife has a great expression: any country that out-educates is going to out-compete us. We have a whole generation that's being put behind the eight ball, Joe. You know that. They're in real trouble. They're in real trouble right now.", "Additionally, mainstream news accounts of the interview referenced Biden's saying \"be\" rather than \"beat.\" The Associated Press reported, for example:", "Republican pollster Whit Ayres countered that Biden’s “sweet spot” is the center-left.", "“You’ve got to run on who you are,” Ayres said. “If he becomes a politician of the left, it’s going to hurt his ability to consolidate the 54% of Americans who voted for someone other than Donald Trump in 2016.”", "Biden deflects the risks. Asked whether his recent moves mean he’ll govern as a “progressive,” Biden retorted on CNBC: “I’m going to be Joe Biden. Look at my record.”", "Similarly, the New York Times wrote that:", "[I]n a television interview with CNBC, Mr. Biden pledged that he would repeal the tax cuts signed by the president in 2017 and raise the corporate tax rate. He added that he would not raise taxes on anyone making less than $400,000, as he seeks to outline his plan for American economic recovery in the wake of the global coronavirus pandemic.", "Mr. Biden gave some of his most detailed explanations of his economic policy. He rejected the idea that he would govern as an economic progressive, saying, “I have a record of over 40 years, and I’m going to be Joe Biden. Look at my record.”", "Given that an interpretation of Biden's words exists which is much more sensible and reasonable that the one asserted above, we rate this claim to be False.", "Video of the full CNBC interview with Biden is viewable here:", "https://youtu.be/nbnJ5pTsP6o", "CNBC.   \"CNBC Transcript: Former Vice President Joe Biden Speaks with CNBC's 'Squawk Box' Today.\"\r\n    22 May 2020.", "Weissert, Will and Bill Barrow.   \"Biden Aims to Move Left Without Abandoning Centrist Roots.\"\r\n    The Associated Press.   25 May 2020.", "Herndon, Astead W. and Katie Glueck.   \"Biden Apologizes for Saying Black Voters ‘Ain’t Black’ If They’re Considering Trump.\"\r\n    The New York Times.   22 May 2020.", "Friess. Steve.   \"Joe Biden, Human Gaffe Machine, Was Once a Great Public Speaker.\"\r\n    Newsweek.   1 June 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]