["Democratic presidential candidate Hillary Rodham Clinton delivers a speech at Texas Southern University, calling for an expansion of early voting and pushing back against Republican-led efforts to restrict voting access.", "2016 Democratic frontrunner Hillary Clinton went after Republicans by name for repeatedly restricting voting rights in a policy speech at Texas Southern University on June 4, 2015.", "She singled out several Republican governors who are also potential presidential candidates. Among them was New Jersey Gov. Chris Christie, who \"vetoed legislation to extend early voting,\" according to Clinton.", "Christie called Clinton’s accusation \"ridiculous,\" on CBS’s Face the Nation a few days later.", "\"She doesn't know what she's talking about,\" he said. \"The fact is that folks in New Jersey have plenty of an opportunity to vote.\"", "Christie has a point that voters in New Jersey could vote before Election Day. But Clinton is right that Christie nixed a plan to \"extend\" early voting. We’ll explain.", "Under New Jersey election law, you can vote early through absentee ballot, but that’s not the same thing as early voting, which experts told us typically means casting your ballot in-person at a limited number of polling locations before election day. With absentee voting, Garden State voters can send their ballots via mail or drop it off in person at an election official’s office as early as 45 days before polls open.", "After Hurricane Sandy in 2012, New Jersey witnessed several logistical polling issues around the state on Election Day. So Democratic lawmakers proposed adding the typical in-person early voting option. Under their bill, S2364, a limited amount of polling locations would open for 14 days leading up to Election Day.", "The New Jersey Legislature passed the bill in March 2013 and sent it to Christie, who threw it out. Christie’s spokesman referred us to his veto message.", "\"This bill risks the integrity and orderly administration of our elections by introducing a new voting method and process,\" Christie wrote. \"Taxpayers should not have to foot a more than $25 million bill to pay for a hasty, counterproductive, and less reliable system, especially when New Jersey’s current early voting process is reliable and cost effective.\"", "Christie’s and Clinton’s definitions of early voting differ. And while there’s no legally or universally recognized definition for the term, experts say Clinton’s is more widely used.", "\"Technically, New Jersey voters can vote early, but it's not what early voting systems look like around the country. It looks like the absentee ballot system,\" said Wendy Weiser, an election law expert at the Brennan Center for Justice.", "Hans von Spakovsky, an election law expert at the Heritage Foundation, agreed but noted that, in his opinion, \"Absentee balloting is actually easier than early voting, since you can do everything from your home.\"", "Our ruling", "Clinton said, \"In New Jersey, Gov. Christie vetoed legislation to extend early voting.\"", "In 2012, state legislators passed a bill that would have added early, in-person voting to New Jersey’s existing absentee ballot mail-in system. While the legislation wouldn’t have extended the time period for early voting, it would have given voters more ways to vote before Election Day. Christie rejected the bill, saying the existing system worked fine.", "We’re not weighing in here on whether the new system was better, but we do find that Clinton was careful in how she worded her claim. The proposal would have extended early voting, and Christie vetoed it. We rate her statement Mostly True.", "Interview with Wendy Weiser, director of the Democracy Project at the Brennan Center for Justice at New York University, June 8, 2015", "Email interview with Hans von Spakovsky, manager of the Election Law Reform Initiative at the Heritage Foundation, June 8, 2015", "The Times of Trenton, \"Christie vetoes early voting bill, angering Democrats,\" May. 9 2012.", "The Star-Ledger, \"N.J. Dems to push for early voting, They seek to avoid the chaos of Sandy,\" Nov. 8, 2012.", "Eastern Express Times, \"Freeholder urge veto on early voting WARREN COUNTY OFFICIALS OK RESOLUTION asking governor to reject measure passed by lawmakers,\" March 29, 2013.", "Bergen County, New Jersey, \"Donovan Praises Governor Christie for Vetoing Early Voting Legislation,\" May 14, 2013.", "The New York Times, \"Christie Vetoes Early-Voting Bill,\" May 9, 2013", "The Wall Street Journal, \"Many Displaced by Superstorm Sandy Still Wait for Housing Help,\" June 17, 2015.", "NJ Spotlight, \"Democrats Decry Governor’s Veto of Early-Voting System,\" May 10, 2013.", "National Conference of State Legislature, \"Absentee and Early Voting,\" February 11, 2015", "CBS News, Face the Nation, June 7, 2015", "New Jersey Senate Bill No. 2364, November 29, 2012", "Interview, Josh Schwerin, Hillary Clinton spokesman, June 5, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]