["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "ABC News security analyst Richard Clarke discusses the drone strike that killed two western hostages on ABC \"This Week\" April 26, 2015.", "The White House recently disclosed that the two hostages -- one American and one Italian -- were killed in January by an American \"signature strike\" aimed at al-Qaida terrorists.", "A signature strike is a type of drone strike, in which the United States targets people they believe to be militants, though they don’t know the exact identity of the target. Some have criticized the government’s use of such strikes because they run a higher risk of hitting innocent parties.", "Government officials told the Wall Street Journal that signature strikes have been effective for killing high-value targets, especially in regions where it’s hard to locate al-Qaida leaders.", "But the continued use of signature strikes goes against what President Barack Obama said he was going to do, said ABC News security consultant Richard Clarke, who spent 30 years working in government, including 10 years in the White House, before leaving in 2003.", "\"When you do these signature strikes, meaning by definition, you don't know who you are killing, you just know the facility looks like an al-Qaida facility,\" Clarke said on ABC This Week April 27. \"When you do signature strikes, that's very risky. And President Obama said he was going to stop them, and clearly he didn't.\"", "Obama has relied heavily on drones -- nearly 2,500 people have been killed in covert drone strikes since Obama took office, according to the Bureau for Investigative Journalism, which tracks strikes. We wondered if Obama had gone back on what he said. Did he say he was going to stop signature strikes?", "Vague guidelines", "Clarke didn’t respond to several requests for comment. But we dug through Obama’s statements over the years, as well as campaign materials. We couldn’t find any instance in which Obama literally said he was going to stop using signature strikes.", "Clarke’s claim might stem from a May 2013 speech Obama delivered at the National Defense University, where he discussed vague drone policies.", "In the speech, Obama announced that he had signed a \"presidential policy guidance\" document where he codified a \"framework that governs our use of force against terrorists.\" Although the event and document were widely seen as a shift to more restrictions on drone strikes, concrete details about the shift were almost nonexistent.", "The presidential policy guidance document itself is not publicly available, and the related fact sheet does not address drone strikes, much less signature strikes. A heckler in the audience asked specifically what Obama was planning to do about signature strikes, but he did not respond.", "An unnamed member of the Obama administration debriefed reporters on the shift, and one reporter asked, \"Will signature strikes explicitly be prohibited now?\"", "\"I don’t want to get into the details of any specific strike,\" the official responded, though he went on to say \"the type of strikes we’ve taken generally\" would eventually be phased out.", "\"Given the two principal changing circumstances in our effort against terrorism -- the winding down of the war in Afghanistan and the demise of al-Qaida core -- the need for the types of strikes that we’ve taken generally over the course of the last several years will be reduced over time,\" the official said.", "(Obama has since extended the withdrawal of American troops from Afghanistan.)", "Following the briefing, the New York Times reported that the codified standards \"could signal\" an end to signature strikes -- not that they would unequivocally. They also reported that officials said signature trikes would certainly continue in Pakistan, where the two men were killed.", "In fact, the Wall Street Journal recently reported that the CIA drone program in Pakistan is generally exempt from the 2013 policy guidelines, at least while the United States continues some level of operations in Afghanistan.", "At the time, Benjamin Wittes, a national security expert and editor of the Lawfare blog, wrote that it was unclear from Obama’s remarks and the coverage whether or not Obama actually narrowed the criteria for targeting people in drone strikes -- because the language was so opaque.", "Now -- two years later -- Wittes told PolitiFact, \"I don't think it's fair to say that Obama promised to end signature strikes.\"", "Our ruling", "Clarke said, \"President Obama said he was going to stop (signature strikes).\"", "As far as we can tell, Obama has never said himself that he would stop signature drone strikes, which killed two western civilian hostages. An unnamed administration official implied that signature strikes would eventually be phased out, though without any details. In any case, the drone program in Pakistan, which killed the hostages, was generally exempt from these rules.", "Clarke’s claim suggests that Obama did something he said he wouldn’t do anymore, but that isn’t the case. We rate the statement Mostly False.", "ABC This Week, transcript, April 26, 2015", "Wall Street Journal, \"Obama Kept Looser Rules for Drones in Pakistan,\" April 26, 2015", "LexisNexis news database search, conducted April 27, 2015", "New York Times, \"Secret ‘Kill List’ Proves a Test of Obama’s Principles and Will,\" May 29, 2012", "New York Times, \"The ‘Signature Strikes’ Program,\" May 29, 2013", "New York Times, \"In Terror Shift, Obama Took a Long Path,\" May 27, 2013", "New York Times, \"Obama, in a Shift, to Limit Targets of Drone Strikes,\" May 22, 2013", "New York Times, \"Heckled by an Activist, but Getting the Last Word,\" May 23, 2013", "New York Times, \"Pivoting From a War Footing, Obama Acts to Curtail Drones,\"", "Christian Science Monitor, \"Has Obama tightened US drone strike policy, or not?\" May 24, 2013", "Lawfare, \"Did the President Narrow the Targeting Criteria for Drone Strikes?\" May 23, 2013", "White House, Remarks by the President at the National Defense University, May 23, 2013", "White House, Fact Sheet: The President’s May 23 Speech on Counterterrorism, May 23, 2013", "White House, Background Briefing by Senior Administration Officials on the President's Speech on Counterterrorism, May 23, 2013", "White House, U.S. Policy Standards and Procedures for the Use of Force in Counterterrorism Operations Outside the United States and Areas of Active Hostilities, May 23, 2013", "Obama for America, Counterterrorism Fact Sheet, as of Oct. 3, 2008", "Email interview, Benjamin Wittes, Brookings Institution senior fellow, April 27, 2015", "Email interview, National Security Council spokesman Ned Price, April 27, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]