["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democrats and Republicans working together were able to get Russia to cut their nuclear arms, Hillary Clinton said in a recent television ad.", "In the ad, Clinton criticized her opponent, Republican presidential candidate Donald Trump, for claiming to be able to fix the country’s problems himself. She then touted her record as first lady, senator and secretary of state.", "\"Donald Trump says he alone can fix the problems we face,\" Clinton says into the camera. \"Well, I don't believe that's how you get things done in our country. It takes Democrats and Republicans working together. That's how we got health care for 8 million kids, rebuilt New York City after 9/11, and got the treaty cutting Russia's nuclear arms. We've got to bring people together. That's how you solve problems, and that's what I'll do as president.\"", "The ad, called \"Only Way,\" has aired in seven states, beginning Sept. 9.", "We wanted to look at \"the treaty cutting Russia’s nuclear arms,\" which led us to Clinton’s foreign policy record while secretary of state from 2009 through early 2013.", "Clinton is referring to the New Strategic Arms Reduction Treaty, or New START, an agreement between Russia and the United States designed to limit both countries’ deployed strategic nuclear weapons. The original START treaty was in force from 1994 until it expired in 2009; New START was signed in April 2010 and went into force in February 2011.", "Clinton’s claim that New START cut Russia’s nuclear arms is imprecise and overstates the treaty’s impact.", "\"Russia is not expected to rapidly or dramatically reduce its nuclear weapons holdings,\" said Lisa Koch, a professor and nuclear proliferation expert at Claremont McKenna College. \"New START could be characterized as a modest, rather than a sweeping, arms control treaty.\"", "What’s in the treaty?", "New START has three primary limitations on vehicles capable of launching nuclear weapons and the nuclear warheads themselves. By February 2018, Russia and the United States each have to meet these restrictions:", "700 deployed ballistic missiles and heavy bombers: intercontinental ballistic missiles, submarine-launched ballistic missiles, and heavy bombers capable of carrying nuclear weapons;", "800 total deployed and non-deployed launchers: intercontinental ballistic missile launchers, submarine-launched ballistic missile launchers, and nuclear-capable heavy bombers;", "1,550 total deployed nuclear warheads on these missiles and bombers.", "It’s accurate that these limits are more restrictive than prior treaties. For example, START I limited deployed nuclear warheads to 6,000, and the Strategic Offensive Reductions Treaty limited them to 1,700-2,200.", "But it’s questionable whether it has, in practice, reduced Russia’s nuclear arsenal for two main reasons:", "First, Russia was actually below New START limits in two out of the three categories right when treaty implementation began in February 2011.", "The State Department publishes where both countries stand on these requirements twice a year, starting with an initial exchange of data when New START took force in February 2011.", "At that time, Russia had 865 deployed and non-deployed launchers for strategic missiles and heavy bombers, meaning it would have to reduce that fleet by 65 to meet the limit of 800 by February 2018. However, Russia had 521 deployed missiles and heavy bombers out of 700 allowed, and 1,537 deployed nuclear warheads out of 1,550 allowed.", "So Russia could actually increase its deployed missiles and heavy bombers, as well as its deployed nuclear warheads, beyond that initial February 2011 count and still be within treaty limits.", "\"It is true that the treaty has lower limits than previous treaties, but since Russia was already below the New START limits for deployed forces when the treaty entered into force in 2011, it is not correct to say that the treaty is ‘cutting Russia's nuclear arms,’ \" said Hans Kristensen, director of the Nuclear Information Project at the Federation of American Scientists, which supports arms control.", "In fact, the latest State Department report shows that as of March 2016, Russia has 1,735 deployed nuclear warheads, about 200 more than the treaty allows.", "At first glance, this might seem like Russia is building up its deployed nuclear arsenal in spite of the treaty. However, experts told us that this spike is actually a result of Russia modernizing its nuclear program. Essentially, they’re sending out new missile launchers and submarines that can hold more nuclear warheads per vehicle without having yet retired the old ones, so there’s some doubling up for the time being.", "Because New START doesn’t set limits during this interim implementation period (February 2011-February 2018), Russia still has a couple years to bring its deployed nuclear warheads within the limits set out by the treaty. Experts expect it to do so.", "\"Russia’s compliance is not in doubt at this point,\" Kristensen said.", "Before New START passed, it was clear Russia intended to modernize its nuclear arsenal in a big way, said Steven Pifer, director of the Brookings Arms Control and Non-Proliferation Initiative. Now, their modernization efforts have to fit within the New START limits, and it’s unclear if they would have grown beyond those limits absent the treaty.", "\"I would say that New START does reduce and limit Russian strategic arms, but I would not overly hype the depth of the reduction,\" said Pifer, a Clinton supporter who testified before Congress in favor of New START.", "Second, New START only limits a portion of the nuclear arsenals.", "New START mainly counts strategic, deployed weapons. But it doesn’t limit nonstrategic weapons, nor weapons that have been stockpiled or retired.", "The treaty \"does not require either government to destroy non-deployed warheads,\" Koch said. \"Both governments can still stockpile warheads beyond the agreed-upon limit of 1,550 without violating the treaty.\"", "Excluding the thousands of warheads that have been retired and are awaiting dismantlement, Russia currently has about 4,500 nuclear warheads, including stockpiles and the 1,735 deployed warheads reported for New START, according to Federation for American Scientists estimates.", "Russia’s total nuclear warhead arsenal has been on a steady decline since the 1990s. That decline has nearly stagnated during President Barack Obama’s presidency, hovering at around 4,500 since 2012, according to Federation for American Scientists data.", "Throughout Obama’s tenure — and Clinton’s term as secretary of state — Russia has shrunk its total nuclear arsenal far less than it did under the past three presidents. And it would be difficult to attribute any reduction in Russia’s nuclear stockpiles to New START, given that the treaty only limits deployed weapons.", "\"The end of the Cold War, the financial crisis in the 1990s and the START I treaty had a much greater effect on shaping Russia's current and planned nuclear posture than the New START treaty,\" Kristensen said.", "It’s worth noting that some experts no longer consider stockpiles a serious threat to security. Under New START’s deployed weapons restrictions, the effectiveness of a large stockpile is limited, especially because Russia only produces about 10 missiles per year, according to a report by the nonpartisan Congressional Research Service. Thus the treaty might make it so that Russia does not feel the need to stockpile as many weapons.", "Our ruling", "Clinton said New START, passed while she was secretary of state, was a \"treaty cutting Russia’s nuclear arms.\"", "The treaty hasn’t cut Russia’s nuclear arms yet. But if it does in the future, after the treaty is fully implemented in 2018, it seems that any reductions would be minimal rather than sweeping.", "New START has a limited impact in that it focuses on one portion of Russia’s nuclear program: deployed strategic weapons. The treaty does place tighter limits on these weapons than any past treaty. But Russia was actually already meeting the treaty’s limits, for the most part, when treaty implementation began.", "Also, the treaty does not restrict either country from stockpiling weapons, nor does it require them to destroy any existing weapons.", "We rate her claim Half True.", "Clinton campaign, \"Only Way,\" Sept. 9, 2016", "State Department, \"Central Warhead and Delivery Vehicle Limits of the New START Treaty,\" April 8, 2010", "State Department, New START fact sheets, accessed Sept. 16, 2016", "Arms Control Association, \"U.S.-Russian Nuclear Arms Control Agreements at a Glance,\" April 2014", "Bulletin of the Atomic Scientists, \"Russian Nuclear Forces, 2016,\" April 15, 2016", "Bulletin of the Atomic Scientists, \"Nuclear arsenals of the world,\" data through 2014", "FAS, \"How Presidents Arm and Disarm,\" Oct. 15, 2014", "FAS, \"New START Data Shows Russian Increases and US Decreases,\" April 1, 2016", "FAS, \"US Nuclear Stockpile Numbers Published Enroute To Hiroshima,\" May 26, 2016", "FAS, \"Status of World Nuclear Forces,\" last updated May 26, 2016", "Brookings, \"New START turns five,\" Feb, 4, 2016", "Brookings, \"The future of U.S.-Russian arms control,\" Feb, 26, 2016", "CRS, \"The New START Treaty: Central Limits and Key Provisions,\" April 13, 2016", "Factcheck.org, \"Clinton Overstates Nuclear Achievement,\" April 27, 2016", "Factcheck.org, \"Clinton Misrepresents Trump Quote,\" Sept. 13, 2016", "Email interview, Clinton spokesman Josh Schwerin, Sept. 19, 2016", "Phone interview, former Rep. Ellen Tauscher, D-Calif, Sept. 19, 2016", "Email interview, Hans Kristensen, director of the Nuclear Information Project at the Federation of American Scientists, Sept. 16, 2016", "Email interview, Lisa Koch, Claremont McKenna College professor, Sept. 15, 2016", "Email interview, Amy Nelson, Stanton Nuclear Security Fellow at the Council on Foreign Relations, Sept. 16, 2016", "Email interview, Ed Levine, board chair at the Center for Arms Control and Non-Proliferation, Sept. 16, 2016", "Email interview, Steven Pifer, director of the Brookings Arms Control and Non-Proliferation Initiative, Sept. 16, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]