["A viral tweet allegedly sent from the ground of an election night rally for President-elect Donald Trump said that \"thousands\" of his supporters were chanting a racist message. The claim was fake.", "I am at a Trump rally in Manhattan, and thousands are chanting \"We hate Muslims, we hate blacks, we want our great country back\". Disgusting", "As Buzzfeed and others have reported, the tweet was sent from the account of a fake British sports journalist who has a history of making allegations about racist chants in mass crowds.", "Another \"Simon Rowntree\" account was suspended over the summer, but Buzzfeed managed to screenshot his Twitter bio, which said he was a soccer writer for Forest Echo News. The site‘s account has also been suspended but it declared itself to be a parody in its bio, per Buzzfeed’s screenshot.", "The parody news site was the creation of a group of friends who set up fake sports journalist accounts, a person who responded on behalf of Forest Echo News told Buzzfeed. Rowntree is likely a Forest Echo fan jumping on the bandwagon.", "Here are some examples of Rowntree tweets alleging chants of racial epithets at British soccer games from his current account.", "I am at Old Trafford and I can hear racist #MCFC fans chating \"You're just an expensive dabbing golliwog\" at Paul Pogba. This is disgusting.", "Atmosphere at Hampden Park building up. #RFC fans have now started to chant \"Refugee scum, fuck off back to Calais\". Absolutely disgusting.", "Racist chants are not uncommon at British soccer matches, so Rowntree’s tweets are believable though unverified and likely satirical (see Poe’s law for internet parodies).", "As for Rowntree’s allegation about the Trump rally, we have not found video footage or other evidence supporting it.", "Trump held his victory party at the New York Hilton in Midtown Manhattan, which can accommodate 3,300 in its grand ballroom.", "Rowntree claimed the chant began at 7:04 p.m., about 30 minutes after the event had began. According to videos, the crowds were rather subdued around that time.", "News reports indicate Trump supporters inside and outside the Hilton did not get rowdy until about 10 p.m., when projections began favoring Trump as the winner.", "A few dozen — not \"thousands\" — supporters roaming Midtown shouted \"T-R-U-M-P, we will beat Hill-ar-y,\" \"U-S-A\"  and \"CNN sucks\" at about 10:25 p.m., according to Patch New York. And Trump supporters inside the Hilton began to chant \"lock her up\" around 2 a.m., CBS’ Sopan Deb and NBC’s Katy Tur both reported.", "Our ruling", "A viral tweet said, \"thousands\" of people at a Manhattan rally for Trump chanted, \"We hate Muslims, we hate blacks, we want our great country back.\"", "The widely shared claim is baseless, sent from a fake account tied to a parody British soccer news site.", "We rate it Pants on Fire.", "Twitter, Simon Rowntree, Nov. 8, 2016", "Buzzfeed, \"We’re Tracking All The Election Day Rumors, Hoaxes, And Debunkings,\" Nov, 7, 2016", "Buzzfeed, \"There’s A Twitter War Going On Between Rival Groups Of Fake Football Journalists,\" June 16, 2016", "Radio Free Europe, \"Russian Media Duped By Fake British Soccer Journalists' Hooligan Tweets,\" June 15, 2016", "The Guardian, \"Russian media base Euro 2016 violence claims on fake Twitter accounts,\" June 16, 2016", "Sports Joe, \"The curious, very offensive case of Simon Rowntree and the fake site Forest Echo News,\" accessed Nov. 9, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]