["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Beto O’Rourke is not talking about confiscating Americans’ guns  — except for when he is talking about it.", "On Oct. 16 on MSNBC’s \"Morning Joe,\" co-host Joe Scarborough opened an interview with the former Texas congressman by saying:", "\"Tell us about your plan on the confiscation of guns which, obviously, many believe is unconstitutional, also very concerned that it plays right into the hands of Republican candidates.\"", "O’Rourke replied:", "\"To be clear, I’m not talking about confiscating anybody’s guns. But I do think that, for those weapons of war  — AR-15s, AK-47s — these were designed and sold to the militaries of the world to kill people on a battlefield and there are more than 16 million of them in America. And we’ve seen the devastating effect that they can have in Dayton, Ohio, or El Paso, Texas, or Odessa, not too far from where I live. Those must be bought back or else each of them are an instrument potentially of terror in this country.\"", "In reality, O’Rourke’s answer isn’t clear at all. We’ll help you sort out the mental gymnastics.", "In both the El Paso and the Dayton mass shootings, assault-style weapons, legal in both states, were used. Each weapon was semiautomatic — the gunmen could fire as quickly as they could pull the trigger — and carried enough ammunition to potentially kill dozens of people in minutes.", "The El Paso shooter used a semi-automatic Kalashnikov-style rifle (also known as an AK-47-style rifle), which typically uses a magazine that has 30 rounds.", "The Dayton shooter used an AR-15-style pistol, modified to act as a rifle, with a drum magazine that can hold up to 100 rounds.", "At least two times previously, O’Rourke was asked whether he would support confiscation of guns he calls weapons of war. He said yes.", "Sept. 12 Democratic presidential debate", "Co-host David Muir: \"Some on this stage have suggested a voluntary buy-back for guns in this country. You've gone further. You've said, quote, ‘Americans who own AR-15s and AK-47s will have to sell them to the government, all of them.’ You know that critics call this confiscation. Are you proposing taking away their guns? And how would this work?\"", "O’Rourke: \"I am, if it's a weapon that was designed to kill people on a battlefield. ...When we see that being used against children, and in Odessa, I met the mother of a 15-year-old girl who was shot by an AR-15, and that mother watched her bleed to death over the course of an hour because so many other people were shot by that AR-15 in Odessa and Midland (Texas), there weren't enough ambulances to get to them in time, hell, yes, we're going to take your AR-15, your AK-47.\"", "Sept. 18 CNN’s \"Cuomo Prime Time", "Host Chris Cuomo: \"All right, so let's state the proposition. Are you, in fact, in favor of gun confiscation?", "O'Rourke: \"Yes, when it comes to AR-15s and AK-47s, weapons designed for use on a military battlefield. ...So, when it comes to those weapons, Chris, the answer is yes. But when it comes to firearms used for hunting or self-defense, the answer is no.\"", "On the same day as the \"Morning Joe\" interview, CNN \"New Day\" host Alysin Camerota asked O’Rourke: \"How do you plan to get assault weapons away from people who don’t want to give them up?\"", "O’Rourke replied: \"It’s pretty simple. As with any law in this country, we would expect our fellow Americans to follow the law.\"", "Later, Camerota pushed back by saying mass shooters would not follow such a law. Then she said of O’Rourke’s proposal: \"It sounds like confiscation.\"", "O’Rourke replied: \"No, I’m not suggesting that. And I think that’s why people use the word confiscation, because it scares people. What I’m talking about is a mandatory buyback, where Americans who own an AR-15 or an AK-47 will sell that weapon back to the government.", "O’Rourke made similar comments on \"Morning Joe.\"", "Scarborough asked what the federal government would do if owners of AR-15s and AK-47s refused to sell. O’Rourke said:", "\"Just as in any law that is not followed or flagrantly abused, there have to be consequences or else there is no respect for the law. So, in that case, I think there would be a visit by law enforcement to recover that firearm and to make sure that it is purchased, bought back, so that it cannot be potentially used against somebody else.\"", "(Update: We’ve added some additional context from O’Rourke’s statement after initially publishing this fact-check.)", "Asked later in the interview about going door to door to take conventional handguns, O’Rourke said they aren’t as lethal as assault-style weapons and there is a legitimate use of handguns for protection in a home.", "O’Rourke’s campaign website says he is calling for \"a mandatory buyback program for assault weapons and a voluntary buyback program for handguns,\" and that \"individuals who fail to participate in the mandatory buyback of assault weapons will be fined.\"", "\"Beto has been clear that he is talking about a mandatory buyback program for assault weapons, which is not confiscation,\" his campaign told us.", "O’Rourke’s argument that his plan isn’t confiscation ultimately rests on the fact that the government would buy the guns away from its owner. But that’s misleading.", "Gun owners wouldn’t have a say in the matter, and just because they’d be compensated, some likely wouldn’t see the trade in terms of equal value. Owners would be required to sell, and if they didn’t, what happens next is murky.", "O’Rourke says people might be fined, and that they might be somehow compelled to turn their weapons in through the buy-back program. As you game out scenarios how this might play out, they all lead to something that most people would consider confiscation.", "Clearly, many gun owners who legally purchased and own weapons that the government would take would view that as confiscation, even if they were paid for the guns.", "\"It is unreasonable to call what Mr. O’Rourke is proposing anything other than confiscation,\" gun law expert George Mocsary, a law professor at the University of Wyoming, told PolitiFact.", "\"Imagine the situation when an owner of one of the weapons refuses to sell. He or she is issued a fine. The owner still has the weapon, however. Does paying the fine mean that he or she can now keep the weapon and it is perfectly legal?  Certainly not,\" Mocsary said.", "\"There is no scenario under which the owner of one of the designated weapons gets to keep it. That is confiscation.\"", "O’Rourke said: \"To be clear, I’m not talking about confiscating anybody’s guns.\"", "O’Rourke has said \"yes\" and \"hell, yes\" when asked about confiscating assault-style weapons. And his mandatory buyback proposes taking those weapons from people, even if it involves a purchase.", "We rate O’Rourke’s claim that he is \"not talking about confiscating anybody’s guns\" as False.", "YouTube, \"Morning Joe\" interview of Beto O’Rourke, Oct. 16, 2019", "Beto O’Rourke campaign communications director Chris Evans, Oct. 19, 2019", "PolitiFact, \"Sen. Ted Cruz targets PolitiFact; here's our response,\" Sept. 16, 2019", "CNN, \"Cuomo Prime Time\" Beto O’Rourke interview (0:50), Sept. 19, 2019", "Washington Post, transcript of Democratic presidential debate, Sept. 12, 2019", "Email, National Rifle Association media liaison Lars Dalseide, Oct. 18, 2019", "Mediaite, \"CNN’s Camerota Grills Beto on Gun Buyback Proposal: ‘You Expect Mass Shooters to Follow the Law?’\" Oct. 16, 2019", "Email, gun law expert George Mocsary, law professor at the University of Wyoming, Oct. 21, 2019", "BetoORourke.com, \"Combating Gun Violence in America,\" accessed Oct. 21, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]