["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In an election season where President Donald Trump and his supporters are glomming onto any irregularity in hopes of justifying their voter fraud claims, the tale of one Milwaukee flash drive has drawn significant attention.", "Wisconsin has been labeled by some as the tipping point in the 2020 election. And the state swung at about 3:30 a.m. when the city of Milwaukee reported its absentee ballots — which leaned heavily to former Vice President Joe Biden.", "That has brought a lot of attention to the counting and reporting of those Milwaukee votes.", "Gateway Pundit — a far-right website peddling an onslaught of misinformation around Wisconsin and other key states — honed in on a flash drive used to transport votes between two locations on election night, serving up this headline on Nov. 13, 2020:", "\"Developing: Milwaukee Elections Chief Lost Elections Flash Drive in Morning Hours of November 4th When Democrats Miraculously Found 120,000 Votes for Joe Biden.\"", "This article — widely shared on social media — was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook).", "The story rehashes several debunked claims, including that Democrats \"found\" ballots in Wisconsin overnight (they didn’t, this is just when Milwaukee finished counting absentee ballots) and that Milwaukee had an 89% turnout (it didn’t, this is shoddy math).", "But the core of the claim is that the head of the Milwaukee Election Commission lost a flash drive, which they say is shady and imply proves voter fraud.", "Neither element is remotely true.", "Let’s review how we got here.", "In pushing back against claims of voter fraud, election officials in Wisconsin and across the country have noted that human error happens. But it happens in observed, controlled environments in a system that is packed with redundancies and doublechecks to ensure those errors are caught and corrected.", "One such error occurred in Milwaukee.", "Wisconsin Right Now, a newly launched conservative news and opinion site, first reported on Nov. 6 that a flash drive containing Milwaukee votes had been \"briefly lost\" in the early morning hours of Nov. 4. The story added an air of controversy to the proceedings with this line: \"Sources tell Wisconsin Right Now that police on the scene were pressured to stay silent and that police felt threatened by district attorney investigators and election personnel, who were present during the incident and didn’t want them to tell anyone what happened.\"", "This story was then picked up by The Gateway Pundit, which added in references to previously debunked voter claims and piling on additional assertions that Claire Woodall-Vogg, executive director of the Milwaukee Election Commission, was filmed \"feeding totals into a machine in the wee hours of the morning WITHOUT any election observers\" and \"purposely broke all protocol by transferring numbers to a flash drive.\"", "These specific claims are 100% wrong, as is the underlying claim that anything in this circumstance is consistent with fraud.", "We know the story behind this incident because Woodall-Vogg detailed it in a Nov. 9 letter to the Wisconsin Election Commission seeking to set the record straight. She also filled in details in an email to PolitiFact Wisconsin.", "About 3 a.m. Nov. 4, Woodall-Vogg and other city election officials finished counting 170,000 absentee ballots and prepared to bring them to the Milwaukee County Election Commission. That meant putting a flash drive in each of the 12 tabulating machines — used to count ballots — to download the tallies.", "These tabulators are not able to connect to the internet to transmit totals directly, so flash drives have been used to transfer the data from the city’s central count location to the county commission since these machines went into service in 2015.", "Woodall-Vogg gathered the flash drives and went to the commission office — about a mile away — with a police escort, only to discover that she had left the flash drive for Tabulator 7 in the machine. She then called a member of her leadership team, who found the drive in the machine and gave it to a Milwaukee police officer to deliver. About 15 minutes passed from the time Woodall-Vogg realized the drive was missing to when it was delivered.", "Officials confirmed no changes were made to the drive, since the time stamp on the drive and tabulator confirm the downloaded file hadn’t been altered. And the flash drive’s detailed vote tallies matched those on the machine.", "In any case, there’s no reasonable way the drive could have been altered in that span, Woodall-Vogg said.", "\"The machine is not able to be accessed from a distance, so it seems completely unfeasible to think that someone would alter a flash drive’s results, which had between 12k-15k votes on it, but still maintain the vote counts by ward to be accurate,\" she said in an email. \"Staff were in the room (with the drive) the entire time, the live stream was still streaming, and the flash drive remained in the machine the entire time.\"", "Woodall-Vogg also noted the two claims added by Gateway Pundit’s account are baseless. She wasn’t \"feeding totals into a machine,\" she was simply downloading results from the machine that ballots had been fed into throughout the day. And she didn’t break any protocol by transferring the numbers to the drive, she was following standard procedure since flash drives are required to get totals off the tabulator.", "Milwaukee uses DS450 and DS850 model tabulators, which don't have modems that allow direct connections to the Internet, Woodall-Vogg said in an email.", "And the fundamental claim that the drive is connected to the wee hours shift to Biden is ridiculous. That jump was both expected and legitimate, as it’s simply when officials finished counting Milwaukee’s absentee ballots.", "Absentee ballots in Wisconsin were long expected to lean heavily Democratic, and Milwaukee as a whole is a longtime Democratic stronghold. What’s more, the totals and percentages were in line with past results. Biden picked up his winning margins in the suburbs and other parts of the state, not the city of Milwaukee itself.", "And we should note Republican lawmakers are the reason the absentee votes were reported so late. They refused to act on a request from a bipartisan group of local clerks that they be allowed to begin processing absentee ballots before Election Day. Milwaukee was one of 39 communities that set up a central count location, which is why the totals were reported together once the counting was complete.", "Reid Magney, spokesman for the bipartisan Wisconsin Elections Commission, told Wisconsin Watch, \"We are confident that there are no issues with the election results in Milwaukee.\"", "A website claims a lost flash drive in Milwaukee is connected to \"When Democrats Miraculously Found 120,000 Votes for Joe Biden.\"", "The word \"flash drive\" is about the only truth in this claim. It’s a stretch to call it lost since it was under the supervision of election officials when it was unintentionally left behind.", "And it’s absurd to connect this flash drive to a jump in Biden votes. Those votes were from absentee ballots that were long expected to strongly favor Biden. We know the drive in question wasn’t altered since the timestamp on the data copied to it matched the original transfer, and the vote totals on it matched those recorded by the machine.", "We rate this claim Pants on Fire!", "Gateway Pundit, Developing: Milwaukee Elections Chief Lost Elections Flash Drive in Morning Hours of November 4th When Democrats Miraculously Found 120,000 Votes for Joe Biden, Nov. 13, 2020", "Email exchange with Claire Woodall-Vogg, Nov. 16, 2020", "Letter from Claire Woodall-Vogg, Nov. 9, 2020", "PolitiFact Wisconsin, No, Wisconsin voter turnout did not jump from 67% in 2016 to 89% in 2020, Nov. 5, 2020", "USA TODAY, Fact check: That spike in the Wisconsin vote tally was expected and legitimate, not fraud, Nov. 4, 2020", "Wisconsin Right Now, Milwaukee Elections Head Misplaced Crucial Voting Flash Drive [EXCLUSIVE], Nov. 6, 2020", "Wisconsin State Journal, Misplaced Milwaukee flash drive morphs into false reports of election fraud, Nov. 13, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]