["Since President Donald Trump's COVID-19 diagnosis and hospitalization, health care professionals have voiced concerns regarding his broad medical regimen, which include steroid dexamethasone and Gilead's remdesivir. One treatment in particular, an experimental antibody drug from Regeneron Pharmaceuticals, is drawing criticism on social media.", "\"So it turns out the monoclonal antibodies Trump is on are from fetal stem cells. So Trump is being treated/saved with dead babies,\" reads a Twitter post shared on the Facebook group Dogs for Democracy.", "The tweet goes on to call out Republicans,  Supreme Court nominee Judge Amy Coney Barrett and anti-abortion activists.", "Fact or fiction:We're fact checking the news and sending it to your inbox. Sign up to get that here.", "A follow-up tweet containing a link to Regeneron's official position statement on stem cell research is provided as evidence for the claim.", "While the Facebook post sharing the tweet has not received significant attention on the platform, it has gone viral on Twitter, gaining more than 347,000 likes and 107,000 retweets; similar tweets have also gone viral, including one from Rep. Ted Lieu, D-Calif.", "USA TODAY has reached out to the administrators of the Dogs for Democracy Facebook group for further comment.", "When the human body is invaded by a foreign pathogen – be it a bacterium, virus, fungus or parasite – Y-shaped proteins called antibodies are formed. They circulate through the body to sequester and alert other immune chemicals and cells to destroy the pathogen, much like a search-and-destroy system.", "Antibodies form the basis of \"adaptive\" immunity because they are genetically engineered, in a sense, by the body to recognize certain pathogens. This genetic engineering occurs within white blood cells called B cells, which manufacture and display the proteins on the cell surface, by way of genes rearranging like a set of numbers rearranging to form different sequences or patterns.", "Because this rearrangement is random, there is no telling what kind of specificity an antibody will exhibit or whether it will be biologically useful. Only if a B cell meets the right pathogen at the right time will it then activate and secrete its bespoke antibody. The activated B cell will also go on to clone itself through a process called clonal expansion, which helps mount an effective immune response by spawning vast quantities of antibody and memory B cells (B cells which will remember the encounter for any future run-ins) as well as activating other immune cells.", "Regeneron's experimental antibody \"cocktail,\" known as REGN-COV2, is a combination of two monoclonal antibodies (monoclonal referring to a specific B cell clone). These antibodies, REGN10933 and REGN10987, are engineered to lock on to SARS-CoV-2's spike protein, preventing it from interacting with its target on the host cell surface, the ACE2 receptor.", "REGN-COV2 began its first clinical trial in June and is now in four late-stage clinical trials estimated to recruit at least11,000 participants combined, according to Genetic Engineering and Biotechnology News.", "The antibody therapy has so far shown it's able to reduce SARS-CoV-2 viral loads and disease in experiments with golden hamsters and rhesus macaques. Findings presented last month from Regeneron's preliminary experiments in nonhospitalized, SARS-CoV-2 positive patients – ranging from asymptomatic to moderate cases – also showed reduced viral loads. However, more studies are needed to see how truly effective REGN-COV2 will be.", "Fact check:Satirical post falsely claims Trump would be fine if he hadn't gotten tested", "Fact check:Trump's hospital records, weight have not been released", "Alexandra Bowie of Regeneron told news aggregation platform Heavy in an October email that REGN-COV2 was not made with human embryonic stem cells.", "\"This particular discovery program (REGN-COV2) did not involve human stem cells or ESCs,\" Bowie wrote.", "The statement shared on Twitter is simply Regeneron's official position on stem cell research in general and bears no relation to, or explanation of, how REGN-COV2 is made. Bowie also confirmed this with Heavy.", "It is unclear why Regeneron released an official statement in April. In an email to USA TODAY, Bowie did not clarify the timing, only alluding to the fact it was a common practice among pharmaceutical companies and that Regeneron sought transparency.", "\"Like many biopharma companies that conduct scientific research (see Pfizer, J&J, for instance), we have a general position statement on stem cell use,\" Bowie said. \"We share this and other similar statements in the interest of transparency and to help educate people on the steps we take to conduct our business responsibly.\"", "While REGN-COV's monoclonal antibodies do appear to be derived from a B cell line isolated from a human donor who recovered from SARS-CoV-2 and an immunized mouse engineered to have a human immune system, USA TODAY did note a fetal-derived cell line mentioned in Regeneron's early research.", "In supplementary material to a paper published in June in the journal Science, HEK293T cells – an immortalized epithelial cell line (cells not normally immortal but altered to be so via spontaneous mutation or in the lab) derived from embryonic kidney cells obtained in 1972 – were described as \"briefly\" used to create SARS-CoV-2-like viral particles to test mouse and human-derived antibodies against.", "Bowie affirmed HEK293T cells were used but reiterated stem cells were not.", "\"This particular discovery program (REGN-COV2) did not involve human stem cells or ESCs,\" she wrote. \"The 293T cell line was originally derived from human embryonic kidney cells but is an immortalized epithelial cell – so not a stem cell. These cells were transfected and used in production of a ‘pseudoparticle’ that mimics the virus’ Spike protein and allowed us to test neutralization ability of our antibodies against the virus.\"", "Fact check:Satirical post falsely claims COVID-19 is no worse than the flu and affects virtually no one", "We rate this claim FALSE because it is not supported by our research. The experimental antibody therapy Trump received was not directly made from fetal or embryonic stem cells, rather antibodies obtained from SARS-CoV-2 human survivors and immunized mice engineered with a human immune system. Regeneron's official statement released in April, cited on Twitter as a basis for the claim, is a general position on stem cell research and is unrelated to how the antibody therapy is actually made. However, an embryonic-derived cell line, albeit not a stem cell, does appear to have been involved at least in the early stages of Regeneron's testing process, according to supplementary material published in June. The HEK293T cells used are an immortalized cell line derived from embryonic kidney cells but are not stem cells themselves.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]