["On December 2, The Indian Express reported that Abdul Rashid Shora, biological father of activist Shehla Rashid, wrote to J&K DGP Dilbag Singh alleging that his daughter took Rs 3 crore from Kashmiri businessman Zahoor Ahmad Shah Watali for joining the Jammu and Kashmir People’s Movement. The report also added that in October, a district court in Srinagar restrained Shora from entering his house following a domestic violence complaint by his family members.", "India Today aired a bulletin on the topic on December 1. At the 3:51-minute mark, the following text is prompted on the screen, “Arrested in 2016 JNU sedition case”.", "In February 2016, an event was held on Jawaharlal Nehru University campus against the “judicial killing of Afzal Guru and Maqbool Bhat”. This led to a confrontation between the various student groups on campus. Kanhaiya Kumar, Umar Khalid and Anirban Bhattacharya were arrested by the police but later awarded regular bail by the Delhi court. The case pertains to the alleged raising of “anti-national” slogans at the protest.", "In January 2019, The Hindu reported that Kumar, Khalid and Bhattacharya were charge-sheeted under IPC Sections 124A [sedition], 323 [voluntarily causing hurt], 465 [forgery], 471 [using as genuine, forged document], 143 [punishment for unlawful assembly], 149 [unlawful assembly with common object], 147 [rioting], 120B [criminal conspiracy] by Delhi police. As per the report, the charge sheet consists of other names, including Rashid’s. But due to lack of sufficient evidence against them, these names were jotted down in a separate column in the charge sheet.", "Earlier this year, the Delhi government gave permission to prosecute Kanhaiya Kumar in the case.", "Rashid is frequently targetted with misinformation on social media. The latest being, India Today falsely stating that she was arrested in the JNU sedition case.", "On December 2, Rashid tweeted refuting the channel’s claim. “Dear @IndiaToday I’ve never been arrested. Facts, please! Thank you,” she wrote.", "Dear @IndiaToday I've never been arrested. Facts, please! Thank you. pic.twitter.com/LrowjSZAKv", "— Shehla Rashid (@Shehla_Rashid) December 2, 2020", "Speaking with Alt News, she said, “As a student leader, I have been detained by the police on multiple occasions with other protestors. But to report that I was arrested in the 2016 JNU sedition case is false. I have never been arrested in my life.”", "We also spoke with Sarim Naved, a Delhi-based lawyer who represents Rashid. He who said, “I can confirm that she has not been arrested in the JNU sedition case, or for that matter, any other case.”", "In October 2016, The Indian Express uploaded a video that shows Rashid and others being detained. Last year, this video was also shared with the false claim that Rashid was arrested. This was debunked by Boomlive.", "“The Indian law allows for detention for a reasonable time for the purpose of carrying out an investigation or to ensure that a person does not obstruct the functioning of the law and order machinery. An arrest is when the police decide that a person has to be in custody. The person then has to be produced within 24 hours to the nearest magistrate and it is only the magistrate who can remand the accused either to police custody or to judicial custody, i.e. jail. To put it simply, a person cannot be detained for more than 24 hours. If the idea is to hold somebody for more than 24 hours, the police will have to make an arrest and produce the arrested person before a magistrate,” explained Naved.", "India Today, therefore, carried a misreport that Shehla Rashid was arrested in the 2016 JNU sedition case. Since then numerous people, including Rashid, have pointed out that the news is false, yet India Today has neither apologised for the error nor taken down the broadcast.", "Alt News has documented multiple instances where India Today has put out misinformation in the past.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]