["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In March 2020, a rumor started to circulate on social media claiming that the world has been using a vaccine for coronavirus on cattle for years, and that the current panic about a growing COVID-19 pandemic was being overblown by the media:", "However, as of this writing, no vaccine currently exists for the novel coronavirus that causes the COVID-19 disease.", "The confusion seems to stem from a misunderstanding of the word \"coronavirus.\" While this word was frequently used in the early days of the COVID-19 pandemic to describe the virus that causes the new disease, \"coronavirus\" is actually a broad term that refers to a group of viruses.", "The Centers for Disease Control and Prevention (CDC) writes:", "\"Coronaviruses are named for the crown-like spikes on their surface. There are four main sub-groupings of coronaviruses, known as alpha, beta, gamma, and delta.", "\"Human coronaviruses were first identified in the mid-1960s. [There are] seven coronaviruses that can infect people...\"", "The above-displayed photograph does show a real vaccine used to treat bovine coronavirus. This vaccine, however, is not effective in humans or against the new strain of coronavirus that emerged at the end of 2019.", "This product, called ScourGard 4K, is for the \"vaccination of healthy, pregnant cows and heifers as an aid in preventing diarrhea in their calves caused by bovine rotavirus (serotypes G6 and G10), bovine coronavirus, and enterotoxigenic strains of Escherichia coli having the K99 pili adherence factor.\"", "Ming Tan, a faculty member of the Division of Infectious Diseases at Cincinnati Children's Hospital Medical Center, told PolitiFact that:", "The coronavirus used in the Bovine Rotavirus-Coronavirus Vaccine is distinct from the current coronavirus.", "\"The antibodies produced by the Bovine Rotavirus-Coronavirus Vaccine will not recognize the current \"coronavirus\" and thus will not protect humans from infection.\"", "Although the disease at the center of the COVID-19 pandemic was often referred to as simply \"coronavirus\" in the early days of 2020, a more scientific name has since emerged. According to the World Health Organization, the virus is called SARS-CoV-2 (severe acute respiratory syndrome coronavirus 2) and the disease is referred to as COVID-19.", "To sum up: The word \"coronavirus\" refers to a group of viruses, not one specific pathogen. A vaccine that is developed for a particular strain of coronavirus, such as bovine coronavirus, SARS, or MERS, is not necessarily going to be effective against other variations in this group. At the moment, no vaccine exists for SARS-CoV-2. For these reasons, we rate this claim \"False.\"", "Reuters.   \"Partly False Claim: Cattle Vaccine for Coronavirus Has Been Around 'For Years,' Media Dishonest About Recent Outbreak.\"\r\n    12 March 2020.", "Kertscher, Tom.   \"Bovine Coronavirus Vaccine Won’t Help Humans.\"\r\n    Politifact.   2 March 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]