["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Most economist agree that hefty tax cuts and more government spending have –– at least in the short run –– boosted America’s economy. Christine Lagarde, head of the International Monetary Fund, said policy makers have another lever they could pull.", "Women, she said, are a phenomenal source of growth.", "\"In the United States, if there was equal participation of women in the labor market, GDP would be up by 5 percent,\" Lagarde said on CBS’ Face the Nation Dec. 9.", "We wondered, how solid is the method behind the 5 percent prediction?", "Adding millions of people to the workforce would give the economy a shot in the arm.", "The formula behind the 5 percent is simplistic.", "Key factors, such as how quickly the change happened, would lead to very different economic results in the near term.", "We asked the IMF for Lagarde’s supporting data and didn’t hear back. But a 2012 article from Booz, an accounting and consulting firm now owned by Price Waterhouse Cooper, made the case, and many groups have cited it ever since.", "\"Our own estimates indicate that raising female employment to male levels could have a direct impact on GDP of 5 percent in the United States,\" the authors wrote.", "How did they get there?", "The Booz article, sponsored by a women’s advocacy fund, said that GDP per person is the result of productivity, the number of hours worked, the fraction of people of working age in the population as a whole, and the fraction of people actually working.", "Simple math dictates that if you increase the last variable, you get a higher GDP per person. The analysis factored in a couple of adjustments that brought the result down for large numbers of women getting into the job market. New workers would have less experience and be less productive. And given the demands of caring for children, many women, the authors said, would choose to work part-time.", "But even with those analytic haircuts, the results were still impressively positive.", "Government surveys tell us that the fraction of American women in the workforce is 57 percent. For men, the number is 69.1 percent. Today, about 75 million women are either working or looking for work. To bring that up to the labor participation rate of men, there would need to be 91 million, or an additional 16 million women ready and able to work.", "The fraction of women in the workforce grew rapidly for decades, but in the past 20 years, it has largely leveled out.", "Development economists told us that broadly speaking, the report makes the valid point that adding a lot of women to the workforce would boost the economy. Beyond that, the results are dodgy.", "\"It is essentially a back-of-the-envelope calculation, used by others to arrive quickly at numbers for advocacy's sake,\" Elizabeth King, an economist and senior fellow with the Brookings Institution. \"Would I put my bet on the numbers?  Not likely.\"", "King said the study’s formula is static and failed to look at important ripple effects, such as whether men might change their own labor habits if their wives entered the job market. The formula didn’t account for how wages might fall with so many new workers.", "Betsey Stevenson, associate professor of economics at the University of Michigan, said the article skips over how long it would take for the economic impact to play out.", "\"The 5 percent number is saying this is what GDP will be once they are all working compared to now, but is silent on how long it will take, precisely because that's almost impossible to predict,\" Stevenson said.", "Stevenson observed that the participation rate for women has barely changed since 1990. One likely constraint is the limited options for affordable child care, she said. Even if the country moved to fix that, there would be a lag.", "\"It would take a few years for that policy change to fully raise female employment and thus impact GDP,\" she said.", "Whatever the weaknesses of the analysis behind Lagarde’s statement, a rising fraction of working women helped drive growth in the United States.", "Janet Yellen, former head of the Federal Reserve, weighed in during a speech in 2017.", "\"Between 1948 and 1990, the rise in female participation contributed about half a percentage point per year to the potential growth rate of real gross domestic product,\" Yellen said at a conference at Brown University.", "The impact at the end of that period was particularly strong, Stevenson said.", "\"In the 1970s and 1980s, 20 percent of GDP growth was due to women's increased work –– both increasing participation and hours worked,\" she said. \"That means that GDP today is roughly 13 percent bigger than it would be if women still worked like they did back at the start of the 1970s.\"", "Stevenson faulted the study in its details but said it was roughly right on the scale of the impact of new women workers.", "Lagarde said if women were in the American workforce at the same rate as men, the country’s GDP would be up by 5 percent. The likely source is a 2012 article that used a simple formula to yield the 5 percent result.", "Two economists told us that the article’s approach skipped over several key factors, such as how quickly GDP would change and how the entry of millions of new women workers might change other aspects of the labor market and put a drag on economic growth.", "But in the end, it is generally accurate that if millions of women got into the job market, the economy would grow more than if they didn’t.", "We rate this claim Half True.", "CBS News, Face the Nation, Dec. 9, 2018", "Booz & Co., Empowering the Third Billion: Women and the World of Work in 2012, 2012", "U.S. Bureau of Labor Statistics, Women in the labor force: a databook, April 2017", "U.S. Bureau of Labor Statistics, Employment status of the civilian noninstitutional population by age, sex, and race, 2017", "U.S. Bureau of Labor Statistics, Civilian labor force participation rate, November 2018", "Board of Governors of the Federal Reserve System, So We All Can Succeed: 125 Years of Women's Participation in the Economy, May 5, 2017", "Boston University, The Female Labor Force and Long-run Development: The American Experience in Comparative Perspective, November 2013", "St Louis Federal Reserve, GDP change 1930-2017, July 27, 2018", "Harvard Business Review, More Women in the Workforce Could Raise GDP by 5%, Nov. 1, 2012", "S&P Global, Adding More Women To The U.S. Workforce Could Send Global Stock Markets Soaring, 2017", "McKinsey Global Institute, How advancing women’s equality can add $12 trillion to global growth, September 2015", "Email interview, Elizabeth King, senior fellow, Center for Universal Education, Brookings Institution, Dec. 11, 2018", "Email interview, Betsey Stevenson, associate professor of economics, University of Michigan, Dec. 11, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]