["About this rating", "In late May 2018, a Brazilian artist poking fun at First Lady Melania Trump found got a surprise when he discovered that a joke he had written had mutated as it circulated online beyond his control — and in some cases, it was treated as a legitimate sign of distress on her part.", "On 31 May 2018, Felipe Sobreiro posted:", "Wait a minute pic.twitter.com/V7S93anMFB", "— Felipe Sobreiro (@therealsobreiro) May 31, 2018", "Sobreiro posted the four-line tweet — arranged so that the first letter on each line spelled out the word \"HELP\" in capital letters — a day after Trump responded to speculation regarding her whereabouts with a brief statement online:", "I see the media is working overtime speculating where I am & what I'm doing. Rest assured, I'm here at the @WhiteHouse w my family, feeling great, & working hard on behalf of children & the American people!", "— Melania Trump (@FLOTUS) May 30, 2018", "Sobreiro's joke was subsequently retweeted and highlighted hundreds of thousands of times. It was then disseminated without his name attached to it, further suggesting that it had legitimately been posted by the First Lady as an actual cry for help:", "For his part, Sobreiro has not tried to pass his post off as an actual Trump tweet. On 1 June 2018, he wrote:", "If you're a new follower since yesterday, I hope it's because you think I'm funny (or you like my art!). If you do it because you think I broke out an actual conspiracy... Oh boy.", "He also told us via e-mail that he was surprised by the amount of traction the tweet gained online:", "I've tweeted jokey posts like this before but nothing has exploded in such a huge way. I just did a spin on what was already being broadly tweeted about Melania's recent absence and her odd statement saying she was OK. I haven't been able to read reactions closely because they've been pouring in very fast, but whenever someone seems to comment that my post was real, or saying it was \"fake news\", I felt kind of sad that they missed the joke.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]