["About this rating", "A photograph supposedly showing a confusingly named food product, Vegetarian Ham: Chicken Flavour, is frequently shared online with various jokes about this product's purported taste:", "While the picture may have inspired some bemused befuddlement, this is a genuine product from Lamyong Vegetarian Health Food.", "According to the product page, this vegetarian food product comes in three different flavors — chicken, bacon, and original — and is soy-based. Lamyong writes:", "Lamyong Vegetarian Ham is a tasty and convenient vegetarian food ingredient loved by all in the family! Comes in 3 different flavours, Original, “Chicken” and “Bacon”.", "Ingredients: Water, vegetable oil, textured Soy Protein (27%), whey protein, wheat flour, salt, soy sauce, vegetarian seasonin.", "While chicken-flavored vegetarian ham may seem to cause an oxymoronic overload for some readers, meatless meat products are becoming increasingly popular. Meat still reigns supreme, but major restaurant chains such as Burger King and McDonald's are adding plant-based burgers to their menus, and grocery stores have seen an increase in meatless meats during the COVID-19 pandemic.", "The Verge reported:", "Grocery store sales of products like Beyond Meat and Tofurky were up 264 percent during a nine-week period ending on May 2nd, according to Nielsen (via The Wall Street Journal). Overall, retail sales plunged 16.4 percent from March to April. The popularity of faux meat exploded starting in March, with sales of fresh meat alternatives surging 206 percent the first week of March and rising 279 percent the week ending on March 14th, according to Nielsen.", "Plant-based meat products still lag behind their animal-based counterparts in terms of market size. The 264 percent uptick of faux meat sales represented an increase of $25.7 million, while fresh meat sales — up only 45 percent during the same period — saw a $3.8 billion total increase. That’s despite production of meat products declining 28 percent year over year, according to the US Food and Drug Administration.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]