["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The image isn’t from the purported Hunter Biden laptop. It was published online in late 2019 in a story about an alleged relationship between Paul Pelosi Jr. and a woman named Karena Feng.", "The photo doesn’t show abuse or drugs. The girl appears to be Feng’s daughter, who isn’t tied up and is cutting a cake.", "Social media misinformation is trying to implicate relatives of powerful Democrats in the saga about a recovered computer hard drive. One post shared on Oct. 26 shows Paul Pelosi Jr., the son of House Speaker Nancy Pelosi, in an image with what appears to be a young Asian girl with bandages on her arms.", "The caption reads: \"Just Nancy Pelosi’s son with a tied up Asian girl doing lines of coke. Found on Hunters laptop. WAKE --- ---- UP.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This is wrong. The photo is not new and didn’t originate from Hunter Biden’s laptop. The girl isn’t tied up, and there are no drugs in the photo.", "The image was posted online in November 2019, as part of a series of articles by a conservative website called National File. The stories detail an alleged relationship between Pelosi Jr. and a woman named Karena Feng, who is identified in the stories as a \"Taiwan-born woman living in San Francisco.\"", "The photo is one of many in the story that appears to depict Pelosi Jr. with Feng’s children. It shows the girl is cutting a cake with material wrapped around her elbows and wrists. She is not tied up.", "We haven’t been able to review or verify the contents of the laptop hard drive allegedly belonging to Hunter Biden because the data has not been seen, at least not widely. Allies of President Donald Trump who say they have it — particularly Rudy Giuliani, President Trump’s personal lawyer who procured the laptop — have declined to share the data with other outlets for review.", "We rate the social media post about Pelosi’s son False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Oct. 26, 2020", "Reverse-image search, Oct. 27, 2020", "National File, EXCLUSIVE: FBI Hunts For Information on Paul Pelosi Jr. As Family Business Dealings Come Under Fire, Dec. 9, 2019", "PolitiFact, A look behind the NY Post headline about Joe Biden and a Ukraine meeting, Oct. 15, 2020", "Lead Stories, Fact Check: Photo Does NOT Show Nancy Pelosi's Son Abusing A Little Girl -- And Is NOT from Purported Hunter Biden Laptop, Oct. 26, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]