["The video, which is around 35 seconds long, has been viewed more than 89,000 times in this post published to Facebook April 11, 2019 -- the same day that voting began in the 2019 Indian elections.", "Here is an AFP story published April 11 about the opening of the polls.", "The video shows electronic voting machines, or EVMs, being smashed and set on fire by a group of people. Here is an information page about EVMs on the website of India’s election commission.", "The post’s Hindi-language caption says, translated to English: “Polling is on for the first phase of elections in India, polling officials are saying that votes are going in favour of the BJP despite whatever buttons you push. People smashed EVM out of anger.”", "Below is a screenshot of the misleading post, which also contains two stills from the video:", "BJP refers to Prime Minister Narendra Modi’s ruling Bharatiya Janata Party. Here is the party’s Twitter account.", "The video has also been shared elsewhere on Facebook with the same caption, for example in this post also published April 11 and shared nearly 2,000 times since.", "It has also been shared on Facebook here and here, on Twitter here and on YouTube here – all published on or after April 11 – alongside similar claims.", "A reverse image search on Yandex using keyframes from the video obtained using digital verification tool InVid found that the clip was not filmed during the first phase of the 2019 Indian election but is two years old.", "The exact same video was published in this report, dated April 12, 2017, on the website of Indian news channel NDTV.", "The headline says: “In Srinagar Video From Sunday, Mob Smashes And Burns EVMs; Re-poll Tomorrow.”", "Below is a screenshot of the NDTV report, which says 33 EVMs were set on fire:", "The first paragraph of the report says: “Fresh polling will be held tomorrow in parts of Srinagar in Jammu and Kashmir, where a by-election on Sunday saw huge violence as mobs targeted polling booths amid a poll boycott call by separatists.", "“They burned electronic voting machines or EVMs and clashed with security forces in at least 200 incidents of violence. Eight civilians were killed and about 100 security personnel were injured.”", "The violence was also reported on the websites of major Indian dailies, for example here by The Times of India, here by Hindustan Times and here by The Hindu.", "Below is an image comparing screenshots of the video in the misleading Facebook posts (L) and of the video in the media reports from 2017 (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]