["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Candidate for governor Mike McCabe says Wisconsin lagging in internet speed among states.", "Is your internet really as slow as you think it is?", "Democratic gubernatorial candidate Mike McCabe claims Wisconsin ranks 49th in the country for internet speed.", "\"How are we going to compete in a 21st century economy, and how are people gonna fully participate in modern American life if we’re 49th in the country for internet speed?\" McCabe said in an April 18, 2018, edition of the NewsTalk podcast.", "McCabe is one 10 Democrats seeking to take on Gov. Scott Walker in the 2018  election. McCabe, a political activist, is running on a platform of \"principle over party.\"", "While we were waiting for the latest cat video to buffer, we decided to check out his claim.", "A look at the numbers", "When asked for backup, McCabe pointed to a 2016 Milwaukee Journal Sentinel article which cited a study that ranked Wisconsin as 49th for fixed broadband internet speed. Fixed broadband  encompasses landlines, desktops and laptops -- basically everything except mobile connections.", "So, McCabe made a broad statement about internet speed, but cited data that looks at only part of the picture -- and ignores a major chunk of internet use.", "To be sure, the 2016 Speedtest ranking McCabe cited did rank Wisconsin 49th, with a speed of 28.59 megabits per second, when it comes to just broadband speed. But if you look just at mobile, Wisconsin ranked much higher, at 15th place.", "The study did not include an average of broadband and mobile, but more recent data from Akamai’s 2017 State of the Internet Report, issued in the first quarter of 2017, did combine data from both. That ranking placed Wisconsin 30th for average overall internet speed.", "We asked University of Wisconsin-Madison telecommunications professor emeritus Barry Orton about McCabe’s claim. He said all data on the subject is a bit fuzzy, but said Wisconsin traditionally does not do as well as other states in terms of average speed.", "\"Traditionally, WI has been ranked very low compared to other states, primarily because there are so many rural areas in Wisconsin with almost no internet service,\" Orton said.", "Walker campaign spokesman Austin Altenburg said Walker has done extensive work to boost and strengthen Wisconsin’s broadband system, including creating a $7.68 million dollar grant, the largest in state history, to support broadband expansion.", "According to Altenburg this grant will provide 1,600 business locations and 18,000 residential locations with high-speed internet.", "When we told McCabe what we found, he promised to adjust his claim in the future. He said his main point was that Wisconsin’s goal should be to have high-speed internet access everywhere.", "Our rating", "McCabe claimed that Wisconsin ranks 49th in internet speed.", "A 2016 ranking put Wisconsin at 49th-slowest for broadband internet speed -- that is, for land-based internet, but that only provides a partial picture.", "When mobile is factored in, the state ranks much higher, in the neighborhood of 30th place.", "We rate McCabe’s claim Half True.", "Newstalk 1510am, Mike McCabe (D), WI Gubernatorial Candidate, April 18, 2018, claim at 2:40 mark.", "Milwaukee Journal Sentinel, \"Wisconsin broadband speeds lagging,\" August 9, 2016.", "Speedtest, \"Market Report,\"August 3, 2016.", "Akamai’s State of the Internet, \"Connectivity Report,\" Q1 2017.", "Phone, Barry Orton, University of Wisconsin-Madison professor emeritus telecommunications, professional development and applied studies, June 6, 2018.", "Email, Austin Altenburg, Press Secretary for Governor Scott Walker, June 7, 2018.", "Scott Walker Office of the Governor, \"Governor Walker announces $7.68 million in preliminary broadband expansion grants to connect 46 rural communities\", April 12, 2018.", "McCabe Principle Over Party, \"High-speed internet everywhere in Wisconsin in 5 Years Under McCabe plan,\" April 17, 2018.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]