["A woman prepares a dose of the Moderna COVID-19 vaccine. (AP Images)", "Gates was asked in July about 80% of the people in an early trial of Moderna’s COVID-19 vaccine reporting “systemic” side effects such as severe chills and fever.", "Gates did not say that 80% of people who took that vaccine experienced significant side effects.", "A U.S. Food and Drug Administration report in December said 0.5% of 15,184 people who received the Moderna vaccine experienced a “severe adverse event.”", "No, Bill Gates, one of the world’s leading proponents of COVID-19 vaccinations, did not say that 80% of the people who took the Moderna vaccine suffered significant side effects.", "Nevertheless, this claim was widely shared on Facebook:", "\"80% of People Taking The #Maderna Vaccine Had Significant Side-Effectives Via #BillGates.\"", "The post, which relies on a misleading video clip from comedian and podcast host Joe Rogan, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "It’s not uncommon for some people receiving the two-dose Moderna regimen to report pain in the arm that received the shot, or feeling tired or sick for a day or so, particularly after the second dose.", "But Gates did not say that 80% of people receiving the Moderna vaccine experience significant side effects. And reports of \"severe adverse events\" associated with the Moderna vaccine are extremely rare.", "The Facebook post includes video from a Rogan podcast in which Rogan recalls that Alex Jones, who runs a website that has published fake news and conspiracy theories, told him on a previous podcast that \"80% of the people that took the Moderna vaccine had significant side effects, particularly after the second dose.\"", "Rogan says that after he received pushback about Jones’ claim, \"I played the Bill Gates clip where Bill Gates is being interviewed by CBS and he says it himself.\"", "But Gates didn’t say that in the excerpt that Rogan played. In fact, he didn’t say it at any point in the CBS interview.", "Here’s that portion of CBS anchor Norah O’Donnell’s interview with Gates, which was done in July.", "O’Donnell: \"You mentioned side effects. The side effects for the Moderna vaccine sound concerning. We looked. After the second dose, at least 80% of participants experienced a systemic side effect, ranging from severe chills to fevers. So, are these vaccines safe?\"", "Gates: \"Well, the FDA, not being pressured, will look hard at that. The FDA is the gold standard of regulators and their current guidance on this, if they stick with that, is very, very appropriate. The side effects were not super-severe; that is, it didn’t cause permanent health problems. Moderna did have to go with a fairly high dose to get the antibodies. Some of the other vaccines are able to go with lower doses to get responses that are pretty high, including the\" Johnson & Johnson and Pfizer vaccines. …", "O’Donnell: \"But everybody with a high dose had a side effect.\"", "Gates: \"Yeah, but some of that is not dramatic, where it’s just super-painful. But, yes, we need to make sure there’s not               severe side effects. The FDA, I think, will do a good job of that, despite the pressure.\"", "The post is also misleading in that its video includes two other misleading clips.", "As Gates is heard speaking in the CBS interview, clips roll showing two women. No audio is played with those clips and no other description of them is given.", "One shows a Tennessee nurse who became dizzy and was assisted to the ground after getting the Pfizer vaccine. She recovered and later said that she regularly feels dizzy after experiencing any kind of pain, even after stubbing a toe.", "The other clip is of an Indiana woman seated in a hospital bed shaking. She had claimed in viral videos in January that she suffered from uncontrollable shaking after taking the first round of the Moderna vaccine. Doctors at a neuroscience hospital told the woman her problem was likely stress-related, her fiance told an Indiana newspaper.", "So, where might the 80% figure claimed in the post have originated?", "In July, about a week before Gates’ CBS interview, the New England Journal of Medicine published a preliminary report on a trial involving 45 healthy adults who were given two doses of the Moderna vaccine, 28 days apart. They were divided into three groups of 15, with each group receiving a different dose level.", "In an article about that report, Wired magazine said: \"By the time they’d had two doses, every single one was showing signs of headaches, chills, or fatigue, and for at least 80%, this could have been enough to interfere with their normal activities.\"", "Moderna later submitted data from a large trial to the U.S. Food and Drug Administration. A December FDA report said that out of 15,184 people who received the vaccine, 82 had a serious adverse event, such as death, heart attack or pneumonia — fewer than 0.5%.", "That was the same level for the placebo group. There was no indication the vaccine caused any of the serious events.", "The most commonly reported side effects of the Moderna vaccine, which typically lasted several days, were pain at the injection site, tiredness, headache, muscle pain, chills, joint pain, swollen lymph nodes in the same arm as the injection, nausea and vomiting, and fever, according to the FDA. More people experienced those side effects after the second dose.", "There is a remote chance that the vaccine could cause a severe allergic reaction, the FDA says.", "A Facebook post claimed: \"80% of people taking the Moderna vaccine had significant side effects, via Bill Gates.\"", "Gates was asked in July about 80% of the people in an early trial of Moderna’s COVID-19 vaccine reporting \"systemic\" side effects such as severe chills and fevers. He did not say that 80% of people who got that vaccine experienced significant side effects.", "An FDA report in December said 0.5% of 15,184 people who took the Moderna vaccine experienced a \"severe adverse event.\" That was the same level for the placebo group. There was no indication the vaccine caused any of the serious events.", "We rate the post False.", "Facebook post, March 18, 2021", "CBS News, Bill Gates interview (15:30), posted July 23, 2020", "PolitiFact, \"The ‘shaking’ COVID-19 vaccine side-effect videos and what we know about them,\" Jan. 20, 2021", "PolitiFact, \"Video shared on Facebook inflates risk of Moderna vaccine 40-fold,\" Dec. 18, 2020", "PolitiFact, \"Anti-vaccine video of fainting nurse lacks context,\" Dec. 21, 2020", "U.S. Food and Drug Administration, \"Vaccines and Related Biological Products Advisory Committee Meeting,\" Dec. 17, 2020", "U.S. Food and Drug Administration, \"Moderna COVID-19 Vaccine,\" Feb. 3, 2021", "U.S. Food and Drug Administration, Moderna vaccine fact sheet, December 2020", "Facebook, PolitiFact \"Are there side effects to the COVID-19 vaccine?\" video, Feb. 25, 2021", "New England Journal of Medicine, \"An mRNA Vaccine against SARS-CoV-2 — Preliminary Report,\" July 14, 2020", "Wired, \"Covid-19 Vaccines With ‘Minor Side Effects’ Could Still Be Pretty Bad,\" July 21, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]