["The posts, for example this one published to Facebook April 13, 2019, and shared more than 300 times since, contain a purported screenshot of a report from national news site Inquirer.net about the politician Samira Gutoc.", "Gutoc is running for the upper house of the Philippine Congress in May 13 elections. Here is the candidate list on the government website, in which Gutoc is number 36, and here is a campaign video featuring her and other opposition candidates.", "The image in the false post features a photo of Gutoc and a headline that says: “Gutoc to netizens: I’ll send you to jail for making fun of wearing my life vest!”", "The same image has been shared elsewhere on Facebook, for example here and here.", "Below is a screenshot of one of the misleading posts:", "On April 8, 2019, Gutoc and other opposition candidates tried to sail to Scarborough Shoal, a disputed territory in the South China Sea which has been under Chinese control since 2012.", "Here is an information page on the Scarborough Shoal on the website of the Asia Maritime Transparency Initiative, here is a Facebook post by the group of politicians about their attempt and here is a Manila Bulletin report about the stunt.", "Photos posted online of the trip for example here on Twitter showed Gutoc wearing a life jacket backwards. Some social media users mocked her for this.", "For example, the caption of this Facebook post, translated to English, says: “Because Samira Gutoc is so brave, she will charge towards China even if her life vest is worn backwards. GIVE HER A JACKET!”", "Below is a screenshot of that post, which is dated April 12, 2019:", "Gutoc defended herself on April 12 in the Facebook post embedded below.", "Translated to English, its caption says: “I may have worn my life vest the wrong way, but my stance is not wrong. What is hard is when you’re wearing it the right way, but you have already sold your soul, heart and mind to China”.", "Her comments were reported by news organisations including in this article published on Inquirer.net, also on April 12.", "The headline of the Inquirer.net article says: “Gutoc slams critics: Wearing life vest wrong better than having wrong principles”", "Here is a comparison image showing the misleading post on the left and the genuine article from Inquirer.net on the right:", "The two screenshots have key similarities, including the Inquirer logo and the reporter’s byline.", "However the genuine article is timestamped April 12 at 2:08 pm – before the date of April 13 given in both the misleading image and the Facebook post that shared it.", "There is no indication in the original Inquirer.net article that it was updated at a later date.", "Inquirer.net said the misleading post “is not real”.", "“An article allegedly published by Inquirer.net, under the byline of reporter Gabriel Pabico Lalu, which claims senatorial candidate Samira Gutoc has threatened to jail her critics is not real,” the site said in a statement here.", "In a statement on Facebook, embedded below, Gutoc also denied having said the quote in the misleading post's headline:", "Her post, when translated to English, says: “FAKE NEWS ALERT!!! This is not like me at all, hahaha. There are really just dishonest people who spread fake news. And there are liars who should not be voted into the Senate.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]