["Just days after the Trump family took the stage and praised their patriarch at the Republican National Convention, liberals took a closer look at the Trump family's ties to the presidency. On Aug. 26, Ridin’ with Biden, a Facebook page dedicated to the election of Democrat Joe Biden, posted a meme that calls the roles of Trump relatives and associates into question.", "“Trump’s daughter works at the White House,” claims the meme. “Her husband works at the White House. Rudy’s son works at the White House. Barr’s son-in-law works at the White House. Barr’s daughter works at Treasury. Trump’s sons do foreign business Trump profits from. Trump’s daughter is getting Chinese patents. But sure, let’s talk about Hunter Biden.”", "Biden’s son Hunter Biden has received criticism regarding his business dealings in Ukraine during his father’s vice presidency. Former Florida Attorney General Pam Bondi referenced the Hunter Biden controversy during the RNC last month.", "A meme with nearly identical text circulated on social media in late 2019 and early 2020. Ridin’ With Biden’s related advocacy group, Occupy Democrats, posted that meme in December 2019 and received 23,000 shares.", "Ridin’ With Biden has yet to return USA TODAY’s request for comment.", "Let's lay out the claims in the meme and see how they hold up.", "Fact check:Biden, like Trump, received multiple draft deferments from Vietnam", "Ivanka Trump serves as adviser to the president. Her husband, Jared Kushner, is assistant to the president and senior adviser.", "Both have forgone pay for their positions.", "Ivanka Trump and Kushner were appointed to their roles at the White House in the early days of Donald Trump's presidency. Kushner was appointed in January 2017; Ivanka Trump was hired in March 2017.", "The day of Trump’s inauguration, Deputy Assistant Attorney General Daniel Koffsky provided a 14-page opinion stating that federal anti-nepotism law didn’t apply to the White House. It stated that the president was allowed “special hiring authority” because the federal law concerns “only appointments in an agency,” which the White House is not.", "Kushner was sworn in two days later, on Jan. 22.", "Several presidents including Nixon, Carter, Reagan and Obama were advised that they could not appoint relatives to White House positions under the 1967 anti-nepotism law, Section 3110 of Title 5, U.S. Code.", "Fact check:In 2010, Donald Trump offered $6M to try to stop a mosque near Ground Zero", "Andrew Giuliani was appointed associate director of the office of public liaison in March 2017. A former campaign volunteer, Giuliani started with a $77,000 salary. He now earns $95,000 as special assistant to the president and associate director of the office of public liaison.", "Fact check:On a viral list of 10 Trump 'accomplishments,' 3 are true", "In February 2019, William Barr’s son-in-law, Tyler McGaughey, left his position at the U.S. Attorney’s office in Alexandria, Virginia, for the White House. At the same time, Barr’s eldest daughter, Mary Daly, left her job at the deputy attorney general’s office for a position within the Treasury Department.", "Daly and McGaughey’s moves from the Justice Department coincided with Barr’s nomination as attorney general.", "McGaughey’s position particularly drew criticism as some questioned Barr’s independence from the White House as his family served on its counsel's office.", "McGaughey worked as associate counsel in the White House and was paid $125,792 a year. He does not appear on the White House’s 2020 personnel report, indicating he has left the White House.", "The White House did not return USA TODAY's request for comment.", "Fact check:Claim that Jill Biden will require Americans to learn Spanish began as satire", "After his election, Trump announced he would be “turning over complete and total control\" of the Trump Organization to his sons. His lawyers announced that the Trump Organization wouldn't conduct any international business deals throughout Trump’s presidency.", "This decision drew criticism as most recent presidents have temporarily relinquished control of their assets to blind trusts rather than family members.", "Foreign diplomats' frequent stays at Trump hotels have led to criticism that Trump was still profiting off his presidency.", "In May, the Washington Post reported that the U.S. government has paid the Trump Organization $970,000 for hotel rooms for staffers and Secret Service agents.", "When Donald Trump appointed members of his private Mar-a-Lago golf club to be ambassadors for South Africa and the Dominican Republic, some questioned the ethics of appointing his paying customers.", "Watchdog organizations have openly criticized what they see as persistent conflicts of interest because of Trump's businesses.", "Fact check:National property tax isn't part of Joe Biden's plan", "Ivanka Trump closed her fashion label in July 2018, choosing to focus on her work at the White House.", "“After 17 months in Washington, I do not know when or if I will ever return to the business, but I do know that my focus for the foreseeable future will be the work I am doing here in Washington, so making this decision now is the only fair outcome for my team and partners,” she told USA TODAY then.", "Before that, she had faced criticism for her label's continued foreign business profits. Like her father, Ivanka Trump had relinquished control of her business assets to a family-run trust when she began working at the White House. Even so, she continued to profit from her eponymous brand.", "In May 2018, the Chinese government granted Ivanka’s brand a series of trademarks. Her company last applied for 17 trademarks on March 28, 2017, a day before she took her role at the White House. China reviewed and decided on dozens of these applications during her tenure at the White House.", "Fact check:White House didn't fire pandemic response unit when it was disbanded in 2018", "Many of Donald Trump's relatives and close associates have received political appointments and profited during his presidency. It is true that Ivanka Trump, Jared Kushner, and Andrew Guiliani work at the White House. It is true that Mary Daly works at Treasury, and that the Trump Organization has profited from foreign governments. However, Barr's son-in-law Tyler McGaughey has since left the White House, and Ivanka Trump has closed her fashion label so she is no longer pursuing Chinese patents, though they were approved after she started work at the White House. We rate this claim PARTLY FALSE, because some of it is not supported by our research.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]