["By Angelo Fichera", "Posted on June 30, 2020", "Viral posts wrongly claim that a painting depicting children in face masks was created as a mural for the Denver airport in 1994 — and baselessly suggest the COVID-19 pandemic was planned. The painting is not at the airport, and is not from 1994.", "Facebook and Twitter posts are spreading an image of a pandemic-themed painting with a false claim about when it was made and where it appears.", "Specifically, the posts claim that the artwork — depicting children wearing face masks that represent the flags of different countries — was created as a mural for the Denver International Airport in 1994. The erroneous posts now circulating use the painting to baselessly suggest that the pandemic was planned 26 years ago.", "“The Denver airport mural painted in 1994,” the posts read. “Tell me this is not weird, how far do they plan this stuff in advance?”", "But the painting does not appear in a listing of the Denver airport’s public art available on the airport’s website, and a spokesperson for the airport confirmed to us that the image on social media is “not from DEN’s art collection.” The claims tying the painting to the airport seem to have surfaced only recently.", "There is an airport mural created in 1994 that illustrates children from around the world. It’s called “Children of the World Dream of Peace,” but it doesn’t include face masks. (The airport and its art have been the subject of conspiracy theories in the past.)", "As for the painting involving face masks circulating on social media, we found images of the artwork as early as February, attributing it to an artist in the Philippines named CJ Trinidad.", "In late February, CNN Philippines shared a photo of the painting — posted by Trinidad days earlier — on its official Facebook page. Trinidad had dubbed the piece “Maskcommunication.”", "Trinidad can also be seen posing with the painting in a photo uploaded in March. He also recently shared a photo on Instagram showing what he described as the making of the painting.", "But the same work has surfaced elsewhere online with a different attribution.", "It was submitted to a recent international art competition hosted by the Indian Council for Cultural Relations, “United Against Corona- Express through Art,” by an India-based artist named Neha Kumari.", "The competition website lists the “[d]ate of submission” as Dec. 28, 1995, but that appears to be an error: The ICCR accepted submissions from April 2, 2020, to May 1, 2020.", "The photo of the work on the ICCR website appears to be the same image shared by Trinidad, then by CNN, in February — though cropped tighter. A key difference between the photos is the name of the artists on each painting.", "In the photo posted by Trinidad, his name appears at the bottom of the painting. The picture on the ICCR art competition website, however, does not show that bottom area of the painting. Instead, the name “NEHA” appears in the top left corner of the painting.", "We reached out to the ICCR and to Trinidad about the conflicting claims of who created the painting — and we’ll update this story if we hear back.", "Either way, though, we could find no evidence to suggest the painting was created in 1994 — and it’s false to say that it’s a mural in the Denver airport.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Art Competition – ‘UNITED AGAINST CORONA – EXPRESS THROUGH ART.’ GUIDELINES for participants.” Indian Council for Cultural Relations. Accessed 30 Jun 2020.", "“Children of the World Dream of Peace.” Denver Public Act. Accessed 30 Jun 2020.", "CNN Philippines (@CNNPhilippines). “LOOK: An artist shows through his masterpiece the importance of communication among nations in the time of the coronavirus outbreak…” Facebook. 28 Feb 2020.", "“Public Art.” City & County of Denver Department of Aviation. Accessed 29 Jun 2020.", "Renteria, Alex. Spokesperson, Denver International Airport. Email to FactCheck.org. 30 Jun 2020.", "“Suffering and Fighting Against Corona Virus. – Neha Kumari.” Indian Council for Cultural Relations. Accessed 29 Jun 2020.", "Trinidad, CJ (@cjtrinidad_08). “The making: ‘Maskcommunication’ ❤ #Feb2020 #maskcommunication.” Instagram. 27 Jun 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]