["About this rating", "A law firm working with Donald Trump was named \"Russia Law Firm of the Year.\"", "The award title referred only to Moscow office of a U.S.-based firm which has dozens of offices in the U.S. and around the world.", "On 11 January 2017, President-elect Donald Trump held a press conference in order to address allegations about his financial connections to Russia, as well as unconfirmed reports that country was in possession of sensitive material that could possibly be used to blackmail him.", "During the press conference, Trump introduced Sheri Dillon, a lawyer with the firm Morgan Lewis & Bockius, to explain how Trump would avoid conflict of interests when he officially took office. Dillon informed the press that she and her colleagues had designed a structure for Trump's business that would \"completely isolate him\" from the management of his companies while he served as president:", "Good morning. It's my honor and privilege to be here today as President-elect Trump’s request. He has asked me, as you just heard, to speak about the conflicts of interest and the steps he’s taking — as you know, the business empire built by President-elect Trump over the years is massive. Not dissimilar to this fortune of Nelson Rockefeller when he became vice president. But at that time, no one was so concerned. President-elect Trump wants the American public to rest assured that all of his efforts are directed to pursuing the people's business and not his own.", "To that end, as he explained a few moments ago, he directed me and my colleagues at the law firm Morgan Lewis & Bockius to design a structure for his business empire that would completely isolate him from the management of the company. He further instructed that we build in protections that will assure the American people the decisions he makes and the actions he takes as president are for their benefit and not to support his financial interests.", "Shortly after Dillon made her highly publicized appearance, several online outlets reported that Morgan Lewis had recently been named \"Russia Law Firm of the Year,\" which again raised suspicions that Trump had close business ties to Russia.", "While it's true that Morgan Lewis was named \"Russia Law Firm of the Year\" in 2016, this fact is not as significant as some pundits have made it out to be.", "For starters, the award applied only to the Moscow office of a U.S.-based firm that has dozens of offices in the U.S. and around the world. Additionally, this award was not handed out by any Russian governmental or business organization; it was bestowed by Chambers and Partners, a group that reviews law firms around the globe, who described Morgan Lewis as follows in their award description:", "This active Moscow office of an American firm offers top-level advice in regards to the energy sector and also houses very strong banking and M&A teams. Its in-depth sectoral expertise also includes TMT and private equity. Among recent highlights, the firm advised CTC Media on the sale of its Russian operating business to Russian investors. Another significant instruction was representing Russia-Chinа Investment Fund in its 9.75 billion RUB acquisition of a minority stake in Detsky Mir from Sistema Group.", "It should also be noted that Morgan, Lewis & Bockius does not deal exclusively with Russia. The firm has 29 offices in North America, Europe, Asia, and the Middle East.", "Finally, Donald Trump is not the only high-level politician to have engaged the services of Morgan Lewis. Hillary Clinton used the firm to help vet a running mate.", "Freed, Benjamin.   \"Meet the DC Lawyer Helping Hillary Clinton Pick a Running Mate.\"\r\n    The Washingtonian.   20 June 2016.", "Cook, Nancy.   \"Clinton Transition Team taps Lawyers to Help Vet Nominees.\"\r\n    Politico.   27 October 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]