["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential nominee Joe Biden participates in a CNN town hall moderated by Anderson Cooper in Moosic, Pa., on Sept. 17, 2020. (AP)", "• Trump received backlash for his photo-op with a Bible in June, but one part of the criticism isn’t supported by still images and video footage: Trump held the Bible right-side up during the whole event.", "Democratic presidential nominee Joe Biden had many criticisms of President Donald Trump during a CNN town hall near Biden’s hometown of Scranton, Pa. One of them revived an attack shared on social media earlier in the summer.", "Biden referenced Trump’s walk from the White House to the historic St. John’s Church on Lafayette Square. It came on June 1, when downtown Washington, D.C., was full of protesters following the death of George Floyd at the hands of Minneapolis police days earlier.", "Critics mostly blasted Trump for using tear gas to clear nonviolent protesters just before his walk to the church for a photo-op. But some on social media took aim at how Trump held the Bible.", "For instance, novelist Stephen King tweeted, \"Dear fundamentalist Christian Trump supporters: If Obama had held the Bible backwards and upside down, you would immediately have called him the Antichrist.\" The tweet attracted more than 164,000 likes.", "Dear fundamentalist Christian Trump supporters: If Obama had held the Bible backwards and upside down, you would immediately have called him the Antichrist.", "At the CNN town hall, Biden said that forces physically moved people out of Trump’s way \"so he can walk across to a Protestant church and hold a Bible upside down.\"", "Biden has made the claim about the upside-down Bible before, even though fact-checkers had debunked it. The claim has also appeared in various news accounts about the church photo-op and social media posts.", "Trump himself has previously denied that he held the Bible upside down.", "A @FoxNews commentator just ripped me with lies, with nobody defending. They talked about the “friendly” protesters (they set the Church on fire the day before. They were anything but friendly), and how I stood and held the Bible upside down - it wasn’t upside down. @edhenry", "What does the evidence show?", "We scrutinized a series of images from the Associated Press as well as raw video from NBC News, and the truth is clear: Trump held the Bible right-side up.", "The Bible he held up had no writing on the front cover, so to viewers who couldn’t see the spine, it may have looked like he was holding it upside down and backwards. But here are several AP images that clearly show the spine right-side up.", "In the following images, perhaps the most iconic ones taken of the event, it is a little harder to read the spine, but the free end of the ribbon bookmark clearly dangles below the Bible, which is how it was when the Bible was oriented correctly in the other images.", "We also reviewed the video of the event and confirmed that Trump consistently held the Bible right-side up. In fact, at several points he appears to look down on it to make sure that he’s holding it correctly.", "The Biden campaign did not respond to an inquiry for this article.", "Biden said that after Trump walked across Lafayette Square to a church, he held a Bible upside down.", "This false claim spread on social media earlier this summer, without evidence, and made it into several news reports and opinion pieces.  But fact-checkers debunked it as early as June, and a review of still images and video from that day show clearly that it is inaccurate. Trump held the Bible right-side up throughout the event.", "We rate the statement Pants on Fire!", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "Joe Biden, remarks in a CNN town hall, Sept. 17, 2020", "Associated Press photographs", "NBC News, \"Trump Stands In Front of Church Holding Bible After Threatening Military Action Against Protesters\" (video), June 1, 2020", "Donald Trump, tweet, June 25, 2020", "Stephen King, tweet, June 2, 2020", "Snopes.com, \"Did Trump Hold the Bible Upside Down?\" June 25, 2020", "PolitiFact, \"White House says officers didn’t fire tear gas, rubber bullets on protesters. Why that’s misleading,\" June 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]