["By Lori Robertson, Jessica McDonald, Robert Farley, D'Angelo Gore and Rem Rieder", "Posted on November 6, 2020", "In remarks resembling an attack on democratic elections, rather than a presidential speech, President Donald Trump doubled down on his campaign pledge: “The only way we can lose, in my opinion, is massive fraud.”", "In his Nov. 5 comments, he offered no evidence for the “illegal votes” that he claimed would need to be counted in order for former Vice President Joe Biden to win the election. He offered several false, misleading and baseless claims instead.", "We’ll go through Trump’s claims about voting in several states, beginning with Pennsylvania. But readers can skip ahead by clicking on the links for the other states:", "In speaking about the Keystone State, Trump baselessly alleged election engineering and mischaracterized a court ruling related to partisan election observers. While one ruling allowed observers to get as close as 6 feet, the president’s claim that “they don’t want us to have any observers” is false. There is also no evidence that local officials have improperly handled the election.", "“We were up by nearly 700,000 votes in Pennsylvania. I won Pennsylvania by a lot. And that gets whittled down to, I think they said now we’re up by 90,000 votes and they’ll keep coming and coming and coming,” Trump said. “They find them all over and they don’t want us to have any observers. Although we won a court case, the judge said, ‘You have to have observers.’”", "As we’ve explained before, Trump cannot claim to have won Pennsylvania. The earlier vote returns were in his favor, as the in-person votes were counted more quickly, but mail-in and absentee ballots could not even be opened and prepared for counting until 7 a.m. on Nov. 3. The count of legitimately cast ballots is still proceeding.", "Because more Democrats tended to vote by mail — likely due, in part, to the party’s active encouragement of such ballots to lock in votes early — many more of the votes that were counted later were for Biden, leading to a “blue shift” over time. Democrats accounted for nearly two-thirds of the 2.6 million returned mail-in ballots, according to an analysis of Pennsylvania election data by Michael McDonald, a University of Florida political science professor who maintains the U.S. Elections Project.", "And indeed, as many analysts expected, the Democratic nominee took the lead in the state on the morning of Nov. 6.", "Trump also baselessly said that Philadelphia was in the process of “engineering the outcome of a presidential race” and that “officials overseeing the counting in Pennsylvania and other key states are all part of a corrupt Democrat machine.”", "There’s no indication that any election malfeasance has occurred. It’s also not true that all of the officials in charge of counting ballots are Democrats. In Philadelphia, that job falls to a bipartisan trio of commissioners that includes one Republican.", "The commonwealth’s website similarly states that “bipartisan teams of election officials in each county are making sure your vote is accurately counted and verified.”", "Trump then proceeded to mischaracterize litigation pertaining to observers watching the vote counting process, saying that Democrats “have gone to the state Supreme Court to try and ban our election observers and very strongly.”", "The dispute has been over how close observers can get to the canvassing proceedings, not whether observers are allowed to be present. Initially, a trial court denied the Trump campaign’s request for closer observation in Philadelphia, finding on Nov. 3 that by the campaign’s own admission, it had been given the opportunity to observe “the opening and sorting of ballots.”", "The next day, a state court reversed that ruling, allowing observers within 6 feet, “while adhering to all COVID-19 protocols, including, wearing masks and maintaining social distancing.” Philadelphia’s election board then appealed the ruling to the state Supreme Court, saying that it had complied with the law and that closer inspection “jeopardizes both the safety of the City Defendants’ canvass, plus the privacy of voters.”", "Separately, but on the same issue, the Trump campaign filed suit in federal court on Nov. 5 to stop the vote count in Philadelphia. That request was dismissed by a judge — who was appointed by President George W. Bush — after both sides agreed that each would be allowed 60 observers. The Trump lawyer admitted during the hearing that the campaign did have some canvassing observers present, stating, “There’s a non-zero number of people in the room.”", "Philadelphia, notably, has been livestreaming its vote canvassing, which is available online for anyone to watch.", "Trump also misleadingly summarized a previous state Supreme Court decision that permits ballots that are postmarked by Nov. 3 to be accepted if received by Nov. 6. (In refusing a Republican request to expedite review of the case, the U.S. Supreme Court let the state court decision stand — but could opt to revisit the case after the election.)", "“In Pennsylvania, partisan Democrats have allowed ballots in the state to be received three days after the election, and we think much more than that, and they’re counting those without even postmarks or any identification whatsoever,” he said. “So you don’t have postmarks, you don’t have identification.”", "According to the rules, which were implemented due to concerns about postal delays during the COVID-19 pandemic, a ballot postmarked by Election Day can be accepted if received by 5 p.m. on Nov. 6. In the rare case in which there is a missing or illegible postmark, ballots without postmarks will be allowed unless there is a “preponderance of evidence” they were mailed after the deadline.", "Pennsylvania Secretary of the Commonwealth Kathy Boockvar explained in a Nov. 4 press conference that the vast majority of these later-arriving ballots should have postmarks on them, as that is standard fare for mail. Trump, therefore, is wrong to suggest that most or all of these ballots would not have postmarks.", "It’s also false for the president to claim that the ballots do not require “any identification whatsoever.” According to the state’s website, “In order to apply for an absentee or mail-in ballot, you must supply proof of identification.”", "Furthermore, the later-arriving ballots are not even relevant yet, as none of the mail-in ballots received past the 8 p.m. Nov. 3 cutoff have been included in the counts so far. Counties are keeping those ballots separate so they can be distinguished in case of further litigation.", "Trump falsely claimed he “won” Michigan, because he was up in the vote count on election night. But of course, the votes were still being counted, and Biden is now ahead by more than 146,000 with 99% of the votes in. All major news organizations, including Fox News, have called the state for Biden.", "The president claimed: “Our campaign has been denied access to observe any counting in Detroit.” But his own campaign hasn’t alleged that. Instead, the campaign has complained about not getting “meaningful access” to observe the counting in “numerous” locations, which it does not identify.", "Trump campaign manager Bill Stepien said in a Nov. 4 statement: “President Trump’s campaign has not been provided with meaningful access to numerous counting locations to observe the opening of ballots and the counting process, as guaranteed by Michigan law. We have filed suit today in the Michigan Court of Claims to halt counting until meaningful access has been granted.”", "In a court documents, Jonathan Brater, director of the Michigan Bureau of Elections, said, “I am not aware of any complaints received by the Bureau of Elections that an election inspector was not allowed to be present at an absent voter counting board in any jurisdiction in this State.”", "The Trump campaign lawsuit, which a state judge dismissed, charged that Michigan’s “absent voter counting boards” weren’t complying with a statute to have “[a]t all times, at least 1 election inspector from each major political party … present at the absent voter counting place.”", "The suit also said election “challengers” — who are not the same as political party inspectors — weren’t able to observe video of ballot drop boxes, charging this violated the state Constitution. It named one individual — Eric Ostergren, an election challenger, who claimed he was told to leave the Oakland County counting board. Oakland County is part of the Detroit metropolitan area.", "Brater further said that state law exempts drop boxes ordered before October 1 from video surveillance requirements.", "Trump appeared to reference a debunked claim from a conservative website when he said the “final batch” of votes in Detroit “did not arrive until 4 in the morning. And even though the polls closed at 8 o’clock, so they brought it in and the batches came in and nobody knew where they came from.”", "A video posted by a site called Texas Scorecard turned out to show a TV news photographer bringing equipment to the Detroit voting center in the early morning hours of Nov. 4. The video doesn’t show any ballots at all. Instead, it shows a man unloading a black box from a white van and putting it into a wagon that he wheels into the TCF Center in Detroit. The website then claims then is “suspicious.”", "Ross Jones, an investigative reporter for WXYZ-TV, said on Twitter: “The ‘ballot thief’ was my photographer. He was bringing down equipment for our 12-hour shift.”", "This “absolute garbage” claim, in Jones’ words, was tweeted by the president’s son Eric.", "Trump distorted an incident at the TCF Center in Detroit in the afternoon of Nov. 4 in which some poll observers, of both parties, and others were barred from entering the counting hall because it was at capacity.", "Reuters reported: “Emotions were running high on Wednesday afternoon in downtown Detroit, where city election officials blocked about 30 people, mostly Republicans, from entering the vote-counting hall at TCF Center due to capacity restrictions to fight the spread of COVID-19.”", "Reuters went on to say “Democrats said they had also been barred,” quoting one Democrat poll observer by name.", "Trump said that the windows of the counting area were blocked with “large pieces of cardboard,” adding: “They didn’t want anybody seeing the counting, even though these were observers who were legal observers that were supposed to be there.”", "Poll officials did block the windows “with pizza boxes and cardboard to prevent challengers from viewing inside,” Reuters said. But Trump’s implication that no one was observing the vote into the hall is false.", "Lawrence Garcia, Detroit’s corporation counsel and an election commissioner, said more election challengers couldn’t enter the hall because it had hit the permitted capacity for each party, according to Crain’s Detroit Business.", "Finally, Trump claimed, “Poll workers in Michigan were duplicating ballots.” We don’t know what Trump is talking about; we asked his campaign but haven’t received a response. The president further said: “But when our observers attempted to challenge the activity, those poll workers jumped in front of the volunteers to block their views so that they couldn’t see what they were doing and it became a little bit dangerous.”", "The only reference we could find to duplicating ballots is a comment — in a Detroit News article — by Christopher Schormak, an election challenger with the Election Integrity Fund, a project of the conservative Thomas More Society law firm, who said military and overseas ballots “won’t feed into the machine,” so they “have to be duplicated and double-checked by another worker.”", "Schormak didn’t allege anything was nefarious or fraudulent about that.", "Trump made several unfounded, baseless and specious claims about alleged election counting issues in Georgia, where Biden pulled into a slight lead over the president, according to counts as of the morning of Nov. 6.", "In a Nov. 6 press conference, the morning after Trump spoke, Georgia Voting System Implementation Manager Gabriel Sterling, a Republican, said state officials have not seen any evidence of widespread voter fraud.", "“Are we seeing any widespread fraud? Are we seeing anything that makes us question the outcome of the election?” Sterling said. “We are not seeing any widespread irregularities.”", "Here are some of Trump’s specific claims.", "Trump: Likewise in Georgia, I won by a lot, a lot, with a lead of over getting close to 300,000 votes on election night in Georgia. And by the way, got whittled down and now it’s getting to be to a point where I’ll go from winning by a lot to perhaps being even down a little bit. In Georgia, a pipe burst in a far away location, totally unrelated to the location of what was happening and they stopped counting for four hours. And a lot of things happened. The election apparatus in Georgia is run by Democrats.", "There are several misleading statements here. Trump did not “win” the state by a lot (or at all), though he is correct that he was leading in the vote tallies on election night. But as we have written repeatedly, vote counting always goes past Election Day. There’s nothing unusual about that. Like most states, Georgia could not start counting mail-in ballots until the day of the election, and it had roughly 1.3 million mail-in ballots returned and accepted. As has been in the case in other states, most of the mail-in ballots being counted in the days after the election broke in Biden’s favor.", "As for Trump’s claim that “a pipe burst in a far away location, totally unrelated to the location of what was happening and they stopped counting for four hours,” there’s some truth in that, though there’s no evidence that it ultimately affected vote tallies in any way.", "As the Atlanta Journal-Constitution reported, a water leak at State Farm Arena in Atlanta, which serves as a ballot processing site, caused a several hours delay in vote-counting on election night. No ballots were damaged, and vote processing resumed normally.", "Finally, Trump is wrong to say, “The election apparatus in Georgia is run by Democrats.” Georgia has a Republican governor. Georgia’s secretary of state, Brad Raffensperger — who oversees elections — is a Republican. And the state’s voting implementation manager, Sterling, is a Republican.", "Asked at a press conference on Nov. 6 about Trump’s comment, Sterling said, “I’m not going to try to get into the president’s actual mindset on that, because there are Republicans who are involved, there are Democrats involved at different levels. It’s sort of a shared service delivery model. There are Republican election directors. There are Democrat election directors. Obviously, Secretary Raffensperger is a Republican. I’m a Republican. I don’t make any bones about that. … In general, we have people who have partisan beliefs, but the job of elections directors and this office is to count every legal vote, follow the law and assure that every legal vote is counted, and the will and intent of the voters is met.”", "Trump: The 11th Circuit ruled that in Georgia, the votes have been in by Election Day, that they should be in by Election Day, and they weren’t. Votes are coming in after Election Day. And they had a ruling already that you have to have the votes in by Election Day. To the best of my knowledge, votes should be in by Election Day, and they didn’t do that.", "It’s true that Georgia requires ballots to be received by the close of the polls on Election Day if they are to be counted. (There are 22 states that allow ballots postmarked by Election Day and received in the days after the election to be counted, but Georgia is not one of them.) As Trump noted, the 11th U.S. Circuit Court of Appeals in early October reinstated the Election Day deadline for Georgia voters to return their absentee ballots.", "But there is no evidence that any votes received after Election Day are being counted in Georgia, as the president claimed.", "The Trump campaign and the Georgia Republican Party filed a lawsuit that included an affidavit from a Republican poll observer who expressed concern that 53 ballots may have been received in Chatham County after the 7 p.m. deadline on Election Day but intermingled with on-time ballots.", "Colin McRae, chair of the Chatham County registrars board, testified in a hearing that he reviewed all of the 53 ballots in question and verified that each was time-stamped as having been received before the deadline. Sabrina German, director of the registrars office, told the Atlanta Journal-Constitution that the 53 ballots had initially been separated and flagged for further review, but were received on time. (As of Thursday morning, McRae said, 41 ballots in Chatham County arrived too late, and will not be counted.)", "Superior Court Judge James Bass dismissed the Republican lawsuit, stating: “[T]he Court finds that there is no evidence that the ballots referenced in the petition were received after 7:00 p.m. on election day, thereby making those ballots invalid.”", "Trump: We’ve also been denied access to observe in critical places in Georgia.", "There’s also no evidence of this.", "David Shafer, chairman of the Georgia Republican Party, tweeted complaints about at least two instances of alleged obstruction of Republican observers, but there doesn’t appear to be much to either of those.", "In one case, Shafer complained about workers in a tabulation center in Fulton County “operating a fork lift between the place the ballot scanners are located and the area our observers have been instructed to stand.”", "In another tweet on the afternoon after Election Day, Shafer alleged, “Fulton County told our observers last night to go home because they were closing up and then continued to count ballots in secret.”", "But Fulton County officials say that’s not true. According to the Associated Press, Rick Barron, the county elections supervisor, told the county board of commissioners “that when he learned staffers were dismissed at 10:30 p.m. Tuesday night, he advised that some of them needed to stay, county spokeswoman Jessica Corbitt said in an email.”", "“Based on that directive, a smaller crew continued to work through the night,” Corbitt told the AP. “It may be possible that observers left at the time the majority of the staff left, but from the information we have, the processing area was never closed to observers.”", "In a press conference on Nov. 6, Raffensperger, Georgia’s Republican secretary of state, said that while there have been allegations in other states about monitors not being allowed to watch the counts, “In Georgia, this process is and will remain open and transparent to monitors.”", "Trump complained about developments in North Carolina, even though he continues to lead in the Tar Heel State. Trump is ahead by 76,701 votes with 94% of the expected total in.", "Trump: We were ahead in vote in North Carolina by a lot, a tremendous number of votes, and we’re still ahead by a lot, but not as many because they’re finding ballots all of a sudden. “Oh, we have some mail-in ballots.” It’s amazing how those mail-in ballots are so one-sided too. I know that it’s supposed to be to the advantage of the Democrats, but in all cases they’re so one-sided.", "It’s no surprise that the mail-in votes are “so one-sided” in favor of the Democrats. Democrats urged their voters to vote via the mail in the midst of the COVID-19 pandemic, while Trump repeatedly assailed mail-in voting. In North Carolina, Democrats requested 669,285 mail ballots — more than twice as many as the 288,393 requested by Republicans, according to the U.S. Elections Project.", "And there is no evidence that anyone was “finding ballots all of a sudden.”", "Trump complained about vote counting in North Carolina early in the morning after Election Day, saying he had a lead and then “all of a sudden everything just stopped.” But Patrick Gannon, public information director for the North Carolina State Board of Elections, told us in an email that “North Carolina stopped counting votes on election night because there were no more votes to count at that time.”", "The state will accept and count absentee ballots that arrive by Nov. 12, as long as they are postmarked by Election Day. It is also assessing and counting provisional ballots. The state is not expected to update its vote totals until next week. North Carolina has not been called by the Associated Press or other news organizations that project the results.", "Trump said, “In Wisconsin, we did likewise fantastically well, and that got whittled down. In every case, they got whittled down.”", "Trump was seemingly ahead in Wisconsin at the end of the day on Nov. 3, but that was before many of the mail-in ballots were counted. State law prevented election officials from counting absentee ballots before polls opened on Election Day.", "As the Milwaukee Journal Sentinel explained: “Biden overtook Trump in the early morning hours when Milwaukee reported its roughly 170,000 absentee votes, which were overwhelmingly Democratic. Then early morning returns from Green Bay and Kenosha on Wednesday added to his slender lead. Trump had nurtured a lead of more than 100,000 votes before those returns came in.”", "News organizations later declared Biden the projected winner in Wisconsin, with unofficial results showing he received 1,630,568 votes to Trump’s 1,610,030.", "The Capital Times in Wisconsin had warned its readers ahead of time that it was unlikely a winner would be declared on election night.", "“Because so many are voting by absentee ballot this fall, election workers will face longer-than-normal processing times as they move to accurately count votes throughout the day Tuesday — work that, by state law, can’t start until 7 a.m., when polls open,” the Capital Times said. “While there was some bipartisan support for changing that law or making other adjustments, nothing was enacted, making it unlikely that unofficial statewide results will be known here Tuesday.”", "Trump notably has not called for votes to stop being counted in Arizona, where he currently trails Biden.", "“Today, we’re on track to win Arizona,” the president said in his remarks. “We only need to carry, I guess, 55% of the remaining vote, 55% margins, and that’s a margin that we’ve significantly exceeded. So we’ll see what happens with that, but we’re on track to do okay in Arizona.”", "In contrast to states where Trump lost his lead as absentee and mail-in ballots were counted, those ballots are helping him shrink Biden’s lead in Arizona.", "As the Arizona Republic reported:", "Arizona Republic, Nov. 5: President Donald Trump inched closer to former Vice President Joe Biden as results from Thursday’s ballot counting were released, but he fell off the pace needed to win Arizona’s 11 electoral votes.", "Trump won 55.6% of the ballots counted in Maricopa County on Thursday to Biden’s 41.7%. It was a great showing, but Trump’s challenge is he needs more than 57% of the outstanding votes to win.", "Statewide, Trump chipped away 22,000 votes from Biden’s lead, closing the gap to 46,667 votes as of 9:30 p.m. Thursday. But unless the next batches of votes show Trump with a higher percentage than what the president managed Thursday, he will fall short.", "The Arizona Republic said there were 300,000 votes left to count as of Thursday evening.", "Fox News called Arizona for Biden late on election night, and the Associated Press made the call for Biden early in the morning the following day. Other news organizations have not projected a winner.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]