["“Quinine found in Tonic water along with 50-100mg of zinc daily will kill COVID-19,” according to various Facebook and Twitter posts.", "Brandon Brown, a professor at University of California, Riverside’s Center for Healthy Communities, said quinine in tonic water would not work as a cure for the disease.", "“You would have to drink over 10 times more tonic than humans drink water per day to approach a similar effect of the drug. It’s just not possible,” he told AFP in an email, noting that humans drink about two liters of water a day on average.", "It “seems like a made up home remedy for a medicine that is currently under clinical trials,” he said of the posts circulating online.", "The US Food and Drug Administration (FDA) restricts the amount of quinine contained in commercial beverages to 83 parts per million -- roughly equivalent to 83 milligrams per liter.", "A capsule of prescribed quinine contains 324 milligrams of the drug, and the FDA recommends 648 mg every eight hours for treating malaria.", "Quinine, along with its synthetic relatives chloroquine and hydroxychloroquine, are chemical compounds normally used as anti-malarial drugs. They are not proven to work as treatments for COVID-19, nor approved by the FDA as such.", "“There are no FDA-approved therapeutics (drugs) to treat COVID-19 or other coronaviruses,” Michael Felberbaum, an FDA spokesman, told AFP by email.", "As the COVID-19 pandemic swept across the globe, some doctors in the United States began to trial hydroxychloroquine as a treatment for the virus. One California doctor treated patients with a combination of hydroxychloroquine and zinc. However, there is currently no clinically proven evidence the treatments work.", "“It may or may not work, similar to us taking a multivitamin to treat the symptoms,” Brown said, adding that studies show excessive levels of zinc, commonly used as an immune system supplement, can be detrimental to one’s health.", "According to the US National Institutes of Health (NIH), the tolerable upper intake level of zinc for adults is 40 mg per day.", "The recommendation to combine tonic water with zinc to protect against COVID-19 appears to have been promoted by Eric Nepute, a chiropractor from Missouri with 133,000 Facebook followers, who urged people to take “3 to 4 ounces a day of Schweppes” and “50 to 100 mg of zinc.” The video was visible on Facebook until April 16, but appears to have since been deleted.", "Nepute later denied ever suggesting the treatment, calling it “idiotic” in another video.", "Katie Gilroy, a spokeswoman for Keurig Dr Pepper, the company that sells tonic water brands such as Schweppes or Canada Dry, said of its beverages: “The quinine is added for flavoring only, and we do not make any medical or health claims around these products.”", "AFP Fact Check has debunked more than 330 examples of false or misleading information about the novel coronavirus crisis.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]