["About this rating", "In September 2020, as wildfires burned millions of acres across the western United States, social media users began circulating maps of those fires along with comments questioning (in earnest or in jest) why only the United States, and not the bordering country of Canada, was being affected by the plague of fires -- such as, \"So weird that the fires just abruptly stop at the Canadian border.\"", "Other versions suggested this anomaly cast doubt on the notion that the wildfires were truly natural disasters or linked to climate change, bearing comments such as \"If these were natural disasters, wouldn't Canada be covered in flames like we are?\" and \"Don't you find it odd how climate change recognizes borders ... west coast on fire. Canadian border it stops ... very little in comparison ... then it resumes in Alaska\":", "For those who take such posts seriously, the simple answer is that fires don't stop at national borders, but many maps produced by U.S. agencies only display U.S.-derived data and thus don't reflect activity occurring across the border.", "But western Canada did indeed also experience wildfires in 2020, as a map from the same time frame produced by a non-U.S. governmental agency, Natural Resources Canada showed fire hot spots on both sides of the border:", "It was certainly true that wildfires were comparatively much more prevalent in the western U.S. than in western Canada in September 2020, a phenomenon that news accounts attributed to local weather and pandemic-related restrictions:", "As wildfires turn the skies apocalyptic along the western seaboard of the United States, it has been a quieter-than-usual wildfire season in western Canada that can be attributed to the mixed blessings of rainy weather and isolating effects of the COVID-19 pandemic.", "“Why are they [in the western U.S.] getting it and we are not? It’s because of the weather they’re getting,” explains Mike Flannigan, a professor with the Department of Renewable Resources at the University of Alberta.", "“The warmer it gets, the longer the fire season,” Flannigan explained.", "Although weather is a major factor in wildfires, the COVID-19 pandemic has had an impact in 2020. In Alberta, for example, the busiest time for fires is May, with many started by humans. But fire bans in Alberta and B.C., and off-highway vehicle bans in Alberta during the COVID lockdowns, helped to reduce the human element.", "“There were fewer people out and about working or recreating in the woods, so the number of caused fires was way down this year… Forest closures, quad bans, they work, they really work,” [Flannigan] said.", "Hot, dry, windy conditions are a deadly combination for the biggest fires, according to Flannigan. In the western United States, it has been hot and windy, and there has also been unusual lightning activity in places such as California.", "In British Columbia and Alberta, a lot of rain has reduced much of the wildfire risk this season. Karley Desrosiers, a fire information officer with the B.C. fire service, pointed to wet weather that soaked deep into the ground — the precipitation “really helped mitigate the number of fires.”", "Dawson, Tyler.   \"As Much of U.S. burns, Western Canada Has Quieter-Than-Usual Wildfire Season Due to Rain and COVID Lockdowns.\"\r\n    National Post.   11 September 2020.", "Shepherd, Marshall.   \"Wildfires Don’t Stop at the Canadian Border - Debunking the Latest Twitter Myth.\"\r\n    Forbes.   15 September 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]