["Democratic presidential candidate Hillary Clinton answers reporters' questions after announcing her college affordability plan in Exeter, N.H., on Aug. 10, 2015. (AP/Jim Cole)", "Democratic presidential candidate Hillary Clinton and Republican presidential candidate Jeb Bush (or at least their staffs) engaged in a snarky Twitter exchange shortly after Clinton gave a speech about college affordability.", "In the exchange, on Aug. 10, 2015, Clinton and Bush cheekily traded barbs about education policy.", "The original tweet, from Clinton’s camp, was straightforward, saying, \"Cost won't be a barrier to an education. Debt won't hold you back. Read Hillary's plan: http://hrc.io/college.\"", "The Bush camp replied by tweaking the original visuals and saying, \"100%: The increase in student debt under this Democratic White House.\"", "Then the Clinton camp shot back by \"scribbling over\" Bush’s graphic with the following claim: \"F: The grade given to Florida for college affordability under Jeb Bush's leadership.\" It cited the the Center for Public Policy and Higher Education.", "So did Florida received an F for college affordability when Bush was governor from 1999 to 2007? There is some evidence to back this up, but Clinton's jab leaves out important context on the cost of Florida higher education during the Bush years. (We separately checked Bush’s claim about the increase in debt.)", "The claim comes from the Center for Public Policy and Higher Education, which shut its doors in 2010. The independent group, funded by philanthropies such as Pew Charitable Trusts and the Ford Foundation, graded states every two years on a variety of metrics for higher education. One was \"affordability.\"", "In looking at this subject, the group sought to answer this question: \"How difficult is it to pay for college in each state when family income, the cost of attending college, and student financial assistance are taken into account?\" To do this, researchers considered such criteria as tuition for community colleges and public and private four-year colleges and universities; the degree of state investments in need-based financial aid; and the extent of student debt.", "For the year cited in Clinton’s tweet -- 2006 -- Florida did receive an F for affordability. And it wasn’t the only time: In 2004, the study also gave Florida an F.", "But Florida was hardly alone in flunking the affordability test.", "In 2006, the year the Clinton camp selected for the tweet, every state but seven received an F, and those \"lucky\" seven states didn’t do much better: Five ended up with a D while two got a C. The missing context from the tweet, then, is that Florida was not uniquely bad -- not by a longshot.", "Our own previous fact-checking concluded that while tuition went up under Bush, it did so at a rate slower than the national average. We found that Bush signed budgets in which the Legislature increased tuition substantially, but we also found that in-state, undergraduate tuition in Florida was still modest compared to to other states when Bush left office.", "Bush’s team cited several policies he helped institute on education: He put in place a First Generation Matching Grant for Floridians who are the first in their families to attend college; gave the Florida Student Assistance Grant Program a record 21.9 percent increase in 2006; and expanded the lottery-funded Bright Futures Medallion Scholarship program to cover 100 percent of community-college tuition fees.", "Still, the reports cannot be discounted entirely. Troy Miller, associate director for research and policy for the student advocacy group the Florida College Access Network, said the reports were important because they looked at whether state’s residents could typically afford the price tag of college in their state. \"The way the authors evaluate affordability is valid, even if their grading scale is arbitrary,\" such as the fact that most states received an F, Miller said.", "Miller added that Florida may have suffered in the ratings because of the Bright Futures program, which was a merit-based program, not one that was need-based. The report points out \"that Florida awards little state aid on the basis of need relative to other states,\" he said.", "Our ruling", "Clinton said that under Jeb Bush, Florida got an F for college affordability.", "The report on which her campaign is basing the claim confirms that in 2006 Florida received an F in this category. Still, it’s worth noting that 43 of the 50 states scored an F in 2006, meaning that Florida’s grade wasn’t uniquely bad. And while tuition did increase on Bush’s watch, the rate of increase was smaller than the national average. The statement is partially accurate but leaves out important details, so we rate it Half True.", "Hillary Clinton, tweet, Aug. 10, 2015", "Center for Public Policy and Higher Education, \"Measuring Up\" biennial report cards, 2006, 2004, 2002, 2000", "Email interview with Joni E. Finney, professor at the University of Pennsylvania and director of the Institute for Research on Higher Education, Aug. 11, 2015", "Email interview with Donna M. Desrochers, researcher at American Institutes for Research, Aug. 12, 2015", "Email interview with Margaret Miller, executive editor of Change magazine at the University of Virginia's Center for the Study of Higher Education, Aug. 12, 2015", "Email interview with Troy Miller, associate director for research and policy for the student advocacy group the Florida College Access Network, Aug 12, 2015", "Email interview with Matt Gorman, spokesman for Jeb Bush, Aug. 11, 2015", "Email interview with Ian Sams, spokesman for Hillary Clinton, Aug. 12, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]