["About this rating", "The Toronto restaurant Good Fortune used office supply names for its burgers to give people an opportunity to expense their meals.", "This was a temporary campaign that was created to \"put a smile on some people's faces,\" according to the restaurant's director of operations.", "In March 2021, a rumor started circulating on social media about a Toronto restaurant's underhanded scheme to allow customers to expense their meals by renaming burgers as office supplies:", "This is a genuine screenshot of a Toronto restaurant's menu. And yes, the \"Wired Earphones with Mic\" burger was named that way so that people could expense their meals.", "This menu comes from the Toronto restaurant Good Fortune. While the majority of items on this restaurant's menu have \"normal\" names (like the Fortune Burger), they launched a limited-time #Receats (or receipts) menu on food delivery services such as UberEats and DoorDash that includes \"renamed menu items so you can expense them.\"", "Here's an Instagram post from Good Fortune promoting a dry erase board chicken burger.", "Jon Purdy, director of operations at Good Fortune Burger, told the Toronto website BlogTo that there was no malice behind this campaign, and that the restaurant was just trying to give people a laugh.", "\"We just wanted an opportunity to put a smile on some people's faces and have them have a little bit of a giggle,\" says Jon Purdy, Director of Operations at Good Fortune Burger.", "While most people have found the redesigned menu as entertaining as intended, a few have raised concerns on how this could get employees who attempt to expense the menu in trouble.", "\"There's no malice intended in it, it's all just fun and games,\" Purdy continued.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]