["By Lori Robertson", "Posted on October 18, 2017 | Updated on October 19, 2017", "President Donald Trump exaggerates when he describes a reduction in the top marginal rate for pass-through business income as a boost to small businesses and truckers.", "Trump has made his claim about 30 million small businesses several times, including in a speech at the Heritage Foundation on Oct. 17. And he made claims about both small businesses and truck drivers in an Oct. 11 speech in Harrisburg, Pennsylvania, to a crowd that included workers in the trucking industry.", "Trump, Oct. 17: And for small businesses that file taxes as sole proprietors, S corporations, or partnerships, we will cap the top tax rate at a maximum of 25 percent. … For the more than 30 million American small businesses in America, our plan cuts their top marginal rate by about 40 percent.", "Trump, Oct. 11: For the many American truckers who file taxes as sole-proprietors, S corporations or partnerships, we will cap your top tax rate at a maximum of 25 percent — substantially lower than what you’re paying now. The more than 30 million Americans who have small businesses will see — listen to this — a 40 percent cut in their marginal tax rate — 40 percent. I wouldn’t want to be a politician against that. They’re going to have a long, hard winter.", "Lowering the top tax rate for pass-through business income to 25 percent is part of the Republican tax framework that the White House and GOP leaders negotiated.", "Businesses that are organized as sole proprietorships, limited liability companies or S corporations don’t pay corporate income tax. Instead, the business income is “passed-through” to the owners or partners, who pay individual income taxes on the earnings.", "The top individual income tax rate is 39.6 percent, so capping the rate at 25 percent for those paying pass-through taxes on their businesses’ income would be a substantial savings for some — a reduction in the top rate of 37 percent. But as the Tax Foundation said in a fact sheet on this issue, lowering the top rate “would only benefit pass-through business owners in the highest tax brackets.”", "And there are nowhere near 30 million pass-through business owners in the highest tax brackets.", "Trump also made the false claim that small businesses would be getting “a 40 percent tax cut,” when he used the talking point on Oct. 18 before a White House meeting with the Senate finance committee. It’s a cut in the top marginal rate, as he has phrased it before, not a 40 percent drop in the amount of taxes paid.", "Most businesses in the United States are organized as pass-through entities. A 2012 Congressional Budget Office report shows that about 70 percent of businesses were sole proprietorships and 20 percent were partnerships, LLCs and S corporations in 2007. Only 6 percent were C corporations, paying corporate income taxes.", "And as of 2011, pass-through entities earned most of the business income — 54.2 percent of it, a 2015 paper by several experts with the Treasury Department and National Bureau of Economic Research found.", "But relatively few with pass-through business income could get the 40 percent rate cut the president touted.", "We asked the White House press office for the source of Trump’s 30 million figure for “small businesses,” and we did not get a response. But 30 million would be every business in the country, according to the Small Business Administration.", "Trump’s claim fits a pattern of politicians making claims about “small businesses” and using broad and exaggerated numbers.", "The SBA says in a 2016 fact sheet that there are 28.8 million total “small businesses.” The SBA’s definition of small business is any business with fewer than 500 employees. So the 28.8 million figure is actually 99.7 percent of all businesses in the country, the SBA says.", "Most of those small businesses are indeed small: Twenty-three million are nonemployer firms, meaning they have no paid employees. But nonemployer firms include any reporting $1,000 in business income or more. That would include an unknown number of people who earn some business income on the side or from hobbies.", "Many taxpayers reporting some business income “don’t have businesses at all,” Frank Sammartino, a senior fellow at the Tax Policy Center, wrote this year in a brief on this issue. “Rather, they may receive occasional income from the rental of a vacation home, or from the sale of odds and ends on eBay, that they report as business income. A 2011 Treasury study estimated that only about half of those who filed a sole proprietorship tax return really ran a business.”", "According to the SBA, most of the self-employed don’t earn anywhere near the $418,400 and more needed to get a 40 percent tax rate cut. The SBA says that the median income for the self-employed at incorporated businesses was $49,204 in 2014. For those at unincorporated firms, the median income was $22,209.", "How many “small-business” owners earn enough to fall in the top marginal tax bracket and get that 40 percent rate cut? It’s difficult to say precisely, but the figure for 2017 would be at most 670,000 taxpayers — a fraction of the 30 million Trump claimed.", "Overall, there are 38 million taxpayers reporting some kind of business income, but 86 percent of them are in the 25 percent tax bracket or below, according to a table on the distribution of pass-through business income from the nonpartisan Tax Policy Center.", "In the top tax bracket for 2017, there would be 670,000 taxpayers with business income. That’s most, or 72.8 percent, of all taxpayers in the top bracket. But not all of them are “small businesses.”", "Only 30 percent of the taxpayers in that bracket would report business income that makes up more than half of their adjusted gross income. Pass-through business income reported on individual tax returns includes consultancy work someone might do on the side, book royalties or income from renting a house to tenants — as well as pass-through income from actual brick-and-mortar shops. So not all taxpayers reporting business income are what one might think of as a small business, as Sammartino explained.", "Upper-income taxpayers report most of the pass-through business income.", "“Households making $200,000 or more account for nearly 80 percent of business income reported on individual income tax returns, and those making $500,000 or more account for 60 percent,” Sammartino wrote. “Among those making $1 million or more, 80 percent report business income averaging more than $810,000, and more than 25 percent generate at least half their adjusted gross income that way.”", "Trump’s claim about a 40 percent rate cut applies only to those in the top income tax bracket, and they don’t number even 1 million, let alone 30 million.", "What about the “many American truckers who file taxes as sole-proprietors, S corporations or partnerships”? Would a 25 percent rate be “substantially lower” than what they’re paying now, as Trump said?", "That depends on their income. There may be trucking company owners or other high-paid positions that could benefit from a 25 percent pass-through rate. But most truck drivers already fall in the 25 percent bracket, or below, according to median income figures.", "Here are the individual income tax brackets for 2017 for a single person and a married couple filing jointly, as set by the IRS. (These are marginal rates, meaning the first $9,325 of any single person’s taxable income is taxed at 10 percent, with income above that taxed at the corresponding marginal rate. Also note that taxable income would be gross income minus personal exemptions and standard or itemized deductions.)", "The median pay of heavy and tractor-trailer truck drivers in 2016 nationwide was $41,340, according to the Bureau of Labor Statistics. That means half made under that amount and half made more. The high-end pay was $63,140 — that’s the start of the top 10 percent of earners for truck drivers.", "But those statistics come from a survey of employers, and they don’t include the self-employed.", "We contacted the Owner-Operator Independent Drivers Association, which was founded in the early 1970s and says it has more than 150,000 members. The group conducts surveys of its members by mail and typically gets about 1,000 responses, Norita Taylor, director of public relations and marketing, told us. Eighty-five percent of respondents say they are sole proprietors, LLCs or partnerships. The average net income, after taxes, has been $43,320, Taylor said, according to the surveys from 1998 to 2016.", "That would put the pretax average income above the BLS figures. But even a doubling of that net figure still falls within the current 25 percent tax bracket.", "A truck driver, or other worker in the trucking industry, would have to earn more than $91,900, or $153,100 as a married couple, in taxable income to have any income taxed at a higher rate.", "Some in the industry likely do earn more. Back in 2011, CNN Money did a story on “surprise six-figure salaries” that included a 37-year-old semi-truck mover earning $160,000 in Duluth. A single person earning that today would be in the 28 percent marginal tax bracket.", "The American Trucking Associations, a national trade group that joined Trump in Harrisburg and backs his tax plan, sent us driver compensation figures showing that median pay varied based on the type of vehicle. The group’s compensation survey showed median pay for 2013 at about $56,000 for a refrigerated truck and about $73,000 for a private van, the highest figure on the chart. Those median figures don’t rise above the 25 percent tax bracket.", "ATA says that about two-thirds of trucking firms pay pass-through taxes. And, of course, some could be among those 670,000 taxpayers in the top bracket, or the 300,000 taxpayers in the 33 percent or 35 percent brackets, reporting business income. A 25 percent top marginal rate would be “substantially lower” than what those taxpayers are paying now.", "But the data on truck drivers’ income show most wouldn’t see a cut in their top marginal tax rate, despite Trump’s claim that “many American truckers” will.", "Update, Oct. 19: We updated this story to say that taxable income is gross income minus personal exemptions, as well as deductions.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]