["The video was uploaded by a Papua New Guinea-based Facebook user here on March 9, 2021.", "Throughout the video a voiceover can be heard saying “these children are jumping out of the window and running away because they came to give them the vaccine”.", "The voiceover adds: “They bypassed two white schools and come straight to the black school and tell everybody they have to take this vaccine before they go home ... So the children started jumping out the windows and running home.”", "The Facebook post’s caption claims the video shows “THE SINISTER SIDE OF COVID VACCINATIONS” and asks why governments and vaccine manufacturers plan on “INJECTING LIVE CORONA VIRUS INTO THE BLACK POPULATION OF THE WORLD??”", "The caption adds that: “UNLESS THIS QUESTION IS SATISFACTORILY ANSWERED BY THE PNG GOVERNMENT AND IT'S MEDICAL AND SCIENTIFIC ADVISORS, WE WILL NOT TAKE THE VACCINE!!!!”", "The video was also shared on Facebook alongside similar claims here and here; and on YouTube here, where it has been viewed over 9,000 times.", "However, the claims made in the Facebook post and the video are false or misleading.", "According to multiple news reports (see here and here), the video actually shows children at a school in Nigeria running from a tear gas canister that was accidentally opened in a classroom in May 2019.", "The video, without the voiceover, was also uploaded to Twitter here and Facebook here in May 2019 alongside captions that also state the children were running from a tear gas canister.", "The World Health Organization (WHO) was informed of the emergence of SARS-CoV-2, the virus which causes the disease Covid-19, on December 31, 2019, half a year after the video of Nigerian children started circulating.", "According to this AFP report, Nigeria began vaccinating against Covid-19 on March 5, 2021, over a year and a half after the video showing fleeing school children running was originally published.", "While vaccinations for Covid-19 have not yet started in Papua New Guinea as of March 18, 2021, Australia has donated 8,000 doses of the AstraZeneca vaccine to the pacific nation after a surge in positive cases.", "The AstraZeneca Covid-19 vaccine is an mRNA vaccine — not a “live virus” vaccine, which the Facebook posts falsely claim is going to be distributed in Papua New Guinea.", "According to the Australian Department of Health, the mRNA vaccine triggers an immune response after cells “recognise the spike protein as foreign and begin building an immune response against it. The RNA from the vaccine does not change or interact with our DNA in any way.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]