["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A young reporter died unexpectedly of swine flu and encephalitis on Dec. 28. Now conspiracy theorists are wrongly speculating that she was murdered for writing a story critical of the FBI.", "On Dec. 13, 2018, The Federalist published a seven-paragraph story by Bre Payton in which she wrote about an 11-page report from an Office of Inspector General investigation into text messages exchanged between two FBI officials.", "\"The Department of Justice wiped text messages between former FBI employees Lisa Page and Peter Strozk from their cell phones before the Office of the Inspector General could review them, a new report from the DOJ watchdog reveals,\" Payton wrote. \"Page and Strozk’s involvement with special counsel Robert Mueller’s investigation has been heavily scrutinized after it was revealed they had sent numerous anti-Trump text messages back and forth to one another.\"", "About two weeks later, The Federalist published another story, this one reporting on Payton’s death. Some bloggers seized on the news.", "\"Reporter who broke story about Mueller destroying text messages found dead!!!\" reads one Facebook post accompanying a picture of Payton on Dec. 31.", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Some comments on the post agree with the suggestion that Payton was killed because of her reporting.", "\"You go against the Clinton’s (sic), or give information about criminal activity from the Democrats and you are risking your life,\" one Facebook user wrote. \"Lots of whistle blowers have mysteriously died.\"", "Another user posted a link to a Jan. 3 blog post on LewRockwell.com, a self-described repository for \"anti-state,\" \"anti-war\" and \"pro-market\" thought. There, a story by Richard Enos on Payton’s death reads: \"I don’t have definitive ‘proof’ for the notion that Payton was killed because she was going to disclose some type of sensitive information against the Deep State; however, it must be said that the cause and circumstance of her death are befuddling enough for one to consider such an idea.\"", "Other users weren’t buying it. One posted a link to a Dec. 30 obituary in The New York Times that said Payton \"had H1N1 flu, also known as the swine flu, and encephalitis, according to her family.\"", "Earlier in December, the Centers for Disease Control and Prevention announced that flu activity was elevated across the country. By Dec. 21, seven flu-related pediatric deaths had been reported.", "The New York Times obit cites a tweet from a friend, Morgan Murtaugh, who had asked Payton to stay with her for Christmas.", "\"24 hours ago I found my friend unconscious and called 911,\" Murtaugh tweeted on Dec. 28, before Payton died. \"She’s been in a coma since and really needs a miracle right now. Please, if you’re religious at all, send prayers this way. We really need them.\"", "On Jan. 3, Murtaugh retweeted DC McAllister, a contributor to The Federalist among other publications.", "\"People who are saying Bre Payton was murdered bc she reported that texts were wiped from Strzok & Page’s IPhones needs to stop,\" McAllister wrote. \"We are grieving her death and don’t need this nonsense. She reported what was already in the OIG report. No cause for murder. She died of an illness.\"", "We rate this claim Pants on Fire!", "Facebook post, Dec. 31, 2018", "The Federalist, \"DOJ destroyed missing Strzok/Page text messages before the IG could review them,\" Dec. 13, 2018", "LewRockwell.com, \"Journalist who broke story of Mueller deleting text messages dies mysteriously,\" Jan. 3, 2019", "The New York Times, \"Bre Payton, conservative writer and Fox News commentator, dies at 26,\" Dec. 30, 2018", "Morgan Murtaugh tweet, Dec. 28, 2018", "DC McAllister tweet, Jan. 3, 2019", "The Federalist, \"Bre Payton, beloved staff writer at The Federalist, has passed away,\" Dec. 28, 2018", "Centers for Disease Control and Prevention, \"2018-2019 Flu Season: Flu activity elevated nationally,\" Dec. 21, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]