["About this rating", "A viral piece of text concerning the relationship between the United States and its northern neighbor Canada is often attributed to Robert Meadows, a circuit court judge in Florida. This essay is frequently preceded by the title \"Thank You Canada,\" the byline of Robert Meadows (Circuit Court Judge, Florida), and the statement that the piece is \"one American's take on the growing trade war with the US and Canada\":", "This essay does offer \"one American's take\" on the relationship between the United States and Canada, but that American is a resident of Portland, Oregon, and not a Florida judge.", "This text was first posted online by Facebook user Bruce Lindner on 7 June 2018, shortly after President Trump announced that he would be imposing steel and aluminum tariffs on imports from Canada.  It opened by imploring readers to \"consider how lucky we Americans are to have the neighbors we have\":", "Lindner's original post is nearly identical to the viral version incorrectly attributed to Meadows, with the notable exception of the closing line. The original version written by Lindner ended with a dig at conservative politicians and their perceived allegiance to Don and Vlad (President Trump and Vladimir Putin):", "On behalf of an embarrassed nation, people of Canada, I apologize for this idiotic and wholly unnecessary attack. Please leave the back channels open. We the People of the progressive persuasion stand with you. The people of the conservative persuasion stand with Don and Vlad’", "Lindner's post was shared more than 70,000 times, and his name remained attached to the post for at least a month. As his writing was copied and pasted by various Facebook users, however, the text was eventually stripped of mention of its original author. It's unclear how Judge Meadows' name became associated with this text, but by September 2018 this piece was nearly always introduced with the statement that it was written by a judge in Florida.", "A few weeks after Lindner's post went viral, he returned to Facebook to post a brief followup message about the reach of his original piece:", "Bryan, Bob.   \"'A Slow-Motion Train Wreck': Trump is Kicking Off a Trade War with America's Closest Allies.\"\r\n    Business Insider.   31 May 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]