["This video was posted here on Facebook. It has been viewed more than 1,000 times.", "\"Share! Stop! Do not accept the vaccine as it is the sign of the beast,” the Romanian-language caption reads.", "“Whoever accepts this vaccine will lose their soul in the Gehenna forever. Do not fear those who kill the body, but who cannot kill the soul; rather fear He who can lose both body and soul in the Gehenna. (Matthew, 10:28)”.", "The 18-second clip shows people dressed in white running into a tent as armed soldiers look on. A close-up shot of a person’s arm then shows them receiving an injection that features the Microsoft logo. The people in white then emerge from the tent as Bill Gates’s face appears in the sky.", "A voice-over in German says, “We are forced into vaccination out of fear of the virus. Greedy businesspeople around Microsoft founder Bill Gates intend to use this to implant a microchip into mankind in order to obtain total control.”", "A blue logo in the bottom-left corner of the video reads “Galileo Spezial”.", "The video has been shared on social media around the world in various languages, including Arabic, Thai and Romanian.", "Microsoft co-founder Bill Gates has been a leading advocate for a Covid-19 vaccine, a stance that has made him a target of anti-vaccine campaigners and other groups who have implicated him in various conspiracy theories about the crisis.", "The Bill & Melinda Gates Foundation has invested more than $1.75 billion to fight the pandemic.", "Microchip implants", "Health experts have dismissed claims that Covid-19 vaccines contain a microchip.", "Waseem Khawaja, a doctor and spokesman for the Pakistan Institute of Medical Sciences in Islamabad, said people should ignore such conspiracy theories.", "“This kind of vaccine which has a mind-control chip is not in our knowledge,” he said told AFP by phone on January 19, 2021. “People should not pay heed to such social media posts and make sure to get only government-approved vaccines for Covid-19\".", "Nigel McMillan, a professor of infectious diseases at Australia’s Griffith University, also rejected the idea that microchips could be implanted through Covid-19 vaccines.", "“No such technology exists at this time,” he told AFP in an email on December 8, 2020.", "Original video", "The video in the misleading post is a clip from a longer video by German TV station Galileo. The original video is an explainer about conspiracy theories circulating during the pandemic.", "A keyword search on Galileo’s YouTube channel found the original report posted on December 19, 2020, called “Why are conspiracy theories booming?”", "“In 2020, various conspiracy theories spread with COVID-19,” the description on Galileo’s website reads.", "“Corona is an invention of the establishment, Bill Gates wants to usurp world domination with a vaccine, 5G transmission masts spread the coronavirus. Anti-corona demos are becoming an instrument for right-wing extremists. Why is the global event a breeding ground for conspiracy theories? What are they and why do right-wing extremists take advantage of them? 'Galileo Special' is looking for answers.”", "The 50-minute report includes an interview with Sabine Riede, an advisor for German consulting agency Sekten-Info NRW who explains how people can fall for conspiracy theories “because they feel powerless”.", "Prior to footage shared in the misleading clip, the German narrator says “It gets difficult, if we decline vaccines because of these [conspiracy theories]. The theory is:”", "The footage in the misleading clip starts at the 21:52 minute mark.", "Below is a screenshot comparison of the misleading Facebook post (left) and the original video on Galileo’s website (right):", "Bill Gates rejects conspiracies", "Bill Gates has repeatedly spoken out to reject conspiracy theories accusing him of meddling with Covid-19 vaccines.", "“I’ve never been involved with any microchip thing,” Gates told reporters in June 2020 following the announcement of a five-year, USD1.6 billion initiative to deliver vaccines to “the world’s poorest countries”.", "Contacted by AFP in June, a spokesperson for the Bill & Melinda Gates Foundation said any purported link between Gates and microchipped vaccines was false.", "In an interview with Reuters news agency on January 27, 2021, Gates said “nobody would have predicted that I and Dr. Fauci would be so prominent and really evil theories about did we create the pandemic are we trying to profit from it and on and on. I’m very surprised by that.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]