["Citing an unnamed source in Donald Trump’s \"orbit,\" a March 4 blog post claims that former Secretary of State Hillary Clinton was arrested by eight U.S. Navy SEALs loyal to the former president.", "After supposedly firing a tranquilizer dart into her neck, taping her mouth shut, and covering her head in a black cloth bag on the night of March 2, the SEALs arrested Clinton on charges of treason, destruction of government property and aiding and abetting the enemy, according to the blog post published on a website called Real Raw News.", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There is no evidence to support the claim that Clinton was arrested, and plenty to refute it.", "She has tweeted regularly in the days since the alleged arrest, promoting new episodes of her podcast \"You and Me Both\" on March 2 and March 9, and she’s made appearances on camera.", "On March 8, she participated in a live Washington Post interview for International Women’s Day and an online Q&A with House Speaker Nancy Pelosi and inaugural poet Amanda Gorman.", "On Instagram on March 11, Clinton posted a video featuring former Presidents Barack Obama, George Bush and Bill Clinton and images of the ex-presidents and their wives, including Hillary Clinton, getting vaccinated.", "The arrest of a former secretary of state and two-time presidential candidate would be major international news, but a week after this blog post was published, no such media coverage has surfaced to corroborate its claims.", "That’s because it didn’t happen.", "We rate this post Pants on Fire!", "Real Raw News, Navy SEALs arrest Hillary Clinton, March 4, 2021", "Hillary Clinton tweet, March 8, 2021", "Hillary Clinton tweet, March 2, 2021", "Hillary Clinton tweet, March 9, 2021", "Deadline, Hillary Clinton offers some advice to Amanda Gorman on running for president at International Women’s Day Event, March 8, 2021", "Hillary Clinton Instagram post, March 11, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]