["About this rating", "Custom has ascribed specific meanings to each of the 13 folds applied to a U.S. flag.", "Flags are not folded 13 time because of these meanings.", "A much-shared item about the meanings of the folds in a flag reminds us of a joke told by deadpan comedian Steven Wright: \"Why is the alphabet in that order? Is it because of that song?\" As often happens, a \"meaning\" has been grafted onto some facet of everyday life, to the point that a symbolic and after-the-fact meaning has been confused with an original purpose:", "Have you ever wondered why the Flag of the United States of America is folded 13 times when it is lowered or when it is folded and handed to the next of kin at the burial of a veteran?", "Here is the meaning of each of those folds and what it means:", "The first fold of our Flag is a symbol of life.", "The second fold is a symbol of our belief in eternal life.", "The third fold is made in honor and remembrance of the veterans departing our ranks who gave a portion of their lives for the defense of our country to attain peace throughout the world.", "The fourth fold represents our weaker nature, for as American citizens trusting, it is to Him we turn in times of peace as well as in time of war for His divine guidance.", "The fifth fold is a tribute to our country, for in the words of Stephen Decatur, \"Our Country, in dealing with other countries may she always be right; but it is still our country, right or wrong.\"", "The sixth fold is for where our hearts lie. It is with our heart that we pledge allegiance to the Flag of the United States of America, and to the Republic for which it stands, one Nation under God, indivisible, with liberty and justice for all.", "The seventh fold is a tribute to our Armed Forces, for it is through the Armed Forces that we protect our country and our flag against all her enemies, whether they be found within or without the boundaries of our Republic.", "The eighth fold is a tribute to the one who entered into the valley of the shadow of death, that we might see the light of day, and to honor mother, for whom it flies on Mother's Day.", "The ninth fold is a tribute to womanhood; for it has been through their faith, their love, loyalty and devotion that the character of the men and women who have made this country great has been molded.", "The tenth fold is a tribute to the father, for he, too, has given his sons and daughters for the defense of our country since they were first born.", "The eleventh fold, in the eyes of a Hebrew citizen represents the lower portion of the seal of King David and King Solomon, and glorifies in their eyes, the God of Abraham, Isaac, and Jacob.", "The twelfth fold, in the eyes of a Christian citizen, represents an emblem of eternity and glorifies, in their eyes, God the Father, the Son and Holy Spirit.", "The thirteenth fold: When the Flag is completely folded, the stars are uppermost reminding us of our Nation's motto, \"In God We Trust.\" After the Flag is completely folded and tucked in, it takes on the appearance of a cocked hat, ever reminding us of the soldiers who served under General George Washington, and the Sailors and Marines who served under Captain John Paul Jones, who were followed by their comrades and shipmates in the Armed Forces of the United States, preserving for us the rights, privileges, and freedoms we enjoy today.", "The next time you see a Flag ceremony honoring someone that has served our country, either in the Armed Forces or in our civilian services such as the Police Force or Fire Department, keep in mind all the important reasons behind each and every movement. They have paid the ultimate sacrifice for all of us by honoring our Flag and our Country.", "Traditional flag etiquette prescribes that before an American flag is stored or presented, its handlers should twice fold it in half lengthwise; then (from the end opposite the blue field) make a triangular fold, continuing to fold it in triangles until the other end is reached. This makes a triangular \"pillow\" of the flag with only the blue starred field showing on the outside, and it takes thirteen folds to produce: two lengthwise folds and eleven triangular ones.", "The American flag isn't folded in this manner because each of the folds has a special symbolic meaning; the flag is folded this way because it provides a dignified ceremonial touch that distinguishes folding a flag from folding an ordinary object such as a bedsheet, and because it results a visually pleasing, easy-to-handle shape. This thirteen-fold procedure was a common practice long before the creation of a ceremonial assignation of \"meaning\" to each of the steps.", "An elaborate flag folding ceremony incorporating these meanings has since been devised for special occasions such as Memorial Day and Veterans Day. These associations are \"real\" in the sense that they mean something to the people who participate in the ceremony, but they are not the reason why a flag is folded in the traditional thirteen-step manner. As was the case with the candy cane, an invented (religious) symbolism has become so widespread that it is now often mistakenly assumed to have been an integral part of the origins of the item it is associated with.", "It is also a common misbelief that the above-quoted script originated with the U.S. Air Force (USAF) and is used by default at all veterans' funerals conducted under the aegis of the U.S. military. This is not the case, as the USAF has noted:", "Though there are no official ceremonies in the Air Force that require a script to be read when a flag is folded, unofficial ceremonies such as retirements often do, said Lt. Col. Samuel Hudspath, Air Force protocol chief.", "\"We have had a tradition within the Air Force of individuals requesting that a flag be folded, with words, at their retirement ceremony,\" he said.", "There is no shortage of scripts available that can be read aloud during a flag folding, but many of those scripts are religious in nature and also ascribe meaning to the individual folds put into the flag. One of the oldest of those scripts is attributed to an anonymous chaplain at the U.S. Air Force Academy.", "Individuals who hear those scripts end up attributing the contents of the script to the U.S. Air Force. But the reality is that neither Congress, nor federal laws related to the flag, assign any special meaning to the individual folds.", "Corcoran, Michael.   For Which It Stands: An Anecdotal History of the American Flag. \r\n    New York: Simon & Schuster, 2002.   ISBN 0-743-23617-3.", "Lopez, C. Todd.   \"New Flag-Folding Script Focuses on History, AF Significance.\"\r\n    Air Force Print News.   18 August 2005.", "Singleton, David.   Honor Our Flag: How to Care For, Fly and Otherwise Respect the Stars and Stripes. \r\n    Guilford, CT: Globe Pequot Press, 2001.   ISBN 0-762-72368-8.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]