["The president strayed from the facts, mainly on immigration and the economy.", "By Eugene Kiely, Brooks Jackson, Lori Robertson, Robert Farley, D'Angelo Gore and Jessica McDonald", "Posted on February 6, 2019", "President Donald Trump’s State of the Union address included many claims that were familiar to fact-checkers. He has repeated most of these assertions before:", "The president’s address on Feb. 5 had been delayed by a week in the aftermath of a partial government shutdown. His remarks, and the false and misleading claims we noted, mainly concerned the issues of immigration and the economy.", "Trump wrongly claimed that El Paso transformed from a city with one of the highest violent crime rates to “one of the safest cities in our country” immediately after a border barrier was erected. Actually, El Paso was a relatively safe city before construction of a 57-mile-long fence started in mid-2008. And violent crime did not drop “immediately” after a fence was completed.", "Trump: The border city of El Paso, Texas, used to have extremely high rates of violent crime — one of the highest in the entire country, and considered one of our nation’s most dangerous cities. Now, immediately upon its building, with a powerful barrier in place, El Paso is one of the safest cities in our country.", "As we wrote when Trump made a similar claim on Jan. 14, El Paso has never been “one of our nation’s most dangerous cities.” The city had the third lowest violent crime rate among 35 U.S. cities with a population over 500,000 in 2005, 2006 and 2007 – before construction of a 57-mile-long fence started in mid-2008.", "Nor did violent crime drop “immediately” after the fence went up. In fact, the city’s violent crime rate increased 5.5 percent from 2007 to 2010 — the years before and after construction of the fence, which was completed in mid-2009. Those years were not anomalies. Violent crime increased about 9.6 percent between 2006 and 2011 — two years before the fence construction began and two years after it was finished.", "Along with the rest of the country, El Paso’s violent crime rate spiked in the early 1990s and has been trending downward ever since. The city’s violent crime rate dropped 62 percent from its peak in 1993 to 2007, a year before construction on the fence began.", "Trump referred twice to human trafficking when making the case for ending illegal immigration. However, experts say typically the cases they deal with concerning foreign nationals are people brought through legal ports of entry.", "The president said it was time “for the Congress to show the world that America is committed to ending illegal immigration and putting the ruthless coyotes, cartels, drug dealers, and human traffickers out of business.” But ending illegal immigration wouldn’t end human trafficking.", "He later said the traffickers “take advantage of the wide open areas between our ports of entry to smuggle thousands of young girls and women into the United States and to sell them into prostitution and modern-day slavery.” There’s no data on how many are smuggled illegally across the border with Mexico for human trafficking, experts say.", "“Yes, in some cases it does happen,” Brandon Bouchard, director of media relations for Polaris, which operates the National Human Trafficking Hotline, said of people being smuggled across the border. Based on the group’s experience, however, “we believe the vast majority of people are coming through legal ports of entry.” And the statistics the group has, which come from the calls it receives through the hotline, show that labor trafficking is the largest trafficking issue for foreign nationals.", "“When it’s labor trafficking, people are recruited in their home country under false pretenses,” Bouchard told us. “They think they’re coming into the U.S. for a job.”", "The available data suggest most come through ports of entry. The United Nations’ International Organization on Migration has found that “nearly 80% of international human trafficking journeys cross through official border points, such as airports and land border control points,” based on 10 years’ worth of cases on which the IOM has assisted.", "“Children are less likely to be trafficked through official border points: out of all the children in our sample, official border points are used in 56% of cases,” the Counter-Trafficking Data Collaborative, an IOM initiative, says.", "Polaris’ data for the U.S. come from those who call its hotline. From January 2015 through the end of June 2018, calls to the hotline reported more than 35,000 potential victims of trafficking. And of those victims whose immigration status was known (nearly 14,000), half were U.S. citizens or legal permanent residents and half were foreign nationals, according to Bouchard.", "Martina Vandenberg, founder and president of the Human Trafficking Legal Center, told us the center searched its database of 1,435 trafficking cases since 2009 for those involving kidnapping or smuggling charges. It found 26 and 29 cases, respectively, that also included those charges. “The data refute the claims Trump is making about the efficacy of a wall,” she said.", "Evangeline M. Chan, director of the Immigration Law Project at Safe Horizon, a group that assists trafficking survivors in New York City, said that trafficking “is a much more complex and nuanced problem than most people realize.” The type of coercion used is “a lot more subtle” than a kidnapping-type scenario.", "Typically what Chan sees are victims who are “lured into the country with promises of a better life.” They’re “very often brought to the country legally through ports of entry and using visas and legal documents.”", "A large portion of the survivors Safe Horizon assists are from Southeast Asia, but the next area of origin is Mexico and Central America, she said.", "Trump also said a “strong security wall” along San Diego’s border with Mexico “almost completely ended illegal crossings.” That’s not accurate.", "According to a 2009 report by the nonpartisan Congressional Research Service, the U.S. Border Patrol began in 1990 to build a 14-mile fence along San Diego’s border with Mexico. The fence was completed in 1993, but it could not alone stop the flow of people crossing the border illegally, CRS said.", "“The primary fence, by itself, did not have a discernible impact on the influx of unauthorized aliens coming across the border in San Diego,” CRS said.", "In response, Border Patrol on Oct. 1, 1994, launched “Operation Gatekeeper,” which provided significant manpower and other resources along the border.", "CRS, March 16, 2009: Operation Gatekeeper resulted in significant increases in the manpower and other resources deployed to San Diego sector. Agents received additional night vision goggles, portable radios, and four-wheel drive vehicles, and light towers and seismic sensors were deployed. According to the former INS, between October 1994 and June of 1998, San Diego sector saw the following increases in resources:", "In fiscal year 1992, border patrol apprehended 565,581 immigrants attempting to cross into the U.S. illegally in the 60-mile San Diego sector. Apprehensions fluctuated in the following few fiscal years (531,689 in 1993, 450,152 in 1994, 524,231 in 1995 and 483,815 in 1996) before significantly dropping beginning in fiscal year 1997 (283,889) and the years thereafter, according to USBP statistics.", "By fiscal year 2010, apprehensions had dropped to 68,565 and declined further to 26,290 by fiscal 2015.", "In a video, CBP credits the decline to a strategy that included “[i]ncreased manpower, utilized intelligence, focused prosecutions, technology was advanced and tactical infrastructure was improved by adding fencing, all-weather roads and stadium lighting.”", "In calling on Congress to approve his border security plan, which includes spending $5.7 billion on a border wall, Trump said it is needed to stop the flow of illegal drugs into the United States from Mexico.", "Trump, Feb. 5: Tens of thousands of innocent Americans are killed by lethal drugs that cross our border and flood into our cities — including meth, heroin, cocaine and fentanyl.", "However, as we have written, experts — including those within his administration — say that the majority of illicit drugs from Mexico enter the U.S. in cars and trucks traveling through legal ports of entry.", "That’s particularly true of deadly opioids — heroin and fentanyl — that the president singled out in his speech.", "The 2018 National Drug Threat Assessment says the Southwest border “remains the primary entry point for heroin into the United States.”", "“The majority of the [illegal heroin] flow is through [privately owned vehicles] entering the United States at legal ports of entry, followed by tractor-trailers, where the heroin is co-mingled with legal goods,” the report said.", "“A small percentage of all heroin seized by CBP along the land border was between Ports of Entry,” the report added.", "The DEA report also said Mexican cartels “most commonly smuggle the multi-kilogram loads of fentanyl concealed in” privately owned vehicles through the legal ports of entry.", "Last month, U.S. Customs and Border Protection made the largest fentanyl bust in its history when a Mexican national “attempted to enter the United States through the Port of Nogales.” Border agents discovered nearly 254 pounds of fentanyl worth about $3.5 million “concealed within a special floor compartment of a trailer that was laden with cucumbers.”", "For an earlier story we wrote in August 2017, Peter Reuter, a University of Maryland criminal justice professor who founded and directed RAND’s Drug Policy Research Center from 1989 to 1993, told us he was skeptical of Trump’s repeated claims that a wall — or more accurately, building additional physical barriers — would stop drugs from coming into the United States from Mexico.", "In addition to the fact that most drugs come through legal ports of entry, Reuter said that smugglers have a history of adapting to law enforcement’s attempts to stop the flow of illegal drugs.", "Trump said that “more people are working now than at any time in our history –- 157 million.” That’s roughly accurate, but it’s not such a remarkable feat when taking into account steady population growth.", "Although Trump is fond of citing this statistic, the number of people working in the U.S. has increased fairly steadily for as long as such figures have been tracked by the Bureau of Labor Statistics.", "There have been exceptions, notably during recessions, when the number of people employed has declined even as the population increased. That’s what happened during the Great Recession. But after the Great Recession ended in 2009, the number of people employed in the U.S. began rising steadily (again) in early 2010, and has set historical “records” every month since mid-2014. So President Barack Obama could have correctly claimed that there were more people employed in the U.S. than at any time in the country’s history for 32 straight months at the end of his presidency (though we could find no evidence that he ever did).", "A more meaningful way to take the population increase into account is to look at the labor force participation rate, which BLS defines as a measure of the number of people in the labor force as a percentage of the population. The labor force participation rate for people ages 25 to 54 in January was 82.6 percent, according to BLS. That’s a little more than 1 percentage point higher than when Trump took office, but it is not the highest in history. It was higher from the late 1980s to the late 2000s, and peaked at 84.6 percent in January 1999.", "Another good measure is the employment-population ratio, which is the percentage of the population that is working. Looking again at that statistic just for those ages 25 to 54, the ratio has been steadily climbing since 2011, and was at 79.9 percent in January. But that’s not a record high either. It peaked at 81.9 percent in April 2000.", "Later in his speech, Trump boasted, “All Americans can be proud that we have more women in the workforce than ever before.” That’s also not so extraordinary, given population growth. The number of women in the workforce has set records fairly consistently for as far back as the Bureau of Labor Statistics‘ online tool goes, to 1964. As with overall employment, there was a dip in the number of working women during the Great Recession, but the number has been climbing steadily since late 2010, and has again been setting new historical highs every month since July 2013.", "Trump exaggerated the number of job gains on his watch.", "Trump: We have created 5.3 million new jobs and importantly added 600,000 new manufacturing jobs — something which almost everyone said was impossible to do.", "Actually, Bureau of Labor Statistics figures show the economy has added just under 4.9 million jobs since January 2017, when he took office — not 5.3 million. And the economy added 454,000 manufacturing jobs during Trump’s tenure — not 600,000.", "Trump prefaced his remark by saying he was speaking of the time “since the election,” thus claiming credit for jobs created during that last months of Barack Obama’s time in office.", "But even so, he’s way off on the manufacturing jobs. Only 481,000 have been added since November 2016. To get a gain of 600,000 you must go back to September 2014. Trump is claiming credit for jobs created months before he even announced he was running for the White House.", "The president boasted that “African American, Hispanic American and Asian American unemployment have all reached their lowest levels ever recorded.”", "It’s true that the unemployment rates for all three groups reached the lowest ever recorded in at least one month during the last year, but the percentage point gap between white unemployment and the rate for black and Hispanic Americans has remained about the same. Also, the unemployment rates for all Americans, including for African Americans, Hispanics and Asians, has been steadily dropping since late 2010 and early 2011.", "The black unemployment rate dropped to its lowest level, 5.9 percent, in May 2018, since the BLS began measuring it in 1972. It has since inched back up, and was at 6.8 percent in January. The white unemployment rate in January was 3.5 percent, or 3.3 percentage points lower than the black unemployment rate. When Trump took office in January 2017, the black unemployment rate was 7.7 percent, 3.4 percentage points higher than the rate for whites.", "The percentage point gap between white and Hispanic unemployment rates has also remained about the same. In January 2017, the Hispanic rate, at 5.8 percent, was 1.5 percentage points higher than the rate for whites, and in January, the Hispanic rate was 4.9 percent, 1.4 percentage points higher than for whites.", "“The declines in [black] unemployment are tracking those of the overall economy but remain double those of white workers,” Marcus Casey, a fellow in economic studies at the Brookings Institution, told us via email. “This has been the case for a long time. While certainly this looks a lot better than the Great Recession, it’s notable that over this period blacks became more educated and skilled, yet are still unable to break this long historical trend.”", "Last year, when Trump similarly took credit for the lowest black unemployment rate in U.S. history, Casey and Bradley Hardy, another Brookings fellow, wrote a paper arguing that “the unemployment rate alone presents a revealing but incomplete picture of economic well-being within any community.”", "We also have noted that unemployment rates in general, as well as those for black and Hispanic Americans, have been steadily declining since late 2010 and early 2011. (See chart below.)", "The black unemployment rate fell 8.8 percentage points in the seven years before Trump took office, and it has continued to drop in the two years under Trump. The rate was 7.7 percent in January 2017, when Trump took office. So it dropped a little less than 1 percentage point in the two years under Trump.", "Trump also inflated the reduction in food-stamp recipients.", "Trump: Nearly 5 million Americans have been lifted off food stamps.", "Actually, since Trump took office, the number has gone down 4.1 million  — not 5 million. That’s as of September, the most recent month for which figures are available.", "Once again, Trump is padding his numbers by claiming credit for things that occurred during Obama’s final months as president, after Trump was elected but before he took office.", "The president’s comments on two state abortion bills require context.", "Trump: Lawmakers in New York cheered with delight upon the passage of legislation that would allow a baby to be ripped from the mother’s womb moments from birth. These are living, feeling, beautiful babies who will never get the chance to share their love and their dreams with the world. And then, we had the case of the governor of Virginia where he stated he would execute a baby after birth.", "The New York law the president referenced is the Reproductive Health Act, which Democratic Gov. Andrew Cuomo signed on Jan. 22, the anniversary of Roe v. Wade. As we’ve written in more detail, the law modifies the state’s existing abortion law to expand the circumstances under which abortions after 24 weeks are allowed.", "Previously, pregnancies after 24 weeks could be terminated only if they were life-threatening. The new law provides for two more instances in which abortions would be allowed: the “absence of fetal viability” or to protect the patient’s health.", "Trump also alluded to statements Gov. Ralph Northam made in a radio interview following the controversial introduction of a similar abortion bill in Virginia. In the interview, Northam, who is a physician, said third-trimester abortion is “done in cases where there may be severe deformities. There may be a fetus that’s nonviable. So in this particular example, if a mother’s in labor, I can tell you exactly what would happen. The infant would be delivered, the infant would be kept comfortable, the infant would be resuscitated if that’s what the mother and the family desired. And then a discussion would ensue between the physicians and the mother.”", "Northam’s words were interpreted by some to mean that he was suggesting infanticide. As multiple news outlets reported, Northam later clarified that he was not talking about infanticide. A spokesperson for Northam said his comments were “focused on the tragic and extremely rare case in which a woman with a nonviable pregnancy or severe fetal abnormalities went into labor.”", "Trump claimed credit for the country’s energy resources, saying, “We have unleashed a revolution in American energy — the United States is now the number one producer of oil and natural gas anywhere in the world.”", "It’s true that America is the top producer of both oil and natural gas. But, according to the Energy Information Administration, the United States became the top natural gas producer in 2009 after surpassing Russia, and also has been number one in petroleum production since 2013.", "Over the summer, the EIA announced that America’s crude oil production exceeded Russia’s for the first time since 1999, making it the leading producer in the world. But the boom has been in the works for a decade, and has long been expected. As we’ve written before, the International Energy Agency predicted in its 2012 World Energy Outlook that the U.S. would take the top crude oil spot by 2020, driven by hydraulic fracturing, or fracking.", "Trump also said that “for the first time in 65 years, we are a net exporter of energy.” The United States is not yet a net exporter of energy. As of Jan. 29, the EIA predicted that the nation would export more energy than it imports in 2020. That’s soon, but it’s not a milestone that the president can accurately claim.", "The EIA explains that America has imported more energy than it exports since 1953. The anticipated switch to net exporter is due to increases in crude oil, natural gas and natural gas plant liquids production that outstrip domestic consumption.", "Trump said that “after four decades of rejection, we passed VA Accountability so that we can finally terminate those who mistreat our wonderful veterans.” But it’s not true that nothing could previously be done to fire VA employees.", "As we’ve written before, the bipartisan Veterans Affairs Accountability and Whistleblower Protection Act aims to make it easier for the VA secretary to remove employees by, among other things, shortening the firing process and expediting the appeals process for senior executives. However, employees could still be fired before that legislation became law.", "The Office of Personnel Management keeps data on federal employment, including terminations for discipline or performance going back to fiscal year 2005. The data show that, on average, the VA fired about 2,300 employees each fiscal year before Trump’s presidency. The average is nearly the same when calculated by calendar year, which lines up more closely to when presidents take office in late January. (The VA had more than 388,000 total employees, as of June 2018, according to OPM.)", "For example, the VA terminated 3,321 people for performance and disciplinary reasons in 2017, and 1,181, or 35.6 percent, of all those firings occurred in the five full months before Trump signed the legislation into law in late June 2017.", "Bureau of Labor Statistics. Unemployment Rate – Black or African American. Accessed 6 Feb 2019.", "Bureau of Labor Statistics. Unemployment Rate – Hispanic or Latino. Accessed 6 Feb 2019.", "Casey, Marcus, and Hardy, Bradley. “Reduced unemployment doesn’t equal improved well-being for black Americans.” Brookings. 15 Feb 2018.", "Farley, Robert. “Trump’s Pointless Job Boast.” Factcheck.org. 25 Jan 2019.", "Bureau of Labor Statistics. Employment, Hours, and Earnings from the Current Employment Statistics survey (National). All employees, thousands, total nonfarm, seasonally adjusted. Accessed 6 Feb 2019.", "Bureau of Labor Statistics. Labor Force Participation Rate – 25-54 yrs. Accessed 6 Feb 2019.", "Bureau of Labor Statistics. Employment-Population Ratio – 25-54 yrs. Accessed 6 Feb 2019.", "Bureau of Labor Statistics. Employment, Hours, and Earnings from the Current Employment Statistics survey (National). Women employees, thousands, total nonfarm, seasonally adjusted. Accessed 6 Feb 2019.", "Farley, Robert. “Trump Wrong About Wall Effect in El Paso.” Factcheck.org. 18 Jan 2019.", "Robertson, Lori. “Dueling Claims on Crime Trend.” Factcheck.org. 13 Jul 2016.", "Bouchard, Brandon, director of media relations, Polaris. Phone interview with FactCheck.org. 5 Feb 2019.", "Vandenberg, Martina, founder and president of the Human Trafficking Legal Center. Phone interview with FactCheck.org. 5 Feb 2019.", "Chan, Evangeline M., director of the Immigration Law Project, Safe Horizon. Phone interview with FactCheck.org. 5 Feb 2019.", "Counter-Trafficking Data Collaborative. Type of Border Crossings Victims of Trafficking Make. Accessed 6 Feb 2019.", "Bureau of Labor Statistics. “Employment, Hours, and Earnings from the Current Employment Statistics survey (National); Total Nonfarm Employment, Seasonally Adjusted.” Data extracted 5 Feb 2019.", "Bureau of Labor Statistics. “Labor Force Statistics from the Current Population Survey; All employees, thousands, manufacturing, seasonally adjusted.” Data extracted 5 Feb 2019.", "U.S. Department of Agriculture, Food and Nutrition Service. “Supplemental Nutrition Assistance Program (Data as of Dec 7, 2018).” Data extracted 5 Feb 2019.", "EIA. “United States remains the world’s top producer of petroleum and natural gas hydrocarbons.” 21 May 2018.", "EIA. “The United States is now the largest global crude oil producer.” 12 Sep 2018.", "EIA. “U.S. monthly crude oil production exceeds 11 million barrels per day in August.” 1 Nov 2018.", "EIA. “The United States is expected to export more energy than it imports by 2020.” 29 Jan 2019.", "International Energy Agency. “World Energy Outlook 2012: Executive Summary.” Nov 2012.", "Kiely, Eugene. “FactChecking Trump’s Energy Boasts.” FactCheck.org. 8 Jun 2018.", "Cole, Devan. “Virginia governor faces backlash over comments supporting late-term abortion bill.” CNN. 31 Jan 2019.", "Fichera, Angelo. “Addressing New York’s New Abortion Law.” FactCheck.org. 4 Feb 2019.", "“Governor Cuomo Signs Legislation Protecting Women’s Reproductive Rights.” Press release, New York Gov. Andrew Cuomo. 22 Jan 2019.", "New York State Senate. “S. 240, Enacts the reproductive health act; repealer” (as signed by Governor 22 Jan 2019).", "North, Anna. “The controversy around Virginia’s new abortion bill, explained.” Vox. 1 Feb 2019.", "Suderman, Alan. “Virginia abortion feud erupts; governor blasted for comments.” Washington Post. 30 Jan 2019.", "Kiely, Eugene. “Will Trump’s Wall Stop Drug Smuggling?” FactCheck.org. 30 Aug 2017.", "Farley, Robert et al. “Trump’s Border Blunders.” FactCheck.org. 2 Jan 2019.", "Drug Enforcement Administration. “2018 National Drug Threat Assessment.” Department of Justice. Oct 20118.", "Press release. “CBP Officers Seize Largest Amount of Fentanyl in CBP History.” U.S. Customs and Border Protection. 31 Jan 2019.", "Congressional Research Service. “Border Security: Barriers Along the U.S. International Border.” 16 Mar 2009.", "U.S. Border Patrol. “Southwest Border Sectors: Total Illegal Alien Apprehensions By Fiscal Year.” Undated. Accessed 5 Feb 2019.", "U.S. Customs and Border Protection. “The Shift – October Edition.” YouTube. 17 Feb 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]