["On April 28, conservative commentator and political activist Candace Owens accused the Centers for Disease Control and Prevention of misreporting flu deaths.", "“According to CDC reports – 2020 is working out to be the lowest flu death season of the decade,” she posted on Facebook. “It’s a miracle!”", "Owens posted a photo of a tweet she’d written the same day alongside her comment.", "“Possibly the greatest trade deal ever inked was between the flu virus and #coronavirus,” she tweeted. “So glad nobody is dying of the flu anymore, and therefore the CDC has abruptly decided to stop calculating flu deaths altogether.”", "Some Facebook and Twitter users questioned the validity of Owens' statistics. Others read between the lines of her sarcasm to comment on what she may be implying.", "“Not just lowest flu death, but also cancer deaths, diabetes deaths, heart disease deaths, and many other know(n) diseases,” one Facebook user wrote. “When hospitals are guaranteed payment from the federal government if it is classified as covid19 hospitalization, it becomes a business plan.”", "According to CDC data, none of Owens’ statistics is correct.", "Owens did not respond to USA TODAY's request for comment.", "The CDC uses mathematical estimates to retroactively measure the burden of each flu season. “The model uses a ratio of deaths-to-hospitalizations in order to estimate the total influenza-associated deaths from the estimated number of influenza-associated hospitalizations,” the CDC states, describing its methodology.", "This in-hospital mortality FluSurv-NET data is the basis from which larger, annual estimates are made. This data excludes all influenza-associated deaths that are misdiagnosed or occur outside a hospital.", "After each flu season, the CDC considers in-hospital death data and investigates death certificates to account for the total flu deaths. “(B)ecause not all deaths related to influenza occur in the hospital, we use death certificate data to estimate how likely deaths are to occur outside the hospital,” the CDC website explains.", "Flu seasons vary from year to year and don't have a strict timeline. Last year, flu season was the longest in a decade, lasting 21 weeks.", "“In the United States, flu season occurs in the fall and winter. While influenza viruses circulate year-round, most of the time flu activity peaks between December and February, but activity can last as late as May,\" the CDC website explains.", "To account for this ambiguous period the CDC releases weekly U.S. influenza summary updates from October through May.", "According to the CDC’s 2018-2019 estimates, there were 34,200 influenza-associated deaths from October 2018 to May 2019 – not 80,000 as Owens claimed on Facebook.", "The CDC estimated 61,000 influenza-associated deaths in the 2017-2018 season.", "So where did Owens’ 80,000 statistic come from?", "For the preliminary 2017-2018 season estimates the CDC approximated 79,400 influenza-associated deaths, which it later updated to 61,000 deaths and archived for historical purposes.", "\"All estimates from the 2017-2018 influenza season are preliminary and may change as data from the season are cleaned and finalized,\" the CDC estimated disclosed.", "The National Foundation for Infectious Diseases estimated 80,000 deaths for the same season. This NFID’s estimate came from unpublished CDC data and used estimation methodology that the CDC has since altered for better accuracy.", "The NFID is a nonprofit \"dedicated to educating the public and healthcare professionals about the burden, causes, prevention, diagnosis, and treatment of infectious diseases across the lifespan,\" its website states.", "The FluSurv-NET data for 2020 has not dipped after January as Owens claimed. It increased in February.", "The CDC reported fewer than 2,000 influenza-associated deaths in January – not 20,000 as Owens claimed. Since January, the CDC reported more than 5,000 influenza-associated deaths – not 4,000, as claimed.", "Keep in mind, this data only accounts for the patients who died in a hospital from diagnosed influenza. The CDC’s anticipated estimates for the season will be much larger than the 7,000 documented cases so far.", "From October 2018 to May 2019 the FluSurv-NET data accounted for about 7,000 influenza-associated deaths, which CDC ultimately used to estimate 34,200 total deaths for the 2018-2019 flu season.", "FluSurv-NET data shows there have been nearly as many influenza-associated deaths to date in 2020 as there were in all of 2019.", "This year’s total will continue to rise as the U.S. enters the 2020-2021 flu season in October, but it’s unlikely that increase will be significant since the majority of annual flu seasons decrease at the beginning of each year.", "The 2017-2018 flu season was the most deadly in the past decade with a CDC estimate of 61,000 deaths. The FluSurv-NET data for 2018 totaled nearly 15,000 in-hospital influenza-associated deaths.", "In the last decade, 2011-2012 was the least deadly, with 12,000 deaths, according to CDC data.", "The early FluSurv-NET data indicates that this 2019-2020 flu season isn’t shaping up to be the decade’s most or least deadly.", "We rate the claim that the CDC has stopped reporting flu deaths because the death rates are so low as FALSE because it is not supported by our research. The CDC continues to report weekly on the 2020 influenza season. Its data shows this season's rates are similar to rates of past years. Further, the rate of flu deaths did not decrease in January, as stated, nor was the total number of deaths in 2018-19 as high as claimed."]