["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Viral misinformation about the COVID-19 coronavirus disease pandemic was rampant in mid-March 2020. One example was a video created by \"futurologist\" Dän Lee Dimke who claimed that sticking a blow dryer in your face or sitting in a sauna and breathing in hot air would kill the coronavirus.", "The information given by Dimke in the video is not just false, but potentially dangerous.", "If you believe you're infected with the virus, you should isolate yourself from other people and contact a medical professional.", "We asked Google, which owns YouTube, what measures are being taken to prevent the spread of misinformation during the ongoing pandemic. We received no response in time for publication, but the link to the video we sent was removed.", "That said, copies of the video, or videos that repeat the false claim, remain live on the platform as of this writing. Many of the videos contain the logo of the Centers for Disease Control and Prevention (CDC), potentially giving the false impression that the information was sourced from the government agency on the front lines of battling the disease.", "No reputable medical professionals or institutions recommend people breathe hot air to kill the coronavirus. Contrary to what the video states, viruses don’t make you sick by congregating in your nasal cavities. They make you sick on a cellular level via mechanisms not easily stopped by something as simple as hot air.", "Because COVID-19 is caused by a new type of coronavirus, its danger is exacerbated by the fact that no therapeutic treatment has yet been developed, and no vaccine is yet available to prevent it. The CDC recommends that to protect yourself from infection, you should wash your hands frequently, avoid touching your face, and practice social distancing.", "Although Dimke describes himself as \"Dr. Dan Lee Dimpke\" in the viral video, Dimke is not a medical doctor. In a biography on his website, he claims to have a doctoral degree in education from Southwest University and a master's degree in business administration. His biography lists a number of unusual skills (jet helicopter pilot, for one) but doesn't describe any educational or professional experience that would qualify him to provide medical advice.", "Sharing misinformation during a pandemic could potentially have lethal consequences. COVID-19 is deadlier than the seasonal flu and in a matter of three months has spread globally. As residents of major U.S. cities were instructed to practice social distancing or in some situations shelter in place to help slow the spread of the coronavirus, COVID-19 has sickened and killed thousands worldwide.", "MedLinePlus.gov. \"Viral Infections.\"", "Fink, Sheri. \"Worst-Case Estimates for U.S. Coronavirus Deaths.\"\r\n  The New York Times. 13 March 2020.", "CBS News. \"Coronavirus Updates: Americans Told to Hunker Down as Death Toll Tops 100.\"\r\n  17 March 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]