["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "North Carolina ranks near the bottom of the list when it comes to education spending per pupil. Democrats have seized on state education funding as a way to attack Republican Senate candidate Thom Tillis.", "A recent television ad sponsored by Women Vote directs blame for education cuts at Tillis, current speaker of the house in the Republican-controlled North Carolina House of Representatives. Women Vote is an arm of EMILY's List, a political action committee that supports Democratic women who are in favor of abortion rights.", "\"Speaker Thom Tillis cut almost $500 million from education, causing crowded classrooms and forcing teachers to pay out-of-pocket for school supplies, while Tillis protected tax breaks for yachts and jets,\" the ad said.", "Tillis is running against incumbent Democrat Sen. Kay Hagan, whose campaign has also used the $500 million figure -- as have numerous media reports.", "We wondered if Tillis is responsible for such cuts.", "Where did the cuts come from?", "When we looked at North Carolina's education budget year to year, it has increased every year since Tillis became speaker in 2011. According to a document prepared by the General Assembly, the state education budget was $10.8 billion in the 2010-11 fiscal year and $11.5 billion for 2014-15. (These numbers are adjusted for inflation and include both K-12 and higher education spending.)", "Additionally, state expenditure per pupil for K-12 has increased since 2011 -- from $5,156 in 2011 to $5,395 in 2013.", "Education spending in North Carolina comes from a combination of federal, state and local dollars. State funding accounts for more than 62 percent of expenditures.", "So did Women Vote pull that $500 million cut out of thin air? No, but it's complicated.", "Each year, the North Carolina Office of State Budget and Management creates a continuation budget, which is a tool that outlines how much should be spent to maintain the current service level, without cutting or adding services. The projection might be larger or smaller than previous years because it takes into account factors such as inflation, population growth and operating new facilities. Lawmakers are not obliged to match the continuation budget.", "For the 2013-15 budget, the state budget office proposed a continuation budget of about $23.6 billion for those two years to maintain the status quo across K-12 and higher education. The budget that state lawmakers passed came up to about $23.1 billion. In total, lawmakers allocated $481 million less than the the continuation budget suggested. (EMILY's List and Hagan's campaign pointed us to this when we asked about the ad.)", "That shortfall ended up dividing the political parties in North Carolina: Last year, Tillis took to the floor to push lawmakers to pass the budget, while Democrats bashed the bill primarily because they believed the education allocations weren't adequate. The bill passed 65-53 in the House and 32-17 in the Senate, with no Democratic votes in favor.", "It’s important to note that the Legislature’s choosing to fund at levels lower than the continuation budget is not a literal budget cut. In raw dollars, the state is spending more money than in previous years.", "However, Tillis’ critics say it has the same effect as a cut.", "\"If you’re not doing what it takes to maintain the status quo, it’s a cut,\" said Hagan spokeswoman Sadie Weiner.", "Some other critics of Tillis’ education record have noted that state funding for K-12 education in North Carolina is about $500 million less than pre-recession levels. In the 2013-14 school year, public school spending was about $7.9 billion. In 2008-2009, it was $8.4, when adjusted for inflation.", "The budget affecting the 2014-15 school year eliminated 5,200 teachers, 3,800 teacher assistants and about $115 million for textbooks and instructional supplies, among other services, said Philip Price, CFO for the North Carolina Department of Public Instruction. It also increases student-teacher ratios.", "The budget added a small number of new programs, but the vast majority of state education spending growth over the years comes down to rising healthcare and retirement costs.", "\"That doesn’t help the students,\" Price said. \"It doesn’t mean you get more teachers. It doesn’t change what is available to that classroom.\"", "Reductions in federal and local education spending -- as well as funding shifts due to rising charter school popularity -- could also be a major reason why schools feel as if their funds have shrunk, despite a steadily increasing state budget, said Terry Stoops, director of research and education policy at the John Locke Foundation, a North Carolina think tank that promotes limited government. He added that between 2010 and 2013, federal funding to North Carolina schools dropped by $337.6 million.", "But when the federal government stopped giving North Carolina schools stimulus funding, the state did not pick up the slack, Price said.", "The state's shrinking spending on classroom services is part of a trend that has been going on since the recession -- back to when Democrats controlled the General Assembly -- and can't be solely blamed on one speaker of the house, he added.", "A final note: The ad also claims that Tillis preserved tax breaks for yachts and jets. That refers to a Republican-backed tax bill passed in 2013, under Tillis' leadership. The bill preserved a $1,500 cap on sales tax for yachts and jets.", "Our ruling", "An ad attacking Tillis said he \"cut almost $500 million from education.\"", "Literally, the ad is wrong. As North Carolina's Speaker of the House, Tillis helped pass a budget in 2013 that increased actual spending on education in comparison to previous years.", "But the budget spent almost $500 million less than what was requested to maintain the status quo, accounting for inflation and increased costs of various services. Additionally, the actual budget increase had a lot to do with rising costs of employee benefits, and not a lot to do with money that ends up in the classroom.", "We rate this claim Half True.", "Women Vote, \"Day in the Life,\" June 16, 2014", "Women Vote, \"Day in the Life\" Spot Backup, June 12, 2014", "N.C. General Assembly, Education General Fund Authorized Budget Summary: FY 2006-2015, accessed June 17, 2014", "N.C. General Assembly, \"Joint Conference Committee Report on the Continuation, Expansion and Capital Budgets,\" July 21, 2014", "Kay Hagan for U.S. Senate, \"Tillis’ 2013 budget cut education by nearly $500 million,\" accessed June 17, 2014", "N.C. Department of Public Instruction, Summary of Special Provisions, July 29, 2013", "N.C. Department of Public Instruction, \"Impact of Senate Budget\"", "N.C. GOP, \"NC House Republicans - State education spending: the facts,\" accessed June 17, 2014", "National Education Association, \"Rankings of the States 2012 and Estimates of School Statistics 2013,\" Dec. 2012", "N.C. Board of Education, Per-pupil expenditures, accessed June 18, 2014", "N.C. Board of Education, \"Highlights of the North Carolina Public School Budget,\" Feb. 2014", "N.C. Policy Watch, \"Tracking the cuts,\" Oct. 4, 2013", "N.C. Policy Watch Progressive Pulse, \"NC Budget Magnifying Glass: Senate budget fails to restore funding for textbooks and classroom instructional material,\"  June 4, 2014", "N.C. Policy Watch, \"Vouchers gain ground, public education loses in final budget,\" July 25, 2013", "News and Observer, \"NC tax bill closes some loopholes, preserves others,\" July 18, 2013", "News and Observer, \"In schools budget, a number isn’t just a number,\" Aug. 1, 2013", "News and Observer, \"Morning Memo: As NC ad spending tops $25M, another group enters the fray,\" June 16, 2014", "WRAL, \"General Assembly approves $20.6 billion state budget,\" July 24, 2013", "Interview with Sadie Weiner, spokeswoman for Kay Hagan, June 17, 2014", "Email interview with Jordan Shaw, spokesperson for Thom Tillis, June 17, 2014", "Email interview with Tazra Mitchell, policy analyst at the N.C. Budget and Tax Center, June 17, 2014", "Email interview with Terry Stoops, director of research and educational policy studies at the John Locke Foundation, June 17, 2014", "Interview with Mark Jewell, vice president of North Carolina Association of Educators, June 18, 2014", "Interview with Philip Price, CFO for the N.C. Department of Public Instruction, June 18, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]