["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former Arkansas Gov. Mike Huckabee cast doubt on the 2020 presidential election results in Georgia and said voters there would happily re-elect Donald Trump.", "On March 13, he tweeted, \"70% of Georgians said they would vote for Trump in 2024.\"", "\"And 55.5% disapprove of the job Biden is doing,\" Huckabee continued. \"Makes you wonder how Biden could have won Georgia, but you’d better not wonder that out loud.\"", "This post, which was also shared as a screenshot on Facebook, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We reached out to Huckabee seeking a source for the figures he cited but did not hear back.", "He appears to be quoting the results of a Georgia statewide survey conducted over a few days in March by the Trafalgar Group. The Georgia-based polling company released the results in a report on March 12, a day before Huckabee’s tweet.", "But Huckabee’s tweet suggests that 70% of all Georgians — including Democrats — favor Donald Trump for president in 2024. That’s not what the poll report says. The results on support for the former president as a 2024 candidate included \"only likely GOP primary voters.\"", "And 70% of that group said they would \"absolutely vote for Trump\" if he were to run in the Republican presidential primary that year.", "The group surveyed 1,093 respondents, including likely 2022 general election voters and GOP primary voters, the report says. The likely 2022 general election voters were not necessarily Republicans, according to Trafalgar, whose chief pollster is a veteran Republican strategist, Robert Cahaly. But some of the survey’s questions were asked only of likely Republican voters.", "The report says that 55.5% of respondents disapprove \"of how Joe Biden is handling the job of president,\" as Huckabee said in his tweet. That rating \"was among all likely 2022 general election voters regardless of party history of affiliation,\" according to Trafalgar.", "Biden won Georgia with 49.5% of the vote, beating Trump by about 12,000 votes. Georgia certified the results after a hand recount and audit.", "Cahaly incorrectly predicted that Trump would win the 2020 election, but in 2016, Trafalgar’s state surveys \"most effectively presaged Mr. Trump’s upset win,\" the New York Times reported. The firm doesn’t disclose its polling methods, the newspaper said in November.", "We couldn’t find other recent polls showing Biden’s approval rating in Georgia. According to FiveThirtyEight, which averages multiple Biden-approval polls, 52.9% of likely or registered voters in the United States approved of the president as of March 17, and 40.9% disapproved.", "A new poll from PBS NewsHour, NPR and the Marist Institute for Public Opinion found that about half of Americans said they approve of how Biden has served as president so far and 42% disapproved.", "Our ruling", "Huckabee said that 70% of Georgians said they would vote for Trump in 2024.", "That’s not the case. According to the Trafalgar Group’s poll, the 70% support for Trump was among likely Republican primary voters.", "We rate this post False.", "Facebook post, March 15, 2021", "Gwinnett Daily Post, Former Gov. Mike Huckabee: ‘There are a lot of unanswered questions’ about Georgia’s Nov. 3 election, Dec. 13, 2020", "Mike Huckabee tweet, March 13, 2021", "The Trafalgar Group, Georgia 2022 Senate, March 12, 2021", "Politico, Presidential election results 2020, visited March 16, 2021", "The New York Times, Hand tally of Georgia ballots reaffirms Biden’s win, updated Jan. 20, 2021", "The New York Times, The one pollster in American who is sure Trump is going to win, Nov. 8, 2020", "FiveThirtyEight, How popular is Joe Biden, visited March 17, 2021", "PBS NewsHour, New poll shows how Biden’s approval ratings compare to Trump, March 11, 2021", "FiveThirtyEight, Latest polls: Georgia, visited March 17, 2021", "Email interview with E. Caroline McFadden, assistant to CEO, The Trafalgar Group, March 17, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]