["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Then-Vice President Joe Biden addresses Ukraine's Parliament in Kyiv, Dec. 8, 2015. (AP)", "The widely discredited allegation that a Ukrainian gas company paid nearly $1 million in lobbying fees to President Joe Biden is like the proverbial cat with nine lives: It just keeps coming back.", "A Facebook post that was published March 16 claims that an associate of Burisma Holdings Ltd. — where Biden’s son Hunter held a directorship from 2014 to 2019 — presented the allegation as fact during an unspecified Ukrainian court hearing.", "The post says: \"I guess its no biggie that in a Ukrainian Court today Burisima (sic) admitted to giving Sleepy JOE a lump sum of 900K. Fact checkers???\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We’ve extensively fact-checked claims in the past concerning the Bidens’ ties to Burisma. However, because this claim about payments to Joe Biden has resurfaced with a new setting — this time allegedly in a Ukrainian court of law — we decided it was worth another look.", "We found no evidence that any such statement was made in court or any new evidence that Joe Biden got money from Burisma.", "The claim echoes unsubstantiated allegations circulated more than a year ago by Rudy Giuliani, former President Donald Trump’s private lawyer, in an effort to discredit Biden’s anti-corruption efforts when he was vice president.", "During Trump’s reelection campaign, Trump and Giuliani repeatedly misrepresented Biden’s efforts to oust a Ukrainian prosecutor accused of corruption, insisting that they were an attempt to shield Hunter Biden from prosecution — another claim we fact-checked and found unsubstantiated.", "On top of that, Giuliani on Oct. 10, 2019, told Fox News’ Sean Hannity that Burisma paid Joe Biden $900,000 in consulting fees when he was vice president.", "Giuliani was parroting claims made in a press conference by Ukranian lawmaker Andriy Derkach. Derkach, according to the New York Post, said Burisma transferred the sum to Rosemont Seneca Partners, an investment firm co-founded by Hunter Biden. But he offered no evidence that Joe Biden got any money, the Post said.", "In a September 2020 investigative report on Bidens’ relationship with Burisma, the GOP-led Senate finance and homeland security committees referred to Derkach’s claim as \"foreign-sourced disinformation.\"", "Ukraine’s Interior Ministry reaffirmed in a Feb. 26 news release that authorities concluded there was no evidence of criminal acts by the Bidens.", "PolitiFact found no evidence that would indicate otherwise.", "In searching news archives, we found no mention of a Ukrainian court hearing where this debunked claim may have resurfaced.", "We rate this claim False.", "Caryn Baird contributed to this report.", "Video clip from \"The Sean Hannity Show\" published by the New York Post, Oct. 10, 2019. Accessed March 18, 2021.", "Ukraine Prosecutor Says No Evidence of Wrongdoing By Bidens, Bloomberg, May 16, 2019. Accessed March 18, 2021.", "Transcript of Remarks by Then-Vice President Joe Biden to the Ukrainian Rada in Kyiv, Dec. 9, 2015. Accessed March 18, 2021.", "Council on Foreign Relations Transcript of Speaking Event ft. Joe Biden, Jan. 23, 2018. Accessed March 18, 2021.", "\"Hunter Biden, Burisma, and Corruption: The Impact on U.S. Government Policy and Related Concerns.\" Majority Staff Report By U.S. Senate Committee on Homeland Security and Governmental Affairs U.S. Senate Committee on Finance. Pages 60-61. Sept. 18, 2020. Accessed March 18, 2021.", "\"The Bidens’ Actions Regarding Ukraine,\" PolitiFact. Sept. 23, 2019. Accessed March 18, 2021.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]