["“Don’t worry…the herd will soon realise #Bitcoin isn’s dropping below the 5th Feb low and will start the buying frenzy once again”. According to The Economic Times, this is the sage advice of American investor and philanthropist Warren Buffett. The newspaper carried these words as the tweet of Buffett in it’s ‘Tweet of the Day’ section on June 26, 2018. The tweet suggests that the value of the Bitcoin will not drop below a certain level and the demand for the virtual currency is bound to shoot up again.", "The tweet which has been carried by The Economic Times in its daily edition is from the Twitter handle @ORACLEofETH. This is NOT the official account of Buffett. It was brought to the notice of the newspaper by social media users who spotted the gaffe.", "Don’t worry.. The herd will soon realize #Bitcoin isn’t dropping below the Feb 5th low and will start the buying frenzy once again.", "-Warren B.", "— Warren Buffett (@ORACLEofETH) June 24, 2018", "The said account is a parody account. This was confirmed by none other than the admin of the account, in response to a tweet by a social media user.", "haha its a parody.. if u dont get it im sorry for u", "— Warren Buffett (@ORACLEofETH) May 24, 2018", "The official Twitter account of Warren Buffett is @WarrenBuffett and has over 1.4 million followers. Buffett has not tweeted from his account since April 2016.", "There have been multiple instances wherein mainstream media outlets have been duped by parody accounts on Twitter.", "1. Led by IANS, several media outlets including Times of India, Hindustan Times, Indian Express and India TV among others, published reports based on tweets from a parody account of Tripura CM Biplab Deb. The story was later withdrawn by IANS.", "2. A spoof account of Republic TV tweeted a photograph of a ‘freelance protester’ who was present during the Bharat bandh protests by SC groups that took place in April, 2018. This was picked up by journalist Kanchan Gupta and the Hindi news channel India TV.", "3. When Malayali actress Priya Prakash Varrier became an overnight sensation following the release of a teaser of her upcoming film, Aaj Tak reported that one Maulana Qadri had issued a fatwa against Varrier because she had become a distraction for Muslim men. This report was on the basis of a tweet from the parody account of Times Now.", "Twitter accounts of most public figures are marked by a blue tick that appears next to the name of the account holder. This helps distinguish genuine/original accounts from spoof accounts, which seems to have escaped the notice of The Economic Times staff.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]