["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A screen grab from a Telemundo interview with Democratic presidential nominee Joe Biden shows Biden taking a question from a viewer on Sept. 15, 2020. Social media users have shared a portion of the interview out of context with a false claim.", "In a Sept. 15, 2020, interview with Telemundo, Joe Biden was in the middle of responding to a viewer question when he said “I lost that lady.”", "The full video shows a woman, who appears on a monitor, as she asks a question about deportations. The monitor went blank as Biden was answering her, Telemundo said, which prompted him to make the remark.", "Telemundo confirmed that Biden was not provided questions ahead of time, nor did he use a teleprompter or read any of his responses at any point during the interview.", "Presidential candidate Joe Biden sat down for an interview with Telemundo’s José Díaz-Balart and vowed that, if elected, he would halt deportations of immigrants during the first 100 days of his presidency.", "But a clip of the interview is being shared on Twitter, YouTube and Instagram with the false suggestion that Biden was reading a pre-written response to an interview question, possibly from a teleprompter, when he says what the posts say sounds like \"I lost that line.\"", "That’s not what happened. The posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The full video of the Sept. 15 interview shows that Biden is not looking at a teleprompter, but is responding to a question from a Telemundo viewer who appears on a monitor.", "Around the video’s 8:50-minute mark, the video shows the woman on the screen asking the question before the camera pans back to Biden for his answer.", "Her question, translated into English: \"Mr. Biden, you and Obama are responsible for a record-breaking number of immigrants being deported. How can you guarantee us that this will not continue happening in our communities?\"", "Biden gives a response while appearing to look at the woman on the monitor: \"It took much too long to get it right. That's the fact. Period. Number one. Number two, but... compared to where we are today, and look who you are. How are you feeling today in terms of this president? Everything he's done, separating thousands … there are still thousands of people who are being separated from their families. They’re deporting people that are standing outside of church, waiting to come out after mass. There are going to be no deportation in the first 100 days of my campaign.\"", "Díaz-Balart then interjects to confirm that Biden would freeze deportations. When he does, Biden turns his head toward Díaz-Balart and the camera cuts back on Díaz-Balart while Biden starts to respond: \"Freeze deportations for the first hundred days,\" Biden says. Then the camera cuts back to Biden who appears to have his head tilted again in the direction of the woman on the monitor while Biden continues: \"And the only people who will be deported are people who committed a felony while here. That's number one. Ok. I lost that (lady)...\"", "Recent social media posts claiming @JoeBiden used a teleprompter during an interview with Noticias Telemundo and anchor @jdbalart are absolutely FALSE.👇 WATCH what really happened. pic.twitter.com/RoPbdJnhZu", "Telemundo communications director Kevin Gray told PolitiFact that in the place where some are quoting Biden as saying, \"I lost that line,\" Biden actually said \"I lost that lady.\" The monitor on which the woman was seen asking a pre-taped question went blank as Biden was responding, which prompted him to say he \"lost\" her.", "\"Mr. Diaz-Balart responded by saying ‘You and I can talk about that’ so Vice President Biden would direct his answer to him since the screen had gone black,\" Gray said.", "The monitor was only there for the purpose of allowing Telemundo viewers to ask Biden questions, he said: \"At no point during the interview did Vice President Biden use a Teleprompter, or read any of his responses, and he was not provided any questions ahead of time.\"", "This claim is Pants on Fire!", "Twitter post, Sept. 20, 2020", "Youtube, Clip of interview, Sept. 18, 2020", "Instagram post, Sept. 22, 2020", "Telemundo.com, WATCH: Joe Biden says he will stop deportations in the first 100 days of his presidency, Sept.15, 2020", "Telemundo interview transcript, Sept. 15, 2020", "Email/Phone interview, Kevin Gray communications director at Telemundo, Sept. 22, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]