["The first video, which shows a blonde woman hugging a kangaroo, has been viewed more than 16,000 times since it was posted to Instagram here on January 7, 2020.", "The caption states in part: “This kangaroo was saved by the above volunteer in the wildfires in Australia. The kangaroo is so grateful that just can’t stop hugging the person who saved its life!”", "Below is a screenshot of the first misleading post:", "The second video, which shows a dark-haired woman hugging a kangaroo, has been viewed more than 700 times since it was published to Facebook here on January 5, 2020.", "The English-language part of the caption reads: “Rescued Kangaroo Can’t Stop Hugging The Volunteers Who Saved Her Life”; the Arabic-language part translates to English as: “A female kangaroo cannot stop hugging the volunteers who saved her life from the Australian fires”.", "Below is a screenshot of the second misleading post:", "Bushfires currently burning in Australia have killed at least 25 people, destroyed more than 1,800 homes and scorched millions of hectares of land, AFP reported here on January 7.", "The first video was also shared nearly 1,000 times with a similar claim here and here on Facebook and here on Twitter.", "The second video and screenshots from the footage were shared here, here and here on Twitter alongside a similar claim.", "But the claims are false; a kangaroo sanctuary in Australia’s Northern Territory confirmed that both videos show one of their kangaroos, which was unaffected by the bushfires and has lived in the sanctuary since 2006.", "A Google reverse image search found the first video published here on January 2, 2020 on the Facebook page of the Kangaroo Sanctuary Alice Springs.", "The 38-second video is captioned, in part: “Queen Abi and Aunty Laura love love love their big hugs”.", "The Kangaroo Sanctuary Alice Springs was founded in 2005 and is located in Alice Springs, Northern Territory. The sanctuary posts pictures and videos of its rescued kangaroos, most notably of a muscular kangaroo named Roger, and has amass more than a million followers on Instagram.", "Below is a screenshot comparison of the first video in the misleading posts (L) and the one posted by the Kangaroo Sanctuary Alice Springs (R):", "The second video was also posted by the same kangaroo sanctuary to Facebook here in October 2016. The video was published with the caption: “Nothing more beautiful than loving cuddles from Queen Abi”.", "A male voice in the video can be heard saying: “This is Abigail, Queen Abi we call her. She was raised with Roger nearly 11 years ago and she just loves a cuddle.\"", "Below is a screenshot comparison of the second video in the misleading posts (L) and the one posted by the Kangaroo Sanctuary Alice Springs (R):", "The Kangaroo Sanctuary Alice Springs viewed the videos used in the misleading posts and confirmed that the footage showed one of their kangaroos.", "“This is our kangaroo Abi and our friend who was visiting from New York. Abi was not rescued from fire. We don’t have fires here thankfully,\" the sanctuary told AFP in an email on January 7, 2020.", "While a grass fire was burning near Alice Springs on January 7, 2020, according to the Northern Territory Government, the area is located far from the major bushfires burning in the southeast states of New South Wales and Victoria. The afflicted regions can be seen on Google's crisis map here.", "The Kangaroo Sanctuary also confirmed Abi, 14, has lived in the sanctuary ever since being rescued as a joey in 2006.", "The sanctuary has posted multiple videos and photos of Abi embracing people on social media since 2016.", "Chris “Brolga” Barns, the founder of the sanctuary, shared a photo of his embrace with Abi and the story of her rescue in this July 2013 Facebook post.", "The post reads in part: “This photo is of Abi and I having a cuddle a few days ago. Abi was raised from a joey with Roger and Ella -- all three are the joeys snuggled up on the cover of my facebook page (Abi is on the right).", "“Abi came to me as an orphan of 5 months old and was quite busted up with cuts and scrapes. Abi has grown into a very healthy 7 year old, and is my only kangaroo who comes up and gives a great big rugby tackle cuddle. Abi is also unusually light in colour and I think she is very beautiful.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]