["By Saranac Hale Spencer", "Posted on February 19, 2021", "A steep decline in energy generated by fossil fuels and nuclear power plants was largely responsible for the power outages in Texas during the deep freeze that recently gripped the state, according to the operators of the state’s power grid.", "Despite that fact, several high-profile conservative figures — including the state’s governor — have wrongly placed the blame for power outages on wind turbines and have tied the issue to the Green New Deal, legislation Democrats proposed in 2019 with the aim of creating jobs and significantly reducing the country’s greenhouse gas emissions. It didn’t pass in either the House or the Senate, but its tenets are still popular among progressives. President Joe Biden has supported its framework.", "Texas Gov. Greg Abbott, a Republican, told Fox News host Sean Hannity on Feb. 16, “This shows how the Green New Deal would be a deadly deal for the United States of America. … Our wind and our solar, they got shut down and they were collectively more than 10% of our power grid, and that thrust Texas into a situation where it was lacking power in a statewide basis.”", "The host of another Fox News show went even further. Tucker Carlson started a segment on his Feb. 15 show, saying, “The Green New Deal has come, believe it or not, to the state of Texas.” Meanwhile, a graphic showing a frozen water feature in the “splash and play kids zone” of a Dallas-area hotel played over his shoulder — it looked vaguely like a windmill.", "Later, Carlson said, “Green energy inevitably means blackouts. … Green energy means a less reliable power grid. Period. It means failures like the ones we’re seeing now in Texas. … It’s science.”", "Other public officials echoed these claims — Rep. Lauren Boebert of Colorado, Rep. Andy Barr of Kentucky and Rep. Marjorie Taylor Greene of Georgia all weighed in on Twitter — and social media posts followed suit, blaming the outage on wind turbines and decrying the Green New Deal.", "But, as we said, the bulk of the deficit in the energy supply was due to frozen infrastructure for natural gas, not wind.", "“There is significantly more megawatts in that thermal unit category than in the renewable category,” Dan Woodfin, senior director of system operations for the Electric Reliability Council of Texas, said of the outages at a Feb. 16 press briefing. ERCOT runs the grid that serves most of Texas, and the “thermal unit category” includes natural gas, coal and nuclear power.", "Indeed, data from the U.S. Energy Information Administration — see the adjacent EIA graph — show that in the early morning hours of Feb. 15, natural gas generation dropped 23% by 4 a.m., a total of about 10,000 megawatts on a system that was running about 65,000 megawatts in total at midnight. That morning ERCOT started rolling blackouts.", "While the Texas energy supply includes a mixture of sources, the largest share comes from natural gas. More than 40% of the state’s energy came from natural gas in 2020, according to a recent ERCOT report. The second largest share is wind, at 23%, then coal, at 18%.", "So, it’s true that wind plays a significant role in Texas’ power supply — the state actually generates more wind energy than any other state in the nation — but there’s no indication that wind energy was the primary cause of the power outages in Texas.", "Data showing the amount of energy coming from each source over the course of a year indicate an inverse relationship between wind and natural gas — when one is up, often, the other is down. (See the adjacent EIA graph that shows electricity generation by sources over the last year.)", "This happened on Feb. 8, just before the cold weather swept in — wind energy dipped and natural gas picked up. That trend generally continued, with natural gas increasing as temperatures across the state reached below freezing. Most households in Texas — 61% of them — have electric heat, compared with 40% nationally.", "So, the frigid weather caused both a surge in demand for electricity and a decrease in supply of energy as infrastructure froze.", "Frozen instruments at natural gas, coal and nuclear facilities, plus limited supplies of natural gas and problems with natural gas pressure, led to the outages, Woodfin reportedly explained earlier in the week.", "“We’ve had some issues with pretty much every kind of generating capacity in the course of this multi-day event,” he said.", "Beyond those immediate problems, three components of the Texas energy system contributed to the current situation, Julie Cohn, a research historian focused on energy infrastructures at Rice University’s Baker Institute for Public Policy, told us in a phone interview.", "First, Texas has an isolated network. The grid ERCOT manages, which handles about 90% of the state’s power supply, is the only statewide, standalone grid in the continental U.S. Other states are served by either the Eastern or Western interconnections. So, if Texas needs additional power, it can’t import from another system — except in some areas, such as El Paso and part of East Texas.", "Second, the wholesale power market in Texas incentivizes investors to build power plants that sell electricity on the grid, but it doesn’t incentivize the development of back-up plants that can be tapped in emergency situations like this.", "Third, while those who run the power system do what they can to plan for as many contingencies as they can, sometimes events arise that are outside their parameters. Cohn cited the 1965 Northeast blackout, one of the biggest power failures in U.S. history, as an example.", "“I think this weather event is another example of that,” she said.", "On that front, Princeton University assistant professor and energy systems engineer Jesse Jenkins explained how the weather had affected the Texas power system.", "“The problems start out in the Permian Basin, where gas wells and gathering lines have frozen, and pumps that are used to lift gas from the ground lack electricity to operate; this has cut gas field production in half,” Jenkins wrote in an op-ed piece for the New York Times. “At least one nuclear reactor near Houston also went offline Monday when a safety sensor froze; it was restarted Tuesday night.”", "Energy infrastructure can be weatherized, Jenkins wrote, pointing out that other parts of the country see the same temperatures without suffering major power outages.", "In Iowa, for example, a spokesman for wind farm operator MidAmerican Energy told a local news station on Feb. 17, “We add cold weather packages to our wind turbines to make sure that they can handle what mother nature throws at us here during the wintertime.”", "Wind energy accounts for 42% of Iowa’s net power generation, as of 2019, according to the U.S. Energy Information Administration. That’s the highest share for any state.", "It’s also worth noting that the Iowa Utilities Board reported that the state’s largest power generators, including MidAmerican Energy, had enough electricity to supply their customers through the cold snap, which saw arctic air sweep across the country.", "Cohn raised a similar point, noting that there’s a wind farm in the North Sea and a recent Bloomberg report explained that turbines in the Arctic Circle can work in temperatures as low as minus 22 degrees Fahrenheit. Most manufacturers now offer turbines that come with ice mitigation systems and heating for some of the equipment, the report said.", "But that can be costly.", "There are various approaches to making the Texas system more resilient, Cohn said — for example, investing in connections to other power grids, incentivizing the insulation of homes or winterizing the existing energy systems.", "As for the suggestion that these problems are in some way related to, or would be worsened by, the Green New Deal — that’s far-fetched.", "Texas committed itself to investing in renewable energy back in 1999, 20 years before the Green New Deal was introduced. The state set goals for the amount of energy it would use from renewable sources, which include solar, wind, geothermal, hydroelectric, wave or tidal energy, and biomass or biomass-based waste products including landfill gas.", "In 2005, the state doubled some of those goals.", "Still, as we said, the most common source of energy on the Texas grid is natural gas.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]