["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Southwest Airlines employee helps a passenger wearing a facial mask at LaGuardia Airport on March 21, 2020, in New York, N.Y. (AP)", "• The House version of a coronavirus relief bill does include several requirements for airline companies that take federal assistance from the bill.", "• The House bill also includes provisions related to community newspaper pension plans and a $300 million funding boost for the Corporation for Public Broadcasting.", "• However, the bill does not include language on tax credits for solar and wind energy.", "As President Donald Trump’s negotiators were working with congressional leaders to assemble a coronavirus economic relief package, the president’s re-election campaign didn’t shy away from blasting one key Democratic leader, House Speaker Nancy Pelosi, D-Calif.", "On March 24, Trump campaign manager Brad Parscale shared a video focused on the coronavirus bill Pelosi had released the day before. It named a half-dozen provisions in the Take Responsibility for Workers and Families Act that the Trump campaign considered outside the scope of the current crisis.", "On screen, the ad says:", "\"Nancy Pelosi and the Democrats clog their coronavirus relief bill with leftist wishlist. Democrat bill includes: tax credits for solar and wind energy … emissions standards and carbon offset requirements for airlines … policing racial makeup of corporate boards … retirement plans for community newspaper employees … $300 million for PBS … climate change studies for civil aviation and aerospace industries. Democrats don’t care about your health or the economy. They only care about politics\"", "Democratic officials acknowledge that most of those provisions are in the bill, which at the time the ad was launched was taking a back seat to negotiations over a Senate bill. However, one of the provisions cited by the Trump campaign’s ad is not in the bill.", "A still from a Trump campaign ad targeting House Speaker Nancy Pelosi's coronavirus relief bill.", "Pelosi’s bill seeks to shape the behavior of any airlines that accept federal assistance to the benefit of their workers, customers and the environment.", "Carbon offsets are addressed in section 704 of the bill. Corporate board diversity, in the form of retrospective reporting requirements, is part of section 407, while the climate change study is in section 707.", "A statement provided by the Democratic leadership said that \"the extreme impacts that COVID-19 has had on corporate operations, the workforce, the lack of adequate contingency plans designed to protect worker interests and needs, and the impact this has had on the national economy highlights the need to have worker interests represented on corporate boards.\"", "This language, in section 404, is largely drawn from H.R. 1916, a bill that has been introduced but not advanced. The bill would change rules for community newspapers’ defined-benefit pension plans.", "The Democratic leadership says this is part of an overall pension package to help cash flow for companies.", "This would be a supplemental appropriation for the Corporation for Public Broadcasting, which funds PBS and which is facing shortfalls due to the coronavirus, the Democratic leadership says.", "This is the one provision cited by the ad that is not actually in the House bill, despite pressure from the industry to include it.", "The campaign ad says that Pelosi’s coronavirus bill included provisions on \"tax credits for solar and wind energy … emissions standards and carbon offset requirements for airlines … policing racial makeup of corporate boards … retirement plans for community newspaper employees … $300 million for PBS … climate change studies for civil aviation and aerospace industries.\"", "The ad is correct that five of those six provisions are in the House bill. The remaining provision, on tax credits for solar and wind, is not. We rate the statement Mostly True.", "Trump campaign, campaign ad, March 24, 2020", "Congress.gov, Pelosi coronavirus bill, March 23, 2020", "NPR, \"Climate Change Push Fuels Split On Coronavirus Stimulus,\" March 24, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]