["President Donald Trump's handling of the novel coronavirus pandemic and the closure of the U.S. economy have become defining issues of the 2020 presidential election.", "But one viral meme making the social media rounds tries to turn the tables on Trump's Democratic opponent, former Vice President Joe Biden, by claiming he said he would \"lock down our nation until we have a vaccine ready.\"", "More:Fact check: Post misrepresents Biden-Harris event turnout in at Phoenix museum", "If true, the statement would contradict Biden's previous statements, including in the first presidential debate, and could have a chilling effect on voters deeply concerned by the state of the economy.", "Here's the full quote the meme, posted to Facebook on Oct. 12, attributes to Biden: \"COVID-19 will increase within the next few months. The scientists agree. And when I take the White House, I will lock down our nation until we have our vaccine ready, and everyone is vaccinated. — Joe Biden\"", "Asked about the meme, the Biden campaign's response was swift and pointed: \"This is completely and thoroughly fabricated,\" spokesman TJ Ducklo wrote in an email.", "Biden's often-stated public position is that he would \"listen to the scientists\" in deciding whether to close or reopen the economy. That opens the door to another economic shutdown under Biden's leadership, which is something that Trump has said would not happen a second time if he's reelected. But it is a far cry from a pledge to \"lock down our nation until we have our vaccine ready, and everyone is vaccinated.\"", "More:Fact check: Joe Biden called 'forces of intolerance,' not Trump supporters, the 'dregs of society'", "In August, when ABC News' David Muir asked Biden whether he was \"prepared to shut this country down again\", here's how Biden responded:", "\"I would be prepared to do whatever it takes to save lives because we cannot get the country moving until we control the virus. That is the fundamental flaw of this administration's thinking to begin with. In order to keep the country running and moving, and the economy growing, and people employed, you have to fix the virus, you have to deal with the virus.\"", "In a follow-up question, Muir asked what Biden would do if scientists said to shut down the economy. \"I would shut it down,\" Biden replied. \"I would listen to the scientists.\"", "In their Sept. 29 debate, Trump argued both that Biden would have left the country \"wide open\" and that Biden \"wants to shut down this country.\" But later, when asked directly about why he'd been hesitant about reopening, Biden said it was because Trump \"doesn't have a plan\" and said that his plan for reopening would include giving businesses help via financial assistance, personal protective equipment and sanitation.", "Biden's website goes into more depth on his plan to reopen the economy. None of his COVID-19 plans there calls for a shutdown before the debut of a vaccine, and the heading of one of his plans — \"Build Back Better\" — directly contradicts that claim.", "The Facebook account that seems to have shared the meme initially didn't immediately respond to requests for more information about the meme's origins or for comment.", "Based on our research, the claim is FALSE. Biden never seems to have said he would \"lock down our nation until we have a vaccine ready,\" and his many public statements on the issue contradict that claim. His actual position — as laid out in interviews, on his website and during the first debate — is that the economy should be reopened according to his plan and with scientists' approval.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]