["Protective masks hang in a decontamination unit at the Battelle N95 decontamination site during the coronavirus pandemic, Saturday, April 11, 2020, in Somerville, Mass. (AP)", "All imports from China fell during January and February 2020, compared with a year earlier, but did not disappear entirely.", "The federal government as well as a few states have imported medical supplies from China during the COVID-19 pandemic.", "U.S. imports of certain medical supplies from China fell in 2019 when the Trump administration raised tariffs on these goods.", "Sen. Marco Rubio, R-Fla., casts some blame on China for the U.S. struggle to obtain crucial medical supplies amid COVID-19.", "Writing in the New York Times, Rubio accused China of using the world’s supply chain of medical gear to benefit itself during the coronavirus outbreak:", "\"Having monopolized those critical supply chains, the Chinese Communist Party pointed them inward. It ensured that face masks being manufactured in China, for example, went to domestic consumption and their own fight against the virus. Largely unable to import supplies from China, America has been left scrambling because we by and large lack the ability to make things, as well as the state capacity needed for reorienting production to do so. As a result, doctors are forced to ration supplies and, in some cases, cease using necessary protective equipment.\"", "There are clear problems in the U.S. medical supply chain. A mad dash for masks and other supplies has created logistical hurdles and frenzied dealmaking in the global market, including in China.", "And Rubio’s concerns about the U.S. relying on China for supplies are not new. He raised them more than a year ago.", "\"Although American pharmaceutical firms face short-term commercial opportunities in China, the U.S. runs the risk of losing important components of its medical supply chain to China’s government-backed industry,\" Rubio wrote in a report in February 2019.", "But in his op-ed, Rubio overstates the problem with Chinese imports and ignores some key factors — including that imports were declining before COVID-19 as a result of President Donald Trump’s tariffs.", "\"Sen. Rubio’s comment is typical of ‘bash China’ remarks, but inaccurate,\" said Gary Hufbauer, a fellow at the Peterson Institute for International Economics. \"China is exporting millions of masks.\"", "We reached out to spokespersons for Rubio and did not receive a response.", "There were fears that China would not export critical medical supplies to the U.S. as COVID-19 cases ramped up. China produces much of the world’s protective medical equipment.", "There was a dip, but the exports did continue.", "China’s exports of protective medical equipment to the U.S. declined by 19% in January and February, compared with the same period last year. All other products fell by a far greater amount: 28%, according to an analysis by Chad Bown at the Peterson Institute.", "\"We imported less from them for these products than we did last year, but some of that is economics: They have more demand for these things internally, so they had less of an ability to export them to the world,\" Bown told PolitiFact.", "New export restrictions by China also created logjams. Officials in China said the restrictions were imposed to ensure quality, but U.S. companies said they were facing bottlenecks, the Wall Street Journal reported.", "In February, the United States was focused on exporting supplies to China to fight the crisis.", "The drop in imports of masks from China is not related only to COVID-19. Rubio’s op-ed did not mention the Trump administration’s increase on tariffs for various goods from China in 2018-19. That also affects imports of medical supplies.", "In 2018, Matt Rowan, president of the Health Industry Distributors Association, warned that proposed tariffs would drive up health care costs. The products \"are used widely throughout health care settings and are a critical component of our nation's response to public health emergencies, such as Ebola,\" he said at a federal government hearing.", "The tariff hikes for personal protective equipment and other supplies went through in September 2019 despite such warnings. U.S. imports of masks, respirators and gloves from China fell following the tariff increases. In March 2020, the federal government established a temporary exclusion for masks.", "\"In other words, the fall in imports from China is largely a self-imposed wound,\" said Mary Lovely, a Syracuse University economist and trade expert who is also a Peterson fellow.", "The decrease in imports followed the shutdown of manufacturing regions in China in the country, she said.", "The U.S. government has tried to increase the flow of supplies from China, including authorizing the use of a Chinese version of N95 masks.", "One more point: The U.S. has imported masks and other supplies from China in recent weeks.", "On March 29, Trump announced an operation called Project Air Bridge to bring medical supplies from overseas. The project’s first flight came from China on March 29 and brought millions of supplies, including 130,000 N95 masks.", "Project Air Bridge has delivered more than 760,000 N95 masks, 600 million gloves, 52 million surgical masks in addition to other supplies including surgical gowns, thermometers and face shields, a Federal Emergency Management Agency spokesperson said. Those supplies came from China, Thailand, Malaysia, Vietnam, Taiwan, India, Honduras and Mexico.", "From China alone, there have been over 133 million units of imported N95 masks, gloves, surgical masks, surgical gowns, thermometers and face shields, FEMA said.", "Some states have arranged their own imported masks or other supplies from China.", "Rubio said \"face masks being manufactured in China, for example, went to domestic consumption and their own fight against the virus\" while the U.S. was \"largely unable to import supplies from China.\"", "China did have a greater need for its domestically manufactured masks in February as the virus ravaged the country, but Rubio greatly overstates the situation. Imports of masks from China to the U.S. did drop in January and February, but imports of other products dropped even more. Imports to the U.S. did occur in April through the federal government’s Project Air Bridge, and a few states arranged their own imports with the help of other entities.", "We rate this statement Mostly False.", "U.S. Sen. Marco Rubio op-ed in New York Times, We Need a More Resilient American Economy, April 20, 2020", "Peterson Institute for International Economics Chad Bown, Trump's trade policy is hampering the US fight against COVID-19, March 13, 2020", "Peterson Institute for International Economics Chad Bown, China's exports of protective medical equipment fell less than its exports of all other products, March 30, 2020", "Peterson Institute for International Economics Chad Bown, COVID-19: Trump’s curbs on exports of medical gear put Americans and others at risk, April 9, 2020", "Chad Bown, Tweet, April 4, 2020", "USTR, Tariffs public hearing, Aug. 20, 2019", "Federal Register, March 17, 2020", "USA Today, The US needs masks to fight coronavirus, but supplies from China fell as demand rose, April 8, 2020", "New York, Amid Ongoing COVID-19 Pandemic, Governor Cuomo Announces 1,000 Ventilators Donated to New York State, April 4, 2020", "3M, 3M and the Trump Administration Announce Plan to Import 166.5 Million Additional Respirators into the United States over the Next Three Months, April 6, 2020", "New York Times, China Hawks in Congress See an Opportunity in Coronavirus", "Wall Street Journal, China’s Export Restrictions Strand Medical Goods U.S. Needs to Fight Coronavirus, State Department Says, April 16, 2020", "Wall Street Journal, A Million N95 Masks Are Coming From China—on Board the New England Patriots’ Plane, April 2, 2020", "U.S. Food and Drug Administration, Coronavirus (COVID-19) Update: Daily Roundup, April 3, 2020", "PolitiFact, Yes, US shipped donated personal protective equipment to China in February, April 2, 2020", "Federal Emergency Management Agency, Statement to PolitiFact, April 21, 2020", "Email interview, Jason Conwall, Gov. Andrew Cuomo spokesman, April 21, 2020", "Email interview, Tim Post, 3M spokesman, April 21, 2020", "Email interview, Mary Lovely, Syracuse University economist, April 21, 2020", "Email interview, Gary Hufbauer, a fellow at the Peterson Institute for International Economics, April 21, 2020", "Email interview, Claude Barfield, American Enterprise Institute resident scholar, April 21, 2020", "Telephone interview, Chad Bown, Peterson Institute for International Economics senior fellow, April 22, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]