["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The NCAA issues sanctions issued against MU athletics  on Jan. 31 and sent social media into hysteria. Missouri sports fans, MU students and Missouri politicians all had something to say.", "U.S. Rep. Vicky Hartzler, R-Missouri, was one of the politicians who spoke out about the NCAA's sanctions.", "While there must be consequences for individuals who go outside the rules, the NCAA extreme sanctions against Mizzou are unfair in light of Mizzou’s cooperation in addressing the issue,\" she wrote on Facebook and shared later on Twitter. \"It’s wrong to penalize today’s athletes for the actions of others and wrong to sanction a university which has been cleared of involvement. I am hopeful the sanctions will be reversed.\"", "We decided to take a closer look at the idea that it’s \"wrong to sanction a university which has been cleared of involvement.\" Was MU really cleared of all involvement?", "MU was handed a series of sanctions affecting the football, softball and baseball teams after former tutor Yolanda Kumar was found to have completed coursework for 12 student-athletes, violating the NCAA's ethical conduct, academic misconduct and academic extra benefits rules.", "We reached out to Hartzler's office about the statement, and her communications director, Anna Swick, responded on Hartzler's behalf.", "\"The NCAA report never indicates that MU administrators were involved or that this was a systemic problem,\" Swick said.", "Swick said Hartzler’s tweet was in reference to statements made in the NCAA’s initial report, which Swick said implied that MU administrators were cleared of direct involvement.", "\"The NCAA report points to MU’s 'prompt acknowledgement of the violation' by the MU administration once it was discovered,\" Swick said. The NCAA also made note of MU’s \"exemplary cooperation,\" she said.", "Two attorneys that have worked on NCAA cases said the fact that MU was hit with sanctions implies the university wasn’t without fault.", "\"They haven’t really done anything in terms of intentional conduct,\" said Justin Sievert, founding partner of Sievert Werly and head of the firm’s college sports law practice. \"But has Missouri been cleared of all involvement? Not in other senses, no. he violations themselves show that they had involvement even if it wasn’t intentional conduct.\"", "Christian Dennie, an attorney who works with clients in the sports industry, said institutions can be sanctioned under the NCAA structure because they are responsible for their own employees.", "Dennie points out that university policy means that Kumar would have been educated on the do’s and don’ts of her position as tutor and chose independently to violate them and NCAA policies.", "That responsibility could change if MU considers Kumar a \"rogue employee,\" said Roger Cossack, a former legal analyst for ESPN. But he said that might not make a difference if the NCAA maintains that MU should have known about the misconduct.", "\"Yes, Missouri certainly wasn’t asking her to do this, but they had continued responsibility to monitor her actions,\" he said. \"Once you find that she’s a rogue employee, or someone who was not following orders, that just doesn’t mean the university had no responsibility; they have an obligation to be the checks and balances on these things, which is why they have these sanctions.\"", "Hartzler said MU was cleared of involvement in the NCAA case.", "The NCAA did not specifically say MU administrators were involved in the case, as Swick noted.", "However, experts pointed out that due to the sanctions MU faces, the university was still not given the ultimate all-clear as Hartzler said in her original statement. The NCAA still believed MU held the responsibility to monitor its staff, resulting in the sanctions.", "Because of the missing context, we rate Hartzler’s statement Half True.", "The original Facebook postfrom Vicky Hartzler, Feb. 1, 2019.", "Original Tweet from Vicky Hartzler, Feb. 1, 2019.", "Email exchange with Christian Dennie, an attorney from Barlow Garsek & Simon, March 4, 2019.", "Email exchange, Anna Swick, communications director of Rep. Vicky Hartzler, March 6, 2019.", "Phone interview, Roger Cossack, former legal analyst for ESPN and visiting practitioner at Pepperdine Law, Feb. 13, 2019.", "Phone interview, Justin Sievert, founding partner of Sievert Werly and head of the firm’s college sports law practice, March 4, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]