["A Facebook post published on February 24, 2021, claims that Kenyatta is offering 30,000 Kenyan shillings ($275) to business owners as part of the government’s financial aid programme known as Inua Jamii.", "“This ksh30,000 is not a loan but is just my promotion to all Kenyans who can start and maintain their business. If you haven’t received it yet, you are requested to send me your number and receive it direct to your mpesa a/c within 5 to 10 minutes (sic),” reads the post, which has been shared nearly 80 times.", "A similar version of the claim was also shared here and here.", "The posts ask Kenyans to send their M-PESA numbers in order to receive the cash in their mobile wallets. M-PESA is a mobile money transfer service used in Kenya and other African countries.", "Presidential spokeswoman Kanze Dena told AFP Fact Check that the Facebook account is not owned or managed by Kenyatta, wife of President Uhuru Kenyatta.", "“Facebook users have flagged several accounts impersonating the first lady that have been reported to us that are being used to fraudulently obtain money from Kenyans,” she said.", "The first lady only uses her verified Facebook account “Office of the First Lady Kenya” for official communication, Kanze added.", "The imposter account was first created on May 29, 2020, according to Facebook’s page transparency section.", "User comments indicate that some believed the account to be authentic. One of the posts included a comment from the page administrator, made to look like it was from Kenyatta herself.", "The posts claim that the business funds are from the “first lady’s Inua Jamii Program”.", "Inua Jamii, a Swahili phrase meaning “to uplift the community”, is the name for the government’s cash transfer programme. It is managed by Kenya’s Ministry of Labour and Social Protection.", "The funds are earmarked for vulnerable people: the elderly, orphaned children and those living with disabilities.", "AFP Fact Check has previously debunked numerous online giveaway scams. Read more about some of the most common types of Facebook scams in Africa.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]