["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Hillary Clinton speaks during a campaign rally in Detroit on Nov. 4, 2016. (AP)", "Hillary Clinton’s comments about Jill Stein and Tulsi Gabbard inspired a raft of Facebook posts that revived misleading claims about Clinton’s relationship with Russia.", "One post published Oct. 21 and shared more than 1,300 times says the following:", "\"Does anyone else find it strange: The same woman who paid for a Russian dossier to win an election; Whose husband made $500k for a Russian speech; Who sold 20% of US Uranium to Russia; Whose foundation received $150M from Russia; Keeps calling others Russian assets?\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "As evidence, the post cited Charlie Kirk, founder of the conservative nonprofit Turning Point USA. We found an Oct. 20 tweet from Kirk that makes the same claims as the post. It was retweeted more than 26,000 times.", "(Screenshot from Facebook)", "PolitiFact has investigated four of these claims in the past.", "We summarized our findings to address each of the post’s claims. The post contains a hint of truth, but it paints an inaccurate picture of Clinton’s ties to Russia.", "This contains an element of truth, but it isn’t the full picture.", "The dossier that the Facebook post is referencing was written by former British spy Christopher Steele about President Donald Trump’s ties to Russia. Many of the details included in the dossier were salacious but unverified. It was not written by Russian officials, as the Facebook post seems to claim.", "In September 2018, we fact-checked a claim from Rep. Mark Meadows, R-N.C., about the dossier, Fusion GPS (the opposition research firm that created it) and how the Clinton campaign was involved. We found that Fusion GPS was hired to work on behalf of the Clinton campaign, but the firm was already investigating Trump at the time.", "Fusion GPS was originally hired by the Washington Free Beacon, a conservative media website. The Democratic National Committee, through its law firm Perkins Coie and for the benefit of the Clinton campaign, hired the opposition research firm to collect information after Trump won the Republican nomination. Then, Fusion GPS hired Steele to produce memos on Trump’s ties to Russia.", "This is accurate. The source of the claim is the 2015 book \"Clinton Cash\" by author and political consultant Peter Schweizer. During an April 2015 interview about the book on Fox News Sunday, he said something that caught our eye: \"Of the 13 (Bill) Clinton speeches that fetched $500,000 or more, only two occurred during the years his wife was not secretary of state.\"", "We rated that claim True. And in the course of our investigation of Clinton’s federal financial disclosure forms, we found that former President Clinton gave a talk in 2010 to a Russian finance corporation. He was compensated $500,000.", "This is misleading. We rated a similar claim Mostly False.", "The claim also stems from Schweizer’s \"Clinton Cash.\" A chapter of the book suggests a pay-for-play scheme between the Clintons and Russia, accusing them of transferring uranium in exchange for donation money.", "Part of that chapter stems from a 2007 deal between Clinton Foundation board member Frank Giustra’s company, UrAsia, and Uranium One, a Canadian mining company. Uranium One has mines, mills and land in U.S. states equal to about 20% of the American uranium production capacity. Its actual production, though, is a smaller portion of the uranium produced in the United States, at 11% in 2014, according to Oilprice.com.", "RELATED: In context: Hillary Clinton on Tulsi Gabbard, the Trump campaign, Russia", "In 2009, Russia’s nuclear energy agency, Rosatom, bought a 17% share of Uranium One. A year later, it bought enough shares to give it a 51% stake.", "Since a foreign entity was taking a majority stake in a uranium operation, several U.S. government regulators had to approve the deal. They did, and in 2013, Russia assumed 100% ownership of Uranium One and renamed it Uranium One Holding.", "In our previous fact-check, we noted that Clinton sat on the committee that approved the sale — but the decision was not hers alone. She also did not have the power to veto the committee’s decision.", "This is exaggerated. We rated a similar claim Mostly False.", "Nine people related to Uranium One donated to the Clinton Foundation. But the bulk of the money, about $131 million, came from Giustra — a businessman from Canada, not Russia.", "Giustra said he sold off his entire stake in the company in 2007, three years before the Russia deal and about 18 months before Clinton became secretary of state.", "We haven’t independently verified Giustra’s claim, but if he is telling the truth, the donation amount to the Clinton Foundation from Uranium One investors drops significantly — from $145 million to $4 million.", "A Facebook post makes four claims about Hillary Clinton’s ties to Russia before and during the 2016 presidential election.", "The first, that Clinton \"paid for a Russian dossier to win an election,\" contains a hint of truth (that the Clinton campaign paid the firm that wrote the Steele dossier), but it isn’t the full picture. It’s true that Bill Clinton once made $500,000 by giving a speech to a Russian company. The claim that Clinton \"sold 20% of US Uranium to Russia\" exaggerates the percentage involved and Clinton's role; she didn’t have sole decision-making power over the deal. And it’s an exaggeration to say that the Clinton Foundation \"received $150M from Russia\" — it may be closer to $4 million from Uranium One investors.", "The post contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Facebook post, Oct. 21, 2019", "Fox News Sunday, transcript, April 26, 2015", "The New York Times, \"After Mining Deal, Financier Donated to Clinton,\" Jan. 31, 2008", "The New York Times, \"The Trump Dossier: What We Know and Who Paid for It,\" Oct. 25, 2017", "OpenSecrets.org, Hillary Clinton financial disclosure forms, 2001-2012", "PolitiFact, \"Complex tale involving Hillary Clinton, uranium and Russia resurfaces,\" Dec. 7, 2018", "PolitiFact, \"Fact-checking 'Clinton Cash' author on claim about Bill Clinton's speaking fees,\" April 26, 2015", "PolitiFact, \"The FBI, the Steele dossier and wiretapping, explained,\" Sept. 11, 2018", "PolitiFact, \"In Context: Hillary Clinton on Tulsi Gabbard, the Trump campaign and Russia,\" Oct. 22, 2019", "PolitiFact, \"What you need to know about Hillary Clinton, Russia, and uranium,\" Oct. 24, 2017", "PunditFact, \"How pundits defended Trump's ABC interview, and why it's misleading,\" June 13, 2019", "Statement of Frank Giustra, April 23, 2015", "The Washington Free Beacon, \"Fusion GPS and the Washington Free Beacon,\" Oct. 27, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]