["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Joe Scarborough, host of MSNBC's \"Morning Joe\", says his show has topped his CNN competitors.", "It was a message designed to get Joe Scarborough’s goat, and it worked. CNN ran a full-page ad in the New York Times on Jan. 29 to crow, \"CNN’S New Day beat MSNBC’S Morning Joe for the 4th month in a row in Total Viewers and 7th month in a row among Adults 25-54.\"", "To rub more salt in the wound, the ad added, \"HLN’S Morning Express beat MSNBC’S Morning Joe for the 9th month in a row among Adults 25-54.\"", "Soon after he got off the air, Scarborough, the co-host of Morning Joe, shot back in a tweet: \"Cute ad but CNN is firing people. Morning Joe is hiring. Oh yeah. And more people have watched Morning Joe than CNN & HLN 5 years in a row.\"", "A reader asked us if Scarborough was on solid ground. Has his show topped CNN and HLN in the morning time slot? And if Scarborough is right, does that mean CNN is wrong?", "Not necessarily.", "When you pick apart the details in each claim, you find that both have merit.", "Neel Khairzada, director of communications for CNN, basically said as much.", "\"The difference in the claims is that New Day is going by the coveted 25-54 demo, which is the metric advertisers care about, and Joe is tweeting about total viewers,\" Khairzada told PunditFact.", "PunditFact got the monthly Nielsen numbers for the three morning shows. The following chart shows the average daily viewers each month for two groups -- everyone over 2 years old and people 25-54.", "Average daily viewers 2+ (1000s)", "Average daily viewers 25-54 (1000s)", "Month", "MSNBC", "CNN", "HLN", "MSNBC", "CNN", "HLN", "Jan.\n2015", "316", "393", "284", "88", "138", "132", "Dec. 2014", "330", "339", "264", "95", "116", "125", "Nov. 2014", "358", "367", "224", "100", "125", "113", "Oct. 2014", "342", "346", "232", "86", "108", "112", "Sept. 2014", "363", "341", "237", "105", "107", "110", "Aug. 2014", "340", "388", "250", "80", "133", "111", "July 2014", "312", "302", "208", "79", "93", "95", "June 2014", "332", "249", "214", "83", "77", "106", "May 2014", "331", "283", "215", "98", "80", "102", "April 2014", "338", "364", "203", "106", "119", "92", "March 2014", "350", "357", "206", "116", "124", "89", "Feb. 2014", "379", "232", "212", "127", "79", "83", "Jan. 2014", "373", "210", "215", "132", "74", "108", "On these terms, CNN’s ad was accurate for New Day and Morning Express. For adults 25-54, New Day did better in the past seven months, and Morning Express did better in the past nine. In terms of total viewers, the numbers jump around. Sometimes Morning Joe wins the time slot, sometimes it doesn’t.", "However, you can also use the Nielsen data to tell a different story that paints a stronger picture for Morning Joe.", "PunditFact got the average daily viewers each year (not by month) for Morning Joe and the CNN programs. The data for MSNBC looks like this.", "Avg. daily viewers per year 2+ (1000s)", "Avg. daily viewers per year 25-54 (1000s)", "Year", "MSNBC", "CNN*", "HLN", "MSNBC", "CNN*", "HLN", "2014", "347", "317", "223", "100", "104", "104", "2013", "407", "294", "238", "135", "109", "122", "2012", "458", "235", "248", "166", "95", "128", "2011", "449", "292", "315", "148", "125", "154", "2010", "387", "308", "316", "118", "120", "185", "* CNN’s New Day didn’t launch until midway through 2013; earlier years in the table relate to previous CNN programs in the same time slot, 6 a.m. to 9 a.m.)", "Crunch the Nielsen numbers this way, and Scarborough is correct. Based on all viewers in the course of a year, including those as young as 2, his program comes out on top for the past five years. It’s a mixed bag in the 25-54 demographic.", "This sort of ratings battle is old hat to James Webster, a professor at Northwestern University’s School of Communications. Webster told PunditFact that this sort of squabble over who is in the lead happens pretty regularly.", "\"They are both looking at numbers that work to their advantage,\" Webster said.", "Another communications researcher, Bob Thompson at the Newhouse School of Public Communications at Syracuse University, saw a certain vagueness in Scarborough’s tweet. The reference to CNN is broad, Thompson said, and he was confident Scarborough was looking beyond a narrow demographic.", "\"The ‘more people’ gives no demographic qualification, so his claim here is for total viewers,\" Thompson said.", "Webster cautioned that small differences of a few thousand viewers might not be statistically significant.", "\"Technically, you can claim victory but these surveys only measure a tiny sample of the viewing audience and that means they are subject to large sampling errors,\" Webster said.", "For example, for the 25-54 age group in September 2014, CNN was ahead by 2,000 viewers, but statistically, that was a tie with MSNBC.", "Webster said consistent trends provide the most reliable perspective. We took the yearly averages, the framework most favorable to MSNBC, and looked at the difference each year in total audience. Over the past three years, CNN and HLN have greatly narrowed the gap with MSNBC. There’s a similar trend in the 25 to 54 age group, and by the most conservative interpretation of the numbers, the three programs tied in 2014.", "Our ruling", "Scarborough tweeted that more people have watched Morning Joe than CNN and HLN 5 years in a row. In the most general sense, the average daily audience each year for anyone 2 years old and up, he is correct.", "But there are many other ways to slice the apple that paint a more complicated ratings picture. Looking at the more valuable television demographic for advertisers, 25-to-54-year-olds, MSNBC has been in a dogfight with CNN and HLN. And more recent month-by-month data shows CNN clearly is gaining ground and has surpassed Morning Joe.", "Scarborough’s claim is literally accurate, but experts we consulted said it’s a bit deceiving given the other data that exists.", "That most closely fits our definition of Mostly True.", "Joe Scarborough, tweet, Jan. 29, 2015", "Mediaite, CNN Taunts MSNBC and Morning Joe with Full-Page NY Times Ad, Jan. 29, 2015", "Washington Post, MSNBC slides toward irrelevance, Oct. 13, 2014", "Nielsen data", "Interview, James Webster, professor, School of Communications, Northwestern University, Jan. 29, 2015", "Email interview, Bob Thompson, professor of television and popular culture, S.I. Newhouse School of Public Communications, Syracuse University, Jan. 30, 2014", "Email interview, Neel Khairzada, director of  communications, CNN, Jan. 29, 2015", "Email interview, Rachel Racusen, vice president for communications, MSNBC, Jan. 29, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]