["In March, as the coronavirus pandemic was raging in New York, Florida began carefully scrutinizing travelers arriving on flights from New York, New Jersey, Connecticut and other high-risk areas.", "An executive order by Gov. Ron DeSantis, as implemented, requires visitors from hard-hit areas to complete a form with contact information as part of a requirement that they self-quarantine for 14 days.", "“After the stay-at-home, shelter-in-place order was issued, you started having a flood out of New York City, taking hundreds of flights to the state of Florida,” DeSantis told reporters in Tallahassee as the order went into effect. “Those flights became the hottest ticket. ... It is mostly South Florida, but we saw 30-40 flights direct to Orlando.\"", "The claim regarding airport forms was raised on the Facebook page of Health Nut News. An original posting was updated to make it clear the requirement did not apply to all incoming flights, only those from the three Northeast states hard-hit by the virus.", "Subsequent public posts from Facebook users included photos of the documents.", "The requirement is authorized under Executive Order 20-80 issued by the Republican governor on March 23, although it does not specifically spell out the use of a traveler form. Instead, it directs the Florida Department of Health to take whatever steps necessary \"to ensure the screening and appropriate isolation and quarantine of individuals covered by this Order.\"", "The governor, in the decree, noted that Florida is experiencing an increase in individuals fleeing to Florida from states where \"shelter-in-place\" orders are being implemented, including from the New York Tri-State area.", "The order added that it was the duty of every state law enforcement official to help the Department of Health enforce the quarantine.", "The state Department of Transportation, discussing its implementation of the order, said, \"Upon arrival to Florida, each arriving traveler or responsible family member (if traveling as a family) will be required to complete an airport traveler form.\"", "\"The form requires key information related to the traveler’s history including contact information and trip details be provided to DOH,\" the transportation department said. \"Failure to complete the form and failure to follow any isolation or quarantine order from DOH are a violation of Florida law.\"", "More:As coronavirus pandemic spikes orange juice sales, a Florida citrus grower gets squeezed", "The DOT also noted that \"members of the Florida National Guard will be on site at airports throughout the state to help ensure the process runs efficiently.\"", "Greg Meyer, spokesman for the Broward County Aviation Department, said passengers traveling from eight New York City areas were given forms to fill out before boarding their flights to Florida, the Sun-Sentinel reported.", "The arriving passengers are also given a travelers card that contains contact information and additional guidance if a person develops coronavirus symptoms.", "The requirement is not applied to all incoming flights, rather focuses on those from the New York area.", "As of May 19, the health department said, more than 37,400 traveler forms have been collected at public-use airports across the state.", "That original order was followed by EO 20-82 on March 24, also aimed at the New York area as well as visitors from places experiencing \"substantial community spread\" of the coronavirus. It added a requirement that these visitors must \"inform individuals in Florida with whom they have had direct physical contact in the past 21 days that they traveled from an area with substantial community spread.\"", "Failure to abide by these executive orders could subject individuals to imprisonment up to 60 days and a fine up to $500.", "On March 27, the governor issued EO 20-86 that specifically included visitors from Louisiana.", "It spelled out the use of highway patrol roadblocks on Interstate 10, which passes through Louisiana, and Interstate 95, which extends to New York. Unlike the airport decree, it specifically required visitors from affected states to fill out a traveler form.", "The health department said 36,900 travelers had filled out the forms as of May 19.", "More:Florida Keys to reopen to tourists June 1, over two months after closing over coronavirus concerns", "Florida does require airline travelers from areas hard-hit by the virus, especially New York, New Jersey and Connecticut, to fill out a traveler form with contact information and to self-quarantine for 14 days.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]