["Seeking Marco Rubio’s soon-to-be-vacant Senate seat, U.S. Rep. David Jolly said during a debate in Orlando that he’s committed to sticking to conservative principles, even if it means voting against his own party.", "Jolly met with U.S. Rep. Alan Grayson, D-Orlando, at an Open Debate Coalition event on April 25, 2016, to discuss the Senate candidates’ platforms. After a question about whether he would support defending or defunding Planned Parenthood, Jolly said he opposed abortion and could not support the group, which has been under fire after being accused of selling fetal tissue.", "But he acknowledged other women’s health services deserved funding and decried government wasting too much time and money on attacking Planned Parenthood.", "\"When my side of the aisle asked for an investigation of Planned Parenthood, I actually voted no. I was the only Republican to vote no,\" he said. \"Should the issue be looked at? Yes. But there were already three committees looking at the issue. We didn’t need a fourth. We’re either going to be the party of less government or not.\"", "Technically, the investigation Jolly is talking about doesn’t mention Planned Parenthood by name, but the Indian Shores Republican was the lone member of his party to oppose it.", "Copious committees", "The Republican-controlled House responded swiftly after the Center for Medical Progress released their heavily edited videos in July 2015 alleging Planned Parenthood sold fetal tissue after abortions.", "The Energy and Commerce Committee, the Judiciary Committee and the Oversight and Government Reform Committee all announced investigations into the videos on July 15. (The Senate also prodded the Health and Human Services Department to open an investigation, as well.)", "Despite several hearings, including testimony from Planned Parenthood Federation of America President Cecile Richards, there was no proof the group broke the law, which allows for tissue donations for an unspecified procurement fee but not taxpayer funds for abortions.", "On Oct. 7, 2015, the House voted on HR 451, which created a select investigative panel \"for the purpose of investigating abortion practices and the handling of and policies regarding fetal tissue, its cost, and how it is obtained.\"", "Planned Parenthood was not named in the resolution, but was clearly the target of the investigation. Jolly was the only Republican to go against his party in a 242-184 vote, with two Democrats voting for it.", "Jolly noted in a Facebook post after the vote that he did not believe the panel was necessary.", "\"We should always look to streamline government, not expand it. And the bottom line is today's decision unfortunately fails that most basic conservative principle,\" he said, according to the Tampa Bay Times.", "\"Simply put, because three panels currently have jurisdiction to investigate, we do not need to create a fourth.\"", "We couldn’t find the post when we looked at Jolly’s Facebook timeline. His campaign directed us to a similarly worded Newsmax article Jolly wrote on Oct. 14, 2015.", "The article highlighted legislation Jolly introduced \"to fully defund taxpayer support for Planned Parenthood until a thorough investigation is completed, and instead transfer that funding to other providers of critical non-abortion women's healthcare in underserved communities.\"", "Investigations by 12 state governments did not find any evidence of fetal tissue sales, although a grand jury in Texas in February 2016 did indict David Daleiden and Sandra Merritt, who made the videos. They both face charges of tampering with a government record, while Center for Medical Progress founder Daleiden was charged with prohibition of the purchase and sale of human organs.", "The panel the House created in October, the Select Investigative Panel on Infant Lives, has held hearings but has not yet asked Daleiden to testify.", "Our ruling", "Jolly said he \"was the only Republican\" to vote against creating a House panel to investigate Planned Parenthood.", "The reason he voted no, he said, is because the House already had three investigations into Planned Parenthood’s alleged sale of fetal tissue. Jolly made it clear at the time he was not in favor of spending more taxpayer dollars to investigate something already under the microscope.", "We rate his statement True.", "U.S. Rep. David Jolly, \"Florida Open Debate Live,\" April 25, 2016", "U.S. House Energy and Commerce Committee, \"Energy and Commerce Committee Launches Investigation Following ‘Abhorrent’ Planned Parenthood Video,\" July 15, 2015", "U.S. House Judiciary Committee, \"Chairman Goodlatte Announces House Judiciary Committee Investigation into Horrific Abortion Practices,\" July 15, 2015", "PolitiFact, \"The Planned Parenthood video in context,\" July 17, 2015", "Tampa Tribune, \"Rep. Jolly introduces bill to defund Planned Parenthood,\" Aug. 4, 2015", "PolitiFact, \"PolitiFact Sheet: 8 things to know about the Planned Parenthood controversy,\" Aug. 5, 2015", "C-SPAN, \"Planned Parenthood Funding,\" Sept. 29, 2015", "Tampa Bay Times Buzz blog, \"David Jolly only Republican to vote against new committee to investigate Planned Parenthood,\" Oct. 7, 2015", "Roll Call, \"House GOP Looks Outside for Advice on Planned Parenthood Panel,\" Oct. 7, 2015", "Washington Post, \"Special House committee will investigate Planned Parenthood, abortion issues,\" Oct. 7, 2015", "Washington Times, \"House votes to investigate Planned Parenthood, other providers’ harvesting of fetal tissue,\" Oct. 7, 2015", "NewsMax, \"Rep. David Jolly: We Can Fix a 'Broken' Washington,\" Oct. 14, 2015", "Huffington Post, \"Congress Plows Ahead With Planned Parenthood Investigation Despite Pressure To Drop It,\" Dec. 17, 2015", "Sen. Rand Paul, \"Sen. Rand Paul Announces HHS Investigation of Planned Parenthood Tissue Practices,\" Dec. 22, 2015", "The Hill, \"Creator of Planned Parenthood videos indicted in Texas,\" Jan. 25, 2016", "Houston Chronicle, \"Planned Parenthood cleared, but 2 indicted over videos,\" Feb. 2, 2016", "Politico, \"New GOP claim of illegal handling of fetal tissue,\" April 19, 2016", "USA Today, \"House panel on 'infant lives' clashes over subpoenas to researchers,\" March 2, 2016", "MSNBC, \"House committee holds testy hearing on Planned Parenthood tapes,\" April 20, 2016", "U.S. House Oversight and Government Reform Committee, \"Planned Parenthood Investigation,\" accessed April 26, 2016", "GOP.gov, \"House Investigation into Planned Parenthood,\" accessed April 26, 2016", "U.S. House Energy and Commerce Committee, \"Select Investigative Panel,\" accessed April 26, 2016", "Congress.gov, HR 461, accessed April 26, 2016", "Interview with Max Goodman, Jolly spokesman, April 26, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]