["By Jessica McDonald", "Posted on September 9, 2019", "In making his case for taking swift action on climate change, Democratic presidential candidate Pete Buttigieg inaccurately said that “we could lose half the world’s oxygen because of what’s going on in the oceans.” Scientists say that’s a misreading of the evidence.", "Climate change does pose a threat to oceans, including by reducing the amount of dissolved oxygen in the water, which in some places could be cut in half. But globally, oceans are projected to lose only 1%-7% of their oxygen, and the world’s atmospheric oxygen supply is not at risk.", "Buttigieg’s comment came about halfway through his 40-minute segment of CNN’s climate-focused town hall event on Sept. 4. The marathon event stretched over seven hours and featured nine other leading Democratic candidates.", "The mayor of South Bend, Indiana, began by referencing future generations before turning to the oceans and oxygen levels.", "Buttigieg, Sept. 4: And for me and everybody I know, for the children that we hope to have, for the people who will be alive at the turn of the century, when if we don’t change what we’re doing, we could lose half the world’s oxygen because of what’s going on in the oceans. That is unthinkable.", "When asked for support for the statement, the Buttigieg campaign directed us to an online news story in Smithsonian Insider about declining oxygen levels in the ocean as a result of human activity. The story reports on a 2018 paper published in the journal Science, which details what scientists know about the subject. The Smithsonian Insider quoted a scientist as saying “approximately half” of the oxygen on Earth comes from the ocean.", "But as Kristen Krumhardt, a postdoctoral researcher and biological oceanographer at the National Center for Atmospheric Research, told us, that fact “doesn’t really have to do with the deoxygenation problem” — and it doesn’t mean we could lose half of the world’s oxygen.", "As we’ve explained before, the Earth’s atmosphere is around 21% oxygen, and nothing about climate change is going to reduce the amount of oxygen in the air by any noticeable degree. Even if nearly every living organism were incinerated, the oxygen concentration in the air would hardly budge, falling from 20.9% to 20.4%.", "“Under no circumstances will half the world’s breathable oxygen be gone by 2100 or even by 21,000!” said Scott Denning, an atmospheric scientist at Colorado State University, in an email.", "When scientists say that oceans produce half of the world’s oxygen, they’re referring to the total amount of photosynthesis that’s being done by organisms in the ocean, such as phytoplankton, compared with all photosynthesis performed on land and the ocean. As we’ve detailed before, this is called primary production, and it turns out the job is fairly evenly split — land and ocean each do about 50%.", "While it’s important that all that photosynthesis happens, it has almost no bearing on the current concentration of oxygen in the atmosphere because the ocean consumes virtually all of the oxygen it makes. Indeed, as we’ve written, it’s only after millions of years of slight oxygen surpluses that the planet has accumulated its hefty oxygen reserves, and nothing is going to change that anytime soon.", "Nevertheless, it is true that the total amount of oxygen the ocean produces is expected to fall with continued climate change — although not to the extent that Buttigieg said. According to Krumhardt, who has studied the topic, climate models indicate that the primary productivity of the ocean will decline by around 5% by 2100 if greenhouse gas emissions continue unabated. This will happen, she said, primarily because of changes in nutrient availability for the marine algae that do much of the ocean’s photosynthesis.", "As the world’s seas warm, the higher temperatures will generally encourage phytoplankton growth, Krumhardt explained. But the heat will also reduce the amount of nutrient mixing that occurs between the layers of the ocean, increasing what scientists call ocean stratification. While some places with readily available nutrients could see a boost in productivity, generally speaking, fewer nutrients will make it to the top, sunlit areas of the ocean. The net effect, she said, will likely be a small decline in the amount of oxygen produced.", "Again, as Krumhardt said, the reduced productivity is “hardly going to make any dent” in atmospheric oxygen. But it will mean that the world’s waters are capable of supporting less life. Phytoplankton, she said, form the base of the marine food web, and a reduction in the amount of energy they make can have ripple effects up the food chain, including a decrease in the number of fish.", "While Buttigieg didn’t refer to ocean oxygen levels in his statement, ocean deoxygenation is a legitimate concern. Together with ocean acidification, deoxygenation is one of the biggest threats to the ocean from increasing global temperatures. But if deoxygenation is what he had in mind, Buttigieg also overstated the impact.", "Denise Breitburg, a marine scientist at the Smithsonian Environmental Research Center and the lead author of the Science review paper that the cited news story covered, told us in an email that there are places in the ocean where half the oxygen in the water could be lost, but that “isn’t true” of the whole ocean. Instead, models project the ocean will lose 1%-7% of its dissolved oxygen by 2100.", "In some locales, large oxygen declines have already occurred. In Monterey Bay, California, for example, water oxygen levels between 250 and 400 meters deep fell 40% between 1998 and 2013. A climate monitoring station in the northeastern Pacific has also documented a 22% drop in oxygen at 100-400 meters deep between 1956 and 2006.", "Less available oxygen in the water is bad news for many fish species and other aquatic creatures, such as crustaceans, that have relatively high oxygen demands. Not all organisms will be affected, since some are already adapted to low-oxygen environments, and others can continue to survive even if oxygen levels fall considerably. But fast-changing conditions in select areas could spell doom for many species.", "Measurements of ocean oxygen suggest that global levels have fallen by about 2% since 1960, in tandem with increased greenhouse gas emissions and rising temperatures. But the declines have been much steeper in certain pockets of the ocean. According to Breitburg’s review, over the past century open-ocean oxygen-minimum zones, or areas where oxygen is too low to support most aquatic life, have grown by 1.7 million square miles — an area approximately the size of the European Union — and the portion of the ocean that is entirely lacking in oxygen has quadrupled.", "Global warming increases ocean deoxygenation in two main ways. First, because the water is warmer, oxygen solubility is lower, and the water simply holds fewer oxygen molecules. Scientists estimate that solubility alone accounts for about 15% of the oxygen loss that has already occurred, and it explains more than half of the oxygen loss in the top 1,000 meters.", "The other 85% of deoxygenation is thought to be due to more extreme ocean stratification, which is driven both by temperature and other indirect effects of warming. “Warm water is buoyant,” Denning explained, “so surface water floats on top and can’t mix oxygen down to depths where organic matter sinks below surface.” Hotter conditions on Earth also boost ice melt and change precipitation patterns, which can lower the salinity of the surface water, adding to the separation of the ocean layers. The end result is less mixing of oxygen at the surface and less spread of nutrients from lower depths.", "Complicating matters further, under higher temperatures, organisms will have faster metabolisms and will use oxygen more quickly, which could compound the issue of deoxygenation for certain creatures.", "And in an odd feedback loop, scientists think marine bacteria could end up producing more nitrous oxide if global warming continues and lower-oxygen waters expand. Nitrous oxide is a greenhouse gas that’s nearly 300 times better at trapping heat than carbon dioxide over a century.", "In coastal areas, too, deoxygenation of waters is a problem, largely because of fertilizer runoff and sewage discharges, which trigger algal blooms that deplete the water of oxygen when microbes consume the algae. Climate change can make these events worse.", "Buttigieg is wrong about a 50% decline in the world’s oxygen. But he has a point that failing to address climate change will have an impact on oceans. As Breitburg said in her Science review, “the total amount of oxygen loss will be a few percent by the end of the century, a decline that could have substantial biogeochemical and ecological effects.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]