["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A screenshot from a handout video from Syrian activist group Aleppo Media Center (AMC) shows a 4-year-old boy with a bloodied face sitting in an ambulance after a house was destroyed in an airstrike on Aug. 17, 2016, in Aleppo. (MCT)", "Viral footage of a stunned 5-year-old boy covered in blood and debris from an airstrike in Aleppo have refocused the world’s attention on the Syrian civil war.", "Five years in, the bloody conflict has left an estimated 470,000 dead, including the older brother of Omran Daqneesh, Ali. But Syria has been a blip in the U.S. presidential election, with both major party nominees more focused on fighting ISIS.", "Americans don’t know what Donald Trump or Hillary Clinton would do to respond to Syria’s civil war, less than three months from Election Day, said Julie Pace, chief White House correspondent for the Associated Press.", "\"If you are a voter in this election and you look at that picture of that little boy and you feel sick to your stomach, like most of us do, you should look at your presidential candidates and demand a plan,\" Pace said Aug. 21 Fox News Sunday. \"Neither Hillary Clinton or Donald Trump have a plan for addressing the civil war in Syria.\"", "Is it true that Clinton and Trump have yet to detail how they would tackle the war as commander in chief?", "For the most part, yes. As Pace said, Clinton and Trump have almost entirely focused on stopping ISIS, with little attention paid to the other crisis in Syria.", "How Syria fell into civil war", "Daveed Gartenstein-Ross, a senior fellow at the Foundation for Defense of Democracies, agreed with Pace that neither candidate has really tackled the civil war issue.", "\"In fairness to them,\" he said, \"it’s really difficult to address. The Obama administration has been tied in knots by it.\"", "The crisis in Syria involves myriad actors, confusing alliances and conflicting motives. According to the United Nations, no side’s hands are clean of war crimes including murder, torture and rape. Investigators have also found evidence of President Bashar al-Assad and ISIS using chemical weapons against civilians.", "More than 250,000 have died in the past five years, with millions displaced from the country. The crisis, according to the Council on Foreign Relations, is only getting worse.", "The situation started in the mid 2000s when a severe drought in the country’s breadbasket created an internal mass migration of refugees into Syrian cities already crowded by Iraqi migrants displaced by the Iraq war. This exacerbated existing problems like unemployment, corruption and brewing discontent with the Assad regime.", "The unrest reached its boiling point during the Arab Spring of 2011, when pro-democracy protesters took to the streets and were met with a government crackdown. That summer, opposition groups began taking up arms, and war erupted.", "Religious divides and foreign power proxy wars make the conflict even more complicated. Most of the rebels are Sunni Muslim, backed by Sunni countries, like Turkey and Saudi Arabia, while Assad’s security forces belong to the minority Alawite sect, aided by Shia regimes like Iran and Iraq, as well as Russia.", "In the early days of the war, the Obama administration (with Clinton as secretary of state) focused on overthrowing Assad and supported moderate rebel groups. But the United States’ priorities have shifted to airstrikes on ISIS targets.", "With that move, the United States has given Russia \"freedom of action in backing Assad while the United States focuses on ISIS — choices that also empower Iran and raise critical questions about who will really win in Syria if the United States does defeat ISIS,\" Anthony Cordesman, a Middle East expert at the Center for Strategic and International Studies, wrote in a working paper.", "Where Clinton and Trump stand", "The record largely backs Pace’s claim that Clinton and Trump have yet to propose a comprehensive plan on how they would address the Syrian civil war. Clinton has given a few more specifics than Trump, whose campaign did not respond to us by deadline.", "Both candidates talked about the war at large in fall 2015, when Russia began bombing anti-Assad rebels. In an interview, Trump said he wanted to \"sit back and ... see what happens.\" Clinton, breaking with the Obama administration, advocated for a no-fly zone, in which unauthorized aircraft are prohibited from entering the zone.", "Since then, Trump has said little regarding the civil war, keeping his focus on ISIS without a lot of specifics to preserve the element of surprise.", "When Trump does mention Syria, it’s to bolster his criticism of Clinton and Obama’s foreign policy or his proposal to ban Muslim immigrants and refugees.", "In recent months, Trump has repeatedly argued for working with Russia to \"knock the hell out of ISIS.\" This position is more or less aligned with the current policy of learning to live with Assad, Gartenstein-Ross said. Trump has also called for safe zones, to be paid for by the Gulf States.\"", "Clinton has been more specific than Trump regarding the conflict at large. Here’s what she’s proposed as a presidential candidate:", "• A no-fly zone \"that will stop Assad from slaughtering civilians,\"", "• Creating safe havens for civilians,", "• More support for opposition forces,", "• Removing Assad through diplomacy,", "• Stopping the \"ongoing bombing that Russia has carried out in support of the Assad regime against the Syrians.\"", "Both Pace and Gartenstein-Ross said Clinton’s varied ideas don’t amount to a full vision for ending the war.", "\"It’s a recipe for escalating the conflict without resolving the civil war,\" he told us. \"It’s unclear to me what the end game is and what the solution is.\"", "Neither candidate has said what should happen as a result of a piecemeal approach: Is the goal of a no-fly zone to help opposition groups oust Assad? Pace asked. Similarly, is the goal of working with the Russians on airstrikes to prop up Assad?", "The United States’ narrow strategy in Syria may be self-defeating in the end, according to Cordesman. Even if ISIS is defeated, any new government will be \"hopelessly unstable\" given all the ethnic and religious divisions and foreign involvement.", "\"Both candidates may choose to continue to address these issues in silence, but there is even less doubt than in the case of Iraq as to what the real legacy of the Obama administration is likely to be by the spring of 2017,\" Cordesman wrote. \"The transition plan seems to consist of a poison chalice.\"", "Pace acknowledged that the Syrian crisis \"is one of the world’s most difficult problems,\" but said if the humanitarian crisis really matters to voters, they should make that known for this election and demand more clarity from the candidates.", "\"One of them will inherit this problem,\" she said.", "Our ruling", "Pace said, \"Neither Hillary Clinton nor Donald Trump have a plan for addressing the civil war in Syria.\"", "This is largely accurate. Clinton has called for a no-fly zone and safe zones in Syria to give civilians reprieve from war and continues to advocate for the ousting of Syrian President Bashar al-Assad. Her plans for Syria are considerably less detailed than her proposals for many other issues on her website.", "Trump says he wants to build safe zones and to work with the Russians, who are backing Assad.", "These proposals are ideas and not comprehensive plans for ending the civil war.", "We rate Pace's claim Mostly True.", "Editor's note: The original version of this fact-check contained an inaccurate reference about Russia and the Assad regime. The article has been corrected to reflect Russia's support of Assad.​ This fact-check has also been updated with an additional proposal on Syria from Trump.", "https://www.sharethefacts.co/share/3d104f9e-2dd7-41d8-8af2-1ab86d7d0a8d", "Fox, Fox News Sunday, Aug. 21, 2016", "PBS, \"A Staggering New Death Toll for Syria's War — 470,000,\" Feb. 11, 2016", "Washington Post, \"A transcript of Donald Trump’s meeting with The Washington Post editorial board,\" March 21, 2016", "New York Times, \"Transcript: Donald Trump Expounds on His Foreign Policy Views,\" March 26, 2016", "Donald J. Trump, \"Understanding The Threat: Radical Islam And The Age Of Terror,\" Aug. 15, 2016", "BBC, \"Syria: The story of the conflict,\" March 1, 2016", "Council on Foreign Relations, \"Civil War in Syria,\" Aug. 18, 2016", "Al Jazeera, \"Syria's Civil War Explained,\" May 24,2016", "Washington Post, \"3rd Democratic debate transcript, annotated: Who said what and what it meant,\" Dec. 19, 2015", "CNN, \"Democratic Town Hall Event with Voters in South Carolina,\" Feb. 23, 2016", "Center for Strategic and International Studies, \"U.S. Wars in Iraq, Syria, Libya, and Yemen: What Are The Endstates?\" Aug. 15, 2016", "ABC, This Week, Oct. 4, 2015", "Donald J. Trump, Republican Nomination Acceptance Speech, July 21, 2016", "Donald J. Trump, Understanding The Threat: Radical Islam And The Age Of Terror, Aug. 15, 2016", "Reuters, \"DONALD TRUMP WOULD CONSIDER ALLIANCE WITH RUSSIA'S VLADIMIR PUTIN AGAINST ISIS,\" July 25, 2016", "Email interview with Julie Pace, White House correspondent with the Associated Press, Aug. 21, 2016", "Email interview with Josh Schwerin, Clinton campaign spokesman, Aug. 21, 2016", "Email interview with Anthony Cordesman, national security analyst at the Center for Strategic and International Studies, Aug. 21, 2016", "Interview with Daveed Gartenstein-Ross, senior fellow at the Foundation for Defense of Democracies, Aug. 21, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]