["About this rating", "In May 2018, an opinion piece arguing that the United States was in the midst of a modern Civil War went viral when it was shared as if it were written by Jack Minzey, a veteran and educator from Eastern Michigan University, who had passed away a few weeks previously.", "The Jackson Press, for instance, introduced the essay with the following paragraphs:", "A few days ago, Jack Minzey, sent what was to be the final chapter in the long line of books and treatises which he had written.", "Jack went to be with the Lord, on Sunday, 8 April 2018.", "Professionally, Jack was head of the Department of Education at Eastern Michigan University as well as a prolific author of numerous books, most of which were on the topic of Education and the Government role therein. His interest in Conservative Politics was exceeded only by his intellectual ability.", "This is the last of his works:", "Similar introductions could be found on The Chattanoogan and a multitude of Facebook posts and e-mail chains.", "Jack Minzey was truly an educator at Eastern Michigan University and he did pass away in April 2018. However, the essay attributed to Minzey is actually a shortened version of a speech delivered by Daniel Greenfield (a conservative author whose work can be found in publications such as FrontPageMag.com) at the South Carolina Tea Party Coalition Convention in January 2018:", "This is a civil war.", "There aren’t any soldiers marching on Charleston… or Myrtle Beach. Nobody’s getting shot in the streets. Except in Chicago… and Baltimore, Detroit and Washington D.C.", "But that’s not a civil war. It’s just what happens when Democrats run a city into the ground. And then they dig a hole in the ground so they can bury it even deeper.", "If you look deep enough into that great big Democrat hole, you might even see where Jimmy Hoffa is buried.", "But it’s not guns that make a civil war. It’s politics.", "Guns are how a civil war ends. Politics is how it begins.", "How do civil wars happen?", "Two or more sides disagree on who runs the country. And they can’t settle the question through elections because they don’t even agree that elections are how you decide who’s in charge.", "That’s the basic issue here. Who decides who runs the country? When you hate each other but accept the election results, you have a country. When you stop accepting election results, you have a countdown to a civil war.", "The piece can be read in its entirety here. A video of Greenfield's speech can be viewed below:", "It is unclear how Minzey's name was originally attached to this text. In similar instances, relatively unknown authors' names are replaced by those of celebrities or well-established political pundits in order to give an opinion piece more credence, or to increase the chances that it will get shared. In this case, it seems like there was renewed interest in Minzey's life and work following his passing, and someone took advantage of his death to bring attention to an unrelated piece.", "Greenfield, Daniel.   \"This Civil War - My South Carolina Tea Party Convention Speech.\"\r\n    Sultan Kinish.   26 January 2018.", "Greenfield, Daniel.   \"This Civil War - My South Carolina Tea Party Convention Speech.\"\r\n    Sultan Kinish.   26 January 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]