["“This is why the Iranian missiles didn’t damage the US base in Iraq . It’s the US anti missile batteries. Incredible to watch,” is a viral claim accompanying a video.", "This is why the Iranian missiles didn’t damage the US base in Iraq . It’s the US anti missile batteries. Incredible to watch ….Via WA pic.twitter.com/nKJvz94Jtr", "— JP 🇮🇳 (@JPulasaria) January 16, 2020", "Several individuals shared the video with the same claim on Facebook.", "A similar claim has also been used to circulate the video on Facebook and Whatsapp. It reads, “Iran fired 12 missiles at an American base in Iraq…old story. News report that – Iranian missiles missed. What is not talked about is the US automatic missile defense system that took almost all of them down. It’s a battery of 50 caliber guns that fires 3000 rounds per minute at the incoming missile(s). Here is a video of what happened.”", "Alt News has received multiple requests on its official mobile application to fact-check the video.", "Alt News used InVID to break the viral video into key-frames and perform a reverse-search of one of the frames on Google. We came across a video on YouTube uploaded on Jun 24, 2019 with the description “無人航空機 夜間射撃 フリゲート 搭載 ファランクス 撃墜 シウス ドローン CIWS Phalanx Drone UAV Frigate Night ARMA3 アーマ3 チャンネル登録をお願いします♪♪♪”", "In an email conversation, independent video games developer Bohemia Interactive, which also developed ARMA3, confirmed to AFP that the footage is from their game customised by players.", "“We are sure that the YouTube video is from ARMA 3, made by one of our players. It should be noted that our ARMA games can be modified (adapted, NDLR) by their users and that people can create their own scenarios with the game editor. As such, what you are seeing in this video is not the ARMA 3 experience pattern, it seems to be a modified version of the game and a custom scenario made by players,” reads their statement.", "The video was viral last year with multiple false claims such as “Israeli anti-missile system” and “Russian anti-missile shooting down Israeli missile in Syria”.", "In conclusion, a clip from a military-themed video game ARMA3 has been shared across social media platforms with the claim that it shows US anti-missile system bringing down rockets fired by Iran at US base in Iraq.", "Donate Now", "Co-founder, Alt News Co-Founder Alt News, I can be reached via Twitter at https://twitter.com/zoo_bear", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]