["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A viral Facebook post that has been shared over 68,000 times makes the claim that the state of North Carolina banned Sharia law.", "The post says: \"North Carolina has banned Islamic Sharia Law and regard it as criminal, as it should be … let’s make it nationwide!\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "No, North Carolina has not banned or criminalized Sharia law from being practiced in the state.", "Sharia, which in Arabic means \"the way,\" is a religious law forming part of the Islamic tradition and refers to wide-ranging moral and broad ethical principles.", "In 2013, the state’s legislature did pass a law that barred North Carolina courts from applying \"foreign law\" to proceedings.", "House Bill 522, which the state’s General Assembly approved with a 75-37 vote, did not make it illegal for state residents to personally practice any foreign law, including Sharia, but prohibits state courts from applying such laws in cases of divorce, child custody, child support, alimony or other family law proceedings.", "Opponents say laws like these, which have been ratified in multiple states and are being proposed in others, target Islam and are, according to the Anti-Defamation League, \"redundant and wholly unnecessary.\"", "But in regard to the claim that Sharia was \"banned\": Nowhere in the bill’s language is it explicitly singled out, nor does the bill declare that practicing the religious law is a \"criminal\" offense.", "A popular post on social media says that North Carolina has banned Sharia law and regards it as \"criminal.\"", "While the claim has some basis, it takes a state law vastly out of context to make it appear as if Muslims living in North Carolina are banned and criminalized from personally practicing Sharia law, when it is, in fact, that all foreign laws are prohibited from being applied in state court proceedings.", "We rate it Mostly False.", "Facebook post, April 23, 2019", "North Carolina 2013 Legislature, House Bill 522; Accessed May 22, 2019", "Anti-Defamation League, ADL Disappointed Over North Carolina’s Passing of House Bill 522, After Urging Governor to Veto Legislation, Sept. 11, 2013", "CAIR, Anti-Islam Legislation in 2013, September 2014", "National Conference of State Legislatures, 2017 Legislation Regarding the Application of Foreign Law by State Courts, Aug. 17, 2017", "Snopes, Did North Carolina Ban Sharia Law and Make It ‘a Criminal Offense’? April 24, 2019", "KARE11, VERIFY: No, North Carolina didn't ban and criminalize Sharia law, May 16, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]