["About this rating", "On 12 August 2017, in the aftermath of a so-called \"Unite the Right\" protest in Charlottesville, Virginia that ended in a fatal vehicular attack, Al Jazeera English posted a vintage short film that struck an instant chord with a new generation of viewers (and quickly went viral) by drawing explicit comparisons between homegrown political rhetoric condemning ethnic and religious minorities, and the rise of Nazism in Germany leading up to World War II.", "The film is authentic. \"Don't Be a Sucker\" was produced by the U.S. Signal Corps and distributed by Paramount Pictures for viewing in civilian movie theaters in 1943 and again in 1947. A two-minute clip making the Twitter rounds captured the essence of its anti-fascist message:", "1947 anti-fascist video made by US military to teach citizens how to avoid falling for people like Trump is relevant again. pic.twitter.com/vkTDD1Tplh", "— Michael (@OmanReagan) August 13, 2017", "An analysis published in the Public Opinion Quarterly in 1951 notes that the character charged with supplying historical context in the film (see full video below) is a foreign refugee who recalls Germany's descent into totalitarianism under the Nazis:", "An onlooker, noting Mike's initial agreement and his later dismay at being implicitly attacked, draws him aside and discusses the rabble-rouser with him. The newcomer introduces himself as a refugee pro-fessor who saw the same things happen in Berlin. He warns Mike that such talk is always motivated by the speaker's desire for gain and that people like Mike never profit from discrimination.", "The refugee professor proceeds to draw the parallel between the present scene and Germany under Nazism. He describes a Nazi street speaker very much like the soap-box orator to whom Mike has been listening. In a flashback scene the Nazi speaker is seen haranguing a crowd. One by one the Nazi succeeds in isolating each minority group so that all are vulnerable. But, the narrator points out, the one who was really being swindled was Hans, a pure German according to Nazi standards. To him the Nazis promised everything and he believed them. In destroying the liberty of others he lost his own freedom and life.", "https://archive.org/details/DontBeaS1947", "Though it's dated and appears to modern eyes relatively simplistic in style and presentation, the film's message remains relevant. Hate groups still operate by trying to divide and conquer. \"I thought Nazis were crazy people, stupid fanatics,\" says the refugee professor in the film.  \"Unfortunately it was not so. They knew they were not strong enough to conquer a unified country, so they split Germany into small groups. They used prejudice as a practical weapon to cripple the nation.\"", "For all that Unite the Right organizer Jason Kessler denied that he advocated white supremacy, he appeared pleased enough to describe the event as a \"pro-white demonstration\" (its avowed purpose, after all, being to protest the planned removal of a Confederate monument). One of the scheduled speakers, Richard Spencer, was already notorious for evoking Nazi slogans such as \"Heil Hitler!\" (\"Hail Hitler!\") and \"Sieg heil\" (Hail victory!\") in a 2016 speech at a white nationalist conference in Washington, D.C.: \"Hail Trump! Hail our people! Hail victory!\" Spencer has unabashedly called for the establishment of a \"white ethno-state\" in North America.", "Another invitee, David Duke, is a former leader of the Ku Klux Klan.", "All three men, along with other groups and figureheads present at the Charlottesville event, have been unambiguously labeled white supremacists by the Anti-Defamation League, who characterized Unite the Right as \"the largest and most violent gathering of white supremacists in decades.\"", "Cooper, Eunice and Dinerman, Helen.   \"Analysis of the Film 'Don't Be a Sucker': A Study in Communication.\"\r\n   The Public Opinion Quarterly.   Summer 1951, pp. 243-264.", "Fallows, James.   \"Trump Time Capsule #31: 'Don't Be a Sucker.\"\r\n  The Atlantic.   30 June 2016.", "Stanglin, Doug and Cavallaro, Gabe.   \"1 Dead, 19 Injured as Car Hits Crowd After a 'Unite the Right' Rally in Charlottesville.\"\r\n  USA Today.   12 August 2017.", "Anti-Defamation League.   \"From Alt Right to Alt Lite: Naming the Hate.\"\r\n  Visited 14 August 2017.", "Anti-Defamation League.   \"Violence and Hate Unite the Right.\"\r\n  12 August 2017.", "WVIR.   \"ADL Lists Kessler, Other 'Unite the Right' Speakers as White Supremacists.\"\r\n  25 July 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]