["Tagging himself a common-sense conservative reformer, Wisconsin state Rep. Don Pridemore, R-Erin, aims to unseat first-term state Superintendent of Public Instruction Tony Evers in the April 2013 election.\n\nIn announcing his run Dec. 3, 2012, Pridemore criticized school performance, taking particular aim at the district in Wisconsin’s largest city, Milwaukee Public Schools.\n\nThe eight-year suburban lawmaker said \"86 percent of MPS students are behind in reading and 80 percent are behind in math.\"\n\nMilwaukee Public Schools is a popular target.\n\nBut are the vast majority of its students lagging in reading and math?\n\nPridemore’s evidence\n\nWhen we asked Pridemore to back up his claim, he cited an Oct. 24, 2012, article in the Milwaukee Journal Sentinel. The article reported on recalculations done by the Department of Public Instruction, the agency Evers heads, on a statewide student tests.\n\nThe recalculations were done on 2011 scores for the Wisconsin Knowledge and Concepts Examination, which is given each fall. As the Journal Sentinel explained, DPI raised expectations for performance to match those of a respected national exam.\n\nThe recalibration meant that essentially overnight, there was a large increase in the number of students who were rated as non-proficient -- even though their performance on the test didn’t change.\n\nStatewide, under the old standard for scoring the 2011 WKCE tests, 18 percent of students failed to score as proficient or advanced in reading. But the figure rose to 64 percent under the new standard.\n\nIn math, the non-proficiency figure rose from 22 percent under the old standard to 52 percent under the new.\n\nMilwaukee Public Schools students fared worse.\n\nUnder the old standard, nearly 42 percent of MPS students were scored as not proficient in reading. But under the new standard, the figure climbed to 86 percent.\n\nIn math, nearly 41 percent of MPS students were rated as not proficient under the old standard. That rose to just over 80 percent under the new standard.\n\nMilwaukee Public Schools spokesman Tony Tagliavia acknowledged the accuracy of the figures, but pointed out that the percentages of students in Milwaukee voucher, or choice, schools rated as not proficient were even higher in reading (90 percent) and math (88 percent). He said it was important to cite the performance of private schools that get public funding since they are \"pitched as the solution to issues with MPS.\"\n\nBut we’re not testing a claim about voucher schools -- we’re testing Pridemore’s claim about MPS students’ proficiency in reading and math.\n\nOur rating\n\nPridemore said that among Milwaukee Public Schools students, \"86 percent are behind in reading and 80 percent are behind in math.\"\n\nWe would note that the figures are as high as they not because of a change in student performance, but a change in the way the state scores a test.\n\nNevertheless, Pridemore states the figures accurately and we rate his statement True.", "WisconsinEye, video (at 2:40) of Don Pridemore campaign announcement, Dec. 3, 2012\n\nEmail interview, state Rep. Don Pridemore, Dec. 7, 2012\n\nEmail interview, Wisconsin Department of Instruction spokesman John Johnson, Dec. 14, 2012\n\nEmail interview, Milwaukee Public Schools media manager Tony Tagliavia, Dec. 18, 2012\n\nMilwaukee Journal Sentinel, \"Proficiency plummets at voucher schools, MPS with new test scoring,\" Oct. 24, 2012\n\nMilwaukee Journal Sentinel, \"Student scores slip with new proficiency benchmarks,\" July 17, 2012\n\nMilwaukee Journal Sentinel, \"State math scores stay on upward trend,\" March 27, 2012\n\nWisconsin Department of Public Instruction, 2011 WKCE test scores news release, March 27, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]