["About this rating", "On Aug. 6, 1965, the Beatles issued their fifth LP, \"Help!\", comprising the seven songs featured in their just-released feature film of the same name, plus seven additional tracks. (The U.S. version was offered as a soundtrack album that included only the songs appearing in the film, plus additional incidental music.)", "In 1965, adventurously offbeat or arty record album covers were rare in the pop music world, and \"Help!\" did not contribute much to breaking that pattern, offering a rather plain display of the group and album names, along with a picture of the Fab Four garbed in clothing they wore while filming skiing sequences in the Austrian Alps for the \"Help!\" movie:", "But as Beatles fans were wont to do -- especially in the wake of the \"Paul is dead\" rumor that erupted several years later -- enthusiasts scoured all aspects of the band's records for hidden messages and meanings. In this particular case, the rumored secret message was the interesting (if unexciting) claim that the Beatles were posed on the album cover in such a way that their arm positions spelled out H-E-L-P in semaphore.", "In fact, the Beatles weren't posed in a way that spelled out H-E-L-P, or anything else meaningful, in semaphore. Their arm positions corresponded, at best, to either the sequence N-U-J-V or N-V-U-J, depending upon whether one examined the U.K. or U.S. version of the album (which featured slightly different arrangements of the four group members on their covers):", "Photographer Robert Freeman, who shot the cover for \"Help!\" as well as three other Beatles albums, acknowledged that he had initially considered trying to arrange the group shot to spell out H-E-L-P, but in the end he opted to simply go with the positioning that had the best visual appeal -- regardless of meaning:", "The Beatles were filming a sequence in Austria where they stood on a skyline in the snow waving their arms to a music playback. From this I had the idea of semaphore spelling out the letters HELP. But when we came to do the shot the arrangement of the arms with those letters didn't look good. So we decided to improvise and ended up with the best graphic positioning of the arms.", "The shot was set up at the film studio near London where the Beatles were finishing the last scenes. They stood on a specially constructed platform with a white painted background wearing the black hats, coats and capes from the film wardrobe. I used a larger format camera to get detail on their faces because of the distance at which the shots were taken.", "It was a simple, graphic set-up bit. I think the cover would have had more impact with just the Beatles in the white space and no lettering at all. After all, they were at the height of their fame and easily recognizable. What they didn't need was HELP!", "In the world of Beatles conspiracy theory, NUJV is sometimes claimed to be an abbreviation for “New Unknown James Vocalist,” a reference to the look-alike and sound-alike musician who was supposedly tapped to secretly replace James Paul McCartney after the latter's untimely death in the 1960s.", "Lewisohn, Mark.   The Beatles Recording Sessions.\r\n    New York: Harmony Books, 1988.   ISBN 0-517-57066-1   (pp. 56-57).", "Associated Press.   \"Beatles Album Cover Photographer Robert Freeman Dies at 82.\"\r\n    Snopes.com.   10 November 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]