["Correspondents from CNN and RT debate the situation in Ukraine.", "A correspondent for RT, the English-language cable news network funded by the government of Russia, and CNN anchor Chris Cuomo recently debated the ongoing crisis in Ukraine and the media’s role.", "Cuomo suggested that CNN and other American media outlets are right to question to what extent Russia is meddling in the events in Ukraine. RT correspondent Anissa Naouai took the opposite tack, saying that the American media is believing everything the government in Kiev is saying while claiming news coming out of Russia is propaganda.", "You can watch the debate here if you like, but what struck us was a claim by Naouai about the American military.", "When Cuomo described the United States as \"war weary,\" Naouai responded:", "\"War weary?\" she asked. \"The U.S. spends more money on its military than the 16 biggest military budgets in the world. I wouldn’t call the U.S. military weary.\"", "From the context, it is clear that Naouai was talking about the next 16 biggest military budgets in the world combined. That’s what we decided to check.", "We found two credible groups that attempt to track military spending around the globe, the International Institute for Strategic Studies, a London think tank, and the Stockholm International Peace Research Institute.", "There are flaws in each group’s numbers -- the Stockholm International Peace Research Institute uses budget figures (not expenditures), and some countries don’t release detailed information on military spending -- but they are generally considered the best approximations available.", "For the record, Naouai referred us to the Stockholm International Peace Research Institute, but we’ll look at both.", "Both groups recently released data for 2013.", "The Stockholm International Peace Research Institute put the U.S. defense budget at just over $600 billion, while the International Institute for Strategic Studies uses a figure of $640 billion.", "Either number dwarfs the amount of spending by any other country, and plenty of countries combined, both groups conclude.", "But not the 16 next-biggest countries combined, as Naouai claimed on CNN.", "According to the Stockholm International Peace Research Institute, the next 16 biggest militaries spent $801 billion in 2013, and the United States spends as much on the military as the next eight countries combined (China, Russia, Saudi Arabia, France, the United Kingdom, Germany, Japan and India).", "Graphic: Stockholm International Peace Research Institute", "The International Institute for Strategic Studies only makes the top 15 spenders available for free. According to their analysis, the United States spent $600 billion on defense while the next 14 countries spent a combined $634.5 billion. By the International Institute for Strategic Studies analysis, the United States spends as much as the next 12 biggest countries combined.", "Graphic: International Institute for Strategic Studies", "Our ruling", "Naouai said, \"The U.S. spends more money on its military than the 16 biggest military budgets in the world.\"", "The United States is definitely No. 1 on the world’s defense spending list. But its expenditures don’t eclipse the next 16 biggest counties combined as Naouai said, according to two independent groups.", "While we don't think viewers would get a markedly different impression if Naouai had said 8 or 12 instead of 16, her figures are off by a significant-enough margin. As such, we rate her statement Half True.", "Mediaite, \"CNN’s Cuomo Grills RT Reporter Who Claims Russia Didn’t Invade Ukraine,\" April 17, 2014", "Twitter conservation with Anissa Naouai, April 17, 2014", "Stockholm International Peace Research Institute, \"The world in military expenditures,\" accessed April 17, 2014", "International Institute for Strategic Studies, military balance report for 2013, accessed April 17, 2014", "PolitiFact New Jersey, \"Cory Booker says U.S. military spending is greater than the next 10-12 countries combined,\" Feb. 10, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]