["About this rating", "After a crowd of supporters of U.S. President Donald Trump stormed the U.S. Capitol on Jan. 6, 2021, Snopes received reports that some users of online dating applications were using the sites not to make romantic connections but to out people who participated in the deadly insurrection.", "\"Women have been contacting the FBI due to men bragging about storming the Capitol on their tinder profiles,\" one person wrote on Twitter.", "The claims were true.", "Users of Tinder, Bumble, and other dating apps scanned the apps for profiles of people who resembled rioters in widely publicized photos of the siege and then shared that information with company representatives and/or investigative authorities, according to reputable news reports. The Washington Post reported on Jan. 16:", "Women and men have in some cases also turned the dating apps into hunting grounds, striking up conversations with rioters, gathering potentially incriminating photos or confessions, then relaying them to the FBI. Using the dating apps to pursue members of the mob has become a viral pursuit, with tips shared on Twitter and some women changing their location on the dating apps to Washington, D.C., in hopes of ensnaring a potential suspect.", "For example, Amanda Spataro, 25, of Tampa, called it her “civic duty” to swipe through dating apps for men who’d posted incriminating pictures of themselves. She told The Washington Post she found one man with a Bumble picture that seemed likely to have come from the insurrection; his response to a prompt about his “perfect first date” was “Storming the Capitol.”", "After she swiped right on the platform that touts itself as a site \"where women always make the first move,\" she said he sent her photos to prove his Capitol visit, the news outlet reported. From there, Spataro contacted the FBI.", "Another user, Alia Awadallah, used Twitter to report the phenomena of men using dating apps during their trips to Washington, D.C., to try to help Trump overthrow the results of the 2020 presidential election.", "\"It's funny how obvious it is when people aren't local,\" she tweeted on Jan. 7, one day after the pro-Trump insurrection. \"My app went from real estate agents, accountants, and contractors to ... none of that.\"", "In total, she said she came across dozens of men's profiles with clues including red MAGA hats and location tags that appeared to link them to the event. She said she called the FBI and police to report her discoveries.", "According to The Washington Post's report, both Bumble and Match Group — which owns Tinder, Hinge, OkCupid, PlentyofFish, and Match — said they were working to remove users known to be involved in the Capitol siege from their platforms.", "One Bumble official told the news outlet that app employees have reviewed pictures taken inside and around the Capitol during the siege.", "In tweets, the company confirmed that report, and said it temporarily removed a filter for all users to list their political preferences. \"[We] prohibit any content that promotes terrorism or racial hatred,\" the company posted.", "Additionally, Match Group said it has banned rioters’ accounts based on long-established rules against promoting or inciting violence, per The Post.", "Nonetheless, users of online dating sites in Washington, D.C., continued to post what they framed as unusual trends on the platforms before Biden's inauguration.", "On Jan. 18, one TikTok user posted a video that went viral highlighting an apparent surge of National Guard members — men between the ages of 18 and 22 — trying to get Tinder matches while visiting the district to provide extra security.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]