["“She jailed 1,500 Black men for possession of weed,” reads a Facebook post shared more than 200,000 times since October 8, 2020.", "It also claims Joe Biden’s running mate “withheld EVIDENCE on two Black men that were on Death Row” and “released the evidence AFTER THEY WERE EXECUTED.”", "The accompanying photo shows Harris laughing.", "While Biden’s choice of running mate was hailed as a historic first for women of color, she has come under fire for her record as a prosecutor and for failing to intervene in cases involving police brutality.", "AFP ran a search for keywords “Kamala Harris jailed 1,500” and found a New York Times article from July 2019 on a Democratic presidential debate in which Harris sparred with Hawaii Congresswoman Tulsi Gabbard.", "“Senator Harris says she’s proud of her record as a prosecutor and that she’ll be a prosecutor president. But I’m deeply concerned about this record,” Gabbard said.", "“She put over 1,500 people in jail for marijuana violations and then laughed about it when she was asked if she ever smoked marijuana.”", "The 1,500 figure appears to come from a 2019 article by the Washington Free Beacon -- a conservative publication -- entitled “Kamala Harris Packed California Prisons With Pot Peddlers.”", "It quotes statistics from the California Department of Corrections and Rehabilitation (CDCR) that at least 1,560 people were jailed for marijuana offenses in state prisons when Harris was California state attorney general from 2011 through 2016.", "The website later published a correction and pointed to a fact check by the San Francisco Chronicle which put the number of admissions to California state prisons for marijuana and hashish admissions at 1,974 during that period.", "This is confirmed by CDCR data obtained by AFP -- which relates to all inmates, not just black men.", "Contacted by AFP, the CDCR said there was no breakdown for marijuana offense admissions specifically by ethnicity and gender.", "In 2011, the California Public Safety Realignment Act meant most newly-sentenced non-violent criminals, including most drug offenders, were sent to county jail rather than state prison. This explains a drop in admissions figures between 2011 and 2012.", "The black male population of California state prisons stayed roughly the same during Harris’s time as attorney general. According to CDCR data, in December 2010, shortly before Harris took office, 29 percent of male inmates were black. In December 2017, after she left, this figure had dipped to 28.5 percent.", "The Facebook post also claims Harris withheld evidence in the cases of two Black men on death row and released that evidence only after they had been executed.", "This claim also appears to come from Gabbard’s remarks during her 2019 Democratic presidential debate with Harris.", "“She blocked evidence that would have freed an innocent man from death row until the courts forced her to do so,” Gabbard said.", "A New York Times article from 2018 accused police of framing Kevin Cooper, a Black man sentenced to death for the 1983 killing of four people in Chino Hills, California.", "The report said Harris refused to allow new DNA testing when she was attorney general that it suggested could have proved Cooper’s innocence.", "New York Times journalist Nicholas Kristof said Harris phoned him after the article was published and told him, “I feel awful about this.” She also issued a statement calling on authorities to allow the testing.", "According to California prison records, Cooper, now 62, is still on death row.", "AFP found no evidence Harris released evidence in cases after a Black convict was executed.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]