["About this rating", "UK sources suggested that schools there could minimize disruptions during standardized examinations by replacing analog clocks with digital versions in examination halls, because some students had difficulty estimating time remaining from the former.", "Schools throughout the UK are not replacing analog clocks with digital versions in all classrooms because modern students cannot tell time.", "In late April 2018 rumors about schools' removing analog clocks because students couldn't read them began to pop up all across the Internet:", "Analog clocks are kinda the worst. tbh. https://t.co/JwWYOtb8HM", "— BuzzFeed (@BuzzFeed) May 3, 2018", "Kids can’t tell time anymore! Aren’t they supposed to be taught in schools? What are they doing in schools? https://t.co/fYBnLY6gwL", "— Bethann (@sewwutnow) May 4, 2018", "Not unexpectedly, readers combined truncated headlines and conversations with what they already believed to be true: that students in 2018 are bereft of the most basic life skills, including knowing how to read the time from a standard clock face.", "Richmond, Virginia, television station WWBT was among several regional news affiliates repeating a somewhat inaccurate version of the story:", "Schools in Great Britain, which is home to Big Ben, are removing analog clocks from classrooms because the students can’t read what time the clocks say, according to a report in The Telegraph.", "Of course, another option would be to teach the students to read the clocks.", "[An] official told The Telegraph he hopes that happens.", "In that report at least one frequently-overlooked detail was present: that the information pertained to schools in the United Kingdom, not the United States. Like nearly all local versions of this story, WWBT referenced an April 2018 article from The Telegraph but omitted some key details present in the original report.", "According to the story's most notable early appearance, the topic of analog clocks in schools came up only in the context of a specific type of examination. A representative of an educators' association explained that for exams which were not unlike the United States' Scholastic Aptitude Test (SAT), teachers had grown weary of disruptions from students unsure about how much time remained in the testing session.", "Although the report began by saying that schools were \"removing analogue clocks from examination halls because teenagers are unable to tell the time,\" it explained that teachers (not students) ushered in the change due in part to disruptions:", "Teachers are now installing digital devices after pupils sitting their GCSE and A-level exams complained that they were struggling to read the correct time on an analogue clock.", "Malcolm Trobe, deputy general secretary at the Association of School and College Leaders (ASCL), said youngsters have become accustomed to using digital devices ... Mr Trobe, a former headmaster, said that teachers want their students to feel as relaxed as possible during exams. Having a traditional clock in the room could be a cause of unnecessary stress, he added.", "“You don’t want them to put their hand up to ask how much time is left,” he said.", "“Schools will inevitably be doing their best to make young children feel as relaxed as they can be. There is actually a big advantage in using digital clocks in exam rooms because it is much less easy to mistake a time on a digital clock when you are working against time.”", "Trobe did say that some students struggled to interpret time from standard clocks, but the observation was made entirely in the context of students' trying to estimate the time remaining (not necessarily trying to tell time in general) during high-stakes standardized examinations (not during ordinary classroom exams, tests, or quizzes). But social media users quickly abbreviated the claim made by one educator to suggest that multiple schools were filling dumpsters with analog clocks because modern students found them unreadable, while the more specific story was misrepresented in both local news reports and social media conversations.", "Turner, Camilla.   \"Schools Are Removing Analogue Clocks from Exam Halls as Teenagers 'Cannot Tell the Time.'\"\r\n    The Telegraph.   24 April 2018.", "Tynan, Brian.   \"Analog Clocks Removed from Schools Because Kids Can't Read Them.\"\r\n    WWBT-TV.   8 May 2018.", "WGN-TV.   \"British Schools Are Replacing Analog Clocks Because Students Can’t Read Them.\"\r\n    5 May 2018.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]