["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As Iran promised \"severe revenge\" after President Donald Trump announced that the United States had killed Iran’s top military commander in a drone strike on Jan. 3, the Pentagon said it would deploy 3,500 additional troops to the Middle East.", "Since then, an image of a long line of soldiers at an airport has been shared online by users offering their prayers. But in some cases, the photograph has been mischaracterized.", "The image in this Jan. 5 post, for example, includes this text: \"Off they go. Praying for each one and their families.\" It features crying emojis and a broken heart emoji and this hashtag: #sadday.", "The user who shared the photo wrote: \"This is a photo from JFK airport of our troops leaving to protect each one of us and our country.\"", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "First, as another Facebook post correctly noted, the image was taken in the Hartsfield-Jackson Atlanta International Airport. And Jennifer Ogunsola, a spokesperson there, told PolitiFact that it’s a typical sight around the holidays as soldiers return to basic training.", "Ben Garrett, a spokesman for the Army’s Maneuver Center of Excellence at Fort Benning in Georgia, said he wasn’t sure when the photo shared on Facebook was taken but said the soldiers in it are basic training soldiers either traveling home for the holidays or returning from \"holiday block leave.\"", "\"Most likely Ft. Benning,\" Garrett said, \"where they will continue their training.\"", "Because the soldiers are lined up under a sign that says \"North Domestic Baggage Claim\" and \"Ground Transportation,\" they appear to be returning from holiday block leave.", "Atlanta is the closest large airport, Garrett said, and soldiers depart a few days before Christmas and return through Atlanta a day or two after the New Year to complete their training.", "Garrett said he was confident the soldiers were traveling on holiday block leave because drill sergeants can be seen greeting them and marshalling them along the guide ropes.", "But that context isn’t always clear in the posts that have appeared on social media. One Facebook account, apparently frustrated with the misinformation, posted the image on Jan. 5 with this note: \"Stop sharing this photo saying soldiers leaving for Iran this is a photo of basic training soldiers returning from holiday leave. There is a drill sergeant directly in the middle.\"", "The Facebook post we’re checking here gives a different impression, and leads users to believe these soldiers are being deployed overseas. It also names the wrong airport.", "We rate it False.", "Facebook post, Jan. 5, 2020", "Facebook post, Jan. 5, 2020", "Facebook post, Jan. 4, 2020", "The Washington Post, Trump says Iranian military leader was killed by drone strike ‘to stop a war,’ warns Iran not to retaliate, Jan. 3, 2020", "Interview with Jennifer Ogunsola, national and international media, Hartsfield-Jackson Atlanta International Airport, Jan. 6, 2020", "Interview with Ben Garrett, chief of public affairs, U.S. Army Maneuver Center of Excellence, Jan. 6, 2020", "Interview with LTC Emanuel L. Ortiz, personnel team chief, Army Media Relations, Jan. 6, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]