["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A lawsuit filed Oct. 5 against Gov. Bruce Rauner by a former business associate has piqued the interest of those who follow Illinois politics.", "But the substance of the suit remains unknown because, in a highly unusual move, the complaint and three exhibits in the case filed in Cook County Circuit Court are sealed. The plaintiff’s attorney says he wants the records made public and says they’re under wraps at Rauner’s request.", "When asked about the lawsuit after a public appearance on Oct. 20, Rauner said he knew nothing about it.", "\"To be clear, all my investments are in a trust that I don’t control. I did that when I became governor,\" Rauner said. \"I can’t comment on any business disputes. That gets settled in its own process.\"", "This lawsuit is likely to draw more interest as it plays out, which makes this a good time to look into Rauner’s claim that he has no control over the business interests that predate his term as governor.", "Rauner’s vast wealth had been a point of contention in his 2014 campaign against incumbent Gov. Pat Quinn, who consistently tried to portray Rauner as economically out of touch with the vast majority of voters. After winning the election, Rauner sought to allay concerns that his extensive business portfolio -- which would generate $279 million in income in his first two years in office -- would make him vulnerable to conflicts of interest as governor.", "So shortly before his inauguration on Jan. 12, 2015, Rauner announced he was turning over control of his financial affairs to New York-based Roundtable Investment Partners and released a document detailing the \"blind trust commitments\" by which he would abide.", "\"To avoid even an appearance of a conflict of interest, I am designating an investment adviser under a power of attorney and establishing specific blind trust procedures during my service as governor to eliminate my day-to-day involvement in any company or issuer in which I hold any security interest or investment,\" Rauner said in the document. \"At all times during my service as governor, any information regarding the business and affairs of the issuer, including information on the financial performance of the issuer, or otherwise related to my status as a security holder in the Issuer, will go to the investment adviser and not to me.\"", "But while Rauner invoked \"blind trust procedures\" in his explanation, the business arrangement he entered into was a power of attorney, not a blind trust.", "The Chicago Tribune explained the difference in an article that appeared shortly before Rauner’s inauguration:", "What Rauner did instead (of creating a blind trust) was create a different, less rigorous structure known as a power of attorney that granted management authority over much of his wealth to a New York investment adviser….", "If Rauner had set up an actual blind trust, he would have had to transfer to it ownership of most of his wealth. Rauner would still have been the beneficiary of the trust, but he would have relinquished control over his assets to an independent trustee pledged to keep the governor in the dark about transactions.", "Rauner’s press secretary, Patty Schuh, said Rauner was speaking colloquially when he spoke of a \"trust\" rather than a \"power of attorney\" in his statement about the lawsuit.", "Even if Rauner had wanted to created a blind trust, however, a quirk in Illinois ethics law would have prevented it.", "Under Illinois law, state officeholders are required to file annual statements of economic interest in which they must list all their business interests in the state.", "In a blind trust like those used by federal officials, an officeholder turns over ownership of financial interests to a trustee who is prohibited from communicating with the official on investment matters. Such a setup would prevent Rauner from fulfilling the state economic disclosure requirements.", "Rauner’s then-press secretary Lance Trover explained the compromise arrangement to the Tribune:", "\"This is the strongest possible structure that both established blind trust procedures and allows the Rauners to fully comply with the state's economic disclosure laws moving forward,\" said Trover, who noted that blind trusts can be used to shield a politician's assets from public view. \"Doing this ensures to the people of Illinois that Gov. Rauner will not try to hide his financial assets behind a blind trust.\"", "The reporting aspect of Rauner’s setup is a key distinction between it and a blind trust. Because Illinois requires that he submit an annual summary of his economic interests, Rauner can’t legally blind himself to knowledge of his investments as would be required in a blind trust.", "\"If you still have to report it, it does defeat the purpose of a blind trust,\" said Larry Noble, senior director and general counsel of The Campaign Legal Center, a Washington, D.C., campaign ethics watchdog group.", "Noble believes voters would be better served if Illinois law didn’t favor mandatory disclosure over true blind trusts.", "\"If you know what assets are in there, even though you’re not calling the shots you still have a conflict,\" Noble said.", "There are two other significant differences between Rauner’s arrangement and a blind trust as defined by federal law.", "In a blind trust, there can be no relationship between the officeholder and the trustee. Rauner is an investor in Roundtable and its CEO, Geoffrey Boisi, donated $50,300 to Rauner’s 2014 campaign.", "Even though Rauner has pledged to leave all business activities to Roundtable, his pledge is not legally binding. There is no legal prohibition on his communicating with or receiving reports from Roundtable, and he retains the right to make investment decisions if he so chooses.", "That could be significant in relation to the current court case, Noble said, because it gives Rauner a convenient way to quickly dispel any controversy that develops over the alleged secrecy.", "\"He could say, ‘In the interest of disclosure I authorize my trustee to make it public,’ \" Noble said.", "Rauner said, \"To be clear, all my investments are in a trust that I don’t control.\" He was not being clear when he said his investments were held in trust.", "A quirk in Illinois ethics law means candidates can’t establish blind trusts like those used by federal officials, so Rauner’s investments are handled through a power of attorney granted to Roundtable Investment Partners. It’s not technically a \"trust,\" as Rauner called it, but if he is following his \"blind trust commitments\" pledge, the power of attorney arrangement appears to come as close as Illinois law permits.", "The power of attorney system he established doesn’t legally prohibit him from contact with Roundtable, however, so he’ll have a hard time hiding behind it if pressure mounts to make the substance of this month’s lawsuit public.", "Rauner’s statement is partially accurate but leaves out some important details. We find it Half True.", "How do 'blind trust' procedures announced by Rauner work?, Chicago Tribune, Jan. 22, 2015; accessed Oct. 20-23, 2017", "Governor-Elect Rauner’s Blind Trust Commitments, Jan. 9, 2015; accessed Oct. 20-23, 2017", "Harreld N. Kirkpatrick III v. Bruce Rauner, Cook County Circuit Court", "Gov. Bruce Rauner denies he made request to keep legal battle secret, Chicago Sun-Times, Oct. 20, 2017; accessed Oct. 20-24, 2017", "US ethics chief slams Trump ‘halfway blind’ trust as failing to meet acceptable standard, CNBC, Jan. 12, 2017; accessed Oct. 25, 2017", "Email/phone conversation, Henry Haupt, Illinois Secretary of State, Oct. 24, 2017", "Telephone interview, Larry Noble, senior director and general counsel, The Campaign Legal Center, Oct. 25, 2017", "Gov. Bruce Rauner Earned $91 Million in 2016, Tax Returns Show, Chicago Tonight, WTTW Chicago, Oct. 17, 2017; accessed Oct. 25, 2017", "Geoffrey Boisi donation search, Illinois Sunshine database, Illinois Campaign for Political Reform, Oct. 25, 2017", "Telephone/email interview, Patty Schuh, press secretary to Gov. Bruce Rauner, Oct. 25-26, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]