["About this rating", "On 21 September 2018, Dr. David Brill (an MD) released a campaign advertisement that took aim at Republican Dr. Paul Gosar (a dentist), the incumbent Republican representative whom Brill was challenging for a U.S. House seat representing Arizona's 4th congressional district.", "The advertisement, titled \"Paul Gosar Is Not Working for You,\" featured comments from several people -- identified by their first names and professions -- who were critical of Gosar's performance as a congressman, accusing him of failing his district on issues such as health care, jobs, social security, and the environment.", "All in all, the spot seemed like a fairly tame negative political campaign ad by modern standards, save for a catch revealed at the commercial's end -- all the people captured speaking out against Paul Gosar and endorsing his opponent were Gosar's siblings: Grace, David, Jennifer, Tim, Joan, and Gaston Gosar.", "The Gosar family's apparent willingness to take inter-family political disagreements to the public arena prompted many viewers to question if the people who appeared on-camera were really related to Gosar. They were.", "Paul Gosar confirmed as much on Twitter, reacting to the ad by calling his siblings \"disgruntled Hillary supporters\" who \"put political ideology before family.\" True to apparent take-no-prisoners Gosar family form, Gosar proclaimed \"Stalin would be proud\" of his \"leftist\" relatives:", "My siblings who chose to film ads against me are all liberal Democrats who hate President Trump. These disgruntled Hillary suppporters are related by blood to me but like leftists everywhere, they put political ideology before family. Stalin would be proud. #Az04 #MAGA2018", "— Paul Gosar (@DrPaulGosar) September 22, 2018", "Hinting at potential looming controversy during the upcoming holidays, he tweeted that he would see \"the six angry Democrat Gosars ... at Mom and Dad’s house!\":", "You can’t pick your family.  We all have crazy aunts and relatives etc and my family is no different. I hope they find peace in their hearts and let go all the hate.  To the six angry Democrat Gosars—see you at Mom and Dad’s house! #AZ04 #MAGA2018", "— Paul Gosar (@DrPaulGosar) September 22, 2018", "According to the New York Times, the Arizona legislator has a total of nine siblings, and the 85-year-old Gosar family matriarch was none too pleased with her children's public condemnation of their brother's political performance. Bernadette Gosar said she was \"shocked\" by the commercial and added, \"I share the same philosophy and policies that Paul does. He’s done a hell of a job for Arizona, and they love him.\"", "Zaveri, Mihir.   \"Six Siblings of a Republican Congressman Endorse His Opponent in Campaign Ads.\"\r\n    The New York Times.   22 September 2018.", "Osborne, Mark.   \"Congressman Paul Gosar's Siblings Support Opposing Candidate in Stunning Political Ad.\"\r\n    ABC News.   23 September 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]