["A video shared more than 4,000 times on Facebook and archived here shows a woman dressed in a nursing uniform claiming to have cured  Covid-19 patients using a combination of onions, ginger, garlic, lemon and hot water.", "“This is one COVID remedy,” reads the caption on the post, published on a page called Men and Women for Christ.", "The woman says in her introduction she is a nurse in an intensive care unit and is employed by Hanson Grey Agency, a recruitment firm in London. In the video, she demonstrates how to prepare the tonic.", "The woman claims the hot water in the mixture will “destroy Covid”, adding she had treated many patients with her concoction and achieved a 100 percent success rate.", "Hannah Ahmed, the managing director of Hanson Grey, told AFP Fact Check by email that the company is “aware of this video and are familiar with the nurse,” but did not provide any other details.", "“This steam is very hot. Therefore if there is any virus in your throat or in your nostril, then this will destroy it,” the woman says in the video.", "This claim is false. AFP Fact Check has previously debunked claims that steam inhalation could kill the virus.", "Dr Jason McKnight, assistant clinical professor in the department of primary care and population health at Texas A&M University, told AFP Fact Check in March 2020 that “the only way to ‘kill’ a virus is through antimicrobial cleaning solutions, which should NEVER be inhaled or introduced into the body in any way”.", "There is no evidence that the coronavirus can be killed with high heat “either inside or outside of your body”. The WHO has also denounced claims that the novel coronavirus will die at temperatures above 26 degrees Celsius.", "Multiple studies, including this one by the Spanish Paediatrics Association, have shown that steam inhalation therapy – one of the “cures” suggested by the woman in this video – can be dangerous and cause severe burns.", "Sylvie Briand, WHO director of global infectious hazard preparedness, said there is no evidence that garlic can cure Covid-19. Briand noted that garlic has health benefits but overconsumption can actually be detrimental to a person.", "The claim that boiled garlic cures Covid-19 emerged early on in the pandemic, which began in December 2019. Health professionals told AFP Fact Check as early as February 2020 that there is no evidence for its use as an effective treatment.", "“There is no scientific evidence to substantiate the claim that boiled water with garlic cures the novel coronavirus nor is there any proper medical research available on the subject,” Dr Wasim Khawaja of the Pakistani Institute of Medical Sciences told AFP Fact Check by phone on February 4, 2020.", "Onions have also appeared in many misleading posts as both a cure and a way to prevent Covid-19. Although onions are a good source of antioxidants and vitamins, the WHO does not classify them as a potential cure for the disease.", "Health professionals have also told AFP Fact Check that lemon and ginger do not cure Covid-19.", "Since the outbreak of the coronavirus, there have been many individuals, organisations and countries promoting one false cure or another.", "The president of Madagascar, for example, promoted a tonic cure for Covid-19 and supplied it to some African countries, without the backing of WHO-supported trials or approval procedures.  When the drink was introduced by President Andry Rajoelina, the country officially only had a handful of Covid-19 cases and no known deaths linked to the disease. But as of January 29, 2021, Madagascar has recorded more than 18,700 cases and 279 deaths, according to an AFP tally from official sources.", "Globally, there are several vaccines in use against Covid-19 and more than 170 candidates in development, according to the WHO. The organisation has endorsed the Pfizer/BioNTech vaccine for “emergency use”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]