["By Lori Robertson", "Posted on March 22, 2019", "Democratic lawmakers claim the president’s proposed 2020 budget would “ransack” or “slash” Medicare and Medicaid, likening it to an “assault on Medicare” and “the health care of seniors and families across America.” Experts agree the proposed cuts to Medicaid are significant, but many of the Medicare proposals echo those of Barack Obama and wouldn’t directly affect beneficiaries.", "President Donald Trump’s proposed 2020 budget includes a net $777 billion reduction in Medicaid spending and funding for the Affordable Care Act marketplace subsidies over 10 years, according to the Center on Budget and Policy Priorities, a left-leaning think tank. Those cuts would come from repealing the ACA, including the Medicaid expansion, and turning Medicaid into a block grant program. Several Democrats have misleadingly used a higher gross figure of $1.5 trillion in cuts.", "As for Medicare — a program politicians of both parties often highlight in lines of attack (see “A Campaign Full of Mediscare,” 2012) — those proposed spending reductions total a net $515 billion to $575 billion over 10 years, depending on how they’re measured, says the budget watchdog group the Committee for a Responsible Federal Budget. That’s 5 to 5.6 percent of projected Medicare spending over the next decade. Several Democrats have used a higher figure of $845 billion, but that includes two programs that the Trump administration proposes moving to other parts of the budget.", "Notably, several of the Medicare proposals in Trump’s budget are similar to cost-cutting measures Obama had espoused when he was president — some of which Republicans lambasted at the time. Readers of FactCheck.org may remember repeated claims from GOP lawmakers in years past that the Affordable Care Act would “cut” or “gut” Medicare by $500 billion or $716 billion “at the expense of the elderly.” Now, the shoe is on the other party’s foot, with Democrats claiming these spending growth reductions would harm Medicare.", "At least one of the Trump administration’s proposals — a change in out-of-pocket costs for Medicare Part D prescription drug coverage — would directly affect beneficiaries, causing some to pay less and others to pay more. And one lawmaker’s office argues that Trump’s proposed cuts, which include a repeal of the ACA, can’t be compared to many of Obama’s, because the cuts proposed by Obama were part of the ACA, resulting in an overall increase in health care spending and reduction in the uninsured.", "It’s important to note that a president’s budget proposal is more a symbolic statement of priorities than something Congress would vote on. Indeed, Congress passed — and Trump signed — a very different bipartisan two-year spending bill a few days prior to the White House releasing its FY 2019 budget proposal.", "Let’s take a look at what the president proposed.", "Democrats have pointed out that Trump, as a presidential candidate, said he would “save Medicare, Medicaid and Social Security without cuts,” and yet his budget proposal includes spending reductions to all three.", "“After exploding the deficit with his GOP tax scam for the rich, President Trump is once again trying to ransack Medicare, Medicaid and the health care of seniors and families across America,” House Speaker Nancy Pelosi said in a statement to the Associated Press.", "Senate Minority Leader Chuck Schumer said at a media availability on March 12: “The Trump budget calls for a $1.5 trillion cut in Medicaid, $850 billion cut in Medicare.” Schumer called it “hypocritical.”", "“President Trump: ‘I will not cut Medicare or Social Security.’ President Trump’s budget slashes it,” Schumer said.", "Sen. Richard Blumenthal called the budget an “assault on Medicare,” while Sen. Bernie Sanders asked Russell Vought, the acting director of the Office of Management and Budget, in a congressional hearing, “How many thousands of people do you think will die because of massive cuts to Medicare and Medicaid?”", "The Committee for a Responsible Federal Budget called similar Medicaid cuts proposed in Trump’s 2019 budget “substantial,” but the group said in a March 12 post that the claim that Medicare would be cut by $845 billion, and the implication that this is a significant cut to Medicare beneficiaries, is “largely false.” The true budget reduction figure is $515 billion or $575 billion over 10 years.", "The left-leaning CBPP agreed with that figure, putting the “net” amount at “nearly $600 billion.”", "Two programs in Medicare — payments to hospitals for uncompensated care (called Disproportionate Share Hospital payments) and for graduate medical education — would be moved to other parts of the budget, with “most” of that spending continuing, CRFB explained.", "The watchdog group estimated that 85 percent of the Medicare cuts “comes from reductions in provider payments – many of which closely resemble or build upon proposals made in President Obama’s budgets.”", "Paul N. Van de Water, a senior fellow at the Center on Budget and Policy Priorities, said CRFB’s characterizations of some Trump policies mimicking those of Obama were “generally correct.”", "Proposals to reduce post-acute care payments ($110 billion reduction over 10 years) and to cut payments for bad debt ($40 billion) are similar to Obama policies, CRFB said. In fact, Obama’s fiscal 2017 budget included nearly $100 billion in reduced post-acute care payments.", "The Trump budget’s proposal to “equalize site-of-service payments,” meaning pay the same for outpatient services whether in a doctor’s offices or other facilities ($160 billion), and to change graduate medical education payments ($50 billion) are expansions of Obama proposals, CRFB said. Van de Water noted in a post on CBPP’s website that the site-of-service measure was similar to one from the Medicare Payment Advisory Commission, an independent congressional entity that advises Congress.", "“The proposals are similar to those in last year’s [fiscal 2019] budget,” Van de Water told us in an email. “Except for the proposed changes in the Medicare prescription drug benefit, and perhaps the medical liability reform, the proposals would not directly affect beneficiaries.”", "Both of the budget groups were critical of Trump’s overall budget, with CRFB writing it was “riddled with gimmicks and unrealistic assumptions” and CBPP calling it “a disturbing vision” that would “make poverty more widespread, widen inequality and racial disparities, and increase the ranks of the uninsured.” CBPP, however, didn’t mention Medicare in that assessment.", "Tricia Neuman, senior vice president of the Kaiser Family Foundation and director of its Medicare policy program, also agreed that many of Trump’s Medicare spending proposals were similar to his predecessor’s: “In a sense, yes, they are similar in that they generally aim to lower the growth in Medicare spending by reducing payments to providers, though the specific proposals differ,” she said in an email.", "One proposal that would directly affect beneficiaries is a change to out-of-pocket spending in Medicare Part D ($65 billion over 10 years).", "Van de Water explained in a post on the CBPP website: “The proposed changes in the Medicare Part D drug benefit would reduce out-of-pocket costs for some beneficiaries, including those with the highest spending, while raising costs for others. The budget would limit beneficiaries’ annual out-of-pocket drug spending and eliminate cost sharing on generic drugs for recipients of Medicare’s low-income drug subsidy (LIS), which could improve LIS recipients’ access to care and promote medication adherence. At the same time, the budget would raise Part D premiums and charge more to beneficiaries whose drug spending is high but below the threshold at which catastrophic coverage kicks in.”", "Neuman too, said: “When it comes to out-of-pocket spending on drug costs, the Administration’s budget is a double-edged sword; it helps some, but increases costs for others.” She said most of the proposals in the budget “would reduce the growth in spending for hospitals and other health care providers, without directly affecting beneficiaries,” though it was “very hard to predict” precisely how the proposals would affect seniors.", "For comparison, Obama’s fiscal 2017 budget included $401 billion in Medicare spending reductions over 10 years, but it called for a $39 billion increase in Medicaid spending, according to CRFB’s breakdown.", "Henry V. Connelly, deputy communications director for Speaker Pelosi, told us that Medicare advocacy groups had “concluded [Trump’s] cuts would indeed hurt Medicare beneficiaries.” He pointed to a joint statement from the Center for Medicare Advocacy and the Medicare Rights Center: “Among other things, the administration’s proposal would curtail Medicare beneficiaries’ appeal rights and increase the amount many would pay for needed prescriptions,” the groups said. “It would also jeopardize beneficiary access to critical services by significantly cutting provider payments.”", "Schumer’s office told us that while Obama’s proposed budgets also called for cutting provider payments, that was in the context of the ACA and an overall expansion of health care coverage. “The Trump Administration’s proposed reductions in Medicare spending aren’t being reinvested into health care programs,” Schumer’s office said.", "The ACA included a $716 billion reduction in the future growth of Medicare spending over 10 years, according to a 2012 assessment by the Congressional Budget Office, with most of that ($415 billion) in reductions in the growth of payments to hospitals. Schumer’s office said “providers supported the ACA because they were able to now treat a significant influx of newly insured patients instead of providing uncompensated care.”", "There’s support for that. Chip Kahn, president and chief executive officer of the Federation of American Hospitals, criticized Trump’s budget for including “arbitrary and blunt Medicare cuts to hospitals who care for the nation’s most vulnerable,” saying it was “no time to gut Medicare.”", "But in March 2010, when Congress was debating the ACA, Kahn said in a letter to then-Sen. Harry Reid that the legislation would expand coverage to millions of Americans and provide “a framework for health care delivery reform.” He wrote: “That is why hospitals will forgo $155 billion in Medicare and Medicaid payments over 10 years as part of a shared sacrifice to bring about the benefits that health reform will deliver to all Americans.”", "So, the FAH supported cuts to the growth of hospital payments as a trade-off for a reduction in the uninsured.", "It’s true that Trump’s proposed budget doesn’t offer that. Instead, it would reduce Medicaid spending and eliminate the ACA premium subsidies for a net $777 billion reduction over a decade. Together with proposed reductions in Medicare spending, that comes to about $1.35 trillion less in future Medicare and Medicaid spending.", "But lumping them together also glosses over the fact that several of the administration’s Medicare proposals bear some resemblance to measures Democrats once supported and Republicans criticized.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]