["About this rating", "On Nov. 19, 2020, former Republican U.S. presidential candidate and Texas congressman Ron Paul posted a video on social media that compared a handful of states' COVID-19 cases over time and alleged no significant differences between states with government-sponsored mask mandates and those without such rules.", "As a result, the video claimed in a caption, \"masks don't work\" to curb the spread of the deadly virus.", "Paul posted the roughly two-minute clip to his official channels including Twitter, Facebook, YouTube, and Parler (displayed below and viewed more than 1.8 million times on that site). It was an edited segment of a recorded discussion via Paul's self-run media project, the Ron Paul Liberty Report, that attempted to discredit government-initiated business shutdowns during the pandemic and misconstrued a research project in Denmark about the effectiveness of masks, among other things.", "In the short clip on social media, Paul and co-host Daniel McAdams, a former congressional adviser to Paul, presented the below-displayed chart to supposedly show COVID-19 cases per 1 million residents in Texas, California, Florida, and Georgia based on data from The COVID Tracking Project as of November.", "They framed the data visualization as evidence that case totals in California and Texas, which had mask mandates, were about the same as those in Georgia and Florida without such regulations. (See California's mandatory mask guidance here and Texas' here.)", "\"It's really incredible how they completely ignore the science,\" McAdams said, without explaining to whom exactly he was referencing. \"Texas, masks — high; Florida, no masks — the same; California, masks — about the same; Georgia, no masks — about the same. The trajectory is about the same for all four states, regardless of whether you wear a mask or not a mask.\"", "Next, the video showed charts allegedly depicting COVID-19 cases per 1 million people in France, as well as in Minnesota and Florida, to make the same point: No data allegedly showed government-issued mask mandates helped residents avoid catching the virus, and, because of that, mandatory face coverings were unnecessary during the pandemic.", "For the purpose of this fact check, we focused on that underlying claim about mask-wearing — not the validity of the data visualizations, nor the numbers they used. Twitter users created at least two charts featured in the video (original posts here and here).", "We recommend checking the websites of your local health department, the Centers for Disease Control and Prevention (CDC), Johns Hopkins, and The COVID Tracking Project to see how the virus spread over time.", "For example, the Tracking Project, to which government officials and health systems refer for COVID-19 response plans, showed the below-displayed seven-day average of new cases per day between April 1 and Nov. 21.", "Georgia (no mandatory mask mandate) showed roughly 2,500 new cases each day, as of this report.", "Florida (no mandatory mask mandate) tallied approximately 7,900 new cases each day, as of this report.", "Texas (mandatory mask mandate) documented roughly 10,500 new cases each day, as of this report.", "California (mandatory mask mandate) recorded roughly 11,800 new cases each day, as of this report.", "So while it was accurate to claim all four states were experiencing a surge in new COVID-19 cases — ranging between roughly 2,500 and 11,800 new cases daily — it was a false interpretation of that data to consider new cases solely the result of statewide mask mandates.", "That argument did not consider states' differing health care systems or demographics — as well as if, or to what extent, residents were wearing masks voluntarily in states without mandates or disobeying the statewide requirements in California and Texas. All rules by state or local officials to prevent the spread of COVID-19 meant nothing without people following them.", "Before we proceed, let’s be clear about how COVID-19 — which is the disease caused by the coronavirus dubbed SARS-CoV-2 — attacks the body. SARS-CoV-2 attacks lung cells, and that assault on a person’s respiratory system can greatly exacerbate other preexisting conditions. Per the CDC, here's why public health officials recommended people wear masks (in addition to social distancing and taking other precautions) to avoid that from happening:", "COVID-19 spreads mainly from person to person through respiratory droplets. Respiratory droplets travel into the air when you cough, sneeze, talk, shout, or sing. These droplets can then land in the mouths or noses of people who are near you or they may breathe these droplets in.", "Masks are a simple barrier to help prevent your respiratory droplets from reaching others. Studies show that masks reduce the spray of droplets when worn over the nose and mouth.", "You should wear a mask, even if you do not feel sick. This is because several studies have found that people with COVID-19 who never develop symptoms (asymptomatic) and those who are not yet showing symptoms (pre-symptomatic) can still spread the virus to other people. The main function of wearing a mask is to protect those around you, in case you are infected but not showing symptoms.", "In other words, when people wear facial coverings, even if they are cloth, they are exposed to a lower dose of droplets containing the virus, which research shows may prevent them from getting really sick. Additionally, mask-wearers are curbing the transmission of the virus if they're COVID-19 positive and don't know it.", "With that scientific evidence in mind, states and local jurisdictions over months adopted mask mandates — sources of the alleged controversy in the Paul video. Those guidelines, coupled with rules on in-person gatherings, polarized Americans into groups who considered masks and temporary business shutdowns necessary to save lives, and those who believed government officials were exercising too much power, or infringing on people's rights, by telling them what to wear and how to live.", "Scientists' body of research exploring the effects of such policies were preliminary, as of this report. For example, one study by the CDC and the Kansas Department of Health compared transmission rates in counties with mask mandates and those in counties without such guidelines, and concluded the following:", "\"[The] 7-day rolling average COVID-19 incidence had decreased by 6% to 16 cases per 100,000 among mandated counties and increased by 100% to 12 per 100,000 among nonmandated counties.\"", "Nonetheless, that research showing mask guidelines seemingly did their job was just one county-by-county analysis in one state. Scientists cautioned people from taking one or a few studies out of context to make any conclusive arguments about COVID-19.", "In sum, it was inaccurate to claim \"masks don't work\" to fight the pandemic, based on scientific evidence, and it was a false interpretation of state-by-state data to claim COVID-19 case trends are only a result of state leaders' stance on mandatory masks.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]