["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Rick Scott used his visit to an assisted living facility in Tampa to create a campaign video to bash President Barack Obama over potential cuts to Medicare Advantage.", "Scott’s Republican Party of Florida goes a step further by portraying his likely Democratic opponent, former Gov. Charlie Crist, as an Obama supporter.", "\"I stand against Charlie Crist because he supports President Obama and the cuts to the Medicare Advantage program,\" said the Republican Party of Florida on Facebook April 1. They repeated the claim again on Twitter on April 9.", "It’s a fact that Crist supports Obama -- and the Affordable Care Act. (We traced Crist’s various positions on the law in 2010.) But does Crist support cuts to Medicare Advantage?", "Background on Medicare Advantage", "In Florida, about 1.4 million seniors are on Medicare Advantage while roughly 4.4 million are in traditional Medicare.", "The health care law tries to bring down future health care costs of Medicare largely by reducing Medicare Advantage, a subset of Medicare plans that are run by private insurers. The hope was that the increased competition from the private sector would reduce costs. But those plans are actually costlier than traditional Medicare. So the health care law reduces payments to private insurers.", "Advantage plans are required to offer basic health benefits that are at least as rich as original Medicare. But many offer extras, such as rebates on premiums, routine dental care, gym memberships and rides to the doctor, in order to compete for business.", "When the Affordable Care Act became law in 2010, one of the attempts to pay for subsidized health insurance was to cut payments to the Medicare Advantage program to bring costs more in line with traditional Medicare. The Congressional Budget Office has predicted these cuts would save the government about $156 billion over a decade.", "What Crist has said about cutting Medicare Advantage", "We searched for statements Crist made about Medicare Advantage starting in 2009 when he was Florida’s Republican governor. We found Crist has actually opposed changes to Medicare Advantage over the years.", "In December 2009, Crist released a statement in support of an amendment by Sen. John McCain, R-Ariz., to protect Medicare and Medicare Advantage. As you’ll see from his rhetoric, Crist opposed the health care law back then:", "\"Cuts to Medicare would adversely affect Florida’s seniors who have paid into the program and rely on its services for their important health needs. ... Many of Florida’s seniors rely on Medicare Advantage for supplemental or increased benefit options. Stripping away a needed benefit from our seniors in order to move toward a single-payer system where bureaucrats are inserted between doctors and their patients is not the health reform Americans deserve.\"", "In July 2010 -- after he became an independent while running for U.S. Senate -- Crist released another statement about his position on the health care bill. Here is a portion:", "\"Had I been in the United States Senate at the time, I would have voted against the bill because of unacceptable provisions like the cuts to the Medicare Advantage program. But being an independent, I have the freedom to be an honest broker for the people of Florida without regard for political party, and the reality is this: despite its serious flaws, the Obama health care bill does have some positive aspects. Repeal must be accompanied by a responsible substitute.....\"", "In August 2010, he made a similar statement in which he said if he had been a senator, \"I would have voted against the bill because of unacceptable provisions like the cuts to the Medicare Advantage program.\" Again he called for a \"responsible substitute.\"", "Miami Herald politics reporter Marc Caputo wrote a column about Crist’s \"Obamacare conundrum\" in March 2014. Caputo quoted a statement by Crist:", "\"I don’t support the cuts to Medicare Advantage. In every major law, there are things you like and things you don’t. The president and Congress should fix it.\"", "It’s not an unusual position to support the law and yet speak against changes for Medicare Advantage. In an election year, dozens of Democratic members of the House or Senate have spoken against Medicare Advantage rate reductions.", "At the time of RPOF’s claim, Medicare Advantage cuts were still on the table -- so we will limit our rating to information available at the time. However, we will note that after the federal government’s announcement that it would not reduce payments to Medicare Advantage, Crist tweeted on April 7: \"Great to learn that @BarackObama is reversing cuts to Medicare Advantage. This is great news for Florida seniors.\"", "So what evidence does the Republican Party of Florida have that Crist supports the cuts?", "\"If he supports the law, he supports all of it,\" including Medicare Advantage cuts, RPOF spokeswoman Susan Hepworth told PolitiFact Florida in an email.", "One final footnote about Crist and Medicare Advantage. The federal government is depending on savings from Medicare Advantage to offset the costs of the Affordable Care Act. So we asked the Crist campaign, if Crist is against the Medicare Advantage cuts, what would he recommend to achieve the needed savings?", "We did not hear any specific solutions from Crist campaign spokesman Kevin Cate.", "\"It’s the responsibility of the president and Congress to fix any cuts to Medicare Advantage,\" Cate said.", "Our ruling", "The Republican Party of Florida said Crist supports \"cuts to the Medicare Advantage program.\"", "Crist has flip-flopped on a lot of issues, including the federal health care law. He used to oppose the Affordable Care Act, but now he supports it. The law tries to bring down future health care costs by reducing Medicare Advantage payments.", "But on the issue of Medicare Advantage, Crist has actually been consistent: He's been critical of the Medicare Advantage cuts for years. He specifically said he opposed the reductions in 2009 and 2010, and he still opposes them today.", "Crist doesn’t appear to have come up with other ways to save money on health care without reducing payments to Medicare Advantage. But our purpose here is to fact-check the claim that he supports the cuts, and we found no proof that he does. We rate this claim False.", "Republican Party of Florida, Facebook, April 1, 2014", "Republican Party of Florida, \"6 numbers you need to know about Medicare Advantage cuts,\" March 13, 2014", "Gov. Rick Scott campaign website video, \"Medicare Advantage cuts are threat to all of us,\" March 25, 2014", "Congressional Budget Office, Letter to House Speaker John Boehner about cost of repeal of Affordable Care Act, July 24, 2012", "Tampa Bay Times The Buzz blog, \"Rubio, Crist sound off on health care, jobs,\" Dec. 3, 2009", "Miami Herald, \"Charlie  Crist’s Obamacare conundrum,\" March 16, 2014", "Miami Herald Naked Politics blog, \"Charlie Crist’s flip flop #563? ‘I would have voted’ for health care bill,\" Aug. 27, 2010", "Washington Post Wonkblog, \"Obama administration reverses proposed cuts to Medicare plans,\" April 7, 2014", "The Hill, \"Obama’s new health care dilemma,\" April 6, 2014", "PolitiFact, \"Marco Rubio says Charlie Crist has taken ‘six different positions’ on the health care law,\" Sept. 2, 2010", "PolitiFact, \"Paul Ryan said President Obama ‘funneled’ $716 billion out of Medicare ‘at the expense of the elderly,’\" Aug. 29, 2012", "PolitiFact, \"Rick Scott says Medicare rate cuts will affect seniors ability to keep their doctor,hospital, prevention services,\" March 3, 2014", "PolitiFact, \"Rick Scott ad attacks Charlie Crist on Obamacare,\" March 25, 2014", "Interview, Kevin Cate, spokesman Charlie Crist campaign, April 7, 2014", "Interview, Susan Hepworth, spokeswoman Republican Party of Florida, April 7, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]