["By Angelo Fichera", "Posted on December 3, 2020", "An economics professor’s flawed interpretation of U.S. mortality data has prompted a viral, false claim that COVID-19 hasn’t led to more deaths than normal this year. In fact, multiple analyses have found there to be a higher-than-normal number of deaths during the pandemic — as much as 20%, according to some studies.", "Viral headlines and social media posts are propelling the erroneous claim that there have been “no excess deaths” in the U.S. this year, suggesting that concern over COVID-19 is overblown.", "That’s wrong.", "As we’ve previously explained, excess deaths are deaths above the number expected in a given time period. The metric in the context of COVID-19 can help assess the impact of the pandemic, including by capturing direct and indirect effects of the virus. It can account for unreported COVID-19 deaths and for other factors — such as people dying from other causes, say avoiding medical attention, as well as drops in other deaths due to pandemic-related restrictions.", "The Centers for Disease Control and Prevention in October published a report that found that from late January through Oct. 3, there were an estimated 299,028 excess deaths. Two-thirds were estimated to be directly attributed to COVID-19.", "The COVID-19 death toll has surpassed 275,000, as of Dec. 3, according to Johns Hopkins University data. Cases are rising around the country, and projections anticipate that the death count will climb past 300,000 by the end of the year.", "The viral claim about “no excess deaths” — which has been amplified by unreliable websites and disseminated on Facebook and Twitter — stems from an online presentation by an economics lecturer at Johns Hopkins. But it’s flawed for multiple reasons, experts say.", "In a Nov. 13 webinar, Genevieve Briand, the assistant director for the university’s Applied Economics master’s program, looked at select CDC data, such as weekly reported deaths, to reach the faulty conclusion that there is “no evidence that COVID-19 create[d] any excess deaths.”", "“Total death number are not above normal death numbers,” she claims. “We found no evidence to the contrary.”", "Her claims were then relayed in a story in the Johns Hopkins News-Letter, a student-run publication, which said the analysis showed COVID-19 “has relatively no effect on deaths in the United States.” The publication later retracted the report. An archived version of the story, however, has been shared on Facebook 10,000 times according to CrowdTangle analytics data.", "The student publication’s retraction also became part of the false narrative online, triggering claims that the university had published a “study” then retracted it. “Johns Hopkins Study Mysteriously Disappears after it Revealed, In Spite of COVID, No More Deaths in 2020 Than In Prior Years,” read the false headline on the Gateway Pundit, a far-right website known for spreading misinformation.", "Briand, however, confirmed in an email to us that she had not published her analysis anywhere apart from the webinar. The video is still available on YouTube, where it’s been viewed more than 58,000 times. Briand told us she stood by her analysis.", "But Dr. Steven Woolf, a professor in the Department of Family Medicine and Population Health at the Virginia Commonwealth University, told us that “multiple studies have shown that total deaths in the US are about 20% higher than expected.”", "Woolf and colleagues relayed as much in an article published in the Journal of the American Medical Association in October. “Although total US death counts are remarkably consistent from year to year, US deaths increased by 20% during March-July 2020,” the authors wrote.", "Studies from others, including a paper by two University of Oxford economists, have reached similar conclusions.", "Woolf said in an email that the lecture video instead presented a “very unsophisticated analysis, in which the speaker uses crude death counts for one year (2018) as the basis for comparison and performs simple subtraction from 2020 values for her assertions. Any reputable analysis of excess deaths is based on statistical modeling that computes seasonal averages over a period of many years, and this is done to adjust for random variation from year to year.”", "“For example, our studies use Poisson regression modeling. Statistical modeling is necessary to know whether differences in death counts are statistically significant,” he said. “The speaker admits to merely eyeballing the trend lines for 2020. Researchers prefer to use statistical modeling to know whether a supposed change in counts is random variation or a statistically significant trend.”", "The CDC’s National Center for Health Statistics excess death analysis (which uses such modeling) has found deaths above normal rates week after week since the end of March — as readers can see in the center’s chart below.", "Briand’s video doesn’t consider that analysis or any other previous studies on the issue.", "Instead, she looks at some public CDC data and, in part, homes in on a spike in deaths in spring 2020, observing that it does not correspond with an increase in all deaths — such as heart disease, chronic lower respiratory disease, influenza and pneumonia — as was the case during a spike in deaths in early January 2018.", "“Our death number increased in 2020 and we have less heart attack than in 2018,” she said. “Where have all the heart attacks gone?”", "But she’s misleadingly comparing different points in time for the two years.", "Bob Anderson, chief of NCHS’ Mortality Statistics Branch, said in an email statement that the video’s claims are born out of “a fundamental lack of understanding of the seasonal nature of mortality.”", "While deaths typically increase in the winter, peaking around the New Year, “[d]eaths then decline in the spring through the summer and then increase again in the fall through the winter,” Anderson said. “But, what we are seeing in 2020 with the COVID-19 pandemic is very different. In the spring of 2020, during a period where we normally should be seeing declining mortality, deaths continued to increase and were at unusually high levels through the spring.”", "The comparison of the two time periods used in the video is “not appropriate,” he said.", "Anderson added that in 2018, “deaths followed the normal pattern (although at a higher level than normal). In 2020, deaths did not follow the normal pattern … they should have been declining in the spring, but instead increased substantially. In addition, we have an additional peak in deaths in late July/early August that seems to have been completely ignored in this analysis.”", "“With regard to heart disease, it is true that heart disease deaths did not increase in April 2020 to the same extent that they did in January 2018,” he said. “But, in January, heart disease deaths are normally at a peak. In April, heart disease deaths are normally on the decline. Even so, the number of heart disease deaths has been largely above normal throughout the pandemic. The same is true for other causes of death, especially diabetes, hypertension, and dementia.”", "So far this year, through the week ending Nov. 21, there have been 598,659 reported heart disease deaths in the U.S. — according to incomplete, provisional death count data published by the CDC on Dec. 3. In all of 2018, there were 655,381 deaths from heart disease.", "In response to an inquiry about Briand’s claims, Johns Hopkins University spokeswoman Karen Lancaster said in a statement that “[w]hen individuals associated with Johns Hopkins exercise the right of expression, they do not speak on behalf of the institution.”", "“As set forth in the Johns Hopkins University Statement of Principles on Academic Freedom, academic freedom ‘is designed to afford members of the community the broadest possible scope for unencumbered expression, investigation, analysis, and discourse,’ all of which must be subject to the scrutiny of peer review,” she said.", "Lancaster added: “Johns Hopkins University continues to have grave concerns regarding the extraordinary toll of death and illness wrought by COVID-19 and remains committed to contributing our expertise in responding to this continuously escalating global health crisis.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Anderson, Bob. Chief, Mortality Statistics Branch, National Center for Health Statistics, U.S. Centers for Disease Control and Prevention. Email statement to FactCheck.org. 2 Dec 2020.", "Aron, Janine and John Muellbauer. “The US excess mortality rate from COVID-19 is substantially worse than Europe’s.” VoxEU.org. 29 Sep 2020.", "Briand, Genevieve. Senior lecturer in Applied Economics, Johns Hopkins University. Email to FactCheck.org. 2 Dec 2020.", "“COVID-19 Forecasts: Deaths.” U.S. Centers for Disease Control and Prevention. Accessed 3 Dec 2020.", "“Daily Updates of Totals by Week and State | Provisional Death Counts for Coronavirus Disease 2019 (COVID-19).” U.S. Centers for Disease Control and Prevention. Accessed 1 Dec 2020.", "Gu, Yanni. “A closer look at U.S. deaths due to COVID-19.” Johns Hopkins News-Letter. 27 Nov 2020.", "Lancaster, Karen. Assistant Vice President of External Relations, Johns Hopkins University. Email to FactCheck.org. 3 Dec 2020.", "McDonald, Jessica. “Trump Touts Misleading and Flawed Excess Mortality Statistic.” FactCheck.org. 24 Aug 2020.", "“Weekly Counts of Deaths by State and Select Causes, 2019-2020.” U.S. Centers for Disease Control and Prevention. Accessed 2 Dec 2020.", "Woolf, Steven. Professor, Department of Family Medicine and Population Health, Virginia Commonwealth University. Email to FactCheck.org. 2 Dec 2020.", "Woolf, Steven, et al. “Excess Deaths From COVID-19 and Other Causes, March-July 2020.” Research letter. JAMA. 12 Oct 2020.", "Xu, Jiaquan, et al. “Mortality in the United States, 2018.” National Center for Health Statistics, U.S. Centers for Disease Control and Prevention. January 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]