["About this rating", "Kavanaugh himself wrote in 2003  that \"I have not been a trial lawyer,\" and by his own admission had never tried a case from start to finish; rather, he contributed legal analysis and argument as part of a team or with respect to individual components of larger cases.", "Kavanaugh was not promoted directly from law clerk to federal judge. His last clerkship was in 1994, nine years before Bush nominated him to the D.C. Circuit. In the intervening years, Kavanaugh accumulated legal experience of various kinds, including working in the White House and on high-profile cases such as Ken Starr's Clinton investigations and the 2000 Florida recount controversy.", "In the autumn of 2018, President Donald Trump's nomination of Judge Brett Kavanaugh to serve on the U.S. Supreme Court dominated news cycles after three women publicly accused him of sexual assault or sexual misconduct during his high school and college years.", "Those women, in particular Kavanaugh's principal accuser Dr. Christine Blasey Ford, faced a torrent of personal attacks and malicious misinformation, but Judge Kavanaugh himself also came in for criticism, largely in relation to his historical consumption of alcohol and his personality, but also on the basis of his past pronouncements and suitability for a federal judgeship.", "On 2 October, the anti-Trump, pro-labor union Facebook page \"Union Thugs\" posted a meme which alleged that Kavanaugh, prior to his appointment as a federal judge in 2006, was desperately lacking in trial experience and had been promoted directly from the position of law clerk to a seat on the federal bench:", "How many of us knew Kavanaugh had never tried a case in a regular court? He was a law clerk promoted to a Judge by Bush.", "This claim has two components. The first part, that Kavanaugh was promoted directly from law clerk to federal judge, leaves out significant portions of Kavanaugh's background and professional history. The second part, that Kavanaugh had never tried a case before being nominated for a judgeship in 2003, is mostly accurate.", "In June 2006, Kavanaugh was sworn in as a judge on the U.S. Court of Appeals for the District of Columbia Circuit, commonly known as the \"DC Circuit.\" In welcoming him into the role, then-President George W. Bush said:", "Over his career, he's argued cases before the Supreme Court, appellate courts, and trial courts. He has given his time and talent to provide legal services for those in need. He's earned a reputation for integrity and independence. Brett's abilities and professionalism have been recognized by members of both political parties. After I nominated Brett, a bipartisan group of his law school classmates wrote a letter of support saying Brett would bring credit to the distinguished court to which he has been nominated ...", "In the history of the DC Circuit, no judge has undergone a more thorough and rigorous confirmation process. And all who watched this process saw what I know: that he's a man of fairness, humility, and a reverence for the laws and the Constitution of our country.", "A few days earlier, the U.S. Senate had voted 57-36 to confirm Kavanaugh to the position, with 53 Republicans and four Democrats supporting his nomination, 35 Democrats and one Independent opposing it, and seven senators not voting.", "Opponents of Kavanaugh's confirmation had highlighted his alleged lack of experience and close ties to Bush, with the late Democratic icon Ted Kennedy saying, in a Senate debate:", "Unlike most of the members of the DC Circuit, Brett Kavanaugh is not a judge, an experienced litigator, or a legal scholar. Far from it. Mr. Kavanaugh is a political operative, a man whose ambition has placed him at the center of some of the most politically divisive events in recent memory. He is not qualified for this position. If his nomination is approved, I can say with confidence that Mr. Kavanaugh would be the youngest, least experienced and most partisan appointee to the court in decades.", "Mr. Kavanaugh blatantly lacks the broad legal experience that is the hallmark of federal judges -- particularly those at the highest levels. He has never tried a case to verdict or to judgment. In fact, Mr. Kavanaugh has only practiced law for ten years. Even counting his time as a law clerk, he still has only half of the average legal experience of nominees to the DC Circuit. To put this in context, Mr. Kavanaugh would be the least experienced member of the DC Circuit in almost a quarter century.", "His lack of experience is underscored by his responses to questions from [Senate] Judiciary Committee members. When he was asked to name his 10 most significant cases, Mr. Kavanaugh could only cite five cases for which he actually appeared in court, and only two cases in which he was lead counsel. He even cited two cases for which he merely wrote a friend-of-the-court brief for someone who was not a party to the lawsuit.", "In referring to Kavanaugh's role in \"some of the most politically divisive events in recent memory,\" Kennedy almost certainly meant the 2000 Florida recount and Independent Counsel Ken Starr's investigation into the Whitewater scandal, which expanded to cover President Bill Clinton's affair with former White House intern Monica Lewinsky and ultimately yielded grounds for the unsuccessful impeachment of Clinton.", "In the mid-1990s, Kavanaugh took part in the Clinton investigations led by Starr, for whom he had worked in 1992 and 1993 when Starr was U.S. Solicitor General. In 1999, the New York Times described Kavanaugh as having been one of \"the most important lawyers on the Lewinsky inquiry.\"", "During this period, Kavanaugh controversially re-investigated the death of Vince Foster, Clinton's White House Counsel, despite the fact that several official investigations had already concluded that Foster shot himself to death in 1993. (Since it took place, Foster's death has become the subject of rampant conspiracy theories implicating Bill and Hillary Clinton, about which more can be read here.)", "Furthermore, Kavanaugh was involved in writing up parts of the second half of Starr's eventual report to Congress, which outlined the grounds for Clinton's impeachment. Kavanaugh later expressed regret that Congress had decided to publish the entire report, which included intimate details of Clinton and Lewinsky's sexual relationship, without reviewing it in advance.", "In late 2000, Kavanaugh joined the legal team of then-Texas governor George W. Bush as the contested results of the presidential election in Florida went before the U.S. Supreme Court.", "'A law clerk promoted to a judge'", "Before his confirmation as a judge on the DC Circuit in 2006, Kavanaugh had the following experience (in reverse chronological order):", "Bush first nominated Kavanaugh to the DC Circuit in February 2003, but concerns over Kavanaugh's relative lack of experience and partisanship triggered a protracted filibuster by Congressional Democrats.", "In 2003, an American Bar Association (ABA) committee gave Kavanaugh its highest rating of \"well qualified\" for a position on the DC Circuit. However, the committee re-evaluated him in 2005 and 2006 and, on the latter occasion, downgraded their rating to \"qualified.\"", "As the ABA explained, a rating of \"qualified\" still means that \"The nominee meets the Committee’s very high standards with respect to integrity, professional competence and judicial temperament and that the Committee believes that the nominee will be able to perform satisfactorily all of the duties and responsibilities required by the high office of a federal judge.\"", "In 2006, the ABA committee, which is responsible for evaluating federal judicial candidates, wrote that Kavanaugh \"enjoys a solid reputation for integrity, intellectual capacity, and writing and analytical ability\" and a majority of the committee's 15 members rated him \"qualified,\" with a minority rating him \"well qualified\" and none of them deeming him \"not qualified.\"", "However, the committee outlined two major reasons why they had downgraded their endorsement of Kavanaugh between 2003 and 2006 -- increased concerns over his putative lack of experience as a lawyer, and new concerns over his judicial temperament, in particular his ability to remain impartial as a judge:", "From the outset in 2003, even with an earlier rating of “Well Qualified” for this nominee, there were considerations arising from confidential interviews and other background information that act to explain the thread of “Qualified” running through the Standing Committee evaluations. The 2003 confidential record makes it clear that there were then-present concerns regarding this nominee’s breadth of professional experience.", "It was noted that he had never tried a case to verdict or judgment; that his litigation experience over the years was always in the company of senior counsel; and that he had very little experience with criminal cases. Indeed, it is the circumstance of courtroom experience that fills the transcripts that make the record before the Court of Appeals, and concerns were expressed about the nominee’s insight into that very process. Nonetheless, a substantial majority saw other overriding factors that supported a rating of “Well Qualified.”", "The additional interviews conducted in 2006 expanded upon those earlier concerns. One judge who witnessed the nominee’s oral presentation in court commented that the nominee was “less than adequate” before the court, had been “sanctimonious,” and demonstrated “experience on the level of an associate.”A lawyer who had observed him during a different court proceeding stated: “Mr. Kavanaugh did not handle the case well as an advocate and dissembled.” Other lawyers expressed similar concerns, repeating in substance that the nominee was young and inexperienced in the practice of law.", "Further, the 2006 interviews raised a new concern involving his potential for judicial temperament. Unlike the earlier 2003 final report and 2005 updated report, the recent supplemental evaluation contained comments from several interviewees with more recent experience with the nominee, which caused them to characterize the nominee as “insulated.”", "One interviewee suggested that much of his concern about the nominee's being insulated was due, understandably, to the nominee’s current position as Staff Secretary to the President. However, this interviewee remained concerned about the nominee’s ability to be balanced and fair should he assume a federal judgeship. And another interviewee echoed essentially the same thoughts: “(He is) immovable and very stubborn and frustrating to deal with on some issues.”", "Twelve years later, on 30 August 2018, the ABA committee's 15 members voted unanimously to give Kavanaugh a rating of \"well qualified\" for the position of U.S. Supreme Court justice, concluding: \"Judge Kavanaugh meets the highest standards of integrity, professional competence, and judicial temperament.\"", "However, after a U.S. Senate Judiciary Committee hearing in which Dr. Christine Blasey Ford outlined her allegations of sexual assault against Kavanaugh, and Kavanaugh defended himself, ABA president Bob Carlson wrote a letter on 27 September urging the Senate committee to postpone any vote on confirming Kavanaugh until the Federal Bureau of Investigation had completed an investigation into the sexual assault allegations.", "It's clear that President Bush did not promote Kavanaugh directly from a law clerk to a federal judge, as the meme claims. Notwithstanding his inexperience as a trial lawyer or judge, Kavanaugh's last clerkship ended in 1994, nine years before Bush nominated him to the DC Circuit and 12 years before he was confirmed to it. In those intervening years, Kavanaugh worked (albeit almost entirely outside the courtroom) on some high-profile cases and investigations, and at the highest levels of the executive branch.", "'Never tried a case in a regular court'", "It's not clear what the meme means by \"regular court,\" but let's take a look at Kavanaugh's overall courtroom and trial experience before his nomination to the DC Circuit in 2003, and his appointment in 2006.", "In July 2003, Kavanaugh responded to written questions put to him by the Senate Judiciary Committee after his nomination by President Bush. A few questions hit directly on his experience (or lack thereof) as a trial lawyer:", "17 c. 1. Did you appear in court frequently, occasionally, or not at all? If the frequency of your appearances in court varied, describe each such variance, giving dates.", "Occasionally. In both public service and private practice, I argued a number of appellate matters and also conducted legal arguments in district court.", "c. 3. What percentage of these appearances was in: (a) federal courts; approximately 90% (b) state courts of record; approximately 10% (c) other courts. [None]", "c. 4. State the number of cases in courts of record you tried to verdict or judgment (rather than settled), indicating whether you were sole counsel, chief counsel, or associate counsel.", "None, as I have not been a trial lawyer. I have worked on legal issues and appeals in both public service and private practice and argued in court, including the Supreme Court of the United States, the U.S. Court of Appeals for the D.C. Circuit, federal district courts, and state courts.", "c. 5. What percentage of these trials was: (a) jury; (b) non-jury. Not applicable.", "\"I have not been a trial lawyer\" is the key takeaway from these answers. By his own admission, Kavanaugh had never appeared in any court below the state or federal level, and had never been the lead attorney in a trial of any kind, whether civil or criminal, which supports the \"Union Thugs\" statement that he \"had never tried a case.\"", "Kavanaugh did take part in the preparation of some components of some significant court cases, and he did on a few occasions make oral arguments before the U.S. Supreme Court, the DC Circuit itself, other federal appeals courts, and state courts. As part of his 2003 questionnaire response, Kavanaugh outlined his role in some significant cases, including a couple related to the Vince Foster investigation and Ken Starr's Clinton probe.", "Despite his work on these cases, Kavanaugh had not tried a case in court from start to finish by the time he was nominated by President Bush in 2003 to take his place on the US Court of Appeals for the DC Circuit. This component of the \"Union Thugs\" meme is therefore accurate.", "Congressional Record.   \"U.S. Senate Executive Session -- Nomination of Brett M. Kavanaugh to Be United States Circuit Judge for the District of Columbia Circuit.\"\r\n    Government Publishing Office.   26 May 2006.", "Van Natta Jr., Don.   \"Clinton's Acquittal: The Independent Counsel; Scrutiny Shadows a Decision on Clinton.\"\r\n    The New York Times.   14 February 1999.", "Wilentz, Sean.   \"Why Was Kavanaugh Obsessed with Vince Foster?\"\r\n    The New York Times.   5 September 2018.", "U.S. Supreme Court.   \"Bush v. Gore -- Per Curiam.\"\r\n    Legal Information Institute, Cornell University.   12 December 2000.", "Office of the White House Counsel.   \"Candidate Report: Brett M. Kavanaugh.\"\r\n    White House.   14 July 2003.", "Tober, Stephen L.   \"Statement on Behalf of the Standing Committee on Federal Judiciary of the American Bar Association Concerning the Nomination of Brett Michael Kavanaugh to Be Judge of the United States Court of Appeals for the District of Columbia Circuit.\"\r\n    American Bar Association.   8 May 2006.", "Moxley, Paul T.   \"Statement of Paul T. Moxley, Chair Standing Committee on Federal Judiciary of the American Bar Association, Concerning the Nomination of Brett M. Kavanaugh to Be Associate Justice of the Supreme Court of the United States.\"\r\n    American Bar Association.   7 September 2018.", "Carlson, Robert M.   \"Letter to Charles E. Grassley and Dianne Feinstein.\"\r\n    American Bar Association.   27 September 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]