["Gov. Nathan Deal pauses outside his office to take questions from the media after his 2015 State of the State address. Photo by Curtis Compton / AJC.", "Jobs and the economy have been the top issue on Georgians’ minds for four years running, but this year, confidence in the state’s economic situation has stalled.", "That’s according to a recent exclusive Atlanta Journal-Constitution poll, one conducted every year before the Legislature convenes.", "But once session began, Gov. Nathan Deal gave a far more optimistic view of Georgia jobs in his State of the State address.", "\"Since I took office, over 319,000 new private sector jobs have been created in Georgia with nearly 93,000 of those coming in the past 12 months,\" Deal said.", "By most measures, the job market in Georgia and nationwide has been looking up. PolitiFact Georgia wondered, though, if the state has added 300,000 jobs – the equivalent of combining the populations of Alpharetta, Dunwoody, Roswell and Sandy Springs– since Deal took office in January 2011.", "A Deal spokeswoman referred us to data from the U.S. Bureau of Labor Statistics.", "Deal, she said, was referencing the seasonally adjusted, private-sector figures, comparing January 2011 and the preliminary figures for November 2014.", "We checked, and the numbers were spot on.", "If anything, although the numbers sounded large, Deal actually underestimated the tally.", "That’s because agency updates the preliminary numbers on a monthly lag. When it releases the December figures it also revised November’s totals.", "November’s figure went up, as did the preliminary numbers for December, which would measure the number of private-sector jobs added in Deal’s entire first term.", "\"The total for that same period now is 325,600 new private-sector jobs with 99,100 of those coming in that 12-month span,\" Deal spokeswoman Merry Hunter Hipp said.", "PolitiFact Georgia decided to look at the data another way, examining the tally of non-seasonally adjusted jobs in the private sector.", "Doing so smooths out some of the highs and lows in hiring that come, say, from seasonal holiday work.", "On that front, Deal was even more conservative. The BLS data shows Georgia added 395,900 of those jobs between January 2011 and December 2014.", "For the December-to-December period, the state added 106,600 non-seasonally adjusted jobs.", "\"With the new data, it is a slight understatement to say 319,000 jobs,\" said Wesley Tharpe, a policy analyst on tax and economic data at the left-leaning Georgia Budget and Policy Institute.", "\"We would agree his math is on target.\"", "Of course, though, there is a footnote.", "Deal took office more-or-less in the middle of the Great Recession, which for economic purposes started in December 2007.", "At the time, Georgia had 3,471,300 private-sector jobs. The preliminary number for last December is 3,501,200 such jobs.", "The .9 percent difference suggests that only now has Georgia filled the hole of jobs lost during the downturn, Tharpe said.", "That means it took the state seven years to fill the hole created from the Great Recession. Going forward is the first time the state will see net new jobs – at a time when there are also new people entering the workforce.", "That’s why the state’s unemployment rate – though finally declining – remains more than a percent above the national average, Tharpe said.", "And, many of the jobs lost in construction and manufacturing are being replaced with lower-paying positions in retail and service industries, according to the state Labor Department.", "Combined, those factors may account for the public’s worry about a stagnating economy, even when the data shows an increase in jobs.", "Deal said more than 319,000 private sector jobs were created during his first term. Even if that increase only replaces jobs lost before he took office, the data show his estimates were accurate and even conservative.", "We rate his statement True.", "Nathan Deal, State of the State address, Jan. 14, 2015", "The Atlanta Journal-Constitution, \"Georgia’s unemployment rate drops to 6.9 percent,\" Jan. 22, 2015", "The Atlanta Journal-Constitution, \"AJC poll: Georgians back transit, but say no to tax hike to pay for it,\" Jan. 10, 2015", "U.S. Bureau of Labor Statistics, State and Area Employment, Hours, and Earnings Tables, Georgia", "Email interview with Merry Hunter Hipp, deputy communications director, Gov. Nathan Deal, Jan. 29, 2015", "Interview with Wesley Tharpe, policy analyst, Georgia Budget and Policy Institute, Jan. 29, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]