["The misleading claim was shared here on Facebook on January 15, 2021.", "“Urgent news! The Department of Homeland Security is preparing to mobilise the National Guard, preparing to dispatch them across the US along with the military,” the Korean-language post claims.", "“Within the next couple of days, the President will invoke the Stafford Act, and all Americans will be quarantined at home for two weeks. All businesses will be closed for two weeks as well.”", "At the time the posts were circulating online, Donald Trump was still US President. Joe Biden was set to be inaugurated as 46th President of the United States on January 20, 2021 after winning the 2020 US election.", "A similar claim has been shared on Facebook in South Korea here, here and here.", "The claim is misleading.", "The 1988 Stafford Act gives the president the power to declare a national emergency, access disaster relief funds set aside by Congress and task the Federal Emergency Management Agency (FEMA) with coordinating resources to assist local government.", "Trump has declared dozens of national emergencies during his presidency, mostly to tackle natural disasters such as wildfires in California and a hurricane in Florida, White House statements show. He also declared one on March 13, 2020, days after the US reported its first Covid-19 death, to coordinate a national response to the pandemic.", "On January 11, 2021, Trump declared an emergency in Washington DC ahead of President-elect Joe Biden’s inauguration on January 20, 2021.", "“FEMA is authorized to identify, mobilize, and provide at its discretion, equipment and resources necessary to alleviate the impacts of the emergency,” a White House statement said, adding that the measure will be in place until January 24.", "The Stafford Act, however, does not explicitly give the president the ability to quarantine citizens at a time of disaster. The White House’s statement did not mention a two-week national quarantine or business closures.", "According to guidelines published by the Congressional Research Services in 2014, the federal government, in times of health emergencies, may have the power to quarantine citizens under the Commerce Clause of the US Constitution.", "The order followed the storming of the US Capitol on January 6, 2021 by a pro-Trump mob, who targeted the building while Congresss was certifying Biden’s election victory. AFP reported on the violence here.", "The National Mall in downtown Washington DC -- which is normally packed with people for presidential inaugurations -- was set to be closed until after the ceremony, while thousands of National Guard troops have been deployed in the city.", "‘Fake’ letter", "Local National Guard divisions in several US states said a letter circulating online that purported to warn of an imminent national quarantine order was \"fake\". The purported letter contains similar claims to the ones made in the misleading posts.", "“If you see this letter, which is once again circulating on social media and in public, please be aware it IS FALSE AND FAKE,” the Ohio National Guard tweeted on January 12, 2021.", "PSA: If you see this letter, which is once again circulating on social media and in public, please be aware it IS FALSE AND FAKE.\n\n\t\tConsider showing your support for us by helping to combat these rumors- retweet this to your page. Thank You! Be Well!!#OhioansServingOhioans pic.twitter.com/D8FhTgn7Ih", "National Guard divisions in Kansas, Pennsylvania, Utah and various other US states also said the letter was false.", "AFP found the letter and excerpts from it circulating online as early as March 2020, including here and here, after Trump declared an emergency to tackle the pandemic.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]