["The video was published here on Facebook on February 9, 2021. It has been viewed more than 549,000 times and shared more than 39, 000 times.", "“The president was handcuffed. I feel sadness in my heart,” the Burmese-language caption reads.", "Win Myint was president of Myanmar under Aung San Suu Kyi’s civilian government before the military seized power in a coup on February 1, 2021. The military declared a year-long state of emergency and detained Win Myint, Suu Kyi and other top politicians. As of February 17, 2021, the detained politicians have not been photographed in public since the coup.", "The military justified its seizure of power by alleging widespread fraud in November elections that Aung San Suu Kyi's NLD won in a landslide.", "But international and local observers -- as well as Myanmar's own election monitor -- reported no major issues that might have affected the integrity of the vote.", "Comments from some social media users on the video in the Facebook post indicated they were misled by it.", "One user commented: \"[The president] is not a bad guy or a thief to be handcuffed! May the bad luck return to the vultures as soon as possible.\"", "Another commented: \"Too cruel. The wicked guys bullying the righteous with their weapons. Did they handcuff the [president] based on their reasoned knowledge? I feel so sorry. Let the truth win. Let those who steal and bully others fail.\"", "The video was also shared alongside a similar claim here, here, here and here.", "The claim is false: the video was filmed almost three years before the military coup in 2021.", "A keyword search found a longer version of the video here. It was published on the official Facebook page for Myanmar broadcaster Mizzima TV. It reported on Win Myint’s election as president on March 28, 2018.", "The Burmese-language title of the report translates to English as: “President Win Myint's message to the people”.", "“Today, the Pyidaungsu Hluttaw elected U Win Myint as President with 403 votes (out of 636 votes). Following the voting, Mizzima has released a video interview with President Win Myint,” the video’s description reads in part.", "In the video, Win Myint can be seen sitting in a car. The video in the misleading posts corresponds with the Mizzima TV footage from the 20-second mark.", "In the clip, Win Myint can be heard telling reporters: “I will do my best to fulfill my responsibility for the people. Thank you, all media\".", "The original footage shows that Win Myint was not handcuffed in the car, as claimed in the misleading posts. He can be seen wearing a wristwatch on his left hand, which some social media users may have mistaken for handcuffs.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]