["The November 26, 2018 Facebook post contains multiple photographs showing a truck that has fallen through a road.", "The post claims the road was constructed as part of Duterte’s “Build Build Build” program, which aims to help reduce poverty through infrastructure development.", "Here is a screenshot of the post:", "The caption, when translated to English, says: “BUILD BUILD BUILD. Father Digong's Build Build Build program is truly amazing, that's why the DDS are so amazed with it. When it's made in China, it's really something else.”", "“Look at this newly-constructed road which was easily destroyed because it was thinly-paved. What can you say about Duterte's build build build program?”", "Digong is Duterte’s nickname. His supporters also refer to him as “Father”.", "DDS is a reference to Diehard Duterte Supporters.", "A reverse image search found the photos in the post came from a November 24 report from Inquirer.net, a local news organization, about a truck that had sunk through a road in Quezon city, a Manila suburb.", "Regina Samson from the Quezon city government’s communications center told AFP that the road was a local government project, not part of the Build, Build, Build program.", "“A box culvert under the pavement collapsed when a 22-wheeler truck loaded with sand passed over it on November 24, 2018. The box culvert was constructed by the Department of Public Works and Highways way back in the 1970s, and 10 meters of it collapsed,” she said.", "“This is just a box culvert, it's part of the regular road-building program of any local government. Build Build Build is for major road projects,\" she added.", "Anna Mae Yu Lamentillo, chairwoman of the Build Build Build infrastructure program, told AFP that the road project in Quezon city was not part of Duterte’s flagship infrastructure program.", "“The project is not part of the “Build Build Build” program. It’s not funded by China”.", "The official website of the “Build Build Build” program does not list the pavement of the road in Quezon city as one of its projects. The projects can be seen here.", "This map here also shows where the projects are located. There is no project in Quezon city.", "The post has been shared by an anti-Duterte Facebook group with 14,055 followers.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]