["In a Democratic debate on Nov. 15, 2007, Bill Richardson had a startling way to support his view that the situation in Iraq is not improving: \"What I'm saying, also, is that look at this statistic — 65 percent of the Iraqi people now say it's okay to shoot an American soldier.\"", "Where did that number come from? Katie Roberts, Richardson's deputy communications director, points to a BBC-sponsored poll of Iraqis in September 2007. BBC says the poll was conducted in face-to-face interviews with 2,212 people \"in more than 450 neighborhoods across all 18 provinces of Iraq in August, and has a margin of error of plus or minus 2.5%.\"", "But the poll does not directly support the 65 percent figure. Nor does the poll put the question nearly as starkly as Richardson stated.", "\"Thinking about the political action of other people,\" the question says, \"do you find each of these items to be acceptable or not acceptable?\" The first item was \"attacks on coalition forces,\" and 57 percent of the respondents found them \"acceptable.\" Among Sunnis, 93 percent said \"acceptable;\" among Shiites, it was 50 percent, and among Kurds, it was 5 percent.", "It's not at all clear that the same number would have said it is acceptable if people had been asked, \"Is it okay to shoot an American soldier?\" So Richardson is at least casting the response in more dramatic terms than the question interviewers asked. At the same time, the poll clearly suggests that about half of the Iraqi people consider attacks on coalition forces \"acceptable.\"", "The Richardson campaign did not respond to our request to explain the disparity in numbers.", "Polling expert John G. Geer, professor of political science at Vanderbilt University and editor of the forthcoming\n\nEncyclopedia of Public Opinion,\n\ntheorized that Richardson excluded the responses of Kurds.", "Sure enough, if you subtract the 354 Kurd responses from the 2,212 total, the math supports Richardson's 65 percent figure. This makes sense if you consider many Kurds would eventually like to have a state of their own. But removing the Kurds exaggerates the poll results and does not accurately reflect Richardson's statement, which referred only to \"the Iraqi people.\"", "\"The question,\" says Geer, \"is whether 'attacks on coalition forces' equates to 'shooting an American soldier,' which of course it doesn't. Possibly they'd be\n\nmore\n\nlikely to say it's acceptable, I don't know.\"", "He adds, \"It's generally a fair point to say Iraqis are unhappy with the American presence in Iraq. The general point has some validity, but he's exaggerated. That's what campaigns do.\"", "And what we do is call them on it. Richardson wasn't just \"juicing the numbers,\" as Geer said. He was deliberately hyping the language and hyping the numbers to make a stronger point than the facts justified. The best we can rule is Barely True.", "Meet the Press interview,\n\n\"Gov. Bill Richardson (D) discusses his 2008 presidential campaign,\"\n\nMay 27, 2007", "ABC's \"This Week\" interview,\n\n\"Richardson: Withdrawal only option,\"\n\nNov. 25, 2007", "ABC News/BBC/NHK Poll — Iraq: Where Things Stand,\n\nIraq's own surge assessment: Few see security gains,\n\nSept. 10, 2007", "BBC,\n\n\"Iraq Poll September 2007,\"\n\nRelevant questions are #23 and #28", "BBC,\n\n\"Iraq poll makes for grim reading,\"\n\nby Nick Childs, Sept. 10, 2007", "BBC,\n\n\"US surge has failed — Iraqi poll,\"\n\nSept. 10, 2007", "Interview with John G. Geer, polling expert and professor of political science at Vanderbilt University, Dec. 20, 2007", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]