["The claim was published on Facebook here on July 20, 2020 by Australian professional boxer Anthony Mundine, who has more than 88,000 followers. The post was shared almost 300 times.", "The post reads in part: “I can’t share a mask picture about how stupid it is to wear one & how it compromises your immune system! The government wants you to get sick so they can manipulate the numbers even more !”", "A similar claim was also shared tens of thousands of times on Facebook here, here and here, and on Twitter here, here, here and here.", "The posts circulated as international health authorities continued to encourage the use of face masks to curb the spread of COVID-19. The advice coincided with the emergence of conspiracy theories online that allege wearing masks will negatively affect people's health, as reported by Australian and international media here and here.", "The claim, however, is misleading.", "Face mask protection", "International health authorities maintain that wearing a face mask is safe and can in fact protect the immune system from the novel coronavirus, which causes the disease COVID-19.", "“Medical masks can protect people wearing the mask from getting infected, as well as can prevent those who have symptoms from spreading them,” the World Health Organization (WHO) states here.", "Professor Guy Marks, a respiratory physician and epidemiologist at the University of New South Wales, told AFP in an email on July 29: \"Wearing a face mask prevents us from infecting others and reduces the risk of acquiring infection. It has no other effects, including no direct effects on the immune system.\"", "The American Lung Association also notes in this article debunking face masks conspiracy theories that “there is absolutely no scientific evidence that mask wearing or physical distancing weakens the immune system.”", "Preventing infection", "According to this July 2020 academic paper, since there “is no registered medicine or vaccine against COVID-19, our immune system is the best defense.”", "The report, which was published in the peer-reviewed Journal of Infection and Public Health, adds that “when our body encounters any germs or viruses for the first time, the immune system cannot work properly and we become sick. The same thing has happened in the case of COVID-19.”", "Professor Marks added: \"When we are infected with the virus, we produce antibodies against that virus in an attempt to overcome the infection. It is not yet clear how effective these antibodies are in preventing future infection and, if they are effective, how long this protection lasts. Spreading the virus to create immunity is NOT a good way to combat the virus because many people will become very ill and some will die along that pathway. A vaccine, when we have one, may be useful for creating immunity. Until then, we have to do everything we can to prevent the spread of the infection.\"", "Noting the importance of a healthy immune system, the US Centers for Disease Control and Prevention (CDC) and the WHO specifically encourage immunocompromised individuals to wear face masks as an additional layer of health protection.", "AFP previously debunked misinformation about face masks and COVID-19 here, here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]