["The video was shared here on Facebook on January 24, 2020.", "It has been viewed more than 602,000 times and shared some 24,000 times.", "Below is a screenshot of the misleading Facebook post:", "The post’s Hindi caption translates to English as: “Breaking News, BJP politician and former Haj committee chairman Inayat Hussain’s face was blackened and he was beaten up shoe for openly supporting CAA, NRC and NPR in Indore. Good with such Muslims. Too hard.”", "BJP refers to India’s ruling Bharatiya Janata Party, and the Haj committee is a statutory body which organises Islamic pilgrimages to Saudi Arabia.", "Indore is a city in Madhya Pradesh state, in central India.", "CAA is an acronym of the Citizenship Amendment Act, a new law passed by the Indian government on December 11, 2019. The law, which grants citizenship to non-Muslim immigrants from Afghanistan, Bangladesh and Pakistan, sparked violent protests nationwide. Here is an AFP report on the ongoing protests.", "NRC is the National Register of Citizens, a government record of all Indian citizens in India’s northeastern state of Assam. The register has been criticized for being discriminatory against Muslims, as reported by AFP here.", "NPR refers to the National Population Register, a log of all “residents” of India who have lived in a specific locality for six months or more. It was first implemented in 2010 and is intended to track population density.", "The 25-second video alongside similar claims was also shared here, here, here and here on Facebook; here and here on Twitter; as well as here and here on YouTube.", "However, the claim is false; the video has circulated in media reports since at least 2018, and actually shows a man smearing ink on the face of a secretary of a religious shrine in Ajmer, Rajasthan, and beating him with a shoe.", "A Google reverse image search of keyframes extracted from the video using the video verification tool InVID led to this tweet by local news outlet News18 Rajasthan, published March 12, 2018, which shows a longer version of the same video.", "#अजमेर दरगाह के #खादिम के मुंह पर कालिख पोती, #चप्पल से पिटाई, देखिये पूरा वीडियो- https://t.co/InGagDc81V pic.twitter.com/lU9lyZWNp7", "The Hindi tweet translates to English as: “The face of the Ajmer shrine’s caretaker was smeared with black ink. He was beaten with a shoe, see the full video.”", "The tweet also has a link to an article on the incident. Below is a screenshot of the News18 Rajasthan report:", "It reads, in part: “A video surfaced on Monday that shows the face of the secretary of Khadims (caretakers) body Anjuman Shaikhzadgan of the Ajmer Sharif shrine in Rajasthan is being smeared in black and he is being beaten up. Sheikh Bunty, a caretaker of the shrine, can be seen blackening his face with ink and beating him up with a shoe.”", "The Ajmer Sharif Dargah is a sufi shrine located in Ajmer, in the Indian state of Rajashtan. Here is its location on Google Maps.", "Below is a screenshot comparison of the video in the misleading post (L) and the video in the News18 Rajasthan report (R):", "Closer examination of the video also shows, at the 27-second mark, a police station sign saying, “Police Station, Ajmer Shrine, Phone No. 0145-2632705”, can be seen, indicating the incident took place in Ajmer.", "Below is a screenshot of the sign:", "The incident was also reported here and here by other local media.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]