["About this rating", "This bit of racial demagogy was not something offered as a defense in court by comedian Michael Richards (best known for his portrayal of Cosmo Kramer in the long-running Seinfeld television series) after he was caught on tape engaging in a prolonged racial tirade during a November 2006 appearance at the Laugh Factory comedy club in West Hollywood.", "Michael Richards better known as Kramer from TV's Seinfeld. This was his defence speech in court after making racial comments in his comedy act. He makes some very interesting points.", "------------------------------", "Proud To Be White", "Someone finally said it. How many are actually paying attention to this?", "There are African Americans, Mexican Americans, Asian Americans, Arab Americans, etc. And then there are just Americans.", "You pass me on the street and sneer in my direction. You Call me \"White boy,\" \"Cracker,\" \"Honkey,\" \"Whitey,\" \"Caveman\" ... and that's OK.", "But when I call you, Nigger, Kike, Towel head, Sand-nigger, Camel Jockey, Beaner, Gook, or Chink ... You call me a racist.", "You say that whites commit a lot of violence against you, so why are the ghettos the most dangerous places to live?", "You have the United Negro College Fund. You have Martin Luther King Day. You have Black History Month. You have Cesar Chavez Day. You have Yom Hashoah. You have Ma'uled A l-Nabi. You have the NAACP. You have BET. If we had WET (White Entertainment Television) we'd be racists. If we had a White Pride Day, you would call us racists. If we had White History Month , we'd be racists. If we had any organization for only whites to \"advance\" OUR lives we'd be racists.", "We have a Hispanic Chamber of Commerce, a Black Chamber of Commerce, and then we just have the plain Chamber of Commerce. Wonder who pays for that?", "A white woman could not be in the Miss Black American pageant, but any color can be in the Miss America pageant.", "If we had a college fund that only gave white students scholarships you know we'd be racists. There are over 60 openly proclaimed Black Colleges in the US . Yet if there were \"White colleges\" THAT would be a racist college.", "In the Million Man March, you believed that you were marching for your race and rights. If we marched for our race and rights, you would call us racists.", "You are proud to be black, brown, yellow and orange, and you're not afraid to announce it. But when we announce our white pride, you call us racists.", "You rob us, carjack us, and shoot at us. But, when a white police officer shoots a black gang member or beats up a black drug-dealer running from the law and posing a threat to society, you call him a racist.", "I am proud. But you call me a racist.", "Why is it that only whites can be racists?", "------------------------------", "There is nothing improper about this e-mail. Let's see which of you are proud enough to send it on.", "This item is simply a version of an anonymous \"Proud to Be White\" screed, to which Richards' name was added after he gained infamy for his comedy club outburst. However, the item in question had appeared on the Internet long before that incident, and Richards' name was appended to it after the fact.", "As far as we know, Richards did not offer any sort of testimony in a court appearance related to his comedy club outburst. He was invited to attend a mock trial held at Loyola Law School in February 2007 but did not appear at that event.", "Griffin, Lance.   \"Al Sharpton to Headline Banquet.\"\r\n    NBC13.com.   28 April 2009.", "Lin II, Rong-Gong.   \"Kramer vs. Kramer without Kramer.\"\r\n    Los Angeles Times.   18 February 2007.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]