["About this rating", "On Feb. 22, 2020, the Southend News Network published an article saying that activists were calling for the removal of actor Dick Van Dyke from the movie \"Mary Poppins\" due to Van Dyke's use of \"blackface\":", "Dick Van Dyke Condemned Over ‘Blackface’ Appearance In Mary Poppins", "There have been calls for the actor Dick Van Dyke to be digitally edited out of the 1964 Disney Movie Mary Poppins after multiple people noticed that he had applied ‘blackface’ makeup for the role of Bert, the chimney sweep and general Jack of all trades.", "But this item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Southend News Network was originally started in October 2015 with no real aims or objectives in mind other than to add a satirical/spoof-like touch to issues that people are passionate about in Southend On Sea. Above all else, SNN is all about having the occasional ‘dig’ at the powers that be, as well a slightly bigger and more frequent ‘dig’ at certain elements of local media!", "This story went viral in June 2020 as the U.S. saw widespread protests against racial injustice and police brutality. As these protests continued, a number of companies issued statements in support of Black Lives Matter, and some started to wrestle with past racist content they may have produced or spread. HBO Max, for instance, briefly pulled \"Gone With The Wind\" to add a disclaimer about how the movie portrayed slavery. Netflix also removed content that featured characters done up in blackface.", "While there were some changes to movies and television shows in June 2020 due to their use of blackface or other racist stereotypes, there have not been any widespread efforts to remove Van Dyke from \"Mary Poppins.\" One reason for this may be because Van Dyke's character's face is covered in soot, and this is not -- at least not explicitly -- a racist caricature:", "While this rumor originated from a satire website, and there have not been a widespread calls to have Van Dyke removed from \"Mary Poppins,\" some academics have labeled this scene problematic for being a \"parody of black menace:\"", "“We’re in on the joke, such as it is: these aren’t really black Africans; they’re grinning white dancers in blackface. It’s a parody of black menace; it’s even posted on a white nationalist website as evidence of the film’s racial hierarchy.”", "For background, here is why we sometimes write about satire/humor.", "Shepherd, Jack.   \"Mary Poppins Branded ‘Racist’ by US Academic Over Soot Scene.\"\r\n    Independent.   3 February 2019.", "Southend News Network.   \"Dick Van Dyke Condemned Over ‘Blackface’ Appearance In Mary Poppins.\"  \r\n  22 February 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]