["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Rick Scott, R-Fla., talks to reporters prior to the start of the impeachment trial of President Donald Trump at the Capitol, Wednesday, Jan 29, 2020, in Washington. (AP)", "Biden’s position wanting the prosecutor removed was the same as official U.S. foreign policy and mimicked the positions by governments and anti-corruption organizations throughout Europe.", "The prosecutor Scott portrays as a corruption fighter was, in fact, believed to be ineffective and failing to pursue corruption cases.", "Sen. Rick Scott, R-Fla., isn’t running for anything in 2020, yet he’s paying for a television ad in Iowa that calls the impeachment case against President Donald Trump a \"charade\" while targeting Democratic presidential candidate and former Vice President Joe Biden.", "The ad contains the same misleading allegations about Biden that have been supplied by Trump’s most ardent defenders.", "\"The real story here is the corruption Joe Biden got away with,\" says Scott, looking into a camera.\"Vice President Biden threatened a foreign country and forced them to fire a prosecutor who was investigating a company paying his son $83,000 a month. Biden got away with it, and his son got paid.\"", "The facts:", "Biden did pressure Ukraine to fire its top prosecutor, but there is no evidence it was in connection with his son’s role as a board member with the Ukranian gas company Burisma.", "Biden’s position wanting the prosecutor removed was the same as official U.S. foreign policy, and mimicked the positions by governments and anti-corruption organizations throughout Europe.", "The prosecutor Scott portrays as a corruption fighter was, in fact, believed to be ineffective and failing to pursue corruption cases.", "We asked the Scott for Florida campaign for any new evidence but did not get a response. News reports say the first-term senator and former governor has future presidential aspirations.", "RELATED: Rand Paul’s false equivalence about Trump, Biden on Ukraine", "RELATED: Ask PolitiFact: Does a video show Joe Biden confessing to bribery? No", "Biden assumed a lead role in U.S. diplomacy toward Ukraine after a popular revolution in early 2014 that led to pro-Russia President Viktor Yanukovych fleeing the country. Viktor Shokin became top prosecutor in 2015.", "Many Western leaders and institutions, as well as Ukrainian anti-corruption activists, viewed Shokin as corrupt and ineffective for failing to prosecute anybody of significance, and for protecting members of the ruling class. The International Monetary Fund’s managing director warned in early 2016 that \"without a substantial new effort to invigorate governance reforms and fight corruption, it is hard to see how the IMF-supported program can continue and be successful\" in Ukraine.", "A frustrated Biden in December 2015 threatened that the United States would withhold $1 billion unless Shokin was fired, in hopes that a new prosecutor would do more to enforce the law. According to Biden, it worked.", "At a Jan. 23, 2018, event sponsored by the Council on Foreign Relations, Biden recounted his threat to Ukrainian leaders.", "\"I looked at them and said, ‘I’m leaving in six hours,\" Biden recounted. \"If the prosecutor is not fired, you’re not getting the money.’ Well, son of a b----. He got fired. And they put in place someone who was solid at the time.\"", "Steven Pifer, a career foreign service officer who held positions in the Clinton and George W. Bush administrations, told PolitiFact that \"virtually everyone\" he knew in the U.S. government and among experts on Ukraine \"felt that Shokin was not doing his job and should be fired.\"", "Scott’s ad said that Shokin was fired while investigating Burisma. Scott offers no evidence of that to be the case, and news reports cast doubt.", "Burisma founder Mykola Zlochevsky placed Hunter Biden on the Burisma board in the spring of 2014. Zlochevsky had faced accusations of financial wrongdoing for some time. In 2014, the British government froze $23 million in his bank accounts in England, though the court later ordered them unfrozen, suspecting him of laundering money that belonged to Ukrainian taxpayers.", "The American ambassador to Ukraine criticized Shokin’s office and said it never sent the British the records it needed to make its case against Zlochevsky. Worse, the ambassador said, Shokin’s office told Zlochevsky’s lawyers \"that there was no case against him.\"", "A Ukraine court seized Zlochevsky’s homes and a Rolls Royce. But the National Anti-Corruption Bureau in Ukraine ultimately closed the criminal proceedings related to Zlochevsky, according to AnTAC, the Anti-Corruption Action Center.", "Daria Kaleniuk, the executive director of the Anti-Corruption Action Center, tweeted in May 2019 that Shokin’s firing was not about protectin Hunter Biden’s company.  The firing \"was obviously not because the prosecutor wanted to investigate Burisma & Zlochevsky,\" she wrote.", "Shokin claimed in a written statement Sept. 4, 2019 — after Biden was running for president and Trump began targeting Hunter Biden’s ties to Burisma — that Shokin’s refusal to formally close the investigations led to his ouster. But Vitaliy Kasko, who served as Shokin’s deputy overseeing international cooperation until he resigned in protest, told Bloomberg that, under Shokin, the investigation into Burisma remained dormant. Kasko said the matter was \"shelved by Ukrainian prosecutors in 2014 and through 2015,\" and Bloomberg reported that documents backed up his account.", "Scott said, \"Vice President Biden threatened a foreign country and forced them to fire a prosecutor who was investigating a company paying his son $83,000 a month.\"", "There is no evidence that Biden’s call for Ukraine to fire the prosecutor general was because of his son’s position with Burisma and an investigation. Western leaders wanted the prosecutor, Shokin, ousted because they considered him ineffective and corrupt, not because he was pursuing sensitive investigations into a company associated with Biden’s son.", "We rate this statement False.", "Scott for Florida, \"Biden got away with it\" TV ad, Jan. 29, 2020", "Politico, ‘The starting gun for 2024’: Florida senator drops Iowa bomb on Biden, Jan. 28, 2020", "International Monetary Fund, Press Release: Statement by the Managing Director on Ukraine, Feb. 10, 2016", "Kyiv Post, Activists cry foul as courts, prosecutors clear Zlochevsky, Jan. 19, 2017", "Kyiv Post, British court unfreezes accounts of Yanukovych-era ecology minister Zlochevsky, Jan. 23, 2015", "AP, AP FACT CHECK: Trump’s flawed impeachment letter to Pelosi, Dec. 23, 2019", "The Washington Post The Fact Checker, GOP tries to connect dots on Biden and Ukraine, but comes up short, Dec. 4, 2019", "Los Angeles Times, Here is what Joe Biden actually did in Ukraine, Oct. 5, 2019", "AnTAC, How GPO headed by Yarema, Shokin and Lutsenko together \"dumped\" criminal investigations of Zlochevskyi, March 29, 2019", "Radio Free Europe, U.S. Ambassador Upbraids Ukrainian Prosecutors Over Anticorruption Efforts, Sept. 25, 2015", "New York Times, Trump, Biden and Ukraine: Sorting Out the Accusations, Sept. 22, 2019", "CNN, The real reason behind Rick Scott's bizarre Iowa ad buy, Jan. 29, 2020", "Washington Post, The Bidens, Burisma and impeachment, explained, Jan. 27, 2020", "PolitiFact, Ask PolitiFact: Does a video show Joe Biden confessing to bribery? No, Dec. 9, 2019", "PolitiFact, Donald Trump ad misleads about Joe Biden, Ukraine and the prosecutor, Oct. 11, 2019", "PolitiFact, PolitiFact's Trump-Ukraine-Biden coverage in one place, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]