["The Facebook post, which we’ve archived here, has been shared 242,000 times since it was posted on September 21, 2017. The comments suggest that many of those sharing it are Christians who believe it was indeed taken after a miracle in Nigeria.", "A reverse image search on Google, however, revealed that the picture had been on the internet months before it was shared in the post claiming it showed the aftermath of a miracle.", "The earliest version of the picture we could find was in a tweet posted on May 26, 2017 by Unimaid Gossip. The account, which has been inactive for two years, was at the time posting tweets about the University of Maiduguri. The caption said it showed a woman carrying the “lifeless body of a newborn baby found in University of Maiduguri female hostel”.", "A Google search of “Unimaid female hostels” showed that the incident had been reported by some Nigerian media outlets a day earlier.", "This story published by The Cable on May 25 shows a different photo of the same woman in red carrying the baby.", "Three people who were students at the university at the time -- Enyigwe Peter, Baraya Bala Abdullahi and Naomi Joda Dibal -- confirmed that the baby was found at the university.", "Peter took the photograph of the woman in red, and told AFP he had spoken with local media about the incident. The photo of the woman in red, used by The Cable, can also be seen on his Facebook page.", "Abdullahi had also posted a different picture of the woman, confirming again that the photograph was taken in Maiduguri.", "Naomi Joda Dibal, who was an undergraduate student at the time of the incident and is now pursuing postgraduate studies at UNIMAID, told AFP that the baby was found at the university’s Murtala female hostel.", "“It happened in Murtala hostel. This woman was the hall mistress then,” she told AFP.", "“What actually happened on that day was that an unknown student aborted the baby and tried to dispose of the baby. When the alarm was raised, this woman, being the hall mistress, went and saw what happened.”", "Dibal was able to identify the woman, but we have so far been unable to reach her.", "Dibal said the photograph was taken as the hall mistress was carrying the baby to the university clinic.", "She added that she has seen the picture many times on Facebook “with different stories”, taken out of context.", "Nigeria’s Christian and Muslim populations are among the biggest in the world, according to the Pew Research Center. Misleading posts with a religious message are very common.", "This particular post threatened readers by saying Jesus Christ “promised calamity for those that will not spread this news”, encouraging people to spread it far and wide despite its misleading content.", "Before you share a message, you may want to run a Google search and read the comments below, to see if anyone has flagged up any potential problems with it already.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]