["By Joseph A. Gambardello", "Posted on November 3, 2020", "Social media posts falsely claim that a video shows get-out-the-vote marchers in North Carolina were pepper-sprayed by police because they were “blocking polls & intimidating voters.” The nearest voting place was a block away from the marchers’ rally, and the governor said the police engaged in “voter intimidation.”", "A peaceful get-out-the-vote march and rally on Oct. 31 in Graham, North Carolina, was broken up by police using pepper spray because, they said, the demonstrators were blocking traffic.", "A video of police confronting the marchers was shared on social media on Nov. 1 by a group calling itself Conservative Treehouse, with a headline falsely claiming, “BLM/Antifa/Democrat THUGS blocking polls & intimidating voters in North Carolina.” Other social media posts made similar claims.", "The Gateway Pundit posted a story falsely claiming in its headline, “Black Lives Matter CRASHES North Carolina Polling Station.”", "But claims that the protestors had blocked people from voting were unfounded. The nearest polling place was a block away from the rally.", "North Carolina Gov. Roy Cooper and Attorney General Josh Stein, both Democrats, instead likened the police action to intimidation in separate tweets.", "“This incident is unacceptable,” Cooper wrote on Twitter. “Peaceful demonstrators should be able to have their voices heard and voter intimidation in any form cannot be tolerated.”", "Stein tweeted: “All eligible voters in North Carolina have a constitutional right to cast their vote safely and securely, without threats or intimidation.”", "According to the Raleigh News & Observer, about 200 people, including children, took part in the march organized by an area pastor, the Rev. Greg Drumwright, and a group called People for Change.", "Graham is the seat of Alamance County, and the march began at a church and ended at Court Square about a half-mile away. At the square, which features a monument to Confederate war dead, marchers kneeled for nine minutes in honor of George Floyd, a Black man who died after a white Minneapolis police officer knelt on his neck during an arrest. There was no voting conducted at the Alamance County courthouse on the square. The early voting site was located at the county office annex building on 201 W. Elm Street, which is a block away.", "The police told the protesters to clear the street, saying later the crowd was “causing a traffic and safety hazard.”", "“When the crowd failed to disperse, after several verbal commands, officers with the Graham Police Department utilized a crowd control measure that consisted of spraying a pepper based vapor onto the ground,” police said in a statement.", "News coverage of the confrontation shows police also aimed the pepper spray over the heads of the demonstrators.", "Lt. Daniel Sisk, a police spokesman, told FactCheck.org in a phone interview that the department is conducting a review of the confrontation to determine if there were any violations of its use of force guidelines.", "Police said they arrested eight people. Among them were Drumwright and a local newspaper reporter. Some participants told the News & Observer that several children were sickened by the spray.", "The newspaper also reported that the State Board of Elections said the protests did not disrupt the last day of early voting in the city. “We’re still gathering information but it appears that voting has continued and hasn’t been interrupted,” Patrick Gannon, a spokesman for the board, told the News & Observer.", "Laura Brewer, a spokesperson for the state Attorney General’s Office, said in an email that Stein “is monitoring the situation closely and is encouraging anyone who was unable to vote to file a complaint with the State Board of Elections, which is the entity charged with conducting an investigation into voter intimidation.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Eanes, Zachery and Carli Brosseau. “March to Alamance polls ends with police using pepper-spray on protesters, children.” Raleigh News & Observer. 3 Nov 2020.", "Governor Roy Cooper (@NC_governor). This incident is unacceptable. Peaceful demonstrators should be able to have their voices heard and voter intimidation in any form cannot be tolerated. 31 Oct 2020.", "Graham Police Department Statement on 10-31-2020. Scribd. 31 Oct 2020.", "“I Am Change March to the Polls Communication Time Line.” Email from Rev. Greg Drumwright to City of Graham. 9 Oct 2020.", "Josh Stein (@JoshStein_). All eligible voters in North Carolina have a constitutional right to cast their vote safely and securely, without threats or intimidation. 31 Oct 2020.", "Ortiz, Erik. “Voter intimidation lawsuit filed after police use pepper-spray at North Carolina march.” NBC News. 3 Nov 2020.", "The Alamance News (@Alamance News). ALAMANCE NEWS REPORTER ARRESTED AMID THE PROTEST. 31 Oct 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]