["The misleading claim was published in this Sri Lankan blog post on July 4, 2020. Its title translates to English as: “Sri Lanka becomes equal to Sudan - downgraded from an Upper Middle income country”.", "The article’s first three paragraphs translate to English as: “According to the latest classification by the World Bank, Sri Lanka has been downgraded to a lower middle income country from its previous status as an upper middle income country. It should be particularly noted that this comes just an year after the World Bank classified Sri Lanka as an upper middle income country.", "“The classification by the World Bank has been done as per income levels of various countries for 2020-2021.", "“Sri Lanka is among the ten countries that were reclassified by the World Bank in comparison to the previous year.”", "The same claim was also shared in Facebook posts here, here, here, here, here and here.", "The claim is misleading.", "According to this World Bank blog post published on July 1, 2020, Sri Lanka’s classification was downgraded from “upper middle income” to “lower middle income group”. Meanwhile, Sudan’s classification was downgraded from “lower middle income group” to “low income group”.", "The above table lists Sri Lanka’s “Gross National Income” in 2019 as 4,020 USD per capita, whilst Sudan’s is 590 USD per capita.", "In response to the misleading posts, senior financial journalist and analyst Asantha Sirimanne said the claim was “inaccurate”.", "“The statistics clearly show that Sri Lanka was moved to the lower middle income level, whereas Sudan, was reclassified into the low income level due to contractions in the GDP,” he told AFP by phone on July 8, 2020. “Moreover, Sudan experienced a steep currency fall which also contributed to the reclassification.”", "A Ceylon Chamber of Commerce official also said it was inaccurate to state that Sri Lanka and Sudan were placed on an equal level off the recent World Bank reclassification of country income levels.", "“The data published in the World Bank blog clearly reflects the wide gap between the GNI of Sri Lanka and Sudan,” the official noted in an email in response to a request from AFP.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]