["On August 19, several Canadian cities woke up to billboards decrying mass immigration and endorsing Bernier’s People’s Party of Canada (PPC), a marginal far-right party. “Say NO to Mass Immigration,” the sign read.", "On August 25, a Twitter user tweeted a photo of one of the billboards in Halifax with a different message: “Say NO to ass man,” claiming the billboard had been vandalized. The photo received 11,000 retweets, 56,000 likes and many other users shared it as a screenshot on Facebook.", "However, the vandalism did not take place. The photo was digitally altered to make the billboard spell the message denigrating Bernier.", "Halifax reporter Alexander Quon pointed out that even as the pro-PPC message was being replaced by a different ad, the original letters were still visible. The containers in the background and the fence in the foreground confirm the location.", "Quon works for Global News, which published this video of a Pattison Outdoor Advertising employee covering the billboard.", "The billboards attracted attention because of their anti-immigration stance, with Nova Scotia premier Stephen McNeil calling the tone of the ads negative and divisive in a tweet.", "The PPC denied any involvement in the billboard campaign, which was actually orchestrated by third-party advertiser True North Strong & Free Advertising Corp.", "On August 25, following criticism of the campaign, Pattison Outdoor president Randy Otto stated via Twitter that the ads would be removed as soon as possible.", "Message from Randy Otto, President Pattison Outdoor Advertising. pic.twitter.com/rEYJRndHbL", "The following day, The Canadian Press reported that True North Strong & Free disavowed the ads, saying the message had never been approved by its board. Frank Smeenk, the owner of the third party advertising company, wrote to the Canadian Press in an email that he does not always approve content that True North advertises.", "“The True North Strong & Free Advertising Corp was created as a vehicle to help third-party activists promote their views prior to the upcoming election with the intention that this would be welcomed as an innovative way to participate in our democratic process,” he wrote.", "Smeenk did not return AFP calls for further clarification by the time of publication.", "Bernier, whose face was used on the billboards, seized the opportunity to support the anti-immigration message of the ads, a cornerstone theme in his campaign, with a series of tweets.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]