["About this rating", "A video shows Biden fumbling his words and apparently blanking on Defense Secretary Lloyd Austin's name at one point in the speech, although he had mentioned Austin's name a few minutes earlier without issue.", "It's unclear whether Biden literally \"forgot\" his defense secretary's name at that moment, or whether, for example, he got stuck doing an extended \"folksy\" ad lib after initially tripping over his words.", "On March 8, 2021, a video started circulating social media along with the claim that it showed U.S.  President Joe Biden forgetting the name of his defense secretary during a speech:", "This is a genuine video from a speech Biden delivered on International Women’s Day concerning the promotion of two female generals who were reportedly delayed under the administration of former President Donald Trump. At the end of the speech, Biden thanked his Defense Secretary Lloyd Austin, but fumbled over his words. Here's a transcript from the White House:", "\"I want to thank Sec- — the former general — I keep calling him 'General.' My — the guy who runs that outfit over there. I want to make sure we thank the Secretary for all he’s done to try to implement what we’ve just talked about, and for recommending these two women for promotion.\"", "Biden truly did fumble his words while referring to Defense Secretary Lloyd Austin during this portion of his speech. It should be noted, however, that Biden did refer to Austin by name earlier in his speech.", "Here's another transcript from the White House:", "I know Secretary Austin takes this as seriously as Vice President Harris and I do. That’s why his first memo as Secretary was a directive to take on sexual assault in the military and why he stepped up independent review — he set up an Independent Review Commission on Sexual Assault to make concrete recommendations for changes.", "It should also be noted that Biden was likely reading from a teleprompter during this event. While the viral interpretation of this clip is that Biden \"forgot\" the Austin's name, another plausible explanation would be that Biden tripped over the word \"secretary\" and then stumbled through an overly folksy correction.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]