["The results of a ‘readers’ poll’ by a hitherto unknown website called ‘British Herald’, declaring Indian Prime Minister Narendra Modi the most powerful world leader, are being widely shared on Indian social media. Among those circulating the poll are BJP leaders and supporters, and a few media outlets, notably Zee News, Republic TV and Aaj Tak.", "Union Minister Giriraj Singh shared the result, terming PM Modi the “supreme leader” of the country.", "It’s a matter of pride when the supreme leader of our country becomes the world’s most powerful man Narendra Modi Wins Reader’s Poll for World’s Most Powerful Person 2019 – British Herald https://t.co/LuqgzqjnAy", "— Shandilya Giriraj Singh (@girirajsinghbjp) June 21, 2019", "Zee News referred to British Herald as a “leading British magazine”. Its story further detailed, “In yet another proof of his image of a global leader, Prime Minister Narendra Modi has been declared as the winner of a reader’s poll for world’s most powerful person 2019 conducted by a leading British magazine.”", "PM Narendra Modi wins British Herald reader’s poll for world’s most powerful person 2019https://t.co/Z8Wc6jLXat", "— Zee News (@ZeeNews) June 21, 2019", "Alt News decided to find out more about the poll that is being pushed so enthusiastically by sections of the media as a “matter of pride” for all Indians.", "The ‘cover’ of the magazine featured the Indian Prime Minister was revived during the COVID-19 pandemic to suggest that British Herald declared him the most powerful man based on his handling of the pandemic.", "The website www.britishherald.com describes itself as “among the world’s leaders in online news and information delivery.” It mentions “via Reuters” in its logo banner and carries a wide variety of world news stories.", "Alt News found that the website is owned by Herald Media Network Limited, a company registered in the UK.", "The company was incorporated in April 2018 by an Indian national, Ansif Ashraf. Ashraf owns 85% of the shares and the rest is owned by four other shareholders. Apart from Ashraf, the company has another director, Ahamed Shamseer Koliyad Shamsuddeen. Ansif Ashraf’s Wikipedia page describes him as an Indian businessman from Kerala who is the editor-in-chief of the Cochin Herald and owns British Herald.", "So, how popular is British Herald which is being projected by Indian media as a leading British magazine?", "1. British Herald has a global Alexa web traffic rank of 28,518, which grew from 95,979 three months ago. To give a perspective, indiatimes.com has a global Alexa ranking of 190, NDTV has an Alexa ranking of 395. In terms of traffic, British Herald is nowhere close to ‘leading’.", "2. British Herald Twitter account has less than 4,000 followers. Contrastingly, Alt News’ Twitter account has more than 120,000 followers. Leading British media houses such as BBC and The Guardian have millions of followers.", "3. British Herald Facebook page has 57,000 followers. In comparison, BBC’s Facebook page has 48 million followers and The Guardian’s has 8 million.", "4. British Herald, at the time of writing, doesn’t have a Wikipedia page of its own. Every leading media organisation has one.", "5. Not a single reputed international publication has carried the news of PM Modi having won a global leader poll by a ‘leading’ British website, only Indian publications did.", "6. In fact, even the results of the poll announced on British Herald’s Twitter account has only been shared around 150 times at the time of writing.", "Narendra Modi Wins Reader’s Poll For World’s Most Powerful Person 2019@narendramodi@PMOIndiahttps://t.co/QimXPIWBbe", "— British Herald (@HeraldBritish) June 18, 2019", "7. Incidentally, British Herald had tweeted an image of the magazine declaring PM Modi the “world’s most powerful person” nearly a month before the voting ended. This tweet was made on May 23 and barely had 30 retweets at the time of writing.", "Congratulations @narendramodi for keeping the world’s largest democracy to think and act with unity for the sustainable development. @BharatiyaJanataParty @AmitShah pic.twitter.com/hJEtjL1dXA", "— British Herald (@HeraldBritish) May 23, 2019", "From the above, it is clear that British Herald is not a ‘leading’ British Magazine. The company that owns British Herald and carried out the poll is incorporated in the UK. No details of methodology or the sample size of the poll are available, even though the website said that it experienced a sudden surge in traffic during the voting period.", "Union Minister for Health and Family Welfare, Dr Harsh Vardhan, called PM Modi’s ‘victory’ a “matter of pride and honour” for 130 crore Indians.", "https://t.co/22w7aUp7Kx के सर्वे में यशस्वी प्रधानमंत्री श्री @narendramodi जी को विश्व का सबसे ताकतवर राजनेता घोषित किया गया है। यह 130 करोड़ भारतवासियों के लिए गर्व व सम्मान की बात है। प्रधानमंत्री जी को बहुत बधाई व शुभकामनाएं। @PMOIndia @BJP4India ⁦@HeraldBritish⁩ pic.twitter.com/S3s2eSupSC", "— Dr Harsh Vardhan (@drharshvardhan) June 4, 2019", "The sentiment was echoed by a plethora of BJP leaders.", "The same was reported as “a big development” and a moment of pride for the nation by Republic TV.", "PM Narendra Modi chosen as World’s Most Powerful person of 2019 by British Herald, beats Donald Trump, Xi Jinping, Vladimir Putin and othershttps://t.co/jKjemKB3qn", "— Republic (@republic) June 21, 2019", "Several other media outlets also caught with the theatrics.", "While chest-thumping about the results by BJP leaders and supporters is par for the course, the role of the media in projecting the results of an unheard website raises eyebrows. Not one of the outlets that reported the news as a “matter of pride for all Indians” bothered to check the details of the organisation behind the poll.", "Donate Now", "Follow @free_thinker", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]