["Sen. Jeff Sessions, R-Ala., talks to reporters after a sound check before the opening session of the Republican National Convention in Cleveland, Monday, July 18, 2016. (AP Photo/Matt Rourke)", "Sen. Dick Durbin, D-Ill., challenged fellow senator and nominee for U.S. attorney general, Jeff Sessions, over his lack of support for bills that would’ve helped immigrants in the country illegally during Sessions’ first confirmation hearing.", "\"Sen. Sessions, since joining the Senate in 1997, you've voted against every immigration bill that included a path to citizenship for the undocumented,\" Durbin said during the hearing Jan. 10. \"You described the DREAM Act, which I introduced 15 years ago to spare children who are undocumented through no fault of their own, as 'a reckless proposal for mass amnesty.' You opposed the bipartisan comprehensive immigration reform bill, which passed the Senate four years ago.\"", "Durbin then spotlighted Sessions’ comments about immigrants in the military.", "\"You've objected to immigrants volunteering to serve in our armed forces, saying, 'In terms of who's going to be most likely to be a spy, somebody from Cullman, Ala., or somebody from Kenya?',\" Durbin said.", "We wanted to know if that was Sessions’ position.", "Durbin was referring to a 2014 radio interview on the Lars Larson Show, a conservative talk radio program. Durbin quoted Sessions accurately, but it’s not clear from the quote he plucked that the discussion was about immigrants in the country illegally, not all immigrants.", "The Lars Larson Show", "On the show, Sessions raised concerns about \"immigration-type language\" being added to a defense authorization bill.", "Host Larson asked him about that language: \"Sen. Sessions, the essence of the idea is, we would say, if you are here in the United States illegally, if you go join the military and do some service, then we will give you permanent resident status to stay in the United States.\"", "Sessions agreed on that assessment, but he said, \"The real issue would be to open it up to adding additional language.\"", "The Alabama senator told Larson he had heard talks of reducing the Army by 100,000 or more soldiers, and that he didn’t think it was the right thing to do.", "Sessions brought up a news story about a \"native of Kenya\" who had been accused of demanding $50,000 from a local family to protect them from a hitman. The man was serving in the Navy and Sessions questioned how he had been able to get in. (The Kenyan man was found not guilty of the extortion charge in 2015.)", "\"So, I’m wondering could you get a good test score from his high school, could you get good grade point average from Kenya or wherever,\" Sessions said. \"I just think in terms of who’s going to be the most likely to be a spy: somebody from Cullman, Ala., or somebody from Kenya?\"", "Sessions added: \"We’re going in the wrong direction in a lot of ways. Our head isn’t thinking clearly. At a time when this country needs a good military, the last thing we need to be doing is turning out of our military of people who served and then bringing in people who are illegally in the country.\"", "Sessions is initially asked about legislation that would allow \"Dreamers\" to serve, said Durbin spokesman Ben Marter, \"but then speaks at length about immigrants serving in the military and when he says this, he does not distinguish between legal and undocumented immigrants.\"", "In the Senate confirmation hearing, Sessions didn’t directly address Durbin’s claim about him objecting to immigrants volunteering to serve in the armed forces.", "A spokeswoman for Sessions said the Republican senator \"has no problem\" with eligible immigrants serving in the military \"and as attorney general he will enforce and defend such laws as well.\"", "\"Generally speaking, illegal aliens are not eligible to serve in the military. But regardless, the decision of whether to allow illegal aliens to serve in the military is up to Congress and not something that the attorney general controls,\" said spokeswoman Sarah Isgur Flores.", "The secretary of defense has authorized immigrants approved for Deferred Action for Childhood Arrivals to be considered for enlistment in the armed forces.", "Our ruling", "During Sessions’ Senate confirmation for attorney general, Durbin told him, \"You've objected to immigrants volunteering to serve in our armed forces, saying, 'In terms of who's going to be most likely to be a spy, somebody from Cullman, Ala., or somebody from Kenya?'\"", "In a 2014 radio interview, Sessions discusses immigrants in the military and raises concerns about a man from Kenya serving in the military, after allegations of the man trying to extort a local family. Sessions does question who’s more likely to be a spy -- somebody from Alabama or Kenya.", "The radio conversation includes comments about a subset of immigrants, people in the country illegally. With military reductions on the table, Sessions said \"the last thing we need\" is to get rid of people who have served in the military and bring in \"people who are illegally in the country.\"", "Durbin’s statement is accurate but needs clarification, so we rate it Mostly True.", "The Lars Larson Show, 2014 interview with Sen. Jeff Sessions", "Email interview, Ben Marter, spokesperson for Sen. Dick Durbin, Jan. 10, 2017", "Email interview, Sarah Isgur Flores, spokesperson for Sen. Jeff Sessions, Jan. 10, 2017", "AL.com, Man accused of threatening Mobile bank president, requesting $50,000 for protection of victim, his family, Jan. 3, 2014", "AL.com, Kenyan man found not guilty in alleged extortion plot involving local bank president, June 9, 2015", "Daily Nation, Trump's Attorney-General pick once suggested Kenyans could be spies, Nov. 23, 2016", "The Intercept, Trump Attorney General Pick Jeff Sessions Said Immigrants in the U.S. Military Might Be Spies, Nov. 22, 2016", "Secretary of Defense, MAVNI program", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]