["President Donald Trump speaks about modernizing the immigration system in the Rose Garden of the White House, May 16, 2019, in Washington. (AP/Manuel Balce Ceneta)", "As he proposed more changes to legal immigration, President Donald Trump said the United States lags other countries that admit a higher rate of migrants based on education or training.", "Most of the 1 million green cards awarded each year are based on a family connection to someone in the United States. Now, Trump wants to flip this so that most permits are based on skills and \"merit.\"", "\"Only 12% of legal immigrants are selected based on skill or based on merit,\" Trump said May 16. \"In countries like Canada, Australia, and New Zealand, and others, that number is closer to 60, and even 70 and 75% in some cases.\"", "We decided to fact-check his international comparison.", "The numbers mostly check out for the United States, and they are at least close for the other three countries. But context is needed, and it’s unclear what countries meet the high of 75% he mentioned. The White House press office did not answer our questions.", "A key thing to remember is that population sizes for these four countries are very different.", "Estimated 2017 population:", "United States: 326 million", "Canada: 37 million", "Australia: 25 million", "New Zealand: 5 million", "The number of people granted permanent residence includes new arrivals and those already in a country who adjust their status. Countries also use different terminology, migration categories and criteria.", "The term \"merit,\" for example, isn’t widely used outside of U.S. discussions and could suggest that migrants who get green cards through other avenues — such as refugees or family members of U.S. citizens — don’t merit the status. Migrants who get a green card through family links or other streams might have professional degrees and other skills, even if that’s not the basis for their admission.", "Family-based immigration, as a share of their respective population, is similar in Australia, Canada and the United States, studies say. But the United States does have a significantly lower rate of employment-based immigration.", "About 1.1 million people became permanent residents in fiscal year 2017. About 138,000 people, or 12%, did so under an employment-based category. (Other categories include refugees and relatives of U.S. citizens.)", "The employment-based category included multinational executives, skilled workers and professors. A small share of those green cards went to \"needed unskilled workers.\" And more than half of the recipients were spouses and children of the primary applicants.", "In 2017, Canada admitted close to 286,500 permanent residents; about 159,300, or 56%, were under the \"economic class\" category.", "This category includes caregivers, entrepreneurs and other skilled workers.", "The number reflects applicants and immediate family members. Family members represent about half of the economic category in recent years, according to a nonpartisan Migration Policy Institute analysis.", "Australia’s Migration Program granted around 180,200 permanent residences in fiscal year 2016-17. About 124,000, or 68%, were under the \"skill stream\" designation. Less than half were the primary applicants. (Overall, Australia granted about 207,200 permanent residences— that includes individuals granted residence under other programs, including humanitarian. The \"skill stream\" category is about 60% of that 207,200.)", "The skill stream category included points-tested skilled migrants, entrepreneurs, and workers sponsored by employers.", "New Zealand approved residence for close to 48,000 people in the 2016-17 fiscal year. About 29,000, or 60%, were under the \"skilled/business\" stream.", "New Zealand’s skilled/business category covers entrepreneurs, people with exceptional talents, technicians and trade workers. The majority of approvals were for the skilled migrant subcategory, and about half were the primary applicants.", "So none of the other countries Trump mentioned quite reach job-based admissions of 70 or 75%, as he said. His main point, though, is that the United States’ rate is much smaller.", "But that doesn’t mean that Canada and Australia are \"more stingy\" on family immigration, said Daniel Griswold, a senior research fellow at the Mercatus Center at George Mason University who has studied those immigration systems. Rather, it’s a reflection that they are \"far more open to employment-based immigration.\"", "The Migration Policy Institute also looked into family-migration policies in the United States, Canada, and Australia (not New Zealand.)", "If dependent family members who get green cards under the economic categories are reclassified as family migrants, then family admissions become the largest category in Canada, MPI said.", "\"While analyses of family migration tend to focus narrowly on migrants recorded as entering through family-sponsored channels, this is only part of the picture,\" MPI said. \"Taking the dependents of migrants who enter a country through other visa categories into consideration reveals more fully the centrality of family migration in many countries.\"", "Trump said, \"Only 12% of legal immigrants are selected based on skill or based on merit. In countries like Canada, Australia, and New Zealand, and others, that number is closer to 60, and even 70 and 75% in some cases.\"", "In the United States, about 12% of immigrants get employment-based lawful permanent residence. In Canada, Australia, and New Zealand, residence for similar immigration categories range from 56% to 68%.", "For all countries, those percentages include professionals’ family members. If the accompanying family members are reclassified as family migrants, then Canada’s family migration is greater than the economic share, a study said. Relative to its population size, the United States takes in roughly the same rate of family migrants as do Canada and Australia.", "Trump’s statement is accurate but needs clarification. We rate it Mostly True.", "YouTube, White House, President Trump Delivers Remarks on Modernizing Our Immigration System for a Stronger America, May 16, 2019", "DHS.gov, Table 6. Persons Obtaining Lawful Permanent Resident Status by Type and Major Class of Admission: Fiscal Years 2015 to 2017", "Canada.ca, 2018 Annual Report to Parliament on Immigration", "Email interview, Michelle Mittelstadt, director of communications, Migration Policy Institute, May 21, 2019", "Migration Policy Institute, It’s Relative: A Crosscountry Comparison of Family-Migration Policies and Flows | Policy Brief, April 2018", "Homeaffairs.gov.au, Australia’s Migration Trends 2016–17 Highlights", "New Zealand Ministry of Business, Innovation & Employment, Migration Trends 2016/2017", "Email interview, Daniel Griswold, a senior research fellow at the Mercatus Center at George Mason University, May 21, 2019", "Mercatus Center, Reforming the US Immigration System to Promote Growth, 2017", "Email interview, Theresa Cardinal Brown, director of immigration and cross-border policy at Bipartisan Policy Center, May 21, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]