["By Saranac Hale Spencer", "Posted on September 25, 2019 | Updated on September 30, 2019", "An old meme has resurfaced, spreading misinformation about gun laws and school violence in Israel.", "A meme that spread misinformation following the school shooting that resulted in 17 deaths in Parkland, Florida, in 2018 has re-emerged online.", "It’s been circulating again on Twitter and Facebook, repeating this falsehood: “School Shooting Israel 1974. They Began Training Teachers With Guns. There Have Only Been Two School Shootings In 44 Years, And Both Shooters Were Killed By Teachers. Have We Learned Anything Yet, America?”", "First of all, what the meme refers to as a “school shooting” in 1974 was actually a terrorist attack that began on the streets and ended at a school in Ma’alot, a city in northern Israel near the Lebanese border. The three Palestinians who carried out the attack were killed in a gun fight with Israeli soldiers. Twenty-one children died.", "Second, there is no evidence that Israel requires teachers to have guns. Israel has strict gun-control laws that specify for what professions and for what purposes people can be licensed to have a gun. Teachers are not among the professions listed, according to a synopsis of the country’s gun laws provided by the Library of Congress.", "Although Israel doesn’t arm its teachers, it does require that a security guard be stationed at schools with more than 100 students, according to a report compiled for the Connecticut General Assembly following the deadly shooting at Sandy Hook Elementary School in Newtown, Connecticut, in 2012. A 2018 news report from CBS News shows this requirement in practice and regulations from the Israeli Ministry of Education lay out the responsibilities of the guards.", "As for the claim about Israeli school shootings, it’s not true that Israel has had only two “school shootings in 44 years, and both shooters were killed by teachers.”", "There have been many violent attacks near schools or school buses in that time — including attacks with guns and with explosives, according to a list of violent incidents since 2000 maintained by the Israeli Ministry of Foreign Affairs. Of the two shootings that happened in school buildings on that list, both were terrorist attacks. One took place in 2008 at a rabbinical seminary in Jerusalem, leaving eight students dead. The victims ranged in age from 15 to 26, according to Israel’s Ministry of Foreign Affairs. The other took place in 2002 at a yeshiva in Otniel, a settlement in the fraught West Bank territory. That attack left four students dead, two of whom were also soldiers.", "In neither case was the shooter killed by a teacher, as the meme claims. In 2008, the attacker was shot and killed by an Israeli military officer. In 2002, the two attackers were killed by Israeli military forces.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Update, Sept. 30: We updated this story to add a link to the Israeli Ministry of Education’s regulations on armed guards in schools. The Israeli embassy responded to our request for a copy of the regulations after the story was posted.", "Library of Congress. “Firearms-Control Legislation and Policy: Israel.” 30 Jul 2015.", "Office of Legislative Research. Connecticut General Assembly. “School Security in Israel.” 25 Feb 2013.", "Vigliotti, Jonathan. “How schools in Israel keep students safe and prevent mass shootings.” CBS News. 27 Feb 2018.", "Israel Ministry of Foreign Affairs. “Victims of Palestinian Violence and Terrorism since September 2000.” Accessed 19 Sep 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]