["The purported bulletin was published in this Facebook post on June 25, 2020. It has been shared more than 7,000 times.", "The post was shared in a Facebook group about Cranbourne, a suburb of Melbourne in the Australian state of Victoria.", "The Facebook post's caption states in part: “Police Bulletin / Warning!!!", "“People are going door to door handing out masks, they say it’s a new initiative from local government.", "“They will always ask you to please put it on to see if it fits you. It has been doused with chemicals which knocks you out cold and once you're knocked out they proceed to rob you.”", "A similar claim was also shared by other Victoria-based users on Facebook here, here and here.", "The claim is false.", "In a July 1 email to AFP, a Victoria Police spokesperson said : “Victoria Police did not issue this bulletin, however is aware that it has been widely circulating on social media sites for a number of months. Victoria Police is unaware of any instances of this nature occurring in Victoria.\"", "The fake “police bulletin” also circulated on social media in other countries, including Ethiopia, India here and here, Singapore, the UK and Uganda, citing authorities.", "The same claim was debunked by AFP Fact Check here after it circulated in South Africa.", "A keyword search on Facebook found a statement from the Singapore Police Force debunking the false claim after it circulated in Singapore. The statement was published here on April 3, 2020.", "The statement, which included an image showing an identical message stamped with the red text “FALSE MESSAGE”, states in part: “There are false text and audio messages circulating via text messaging services, claiming that there are people robbing residents under the pretext of distributing masks, purportedly under a new government initiative.", "“This is untrue. The Police have not received any report regarding such incidents.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]