["By Robert Farley", "Posted on October 27, 2020", "Democratic presidential nominee Joe Biden has twice botched a talking point on an already dubious claim that his proposal for a minimum corporate tax would pay for his free-tuition plan.", "Several independent tax groups that have analyzed Biden’s tax plan say the corporate minimum tax would raise half (or less) what the Biden campaign estimates.", "But on two occasions in the last week, Biden has muddied things even further by flubbing the campaign’s talking point on how much the tax would raise, and how much his higher education proposal would cost.", "In his interview with Norah O’Donnell for CBS’ “60 Minutes,” which was taped several days before it aired on Oct. 25, Biden grossly underestimated the cost of his plan for free higher education, a point that his campaign later acknowledged Biden “misspoke” about.", "Biden, Oct. 25: If we just made every corporation pay a minimum 15% tax, you got 91 pay no tax, that raises over $400 billion. I can send every single qualified person to a four-year college in their state for $150 billion. I can make sure every single person who qualifies for community college can go, and we still have a lot of money left over.", "O’Donnell noted that after the interview, “Mr. Biden’s staff told us he misspoke and that the cost of free public college could be twice as much as he said.”", "Several days after that interview was taped, at a rally in Luzerne County, Pennsylvania, on Oct. 24, Biden botched the other end of the talking point, saying, “If we just make the 91 corporations that didn’t pay a single penny in taxes pay 15%, that raises $40 billion. That allows us to send every single person qualified to community college free. It allows us to send every single person who can get into a four-year state university go free if they make less than $125,000.”", "In fact, the Biden campaign estimates the 15% corporate minimum tax would raise $400 billion — not $40 billion — over 10 years. The campaign told us the plan to make public colleges and universities tuition-free for families with incomes below $125,000 and to provide two free years of community college will cost “in the range of a few hundred billion dollars” over 10 years.", "But putting aside that Biden did not correctly deliver the numbers estimated by the campaign, independent tax analysts say the campaign greatly overestimates the revenue that will be raised from its proposed corporate minimum tax.", "Biden’s proposed 15% corporate minimum tax is referred to by some as a tax on companies’ global “book income,” or the amount of income corporations publicly report on their financial statements. According to the Tax Foundation, “This measure is useful for assessing the financial health of a business but often does not reflect economic reality and can result in a firm appearing profitable while paying little or no income tax.”", "There were reports last year, prompted by the findings of the left-leaning Institute on Taxation and Economic Policy, indicating that Amazon, Netflix and other companies have in some recent years paid no federal income taxes, due to various tax credits and deductions. To address this, Biden has proposed a 15% minimum corporate tax on firms with $100 million or more in net income (though companies can carry forward book losses from previous years).", "As we said, the Biden campaign estimates the tax would bring in $400 billion over 10 years. By contrast, however, the nonpartisan Tax Policy Center estimates it would raise just $108.5 billion between FY2021 and FY2030 (see Appendix, Table A1). The business-backed Tax Foundation estimates it would bring in $202.7 billion over 10 years (see Table 4). And a Penn Wharton Budget Model analysis of the Biden platform puts revenues from the tax at about $227 billion over 10 years.", "“This provision would raise more revenue if implemented without the rest of Biden’s tax plan, as Biden’s proposed 28 percent corporate rate would decrease the number of companies subject to the minimum tax,” Penn Wharton Budget Model Senior Analyst Xiaoyue Sun told us via email. “So it’s possible that, considered by itself, the minimum tax could raise what the campaign claims, but we haven’t run that scenario without the rest of the Biden tax plan.”", "Sun noted that since Biden’s corporate minimum tax proposal would only apply to companies with net income greater than $100 million, “only 47 firms that don’t pay income tax under current law” would be subject to the proposed tax. That’s about half the number cited by Biden.", "The Biden campaign told us the tuition plan for families with incomes below $125,000 would cost “in the range of a few hundred billion dollars” over 10 years.", "According to the Penn Wharton Budget Model, however, the tuition-free college provisions by themselves would cost substantially more than that: about $1.38 trillion over 10 years.", "The campaign says it relied on cost estimates that took a comprehensive approach to scoring Biden’s higher education proposals.", "The campaign specifically cites a report headed by Anthony P. Carnevale, a research professor and director of the Georgetown University Center on Education and the Workforce, which concludes that Biden’s free-college program “would start paying for itself within a decade.” Carnevale said the proposal would cost $683.1 billion in its first 10 years, but that in the 10th year, the program would begin to pay for itself as a result of higher tax revenues from having more taxpayers in higher-paying jobs (and sharply outpace the cost in the years after that).", "We take no position on Biden’s higher-education plans, of course, but during the primary Biden made a point to draw a distinction with his Democratic opponents by detailing how all of his proposals would be paid for.", "“The vice president does think it’s very important to be clear with the American people regarding how you’re going to pay for things in order to demonstrate they can actually get it done,” Biden policy director Stef Feldman told Bloomberg in December 2019.", "There is a measure of speculation in economic estimates, and Biden’s proposal to pay for higher education is part of a much larger spending and tax platform. But Biden has specifically claimed that his higher education plan would be paid for by the corporate minimum tax. And several independent tax groups have analyzed the entirety of Biden’s tax plan and have concluded that provision would bring in half of what Biden says it would, and far less than it would cost to fund his tuition-free plan over the first 10 years.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]