["About this rating", "Many motorists are aware of dangers of carbon monoxide poisoning resulting of running a car engine inside an enclosed space such as a garage with a lowered door. But with extremely cold weather afoot in many parts of the U.S., a Reddit user on 12 February 2019 sought to warn about another danger: sitting inside a snowed-in car parked outdoors with the engine running. \"Just a reminder that if you haven’t moved your car since Saturday and you’re parked outside, make sure your exhaust is clear before warming up your car,\" was the advice.", "A vehicle's exhaust system serves the dual purposes of carrying away carbon monoxide and other harmful gases resulting from combustion and of muffling noise produced by the engine, according to safety literature published by the American Automobile Association (AAA). The former purpose can be rendered less effective if something is obstructing a vehicle's tailpipe.", "\"Carbon monoxide is odorless, very hard to detect, and it can quickly cause death. If your car is stuck in the snow and you have the engine running, open a window slightly and clear snow away from the exhaust pipe,\" motorists are advised when weather conditions bring immobilizing amounts of snowfall.", "If you must run your vehicle, the National Highway Traffic Safety Administration cautions, \"clear the exhaust pipe of any snow and run it only sporadically — just long enough to stay warm.\"", "Carbon monoxide can fill up a small enclosed space (such as the passenger compartment of a car) quickly and render persons unconscious before they realize the danger. This hazard was demonstrated tragically in 2016 when 23-year-old New Jersey mother Sashalynn Rosa and her two small children died sitting in a running car trying to keep warm as the children's father worked to clear snow from around the vehicle, as television station WABC reported at the time:", "\"It's hard to lose them like that,\" says boy's grandfather, Felix Bonilla.", "His son, Felix Bonilla, Jr. had been digging out the family's car while his girlfriend and their two children sat inside to stay warm. With the car's engine on, and its tail pipe clogged by snow, the odorless, invisible gas seeped into the car in minutes, killing the mother and her baby boy. The little girl also unconscious, was kept alive by paramedics and a bystander who was not afraid to get involved. ...", "Police say the tragedy is a reminder to people to make sure their tailpipes are free and clear because it doesn't take long for cars to fill up with carbon monoxide.", "Rosa's daughter also passed away at a regional hospital soon afterwards.", "In the wake of these deaths, WABC visited the Maplewood Fire Department in New Jersey to conduct an informal experiment showing just how quickly the passenger compartment of a car buried in snow could fill up with carbon monoxide gas. It took only 1 minute and 24 seconds for levels to spike to dangerous levels inside the running vehicle.", "American Automobile Association.   \"How to Go on Ice and Snow.\"\r\n     Accessed 14 February 2019.", "Charlesworth, Michelle.  \" How Fast Do Vehicles Fill Up with Carbon Monoxide with Snow-Clogged Tailpipes?\"\r\n    WABC.   30 January 2016.", "Hoffer, Jim.   \"Mother and Child Die of Carbon Monoxide Poisoning in Passaic After Snow Blocks Car Tailpipe.\"\r\n    WABC.   25 January 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]