["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump has asked for a recount in Wisconsin, where the Associated Press has declared Democratic presidential nominee Joe Biden the winner. He’s also suing for access to locations where ballots are being counted in Michigan. There, the president is running slightly behind Biden, according to the AP.", "Online, his supporters are casting even more doubt on the election results in these states by sharing FiveThirtyEight graphs illustrating vote counts in Wisconsin and Michigan.", "\"Look at 4am,\" wrote DeAnna Lorraine, a Republican who unsuccessfully ran for Congress in California. \"Straight up spikes. 99% of votes went to Biden. WHAT!?\"", "\"Did someone order some voter fraud?\" another user said.", "They, among other social media users, shared screenshots of the FiveThirtyEight graphs. One shows Democratic and Republican votes counted by 6:23 a.m. on Nov. 4 in Wisconsin. The other shows the total votes counted for each party by 7:17 a.m. on Nov. 4 in Michigan.", "These posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We reached out to FiveThirtyEight about the charts. A spokesperson for FiveThirtyEight told us that they can be found on the site’s 2020 election blog, where reporters have been posting live results and election coverage.", "The charts do show an uptick in Democratic votes in Wisconsin before 6 a.m., and a bump in Democratic votes in Michigan after 6 a.m.", "But that’s because counties in those states released a large batch of results all at once, FiveThirtyEight told us.", "\"And these batches were NOT 100% Biden votes,\" a FiveThirtyEight spokesperson. \"Behind the blue line, there is also a red line representing thousands of votes Trump gained. There are also counter examples where Trump’s line shoots up suddenly when a favorable batch of results are reported.\"", "FiveThirtyEight writer Maggie Koerth wrote a blog update about Wisconsin at 8:27 a.m., saying that Biden had been down in Wisconsin before absentee results from Milwaukee came in early that morning.", "\"The boost pushed him up past Trump, but the race in this state is still very, very tight,\" she wrote. \"Biden and Trump are both at 49 percent, with only about 20,000 votes separating them.\"", "Geoffrey Skelley, an elections analyst at FiveThirtyEight, wrote an update about Michigan around the same time, saying that with 86% of the expected vote reporting there, Trump had \"only a slight edge over Biden\" and that Biden still had a good chance of winning the state once all the votes were counted.", "We’ve separately checked claims that Biden received a suspicious surge of votes in these states: One post falsely said Wisconsin found 112,000 votes at 3 a.m. and a tweet got it wrong when it alleged that Biden had received a sudden influx of 138,339 votes in Michigan while Trump received none.", "These FiveThirtyEight graphs are also being misleadingly cast as evidence that Biden is benefiting from an illegal ballot boon.", "We rate that suggestion False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Nov. 4, 2020", "Facebook post, Nov. 4, 2020", "Tweet, Nov. 4, 2020", "The Associated Press, Trump sues for Michigan ballot access, asks Wis. recount, Nov. 4, 2020", "FiveThirtyEight, 2020 election: Live results and coverage, Nov. 4, 2020", "PolitiFact, No, Biden did not receive thousands of mysteriously surfaced votes in Michigan, Nov. 4, 2020", "Statement from FiveThirtyEight, Nov. 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]