["About this rating", "A video of a 2013 student protest in Egypt is frequently attached to dubious claims about false flag attacks and civilians faking their deaths.  In May 2018, after dozens of Palestinians were killed along the Gaza border during protests following a ceremony marking the relocation of the United States Embassy in Israel to the city of Jerusalem, that 2013 clip was shared on Twitter as if it showed a group of Palestinian martyrs staging their deaths:", "This piece of propaganda was re-shared by far-right personalities such as Paul Joseph Watson and Ben Shapiro, and radio host Wayne Dupree also hosted the video on his web site as part of an article titled \"At First Glance You See Palestinian Martyrs Until One Needs to Scratch His Nose.\"", "This wasn't the first time the same video (which can be viewed at the bottom of this article) had been shared out of context. In 2014, for instance, the Conservative Post offered the video to readers, claiming that it depicted Hamas staging an Islamic funeral:", "Gaza ‘Corpses’ Caught Moving When They Forget Cameras Are On Them", "Let the propaganda war begin. It looks like another bad move for Hamas, as they hold an ‘Islamic Funeral’ but they forgot one vital ingredient for the funeral: DEAD PEOPLE.", "This video has also been shared as if it constituted \"evidence\" that the 2013 Rabaa massacre had been staged, as if it showed crisis actors in the aftermath of a chemical attack in Syria, and as if it were a piece of \"Hamas propaganda\" depicting a group of Muslims faking civilian deaths.", "This footage, however, doesn't capture anyone attempting to stage a mass casualty event. It actually shows a group of students at Cairo's Al-Azhar University taking part in a \"die-in\" protest and was originally shared on the YouTube page of Al Badil, an Egyptian news outlet:", "Al Badil uploaded several other videos from this protest as well, such as the following:", "An English-language report published by Ahram in October 2013 provided more context about the protest:", "Students at Al-Azhar University in Cairo's Nasr City district staged what they called \"anti-coup\" demonstrations on campus as tensions rise between them and security forces.", "Groups of students have been protesting what they call a \"military coup\" that toppled Islamist president Mohamed Morsi. They reject the country's interim leadership and call for Morsi's reinstatement.", "Dozens of students protested at Al-Azhar's Faculty of Arabic Language, chanting slogans like \"One word, always remember ... The soldiers will not rule us.\"", "Meanwhile, the university closed down its administration building, where students had been protesting for a week, for \"renovations,\" Al-Ahram Arabic news website reported.", "To sum up: This video doesn't show anyone's getting \"caught\" faking their own deaths, but rather a \"die-in\" form of protest staged by students at Egypt's Al-Azhar University in 2013.", "Al Jazeera.   \"Police Fire Tear Gas at Cairo Student Protest.\"\r\n    30 October 2013.", "Ahram Online.   \"Student Protests Ongoing at Al-Azhar, 'Surprise' Move Upcoming.\"\r\n    26 October 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]