["About this rating", "On 22 April 2019, a junk news site impersonating NBC News reported falsely that U.S. President Donald Trump had pardoned Larry Mitchell Hopkins, the 69-year-old leader of an armed group depicted in a widely seen video. The group is shown holding a large group of roughly 300 migrants at gunpoint in New Mexico. Hopkins was arrested on 20 April 2019 on suspicion of being a felon in possession of firearms.", "The fake story published by \"nbcnews.world\" carried the headline \"President Trump Issues Immediate Pardon for Arrested Border Militia Leader\" and reported:", "No … that seems a bit severe. Typically when a Trump supporter has been charged with a felony, it’s because their rights were violated during the Obama administration. In this case, violent assault couldn’t be proven, so they forced him to plead guilty to a lesser felony. They’re not even mad about the right crime!", "President Trump isn’t having it. Our source inside the West Wing says a dispatch was sent to the border to cease and desist all complaints against Gus [Hopkins]. He has been issued full immunity and a Presidential Pardon for his felony. The dispatch has to legally be delivered in person, so official channels may not see the communication in time for Gus to have Easter Dinner with his family.", "Trump has not issued a pardon for Hopkins, and nothing that appears on nbcnews.world can be trusted. In fact, if readers click on the website's logo, they'll be taken to a suspicious download page (the archived version of which can be viewed here).", "Hopkins heads the group that dubs itself \"United Constitutional Patriots\" (UCP). They were seen in the viral video holding rifles while dressed in military-style fatigues and detaining a large group of migrants, which included children, before handing them off to the Border Patrol. The video drew outrage, prompting the American Civil Liberties Union to dub UCP a \"fascist militia.\"", "Hopkins' past convictions include felony firearm possession and impersonation of a peace officer. According to the FBI, Hopkins said his group was \"training to assassinate George Soros, Hillary Clinton, and Barack Obama.\"", "BBC. \"Militia Detains Migrants at Gunpoint Along the US-Mexico Border.\"\r\n  19 April 2019.", "Silva, Daniella. \"Leader of Militia Detaining Migrants Allegedly Said Group Trained to Assassinate Soros, Clinton, Obama, Complaint Says.\"\r\n  NBC News. 22 April 2019.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]