["The claims were published on Facebook here on February 28, 2021. The post has been shared more than 14,000 times.", "The post's Burmese-language caption translates to English as: “Breaking news.\n\t“It is time for evils to die.\n\t“UN Chief Christine Schraner Burgener has declared war on Myanmar due to the request of Dr. Sasa.\n\t“It is said that more than 180 countries, including the US, will go to war. \n\t“Also threatened to occupy mainland China because it supported \"Thar Wa\" [nickname for Myanmar army chief].\n\t“Some witnesses say two frigates left Australia [for Burma] at 11:30am today.\n\t“May Amaysu (Aung San Suu Kyi) be healthy.\n\t“People who love Amaysuu, keep fighting.”", "Christine Schraner Burgener was appointed as the UN special envoy on Myanmar in 2018. On February 26, 2021, less than four weeks after the Myanmar military seized power in a coup, Burgener presented a briefing report on the situation in Myanmar at the UN General Assembly.", "Dr. Sasa is envoy to the United Nations by the committee representing Myanmar's ousted civilian government.", "The announcement issued by the State Administration Council's information team reads: \"It's illegal to perform the Hluttaw works such as forming committees representing Hluttaw without authority, holding committee meetings, making announcements and notifications and appointment of representatives during the investigation period of UEC.\"", "The Hluttaw refers to the Assembly of the Union, the national-level bicameral legislature of Myanmar established by the 2008 National Constitution.", "Similar claims were also published on Facebook here, here, here, and here.", "The claims, however, are false, according to the UN.", "Stéphane Dujarric, a spokesperson for the UN Secretary-General, told AFP in an email on March 1, 2021: “We have repeatedly called on the military authorities to reverse their actions and restore the democratically expressed will of the people. However, we have never called for a ‘war’ on the military\".", "There are no credible media reports or official UN statements to support the false claim that war had been declared.", "Britain has called for the UN Security Council to meet on March 5, 2021 on Myanmar, diplomatic sources told AFP, as security forces have steadily stepped up their use of violence against anti-coup demonstrators in the Southeast Asian nation.", "Australia's Department of Defence told AFP on March 3, 2021 that it had not sent \"two frigates\" to Myanmar, as the false Facebook posts claimed.", "Reverse images searches found the images shared in the Facebook posts in fact predate Myanmar’s military coup.", "The first photo was published on the US Air Force’s official website here on April 5, 2012. The photo was taken on March 20, 2012, and shows US troops at a transit center in Kyrgyzstan.", "The photo’s caption reads: “U.S. Army Soldiers and their cargo is secured in a C-17 Globemaster III March 20, 2012, prior to take off from the Transit Center at Manas, Kyrgyzstan. The C-17 Globemaster III can fit up to 158 passengers and five baggage pallets. (U.S. Air Force photo/Staff Sgt. Angela Ruiz)”.", "Below is a screenshot comparison of the photo in the misleading post (L) and the 2012 US Air Force photo (R):", "The second photo was published here on the official website of the US military’s Dyess Air Force Base in April 2015.", "The photo’s caption reads: “U.S. Army parajumpers from the 82nd Airborne Division and British Army parajumpers from the 16th Air Assault Brigade load onto mobility aircraft during Combined Joint Operational Access Exercise 15-01 April 13, 2015, at Pope Army Airfield, Fort Bragg, North Carolina. CJOAX takes place several times each year to certify the Air Force and Army’s ability to deploy strategic airlift, contingency and support forces in a large formation airdrop.(U.S. Air Force photo by Senior Airman Peter Thompson/Released)”", "Below is a screenshot comparison of the photo in the misleading post (L) and the 2015 Dyess Air Force Base’s photo (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]