["About this rating", "A 2015 e-mail from John Podesta referenced unproven rumors that the Obama campaign had \"flooded\" the 2008 Iowa Democratic caucuses with out-of-state voters.", "No e-mail from  John Podesta said that Barack Obama had \"directed his supporters in Colorado to engage in a little all-American voter fraud.\"", "The October 2016 WikiLeaks series \"The Podesta Emails\" gave readers an inside look at operations in the Democratic Party by publishing the communications of Hillary Clinton campaign director John Podesta, and one rumor connected with that e-mail dump held that one of those documents revealed in part that President Obama had \"directed his supporters\" to engage in \"a little all-American voter fraud.\"", "Misinterpretation and misrepresentation of WikiLeaks documents is rife, and the phrasing about \"a little all-American voter fraud\" came not from the actual text of one of the released documents but from a blog post about the WikiLeaks documents:", "Wikileaks has done an amazing job of revealing to the American people just how screwed up and corrupt our government really is, at all levels. The most recent revelation comes from the very top, and shows that Obama may have directed his supporters in Colorado to engage in a little all-American voter fraud.", "In the email, John Podesta discussed his meeting to two Coloradans who made it clear that they wanted help in making sure that only legal and living people were allowed to vote in the 2015 caucuses.", "A search of WikiLeaks returns zero results for the \"all-American voter fraud\" phrasing:", "As with many purported WikiLeaks revelations, the blog included not a link to the complete underlying document but only a screenshot of an out-of-context e-mail along with commentary about it:", "That e-mail was dated 14 May 2015, pertained to the upcoming 2016 Democratic caucuses in Colorado (eventually won by Bernie Sanders), and referenced unproven rumors that back in 2008 the Obama campaign had supposedly \"flooded\" the Iowa caucuses with ineligible voters from out of state:", "High importance. I met with Jim and Mike in Denver. They are both old friends of the Clintons and have lots of experience. Mike hosted our Boulder Road Show event. They are reliving the 08 caucuses where they believe the Obama forces flooded the caucuses with ineligible voters. They want to organize lawyers for caucus protection, election protection and to raise hard $. They are not just Colorado focused and have good contacts in the region", "A December 2007 Politico article examined the claim made by a Clinton aide at the time that the Obama campaign was trying to \"manipulate the Iowa caucuses\" by \"busing in students from out of state\":", "A Clinton spokesman, Mo Elleithee, drew a distinction between her campaign's approach to college campuses and Obama's, amplifying Yepsen's criticism of the Obama campaign.", "There’s a big difference here. We are not systematically trying to manipulate the Iowa caucuses with out of state people. We don’t have literature recruiting out of state college students. We didn’t bus in folks from out of state to the JJ. We didn’t bring in out of state activists to the Heartland Forum.", "An Obama aide also pointed out that there's no evidence his campaign was busing in students from out of state, while my colleague Ben Adler reported that Clinton volunteers from out of state were planning to come back to caucus (it's unclear to him how organized this effort is) and the Clinton campaign did email out a call for volunteers to come from other midwestern states prior to the Jefferson Jackson dinner.", "Obama spokesman Bill Burton responded to this controversy by saying:", "Rather than denigrating the caucus rights of students who go to school in Iowa, we would suggest the Clinton campaign organize them. Their attack here is borne out of pure political frustration. Iowans are determined to launch a winning candidate for the Democratic Party to bring real change for our country. They will not be deterred by efforts to dampen participation and 11th-hour attacks.", "In March 2016, the Clinton campaign allegedly repurposed these rumors and claimed Bernie Sanders' campaign was \"busing in\" ineligible voters to party caucuses. Sanders dismissed the rumor as a recycled smear used by David Brock:", "Really? Based on what do they say that? Based on David Brock's long history of honest and integrity? The man who tried to destroy Anita Hill? Is that where this is coming from?", "Everyone of you know, you know it, that every day you're being flooded by all this negative stuff from Sec. Clinton's super PAC. I haven't heard of that. I don't want my integrity and honesty to be impugned. I have no idea who says this, that is a lie. An absolute lie.", "We will win or lose, we do it honestly, and I really dislike people suggesting we're going to bring in students from out of state who are going to perjure themselves, and say they are from Iowa? That's, talk about negative stuff, this is what ... Again, I don't think this is the Secretary ... but you bring people like David Brock ... into your campaign ... if this is the kinda stuff that they're planting, that's negative stuff.", "No e-mail released by WikiLeaks quoted John Podesta (or anyone else) saying that President Obama had engaged in (or suggested his supporters engage in) \"a little all-American voter fraud\" in Colorado. In 2015 Podesta referenced uncorroborated rumors from the 2008 campaign holding that President Obama had flooded the Iowa caucuses (not the Colorado caucuses, not any 2016 caucuses, and not any general election polling places) with ineligible voters during his run against Hillary Clinton for the Democratic nomination.", "Smith, Ben.   \"Clinton Aide: Obama Trying To 'Manipulate The Iowa Caucuses.'\"\r\n    Politico.   1 December 2007.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]