["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President-elect Donald Trump’s pick for education secretary thinks some K-12 schools may decide they need a gun on campus — to protect themselves from bear attacks, for example.", "At her Senate confirmation hearing, education activist and major Republican donor Betsy DeVos mentioned a meeting she had with Sen. Mike Enzi, R-Wyo. He told her about a rural public school in Wapiti, Wyo., that has a fence surrounding the schoolyard to keep grizzly bears out.", "Later in the hearing, DeVos suggested a fence might not be enough.", "When Sen. Chris Murphy, D-Conn., asked DeVos if she thinks guns should be allowed on school premises, DeVos said that decision should be left up to local lawmakers who might have specific needs. Like grizzly bears.", "\"I would imagine that there's probably a gun in the school to protect from potential grizzlies,\" she said, referencing the school in Wyoming.", "We couldn’t bear not knowing whether the elementary school in Wapiti, Wyo., keeps a gun on hand to defend against grizzlies. So we called up Park County School District No. 6, which includes Wapiti Elementary School.", "\"No, we do not,\" said Angie Page, assistant to the superintendent, citing the district’s no-weapons policy.", "The entire state of Wyoming actually has a policy banning weapons on elementary, middle and high school campuses, state Department of Education spokesperson Kari Eakins said. Decisions about wildlife defensive measures are made at the local level and not reported to the state.", "Even though Wapiti Elementary doesn’t keep a gun for use against a grizzly, there really is a fence to keep bears out.", "Wapiti, an unincorporated community with a population of about 165, is located on the edge of Yellowstone National Park. More than 700 grizzlies live in the Greater Yellowstone area, according to the National Park Service.", "The Wapiti school put up a fence to keep the grizzlies out of the playground in 2002, according to the Billings Gazette, a newspaper in Montana. Between 1990 and 2000, 16 grizzly bears were captured within a 4-mile radius of Wapiti, the article said.", "The Denver Post reported in 2005 that a Wyoming Fish and Game biologist had recently captured two cubs hanging around the Wapiti school, and that a grizzly hide was nailed outside of the principal’s office.", "Even after finding that DeVos’ claim was incorrect, we wondered if it’s advisable to use a gun when faced with a potential grizzly bear attack. Adult males can weigh up to 700 pounds and are about 3.5 feet tall at the shoulder.", "\"Without question, guns can protect people from bears,\" said Tom Smith, a wildlife sciences professor at Brigham Young University. \"But, and this is a big but, to be able to use a firearm under duress effectively is limited to a very small group of persons.\"", "Smith told us that people would be much better off using some sort of bear spray (about $40 on Amazon). It’s non-lethal to the bear, it’s less cumbersome than a gun, and because it creates a plume of spray, the user’s aim doesn’t have to be as accurate as it would be if he or she were using a gun.", "A study of bear attacks in Alaska found that in 27 percent of cases involving guns that failed, the person couldn’t get their gun ready fast enough to shoot the bear, according to an article Smith wrote for Alaska Magazine in 2012. Firing a warning shot was only successful at getting the bear to leave in 33 percent of incidents.", "\"So while some may carry firearms for protection, and it certainly is their right, the vast majority of persons would do themselves — and bears and quite honestly the rest of us — a big favor by carrying bear spray,\" Smith said.", "Our ruling", "DeVos said, \"I would imagine that there's probably a gun in the school (in Wapiti, Wyo.) to protect from potential grizzlies.\"", "The elementary school in Wapiti certainly faces the threat of grizzly bears, given its proximity to Yellowstone National Park. It has a fence surrounding the playground to keep bears out.", "However, the state of Wyoming and the school district ban weapons in K-12 schools, so Wapiti Elementary does not have a gun on hand to defend against potential bear attacks.", "We rate DeVos’ claim False.", "Correction: Due to a transcription error, the word \"probably\" was left out of DeVos' statement in an earlier version of this article. It read, \"I would imagine there's a gun in the school to protect from potential grizzlies.\" The article has been updated with her complete quote: \"I would imagine that there's probably a gun in the school to protect from potential grizzlies.\" Additionally, we have corrected a statistic about the efficacy of firearms against bears. The rating of False remains the same.", "C-SPAN, DeVos confirmation hearing, Jan. 17, 2017", "Denver Post, \"Lessons in bear country,\" Sept. 12, 2005", "Billings Gazette, \"Bear Fence,\" April 7, 2002", "Yellowstone National Park, Grizzly Bears, accessed Jan. 18, 2017", "Wyoming Game and Fish Department, Grizzly Bear Management, May 11, 2016", "Alaska Magazine, \"Bullets and Bears,\" summer 2012", "Phone interview, Angie Page, assistant to the Park County School District #6 superintendent, Jan. 18, 2017", "Email interview, BYU professor Tom Smith, Jan. 18, 2017", "Email interview, Wyoming Department of Education spokesperson Kari Eakins, Jan. 18, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]