["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Attorney General Jeff Sessions is optimistic that funds for President Donald Trump’s border wall will come through. One way could be with savings from money that’s inappropriately going to immigrants, he said.", "Sessions talked about paying for the wall on ABC’s This Week after host George Stephanopoulos asked if Mexico would pay for the wall, as Trump has promised.", "\"Well, we're going to get paid for it one way or the other. I know there's $4 billion a year in excess payments, according to the Department of the Treasury's own inspector general several years ago, that are going to payments to people -- tax credits that they shouldn't get,\" Sessions said April 23. \"These are mostly Mexicans. And those kind of things add up -- $4 billion a year for 10 years is $40 billion. There are a lot of ways we can find money to help pay for this.\"", "Sessions left us wondering if $4 billion a year in tax credits are going to people who are not supposed to get them, and if they are mostly Mexicans. There’s some truth to Sessions’ claim, but it also leaves out some critical details.", "Treasury Department report", "Anyone who earns an income in the United States is required to pay taxes, whether they live here legally or illegally.", "Generally, people who are authorized to work in the United States use a Social Security Number to report income and pay taxes on them. Individuals who don’t have employment authorization can file their taxes using a nine-digit Individual Taxpayer Identification Number (ITIN).", "Experts say the majority of ITIN filers likely are individuals who are living in the country illegally, but an ITIN can also be issued to people here legally, such as foreign workers.", "The Treasury Inspector General for Tax Administration issued an audit in 2011 that said $4.2 billion in refundable credits were paid to individuals who are not authorized to work in the United States. These funds were claimed in the 2010 tax processing year by a total 2.3 million ITIN filers.", "$4.2 billion tax credits", "The Treasury audit focused on refunds through the Additional Child Tax Credit (ACTC), available to individuals who owed less in taxes than deductions for the Child Tax Credit (up to $1,000 per child). A child must be a U.S. citizen or resident in order for a parent to claim the credit.", "A law passed in 1996 denied another credit, the Earned Income Tax Credit (EITC), to individuals who file taxes without a Social Security Number that authorizes employment. ITIN filers are also not eligible for Social Security benefits.", "But as we’ve reported in a similar claim, Congress has not written a provision barring ITIN filers from claiming the ACTC.", "The audit cited by Sessions said \"clarification to the law is needed to address whether or not refundable tax credits such as the ACTC may be paid to those who are not authorized to work in the United States.\"", "In response to a draft of the audit, the Internal Revenue Service said: \"The law does not require the taxpayer or eligible child to have a Social Security number in order to receive the (Child Tax Credit) or the ACTC. The IRS is administering the law accordingly. Legislative changes would be required to deny many of the claims discussed in the report.\"", "Regarding the $4.2 billion for processing year 2010, a Congressional Research Service report in 2016 noted that the figure did not necessarily represent the annual revenue losses, since about 11 percent of claimants in 2010 filed tax returns for multiple years.", "The audit said the returns filed for multiple years resulted in claims of more than $1 billion, but not all claims were refunded due to statute of limitations. Point being, the report doesn't show the availability of $4 billion a year, as Sessions said.", "And while parents may not be working legally in the United States, in some cases their children are U.S. citizens.", "\"Under what Mr. Sessions is suggesting, it wouldn’t be Mexico that pays for the border wall, but rather low-income children — most of them U.S. citizens and part of the future U.S. workforce — and their families,\" said Bob Greenstein, president of the left-leaning Center on Budget and Policy Priorities.", "‘Mostly Mexicans’?", "The 2011 audit did not list nationalities of ITIN filers claiming the credit.", "Sessions’ office referred us to a Department of Homeland Security report on the estimates of the unauthorized population as of January 2012, around the time of the audit’s analysis.", "The DHS report said that of the estimated 11.4 million unauthorized immigrants, 6.7 million were from Mexico.", "While the majority of ITIN filers are likely illegally in the country, Greenstein told us there is no data to precisely determine how many Mexican ITIN filers are claiming the ACTC.", "Though a report from the IRS’ Taxpayer Advocate office found that about half of people applying for ITINs in 2014 were Mexican.", "That report also found that in 2015, 4.4 million ITIN filers paid more than $5.5 billion in payroll and Medicare taxes and $23.6 billion in total taxes.", "Our ruling", "Sessions said, the Treasury Department's inspector general found \"there's $4 billion a year in excess payments\" going to people that shouldn’t get them. \"These are mostly Mexicans.\"", "An audit did find $4.2 billion in refundable credits for child care were paid to individuals who are not authorized to work in the United States. Those $4.2 billion were claimed in tax processing year 2010, but about 11 percent of claimants in 2010 filed tax returns for multiple years, meaning that amount wouldn't necessarily be available annually.", "Sessions says these people \"shouldn’t\" get the tax credit. That may be his opinion, but there’s nothing in the law now saying they can’t claim the credits.", "The audit didn’t have anything to say about the nationality of those who claimed the credits, though other evidence suggests it’s likely that about half could be Mexican.", "Sessions’ statement is partially accurate but leaves out important details or takes things out of context. We rate it Half True.", "ABC, 'This Week' Transcript 4-23-17: Attorney General Jeff Sessions and Xavier Becerra, April 23, 2017", "Email exchange, Attorney General Jeff Sessions’ press office, April 24, 2017", "Department of Homeland Security, Estimates of the Unauthorized Immigrant Population Residing in the United States: January 2012, March 2013", "Treasury Inspector General for Tax Administration, Individuals Who Are Not Authorized to", "Work in the United States Were Paid $4.2 Billion in Refundable Credits, July 7, 2011", "PolitiFact, Trump says illegal immigrants get $4.2B in tax credits but doesn't count their taxes paid, Aug. 18, 2015", "IRS, National Taxpayer Advocate, INDIVIDUAL TAXPAYER IDENTIFICATION NUMBERS (ITINs): IRS Processes Create Barriers to Filing and Paying for Taxpayers Who Cannot Obtain Social Security Numbers, 2015", "Congressional Research Service, Individual Taxpayer Identification Number (ITIN) Filers and the Child Tax Credit: Overview and Legislation, March 22, 2016", "Email interview, Bob Greenstein, CBPP President, April 25, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]