["Last week, Democratic presidential candidate Joe Biden fielded a question from the mother of a transgender child at his town hall on ABC News.", "A post from the page Velvet Tonic contains what it claims is a version of his response. It has been shared over 700 times on Facebook.", "\"If your 8 year old child says they want to be transgender to make life easier ... they have a right to transition and there is no reason for you to deny it,\" reads its quote, attributed to Biden.", "Velvet Tonic has not responded to a request for comment from USA TODAY.", "More:Fact check: Fake quote says Biden wants to 'lock down' US", "In response to the question about how he will ensure that LGBTQ Americans are protected under the law, Biden replied that he will \"flat-out change the law.\" He also said he will eliminate discriminatory executive orders from President Donald Trump.", "As president, Trump has rolled back Obama-era rules that allow transgender students to use the bathroom of their choice, changed Obama-era health protections for transgender patients, and banned most transgender individuals from the military, per the New York Times.", "Biden then launched into the remarks cited in the post by Velvet Tonic.", "\"The idea that an 8-year-old child or a 10-year-old child decides, you know — 'I decided I want to be transgender, that's what I think I'd like to be, it'd make my life a lot easier' — there should be zero discrimination,\" he said, per CBS News.", "However, he did not make remarks about their \"right to transition.\"", "He also noted that \"too many transgender women of color are being murdered.\"", "\"They're being murdered,\" he repeated.", "Get these in your inbox: We're fact checking the news and sending it to your inbox. Sign up here to receive it.", "A transcript of the town hall also confirms that the former vice president didn't reference transitioning or sex-changing medical procedures in any of his responses, per the Associated Press.", "His campaign website does not discuss sex-changing medical procedures for children.", "Based on our research, we rate the claim that Joe Biden said transgender children \"have a right to transition\" FALSE. In reality, he said transgender children should be subject to \"zero discrimination.\"", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]