["About this rating", "The September 2018 announcement of former NFL quarterback Colin Kaepernick's endorsement deal with Nike, Inc. was a boon to junk news websites who capitalize on controversy by fabricating clickbait content to promote on social media platforms.", "Some of the most notorious of these sites, members of the America's Last Line of Defense network of junk news sites (LLOD), published articles within days of the announcement saying, for example, that Nike scotched the deal after Kaepernick launched into an \"anti-white rant\" in public (false), that Nike lost an $80 million U.S. government contract because of the deal (false), and that former NBA star Michael Jordan had resigned from Nike's board of directors in protest of the Kaepernick deal (also false).", "Milking the theme further, LLOD reported on 9 September that Kaepernick was arrested for trespassing after running onto the field during the national anthem \"as a publicity stunt\" at an NFL game in San Francisco:", "Traitorous cretin and anti-American troublemaker, Colin Kaepernick, was just arrested for being stupid in public. Kaepernick decided that he would crash the field during the national anthem in San Fransisco [sic] this afternoon, running to the 50-yard line to take a knee, “black power” fist in the air.", "Unfortunately for him, San Fransisco authorities and stadium security don’t recognize him as a player — because he’s not. Within 30 seconds, the thug was on the ground with a knee on his neck being arrested for trespassing and disorderly conduct. He also tried to resist when officers were hitting him to subdue him. According to one fan in New Balance shoes, he got exactly what he deserved.", "As he was being dragged off the field, he was heard shouting: “This is why we kneel!”", "This item was followed by an \"update\" saying Nike had fired Kaepernick because of the stunt:", "Colin Kaepernick thought he was slick when he ran onto the field during one of his old team’s games, screaming “black power” with his fist in the air. You know who didn’t think he was slick? The police who yanked him off the field. Nike management also didn’t appreciate his behavior.", "Kaepernick faces charges of trespassing after he ran onto the field. While his lawyer bailed him out of jail almost immediately, but no one at Nike was willing to “bail him out.”", "After the incident, Nike President Charles Carmichael told MSNBC that they “have no choice but to release Mr. Kaepernick from his contract” because of a release clause that would invalidate the contract if Kaepernick committed a crime.", "None of this was true. Kaepernick wasn't present at the 9 September game between the 49ers and Minnesota Vikings (nor did that game occur in San Francisco). In fact, the closest Kaepernick got to an NFL game that weekend was tweeting a message of solidarity with two Miami Dolphins players who took a knee during the anthem before a game against the Tennessee Titans:", "My Brothers @kstills and @ithinkisee12 continue to show their unwavering strength by fighting for the oppressed! They have not backed down, even when attacked and intimidated. Their courage will move the world forward!", "“Love is at the root of our resistance!”✊? pic.twitter.com/2kSsX4s7EU", "— Colin Kaepernick (@Kaepernick7) September 9, 2018", "Unless he was tweeting from a jail cell, that in itself proves that Kaepernick wasn't arrested. And if he wasn't arrested, Nike had no cause to cancel the endorsement deal.", "In point of fact, despite all the controversy surrounding Kaepernick because of the \"take a knee\" protests he started in 2016, Nike has shown no signs of reneging on the endorsement deal, which has been good for the company. Their online sales were up 31 percent over the previous year according to one estimate, and Bloomberg reported that Nike's stock price had recovered from a temporary dip in the immediate aftermath of the announcement of the deal.", "America's Last Line of Defense is a political trolling misinformation network that bill themselves as purveyors of \"satirical\" fiction aimed at mocking conservative political viewpoints.", "Kochkodin, Brandon.   \"Nike's Stock Regains Ground After Kaepernick Ad Controversy.\"\r\n    Bloomberg.   10 September 2018.", "Martinez, Gina.    \"Despite Outrage, Nike Sales Increased 31 Percent After Kaepernick Ad.\"\r\n    TIME.  10 September 2018.", "Associated Press.   \"Colin Kaepernick Has New Deal with Nike.\"\r\n    3 September 2018.", "Associated Press.  \" Colin Kaepernick's Nike Deal Prompts Flurry of Debate Online.\"\r\n    4 September 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]