["By Angelo Fichera", "Posted on May 31, 2018", "Q: Is Jeff Bezos running full-page “Michelle Obama for President” ads on Amazon?", "A: No. Amazon vendors sell items expressing support for numerous possible 2020 presidential candidates, including Obama.", "Amazon shoppers have the luxury of variety, including when it comes to political apparel. Among T-shirts available on the website, for example, are options for those supporting Donald Trump’s reelection campaign (“Make Liberals Cry Again,” one says) and, yes, some for voters hoping Michelle Obama will seek the presidency in 2020.", "But there’s no evidence that Amazon founder and CEO Jeff Bezos has “given Michelle Obama his full support for a 2020 Presidential run by placing full page ‘Michelle Obama for President’ ads on the Amazon website,” as Your News Wire claimed in a story shared on Facebook.", "The May 28 article, headlined, “Jeff Bezos: Michelle Obama Will Be Our Next President,” also has been reproduced as videos on YouTube.", "The false statement about Bezos is not supported by the rest of the story, which was copied wholesale from a post on The Unz Review that doesn’t say Bezos published ads supporting an Obama candidacy. Instead, that website asked: “Why is Amazon running a full [web] page of ‘Michelle Obama for President’ T-Shirts?”", "It’s true that such shirts are available on Amazon, where individuals and businesses sell millions of products to customers. The specific Obama T-shirt pictured on Your News Wire and Unz Review has been sold by the online shop Brave New Look since September 2015, according to the product description. The company, one of the many independent vendors on Amazon, sold shirts with the same design for Obama’s supporters during the 2016 election.", "In fact, as of May 31, a search for “Michelle Obama 2020” on Amazon produced 471 results for shirts, socks, mugs and other items being sold by different vendors. But those product listings don’t mean that Bezos is advertising for Obama, or urging her to run for president.", "On the same day, a search for “Donald Trump 2020” on Amazon returned more than 600 results, including shirts, magnets and “Make America Great Again” hats. We also found 2020 T-shirts on the site for Republican Sen. Ted Cruz of Texas and Democratic Sen. Cory Booker of New Jersey. That doesn’t mean Bezos is backing them as presidential candidates, either.", "It’s worth noting that Obama has said she has no intentions of running for the highest office — a fact that receives only a passing mention in the Unz Review and Your News Wire posts (“She says she’s not interested, but I’m not buying it,” the author says).", "In April, at the Simmons Leadership Conference, Obama said: “The reason why I don’t want to run for president … is that, first of all, you have to want the job. You just can’t say, ‘Well you’re a woman, run.’”", "“I have never had the passion for politics, I just happened to be married to somebody who has the passion for politics,” she added. “Just because I gave a good speech and I’m smart and intelligent, doesn’t mean that I should be the next president.”", "And while Bezos and Trump have publicly criticized each other over the years, we could find no record of the Amazon chief making any public remarks about the former first lady potentially challenging the president in the next election.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "Adl-Tabatabai, Sean. “Jeff Bezos: Michelle Obama Will Be Our Next President.” Your News Wire. 28 May 2018.", "Kiely, Eugene and D’Angelo Gore. “Trump’s Amazon Attack.” FactCheck.org. 5 Apr 2018.", "“Michelle Obama speaks at Simmons College Leadership Conference in Boston, MA. 4.5.18.” Tech View. YouTube.com. 5 Apr 2018.", "Whitney, Mike. “Why Is Amazon Running a Full Page of “Michelle Obama for President” T-Shirts?” The Unz Review. 25 May 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]