["The infographic was published here on March 13, 2020 on a Facebook page called “Systemhub Distribution Inc”.", "The post claims that COVID-19 symptoms last for nine days, starting with a fever and a mild sore throat, and ending with a “messy fever” and difficulty breathing.", "Below is a screenshot of the post, which has been shared more than 7,000 times:", "A similar infographic crediting “SystemHUB” was also shared in separate Facebook posts here and here.", "The infographic is misleading; health experts say COVID-19 symptoms and the time of their onset vary, and warned against such self-check symptom lists.", "“There is a lot of variability in the symptoms and in the length of time someone is sick,” Dr. Edsel Maurice Salvana, an infectious diseases expert at the University of the Philippines' Institute of Molecular Biology and Biotechnology, told AFP in a Facebook message on March 19, 2020.", "Salvana added that following such misleading timelines may confuse people with flu symptoms and urged people to seek professional advice when unwell.", "International health authorities have also released information on coronavirus symptoms that is contrary to the timeline in the misleading posts.", "The US Centers for Disease Control and Prevention states here that COVID-19 symptoms “may appear 2-14 days after exposure” and that \"illnesses have ranged from mild symptoms to severe illness and death\".", "The World Health Organization also stated here that “some people become infected but don’t develop any symptoms and don't feel unwell. Most people (about 80%) recover from the disease without needing special treatment. Around 1 out of every 6 people who gets COVID-19 becomes seriously ill and develops difficulty breathing.”", "Meanwhile, as of March 23, 2020, the number of COVID-19 deaths surged past 16,100, with over 361,500 infections reported globally, according to this AFP report.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]