["The captions in the posts, such as this one, claim the road connects three cities in West Java province in western Indonesia.", "Below is a screenshot of the post.", "The Indonesian-language caption in the post reads: “This is the coolest toll road in Indonesia, Cileunyi-Sumedang-Dawuan, which splits a mountain and goes through a mountain. Only happens in the era of #Jokowi.”", "Widodo is popularly known in Indonesia as Jokowi. He won a first term as president in 2014, and is seeking a second term in national elections to be held on April 17, 2019. Here is the Indonesian election commission’s website with details on the election.", "The caption in the misleading post urges people to vote for Widodo, who is number one on the ballot, in the election.", "Part of it translates to English as:\n\t“Let’s vote No 1\n\tONLY NO 1 \n\tJust NO 1”", "Other Facebook posts, such as here and here, have the same photo claiming the road is in West Java and also voice for Widodo ahead of the election.", "The same image with the same claim and calls for supporting Widodo are also on Twitter, including here and here.", "AFP published a fact-check on February 14, 2019, about the same image when it circulated on Indian social media claiming the road was a national highway in western India. AFP determined then the road is the Mersin-Antalya Highways in Turkey. Here is the AFP blog post.", "Here is the Google map satellite image of this specific part of the road in Turkey.", "Below is a side-by-side comparison of the satellite image and the photo used in the misleading Indonesian Facebook posts. AFP has circled key features that are the same:", "There is actually a toll road being built in West Java linking the three cities referred to in the misleading Indonesian posts. Here is a Jakarta Post report on that road project, and here is an official government website about it.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]