["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On Monday, \"Vanity Fair\" introduced the world to Caitlyn Jenner. That same day, ESPN announced it would honor Jenner, the transgender gold medal-winning Olympian formerly named Bruce, with the Arthur Ashe Courage Award.", "On Monday, Vanity Fair introduced the world to Caitlyn Jenner.", "That same day, ESPN announced it would honor Jenner, the transgender gold medal-winning Olympian formerly named Bruce, with the Arthur Ashe Courage Award. The presentation is scheduled for July 15 at ESPN’s awards show, The ESPYs.", "\"Bruce has received many accolades over the years for being one of the greatest Olympians of our time but The ESPYS are honored to celebrate Bruce becoming Caitlyn,\" said ESPN executive producer Maura Mandt. \"She has shown the courage to embrace a truth that had been hidden for years, and to embark on a journey that may not only give comfort to those facing similar circumstances, but can also help to educate people on the challenges that the transgender community faces.\"", "That didn’t sit well with many people, who thought there were more deserving winners.", "Some thought Lauren Hill, a 19-year-old college basketball player who died of cancer, should have won.", "A Facebook meme, meanwhile, said the runnerup was an Iraq war veteran who lost his arm and leg defending the United States. When last we looked, it had been shared more than 100,000 times. Here it is:", "\"Caitlyn Jenner won the Arthur Ashe Courage Award,\" it reads. \"The runner-up was this guy: Army veteran Noah Galloway, who lost an arm and leg to a roadside bomb in Iraq, and now competes in Crossfit events, runs marathons and competed in the 58-hour Death Race.\"", "People are obviously free to debate who should have been selected, whether it’s Galloway, Hill, Jenner or any number of athletes.", "But the idea that Galloway was runnerup to Jenner is bunk.", "In a statement provided to MTV News, ESPN said there was no runnerup. There is \"no such thing as a runnerup for the three major awards,\" a spokesman told MTV, referring to the Arthur Ashe Courage Award, the Pat Tillman Award for Service and the Jimmy V Perseverance Award.", "ESPN put out a follow-up statement on the Arthur Ashe Courage Award two days after announcing Jenner as the recipient. It reads:", "\"The Arthur Ashe Courage Award is meant to honor individuals whose contributions transcend sports through courageous action. Sometimes that courage is demonstrated over the course of a lifetime and sometimes it is demonstrated in a single act that shines a light on an important contemporary issue.  At all times, there are many worthy candidates. This year, we are proud to honor Caitlyn Jenner embracing her identity and doing so in a public way to help move forward a constructive dialogue about progress and acceptance.\"", "Several websites, from Snopes, to Deadspin to the Washington Post, have reached the same conclusion as PunditFact: Galloway is a real person, but this runnerup story is bogus. The claim rates Pants on Fire.", "Vanity Fair, \"Introducing Caitlyn Jenner,\" June 1, 2015", "ESPN, \"Caitlyn Jenner to be Honored with the Arthur Ashe Courage Award at The 2015 ESPYS on ABC July 15,\" June 1, 2015", "MTV, \"You Can Stop Sharing That Meme: ESPN Confirms There Was Never A ‘Runner-Up’ For Caitlyn Jenner’s Arthur Ashe Award,\" June 3, 2015", "Fox News, \"Anger over Caitlyn Jenner being chosen over Lauren Hill for ESPY courage award,\" June 3, 2015", "ESPN, \"ESPN’s Statement on Caitlyn Jenner’s Honor,\" June 3, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]