["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On Dec. 11, 2020, a Twitter user posted a new permutation of a conspiracy theory about Dominion Voting Systems, the technology firm that provided voting systems in multiple U.S. jurisdictions in the November 2020 election, and which has also been the target of a disinformation campaign falsely claiming its systems were used to perpetrate widespread voter fraud.", "One of the narratives in the election fraud conspiracy theory holds that voting machines provided by Dominion switched votes from ballots cast for U.S. President Donald Trump to his challenger, Joe Biden, who is now president-elect. Trump has refused to accept his electoral loss, and has perpetuated the lie that Dominion machines were used en masse to flip votes.", "Hence, more than a month after Biden was declared winner of the election, conspiracy theories continued to flourish. In this case, a Twitter user falsely claimed that Dominion is owned by a member of Biden family, namely his nephew. But the tweet in question is nothing but a patchwork of misleading screenshots and assumptions, based on people sharing a common surname. We cropped the user's name out below:", "The screenshots in the meme above contain what appear to be the professional biographies of two men, Stephen Owens and R. Kevin Owens, neither of which mentions Dominion.", "The meme included in the tweet points to President-elect Biden's sister and campaign manager Valerie Biden Owens, with the alleged clincher being that Stephen Owens, a co-founder of Staple Street Capital, an investment firm that owns 75% stake in Dominion, shares a surname. However, \"Owens\" is a common last name, so that hardly serves as proof at all.", "Valerie and her husband, John T. Owens, have three children, none named Stephen. A spokesperson for Staple Street confirmed in an email to Snopes that Stephen Owens has no relation to the Biden family.", "And although the meme includes mention of R. Kevin Owens, an attorney who is related to Valerie's husband, we see no connection between this person and Dominion.", "In other iterations of this conspiracy theory, the voting systems company has been falsely linked to deceased Venezuelan President Hugo Chavez, as well as various Democratic politicians, including U.S. House Speaker Nancy Pelosi, California U.S. Sen. Dianne Feinstein, and the Clinton Foundation, the charitable foundation run by former President Bill and Secretary of State Hillary Clinton.", "Trump's own administration has undermined his post-election disinformation blitz by stating the November 2020 election was \"the most secure in American history.\"", "\"There is no evidence that any voting system deleted or lost votes, changed votes, or was in any way compromised,\" the Cybersecurity and Infrastructure Security Agency, which is a component of the U.S. Department of Homeland Security, said in a Nov. 12, 2020, statement.", "Updated to note that a Staples Street representative confirmed Stephen Owens isn't related to the Bidens.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]