["The image was published here on Facebook on November 16, 2020.", "The image shows human remains under a slab of stone. The post appears to have been taken from a tweet by CNN, which was originally published in May 2018.", "The tweet reads in part: “Archaeologists working at the ancient Roman city of Pompeii, Italy, uncovered the remains of a 30-year-old man who appears to have survived the initial eruption of Vesuvius in 79 A.D., only to be killed when he was struck by a large slab of stone.”", "The Facebook post’s caption reads: “17 Hilarious Images That Feel More Like A Looney Tunes Cartoon Than Real Life - rnkr.co/looney-tunes-logic-pictures-funnyWH”.", "The image was also shared in Facebook posts here, here, and here alongside a similar claim.", "It was also shared here and here on Twitter alongside a similar claim.", "The claim is misleading.", "In a press release published on the Archeological Park of Pompeii’s website, the preliminary hypothesis was that the man had been crushed by the stone, given that the upper part of the thorax and the skull of the body had not been discovered in Regio V, a Pompeii excavation site.", "“This preliminary hypothesis arose from the observation of the position of the boulder compared to the empty space of the body impressed into the cinerite,” the press release reads.", "Those upper parts of the body were later found, leading investigators to conclude that the man had died by asphyxiation from the pyroclastic flow -- the masses of hot rock fragments, gases and air which move rapidly following a volcanic explosion.", "The press release goes on: “His death was presumably not, therefore, due to the impact of the stone block, as initially assumed, but likely to asphyxia caused by the pyroclastic flow.", "“The identified skeletal remains consist of the upper part of the thorax, the upper limbs, the skull and jaw. Currently undergoing analysis, they display some fractures, the nature of which will be identified, so as to be able to reconstruct the final moments in the life of the man with greater accuracy.”", "In an update, this article published by CNN on July 1, 2018, reported on the new findings, clarifying that the Pompeii victim was not crushed by a stone block.", "The new findings were also reported by Italian news agency ANSA on June 28, 2018.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]