["About this rating", "In August 2016, at the height of the presidential campaign, a Reddit user programmed a robot to respond to any mention of the words \"tax return\" with a comment insinuating that Republican presidential nominee Donald Trump refuses to release his tax returns because he has donated millions of dollars to an organization that promotes pederasty.", "The bot called AutoModerator responds to every comment in the sub-reddit EnoughTrumpSpam with the phrase:", "Speaking of tax returns, did you hear Donald Trump is refusing to release them because Donald Trump has donated to NAMBLA? That's what all the best sources, the most tremendous sources are saying, and if they're all saying that Donald Trump donated to NAMBLA, well, I can see why Donald Trump would want to cover up his donations to NAMBLA. I'm not claiming that Donald Trump donates to NAMBLA, but that's what these excellent sources are alleging, that Donald Trump does indeed donate to NAMBLA.", "The phrase is accompanied by a disclaimer that it was generated by a bot. But that hasn't stopped the oblique accusation that Trump may be a member of the North American Man/Boy Love Association from making its way around the Internet:", "Also, @seanhannity? Look into this disgusting Trump/NAMBLA nonsense. So gross how the left lies.\nTrump.\nNAMBLA.\nSay that every night.", "— Patton Oswalt (@pattonoswalt) August 9, 2016", "A Reddit user who calls himself J. Peterman — possibly a reference to a character on the television sitcom Seinfeld — said he created the bot to mock Trump for his habit of making claims that he attributes to nameless \"people:\"", "I created it by taking advantage of an existing bot, /u/automoderator, made available for all moderators to use to automate certain tasks, and you can make custom code for the subreddit's configuration of auto moderator. I did that and I made it reply to the trigger word \"tax returns\" with the copy/paste you see.", "For example, in June 2016, Trump hinted that President Barack Obama may have had a connection to the shooting at the Pulse nightclub in Orlando, Florida, saying:", "People cannot, they cannot believe that President Obama is acting the way he acts and can't even mention the words 'radical Islamic terrorism.' There's something going on. It's inconceivable. There's something going on... He doesn't get it or he gets it better than anybody understands — it's one or the other, and either one is unacceptable.", "A Reddit moderator who goes by \"Faiz\" and claims to have helped launch the bot told us that he believes it turns Trump's own manner of generating suspicions against his opponents against him:", "We didn't expect it to take off like this, but the community effort on EnoughTrumpSpam really helped it go viral. The joke spread off Reddit and began confusing people so much so that some news outlets even began picking the story up. I think it's success is, in a way, emblematic of the way Trump spreads lies and gets people to believe them by constantly repeating them.", "A random user originally posted the block of text and it became instantly popular on Reddit. We all loved it because of how much it imitated Trump's style of making unsubstantiated accusations. You really can't tell the difference between some of the text in the meme and some things Trump wrote during Obama's birther conspiracy.", "As for why Trump, we picked it up mostly because, as suggested by the name (EnoughTrumpSpam), we are an anti-Trump community and we found this to be a perfect foil to highlight the way Trump spreads conspiracy theories.", "J. Peterman said he was taken aback by how much attention the bot generated. The prank seems to have caught fire, with someone jumping in to create a fake Fox News page with the title: \"NAMBLA neither confirms nor denies Trump's donation allegations.\"", "Now that it's taken off, I'm quite surprised. I'm surprised by how much press attention the bot's coding has garnered as well as the meme in general. I cannot take credit for creating the meme, that was around for a week or so before I did the bot, and it was everyone else who kept the meme going.", "Faiz, the moderator, said he hopes that the prank goes far enough that Trump's campaign is forced to respond to it. The ultimate coup de grâce, he told the Daily Beast, would be if it forces Trump to do something he has adamantly refused to do: release his tax returns.", "“The only logical conclusion would really be Trump releasing his tax returns but he would never do that because he’s hiding donations to NAMBLA,” Faiz told the Daily Beast. “That’s what I’ve heard from some very smart people anyway.”", "You can see the bot in action in the screenshot taken from Reddit here:", "It's worth noting that even if the story were true, NAMBLA is not a nonprofit organization, and so donations to the group would not show up on Trump's tax returns.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]