["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Texas Gov. Rick Perry, who has called for President Barack Obama to dispatch more troops to the Texas-Mexico border, told a national TV audience last week that violence in Mexico has seeped into El Paso, across the Rio Grande from troubled Ciudad Juarez.", "\"You’ve got bullets hitting the city hall in El Paso,\" Perry said in a July 28 interview with Greta Van Susteren of the Fox News Channel. \"You’ve got bombs exploding in El Paso.\"", "Two days later, Perry spoke in a similar vein during a visit to Laredo. \"When a car bomb goes off in El Paso ... we know there's a (security) problem,\" said Perry, according to KGNS-TV, a Laredo station.", "The threat of border spillover violence is a simmering topic. In June, for instance, PolitiFact Texas found Barely True U.S. Sen. John Cornyn's statement that spillover violence was \"real and escalating.\"", "But bullets and bombs in El Paso?", "Indeed, bullets fired on the Mexico side of the border struck El Paso City Hall on June 29. According to the El Paso Police Department, one bullet traveled through a ninth-floor window and an interior wall before lodging in a picture frame. Stucco walls of the government building were struck by an additional six rounds, the police said. Nobody in El Paso was hurt.", "\"Investigators believe that the rounds may be related to (a shooting incident) that occurred in Juarez,\" a police department press release said. \"El Paso City Hall does not appear to be the specific target of these rounds.\" Darrel Petry, spokesman for the department, told us the Juarez incident involved an attack on Mexican federal agents.", "We asked Petry if, as Perry says, bombs are exploding in El Paso. Petry replied: \"I am not aware of any bomb going off in El Paso.\" If that had happened, he said, \"I think I would have put the press release out.\"", "Perry spokeswoman Katherine Cesinger, responding to our request for information, said in an e-mail that violence in northern Mexico has continued to escalate \"and presents a clear and present threat to border communities.\" She noted that, in the interview with Van Susteren, Perry also mentioned the assassination of a Tamaulipas gubernatorial candidate this summer. Rodolfo Torre Cantu was shot and killed near the airport in that state's capital, Ciudad Victoria, about 200 miles from the Texas border city of Brownsville.", "As for bombs, Perry \"also made reference to a car bomb that was detonated by cartel members a few weeks ago in Juarez just across from El Paso,\" Cesinger said. On July 15, a car bomb was set off in Ciudad Juarez's downtown, killing several people.", "The Associated Press quoted authorities saying the July 15 explosion was in retaliation for the arrest of a top leader of the La Linea gang, which works for the Juarez drug cartel. The bomb, which blew up a parked car, was described by the AP as bringing \"a new dimension of terror\" to the Mexican drug wars. The Washington Post reported: \"The assailants drew police and medical workers to the scene by leaving a bound, wounded man in a police uniform near an intersection and then calling in a false report that an officer had been shot.\" The Post and other news outlets said the bomb was then set off by a cell-phone signal.", "The Juarez-based U.S. consulate's office closed July 30 \"to review its security posture,\" according to a message posted online by the office. \"American citizens are advised avoid the area around the Consulate General until it reopens.\" In March, a consulate employee and her husband were gunned down as they drove in their car about a block from the U.S.-Mexican border bridge on a major Juarez thoroughfare.", "All in all, Perry’s correct that bullets coming from across the border hit El Paso’s seat of city government. No bombs have exploded in El Paso, however, though one went off in Juarez.", "We rate Perry’s statement Half True.", "The Associated Press, news article, \"Car bomb in Mexican drug war changes ground rules,\" July 15, 2010 (accessed Aug. 2, 2010)\n\nBloomberg News, news article, \"Mexican Governor Candidate Assassinated in Tamaulipas as Drug Fight Rages,\" June 28, 2010 (accessed Aug. 3, 2010)\n\nConsulate General of the United States, \"Warden Message,\" July 29, 2010 (accessed Aug. 2, 2010)\n\nE-mail, response to PolitiFact Texas, Katherine Cesinger, deputy press secretary, Gov. Rick Perry, Aug. 2, 2010\n\nInterview, Darrel Petry, public information officer, El Paso Police Department, August 2, 2010\n\nThe Fox News Channel, transcript, \"On the Record With Greta Van Susteren: exas Gov. Perry: Passing Immigration Laws for Naught If You Don't Secure the Border,\" July 28, 2010 (accessed Aug. 2, 2010)\n\nKGNS-TV Pro8 News, Laredo, news report, \"Governor Perry Addresses Border Issues,\" July 30, 2010 (accessed Aug. 3, 2010)\n\nMexico's Index, \"Distance Between Mexican Cities,\" accessed Aug. 4, 2010\n\nUSA Today, news article, \"Mexican president heads to site of slayings,\" March 16, 2010 (accessed Aug. 2, 2010)\n\nThe Washington Post, news article, \"Ciudad Juarez car bomb shows new sophistication in Mexican drug cartels' tactics,\" July 22, 2010 (accessed Aug. 2, 2010)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]