["“Kashmir people in flight to Rahul: Modi is doing good for us. Why do you want to visit Kashmir and trouble us. Please go back.!”", "A video of a passenger inside a plane speaking to Rahul Gandhi has been shared widely on social media platforms with the above claim which says that the people of Kashmir are asking Gandhi to ‘go back’ as ‘Modi is doing good’ for them. It may be noted that the backdrop of the narrative is the recent move by the Central government to abrogate key provisions of Article 370. It may be noted that the video is recent, but has been shared with a false narrative.", "👇Kashmir people in flight to Rahul: Modi is doing good for us.", "Why do you want to visit Kashmir and trouble us. Please go back.!", "Copy, Ràj B Kaippallil", "Posted by Ajith Krishnan Kutty on Wednesday, August 28, 2019", "The above post, by an individual user, has been shared more than 150 times. The video has been posted by several individual users with identical text.", "The duration of the video clip is 29 seconds. In the video, the woman seen in the frame can be heard saying to Mr. Gandhi in Hindi, “Young children are unable to step out of their homes. My brother is a heart patient. For ten days, he could not visit the doctor. We are facing many problems.” (translated). The video has also been posted on Twitter.", "Is it true❓❓ Kashmir people in flight to Rahul: Modi is doing good for us. Why do you want to visit Kashmir and trouble us. Please go back.! pic.twitter.com/LIi1XeIxki", "— Lakshmisha Achar (@LakshmishaAChar) August 27, 2019", "While this video is recent, it has been floated with a false narrative. The woman is not asking Rahul Gandhi to ‘go back’ but is narrating the plight of Kashmiris due to the ongoing lockdown.", "Through a simple Google search using specific key words, Alt News found several news reports. The video was taken on the flight from Srinagar to New Delhi when Rahul Gandhi, along with other leaders of the opposition, was turned back from Srinagar by the administration after the latter had sought to visit the state following the recent developments.", "The same video was tweeted by Priyanka Gandhi Vadra on August 25 with the words, “How long is this going to continue? This is one out of millions of people who are being silenced and crushed in the name of “Nationalism”.", "How long is this going to continue?This is one out of millions of people who are being silenced and crushed in the name of “Nationalism”.", "For those who accuse the opposition of ‘politicising’ this issue: https://t.co/IMLmnTtbLb", "— Priyanka Gandhi Vadra (@priyankagandhi) August 25, 2019", "It may be noted that in the video, the woman can be heard saying, “Our children have not been able to move out of their houses. My brother is a heart patient. He could not see the doctor for 10 days. We are in trouble.” (translated). It is evident that she is essentially narrating the plight of Kashmiris after the Union government’s dramatic move on Article 370. There is no reference to PM Modi anywhere in the video clip, and Rahul Gandhi is not asked to “go back”. The narrative with which the video has been shared on social media is misleading and false.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]