["Although the claim varies from post to post, the message is essentially the same: wall or house geckos should be killed because they are dangerous. This danger supposedly stems from geckos carrying lethal germs.", "Take this Facebook post here, shared more than 42,000 times, which warns that toothbrushes left out overnight are at risk of “toxic” bacterial contamination if licked by a “lizard”. The image it uses is of a gecko.", "Another version of the claim here describes how an unnamed family from an undisclosed country supposedly died after eating soup that contained the remains of a gecko which had climbed into the pot where its poison “leached” into the food.", "Meanwhile, posts like these here and here cobble these versions of the claim together and add a third -- that geckos crawl into kettles and poison the water.", "Finally, these two pest control businesses here and here offer equally strident views about the dangers of geckos and advise they be eradicated.", "The claims are false and the truth is that geckos pose no threat to people, according to two experts contacted by AFP.", "Dr Jeanne Tarrant, programme manager for the Threatened Amphibian Programme at the Endangered Wildlife Trust in South Africa, said in an email that geckos are not harmful to humans and “actually provide a service by eating insects and spiders around your house”.", "“Humans and house geckos have been living alongside each other for hundreds if not thousands of years, with no detriment to humans. It really would not be recommended to try and eliminate them from your home.”", "Professor Aaron M. Bauer, a biodiversity specialist at Villanova University in Pennsylvania, United States and a world authority on geckos -- he has a species named after him -- echoed Tarrant’s comments.", "Biting, he said, is highly unusual in geckos and, in any event, nothing more than an unpainful nip on the off-chance you try to handle one.", "Salmonella transmission is similarly unlikely, he explained. “Geckos, like many reptiles, can carry salmonella although such transmission is not common and it is easily avoided. Geckos are probably less likely to transmit salmonella than other reptiles that have larger, wetter faecal material.", "“Regarding the toothbrush, if you found gecko faeces on it you should wash it off, just as you would if you found any foreign matter on it.”", "On the topic of salmonella, the Centers for Disease Control and Prevention offer tips here to avoid infection. One piece of advice is not to kiss lizards -- the same goes for “cats, dogs, chickens, turtles … or other pets and animals”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]