["The misleading image and claim have been posted repeatedly on Facebook, for example here on April 17, 2019, where it has been shared 11,000 times.", "The post’s caption says: “Mega wati acknowledges that Prabowo wins”.", "Below is a screenshot of the post:", "“Mega wati” is a reference to former president of Indonesia Megawati Sukarnoputri, who is the chairwoman of the Indonesian Democratic Party of Struggle (PDI-P), the party to which Widodo belongs.", "The misleading image shows Sukarnoputri wearing white and speaking into a microphone. Here is a photo of Sukarnoputri on her party’s official website.", "The logo of local broadcaster CNN Indonesia can be seen in the bottom right hand corner of the misleading Facebook image.", "The banner running across the bottom of the image says: “PDI-P COMMENTS ON QUICK COUNTS RESULT”.", "PDI-P-backed candidate Widodo -- known popularly as Jokowi -- is projected to beat Subianto in Indonesia’s April 17 presidential election, according to pollsters’ “quick counts” results, AFP has reported here.", "Subianto has claimed victory in the poll, the same AFP story reported.", "A Google reverse image search found that the misleading image is actually a screenshot of this April 17 CNN Indonesia video, posted on the broadcaster’s official YouTube channel.", "The YouTube video’s headline in Indonesian reads: “Megawati Praises Prabowo’s ‘Victory’ Speech About Quick Count”.", "The first paragraph of the clip’s extended caption says: “Indonesian Democratic Party of Struggle (PDIP) chairwoman Megawati Sukarnoputri praises presidential candidate number 02 Prabowo Subianto’s speech in which he called his cadres to remain calm in responding to unofficial results of the 2019 general elections.”", "The misleading Facebook photo is a screenshot of the clip at 1:09.", "The image below compares the misleading Facebook photo and a screenshot of the clip at minute 1:09:", "At 1:09, Sukarnoputri is saying: “... monitoring the process of vote counting which is still ongoing”.", "The vote tally across the bottom shows Widodo with 43.01 percent of the vote and Subianto with 56.99 percent of the vote. In the original CNN video, it says “SUMATERA” across the top of the vote tallies -- a reference to a large island in the west of Indonesia.", "The word “SUMATERA” has been obscured in the doctored Facebook image.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]