["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Barack Obama made his most direct case for the Democratic nomination at a speech on Jan. 30, 2008, in Denver. He criticized fellow Democratic candidate Hillary Clinton's candidacy, arguing that he represents a more dramatic distinction with John McCain, the apparent Republican front-runner after winning Florida's primary.", "In making his argument, Obama attacked Clinton for voting with Republicans on national security issues, among other things.", "Among Obama's points: \"It's time for new leadership that understands that the way to win a debate with John McCain is not by nominating someone who ... agreed with him by voting to give George Bush the benefit of the doubt on Iran.\"", "On the issue of Iran, Obama is referring to a vote in September 2007 on a measure known as the Kyl-Lieberman Amendment, which declared the Iranian Revolutionary Guard to be a terrorist organization.", "Clinton voted in favor of the amendment, which McCain co-sponsored.", "Obama advisers argued at the time that the Kyl-Lieberman amendment could be used to justify a military attack on Iran.", "We previously fact-checked the advisers' claim that Kyl-Lieberman was a \"blank check\" for the use of force in Iran. We found that expert opinions were split. Some said the legislation gave no new authority for the use of force in Iran. But others said the Bush administration would point to the legislation as a justification if it wanted to invade Iran, even if the legislation did not specifically condone it. Describing the amendment as \"giving George Bush the benefit of the doubt\" is similar to that argument.", "There are a few other problems with Obama's statement that are worth mentioning. Though McCain co-sponsored the legislation, he missed the vote itself — as did Obama, who was campaigning. Obama said he would have voted against the amendment if he had been present. So though Clinton may have \"agreed\" with McCain on the issue, they did not technically vote the same way on it.", "To say that voting for Kyl-Lieberman is \"giving George Bush the benefit of the doubt on Iran\" remains a contentious issue. But Obama's main point is that Clinton and McCain were on the same side, and that is correct. So we rate Obama's statement Mostly True.", "Hillary Clinton campaign Web site,\n\nSen. Obama's speech in Denver will contain four misleading attacks on Hillary in one sentence\n\n, Jan. 30, 2007", "U.S. Senate,\n\nRoll call vote on Kyl-Lieberman Amendment\n\n, Sept. 26, 2007", "Library of Congress,\n\nCo-sponsors of the Kyl-Lieberman Amendment", "Library of Congress,\n\nA bill to prohibit the use of funds for military operations in Iran", "PolitiFact.com,\n\nThe Blank Check Brouhaha\n\n, Oct. 29, 2007", "This Week with George Stephanopoulos, Interview with John McCain, Oct. 28, 2007.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]