["By Saranac Hale Spencer", "Posted on October 17, 2017", "Q: Did players for the Seattle Seahawks burn the American flag?", "A: No. A widely circulated picture was altered to make it look that way.", "Seattle Seahawks — Did they burn the American flag?", "False stories claiming that Seattle Seahawks players burned the American flag surfaced online after President Donald Trump called on National Football League team owners to fire players who don’t stand during the national anthem before games.", "One story Facebook users flagged as potentially fake news says that Seahawks defensive end Michael Bennett “was captured on camera burning an American flag” while the team remained in the locker room for the national anthem prior to a game against the Tennessee Titans on Sept. 24. A headline on another post says that another Seahawk, “NFL Player Richard Sherman, Who Burned U.S Flag, Has Been Thrown Out From The Team.”", "The Bennett story was based on a photo that was altered to show him holding a burning U.S. flag in a locker room as his teammates, including Sherman, looked on.", "Sherman has not been released from the team. In fact, he was recently featured in an Oct. 13 post on the Seahawks’ website about him visiting a young fan in the hospital.", "The fake image of Bennett was first shared on the Facebook page of Vets for Trump in late September. The post, which the group took down, was up for two days and was shared 10,000 times, Vladimir Lemets, the social media director for Vets for Trump, told FactCheck.org.", "The group later shared a link to an article admitting that the picture wasn’t real, but arguing that it “was an accurate metaphor for what the NFL is doing to America.”", "Weeks after the bogus photo went viral, our readers are still asking about it.", "For the record, the Seahawks posted the original, unedited picture on the team’s official Twitter account on Jan. 3, 2016. It shows Sherman (No. 25) and other Seattle players and coaches watching as Bennett does “a now-traditional post-victory dance” after a win against the Arizona Cardinals. There was no flag involved in the celebration.", "What do you do in the victory locker room? You victory dance.#SEAvsAZ pic.twitter.com/qJoVyG6ZM8", "— Seattle Seahawks (@Seahawks) January 4, 2016", "Bennett is among several players who has silently demonstrated at games during the national anthem. He said at the start of the current NFL season that he would sit for the anthem in order to raise awareness about racism and intolerance.", "Sherman, on the other hand, has said that he doesn’t agree with Bennett and other players who don’t stand during the anthem. Sherman said their message is important, but it is getting lost in the controversy over the anthem.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Washington Post. “Trump’s full speech in support of Luther Strange in Alabama.” YouTube video. 26 Sep 2017.", "“BREAKING: SEATTLE SEAHAWKS MAY BE KICKED OUT OF NFL FOR WHAT THEY DID IN LOCKER ROOM.” Defendrace.co. 10 Oct 2017.", "Vets for Trump. Facebook.com. Accessed 13 Oct 2017.", "Dillingham, Thomas. “The Image Is Photo-shopped, But Veterans Agree, It Is An Accurate Metaphor For What The NFL Is Doing To America.” NationOneNews.com. 10 Oct 2017.", "Seattle Seahawks Twitter feed. 3 Jan 2016.", "Wyche, Steve. “Michael Bennett on why he will continue to sit during anthem.” NFL.com. 14 Aug 2017.", "Wisniewski, Lindsey. “All Seahawks players stand during the national anthem against Rams.” USA Today. 8 Oct 2017.", "“BREAKING: NFL Player Richard Sherman, Who Burned U.S. Flag, Has Been Thrown Out From The Team. Do You Support This?” StateFort.com. Accessed 16 Oct 2017.", "Condotta, Bob. “‘It’s bigger than sports:’ Why the Seahawks decided to stay in the locker room during Sunday’s anthem.” Seattle Times. 24 Sep 2017.", "Lyles, Jr, Harry. “Richard Sherman stands up for Colin Kaepernick, despite disagreeing with how he protested.” SBNation.com. 6 Sep 2017.", "Drovetto, Tony. “Friday Round-Up: Seahawks Cornerback Richard Sherman Visits Local Hospital.” Seahawks.com. 13 Oct 2017.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]