["The videos were published here on Facebook on May 11, 2020. The post has since been shared more than 8,600 times.", "The post features video collages of multiple videos and photos that show; a group of people beating a person lying on a bed; a crying woman with a bruised face and a kitten being violently trampled on.", "The post’s Burmese-language caption translates to English as: “You reap what you sow”.", "The same videos were published here on Facebook with a similar claim.", "The claim is false; the videos and photos all show separate incidents.", "Cat mural video", "A reverse image search of keyframes extracted from the video found this live video published on the Facebook page of Ecuador-based artist Texon-Msc on May 9, 2020.", "Titled: “#noalmaltratoanimal / The cruelty of people has no limits RIP ..... MICHI”, the video shows the hooded artist completing the painting.", "A further keyword search found the mural featured in this May 12, 2020 report by Mexican newspaper El Heraldo de Mexico, headlined “They remember on mural Mishii, the little kitten who was crushed to death by women: VIDEO”.", "Part of the Spanish-language report translates to English as: “A few days ago, a heartbreaking video circulated on social networks that shows three women abusing a cat to death.", "“Days later it was reported that the unfortunate events occurred in 2015 in Honduras, but that was not a pretext for animal rights defenders to show solidarity with the victim. For this reason, the urban muralist ‘Texon’ carried out a work with the face of the little cat with the legend ‘No al maltraro animal’.”", "Below is a screenshot comparison of keyframes from the video in the misleading post (L) and the video in the El Heraldo de Mexico report (R):", "Distressed woman video", "A reverse image search on Google of keyframes extracted from the video showing a bruised woman found a longer version of the footage published here on YouTube on January 19, 2017.", "The video, published by the US television channel KTNV Channel 13 Las Vegas, is titled “Standoff suspect faces sex trafficking, attempted murder charges”. The description reads: “His ex-girlfriend, Angela, says he beat her so badly she feared she was going to die.”", "A keyword search found this report on the KTNV website, which states in part: “Beaten and left for dead. A woman says her boyfriend forced her into prostitution and when she tried to end the relationship, he savagely beat her.", "“Her ex-boyfriend was at the center of a police standoff near Deer Springs Way and Durango Drive Wednesday night. And now Tyree Wright is locked up at the Clark County Detention Center. His ex-girlfriend says he beat her so badly she feared she was going to die.”", "Below are screenshot comparisons of the video in the misleading posts (L) and the KTNV video (R):", "Cat abuse video", "A keyword search found the video showing a kitten being trampled on violently was included in this report by the Malaysian newspaper Berita Harian on May 8, 2020.", "The article is headlined: “Police investigate woman stepping on kittens”.", "It reads, in part: “AMPANG: Police are investigating the brutal behaviour of a group of women who abused a cat by trampling the animal to death.", "\"Ampang Jaya District Police Chief Assistant Commissioner Noor Azmi Yusoff said they received the report and are still investigating.", "\"\"Based on a check, the first police report was lodged at the Seremban District Police Headquarters (IPD) related to Mambau.", "\"\"However, the scene and the suspect have not yet been identified,\" he said in a statement today.", "\"Videos and images that have been viral on Facebook (FB) since yesterday show a kitten trampled by three women inviting netizens' anger.”", "AFP could not locate a credible source for the other video in the misleading posts which shows a group of men beating someone on a bed. It featured on a Canada-based shock site in 2017, with a description unrelated to the above events.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]