["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Philonise Floyd, a brother of George Floyd, and House Speaker Nancy Pelosi of Calif., arrive for a House Judiciary Committee hearing on Capitol Hill on June 10, 2020, in Washington. (Nash/AP)", "Nancy Pelosi honored George Floyd by presenting his brother with an American flag that had flown over the Capitol on the day of Floyd’s death in Minneapolis.", "The flag was not a “special service flag” meant to honor dead veterans or first responders.", "Members of Congress can request Capitol-flown flags through a decades-old program with the Architect of the Capitol.", "Conservative bloggers and social media users are criticizing House Speaker Nancy Pelosi for presenting George Floyd’s family with a flag flown over the U.S. Capitol, wrongly claiming that such an honor is solely reserved for the families of veterans and first responders.", "\"Speaker Pelosi presents a special ‘service flag’ to Mr. Floyd’s family and sparks major outrage,\" said the headline to a June 15 article on Waynedupree.com. Conservative radio host Wayne Dupree has leveled inaccurate allegations against Pelosi before.", "A reader asked us about the headline, which was also flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We found that the headline, which has since been changed, was misleading.", "The flag Pelosi presented was an American flag. It was not a \"special service flag\" that can only be furnished for the families of dead veterans or first responders, as the headline suggested.", "\"Members of Congress do this routinely,\" said Drew Hammill, Pelosi’s deputy chief of staff.", "Dupree told us the article’s author has since changed the headline to remove the reference to service. The body of the article has been similarly changed.", "The new headline is more accurate. \"Speaker Pelosi presents a ‘special flag’ to Mr. Floyd’s family and sparks major outrage,\" it says.", "Similar headlines on other conservative blog sites, including Neon Nettle and InfoWars, more explicitly claimed that the flag was meant for fallen veterans, which is not accurate.", "The article highlights an image that Pelosi, D-Calif., uploaded to Twitter and Facebook after Floyd’s brother Philonise Floyd testified before Congress on June 10 about police mistreatment of black Americans and George Floyd’s death in police custody in Minneapolis.", "The image shows Pelosi and a member of her staff presenting an American flag, folded into a triangle within a display case, to Philonise Floyd and the Floyd family’s attorney, Ben Crump.", "\"Philonise Floyd’s heart-wrenching testimony to @HouseJudiciary left its mark on us all,\" Pelosi wrote on Twitter. \"May this flag, which flew over the Capitol on the day of his brother’s murder, serve as a symbol of our shared commitment to securing justice for George & all victims of police violence.\"", "Philonise Floyd’s heart-wrenching testimony to @HouseJudiciary left its mark on us all. May this flag, which flew over the Capitol on the day of his brother’s murder, serve as a symbol of our shared commitment to securing justice for George & all victims of police violence. pic.twitter.com/Dl3LXDGF7t", "Hammill said congressional requests for Capitol-flown flags are \"a daily thing.\" A decades-old program operated by the Architect of the Capitol lets people purchase flags for a price through their representatives in Congress and fly them over the Capitol.", "The program started in 1937 when a member of Congress asked for a flag that had flown over the Capitol, according to the Architect of the Capitol’s website. The program gets about 100,000 flag requests from Congress each year, the website says.", "Pelosi’s office website has a page devoted to flag requests. It says they can be made on a specific date and in honor of a specific person, event or organization.", "\"Members can fly a flag for any reason they want,\" Hammill said. \"Typically, it is something that is requested quite frequently by constituents, but members themselves can also initiate the request in order to honor an occasion, a family member who passes away.\"", "Pelosi requested the flag for Floyd and was within her authority to do so, Hammill said.", "\"It is not a service flag. It is a flag flown over the Capitol,\" he said, adding that the Capitol-flown flags are not \"reserved to the military\" and the attacks on Pelosi are \"way off-base.\"", "Members of Congress can also give Capitol-flown flags to the families of firefighters, law enforcement officers, ambulance crews and other first responders according to the Fallen Heroes Flag Act of 2016. The law specifies that such flags should be furnished at no cost to the family.", "The Department of Veterans Affairs, which declined to comment, provides no-cost burial flags to adorn the caskets or urns of deceased veterans who served in the armed forces.", "The provision of a flag to honor a death has therefore \"come to represent a veteran funeral rite,\" said John Raughter, a spokesman at the American Legion, a veterans association.", "The action Pelosi took is unrelated.", "The U.S. Flag Code, a set of guidelines for respecting the flag, does not \"prohibit or limit a flag draping the coffin to any specific group,\" Raughter said. \"Additionally, there is no rule about who may receive a flag as a gift.\"", "\"Presenting someone with a flag folded into a triangle and placed into a display case is an honorable way of presenting and maintaining the flag of the United States,\" he said.", "A headline said, \"Speaker Pelosi presents a special ‘service flag’ to Mr. Floyd’s family.\"", "Pelosi honored George Floyd by presenting his brother with an American flag that had flown over the Capitol. The flag was not a \"special service flag,\" nor was the action out of the ordinary.", "American flags are not reserved for honoring military veterans or first responders who died on the job, although they are customarily provided at no cost to the families of such individuals. Members of Congress can request Capitol-flown flags through the Architect of the Capitol.", "Waynedupree.com has since changed the headline to remove the word \"service.\"", "We rate the original headline Mostly False.", "WayneDupree.com, \"Speaker Pelosi Presents a Special \"Service Flag\" to Mr. Floyd’s Family and Sparks Major Outrage,\" June 15, 2020", "Nancy Pelosi on Twitter, June 10, 2020", "House Speaker Nancy Pelosi on Facebook, June 10, 2020", "Congresswoman Nancy Pelosi, \"Flag Requests,\" accessed June 17, 2020", "Architect of the Capitol, \"Capitol Flag Program,\" accessed June 17, 2020", "Sen. Chuck Grassley, \"Q&A: Flags for Fallen Heroes,\" accessed June 17, 2020", "U.S. Department of Veterans Affairs, \"Burial Flags,\" Jan. 9, 2018", "U.S. Department of Veterans Affairs, \"Burial Flags Frequently Asked Questions,\" May 7, 2020", "Congress.gov, \"S.2755 - Fallen Heroes Flag Act of 2016,\" May 16, 2016", "U.S. Code, \"The Flag,\" accessed June 17, 2020", "House Republicans, \"Behind the scenes: getting a flag flown over the US Capitol,\" July 21, 2014", "Snopes, \"Did Pelosi Give George Floyd’s Family a US Flag Meant To Honor Vets?\" June 16, 2020", "The Chicago Tribune, \"Souvenir Flags That Fly Over The Capitol Are A Wink-Of-The-Eye Tradition,\" April 25, 1993", "Email and phone interview with Drew Hammill, deputy chief of staff for House Speaker Nancy Pelosi, June 17, 2020", "Email interview with John Raughter, deputy director of media relations at American Legion, June 17, 2020", "Email exchange with Wayne Dupree, conservative radio host, June 17, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]