["Two videos of a Congress roadshow by Rahul Gandhi were shared by a Twitter handle, @Padhalika. In the video clips, Congress President Rahul Gandhi and AICC general secretary in charge of Uttar Pradesh Priyanka Gandhi were seen standing on a truck and waving at the crowd during their roadshow in Wayanad, Kerala. Mr. Gandhi filed his nomination from the Wayanad constituency on April 4.", "A massive crowd was seen waving different flags at the roadshow including the banner of the Indian National Congress. Pointing out the green-coloured flags seen in the video of the rally led by the Gandhi duo, @Padhalikha said, “There are more Islamic flags at Rahul Gandhi’s rally than Indian flags.”", "There are more Islamic flags at Rahul Gandhi’s rally than Indian flags.", "First partition was done by Jinnah. Second will be done by Rahul Gandhi. pic.twitter.com/6SfPHznjjQ", "— Eminent Intellectual (@padhalikha) April 4, 2019", "In another tweet, which included a video of the same roadshow, @Padhalika said, “Just look at the number of Pakistani/Islamic flags in his rally.” The tweet also warned the people that if Rahul Gandhi comes to power, you will have “500 Kashmirs in entire India”.", "If Rahul Gandhi comes to power. Forget Kashmir.", "You’ll have 500 Kashmirs in entire India.", "Just look at the number of Pakistani/Islamic flags in his rally. pic.twitter.com/80qra2WHSB", "— Eminent Intellectual (@padhalikha) April 4, 2019", "Actress Koena Mitra also posted a photo a rally, where men can be seen holding green coloured flags saying that Rahul Gandhi was welcomed in Kerala with “Islamic flags”.", "First partition was done by Terrorist Jinnah, Next could be Rahul Gandhi. Islamic flags welcomed him to #Kerala. Congress manifesto is pro jihad and anti jawans, anti India. Somebody is working hard for “Gazwa-e-Hind” pic.twitter.com/8YN1Yd5xiP", "— Koena Mitra (@koenamitra) April 4, 2019", "The video was earlier posted by INC’s official Twitter handle on the same day.", "Thousands of people have gathered around Wayanad, Kerala for Congress President @RahulGandhi‘s road show after he filed his nomination. #RahulGandhiWayanad #RahulTharangam pic.twitter.com/cri5zAu8Ru", "— Congress (@INCIndia) April 4, 2019", "The green-coloured flag seen in the video represents the flag of the Indian Union Muslim League (IUML) and NOT the Pakistani flag. The difference between the two flags is clearly visible in the images juxtaposed below.", "Moreover, the flags waved at the rally are also NOT the ‘Islamic flag’ as claimed. In the comparison below, the image on the left is a flag often used by Muslim religious organizations in India. However, the crescent star and the moon are placed on the top-left corner in IUML’s flag whereas the same is placed in the middle in the generic religious banner that is often used in the subcontinent.", "In Rahul Gandhi’s rally, the flag, that be can be seen, has a crescent star and the moon at the top-left corner and thus can be concluded as IUML’s flag and NOT Pakistani flag or the common Islamic banner.", "IUML is one of the six parties in the United Democratic Front alliance, which includes the Congress party. A report published by The Indian Express also stated, “People were seen clicking photos on their mobile phones and waving flags of the Congress party and its ally Indian Union Muslim League (IUML).”", "Alt News found that the image posted by Koena Mitra is old and dates back to January 2016. It pertains to former Kerala Minister PK Kunhalikutty’s rally in Kozhikode, Kerala. He belongs to the Indian Union Muslim League and the men in the picture are IUML cadre holding IUML’s flags and NOT Islamic flags.", "One Facebook user Dhruv Kumar posted images of IUML supporters dressed in green attire with a misleading message, “वायनाड में रैली काँग्रेस की है या #हाफिज_सईद की समझ नही आ रहा (I am unable to understand, is it a Congress’ rally or Hafiz Saeed’s -translated)”", "@squintneon, a Twitter handle quote-tweeted a tweet by the Indian National Congress, which comprised photographs from the same rally, saying, “Notice the green Pakistani flag”.", "Notice the green Pakistani Flag https://t.co/iLgI92IjcD", "— Chowkidar Squinty (@squintneon) April 4, 2019", "Many other individuals on Facebook and Twitter have posted a video of Rahul Gandhi’s rally in Wayanad, Kerala saying, “ये दृश्य पाकिस्तान में किसी जलसे का नहीं केरल में #Wayanad में राहुल की रैली का है। *pappu4pakisthan* Ab Toh Samajh jao (This is not a visual from some celebration in Pakistan. It’s from Rahul Gandhi’s rally in Wayanad, Kerala. At least understand now -translated)”", "In states where IUML has its presence, their supporters are often seen in Congress rallies holding IUML flag and these have been regularly misrepresented as Islamic or Pakistani flags. Earlier, IUML flags were falsely shared as Islamic flags waved by Congress supporters over reports of Rahul Gandhi contesting the election on the Wayanad Lok Sabha seat in Kerala.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]