["About this rating", "Vehicles, mostly pickup trucks flying flags in support of President Donald Trump, were seen driving near a Biden-Harris campaign bus on a highway in Texas. A video showed that at least one truck moved in front of the bus, appearing to slow its speed. A Trump supporter also admitted on Facebook to “slamming” a white SUV that appeared to accompany the campaign bus. The Trump supporters organized in an Alamo City Trump Train Facebook group, where several members discussed being armed.", "Neither Joe Biden nor Kamala Harris were on the bus, as some tweets claimed.", "There are conflicting reports over whether a Biden-Harris rally in downtown Austin was called off because of the incident. However, two other events and a news conference were canceled for “safety concerns.”", "On Friday Oct. 30, 2020, video was shared on social media that showed a Biden-Harris bus surrounded by pickup trucks flying flags in support of U.S. President Donald Trump on Interstate 35 in Texas. A white pickup truck appeared to slowly pull in front of the bus to slow its speed. Seconds later, a dark-colored truck and a white SUV that appeared to accompany the campaign bus can be seen side-swiping each other.", "The SUV appeared to be over the highway road line. However, another angle in a video reposted by NowThis (beginning at 1:20) showed the bus appeared to be changing to the right lane, and when the white SUV attempted to also change lanes, the dark-colored truck sped up and braked behind the bus to not allow the white SUV over. Brake lights are visible on the dark-colored truck at the 1:24 mark in the NowThis video. (An extended video in a newer Snopes story sheds new light on the clash between the two vehicles.)", "The white SUV can be seen in another video sharing a lane with a white truck with Trump flags, and in a different video on Facebook as well. A photograph purported to show the same white SUV with damage after the incident:", "A Facebook user named Eliazar Cisneros posted a video of the \"Trump Train.\" He also claimed to be the driver of the truck that clashed with the white SUV, later making another post, and commenting: \"That was me slamming that fucker.... Hell yea.\" In the same comments, he said, \"he hit me,\" referring to the white SUV, and also said: \"I reacted because he was running me off the road.\"", "Cisneros also reacted with a laughing emoji when someone commented on one of his posts telling him he should have an \"All Lives Splatter\" bumper sticker that also says: \"Keep your ass out of the road,\" referring to past Black Lives Matter protests that have blocked freeways.", "Texas Tribune reported that the FBI is looking into the campaign-bus incident, and that the group of Trump supporters used Facebook to organize their movements: \"Naomi Narvaiz, a Texas Republican Party official in San Marcos, said Trump supporters formed the convoy after learning of the bus’s movements up the interstate on Facebook from fellow supporters in San Antonio.\"", "On Oct. 30, Cisneros posted a link to Alamo Trump City Train, a private Facebook group with about 3,500 members. The group's description read \"We Ride with Pride,\" and said:", "The Alamo City Trump Train is the loud roar of the silent majority. The purpose of the group is to unite patriots from San Antonio and surrounding areas and join together to show our support for President Trump and for conservative values. The group is also meant to give fellow patriots a place to meet and build long lasting friendships with like-minded individuals. With the success of the New Braunfels Trump Train, it’s time for San Antonio to step up and let our city know that WE ARE THE MAJORITY!", "The group was created on Sept. 1, 2020, and as of Nov. 1, it had nearly 300 new posts just in the previous 24 hours, and added 1,032 new members just in the previous seven days.", "On the Alamo City Trump Train YouTube channel, one video specifically highlighted a truck with a trailer with signage reading, \"The Great Awakening\" and \"WWG1WGA.\" Both signs refer to QAnon conspiracy theory slogans, including \"WWG1WGA,\" which means \"Where We Go One We Go All.\" The same truck appeared to show up in another video from a different event with the same QAnon signage. Some trucks also had signage that read: \"Trump 2020 Fuck Your Feelings.\" (Our newer story details much more of the QAnon activity within the group.)", "Eric Cervini posted the video at the beginning of this story. The Tribune reported: \"Eric Cervini, a volunteer for the Biden campaign who grew up in Round Rock and flew in from Los Angeles, said he was driving on I-35 from San Antonio to the next event when he saw a long line of 40-50 vehicles along the side of the highway with Trump and American flags.\"", "KEYE television reporter Jordan Bontke reported: \"The Biden bus has also been closely followed by Trump supporters while on the road, though Texas Democrats insist their presence didn’t affect their decision to call off the downtown Austin rally.\" A story from The Washington Post appeared to report the opposite.", "While the downtown Austin rally did not appear to have been canceled because of the incident, the Tribune reported that \"safety concerns\" were cited as the reason for the cancellation of two campaign events in Pflugerville and San Marcos, as well as a news conference.", "Trump tweeted his approval of the \"Trump Train\":", "CBS DFW reported: \"Rep. Rafael Anchía, a Dallas Democrat who chairs the Mexican American Legislative Caucus, tweeted that the Trump supporters were 'armed' and 'ramming volunteer vehicles & blocking traffic for 40 mins.'\" Cervini also mentioned that the pickup truck drivers were \"armed.\"", "When we initially published this story, we had been unable to find any photographic or documentary evidence that the Trump supporters in the pickup trucks were armed. However, inside the private Facebook group we noted that multiple members made comments that mentioned they were armed. Details and screenshots are available within the newer story.", "Finally, many Twitter users believed that Biden and/or Harris were on the bus. For example:", "However, CBS DFW reported, \"Neither Biden nor his running mate, California Sen. Kamala Harris, were on the bus.\"", "This story is developing and will be updated further should any new evidence come to light.", "Update [Nov. 2, 2020]: Updated with new information. Claim rating revised from \"Mixture\" to \"Mostly True.\"", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]