["About this rating", "Facebook’s rules since 2018 have stated that videos including “live” content cannot be used “to create a music listening experience.” In September 2020, Facebook clarified that the rules were meant to protect copyrighted music, and there would be limitations to recorded music included in live broadcasts and video.", "However, there will not be an outright ban on musical performances on livestreams or in stories, though full-length recorded tracks will be “limited,” and shorter music clips are recommended.", "The language in Facebook’s music guidelines became the subject of some confusion in September 2020 when a terms of service update — effective Oct. 1, 2020, on the social media network — seemed to indicate that the social media network would ban livestreams and videos of musical performances on their platforms.", "Snopes readers shared a number of articles with us that claimed Facebook would limit the ability of bands to promote music on their platforms — including on Facebook Live — which has been popular for concerts during the COVID-19 pandemic. News organizations quoted this particular section from Facebook’s music guidelines:", "You may not use videos on our Products to create a music listening experience", "We want you to be able to enjoy videos posted by family and friends. However, if you use videos on our Products to create a music listening experience for yourself or for others, your videos will be blocked and your page, profile or group may be deleted. This includes Live.", "Since these guidelines were attached to Facebook’s terms of service update, many assumed that meant this rule would take effect on Oct. 1, 2020. But the vagueness of the term, \"music listening experience\" resulted in rumors that were far from the truth.", "We learned that the above guidelines were not new. They had been in place since at least 2018, based on the archived version of the same page.", "On Sept. 11, 2020, Facebook issued a clarification to a May 20, 2020, blog post titled “Updates and Guidelines for Including Music in Video.” They stated:", "We want to encourage musical expression on our platforms while also ensuring that we uphold our agreements with rights holders. These agreements help protect the artists, songwriters, and partners who are the cornerstone of the music community — and we're grateful for how they've enabled the amazing creativity we've seen in this time.", "Our partnerships with rights holders have brought people together around music on our platforms. As part of our licensing agreements, there are limitations around the amount of recorded music that can be included in Live broadcasts or videos.", "We reached out to Facebook, and a spokesperson confirmed that their music guidelines had been in place since 2018. Social media users were mistaking the updates they made to their terms of service for new music guidelines — but there were no new updates to the music guidelines, including a supposed ban on livestreaming music. The spokesperson pointed us to the same blog post that highlighted what was, and was not, permitted:", "Based on the information in the blog post, Facebook is still permitting live musical performances — but with limitations. Those include shorter clips, and cutting back on full-length recordings. They noted that these guidelines \"are consistent across live and recorded video on both Facebook and Instagram, and for all types of accounts.\" A Facebook spokesperson pointed out what some of these limitations could be:", "Although music is launched on our platforms in more than 90 countries, there are places where it is not yet available. So if your video includes recorded music, it may not be available for use in those locations.", "People have access to a library of custom music and sound effects at no cost using Facebook’s Sound Collection. The Sound Collection includes thousands of tracks available to use in the videos you share on Facebook and Instagram without any limits – spanning genres like hip hop, pop, jazz, country, and more.", "Given that Facebook is not actually banning musical performances on its platforms, including through livestreams, but is continuing to implement old policies that have limitations based on copyright agreements, we rate this claim as “Mostly False.”", "Divita, Joe.   \"Facebook Clarifies Livestreaming Music Policy.\"\r\n   Loudwire.   12 September 2020.", "Facebook.   \"Music Guidelines.\"\r\n   Accessed 17 September 2020.", "Facebook. \"Terms of Service.\"\r\n   Accessed 17 September 2020.", "Facebook.   \"Updates and Guidelines for Including Music in Video.\"\r\n   11 September 2020.", "Francey, Matthew.   \"Facebook to Ban Live-Streamed Music Events.\"\r\n   Ministry of Sound.   10 September 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]