["About this rating", "Michael Cohen, former personal attorney to U.S. President Donald Trump, became the focus of renewed scrutiny in February 2019 when he testified before the U.S. House of Representatives Committee on Oversight and Reform.", "This was Cohen's first Congressional testimony since he was sentenced to three years in prison for tax fraud and campaign-finance violations relating to his payment of \"hush money\" to women who alleged they had sexual relationships with Donald Trump before he became president.", "Cohen also admitted he previously misled Congress when he told the House and Senate Intelligence committees that a proposed deal to build a Trump Tower in Moscow, Russia, had fallen apart in January 2016, when in fact negotiations continued until June of that year -- by which time Trump was the presumptive Republican nominee for president.", "Following Cohen's dramatic 27 February testimony, some observers, including Trump himself, attempted to portray Cohen as an agent of former Secretary of State Hillary Clinton who was dishonestly smearing Trump on behalf of the Democratic presidential nominee whom Trump defeated in 2016.", "The president highlighted the links between Clinton and Cohen's attorney, Lanny Davis, even suggesting that the former secretary of state was paying Cohen to provide damning testimony against Trump:", "Michael Cohen’s book manuscript shows that he committed perjury on a scale not seen before. He must have forgotten about his book when he testified. What does Hillary Clinton’s lawyer, Lanny Davis, say about this one. Is he being paid by Crooked Hillary. Using her lawyer?", "— Donald J. Trump (@realDonaldTrump) March 1, 2019", "We couldn't find any evidence that Davis has ever acted as Clinton's personal attorney as Trump alleged, but the ties between Davis and the Clintons are longstanding. He served as a special counsel to former President Bill Clinton during the 1990s, attended Yale law school with Hillary Clinton, and was a frequent public supporter of her 2008 and 2016 presidential campaigns, such as is shown in this July 2016 Fox News panel discussion:", "Against that background, a meme emerged on social media in late February 2019 that claimed an even more direct historical link between Cohen and Clinton, alleging that Cohen had previously served as her personal attorney and was a \"member\" of the Clinton Foundation, a non-profit organization founded by Bill Clinton that has been the subject of numerous conspiracy theories promulgated by right-leaning opponents of the Clintons.", "The meme included a photograph of Hillary Clinton standing alongside two men identified as \"Michael Cohen\" and \"Clinton Foundation Chairman\" along with text proclaiming \"Michael Cohen used to be Hillary Clinton's personal lawyer and was a member of the Clinton Foundation\":", "The man identified as Cohen in the meme is indeed Cohen. The man identified as \"Clinton Foundation Chairman\" is in fact Patrick Kennedy, a Democratic former U.S. representative from Rhode Island and son of the late Democratic Sen. Ted Kennedy. Kennedy has never acted as chairman of the Clinton Foundation.", "The underlying photograph is authentic. Cohen himself tweeted it in June 2014, writing \"Being received by two great Americans ... Hillary Clinton and Patrick Kennedy at the Kennedy Compound\":", "#tbt being received by two great Americans...Hillary Clinton and Patrick Kennedy at the Kennedy Compound pic.twitter.com/z57PXfWxfW", "— Michael Cohen (@MichaelCohen212) June 26, 2014", "The photograph appears to have been taken in 2004 at a fundraising event for Kennedy's re-election campaign, which was attended by then-New York Sen. Clinton as well as Cohen. Greg Ehrlich, who co-chaired the fundraiser in question, later told the Washington Post that “It was an opportunity to say he [Cohen] went to the Kennedy compound. And he loved the Clintons. They were like rock stars. Michael was always a climber. He wanted to be the guy.”", "Although they once attended the same campaign fundraiser, we could find no evidence to corroborate the claim that Cohen ever acted as Hillary Clinton's personal attorney, despite our searching federal and New York state court records as well as news archives that extend back decades.", "During the 2016 presidential campaign, Cohen was publicly hostile towards Clinton, on one occasion tweeting out a meme that included the false claim she had \"murdered an ambassador\":", "NBC/WSJ poll has @realDonaldTrump beating #CrookedHillary on #Honesty & #NationalSecurity. This picture says it all! pic.twitter.com/E9YKIgoqnV", "— Michael Cohen (@MichaelCohen212) June 28, 2016", "On another occasion, Cohen tweeted at Clinton to say \"When you go to prison for defrauding America and perjury, your room and board will be free\":", "Cohen deleted that tweet after he himself was given a three-year prison sentence for tax fraud and campaign-finance violations.", "The Clinton Foundation does not have a membership structure, so it is unclear what the precise meaning is of the claim that Cohen was a \"member\" of the Clinton Foundation, but we also found no evidence that he has ever had any formal or informal association with that organization.", "We contacted representatives for Hillary Clinton, the Clinton Foundation, and Michael Cohen in order to definitively clarify the veracity of the February 2019 meme, but unfortunately none of them responded in time for publication. For that reason, we issue a rating of \"Unproven.\"", "Neumeister, Larry and Tom Hays.   \"Judge Gives Ex-Trump Lawyer Michael Cohen 3 Years in Prison.\"\r\n    Associated Press.   12 December 2018.", "Tucker, Eric et al.   \"Trump's Ex-Lawyer Admits Lies About Russian Real Estate Deal.\"\r\n    Associated Press.   30 November 2018.", "Schwartzman, Paul.   \"Michael Cohen's Secret Agenda.\"\r\n    The Washington Post.   9 February 2019.", "Palma, Bethania.   \"Did Michael Cohen Tweet at Hillary Clinton That Room and Board Will Be Free When She Goes to Prison?\"\r\n    Snopes.com.   22 August 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]