["The photos were published here in a Facebook post on October 3, 2018. It has been shared 108 times.", "Below is a screenshot of the misleading post:", "The post’s Thai-language caption translates to English as: “In Canada, they used pothole stickers to prevent people from driving fast.", "“I wanna tell you that in our country, it’s better because we have real potholes.”", "The post has circulated online since at least 2014, as seen here. It resurfaced here and here in 2020. Some misleading posts compare the purported photos with photos that show real potholes on the street.", "However, the claim is misleading; the photos have circulated in online reports about an advertising campaign since at least December 2017.", "A reverse image and keyword search on Google found all three photos published here on the website for Ads of the World, a creative advertising showcase, in June 2007.", "The caption states: “Pothole Sticker - A large sticker of a pothole was laid on the road creating the illusion of real hotpole. Drivers would see it and slow down to avoid the jerk of their car but would feel nothing. The message “FEELS LIKE PIONEER SUSPENSION” was painted a few meters ahead.”", "According to the article, the campaign was designed by Y&R Everest, an advertising agency based in the Indian city of Mumbai. The group merged with a US-based digital agency VML, which later became VMLY&R in September 2018.", "Below are screenshot comparisons of the images in the misleading Facebook post (L) and the Ads of the World photos (R):", "The three photos also appeared in articles about the same project on other websites of creative advertising agencies, including Adeevee here and The Perfect Media here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]