["About this rating", "Panasonic Japan is producing a limited number of companion robots called Nicobo. And yes, they fart.", "Although the robot has a tail, it's a bit of a stretch to refer to it as a cat.", "It's unknown whether Panasonic will produce more robots for the general public to purchase.", "In mid-February 2021, Panasonic Japan released a video of a little round robot created for the sole purpose of human companionship. The robot's name is Nicobo. It has a child's voice, digital eyes, a tail, and yes, it farts.", "https://www.youtube.com/watch?v=9OuzDxXToHg&feature=youtu.be", "Although we can confirm that Panasonic did create the robot, we can't say Nicobo will be available for purchase to the general public. We also can't say that the robot is a cat, per se. Although it has a tail, it is, as Gizmodo describes it, \"as if someone flipped a bowl over, gave it some animated eyes, a wagging tail, and then wrapped it in an old sock.\"", "Nicobo has a limited vocabulary that expands over time, with limitations. It speaks in Katakoto, the Japanese term for baby talk, so it's never going to carry on a philosophical conversation with you. But as Gizmodo reported, \"its crude mutterings will help reinforce the feeling that it’s genuinely attentive and listening to your feelings, even if it can’t do anything about them. Sometimes that’s all a human needs.\"", "Panasonic is crowdfunding for the production of a limited number of the companion robots, and as of this writing, has exceeded its goal of 10 million yen (just over $95,000 U.S. dollars). Its crowdfunding site says the units will be delivered to prospective buyers by March 2022.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]