["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "One of President Donald Trump’s very first acts was to place a hiring freeze on the executive branch, in a promised show of fiscal responsibility.", "\"This memorandum counters (the) dramatic expansion of the federal workforce in recent years,\" press secretary Sean Spicer told reporters in his first-ever daily press briefing Jan. 23.", "The memorandum, which Trump signed earlier that day, says federal agencies will not fill any vacant positions or create new ones for up to 90 days, or until a plan for reducing the number of federal government employees goes into effect. Military personnel are exempt from the plan, as are any positions deemed necessary for national security and public safety.", "Several news outlets quickly jumped on Spicer’s assertion that the federal workforce has expanded dramatically in recent years, saying it was incorrect. We looked at the data ourselves and found that Spicer is cherry-picking.", "The White House press release about the hiring freeze memorandum offered more detail, saying the federal workforce expanded \"from approximately 1.8 million federal civilian employees during the (Bill) Clinton administration to approximately 2.1 million as of 2016 (an approximately 17 percent increase).\"", "The news release figures appear to come from the Office of Personnel Management, whose data shows an increase from 1.78 million civilian employees in the executive branch (excluding the postal service) at the end of 2000 to 2.08 million at the end of 2014. That’s an increase of about 17 percent. At an increase of roughly 1 percent a year, it sounds like Spicer is exaggerating when he calls it \"dramatic.\"", "However, in choosing to compare the end of the Bill Clinton administration to the end of Barack Obama’s, the new White House is pitting the year with the lowest federal employment since 1950 against a relatively normal year — exaggerating the significance of the growth.", "Counting the employees", "Federal government employment has hovered around 2 million for decades, as shown in the graph below. In fact, the federal government had more employees for about half of the past 70 years than it did in 2014.", "During the Korean War in the 1950s, the government capped employment in the federal workforce at 2 million employees. Even though the cap was eventually lifted, it has remained politically popular to keep the government around the same size, said Paul Light, a professor of public service at New York University.", "The size of the federal government workforce stayed about the same as the country’s population grew. The size of state and local governments ballooned, however, and so have the number of contractors working for the federal government.", "The last concerted effort to shrink the federal government workforce happened under former President Bill Clinton. The end of the Cold War enabled his administration to reduce the workforce from 2.2 million in 1992 to 1.78 million in 2000, with most of the drawdown happening among Defense Department civilian employees.", "\"The Clinton administration was an aberration,\"  Light said.", "When the wars in Iraq and Afghanistan began under former President George W. Bush, the number of civilian defense employees increased again, pushing up the total number of executive branch employees. Obama also added positions in other counterterroism positions and in Veterans Affairs, Light said.", "The number of executive branch employees actually started to come back down, however slightly, in Obama’s second term — from a high of 2.14 million in 2011 to 2.08 million at the end of 2014 — as the country pulled out of Iraq.", "In short, a lot of the reduction in the federal government workforce in the 1990s and subsequent growth in the 2000s had to do with civilian Defense Department employees — many of whom will be likely be exempt from Trump’s hiring freeze memorandum because it excludes positions crucial to national security.", "A federal employee count from another official source, the Bureau of Labor Statistics, is slightly higher than the OPM figures. That’s because unlike OPM, BLS includes postal service employees in its count of the federal civilian workforce.", "Those figures show that the number of federal employees grew slightly under Obama, from 2.78 million employees to 2.8 million between January 2009 and December 2016. That is less than 1 percent growth.", "Going back to the end of the Clinton administration in December 2000, the growth is only slightly more — from 2.75 million to 2.8 million, or just under 2 percent growth.", "So when postal service workers are included, the federal government has barely grown in recent years.", "Light said Trump’s hiring freeze would not really have a significant impact on the size of the federal government. The exemptions to the freeze are so broad that Light predicts it will only affect less than half of the federal workforce.", "\"This is more bluster than impact,\" he said.", "Our ruling", "Spicer said there has been a \"dramatic expansion of the federal workforce in recent years.\"", "A White House news release shows Spicer was referring to the years since the end of the Clinton administration in 2000. The federal civilian workforce has increased at least 17 percent since then, according to OPM data.", "But choosing this particular time frame is disingenuous, pitting an abnormally low point against a relatively normal point. The average size of the federal workforce between 1944 and 2014 was 2.05 million, not a dramatic departure from 2.08 million in 2014.", "Further, a broader set of data from the Bureau of Labor Statistics shows just 2 percent growth over the same time period.", "Spicer’s statement has an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "C-SPAN, White House press briefing, Jan. 23, 2017", "Bureau of Labor Statistics, Employment, Hours, and Earnings from the Current Employment Statistics survey (National), accessed Jan. 24, 2017", "Office of Personnel Management, \"Executive Branch Civilian Employment Since 1940,\" accessed Jan. 24, 2017", "Federal Reserve Bank of St. Louis, display of BLS data, last updated Jan. 6, 2017", "White House, \"President Trump Takes Action: Signs Series of Presidential Memoranda Dealing With Dealing with Trade and Other Issues,\" Jan. 23, 2017", "White House, \"Presidential Memorandum Regarding the Hiring Freeze,\" Jan. 23, 2017", "Washington Post, \"The Trump administration just told a whopper about the size of the federal workforce,\" Jan. 23, 2017", "Email interview, Georgetown University public policy professor Harry Holzer, Jan. 24, 2017", "Email interview, Brookings Institution economics fellow Ryan Nunn, Jan. 24, 2017", "Phone interview, NYU public service professor Paul Light, Jan. 24, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]