["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Larry Parsons, of Fenton, Mich., stands up and shouts as U.S. Rep. Elissa Slotkin speaks during a constituent forum on Dec. 16, 2019, in Rochester, Mich. (Ryan Garza, Detroit Free Press)", "During her re-election campaign, incumbent Democratic Rep. Elissa Slotkin has told voters she has voted in an independent and bipartisan fashion during her first term in Congress.", "Slotkin’s Republican challenger Paul Junge claims Slotkin is misleading voters about her record.", "Congressional experts say the figures Junge and Slotkin have cited are not good measures of ideology or bipartisanship, but independent analyses show Slotkin meets other criteria to back her claim that she is more moderate than her Democratic colleagues and a bipartisan legislator.", "In 2018, Democrat Elissa Slotkin flipped a congressional district Donald Trump won in 2016, unseating the Republican incumbent. Back on the campaign trail, she has told voters in the 8th district that while in Washington, she has worked as an independent and bipartisan lawmaker.", "Slotkin’s Republican challenger Paul Junge — a former prosecutor and TV anchor — disputes that. \"Candidate Slotkin had presented herself as a moderate and as someone who’d be independent-minded but her time in office is making it increasingly clear that no, she is very partisan, voting 96% of the time with Speaker Pelosi,\" Junge said during a Sept. 11 interview on the WDET radio program \"Detroit Today.\"", "Junge points to the fact that Slotkin has voted 96% of the time with House Speaker Nancy Pelosi as evidence that Slotkin is more liberal than her moderate image suggests. Junge has also pointed to the fact that Slotkin has voted 90% of the time with \"The Squad,\" a group of liberal Democratic congresswomen including Reps. Alexandria Ocasio-Cortez of New York, Ilhan Omar of Minnesota, Rashida Tlaib of Michigan and Ayanna Pressley of Massachusetts.", "\"Congresswoman Slotkin's record of voting with Nancy Pelosi 96% of the time and 90% with \"squad\" members like Rashida Tlaib make it clear she has aligned herself with the most radical elements of her party after promising to be a moderate. Any thoughtful examination of her record leads to the conclusion that she puts party over country again and again,\" Rob Wagener, spokesman for the Junge campaign, wrote in an email to PolitiFact Michigan.", "During her interview on \"Detroit Today\" on Sept. 11, Slotkin countered that while in Congress, she has \"voted over 800 times, and 640 of those votes are bipartisan where we’ve got Democrats and Republicans voting for the same bill.\" She has also noted that she has voted against her party 55 times.", "The numbers have changed slightly since the campaign conducted this analysis before Congress’ August recess, but considering Slotkin’s most recent votes generally yields the same result: About 77% of the votes Slotkin has taken during her first term in Congress had the support of at least one Republican member of Congress.", "\"While there are many ways to define bipartisanship, by any measure, Congresswoman Slotkin is among the most bipartisan members of Congress,\" Gordon Trowbridge, spokesperson for Slotkin’s campaign, wrote in an email to PolitiFact Michigan.", "Congressional experts say the raw vote figures cited by Junge and Slotkin offer an incomplete picture of a lawmaker’s record of partisanship, and say Slotkin’s definition of bipartisanship as voting the same way as at least one Republican is not very informative.", "Analysts point instead to other scoring systems that compare lawmakers' voting records with other members of their political party and to their record of collaborating on legislation with members of the other party.", "For Slotkin, who has branded herself as a moderate and bipartisan member of Congress, these indicators show that her record is indeed consistent with her campaign rhetoric, and that Junge’s characterization of her as a liberal Democrat and very partisan is off the mark.", "During her first term in Congress, Slotkin has voted the same way as Speaker Pelosi 96% of the time, according to ProPublica, a national investigative news organization. The figure is based on 75 votes cast by Speaker Pelosi who, by tradition, votes at her discretion. Slotkin has also voted 89% of the time with Reps. Ocasio-Cortez, Omar and Tlaib; and 90% with Rep. Pressley, according to ProPublica.", "So Slotkin has frequently voted the same way as her party’s leadership. Members of the House often vote consistently with their party's leader. The vast majority of Democratic lawmakers in the current Congress have voted with Pelosi at least 90% of the time.", "Slotkin has also voted consistently with liberal Democrats.", "But congressional experts warn against using raw vote totals as an indicator of partisanship. \"Raw vote counts are misleading without context, especially with a high percentage of non-controversial votes,\" wrote Ian Ostrander, an assistant professor of American politics at Michigan State University. \"Some votes matter much more than others.\"", "In response to Junge’s claims, Slotkin pointed out the number of times she has voted with Republican members of Congress and against her own party.", "An analysis of the most recent data from Voteview shows that Slotkin has voted against her own party 55 times, and that 677 of the 879 votes Slotkin has taken during her term in Congress — about 77% — had the support of at least one Republican member.", "Experts agree this is not a great definition of bipartisanship.", "\"By her metric, if she, 230 other Democrats, and one Republican voted for a bill, then she's voting in a bipartisan fashion. That's just silly,\" wrote Christian Fong, an assistant professor of political science at the University of Michigan, in an email to PolitiFact Michigan.", "Congressional scholars often rely on what’s called the Nominate score, which measures a member’s ideology based on their voting record. The metric, developed by political scientists Keith Poole and Howard Rosenthal in the 1980s, provides a general sense of how liberal or conservative a member’s voting record is. UCLA’s Department of Political Science and Social Science Computing computes members' Nominate scores today.", "Nominate scores fall along a scale of -1 to 1, with -1 being the most liberal end of the spectrum and 1 as the most conservative. Slotkin’s Nominate score is -0.308, making her voting record more conservative than 68% of Democrats in the House.", "Slotkin’s Nominate score also shows she has staked out less liberal positions on votes than Pelosi.", "Looking at the measures members have co-sponsored rather than votes, GovTrack, an independent congressional tracker, ranked Slotkin among the most conservative Democrats in Congress in 2019.", "Fong suggests voters should consider other metrics of bipartisanship too: \"Has she gotten any Republicans to cosponsor her bills? What Republican-led initiatives did she support? Are there any Republican colleagues with whom she's developed a strong working relationship?\"", "The Bipartisan Index from the Lugar Center and Georgetown University’s McCourt School of Public Policy provides some answers. It measures how often lawmakers work with members of the other party on sponsoring and co-sponsoring legislation. It finds Slotkin has frequently co-sponsored bills introduced by the Republican Party and attracted Republican co-sponsors for the bills she has introduced, and ranked her in the top 25% of House lawmakers in 2019.", "According to GovTrack, 10 of Slotkin’s 15 bills and resolutions in 2019 had a Republican cosponsor.", "In June 2019, Slotkin joined the Problem Solvers Caucus, a group made up of an equal number of Democratic and Republican House members who try to identify bipartisan policy solutions.", "Junge said that Slotkin \"presented herself as a moderate\" and \"independent-minded\" but instead she has acted \"very partisan\" during her first term.", "Independent analyses indicate Slotkin’s voting and legislative records are more conservative and bipartisan than most of her Democratic colleagues’.", "Junge highlighted one metric — Slotkin’s record of voting with Speaker Pelosi and liberal House members — as evidence. He ignores other metrics that would give a different impression.", "We rate Junge’s claim Mostly False.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "MLive, Malachi Barrett, \"Elissa Slotkin launches reelection bid promising solutions, decency and bipartisanship,\" July 12, 2020", "The Detroit Free Press, Todd Spangler, Phoebe Wall Howard and Elisha Anderson, \"Elissa Slotkin wins Michigan Congress seat, Mike Bishop concedes,\" November 6, 2018", "ProPublica, \"Compare the voting records of Elissa Slotkin and Nancy Pelosi in 2019-20.,\" accessed September 17, 2020", "ProPublica, \"Compare the voting records of Elissa Slotkin and Rashida Tlaib in 2019-20.,\" accessed September 17, 2020", "ProPublica, \"Compare the voting records of Elissa Slotkin and Ilhan Omar in 2019-20.,\" accessed September 17, 2020", "ProPublica, \"Compare the voting records of Elissa Slotkin and Alexandria Ocasio-Cortez in 2019-20.,\" accessed September 17, 2020", "ProPublica, \"Compare the voting records of Elissa Slotkin and Ayanna Pressley in 2019-20.,\" accessed September 17, 2020", "WDET, Detroit Today, \"Rep. Slotkin, Junge Make Case For Eighth District to Voters,\" September 11, 2020", "Lewis, Jeffrey B., Keith Poole, Howard Rosenthal, Adam Boche, Aaron Rudkin, and Luke Sonnet (2020). Voteview: Congressional Roll-Call Votes Database. https://voteview.com/, accessed September 15, 2020", "The Lugar Center and Georgetown University's McCourt School of Public Policy, Bipartisan Index, accessed September 16, 2020", "GovTrack, \"Rep. Elissa Slotkin’s 2019 Report Card,\" accessed September 16, 2020", "GovTrack, \"2019 Report Cards House Freshmen / Writing Bipartisan Bills,\" accessed September 16, 2020", "Representative Elissa Slotkin, Press Release, \"Rep. Elissa Slotkin Joins Bipartisan Problem Solvers Caucus,\" June 4, 2019", "The Austin American-Statesman, Madlin Mekelburg, \"Fact-check: How many bipartisan bills has Congress passed?,\" February 13, 2020", "Christian Fong, an Assistant Professor of Political Science at the University of Michigan, email exchange, September 15, 2020", "Ian Ostrander, an Assistant Professor of American Politics at Michigan State University, email exchange, September 16, 2020", "VoteView, Elissa Slotkin, accessed September 17, 2020", "GovTrack, Analysis Methodology - Ideology Analysis of Members of Congress, accessed September 17, 2020", "The Detroit Free Press, Todd Spangler, \"Why Michigan Democrat Elissa Slotkin passed on the Green New Deal,\" March 29, 2019", "MLive, Malachi Barrett, \"Slotkin rejects Medicare for All, supports public buy-in option,\" November 8, 2019", "WKAR, Abigail Censky, \"In Race For Michigan's Eighth District, Slotkin Sells Moderate Image As Junge Seeks Name Recognition,\" September 21, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]