["About this rating", "Sen. David Perdue referenced Psalms 109:8 at an event; Perdue's representative later denied he wished death on the President.", "Sen. Perdue didn't explicitly state attendees at the conference should pray expressly for the President to die.", "On 10 June 2016, the Daily Beast reported that Sen. David Perdue urged attendees of the Faith & Freedom Coalition’s Road to Majority conference to pray for misfortune and death to befall President Barack Obama:", "At a major event for conservative Christians this morning, a Republican senator joked about praying for President Obama’s “days to be short.”", "Sen. David Perdue, a freshman senator from Georgia, opened his remarks at the Faith & Freedom Coalition’s Road to Majority conference by encouraging attendees to pray for President Obama. But, he added in a joking tone, they need to pray for him in a very specific way: “We should pray for him like Psalms 109:8 says: Let his days be few, and let another have his office,” the senator said, smiling wryly.", "The crowd chuckled and he moved on with his address.", "The rest of that passage, which Perdue did not recite, reads, “May his children be fatherless and his wife a widow. May his children be wandering beggars; may they be driven from their ruined homes.”", "The psalm is a pointed, lengthy death wish for one of David’s enemies.", "Video depicted Purdue's 10 June 2016 remarks:", "Psalms 109:8 (alternately named \"Song of the Slandered\") was rendered in the manner below in the King James Bible:", "Hold not thy peace, O God of my praise;\nFor the mouth of the wicked and the mouth of the deceitful are opened against me: they have spoken against me with a lying tongue.\nThey compassed me about also with words of hatred; and fought against me without a cause.\nFor my love they are my adversaries: but I give myself unto prayer.\nAnd they have rewarded me evil for good, and hatred for my love.\nSet thou a wicked man over him: and let Satan stand at his right hand.\nWhen he shall be judged, let him be condemned: and let his prayer become sin.", "Let his days be few; and let another take his office.\nLet his children be fatherless, and his wife a widow.\nLet his children be continually vagabonds, and beg: let them seek their bread also out of their desolate places.\nLet the extortioner catch all that he hath; and let the strangers spoil his labour.\nLet there be none to extend mercy unto him: neither let there be any to favour his fatherless children.\nLet his posterity be cut off; and in the generation following let their name be blotted out.\nLet the iniquity of his fathers be remembered with the LORD; and let not the sin of his mother be blotted out.\nLet them be before the LORD continually, that he may cut off the memory of them from the earth.", "As many pointed out, the Senator's Biblical reference wasn't a new or even uncommon scripture-based jab at President Obama. A 2009 article reported that the verse was traction across the internet as a veiled threat cloaked in the guise of prayerful intent:", "There’s a new slogan making its way onto car bumpers and across the Internet. It reads simply: “Pray for Obama: Psalm 109:8”", "A nice sentiment?", "Maybe not.", "The psalm reads, “Let his days be few; and let another take his office.”", "Presidential criticism through witty slogans is nothing new. Bumper stickers, t-shirts, and hats with “1/20/09” commemorated President Bush’s last day in office.", "But the verse immediately following the psalm referenced is a bit more ominous: “Let his children be fatherless, and his wife a widow.”", "The slogan comes at a time of heightened concern about antigovernment anger. Earlier this year, the president's senior adviser, David Axelrod, said that Tea Parties could lead to something unhealthy. In September, authorities shut down a poll on Facebook asking if President Obama should be killed.", "Still, that doesn’t push the Psalms citation into the realm of hate speech, says Chris Hansen, a staff attorney with the American Civil Liberties Union (ACLU).", "That particular piece was published during President Obama's first term in office. Some argued at the time that the reference to the verse simply expressed a hope that he not be re-elected to a second term:", "Deborah Lauter, director of civil rights at the Anti-Defamation League agrees that the bumper sticker falls within acceptable political discourse.", "“The problem is you don’t know if people who are donning that message in a shirt or on a bumper sticker are fully aware of the quote or what follows. Obviously that message makes the ambiguity disappear. If they’re just referring to him being out of office, that’s one thing. If they’re referring to him being dead, that’s so offensive. It’s protected speech, but it’s clearly offensive.”", "However, that motive ceased to be relevant after Obama's 2012 re-election. A representative for the Senator provided a terse statement to a Bloomberg reporter about the controversy:", "David Perdue spokeswoman Caroline Vanvick responds in an email: \"He in no way wishes harm towards our president\" pic.twitter.com/PPj5jtZv0n", "— Sahil Kapur (@sahilkapur) June 10, 2016", "The statement read:", "Senator Perdue said we are called to pray for our country, for our leaders, and for our president. He in no way wishes harm towards our president and everyone in the room understood that. However, we should add the media to our prayer list because they are pushing a narrative to create controversy and this is exactly what the American people are tired of.", "It is true Sen. David Perdue laughed and referenced Psalms 109:8 during a 10 June 2016 conservative Christian event. A representative for the Senator addressed the ensuing controversy, blaming the media for \"pushing a narrative\" for the outcry.", "Samuelson, Tracey D.   \"Biblical Anti-Obama Slogan: Use Of Psalm 109:8 Funny Or Sinister?\"\r\n    The Christian Science Monitor.   16 November 2009.", "Woodruff, Betsy.   \"GOP Senator David Perdue Jokes About Praying for Obama’s Death.\"\r\n    Daily Beast.   10 June 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]