["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Attorney Aramis Ayala, of the 9th circuit in Florida, at a press conference on March 16, 2017. (AP)", "The decision by Orlando-area prosecutor Aramis D. Ayala to no longer seek the death penalty in murder cases has injected a racial discussion about death row into the Florida legislative session.", "Ayala, a Democrat elected as state attorney in 2016, announced her decision while handling the case of Markeith Loyd, who is accused of killing his ex-girlfriend and an Orlando police officer. Scott removed Ayala from the Loyd case as well as 21 additional first-degree murder cases and reassigned them to Brad King, a Republican state attorney.", "Sen. Randolph Bracy, an Orange County Democrat and chairman of the Florida Senate Criminal Justice Committee, defended Ayala’s right to make that call and criticized Gov. Rick Scott’s reaction in an op-ed in the New York Times.", "\"As a black man, I see the death penalty as a powerful symbol of injustice in which race often determines who lives and who dies, especially in Florida,\" Bracy wrote. \"The state has the second-largest number of death row inmates in the country, after California, and African-Americans are grossly overrepresented on Florida’s death row.\"", "Related: Did the U.S. Supreme Court ban all state laws that make executions mandatory for murderers?", "We decided to look at the statistics and see if they back up Bracy’s statement.", "Florida’s death row statistics", "Sheer numbers don’t say very much about racial discrepancies of death row inmates. (There are more white inmates than black inmates among the 371 members of Florida’s death row.)", "Bracy’s point about overrepresentation compares African-American inmates on death row compared to African-Americans’ share of the general population.", "African-Americans in Florida comprise about 17 percent of the population, according to the 2015 census.", "But they make up about 39 percent of the death row population.", "Based on the data, African-Americans make up twice as large of a share of death row inmates as a share of the state population.", "Other ways to crunch it", "There is a lot of research that shows racial disparities in sentencing for death penalty cases, in Florida and around the country.", "The leader of a pro-death penalty group quibbled with Bracy’s point, saying it disregards the race of people who commit homicides.", "Michael Rushford, president of the Criminal Justice Legal Foundation, said more African-Americans are convicted of homicide.", "\"There are far fewer women than men on Florida's death row; this does not indicate a bias against men, it indicates a disproportionate percent of men who commit capital murder compared to women,\" he said.", "The Bureau of Justice Statistics found that nationally between 1980-2008, 52.5 percent of homicide convicts were African-American while 45.3 percent were white. In 2015, 36.7 percent of homicide convicts were African-American while 30.2 percent were white.", "\"The difference between the makeup of death row and the makeup of the general population is attributable to the difference in offending rates, not bias in the system,\" said Kent Scheidegger, legal director of the Criminal Justice Legal Foundation.", "Evidence for racial disparities", "Studies show sentencing in death penalty cases often depends more heavily on the race of the victim than the killer.", "No white person has ever been executed for killing a black person, said Michael Radelet, a University of Colorado professor who has studied death penalty sentencing in Florida.", "In a 1991 study, Radelet (then at the University of Florida) found the odds of a death sentence for those who kill white people are about 3.4 times higher than for those who kill African-Americans in Florida.", "\"All the research in Florida has found that the race of the victim is a more powerful predictor of death sentencing than the race of the defendant...,\" he told PolitiFact Florida. \"It is true that every homicide cases is different, but even after looking at roughly similar cases (multiple murders, murders that have accompanying felony circumstances, etc.) we find the patterns of bias.\"", "Brandon L. Garrett, a University of Virginia School of Law, reached a similar conclusion in his research at the national level.", "Garrett analyzed data on all death sentencing by county from 1990 to 2016, seeking to answer the question of why a few counties, but not the bulk, still impose death sentences.", "He found that death sentences are strongly associated with urban, populous counties as well as counties that have large black populations. Garrett also found that counties with more white victims of homicide have more death sentencing.", "Frank Baumgartner, a University of North Carolina political science professor, described a similar pattern in a 2016 Albany Law Review article after he examined national data on race and homicide between 1976 through 2014.", "In Florida, Baumgartner found \"tremendous disparities\" depending upon the race and gender of the victim.", "He found that 72 percent of all executions in Florida were for crimes involving white victims despite the fact that 56 percent of all homicide victims are white. He argues that bias can enter the system at many points -- starting with a prosecutor’s decision about how to charge the crime and ultimately decisions by juries.", "It isn’t just a Florida problem.", "One of the key pieces of analysis cited in this area is by University of Iowa law professor David Baldus, who examined a sampling of death penalty cases in Philadelphia from 1983 to 1993. He found average death sentencing rates were 38 percent higher for black defendants than for other defendants.", "Baldus, who died in 2011, played a role in the U.S. Supreme Court’s 1987 McCleskey vs. Kemp decision, in which the court determined Baldus’ research showing statistical evidence of racial discrimination in Georgia death penalty cases did not make the death penalty unconstitutional.", "In a report for the American Bar Association, Baldus found that race-of-defendant disparities existed in several other states, too, including California, Pennsylvania and South Carolina.", "Our ruling", "Bracy said, \"African-Americans are grossly overrepresented on Florida’s death row.\"", "African-Americans are overrepresented in terms of their population; black inmates make up twice as large of a share of death row inmates than their share of the state population.", "The \"why\" isn’t as easy to answer. National data show that more blacks than whites are convicted of homicides. However, research repeatedly shows that the victim’s race affects a defendant’s sentence: no white person has been executed for killing a black person in Florida.", "We rate Bracy’s statement Mostly True.", "New York Times op-ed by Sen. Randolph Bracy, \"Florida’s vengeful governor,\" April 4, 2017", "Florida Department of Corrections, Offender statistics, Accessed April 4, 2017", "Amazon.com, Machinery of Death: The Reality of America’s Death Penalty Regime, 2002", "Ohio State University Moritz law article by Kent Scheidegger of the Criminal Justice Legal Foundation legal director, \"Rebutting the Myths About Race and the Death Penalty,\" 2012", "Crime and consequences blog by Kent Scheidegger, \"Disproportionate to what?\" Jan. 17, 2012", "Illinois College of Law professor Wayne LaFave, Criminal procedure, updated December 2015", "Death Penalty Information Center, \"Death row USA,\" Summer 2016", "Death Penalty Information Center, United States Supreme Court decisions 1972-1996, Accessed April 4, 2017", "Journal of Criminal Law and Criminology, \"The American Death Penalty decline,\" Forthcoming in 2017", "Albany Law Review by Frank Baumgartner, These Lives Matter, Those Ones Don’t:  Comparing Execution Rates by the Race and Gender of the Victim in the US and in the Top Death Penalty States, 2016", "Frank Baumgartner, \"The Impact of Race, Gender, and Geography on Florida Executions,\" Jan. 14, 2016", "Gainesville Sun op-ed, \"Frank Baumgartner: Racial bias plagues Florida’s death penalty,\" Jan. 26, 2016", "Letter from legal experts to Gov. Rick Scott, March 20, 2017", "Justia U.S. Law, State v. Cain, 1980", "Legal Information Institute Cornell law, Furman v. Georgia, 1972", "Oyez Chicago-Kent College of Law, Gregg v. Georgia, 1976", "Oyez Chicago-Kent College of Law, Jurek v. Texas, 1976", "Oyez Chicago-Kent College of Law, Woodson v. North Carolina, 1976", "Oyez Chicago-Kent College of Law, Roberts v. Louisiana, 1976", "Findlaw, Sumner v. Shuman, 1987", "Court of Appeal of Florida Fifth District, State v. Perry, March 16, 2016", "Court of Appeal of Florida Fifth District, Emergency Petition for Writ of Prohibition, Feb. 15, 2016", "Florida Attorney General Pam Bondi, Statement on Florida Supreme Court Decision in Perry v. State, Feb. 20, 2017", "Florida Attorney General Pam Bondi, Tweet, March 16, 2017", "Amazon.com, Machinery of Death: The Reality of America’s Death Penalty Regime, 2002", "University of Washington study, \"The role of race in Washington state capital sentencing, 1981-2012,\" Jan. 14, 2014", "American Bar Association study, \"State death penalty systems deeply flawed,\" Oct. 29, 2007", "Census, Quick Facts about Florida, 2015", "Bureau of Justice Statistics, Homicide Trends in the United States, 1980-2008", "FBI, Crime in the United States, 2015", "ACLU of Florida, \"Florida Prosecutor Goes on Killing Spree,\" March 13, 2014", "New York Times, David C. Baldus, 75, Dies; Studied Race and the Law, June 15, 2011", "New York Times, \"Court eliminates mandatory death sentence,\" June 23, 1987", "Orlando Sentinel, \"Death penalty debate endures,\" March 26, 2017", "The Atlantic, \"Racism and the Execution Chamber,\"June 23, 2014", "Tampa Bay Times, \"21 cases taken from Ayala,\" April 4, 2017", "Tampa Bay Times, \"Judicial principle, at odds with law,\" March 26, 2017", "Tampa Bay Times, \"Peers rebuke Orlando prosecutor,\" March 18, 2017", "Tampa Bay Times, \"Court says murder retrial can proceed,\" Feb. 21, 2017", "Tampa Bay Times, \"THE RACE ISSUE: Gov. Bush forms a task force to study the role of race in capital sentencing,\" Jan. 7, 2000", "PolitiFact Florida, \"Has the U.S. Supreme Court banned all state laws that make executions mandatory for murders?\" April 6, 2017", "PolitiFact Florida, \"Florida ACLU says state has 'the most errors and exonerations from death row,'\" June 2, 2014", "PolitiFact, \"3 fact-checks about the death penalty,\" June 3, 2014", "PunditFact, \"Van Jones: In some states, black defendants are three times as likely to get death sentences than whites for same crime,\" May 7, 2014", "PunditFact, \"Giuliani: Black and white people who commit murder are convicted at the same rate,\" Nov. 26, 2014", "Interview, Travaris McCurdy, Sen. Randolph Bracy legislative assistant, April 4, 2017", "Interview, Baylor Johnson, ACLU of Florida spokesman, April 4, 2017", "Interview, Marc Mauer, Sentencing Project executive director, April 4, 2017", "Interview, Robert Dunham, Death Penalty information Center executive director, April 4, 2017", "Interview, Amber Widgery, National Conference of State Legislatures spokeswoman, April 4, 2017", "Interview, Kent Scheidegger, Criminal Justice Legal Foundation legal director, April 4, 2017", "Interview, Michael Rushford, Criminal Justice Legal Foundation president, April 5, 2017", "Interview, Whitney Ray, Attorney General Pam Bondi spokesman, April 5, 2017", "Interview, Noel King Piros, Office of the State Attorney 9th Judicial Circuit paralegal, April 5, 2017", "Interview, Frank R. Baumgartner, University of North Carolina political science professor, April 6, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]