["This post here was shared more than 400 times on Facebook and, like others here, here and here, includes an image of what looks like an official “Death and Resurrection Certificate” issued by South Africa’s Department of Home Affairs.", "The caption says: “Just when I thought I have seen it all …”", "A purple date stamp adds a touch of authenticity, as well as a signature at the bottom of the page and a document number at the top.", "We are told the deceased is “Brighton Moyo”, a Zimbabwean man  felled by a fatal bout of “coughing” on February 22, 2019. Two days later, he is said to have risen from the dead after a “miracle” performed by Pastor Alph Lukao from Alleluia Ministries.", "The document, however, does not exist. “This is a hoax,” said David Hlabane, the department’s media manager. “The Department of Home Affairs does not issue such certificates. We became aware of this hoax around February 2019 shortly after a pastor allegedly raised someone from the dead.”", "The video below, which shows the claimed resurrection of Moyo by Lukao, emerged in February last year.", "Moyo, in white, is seen being helped from a coffin after sitting bolt upright. He proceeds to wander around a packed auditorium in front of a frenzied congregation, apparently dazed by his return to the world of the living.", "Media reports (here and here) captured the ensuing drama in the months immediately after the event was exposed as a fake. The saga saw criminal dockets opened and charges subsequently dropped.", "And the man called Moyo? He reportedly died a second time back home in Zimbabwe, although details as to the cause varied.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]