["Since Election Day, baseless claims about Dominion Voting Systems have proliferated across the internet.", "Users have claimed that Democratic House Speaker Nancy Pelosi and Sen. Dianne Feinstein, D-Calif., had ties to the company, whose voting machines operate in 28 states.", "USA TODAY has debunked those claims.", "Users on Facebook tried to link the company to President-elect Joe Biden.", "Numerous viral posts bear the message: \"Bidens sister is married to Stephen Owens, who owns Dominion voting systems.\"", "Chi Nguyen-Zeh – whose post has been shared more than 1,200 times – has not responded to requests from USA TODAY for comment.", "Fact check:Meme is missing context, potentially misleads on support for Biden, Trump and Obama", "There is no link between Biden and Dominion Voting Systems.", "Dominion Voting Systems is part-owned by Stephen Owens, who co-runs the private equity firm Staple Street Capital.  Staple Street Capital and Dominion's management team acquired Dominion in 2018, according to a news release.", "Biden has one sister, Valerie Biden Owens. Though she shares the same surname as Stephen Owens, she is not married to him.", "Valerie Biden Owens is married to John Owens, the owner of a telemedicine company in Delaware, according to The Washington Post.", "It is  not true that Stephen Owens is their son, as some claimed.", "Valerie Biden Owens and John Owens have three children – Valerie James Owens, Cuffe Biden Owens and Catherine Eugenia Owens, according to a statement from Joe Biden's office when he was vice president.", "A spokesperson for Dominion Voting Systems confirmed to Lead Stories that there are no familial connections between Stephen Owens and Valerie Biden Owens.", "\"There is no family ties between Mr. Owens and Valerie Owens,\" she wrote. \"This is disinformation being spread on social media.\"", "A spokesperson for Staple Street Capital confirmed to Snopes that Stephen Owens has no relation to the Bidens.", "Fact check:Hugo Chávez's family does not own Dominion Voting Systems", "Based on our research, claims that Joe Biden's brother-in-law owns Dominion Voting Systems are FALSE. Joe Biden has one sister, Valerie Biden Owens. She is married to Jack Owens. There is no familial relationship with Stephen Owens, the co-founder of a private equity firm that acquired Dominion Voting Systems in 2018.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]