["U.S. House Speaker Paul Ryan, R-Wisconsin, claims actuaries have determined Obamacare is in a \"death spiral.\" (Associated Press photo)", "As Republicans in Washington move toward a repeal of Obamacare, U.S. House Speaker Paul Ryan is doubling down on criticism of the sweeping healthcare law.", "That included a description in his Jan. 12, 2017, weekly briefing about the current state of Obamacare.", "\"The law is in what the actuaries tell us (is) a death spiral,\" the Wisconsin Republican said. \"So we’ve got to intervene to prevent this from getting worse.\"", "Ryan used the same ominous term — death spiral — in his Jan. 5, 2017, weekly briefing and as far back as a Fox News interview in December 2016.", "But is it accurate?", "Death spiral has a precise meaning", "The phrase \"death spiral\" evokes an airplane in a nosedive, but in the world of health care it carries a specific definition. Ryan appears to be referring to that definition since each time he used the term, he attributed it to actuaries.", "So this isn’t a fact check on the health or success of Obamacare, but on whether the present condition is consistent with what industry number-crunchers call a \"death spiral.\"", "The term refers to a cycle where shrinking enrollment leads to a deteriorating risk pool (that is, healthy people leave the plan due to the cost). That leads to higher premiums, which causes enrollment to shrink even further, continuing the cycle.", "\"It’s a well-known and documented phenomenon,\" said David Cutler, a Harvard University economics professor who was among the early users of the term in a 1998 paper, though he doesn’t believe he was the first.", "Three elements to a death spiral", "So a death spiral requires 1.) shrinking enrollment, 2.) a deteriorating risk pool and 3.) rising premiums. Let’s look at those one by one.", "The latest figures show enrollment in the Affordable Care Act’s insurance exchange is up slightly from last year. Through Dec. 24, 2016, some 11.5 million people were signed up for coverage, an increase of 300,000 from the same point last year.", "\"This market is not merely stable, it’s actually currently on track to grow,\" said Aviva Aron-Dine, an economist with the U.S. Department of Health and Human Services. \"These (death spiral claims) are claims that have been sort of demonstrably false for a while, but it’s even more irresponsible to be repeating them now when we actually have enrollment data for 2017.\"", "As for the risk pool, Aron-Dine said it improved in 2015. Data for 2016 isn’t available yet, but the U.S. Centers for Medicare and Medicaid Services reports the share of people signing up for 2017 in the low-risk demographic — ages 18-34 — is on par with 2016, at 26% of enrollees.", "Larry Levitt, vice president of the health care-focused, nonpartisan Kaiser Family Foundation, noted the 26% number in a Jan. 10, 2017, tweet, adding, \"You'd expect that number to go down in an insurance ‘death spiral.’\"", "And data maintained by Standard & Poor’s shows the pool of people insured through the marketplace is improving, as the insurer cost per enrollee dropped below costs in the employer-sponsored market for the first time since Obamacare began, said Ben Wanaker, deputy assistant secretary with HHS.", "The role of premiums is more nuanced.", "Premiums are going up significantly this year. The benchmark plan used to gauge changes increased an average of 24% across the 50 states and Washington, D.C., the Kaiser Family Foundation reported.", "But most consumers won’t see any increase in what they pay because Obamacare includes subsidies that cap premium prices at a certain percentage of income for anyone below 400% of the federal poverty level (in 2016 that would be $47,520 for a single person).", "Among the people who have signed up so far for 2017, 81% will receive a subsidy.", "As a result, for most there is no direct connection between premiums and enrollment — the core connection that defines a death spiral. For example, Arizona has by far the largest premium increase for 2017 (145%) but has still seen Obamacare enrollment increase by 8 percent so far.", "\"When the premiums go up, people don’t drop coverage because the amount they pay hasn’t changed,\" Cutler said.", "When asked for evidence of the death spiral, Ryan spokesman Ian Martorana provided links to other people who have claimed the system is in a death spiral and details on how premiums are rising and insurers are leaving the marketplace. But he did not provide any data that showed the conditions being met for the actuarial definition of a death spiral.", "None of this is to say things are rosy for Obamacare.", "Several of the country’s largest insurers have abandoned or drastically scaled back their involvement in the exchanges, meaning one-third of counties will now have only one company offering plans on the exchange.", "But that’s not a death spiral.", "Mark Pauly, a conservative health economist at The Wharton School, said it was a \"poor choice of words\" by Ryan.", "\"It’s not a death spiral, it’s just a downward spiral,\" he said.", "Our rating", "A death spiral is a health industry term for a cycle with three components — shrinking enrollment, healthy people leaving the system and rising premiums.", "The latest data shows enrollment is increasing slightly and younger (typically healthier) people are signing up at the same rate as last year. And while premiums are increasing, that isn’t affecting the cost to most consumers due to built-in subsidies.", "So none of the three criteria are met, much less all three.", "We rate Ryan’s claim False.", "YouTube.com, Speaker Ryan’s Weekly Press Briefing, Jan. 12, 2017", "C-Span, House Speaker Weekly Briefing, Jan. 5, 2017", "YouTube.com, Paul Ryan Full Interview with Sean Hannity (12/9/2016), Dec. 9, 2016", "Email exchange with Ian Martorana, spokesman for Paul Ryan, Jan. 4-13, 2017", "https://downloads.cms.gov/files/final-marketplace-mid-year-2017-enrollment-report-1-10-2017.pdf", "Interview and email exchange with David Cutler, professor at Harvard University, Jan. 10, 2017", "Interview with Mark Pauly, health economist at The Wharton School, University of Pennsylvania, Jan. 11, 2017", "Interview with Aviva Aron-Dine, economist, U.S. Department of Health and Human Services, Jan. 9, 2017", "Email exchange with Ben Wakana, deputy assistant secretary for health care, U.S. Department of Health and Human Services, Jan. 9-10, 2017", "Twitter.com, Larry Levitt, Jan. 10, 2017", "Center for Medicare and Medicaid Services, Health insurance marketplaces 2017 open enrollment period: January enrollment report, Jan. 10, 2017", "Council of Economic Advisors, Understanding recent developments in the individual health insurance market, January 2017", "Kaiser Family Foundation, 2017 Premium Changes and Insurer Participation in the Affordable Care Act’s Health Insurance Marketplaces, Nov. 1, 2016", "Interview and email exchange with Roger Stark, health care analyst, Washington Policy Center, Jan. 13, 2017", "Interview and email exchange with Jeffrey Anderson, senior fellow, Hudson Institute, Jan. 13, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]