["About this rating", "The Federal Emergency Management Agency (FEMA) is contracted to pay Panthera Worldwide $55 million for 10 million N95 medical masks, which Panthera does not manufacture.", "An executive at Panthera said that although its parent company did file for bankruptcy, Panthera Worldwide is contracted with FEMA as a separate legal entity that currently has employees and contractors. Additionally, although Panthera isn't a mask manufacturer, it can broker the purchase of masks.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Amid the COVID-19 coronavirus pandemic in mid-April 2020, a Business Insider article circulated widely on social media that reported the Trump administration had awarded a $55 million mask contract to Panthera, \"a bankrupt company with zero employees for N95 masks, which it's never manufactured.\"", "The Business Insider article, published on April 16, was aggregated from a report by The Washington Post, which was published one day earlier. Business Insider's headline read, \"The Trump administration awarded a $55 million contract to a bankrupt company with zero employees for N95 masks, which it's never manufactured.\" The article included more details:", "In this chaotic effort to obtain supplies, the Trump administration awarded a $55 million contract to Panthera Worldwide LLC, a company with no expertise in the world of medical equipment, for N95 masks, The Washington Post reported on Wednesday.", "Panthera's parent company filed for bankruptcy protection last fall, and one of its owners last year said it'd had no employees since May 2018, The Post reported, citing sworn testimony. It's no longer listed as an LLC in Virginia, where its main office is, after fees went unpaid, the newspaper said.", "The articles also spawned a meme that social media users circulated, which prompted readers to ask Snopes to verify:", "We reached out to one of Panthera Worldwide's executives, James Punelli, who told us by email that Panthera Worldwide, which contracts with FEMA, is a separate legal entity from the parent company Panthera Enterprises; the latter filed for bankruptcy in 2019. Panthera Worldwide, Punelli noted, is not named in legal proceedings involving its parent company.", "\"Panthera Worldwide has past performance and is in good standing with [Department of Defense] and other federal entities for quality, on-time performance, particularly in the medical training arena,\" Punelli said in his email. Punelli also stated that Panthera Worldwide does have both employees and independent contractors on its payroll.", "\"When the COVID-19 pandemic struck we offered to provide needed materials through Panthera Worldwide, a company in good standing as a federal contractor with legitimate, high-quality medical supply sourcing worldwide. We are providing this product at the same high level of as service we have always done; and will do so ahead of schedule with these 10 million masks,\" Punelli said.", "A search for Panthera using USASpending.gov, a database that tracks federal contracts, confirms that the U.S. Department of Homeland Security, of which FEMA is a subsidiary agency, awarded Panthera $55.5 million for N95 masks in a contract that starts on April 1 and ends on May 1, 2020.", "A spokesperson for FEMA told us that it's true Panthera does not make medical masks, but that \"Panthera is a broker, not a manufacturer. The review of the company and its proposal lead FEMA to conclude the offeror would be able to fulfill the contract.\"", "FEMA also told us that the price paid by the federal government to purchase 10 million masks from Panthera, at $5.50 per mask, was in the range of what the market value price was at the time, which was $2.50 to $7.", "So while it's true that FEMA has awarded a $55 million contract to Panthera Worldwide to broker medical masks, it is not true that the company is bankrupt, as stated in the above meme. According to a company executive, Panthera Worldwide also currently has employees and contractors on its payroll and can broker the purchase of masks. As such, we rate this claim \"Mixture.\"", "UPDATE: On May 12, 2020, The Hill reported that FEMA had canceled its contract with Panthera Worldwide \"on the grounds of nondelivery.\"", "Stanley-Becker, Isaac, et al. \"In Coronavirus Scramble for N95 Masks, Trump Administration Pays Premium to Third-Party Vendors.\"\r\n  The Washington Post. 15 April 2020.", "Haltiwanger, John. \"The Trump Administration Awarded a $55 million Contract to a Bankrupt Company with Zero Employees for N95 Masks, Which It's Never Manufactured.\"\r\n  Business Insider. 16 April 2020.", "Johnson, Marty.   \"FEMA Cancels $55 Million Mask Contract.\"\r\n   The Hill.   12 May 2020.", "UPDATE [05/14/20]: Updated to note that FEMA ultimately canceled its contract with Panthera Worldwide due to nondelivery of goods.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]