["About this rating", "In mid-August 2018, the state of Virginia made public the findings of an investigation detailing conditions inside the Shenandoah Valley Juvenile Center, several weeks after after the Associated Press reported multiple migrant children detained there had alleged abuse that included beatings and being tied down to chairs with bags over their heads.", "A class action lawsuit was filed on 4 October 2017 on behalf of a 17-year-old asylum seeker (identified in court documents as Doe) from Mexico who had fled his home two years earlier seeking refuge in the United States from an abusive father and drug cartel violence. The lawsuit alleges that staff at the Shenandoah Valley Juvenile Center (SVJC) discriminated against Doe and other unaccompanied children from Mexico and Central America and abused them both verbally and physically. The suit also alleges that although Doe and other children exhibited signs of significant psychological distress including a suicide attempt, \"staff are deliberately indifferent to the children’s serious mental health needs.\"", "Children as young as 14 years old said they had been stripped and restrained to chairs with \"bags\" over their heads, according to the 21 June 2018 Associated Press report:", "Multiple detainees say the guards stripped them of their clothes and strapped them to chairs with bags placed over their heads.", "\"Whenever they used to restrain me and put me in the chair, they would handcuff me,\" said a Honduran immigrant who was sent to the facility when he was 15 years old. \"Strapped me down all the way, from your feet all the way to your chest, you couldn't really move ... They have total control over you. They also put a bag over your head. It has little holes; you can see through it. But you feel suffocated with the bag on.\"", "The reports prompted some readers to ask if they were true because, \"this is just too draconian to believe.\" The treatment of migrant children has been the center of fraught focus and public outcry due to harsh immigration policies adopted by the Trump administration.", "It is true that migrant kids detained at SVJC were tied down to chairs, and the \"bags\" children said were placed over their heads were \"mesh spit guards,\" according to the Virginia Department of Juvenile Justice (DJJ) report released on 13 August 2018, which stated that the \"The restraint chair is used for out-of-control residents who cannot be safely restrained by less intrusive methods. While in the chair, a mesh spit guard can be placed on the resident’s head to prevent spitting or biting.\"", "Although the lawsuit was filed in late 2017, the related story was initially reported by the news media in June 2018 at the height of blow back against President Donald Trump's \"zero tolerance\" immigration policy, under which children were taken from their parents at the U.S.-Mexico border. The specter of roughed-up and restrained migrant children with bags placed over their heads added to already present anger over such policies and prompted protests at the facility, spurring the governor to call for a state investigation.", "The the accusations against SVJC staff made in the lawsuit are serious and allege that physical violence and punitive confinement, along with humiliation and racist insults, were routine, according to court documents:", "For example, Doe once became so frustrated by a staff member’s repeated taunting that he pushed the staff member. In response, four SVJC staff members shoved Doe to the floor and piled on top of him, and they began hitting him in his abdomen with their elbows. Doe sustained significant bruising as a result.", "On another occasion, Doe asked to come inside during his recreation time because he had a headache. SVJC staff suspected, for no apparent reason, that he may have found a piece of glass outside. Doe was thrown to the ground and forcibly strip searched, and his clothes were shredded. Though they found no contraband items, staff nevertheless transferred Doe to Alpha Pod -- the pod designated for children who have engaged in bad behavior -- in response to this incident.", "Other immigrant detainees have reported similar incidents of being physically assaulted by SVJC staff after verbal altercations with them ...", "SVJC staff also exert their control in a way that is intended to demean and humiliate the children. Several immigrant detainees have reported being stripped of their clothes, occasionally including their underwear, while being placed on “restriction,” or confined to their rooms, as a form of punishment. There is no legitimate penological justification for such behavior.", "SVJC staff also subject the immigrant youth to disparate discipline, doling out harsher punishments to the immigrant youth than to juvenile offenders who have engaged in the same or considerably worse behavior. Upon information and belief, the majority of the local juvenile offenders detained at SVJC are Caucasian and were born in the U.S", "The lawsuit alleges that immigrant children, who made up a significant number of detainees at the facility, were often treated worse than youngsters being held on criminal charges, despite the fact their cases were civil in nature.", "According to the state report, neither DJJ nor Child Protective Services found evidence during their investigation that rose to the level of criminal neglect or abuse at the facility. However, state investigators acknowledged that because the children making the allegations of abuse were federal detainees, they were not able to access those children for direct interviews nor access their records:", "During this investigation DJJ staff found no life, health, or safety violations for youth in ORR’s custody who have been placed at SVJC. Likewise, CPS, in their investigation, did not find evidence to support allegations of abuse or neglect. The team did find that the SVJC is a well-run facility that attempts to treat its staff and residents with respect and dignity ...", "In addition, DJJ identified a gap in its certification authority over local detention centers which is that, without permission from the custodian agency [the federal Office of Refugee Resettlement], DJJ does not have access to the records of youth, nor the youth themselves, who are in the custody of ORR or other third parties.", "State authorities made several recommendations, including staff training for dealing with traumatized youth and cultural sensitivity, and clarifying procedures for restraining detainees. They also recommended that any third-party contractors be required to allow state investigators to have access to all children detained there.", "According to the Associated Press, SVJC is \"one of only three juvenile detention facilities in the United States with federal contracts to provide 'secure placement' for children who had problems at less-restrictive housing.\" Roughly half the beds at any time are filled with migrant children aged 12 to 17 wading through either deportation proceedings or asylum cases. Children can languish in the facility for months or even years because \"Virginia ranks among the worst states in the nation for wait times in federal immigration courts, with an average of 806 days before a ruling.\" The lawsuit alleges Doe's psychological state deteriorated due to his continued detention there.", "Associated Press.   \"Young Immigrants Detained in Virginia Allege They Were Beaten While Cuffed, Left Nude in Cells.\"\r\n    21 June 2018.", "Associated Press.   \"Virginia Detention Center Strapped Migrant Children to Chairs, Report Finds.\"\r\n    13 August 2018.", "Smith, Matt, and Aura Bogado.   \"Immigrant Children Forcibly Injected with Drugs, Lawsuit Claims.\"\r\n    Reveal.   20 June 2018.", "M.L. Nestel.   \"Marches Around the Nation Protest 'Zero-Tolerance' Immigration Policy.\"\r\n    ABC News.   1 July 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]