["About this rating", "In September 2019, a photograph supposedly showing five people atop a skyscraper spire was recirculated on social media under the caption: \"The mother of all selfies!\"", "While some viewers were a bit skeptical about the authenticity of the picture, it is a genuine photograph. It was taken by photographer Gary Leonard in September 2016 and shows five ironworkers atop a spire installed on the 73-story Wilshire Grand Center in downtown Los Angeles, California. According to LA Downtown News:", "The 73-story Wilshire Grand replacement project had already altered the Downtown Los Angeles skyline. On Saturday, Sept. 3, however, it made history: It officially became the tallest building west of the Mississippi River.", "That morning, the final elements of a 200,000-pound, 294-foot tube was mounted to the eastern side of the $1.1 billion tower. The piece, called the “spire,” stretches above the curved portion of the building known as the \"sail.\"", "LA Downtown News reported the five ironworkers in the picture, Eric Madrigal, Peter Veliz, Vince Parker, Dan Cobb and Mark Palmer, were part of the construction crew known as the \"raising gang\" that installed the spire on top of the 1,100-foot tall skyscraper.", "Project spokesperson Leigh Kramer explained that the spire was put into place via a crane. The construction workers then climbed up a maintenance ladder in the center of the spire:", "“Saturday’s completion of the 294-foot, 9-inch spire marks a milestone achievement in the construction of the Wilshire Grand tower — now officially the tallest building west of the Mississippi,” said project spokeswoman Leigh Kramer.", "But how did those men get all the way up there?", "They climbed an internal maintenance ladder all the way to the top and were harnessed to the inside and outside of the structure, Kramer said.", "A gallery of photographs that Leonard took of this construction project can be found here. CBS Los Angeles also shared a similar photograph taken by Leonard to Twitter:", "DON'T LOOK DOWN: Workers pose atop Wilshire Grand -- 1,099 feet above DTLA. (Photo: Gary Leonard / Wilshire Grand) pic.twitter.com/3R4YQpbQfO", "— CBS Los Angeles (@CBSLA) September 7, 2016", "Zdanowicz, Christina.   \"Construction Workers Pose on Top of One of the Tallest Skyscrapers.\"\r\n    CNN.   9 September", "Monks, Kieron.   \"Earthquake-Proofing the Tallest Skyscraper in California.\"\r\n    CNN.   26 September 2016.", "Slayton, Nicholas.   \"An Amazing View of the Wilshire Grand Spire.\"\r\n    LA Downtown News.   12 September 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]