["About this rating", "For almost as long as internal combustion engine-powered vehicles have been around, many consumers have suspected that oil companies and automobile manufacturers have conspired to limit the fuel efficiency of cars in order to drive a greater volume of gasoline sales.", "An internet meme played on this conspiratorial mode of thinking by positing that car engines featured a \"horse power control device\" (HPCD) in order to artificially limit speed and \"consume more fuel so oil companies get richer\":", "No such item exists in the automotive world, either as a real device or as an abbreviation for a standard engine part. What's pictured is more commonly known as a timing belt, a part that serves an important operational function in internal combustion engine-powered vehicles:", "The timing belt is the belt that controls the camshafts in your engine, opening and closing valves at just the right time for smooth operation. The timing belt has teeth that turn the camshaft in time with the crankshaft.", "Some cars and trucks use timing chains or gears, which are more durable. But timing belts, made of rubber compound, are quieter and more efficient. They also don't need lube to work.", "On some engines, if the timing belt fails, valves will be held open when they should not be and will be struck by the pistons, causing major damage to your engine. So you want to prevent it at all costs.", "Even if you didn't quite understand this explanation of the timing belt's function, all you need to know is that if you cut it off your car, you likely wouldn't need to buy any gasoline at all — because your vehicle would no longer run.", "In short, this meme was a joke aimed at the automotively non-literate crowd.", "In that spirit of vehicular japing, enjoy the following tongue-in-cheek video demonstrating \"How to Check Your Blinker Fluid\":", "Big O Tires. \r\n    \"What Does the Timing Belt Do?\" Accessed 24 January 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]