["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Barack Obama reacts as he misses a shot while golfing at Farm Neck Golf Club in Oak Bluffs, Mass., on the island of Martha's Vineyard, Aug. 11, 2013. (Associated Press)", "As President Barack Obama begins a vacation on Martha’s Vineyard in Massachusetts, social media and blogs are buzzing with details of Obama’s vacations, past and present.", "Mark Knoller, the CBS News White House correspondent who is considered the authority on tracking the president’s daily activities, recently tweeted that \"no presidential numbers I report stir as much reaction and resentment as vacations -- except one: golf.\"", "Obama’s vacation plans have attracted heat from some of his critics, who say the cost of moving the president, his family and his Secret Service protection are an extravagance that taxpayers still stung by the weak economic recovery shouldn’t have to pay for. Obama and his family are reportedly staying at a $7.6 million vacation home of Democratic donor David Schulte.", "The president’s supporters counter that the unique security concerns for the president mean that he and his family can’t simply head out on the road and plop down at a Motel 6. They add that all presidents have to be accessible for consultation and decisionmaking even if they’re on vacation, and that every occupant of the White House, from both parties, has followed essentially the same procedures for vacations.", "As the Obamas took off for Martha’s Vineyard, one of their defenders was the Rev. Al Sharpton, who hosts a show on MSNBC.", "On the Aug. 9. 2013, edition of PoliticsNation, Sharpton said, \"We all love summer traditions, fireworks, barbecues, the beach. And we’re seeing the return of a right-wing favorite -- attacking the president’s vacation.\"", "Sharpton cut to a clip of Fox News’ Sean Hannity saying that Obama \"is living a pretty extravagant lifestyle, isn’t he? Martha's Vineyard, big expensive vacations, Hawaii, while 50 million Americans, Dana, are on food stamps.\"", "In reality, Sharpton told viewers, Obama \"has taken 92 days of vacation since he was sworn in. How many did President (George W.) Bush take by the same point in his presidency? Three hundred and sixty seven. Yes, more than a full year of vacation.\"", "We wondered whether Sharpton was right that Obama’s predecessor took many more vacation days than he has.", "When we asked MSNBC for the source of Sharpton’s data, a spokeswoman pointed to a story in USA Today. The article says, \"At the same point in Bush's presidency, the 43rd president had spent 367 days at his ranch in Crawford, Texas, and his parent's compound at Kennebunkport, Maine, according to a count by CBS News reporter Mark Knoller. Obama, who doesn't own a vacation home, has spent a total of 92 days of his presidency on vacation, according to Knoller.\"", "Tweets by Knoller himself back that up. On the eve of Obama’s departure for Martha’s Vineyard, Knoller tweeted that \"since taking office, Pres Obama has taken 14 vacation trips spanning all or part of 92 days.\" Knoller also tweeted that \"at the same point in office, Pres. GWBush had made 50 visits to this Texas Ranch totaling all or part of 323 days.\"", "Another 26 of Bush’s vacation days are accounted for by trips to Kennebunkport, with 18 days on vacation at miscellaneous locations, according to Knoller’s data. Trips to the Camp David presidential retreat in Maryland are not included in either president’s figures.", "It’s worth noting that there was a difference in the two presidents’ patterns of vacations. As the USA Today article noted, Obama doesn’t own a vacation home, unlike Bush, who owned his ranch. So while Bush essentially used the ranch as as a working White House, Obama has traveled to a variety of destinations, including his native Hawaii. Because of this, the government may have been able to accrue some per-trip cost savings for Bush by going repeatedly to one location. But since the White House is traditionally tight-lipped about costs and security details for presidential travel, it’s impossible to know how the total cost of Bush’s travel compares to Obama’s.", "Our ruling", "Sharpton said that Obama \"has taken 92 days of vacation since he was sworn in,\" compared to 367 for President George W. Bush at the same point in his presidency. While this discrepancy is explained by the fact that Bush often worked from a family home in Texas whereas Obama has no equivalent family retreat, Sharpton has correctly cited data from the leading authority, CBS News’ Mark Knoller. The statement is accurate but needs clarification or additional information, so we rate the statement Mostly True.", "Al Sharpton, comments on MSNBC’s Politics Nation, Aug. 9, 2013 (accessed via Nexis)", "USA Today, \"Critics bash Obama's plans for vacay,\" Aug. 9, 2013", "Mark Knoller, tweets on presidential vacation data, Aug. 9, 2013", "Associated Press, \"By the numbers: Obama's presidential vacations,\" Aug. 10, 2013", "Email interview with Diana Rocco, spokeswoman for MSNBC, Aug. 12, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]