["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Agency for International Development administrator Gayle Smith delivers her first major policy speech on March 9, 2016 at the Dirksen Senate Office Building on Capitol Hill. (USAID)", "While many global challenges are ahead, USAID administrator Gayle Smith struck an upbeat tone in her first major policy speech on Capitol Hill. Smith underscored how much progress has been made on many fronts, from education to economic well being.", "On the last, she said that since 1990, \"every continent has seen substantial gains, with individual incomes growing by more than a third in every region of the developing world.\"", "We decided to look into that particular sign of progress.", "The USAID press office told us the numbers came from the World Bank. The measure the agency used was Gross Domestic Product per person. The World Bank makes the numbers for each region comparable by correcting for the purchasing power of consumers in each country, and putting everything in constant 2011 dollars.", "\"Between 2014 (the last year for which data are available) and 1990, per capita income, in real terms and adjusting for purchasing power, has increased by more than one-third in every region, ranging from 34 percent in Sub-Saharan Africa to 192 percent in East Asia and the Pacific,\" press staff told us.", "Smith’s numbers hold up.", "The development agency gave regional figures that included both developing and higher-income nations. The World Bank offers a version that looks strictly at developing countries. World Bank staff said in some regions, the change is more dramatic than the numbers cited by USAID, and in some, it is less so.", "This table, using World Bank data, compares the change for regions solely in developing countries to the USAID approach that combines both developing and higher-income countries.", "Percent change: GDP per capita, PPP, 2011 dollars", "Region", "Developing only", "Combined", "East Asia & Pacific", "418%", "192%", "Europe & Central Asia", "49%", "37%", "Latin America & Caribbean", "46%", "50%", "Middle East & North Africa", "47%", "56%", "Sub-Saharan Africa", "33%", "34%", "The difference is most significant for the East Asia and Pacific region, which includes China, where GDP per capita rose four-fold in the period. The differences in some other regions might be less pronounced, but they don’t change the overall thrust of Smith’s summary.", "Technically, the rise in Sub-Saharan Africa was 33 percent, while Smith said more than one-third.", "And for the record, we don’t have exactly the same kind of data for the South Asia region, which includes India. The World Bank doesn’t distinguish between developing and higher-income countries there. Overall, the gain in that region was 172 percent.", "Measuring per capita GDP growth is not the only yardstick to gauge economic well being. The World Bank also looks at per capita Gross National Income. We ran those numbers and the trends remain the same.", "We also checked how the trend lines have changed over the decades. While the largest gains took place between about 1995 and 2008, followed by some backsliding during the Great Recession, most regions have recovered since then. Still, the pace of growth is considerably slower than in the past.", "A caveat", "It is important to note that a growing economy at the national level doesn’t tell us how well those gains are spread across all members of society. While the World Bank does calculate the gap between the rich and the poor for most countries, it doesn’t aggregate the data at the regional level. We have explored the distribution of wealth in another fact-check.", "It’s possible to take Smith’s words to mean that incomes rose for every individual by at least a third. In that sense, the available data don’t support her statement, but GDP per capita is a common measure of economic well-being, and many analysts argue that growth is a necessary, if insufficient, quantity to lift fortunes at the lower end of the income ladder.", "Our ruling", "Smith said that since 1990, individual incomes have grown by more than a third in every region of the developing world. Using the yardstick of GDP per capita, the World Bank data back that up. It is a hair off to say \"more than a third\" when the change in Sub-Saharan Africa is a bit less than a third, but the numerical difference is small.", "It is also important to remember that the benefits of a rising economy are rarely spread equally throughout the population. Typically, the wealthy gain more than the rest. So Smith’s statement isn’t as accurate on an individual to individual basis.", "With that caveat in mind, we rate this claim Mostly True.", "Medium, Future of Aid by USAID administrator Gayle Smith, March 9, 2016", "World Bank, Development indicators database", "McKinsey and Company, What’s driving Africa’s growth, June 2010", "Financial Times, Developing nation growth slowing, warns World Bank, June 10, 2015", "Wall Street Journal, For poor countries, well-worn path to development turns rocky, Nov. 24, 2015", "United Nations University, Growth for Low-Income Countries?, May 17, 2013", "Eastern Illinois University, Drivers of economic growth in developing countries, January 2014", "Eric Hanushek, Economic Growth in Developing Countries: The Role of Human Capital, Stanford Hoover Institution, April 2013", "Africa Development Bank, Africa development report, 2012", "World Economic Forum, The Inclusive Growth and Development Report, 2015", "Asian Development Bank, Drivers of Developing Asia’s Growth: Past and Future, November 2010", "Peterson Institute for International Economics, The Future of Worldwide Income Distribution, April 2015", "World Trade Organization, World Trade Report - 2014", "Email interview, Maura Leary, communications lead, Poverty and Equity, World Bank, March 22, 2016", "Email interview, Natasha Jackson, public information officer, Office of Communications, USAID, March 22, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]