["About this rating", "The exact meaning and intended meaning of the employee's remarks are open to interpretation and require further clarification.", "An undercover video shot at a Bronx women's health clinic in 2013 by the pro-life group Live Action garnered renewed attention in February 2019 when it was recirculated in advance of the Conservative Political Action Conference (CPAC) in National Harbor, Maryland.", "On 20 February, Live Action's founder and President Lila Rose posted a tweet containing the video clip and the following description: \"Our investigators exposed this New York abortion facility, which says they will put a born-alive baby in a jar of 'solution' to drown her. They also say to 'flush' the baby down the toilet, or 'put it in a bag' if she's born alive.\"", "Our investigators exposed this New York abortion facility, which says they will put a born-alive baby in a jar of \"solution\" to drown her. They also say to \"flush\" the baby down the toilet, or \"put it in a bag\" if she's born alive. pic.twitter.com/GYxdpyEbDK", "— Lila Rose (@LilaGraceRose) February 20, 2019", "The following day, Live Action tweeted the same video clip along with the message: \"Watch this New York abortion worker tell our investigator to 'flush' the baby down the toilet or 'put it in a bag' if she's born alive.\"", "Watch this New York abortion worker tell our investigator to \"flush\" the baby down the toilet or \"put it in a bag\" if she's born alive. pic.twitter.com/iXaVTxWjiS", "— Live Action (@LiveAction) February 21, 2019", "On 21 February, the pro-life web site LifeNews.com reported that \"An undercover video resurfaced this week of a New York abortion worker telling a woman to drown her baby in a toilet if the baby is born alive before the abortion is complete.\"", "In each of these three prominent examples, Live Action, its president, and the website LifeNews.com claimed that the worker had advised the woman posing as a would-be patient to dispose of a living baby born after a failed abortion either by \"flushing\" or \"drowning\" the baby, or putting it \"in a bag.\"", "Whatever one's overall view of the remarks made by the employee of Dr. Emily Women's Center, or the tone in which the employee made them, the specific claim that the employee told a woman she believed to be a prospective patient to end the life of a viable baby is highly questionable, and the issue hangs on subjective interpretation of inherently ambiguous statements.", "The employee was demonstrably misinformed or confused about certain clinical matters relating to abortion, and comments made by the clinic's designated counsellor, shown later in the video, strongly indicate that -- regardless of the first employee's remarks -- Dr. Emily Women's Health Center has a clear policy of attempting to resuscitate and revive a fetus in the extremely unlikely event that it should survive an abortion.", "Live Action is a pro-life, non-profit organization best known for publishing undercover \"sting\" videos recorded at health centers run by Planned Parenthood and other abortion providers.", "In April 2013, the group published two such videos, one recorded at a clinic in Washington, D.C., and the other at the Health Center in Bronx, New York. According to the timestamp on the footage, the Bronx \"sting\" was filmed in January 2013.", "The videos were released during the height of media attention towards the crimes of Kermit Gosnell, a Philadelphia abortion provider who was ultimately convicted of first-degree murder in May 2013 after a jury concluded that he had severed the spines of fetuses when botched late-term abortions he had conducted resulted in live births.", "In a press release accompanying the Bronx video, Live Action's president explicitly linked the video to Gosnell's activities, saying \"Dr. Kermit Gosnell is not alone. The gruesome and inhuman practices exposed in Gosnell’s ‘House of Horrors’ are business as usual for the abortion industry in America.\"", "The two-hour version of the video in question shows a woman, 23 weeks pregnant, posing as an abortion-seeker at the Bronx center. According to the video's timestamp, it was recorded on 11 January 2013, from about 9:50 A.M. until around noon. It can be watched in full here.", "The video, and the rest of this article, contain graphic details of abortion-related procedures, as well as hypothetical scenarios presented by the Live Action activist, which some viewers and readers might find disturbing.", "In the video, the woman fills out forms, sits in the waiting room, and speaks to several staff members. Around 87 minutes into the video, she sits in an office with a health center employee who says she is responsible for going over the medical history of would-be patients, but she is not the clinic's counselor. Because the patient is relatively quite late in her pregnancy, the staff member says, a two-day procedure known as \"dilation and evacuation\" has been recommended.", "The woman asks the employee a series of questions about the procedure and associated issues. Since the purpose of the video is to \"sting\" the abortion provider, the questions are awkward and designed to provoke or facilitate answers that might reflect poorly on the clinic.", "In one instance, about 92 minutes in, the woman asks the employee what would happen if the fetus \"came out in one piece\" after being removed during the evacuation phase of the abortion. The employee explains that this does not happen with that kind of procedure, saying, \"We've never had that.\" However, when pushed further, the employee responds, \"If it did come out in one piece, it's very small, so they would still have to put it in a jar, like a container with solution, and send it to the lab ... All our specimens have to go out to the lab. No matter what.\"", "The following (lightly edited) exchange then ensued:", "Live Action (LA) activist: That's just how you get rid of --", "Employee (E): We don't throw it out in the garbage ... The lab disposes [of] it...", "LA: So if you had to put it in that jar, what if it was like, twitching, or something like that?", "E: The solution will make it stop", "LA: Ok", "E: [Laughs] It's not going to be moving around in the jar.", "LA: Ok, the solution would make it --", "E: Yeah. That's the whole purpose of the solution.", "LA: So if it looked like it was like, breathing or something like that?", "E: It'll automatically stop. It won't be able to.", "A little later on, the conversation continued:", "LA: So what is the solution? It's just, like, something toxic or something?", "E: Yeah", "LA: Ok. [Both laugh]", "E: We have to keep it clean ... Because by the time it gets to the lab, it still needs to be freshly, you know --", "LA: Yeah.", "This is the exchange that gave rise to claims that the employee had said the clinic would \"put a born-alive baby in a jar of 'solution' to drown her,\" as Live Action described it, or that she would \"drown a baby who survives abortion in a jar of 'solution,'\" as LifeNews.com put it.", "What the employee said could quite reasonably give rise to the understanding that she was indicating that if an intact fetus showed signs of being alive after evacuation, the clinic would place it in a jar of solution in order to end its life. However, this cannot be stated with certainty, for two reasons.", "First, it's not clear that the employee understood the fetus to actually be alive and viable, in the scenario described by the undercover activist. It's quite possible the employee was speaking, in her mind, about a fetus which was non-viable, and showing only involuntary movements, moments before its inevitable and definitive demise.", "Second, the employee gave two contradictory descriptions of the purpose of the \"solution.\" In one instance she said the \"whole purpose\" of the solution was to stop the hypothetical \"twitching\" described by the activist, but shortly afterwards she correctly said the solution was designed to keep the material removed during evacuation \"fresh\" for its transfer to a laboratory — that is, the solution was a preservative designed only to preserve evacuated fetal remains for examination at a laboratory.", "It's also difficult to reconcile the fact that on the one hand, the employee insisted to the woman that with second-trimester dilation and evacuation, the fetus does not survive and does not remain intact, telling her \"We've never had that,\" but on the other hand she told the woman that the \"whole purpose\" of the liquid solution (which she later correctly said was designed to preserve specimens) was to stop signs of life in an intact fetus that survived such an abortion.", "It makes no sense that the \"whole purpose\" of the liquid solution would be to address an issue which, in the employee's description, the clinic had never encountered. This contradiction is difficult to explain or account for and suggests the employee was speaking thoughtlessly or in a confused mindset when she indicated that the clinic would knowingly end the life of a fetus that survived an abortion. The director of Dr. Emily Women's Center, Marjana Gelvez, told the Washington Post in 2013 that \"she had not viewed the video but that any employee who would say such a thing was misinformed.\"", "Regardless of the comments made by the employee in question, the clinic appears to have had a clear policy of attempting to revive and resuscitate a fetus in the extremely unlikely event that it survived an abortion. Later in the video (around 112 minutes in), the undercover activist speaks to the designated counselor at the clinic. The activist again asks questions about a hypothetical scenario in which an intact fetus survives the evacuation phase of the abortion. The counselor clearly explains the following policy: \"If [the fetus] was to come out, for some reason or another, the pregnancy is still alive and it comes out, he [the doctor] has to resuscitate it. He cannot do a termination once it's outside of the body. He has to resuscitate it and he has to send it to the hospital. That's the law.\"", "The activist continues to press the counselor, once again seeking to provoke a response that might reflect poorly on the clinic, asking, \"What if it's half-way out, alive?\" The counsellor immediately responds, \"He still has to resuscitate.\"", "Later in her conversation with the first employee (around 99 minutes into the video), the Live Action activist asks a series of questions about the first phase of the two-day dilation and evacuation procedure.", "The clinic employee tells her that the doctor will insert laminaria sticks into her cervix — small sticks made from seaweed that absorb moisture and expand, thereby dilating the cervix and making the evacuation phase of the abortion easier. She is told to go home that evening, rest, avoid strenuous activity, and allow the laminaria sticks to take effect while she sleeps.", "The employee warns the woman that she must be certain in her decision to go through with the abortion, before starting the first phase, because there are risks in undergoing the dilation phase without following it up with the evacuation phase. (This is true, but it's due to the higher risk of miscarriage and infection associated with laminaria dilation, as the clinic's counselor later explained to the activist, not because the laminaria sticks are \"toxic\" and \"kill the heartbeat\" of the fetus, as the employee incorrectly stated.)", "The activist then asks questions about a hypothetical scenario in which she feels labor pains that evening, after the insertion of the laminaria sticks, and the following (lightly edited) exchange ensues:", "Live Action (LA) activist: So if I feel like I'm having, like, labor pains kind of thing --", "Employee (E):Call us.", "LA: Call you?", "E: Yeah we have an emergency line. The same number, it goes to our emergency contact ...", "LA: Yeah 'cos I don't want to go into labor at home.", "E: Yeah I understand.", "LA: You know what I'm saying? Like, what if it pops out at home?", "E: If it comes out, then it comes out. Flush it.", "LA: Just, like, flush it?", "E: Yeah. But you still have to come in, 'cos we have to make sure that everything came out. But we've never had a situation like that ...", "LA: If it comes out, should we call you? Like, if we see it there --", "E: Call us. Give us a call and just follow whatever the girl on the phone will tell you. Ok?", "LA: Ok. 'Cos what if it's like, on the floor, you know what I'm saying? What would we do?", "E: You're not going to be taking care of it.", "LA: Like you guys would come and --", "E: Yes, if anything, you know, we'll tell you to put it in a bag or something, or somewhere, and bring it to us.", "LA: Ok", "E: You're not taking care of it.", "A little later on, the conversation continues:", "LA: Ok so like you'll bring a bag or something like that and I would just like have to put it in there?", "E: Yeah, don't worry -- it's not going to come out.", "LA: I'm just thinking, if it did, 'cos I'm always like, the worst-case scenario person.", "E: [Laughs] I can see. Yeah, it's not going to come out. We've never had that situation and we have two-day procedures all the time.", "This is the exchange that gave rise to claims that the clinic employee had told the woman to \"drown her baby in a toilet if the baby is born alive,\" as LifeNews wrote, and \"'flush' the baby down the toilet, or 'put it in a bag' if she's born alive,\" as Live Action described it.", "Whatever one's view is of the clinic employee's language and tone during the conversation, it's not clear that she had in mind a live birth or a viable fetus that has survived laminaria dilation when she said \"flush it.\"", "This is because, shortly before the remarks in question, the employee had been telling the woman that the insertion of the laminaria sticks \"stops the heartbeat\" of the fetus. This is not accurate, but the employee may have had in mind the fact that, in a dilation and evacuation procedure, the insertion of the laminaria sticks is sometimes accompanied by the injection of digoxin, a medication that induces cardiac arrest in the fetus. In part, this is done to ensure the demise of the fetus before its remains are removed in the evacuation phase, and it's one of the reasons why there are so few live births after abortions, especially in the second trimester.", "Although the employee appeared to be confused or misinformed about the effects of laminaria dilation, it seems perfectly plausible that she had in mind a fetus whose heart had already been stopped when the activist asked her, \"What if it pops out at home?\"", "Ultimately, however, the employee's remarks are not objectively clear in their meaning or intended meaning. We sent Director Gelvez a list of questions relating to the employee's comments and their intended meaning, as well as asking whether the woman was still employed at the clinic or had undergone additional training or disciplinary proceedings. Unfortunately, we did not receive a response to those questions.", "Without being able to clarify either the meaning or intended meaning of the employee's remarks, we issue a rating of \"Unproven\" in relation to the claims of LifeNews and Live Action that the clinic employee said she would \"drown\" a living, viable baby or instructed a would-be patient to herself \"flush\" a living, viable baby or \"put it in a bag.\"", "It should be noted that the employee's remarks were confused, confusing, and misinformed in several places, and that she made comments that were self-contradictory in ways that are salient to the question of what she actually meant. It should also be noted that in the same video, and despite pressure and incitement by the undercover activist, the designated counselor at the clinic clearly and unequivocally outlined a policy whereby, in the extremely unlikely event that a fetus survived an abortion, the clinic would attempt to resuscitate and revive it.", "Staff writer David Emery contributed to this story.", "Bilger, Micaiah.   \"WATCH: Abortion Clinic Staffer Says She Will Drown a Baby Who Survives Abortion in a Jar of 'Solution.'\"\r\n    LifeNews.com.   21 February 2019.", "Hurdle, Jon and Trip Gabriel.   \"Philadelphia Abortion Doctor Guilty of Murder in Late-Term Procedures.\"\r\n    The New York Times.   13 May 2013.", "Live Action.   \"Press Release -- Undercover Video Reveals Horrifying Testimony in Bronx, NY Abortion Clinic.\"\r\n    28 April 2013.", "Michigan Department of Health and Human Services.   \"Dilation and Evacuation (D & E).\"\r\n    Accessed 22 March 2019.", "Somashekhar, Sandhya.   \"Antiabortion Group Releases Videos of Clinic Workers Discussing Live Births.\"\r\n    The Washington Post.   29 April 2013.", "UCLA Obstetrics and Gynecology.   \"Surgical Abortion (Second Trimester.)\"\r\n    Accessed 22 March 2019.", "Society of Family Planning.   \"Clinical Guideline 20101 -- Induction of Fetal Demise Before Abortion.\"\r\n    January 2010.", "Robertson, Lori.   \"The Facts on the Born-Alive Debate.\"\r\n    FactCheck.org.   4 March 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]