["About this rating", "On 12 July 2017, the Vybz Media web site published an article claiming that hip-hop producer DJ Khaled had broken a horse's back while riding it during a video shoot.", "\"HE SAID HE WEIGHED 200 POUNDS, BUT OUR HORSE'S BACK DETERMINED THAT WAS A LIE.\"", "dj Khaled is paying for the funeral of a bahamian resort’s horse that he rented for a video shoot after its back was broken during an intense scene of dj Khaled getting on, and off the horse. Dj Khaled said“SOMETIMES YOU JUST GOTTA THROW THE WHOLE HORSE AWAY.”", "The headline claimed \"Resort kills horse after Dj Khaled broke its back during video shoot.\"", "The Vybz Media article did not offer any evidence to support its three claims: that the horse's back was broken during filming; that the resort had put down the animal, and that Khaled was paying for its funeral.", "Furthermore, the article contains two quotes: one appearing to come from staff at the resort, but not attributed to anyone in particular; and another from Khaled himself, with no source given for his purported comments.", "Vybz Media did embed a video showing DJ Khaled mounting and riding the horse, which was taken from his Instagram account and uploaded to YouTube. Since publication, the producer - whose album Grateful debuted at Number One in the Billboard Top 200 on 15 July 2017 - has received criticism and condemnation on social media from people believing the Vybz Media story to be true.", "Apart from the fact that DJ Khaled got on the horse, every detail in the article is inaccurate, and the story is a fabrication.", "We spoke by phone to Christina Turner, who runs Horseplay, a horseback riding business in Nassau, Bahamas that Khaled visited with his family. We have verified her identity.", "Turner owns the horse in question, Eclipse, a 19-year-old male part-Arabian breed horse who weighs roughly 1,100 lb and measures 15 hands (five feet tall). She told us Khaled's horse ride took place on 10 July 2017 and lasted \"probably less than 10 minutes.\"", "I got a call from [the One and Only] Ocean Club, where DJ Khaled was staying, saying that he wanted to do a family ride with his wife and child...His wife rode the horse in the water, his son rode the horse and then he rode the horse and he did a little quick clip for his Instagram. They were a very friendly, great family.", "\"That was the extent of the story,\" she added, \"until the crazy rumors.\"", "Turner confirmed that, contrary to the claim made by Vybz Media, the horse in question is not owned by the resort.", "Turner also sent us a photograph of herself and a healthy Eclipse standing next to a copy of the Nassau Guardian newspaper from 18 July 2017, eight days after DJ Khaled's visit.", "Christina Turner and Eclipse standing next to an 18 July 2017 copy of the Nassau Guardian newspaper. (Courtesy of Christina Turner).", "She also pointed to six photographs taken and posted to the Horseplay Facebook page on 12 July 2017, two days after Khaled's visit, which show Eclipse giving rides along a beach to several other clients. He is scheduled to give rides at a wedding on the weekend of 21 July 2017.", "She added that she had contacted Vybz Media to point out the factual errors in the article, including misidentifying the horse's owner, and had asked them to take down the article and issue a retraction. We have reviewed and confirmed these emails. As of 18 July 2017, the article remains online, unedited.", "The article is almost an exact copy of one published by the Viral Mugshot web site in November 2016, which claimed that rapper Rick Ross had broken a horse's back during a video shoot in Miami, Florida, forcing its owners to have it put down.", "That story contained the same unattributed quote: \"He said he weighed 200 pounds, but our horse's back determined that was a lie,\" and the same quote attributed to DJ Khaled by Vybz Media was originally attributed to Ross: \"Sometimes you just gotta throw the whole horse away.\"", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]