["About this rating", "The renowned physicist Stephen Hawking died in March 2018 at the age of 76, prompting a wave of tributes from the world of science, as well as reflections on his inspirational life story.", "On 14 March 2018, the \"Catholics Online\" Facebook page posted a photograph of Hawking meeting Pope Francis alongside a fabricated claim:", "Before he died, Stiph [sic] Hawkins [sic] who did not believe in God requested to visit the Vatican. \"Now l believe\" was the only statement he made after the Holy Father blessed him.", "Hawking was a longstanding and prominent atheist who often wrote and spoke about the origins of the universe and his views on the notion of a divine Creator (or rather, a lack thereof). As the Washington Post documented after his death, Hawking told the Guardian in 2011 that he did not believe in an afterlife or heaven:", "I regard the brain as a computer which will stop working when its components fail. There is no heaven or afterlife for broken down computers; that is a fairy story for people afraid of the dark.", "In 2010, he told ABC News: \"One can't prove that God doesn't exist, but science makes God unnecessary.\"", "There is no evidence that Hawking deviated from those lifelong views before his death, and he did not make any declaration of faith after a meeting with Pope Francis.The photograph in the Facebook post shows Hawking and Francis together at the Vatican in November 2016, the last time the two men met. Contrary to the claim, Hawking did not request a private visit with the pontiff; rather, he travelled to Rome for a scheduled meeting of the Pontifical Academy of Sciences.", "Hawking was a valued member of the academy, having been appointed to it by Pope Paul VI in 1968. The Pontifical Academy of Sciences listed has among its aims \"fostering interaction between faith and reason and encouraging dialogue between science and spiritual, cultural, philosophical and religious values.\" After his death, the academy honored Hawking, tweeting a series of photographs of the physicist meeting Popes Paul VI, John Paul II, Benedict XVI, and Francis.", "il beato Paolo VI che si inginocchia per consegnare la medaglia di Pio XI e Hawking che ringrazia al Papa per la decorazione pic.twitter.com/zVICFDlkaE", "— Casina Pio IV (@CasinaPioIV) March 15, 2018", "However, notwithstanding his decades-long commitment to fostering dialogue between science and faith, Hawking remained an unbeliever himself.", "Hawking's phony deathbed conversion is one in a long series of similar hoaxes of opportunity. For example, after the 2011 death of the writer Christopher Hitchens — an outspoken atheist and critic of organized religion — American evangelical Christian writer Larry Alex Taunton published a controversial book in which he claimed Hitchens had reevaluated his religious faith while he was dying of esophageal cancer. The book was widely dismissed and fiercely criticized by friends of Hitchens. Before that, there were debunked eleventh-hour \"conversions\" to Christianity by Charles Darwin, the father of the theory of evolution, and astronomer Carl Sagan.", "This Facebook post is just another in a litany of fabricated claims about famous non-believers. The source is a Facebook page associated with the disreputable web site FrancisMary.org, which appears to have no formal affiliation with the Catholic church and routinely posts clickbait articles touting videos of Jesus Christ appearing in the flesh during a church service, or as an \"angel on a white horse fighting in Israel.\"", "Johnston, Lori.  \"'I'm Not Afraid:' What Stephen Hawking Said About God, His Atheism and His Own Death.\"\r\n    The Washington Post.  14 March 2018.", "Sample, Ian.  \"Stephen Hawking: 'There is No Heaven; It's a Fairy Story.'\"\r\n  The Guardian.  15 May 2011.", "Watt, Nick.  \"Stephen Hawking: 'Science Makes God Unnecessary.'\"\r\n  ABC News.  7 September 2010.", "Glatz, Carol.  \"Pope Francis Meets Stephen Hawking at Vatican Science Conference.\"\r\n  Catholic Herald.  29 November 2016.", "Glatz, Carol.  \"Stephen Hawking Was a Longtime Member of the Pontifical Academy of Sciences.\"\r\n  Catholic Herald.  14 March 2018.", "Cohen, Nick.  \"Deathbed Conversion? Never. Christopher Hitchens Was Defiant to the Last.\" \r\n  The Guardian.  5 June 2016.", "Padian, Kevin.  \"Ten Myths About Charles Darwin.\"\r\n  BioScience.  Vol. 59, Issue 9. 1 October 2009.", "Adler, Jerry.  \"Unbeliever's Quest.\"\r\n    Newsweek.   30 March 1997.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]