["On October 16, French teacher Samuel Paty was decapitated in Paris for showing his students caricatures of the Prophet Muhammad in a class about freedom of expression. President Emmanuel Marcon, in his staunch condemnation of the attack, supported the display of Muhammed’s drawings even as it remains a contentious issue in Islam. A few days hence, three church-goers were killed in Nice, further dividing the French population. “An opinion poll after Paty’s murder found 79% of respondents felt “Islamism had declared war” on France and the French republic,” reported Scroll. The attacks have triggered public questioning of the loyalty of French Muslims.", "Social media users have now shared a 16-second video of a man attacking a burkha-clad woman walking down the street with children. “Such a trend has started in France (फ्रांस से रुझान आने शुरू),” reads the celebratory claim. The video has been widely shared on Twitter. @Aviknandi3 posted this video on October 31. Since then it has been viewed over 30,000 times. (archived link)", "फ्रांस से रुझान आने शुरू🙏🙏👍👍💪💪 pic.twitter.com/CuYki54mVs", "— अविक नन्दी (मोदीभक्त..एक स्वयंसेवक🚩🚩🚩) (@Aviknandi3) October 31, 2020", "Some Facebook users have also posted this video.", "Using InVID, a video verification browser plugin, Alt News performed a reverse image search on Google. Google-generated keywords described the picture as “muslim mother is attacked in nizhnekamsk”.", "This slideshow requires JavaScript.", "One of the search results led us to a tweet by Byline Times and columnist CJ Werleman. “A Muslim mother brutally attacked in front of her children in Nizhnekamsk city, Republic of Tatarstan. (via DOAM)” he wrote on July 8. Twitter account Documenting Oppression Against Muslims (DOAM) had posted the video a day earlier.", "Muslim mother brutally attacked in front her children in a park in #Nizhnekamsk city, Republic of #Tatarstan.", "He attacked 5 women including a pregnant woman in a public park.", "He was arrested and detained. When asked about his motive, he said because of his “hatred for women”. pic.twitter.com/INBfEoWaeN", "— DOAM (@doamuslims) July 7, 2020", "The incident was also reported by Tatarstan State TV and Radio Company and a Russian news website. As per the reports, a 34-year old man was arrested for attacking a pregnant woman and other pedestrians.", "This slideshow requires JavaScript.", "Arabic news website Al-Quds Al-Arabi reported the same on July 9.", "(روسيا.. اعتداء وحشي على امرأة مسلمة أمام أطفالها) – https://t.co/BVD1JobSow pic.twitter.com/cPfCc6SIk2", "— القدس العربي (@alqudsalarabi) July 8, 2020", "Thus a video from July that shows a man attacking a mother in front of her children in Nizhnekamsk, Russia has been falsely shared as France.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]