["An online hoax smashed together a 2015 comment by Donald Trump and a comedian’s roast of the Trump administration to make up a story about CNN.", "\"CNN shocks America, fires ‘journalist’ who made fun of Sarah Sanders’ face,\" said an April 29 headline by Daily World Update.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat online hoaxes.", "On April 28, comedian Michelle Wolf hosted the annual White House Correspondents’ Association Dinner in which she made fun of press secretary Sarah Huckabee Sanders. Part of Wolf’s remarks were interpreted as a jab at Sanders’ appearance; she indirectly referred to her as a softball coach dividing the press corps into teams, and that Sanders \"burns facts, and then she uses that ash to create a perfect smoky eye.\" Trump, as well as some members of the press association, criticized Wolf’s remarks.", "The Daily World Update wrote that Marvin Schmidt, a supposed former CNN co-host, was fired after he defended Wolf’s remarks.", "\"Look at that face,\" Schmidt said in an alleged now-deleted tweet, The Daily World Update wrote. \"I mean, she’s a woman and I’m not supposed to say bad things but really folks, come on! Are we serious?\"", "That quote was actually made by Trump in a Rolling Stone interview in 2015 when speaking about GOP presidential contender Carly Fiorina.", "\"Look at that face!\" he cries. \"Would anyone vote for that? Can you imagine that, the face of our next president?!\" The laughter grows halting and faint behind him. \"I mean, she's a woman, and I'm not s'posedta say bad things, but really, folks, come on. Are we serious?\"", "CNN has no co-host named Marvin Schmidt, a CNN spokeswoman Barbara Levin told PolitiFact. She said the story was fabricated.", "The Daily World Update story includes a photo of three people on CNN, including a black man in the middle with a red circle drawn around his face suggesting that he was the alleged Schmidt who was fired. We searched for the photo in Google Images and found that it matched a panel of guests on CNN in February 2016 about the reaction to Beyonce’s album Formation. The black man on the panel was Bakari Sellers, a CNN commentator and a former South Carolina state representative. Sellers told PolitiFact that he hasn’t spoken on CNN about Wolf’s speech to the White House Correspondents Association.", "The Daily World Update describes itself as satire. But this story hardly meets that definition. The website is linked to a frequent purveyor of such hoaxes, Christopher Blair, who says he creates fake stories to make money.  The post Facebook users see would give little clue to the fact that the story is made up.", "The Daily World Update wrote that \"CNN shocks America, fires ‘journalist’ who made fun of Sarah Sanders’ face.\" The story said that Marvin Schmidt was fired by CNN, but there is no co-host at CNN by that name. The story said Schmidt tweeted an insult about Sanders’ appearance, but the actual quote came from Trump in 2015 about Carly Fiorina.", "We rate this headline Pants on Fire.", "Daily World Update, \"CNN Shocks America, FIRES ‘Journalist’ Who Made Fun Of Sarah Sanders’ Face,\" April 29, 2018", "MEDIAite, \"Watch CNN Panel’s Hilarious Reaction to White Guest Saying Beyoncé Performance Was ‘Racist,’\" Feb. 24, 2016", "Raw Story, \"WATCH: CNN panel laughs in cop apologist’s face after he labels Beyoncé a ‘racist,’\" Feb. 24, 2016", "CBS News, \"What did Michelle Wolf actually say about Sarah Sanders at the WHCD?\" April 29, 2018", "CBS News, \"Trump blasts Michelle Wolf's correspondents' dinner remarks about Sarah Huckabee Sanders,\" April 30, 2018", "Strom Law, Bakari Sellers, Accessed April 30, 2018", "Rolling Stone, \"Trump Seriously: On the Trail With the GOP's Tough Guy,\" Sept. 9, 2015", "PolitiFact, \"If you're fooled by fake news, this man probably wrote it,\" May 31, 2017", "Interview, Bakari Sellers, April 30, 2018", "Interview, Barbara Levin, CNN spokeswoman, April 30, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]