["About this rating", "On Dec. 2, 2020, TikTok user Jordan Lewis, aka @driftyjayy, posted a video that showed a purported hack for \"how to get free food from Chick-fil-A.\" In the video, Lewis pointed his camera at a Chick-fil-A drive-thru speaker and ordered a meal with four Chick-fil-A sauces.", "Lewis was asked: \"Will that be all for you sir?\"", "Lewis responded: \"Yes, thank you.\"", "After a brief silence, Lewis said \"my pleasure\" before the supposed employee had a chance to say it. He was then told: \"Your total is $0.\"", "Unfortunately for fans of Chick-fil-A, the video was a prank. Lewis appeared to possibly even do the voice of the supposed employee. Other TikTok videos from Lewis are also pranks, and appeared to all be in good fun.", "The Chick-fil-A hack video had amassed more than 3.8 million views in less than a week.", "Over the years, we've seen no shortage of Chick-fil-A scams and rumors. We previously reported on Facebook scams that promised free Chick-fil-A food and gift baskets, an outdated offer for free food for a year, Mother's Day fakery, and even a different fake offer for mothers that was unrelated to Mother's Day.", "As for the December 2020 TikTok video, if a customer says \"my pleasure\" to a Chick-fil-A employee, it does not entitle the customer to free food. The video posited that saying it before an employee can get the words out would do the trick. Others have tried to say it up front like a code word. Neither are likely to be successful strategies.", "The idea for customers to say \"my pleasure\" for free Chick-fil-A menu items had been shared on social media for at least a few years. Some customers believed that it earned a free ice cream cone or other dessert, such as the Icedream Cone or Cookie Icedream Sandwich:", "This was not true, although that's not to say that the company had never given a free dessert to customers. In 2016, the company started its \"Cell Phone Coop\" family challenge. The idea was for a family who dines inside a Chick-fil-A restaurant to place all of their mobile phones in the special \"coop\" during their meal. If all family members abstained from checking their phones, they each were rewarded with an ice cream cone.", "Courtesy: Chick-fil-A", "On May 14, 2018, WANE 15 News interviewed Jeff Hoffman, who owned and operated a Chick-fil-A restaurant in Fort Wayne, Indiana. He talked about the reason behind the company's usage of the phrase \"my pleasure.\" He referred to S. Truett Cathy, who founded Chick-fil-A in 1946:", "Mr. Cathy said if you can only say three words or two words to somebody today, and you said the words \"you're welcome,\" that's an empty statement. What does that even mean? What is that?", "But if you say \"it's my pleasure,\" it's from your heart and genuine, that's a really meaningful thing. You leave that positive impression with the guest.", "The Chick-fil-A website published the history of the company's usage of \"my pleasure.\" The idea came to Cathy after visiting a luxury hotel:", "Cathy was visiting a high-end hotel, and when he thanked an employee, the man helping him replied genuinely, “My pleasure.” Cathy felt his sincerity, and the memory of the man’s smile and those two little words stayed with him for several days. He decided to ask his restaurant owners, team members, and even his corporate staff to respond with “my pleasure” whenever someone said thank you.", "“You expect that from a five-star hotel,” Cathy said. “But to have teenagers in a fast-food atmosphere saying it’s their pleasure to serve—that’s a real head-turner.”", "“My pleasure” became an expression of love for customers. Almost immediately Cathy began receiving letters from customers telling him about their experiences after hearing restaurant team members say those magic words. It was genuine, and customers knew it.", "Over the years, the phrase \"my pleasure\" has spawned an unofficial Chick-fil-A rap video, countless TikTok memes, and a number of comedy sketches:", "The comedy sketch from the RDCworld1 YouTube channel played on the \"exceptional\" level of customer service for which Chick-fil-A had become known. A portion of the sketch depicted someone having car trouble with Chick-fil-A employees coming to the rescue, a situation that Chick-fil-A employees have assisted with in the past.", "While we're all for entertaining videos, we don't advise looking to pranks on TikTok for tips on how to earn free eats at fast food restaurants.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]