["About this rating", "Editor's note: Following Kamala Harris' selection as Joe Biden's vice-presidential running mate in the 2020 U.S. presidential election, a claim that she is ineligible to serve as president (and therefore vice president) due to the naturalization status of her parents resurfaced. Snopes first investigated this claim during Harris' campaign for the Democratic presidential nomination in January 2019, when internet troll Jacob Wohl argued from his (since-banned) Twitter account that  \"Kamala Harris is NOT eligible to be President\" because neither of her parents was a legal resident of the United States for five years, which was he argued, \"a requirement for naturalization.\" We ranked the claim \"False.\"", "The theory regained a veil of legitimacy following an opinion piece published by Newsweek in which law professor John C. Eastman —  who wrote a January 2016 opinion piece for National Review about how Ted Cruz was eligible to serve as president despite not being born in the United States — argued that Kamala Harris may not be eligible to serve as president despite being born in the United States. Eastman proffered an arcane constitutional argument that Harris may not have been a citizen at birth because while she may have been \"born ... in the United States,\" she was not necessarily entirely \"subject to the jurisdiction thereof,\" a portion of the 14th Amendment's citizenship clause that has been overlooked, he argued.", "The claim has no more legitimacy now than it did when Wohl proffered it, for many of the same reasons regarding the common law interpretation of \"natural born citizen\" present in our original article. As UCLA law professor Eugene Volokh wrote in response to Eastman's piece:", "\"It's possible that 'natural-born citizen' has since been broadened to include children of U.S. citizens born overseas .... but it hasn't been narrowed, and in U.S. v. Wong Kim Ark (1898), the Court interpreted the 14th Amendment as reaffirming that people born in the U.S. are indeed natural-born citizens, regardless of their parents' citizenship.\"", "Our rating remains unchanged. Our original article is below:", "In January 2019, Jacob Wohl -- a Twitter political troll and veteran of a failed smear campaign against Robert Mueller -- dipped his toes into the topic of constitutional law, asserting his view that 2020 Democratic presidential candidate Senator Kamala Harris of California was constitutionally ineligible to hold the office of President of the United States:", "Kamala Harris is NOT eligible to be President. Her father arrived from Jamaica in 1961—mother from India arrived in 1960", "Neither parent was a legal resident for 5 years prior to Harris’s birth, a requirement for naturalization", "Kamala was raised in Canada", "— Jacob Wohl (@JacobAWohl) January 22, 2019", "Kamala Harris is NOT eligible to be President. Her father arrived from Jamaica in 1961 -- mother from India arrived in 1960. Neither parent was a legal resident for 5 years prior to Harris’s birth, a requirement for naturalization. Kamala was raised in Canada ...", "Just like the worst President in American History, Barack Hussein Obama, Kamala Harris was NOT raised in the United States. Is it too much to ask to have a President that was born and RAISED in America?", "The constitutional requirements for the office of U.S. president are few. As stated in Article II Section 1 of the U.S. Constitution, they encompass only citizenship, residency, and age:", "No person except a natural born citizen, or a citizen of the United States, at the time of the adoption of this Constitution, shall be eligible to the office of President; neither shall any person be eligible to that office who shall not have attained to the age of thirty five years, and been fourteen Years a resident within the United States.", "The term “natural born citizen” is not defined in the constitution, but “natural born” was a term commonly used in the English colonies during the time the Founding Fathers were crafting the Constitution. Like the U.S. constitution itself, the term has roots in English common law, and in cases when constitutional terms are undefined, English common law is generally cited to clarify them -- as explained in a 2011 Congressional Research Service (CRS) report:", "At the time of independence, and at the time of the framing of the Constitution, the term “natural born” with respect to citizenship was in use for many years in the American colonies, and then in the states, from British common law and legal usage.", "Under the common law principle of jus soli (law of the soil), persons born on English soil, even of two alien parents, were “natural born” subjects and, as noted by the Supreme Court, this “same rule” was applicable in the American colonies and “in the United States afterwards, and continued to prevail under the Constitution ...” with respect to citizens.", "In textual constitutional analysis, it is understood that terms used but not defined in the document must, as explained by the Supreme Court, “be read in light of British common law” since the Constitution is “framed in the language of the English common law.”", "The requirements for President are therefore simple and have nothing to do with the naturalization status of one's parents:", "Kamala Harris was born in Oakland, California, on 20 October 1964, making her at least 35 years old and unambiguously a natural-born United States citizen. Any child born on U.S. soil is a citizen of the United States from birth, regardless of the naturalization status of the child's parents, and regardless of Jacob Wohl’s perplexing assertion to the contrary. Though Harris spent her high school years in Canada, she has been resident in the United States since her time as an undergraduate at Howard University that began in 1982, and she has served in public office in the U.S. continuously since the 1990s.", "Jacob Wohl is no stranger to invective targeting foreigners, and he seemingly attempted to portray Harris’ high school years in Canada as some sort of nefarious evidence of (perhaps ironically) foreign influence in American politics. “Is it too much to ask to have a President that was born and RAISED in America?” Wohl implored his audience.", "Kamala Harris, the daughter of a Stanford professor father and breast cancer researcher mother, describes herself as having been raised “in Berkeley and in Oakland and in Montreal.” Her parents divorced when she was seven years old, after which she lived with her mother, Shayamala Harris, whose work took her to positions with the Jewish General Hospital and the McGill University Department of Medicine, both of which are located in Montreal, in the Canadian province of Quebec.", "Regardless, Kamala Harris has resided in the United States since she left Montreal for Howard University in 1982. She has been a United States citizen her entire life, and she is constitutionally eligible to run for president.", "Legal Information Institute.   \"U.S. Constitution, Article II.”\r\n    Accessed 22 January 2019.", "Maskell, Jack.   \"Qualifications for President and the 'Natural Born' Citizenship Eligibility Requirement.”\r\n    Congressional Research Service.   14 November 2011.", "Encyclopaedia Britannica.   \"Kamala Harris (United States Senator)”\r\n    Accessed 22 January 2019.", "Kamala D. Harris, U.S. Senator for California.   \"About.”\r\n    Accessed 22 January 2019.", "Whiting, Sam.   \"Kamala Harris Grew Up Idolizing Lawyers.”\r\n    SFGate.   14 May 2011.", "Shannon, Chelsea.   \"Need to Know: Who is Kamala Harris?”\r\n    KXTV [Scaramento].   21 January 2019.", "SFGate.   \"Obituary: Dr. Shyamala G. Harris.”\r\n    22 March 2009.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]