["About this rating", "In late June 2020, Facebook users shared a video that showed a person being accosted by multiple assailants, along with claims that the incident occurred in Minneapolis during Black Lives Matter protests earlier in the month. We included a screenshot of the June 17, 2020, Facebook post, but cropped the users name out for the sake of privacy. However, the video can be viewed via YouTube here (We advise caution because the video is disturbing):", "The video in question does contain footage of a real crime, but the incident had nothing to do with Black Lives Matter protests that took place nationwide in the spring of 2020. Instead, the video is surveillance camera footage that depicts an attempted robbery and assault that took place on August 3, 2019, near Target Field in Minneapolis. A similar attack occurred days later on Aug. 17, 2019, but in a different location.", "The Hennepin County Attorney's office charged 18 people from ages 15 to  27 in connection with the two attacks -- the first of which was depicted in the video above -- as described in a press release:", "According to criminal complaints and juvenile petitions, the first incident occurred during daylight on the morning of Aug. 3. Minneapolis Police received surveillance video of an attempted robbery outside of Target Field. The video showed about a dozen people trying to take a man’s cell phone and viciously beat him and kick him as they also ripped off his shoes and pants as they went through his pockets.", "By the end, the victim was lying on the ground where he was jumped on, hit with planting pots and run over by a bicycle. The victim and the suspects were gone before police arrived.", "This isn't the first time this surveillance footage has been misappropriated. In September 2019, Minnesota Public Radio reported that \"Right-wing social media users and digital websites masquerading as legitimate news sources\" were falsely reporting that the video showed an attack by a \"Somali mob.\" Police confirmed that none of the alleged attackers were Somalis.", "During the spring of 2020, Black Lives Matter protests swept the nation after the in-custody death of George Floyd, an unarmed Black man who died while pinned under the knee of Minneapolis police officer Derek Chauvin. Floyd's death sparked widespread outrage and some protests that resulted in property destruction in Minneapolis. However, because the incident in the video above has no connection to the Black Lives Matter protests of 2020, we rate this claim as \"Miscaptioned.\"", "Pioneer Press. \"Group Beats and Robs Man Outside Target Field in Minneapolis.\"\r\n  YouTube. 2019.", "Ibrahim, Mukhtar M. \"Commentary: Somali Mob Didn't Attack Man in Minneapolis, But Facts Won't Stop the Hate.\"\r\n  MPR News. 18 September 2019.", "Hennepin County Attorney's Office. \"Eighteen People Charged in Two Separate Downtown Minneapolis Incidents.\"\r\n  September 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]