["China is a major source of hair extensions, and the industry has been affected by the 2019 coronavirus outbreak.", "The Food and Drug Administration has found no evidence that the virus is spreading via imports.", "A contributor for a popular morning radio show says bad hair days could be a side effect of the 2019 coronavirus.", "An article published on a site called Toine360 claims that \"hair weave and lace fronts manufactured in China may contain the coronavirus.\" The site is run by radio personality Toine the Don, a contributor to the Rickey Smiley Morning Show.", "\"It may be time to show us what your scalp and edges really look like, ladies!\" the article reads.", "The article was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Since emerging in Wuhan, China, in December, the 2019 coronavirus — officially known as COVID-19 — has infected more than 82,000 people in 46 countries, and 2,804 have died.", "China is a major source of hair extensions. But there is no evidence that synthetic or human hair is being shipped with the coronavirus.", "On Feb. 24, CNN reported that the human hair market has been affected by the coronavirus outbreak. Some hair extension factories in China have temporarily closed amid fears that they could be breeding grounds for the coronavirus. Other manufacturing sectors have been similarly affected.", "RELATED: PolitiFact’s coronavirus coverage in one place", "U.S. Customs and Border Protection is tasked with screening imports for hazardous substances. It works with agencies like the Centers for Disease Control and Prevention and the Food and Drug Administration to prevent the importation of diseases.", "The FDA announced alternative steps to screen products imported from China. The agency said there’s no evidence that the coronavirus can spread through imports.", "\"Fortunately, currently, we are not seeing the impacts of this outbreak resulting in an increased public health risk for American consumers from imported products,\" the FDA wrote. \"There is no evidence to support transmission of COVID-19 associated with imported goods and there have not been any cases of COVID-19 in the United States associated with imported goods.\"", "The Toine360 article is inaccurate. We rate it False.", "CNN, \"Stranded lobsters and missing wedding dresses: The coronavirus is a daily reminder of China's global reach,\" Feb. 24, 2020", "The New York Times, \"Slowed by the Coronavirus, China Inc. Struggles to Reopen,\" Feb. 17, 2020", "Quartz, \"Check the label: China now dominates the low-cost hair extension business,\" Sept. 13, 2018", "Toine360, \"Hair Weave and Lace Front Made In China May Contain Coronavirus\"", "United States Customs and Border Protection, Cargo Examination, accessed Feb. 27, 2020", "United States Food and Drug Administration, \"Coronavirus Update: FDA steps to ensure quality of foreign products,\" Feb. 24, 2020", "World Health Organization, Coronavirus disease 2019 (COVID-19) Situation Report – 38, Feb. 27, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]