["About this rating", "In late September 2017, ongoing debate about NFL players and the National Anthem renewed interest into social media and e-mail forwards about former Naval intelligence officer Janaye Ervin and her purported refusal to stand during the song the year before:", "We were unable to find any recent development in late September 2017 that might revive the story, except for viral \"taking a knee\" controversies that swept the United States' public discourse during that time.", "A year before, the International Business Times referenced a post (since deleted) that was purportedly shared by Ervin at that time:", "SusanSarandon : RT ShaunKing: On Monday, in uniform, Janaye Ervin made the decision to not… https://t.co/j0jlHCdfrW) pic.twitter.com/eYiavMtyeU", "— Progressive Party (@actprogressive) September 22, 2016", "Ervin was quoted as having said in the original post:", "I have been proudly serving in the US Navy Reserve Force since November 2008. I have pledged to support and defend the Constitution of the United States and to spread freedom and democracy around the world. I will never waver from that pledge. I feel like a hypocrite singing about the ‘land of the free’ when I know that only applies to some Americans. I will gladly stand again, when ALL AMERICANS are afforded the same freedom.", "U.S. Navy guidelines about \"morning colors\" [PDF] stipulate that all naval service personnel stand:", "Whenever the national anthem of the United States is played, all naval service personnel not in formation stand at attention and face the national ensign; if the national ensign is not being displayed, they face the source of the music. When covered, they salute at the first note of the anthem. Persons in formation are brought to order arms or called to attention as appropriate.The formation commander faces in the direction of the music or ensign and renders the salute for the unit. Persons in formation participating in a ceremony, on the formation commander’s command, follow the procedure prescribed for such persons during colors; persons in civilian clothes comply with the rules and customs established for civilians.", "Much of what is being circulated in 2017 dates back to September 2016, when Ervin originally shared the status update. In an interview published in December 2016, Ervin and a Navy Reserve Forces spokesperson described what happened after the viral controversy. Ervin said that she lost her security clearance and a civilian job after the dustup; the spokesperson said she was honorably discharged:", "For the first time since the protest, Ervin gave her account of the incident and the subsequent fallout. In exclusive interviews with IBT this week, she also explained what inspired the protest.", "\"Petty Officer Janaye Ervin has fulfilled her obligation of enlistment and was honorably discharged from the United States Navy,\" a Navy Reserve Forces spokesperson said in response to an IBT request for comment.", "A Navy brat whose grandfather, father and brother also served, Ervin never expected to be at odds with the brass. But her September protest made headlines across the country, apparently even drawing attention from Colin Kaepernick, the NFL quarterback whose anthem protest drew both followers and harsh critics ... She was fired from her job at Leidos, a government contractor, after someone from the Navy called her employer to say her clearance was suspended, she said. Ervin told IBT the company’s human resources department told her they didn’t have work for her without a security clearance.", "In a 30 December 2016 Facebook post, Ervin addressed her departure from the Navy Reserves:", "Despite what recirculated blog posts appeared to report, Ervin was not dishonorably discharged for her actions, according to accounts provided by the former sailor herself, as well as a Navy Reserve spokesperson.", "Price, Greg.   \"Janaye Ervin Update: Navy Confirms Investigation Into Sailor’s Refusal To Stand For National Anthem.\"\r\n    International Business Times.   26 September 2016.", "Price, Greg.   \"What Happened To Janaye Ervin: Navy Punished, Threatened And More, Ex-Sailor Says In Exclusive Interview.\"\r\n    International Business Times.   22 December 2016.", "Seck, Hope Hodge.   \"Second Sailor 'Under Review' For Refusing To Stand For Anthem.\"\r\n    Military.com.   23 September 2016.", "Wang, Amy B.   \"The Raging Debate Over The American Sailor Who Refused To Salute During The National Anthem.\"\r\n    Washington Post.   29 September 2016.", "United States Navy Regulations.   \"Chapter 12 - Flags, Pennants, Honors, Ceremonies and Customs.\"\r\n    Accessed 25 September 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]