["About this rating", "Employers in California are largely barred from asking potential employees about criminal histories.", "Employers can conduct criminal background checks after a conditional employment offer has been made.", "On 18 January 2018, a Sacramento resident said in a Facebook post that a law had just gone into effect in California that prohibits employers from asking prospective employees on job applications whether they have any criminal convictions. The post went viral and has been shared tens of thousands of times:", "Some asked if the content of the post was accurate. For the most part, it is. The law, known as the \"Fair Chance Act,\" bars most public and private employers in the state of California from asking applicants about their criminal histories -- a move intended to reduce recidivism and inequality.", "Davon Martinez, 24, who wrote the Facebook post, told us he spent four years in prison for charges related to armed robbery and firearms. While incarcerated, Martinez became one of the many California inmates who battled the state's infamous wildfires. He said his own criminal history hasn't created a barrier to finding work for himself, but expects the new law will help others in similar positions. When asked if he was surprised that the post had gone so viral, he said he was -- but that \"nothing is crazier\" than prison.", "The legislation Martinez referred to is Assembly Bill 1008, authored by Assembly Member Kevin McCarty (D-Sacramento) and signed by Governor Jerry Brown in October 2017. It became law on 1 January 2018. Currently nine other states have similar laws on the books -- Connecticut, Hawaii, Illinois, Massachusetts, Minnesota, New Jersey, Oregon, Rhode Island, and Vermont. Dozens of cities and counties have similar local ordinances in place. Per AB 1008:", "AB 1008 provides that it is an unlawful employment practice for an employer to include on any\napplication for employment any question that seeks the disclosure of an applicant’s conviction history; to inquire into or consider the conviction history of an applicant until after the applicant has received a conditional offer; and, when conducting a conviction history background check, to consider, distribute, or disseminate specified information related to prior convictions, except where certain state laws require a background check, as in the case of law enforcement positions.", "The legislation doesn't bar employers from performing criminal background checks, but only allows them to do so late in the hiring process. The idea is to encourage employers to consider a potential worker's other qualifications before writing them off from the outset. McCarty's office released a statement noting that allowing employers to disqualify applicants at the start of the hiring process due to a past conviction harms a large number of Californians and contributes to higher recidivism rates:", "The evidence is also clear that ban-the-box laws contribute to a marked increase in hiring of people with records. One multi-year study observed that an employed person with a conviction history had a 16% recidivism rate compared to a 52.3% recidivism rate by those lacking employment. The timing of an employer inquiry into conviction history is crucial: personal contact can reduce the negative stigma of a conviction and increase a person’s likelihood of being viewed as more than just his or her record and ultimately hired. Tailoring hiring practices to reduce such stigma and offer workers with records a fair shot at employment is crucial for building healthy workplaces and communities.", "The \"fair chance\" laws taking effect across the country come on the heels of the \"Ban the Box\" movement, referring to the check box where applicants are asked a yes-or-no question about whether they have criminal convictions in their past. Despite the intentions of the law, there is controversy over whether it effectively reduces employment discrimination. A 2016 study indicated that giving employers less information about a potential hire's background encouraged more, not less, racial discrimination.", "Semuels, Alana. \"When Banning One Kind of Discrimination Results in Another.\"\r\n  The Atlantic. 4 August 2016.", "La Gorce, Tammy. \"As ‘Ban the Box’ Spreads, Private Employers Still Have Questions.\"\r\n  The New York Times. 22 November 2017.", "Singh, Lakshmi. \"Ban The Box: What This New Law Means For Potential Employees With A Criminal Record.\"\r\n  NPR. 21 October 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]