["The two-minute, 56-second video was uploaded on Facebook on March 29, 2020. It has been viewed more than 9,800 times and shared more than 620 times.", "Below is a screenshot of the misleading video:", "The video’s Indonesian-language caption translates to English as: “After it was prohibited in Spain (Andalusia) 500 ago, azan was called for the first time yesterday (March 28, 2020) in the land where Islam used to be victorious, and this happened when the coronavirus crisis becomes global.”", "The white text across the bottom of the video reads in English as: “The first azan in Spain after it was banned for 500 years”.", "The novel coronavirus, which causes the disease COVID-19, was first identified in the Chinese city of Wuhan in December 2019. The outbreak has become a global pandemic.", "As of April 9, 2020, Spain has recorded more than 140,000 cases of COVID-19 and nearly 14,000 deaths, according to World Health Organization (WHO) data here.", "Azan, or adhan, is the Islamic call to prayers.", "The same video, along with a similar claim, has been viewed more than 23,000 times after it was posted here, here, here and here on Facebook; here and here on YouTube; and here on Twitter.", "The clip has also been shared in English with a similar claim here and here; and in Malaysian here and here.", "The claim is false; the video was taken in Azerbaijan before the virus was first detected; there has been no ban on adhan in Spain in recent times.", "A Google reverse image search using a keyframe of the video generated with InVID-WeVerify, a video verification tool, and subsequent keyword searches found the same video first published here on Instagram on November 20, 2019. It was shared by Instagram user Kenan Musaev.", "#azerbaijan #balaken #azan #islam @hikmet__askerov", "A post shared by  Kenan Musaev (@kenan_musayev) on Nov 19, 2019 at 2:42pm PST", "“The city where we hear the call to prayer.. Balakan!” the Azerbaijani-language caption reads according to a translation from an AFP journalist in Turkey.", "Balakan, or Belokany, is a city in the northwestern part of Azerbaijan.", "The owner of the Instagram account wrote in the post’s comment on April 3, 2020, that he shot the video in November 2019 in the city of Balakan and that it “has nothing to do with Spain”.", "“This is not Spain,” he said, adding that the person seen standing inside the minaret in the beginning of the video is himself.", "Below is a screenshot of his comment:", "After his footage went viral, Musaev posted this clip on Instagram from a Turkish television channel that had used his video out of context. He clarified that the footage was taken in Azerbaijan, not Spain.", "Əslində bunu dostum @hikmet__askerov ilə Allah rizasına çəmişdik..çoxdanki arzum idi Balakən minarəsini çəkmək..və qardaş türkiyənin @atvturkiye bu videonu Azərbaycan deyiıldə İspaniya kimi yayımlamasına təəcüb elədim amma üzülmədim..Sayın Ərdoğan abimizidə bizi izləməyinə sevindim.. Azan hər yerdə Azandır..Amme Balakənin İspaniyaya bənzəməyini bilmirdim..Atv türkiyə televiziyonçuları..informasiya verəndə bir az dikkatlı olalım amma..Allah bizi qorusun.", "A post shared by  Kenan Musaev (@kenan_musayev) on Mar 31, 2020 at 1:46am PDT", "The Azerbaijani-language caption of the video reads in part as: “Azerbaijan or Spain? Actually, we shot this (video) with my friend @hikmet_askerov for the love of God. I wanted to shoot the minaret of Balakan for a long time... When brotherly Turkey's ATV aired it saying it was not in Azerbaijan but in Spain, I was surprised but not sad.”", "The location of the mosque in the video can be seen here on Google Maps.", "Below is a screenshot of a photo taken near the mosque found on Google Maps:", "Below is a screenshot comparison between the video in the misleading posts (L) and the mosque on Google Maps (R). AFP has highlighted prominent features in red.", "The claim that the Islamic call to prayer has been banned in Spain is also false. The Spanish constitution and the Religious Freedom Law guarantee freedom of religion and freedom to worship to adherents of different religions in the country, including Muslims.", "The Grand Mosque of Granada, in the Spanish city of Granada, posted on Facebook this video that shows a man reciting adhan at the mosque in July 2017.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]