["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "As the COVID-19 coronavirus disease pandemic spread across the globe in March 2020, conspiracy buffs shared memes and videos featuring variations on a common theme — the SARS-CoV-2 virus was a human-made creation developed in a Chinese lab owned by all-purpose boogeyman George Soros for the purpose of causing economic disruption that would unseat Donald Trump from the U.S. presidency:", "We've extensively covered the false notion that the SARS-CoV-2 virus was bioengineered in a lab in Wuhan, China, in a separate article and concluded that:", "The theory that SARS-CoV-2 was manufactured in, and escaped from, a lab in Wuhan is based solely on the proximity of infectious-disease labs near a potential source of the COVID-19 outbreak. Several “scientific” claims have been made or manufactured to further bolster the notion that something nefarious is going on with COVID-19 and these labs, but this information comes from non-peer-reviewed papers misconstrued to be actual additions to the scientific record, or from disreputable websites such as Mercola.com. The actual scientific facts known about the novel coronavirus leave little room for it to be a virus of human creation, however.", "Regardless, the idea of a Soros connection to the COVID-19 pandemic stems from the fact that Wuhan, China, was the apparent origin point of the novel coronavirus, and WuXi AppTec, a Shanghai-based pharmaceutical, biopharmaceutical, and medical device company, operates a \"small molecule drug discovery and research services\" facility there. And according to the conspiracy theory, Soros \"owns WuXi AppTec.\" QED.", "However, Soros holds no executive position at WuXi AppTec, and a list of the company's major shareholders shows that none owns more than 10% of the shares, and all of the largest shareholders are Chinese entities with no discernible connection to Soros himself.", "A May 2011 quarterly report filed with the U.S. Securities and Exchange Commission (SEC) shows that Soros Fund Management, a private American investment management firm, does (or did) have a holding in a related company (Wuxi PharmaTech (Cayman)). However, such institutional investment is common in the business world and does not make the head of any given investment firm the \"owner\" of all the businesses in which the firm holds a stake.", "When pulled, the thread of Soros to Soros Fund Management, to Wuxi PharmaTech (Cayman), to WuXi AppTec, to a biotech research facility in Wuhan, leads to nothing. All credible scientific evidence indicates the SARS-CoV-2 virus evolved or mutated and was not bioengineered, and the addition of Soros to any far-fetched conspiracy theory indicates nothing so much as a lack of imagination.", "Marriage, Madison.   \"Hedge Funds’ Move to Become Family Offices Is Not Entirely Popular.\"\r\n    Financial Times.   22 October 2015.", "Kasprak, Alex.   \"The Origins and Scientific Failings of the COVID-19 ‘Bioweapon’ Conspiracy Theory.\"\r\n    Snopes.com.   1 April 2020.", "Secon, Holly et al.   \"A Comprehensive Timeline of the New Coronavirus Pandemic, From China's First COVID-19 Case to the Present.\"\r\n    Business Insider.   1 April 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]