["About this rating", "In August 2018, a bit of Islamophobic copypasta started making its way around social media, asserting that the mayor of Minneapolis, Minnesota had canceled a 4th of July city fireworks display but allowed \"Muslim animal sacrifice\" to be held in the city's U.S. Bank Stadium (home of the Minnesota Vikings football team) the following month:", "This copypasta was based on a bit of fake news, a fear-mongering report about the Muslim holiday Eid al-Adha, and a misreading of two genuine news reports.", "Fake News", "On 10 June 2018, the Last Line of Defense web site published an article positing that the Muslim mayor of Minneapolis had \"canceled the 4th of July\":", "Mayor Ahneid al Ahmed of Haskentot, Minnesota has done the unthinkable and canceled the 4th of July. According to his office, the city has no desire to spend money on something so frivolous. Muslim spokesman Art Tubolls said:", "“This city elected our mayor to do what is best. We don’t hink buying a bunch of flags and fireworks and spending a day celebrating nationalism like nazis is a good idea.”", "This was not a genuine news story about the mayor of Minneapolis, who is neither named \"Ahneid al Ahmed\" nor a Muslim. (The city's actual mayor is Jacob Frey.) The Last Line of Defense is part of a network of sites that engages in political trolling under the guise of proffering \"satire.\"", "This junk news piece may have prompted some confusion, as it resembled a genuine news story about a nearby Minnesota city. The mayor of St. Paul did cancel the city's Independence Day firework show due to budgetary concerns:", "St. Paul will go without the rockets’ red glare on Independence Day this year.", "Mayor Melvin Carter announced that the city won’t hold a Fourth of July fireworks event.", "The cancellation may foreshadow of what could be a difficult budget season. Carter’s announcement, posted to Facebook, cited concerns about the city’s budget climate.", "Minneapolis, on the other hand, hosted multiple firework shows on July 4th.", "Fear-Mongering Reports About Eid al-Adha", "The Muslim celebration of Eid al-Adha is also referred to as the \"Feast of Sacrifice.\" The holiday, which honors Ibrahim's (Abraham's) willingness to sacrifice his son at God's command, is celebrated by Muslims around the world. In many places, Muslims observe that holiday by  sacrificing an animal and then sharing its meat with the poor:", "To commemorate God's test of Ibrahim, many Muslim families sacrifice an animal and share the meat with the poor. They also are required to donate to charities that benefit the poor. Muslims also routinely exchange presents during the holiday.", "When it was announced that U.S. Bank Stadium would be hosting a Eid al-Adha festival, the Islamophobic web site \"Bare Naked Islam\" published an article about the upcoming event imploring readers to \"imagine\" 50,000 Muslims at the stadium and displaying various photographs and videos of animal sacrifices from around the world.", "The following photograph, for instance, was taken in Lahore, Pakistan, in 2008:", "These photographs led many readers to mistakenly believe that the \"Super EID\" festival at U.S. Bank Stadium would also feature animal sacrifices, but that wasn't the case.", "Ahmed Anshur, executive director of Masjid Al-Ihsan Islamic Center in St. Paul and one of the organizers of \"Super EID,\" attempted to quell these fears, telling Minnesota Public Radio that no animal sacrifices would take place at the event:", "Eid Al-Adha, the second Muslim holiday of the year, comes at the end of the pilgrimage. Its name in Arabic means the \"festival of sacrifice.\"", "Muslims celebrate by sacrificing animals and donating meat to charity.", "But Ahmed Anshur, executive director of Masjid Al-Ihsan Islamic Center in St. Paul and one of the organizers, wants to be clear: The actual ritual will not take place at U.S. Bank Stadium.", "\"Nobody is going to sacrifice an animal, or nobody is going to slaughter an animal in that field,\" he said. \"I can assure you that, 100 percent.\"", "The Minneapolis Star Tribune filed a report after the 21 August 2018 celebration on  which stated that in fact no animal sacrifices had taken place at the stadium during the EID celebration:", "The holiday honors the prophet Ibrahim, also known as Abraham in Judaism and Christianity, and his willingness to sacrifice his son for God. It comes at the end of the annual hajj pilgrimage. It is one of the holiest days of the year for Muslims, who celebrate with prayer, shared meals and gifts.", "In some places, families who can afford it slaughter an animal and share the meat with family and charities. No animals were sacrificed at the stadium Tuesday.", "Bowling, Chris.   \"Thousands Join in 'Super Eid' Celebration at U.S. Bank Stadium in Minneapolis.\"\r\n    [Minneapolis] Star Tribune.   21 August 2018.", "Feshir, Riham.   \"Thousands Expected for 'Super Eid' in Downtown Minneapolis.\"\r\n    MPR News.   20 August 2018.", "CNN.   \"5 Things to Know About the Muslim Holiday Eid al-Adha.\"\r\n    21 August 2018.", "The Current.   \"Fourth of July 2018: Where to See Fireworks in Minneapolis, St. Paul, and Beyond.\"\r\n    26 June 2018.", "Melo, Frederick.   \"St. Paul Mayor Cancels July 4 Fireworks, Cites Budget Concerns.\"\r\n    TwinCities.com.   27 June 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]