["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As it became clear that U.S. Sen. Bernie Sanders was going to win the Nevada Democratic caucuses held on Feb. 22, the presidential candidate was declared the frontrunner. But a Facebook post published the next day wasn’t impressed with his big win.", "\"Bernie only had 3,444 votes in NV,\" it says. \"There is more people than that waiting to pee at a Trump rally.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Actually, Sanders snagged 41,075 votes, according to the Washington Post. He was followed by former Vice President Joe Biden (19,179 votes), former South Bend, Ind., Mayor Pete Buttigieg (17,598) and U.S. Sen. Elizabeth Warren (11,703).", "It’s possible that whoever created the Facebook post was citing preliminary results for how many county convention delegates Sanders had at the time. County convention delegates are the number of county delegates each candidate gets at the state Democratic convention. That, in turn, determines how many national pledged delegates each candidate gets.", "But even if that’s where this post drew its data, the figure is still wrong. In the end, Sanders had 6,788 county convention delegates and 24 pledged national delegates.", "To secure the Democratic Party’s nomination for president, Sanders (or another candidate) will need 1,991 national delegates. As of March 5, Sanders had 459, Biden had 513 and U.S. Rep. Tulsi Gabbard had two.", "We rate this Facebook post False.", "Facebook post, Feb. 23, 2020", "FiveThirtyEight, Bernie Sanders is the front-runner, Feb. 23, 2020", "The Washington Post, Live Results: Nevada 2020 Democratic caucuses, Feb. 24, 2020", "The Washington Post, The Democratic Party’s presidential delegate process, March 5, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]