["About this rating", "No candidates are \"on the ballot\" in New Jersey until 4 April 2016, the deadline for that state's ballot access petitions to be submitted.", "Sanders alone was left off the New Jersey ballot.", "In March 2016, a social media rumor began to circulating holding that Democratic presidential candidate Bernie Sanders was omitted from the primary ballot in New Jersey. Ambiguous wording led many to believe that Sanders was officially \"left off\" ballots in that state:", "Bernie isn't on the NJ ballot! Please help to promote support and get him onto it: https://t.co/fK4Ge8Rk53", "— #FreeKesha (@fem_equality) March 20, 2016", "PSA: IF YOU PLAN ON VOTING FOR BERNIE, HE IS CURRENTLY NOT EVEN ON THE BALLOT FOR DEMOCRATIC NOMINEES IN NJ. WE ARE THE ONLY STATE LEFT — dj gab memes (@Gabbracadabra) March 18, 2016", "A page on the Bernie Sanders campaign web site appeared to corroborate the claim. On 21 March 2016, it looked like this:", "Supporters of Bernie Sanders were alarmed by what appeared to be a single-state lockout. New Jersey was anticipated to have 126 pledged delegates and 16 unpledged, for a total of 142 up for grabs in its 7 June 2016 primary. However, a 24 January 2016 article on NJ.com suggested that the scenario wasn't cause for concern:", "New Jersey supporters of U.S. Sen. Bernie Sanders' presidential campaign are beginning their effort to put the Vermont senator's name on the ballot for the June 7 primary.", "The deadline for filing petitions with the Division of Elections is April 4.", "On 20 March 2016, the Facebook page \"New Jersey for Bernie Sanders\" published a post noting that New Jersey was the last remaining state in which Sanders wasn't yet on the primary ballot:", "Posted by New Jersey for Bernie Sanders 2016 on Sunday, March 20, 2016", "Presumably due to increased concern on social media (and a number of questions published to the page's wall),\"New Jersey for Bernie Sanders\" added a comment explaining that Sanders would appear on the ballot for the 7 June 2016 New Jersey primaries:", "Let us be clear, until April 4th, no one, including Bernie, will be \"on the ballot\". Once the deadline as past and the count is over, ballots will be final. Patience Berniecrats. We will have more than the 1000 signatures needed for Bernie here in NJ. Just keep getting signatures and be ready to have them notarized to turn in.", "Also on 21 March 2016, NJ.com spoke to Jesse Burns, interim executive director of the League of Women Voters New Jersey. Burns explained a few other details about New Jersey's closed primaries:", "\"We always see an increase in calls concerning primaries, because the primary system is more complicated than the general election,\" she said.", "If you are not registered, you need to register by May 17 in order to cast a primary ballot.", "New Jersey does not have online voter registration, Burns said.", "\"You have to print the form out, physically sign it, and mail it in ... We're a closed primary. In New Jersey, you can only vote for your party's candidate,\" said Burns.", "If you are an Undeclared voter (or what some erroneously call \"Independent\"), you may declare your affiliation up to and including primary election day - right at the polling place – and cast your ballot in that party's race. If you are voting in your very first primary, you can declare your party affiliation at the polls.", "If you've already registered your party affiliation, you can vote only in that party's primary. You can't be on the Democratic rolls and cast a ballot in the Republican primary, or vice versa.", "In order to do that, you'd have to change your party affiliation, and the deadline to do that is much sooner: April 13.", "So while Bernie Sanders wasn't on New Jersey's ballot in March 2016, neither was any other candidate ahead of the petition submission deadline. Those wishing to vote in New Jersey's June primary had until mid-May to register, and registered unaffiliated voters were able to declare a party at their polling places on election day.", "The rumor was similar to another misunderstanding around \"sample ballots\" in Illinois, which caused people to believe Sanders was not on ballots in Cook County. However, that literature originated with an alderman, and was not an official Board of Elections ballot.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]