["The two-minute 20-second video was published on Facebook here on March 24, 2020. The video has been viewed more than 2,600 times.", "Below is a screenshot of the misleading post:", "The post’s Hindi-language caption translates to English as: “Radio in Spain is broadcasting this in the morning. See the power of Sanatan Dharma. They are rituals of opting Hindu religion in the time of crisis. Please share this video more and more. Hail to Lord Rama.”", "The verses heard in the video are spoken in Sanskrit, an ancient Indo-Aryan language mostly spoken on the Indian subcontinent. They translate to English as: “O giver of food, may you provide us with health and energy. The foolish man wins food with fruitless labour. That fruit, I speak the truth, shall be his ruin. Who feeds no friend, no man to love him. All guilt is he who eats alone (so eat together, give or share). Om, peace, peace and peace.”", "On April 4, 2020, Spainish Prime Minister Pedro Sanchez announced an extension of the country's lockdown to combat the coronavirus, as reported here by AFP.", "The video was also shared alongside a similar claim on Facebook here, here, here and here; as well as on Twitter here, here, here and here.", "The claim is false.", "A reverse Google image search using video keyframes extracted with InVID-WeVerify, a video verification tool, found a longer version of the video. It was published here on November 19, 2019 on a YouTube channel owned by a London-based Sanskrit singer and tutor, Gabriella Burnel.", "The clip seen in the misleading Facebook posts starts at the one minute 16-second mark of the YouTube video.", "“These recordings were made in a studio in London. Their purpose is to share sounds with the world that are pure in their vibration so hearing them may be of benefit to the listener, give peace of mind and open the heart,” Burnel told AFP by email on March 31, 2020.", "In the About section of Burnel’s YouTube channel, which is called Gaiea Sanskrit, the singer linked to several other social media and music streaming platforms, including Facebook, Soundcloud and Apple Music, that are under the same name. Burnel also has a website under the same name.", "Burnel is listed as a London-based private Sanskrit tutor by Oxford University.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]