["About this rating", "Oprah Winfrey's interview with Meghan Markle and Prince Harry made headlines in March 2021, particularly over allegations of racism in the British royal family. It also drew renewed attention to another royal figure from British history. Markle, a biracial woman with a Black mother, seemingly made history when she married into British royalty. However, many challenged any claim she was the first \"Black royal,\" pointing to Queen Charlotte, wife of King George III, as being the first mixed-race member of the British royal family with African ancestry. This theory was also fueled by the fictional Netflix show “Bridgerton,” which depicted a Black Queen Charlotte.", "We found that historians and researchers differ widely on whether Charlotte—who was born in what is now Germany in 1744 and died in 1818 —was mixed race, and so far have not reached a conclusive decision about her ancestry. We’ll break down the theory below.", "The claim originated with researcher and historian Mario de Valdes y Cocom, who argued back in the '90s in a piece for PBS Frontline that the queen’s features were “conspicuously Negroid,” as seen in particular portraits of her including the one shown above. Valdes wrote about her likely ancestor, as well as the queen’s “mulatto” features:", "Queen Charlotte, wife of the English King George III (1738-1820), was directly descended from Margarita de Castro y Sousa, a black branch of the Portuguese Royal House. [...] It was the director of the Burney Project (Fanny Burney, the prolific 19th century British diarist, had been secretary to the Queen), Dr. Joyce Hemlow, who obtained from Olwen Hedly, the most recent biographer of the Queen Charlotte (1975), at least half a dozen quotes by her contemporaries regarding her negroid features. Because of its \"scientific\" source, the most valuable of Dr. Hedley's references would, probably, be the one published in the autobiography of the Queen's personal physician, Baron Stockmar, where he described her as having \"...a true mulatto face.\"", "Margarita de Castro y Souza was a 15th-century Portuguese noblewoman whose ancestry, he claims, came from the 13th century ruler Alfonso III and his lover Madragana, whom Valdes took to be a Moor and therefore an African.", "Valdes describes how Sir Allan Ramsay, the queen’s portrait artist, depicted her with distinctly African features, which could have been a political gesture in that time period: “Artists of that period were expected to play down, soften or even obliterate undesirable features in a subject's face. Sir Allan Ramsay was the artist responsible for the majority of the paintings of the Queen and his representations of her were the most decidedly African of all her portraits. Ramsay was an anti-slavery intellectual of his day.” One such portrait can be seen here.", "Depictions of her varied considerably, as seen in the portraits below:", "circa 1770: Charlotte Sophia, (1744 - 1818), Queen of Great Britain through her marriage to King George III in 1761. They had 15 children. (Photo by Hulton Archive/Getty Images)", "Queen Charlotte, queen consort of George III of the United Kingdom. Portrait of Charlotte (1744-1818), who was the wife of George III of the United Kingdom (1738-1820). She was the grandmother of Queen Victoria, and the great-great-great-great grandmother of Queen Elizabeth II. (Photo by The Print Collector/Print Collector/Getty Images)", "Queen Charlotte. Duchess Charlotte Sophia of Mecklenburg-Strelitz (Sophia Charlotte, 1738-1820) was the queen consort of King George III (1738-1820). (Photo by The Print Collector/Print Collector/Getty Images)", "But other historians are more skeptical. Kate Williams told The Guardian that the idea that Charlotte had African ancestry raises “interesting” implications for many royal families across Europe, suggesting that such a claim means arguing that her descendants could be classified as Black, including the present British royal family. But according to her and many historians, the generational distance between Charlotte and her possible African ancestor was so great that it made the suggestion “ridiculous.” They also said there was little evidence to show that Madragana was African.", "Ania Loomba, a professor of literature at the University of Pennsylvania, who also teaches histories of race and colonialism, argued that if a person was described as a Moor or “blackamoor,” it did not necessarily mean they were Black. \"The word 'blackamoor' in Shakespeare's time meant Muslim. It didn't mean Black necessarily,\" she said. \"Moors could be white from North Africa.\"", "Lisa Hilton, a writer of history books and historical fiction, had a similar argument: \"We have no idea of what Mandragana looked like. She may have had Berber, Spanish, Arabic or indeed African features, but she might equally have had blonde hair and blue eyes, as after the fall of the Roman empire tribes from Northern Europe, including East Germany and Scandinavia, invaded the Moorish kingdoms. Moreover, the 500 years between Mandragana and Charlotte would suggest any African bloodline would have been significantly diluted.\"", "Interestingly, back in 1999, after Valdes' research was reported on in The London Sunday Times and The Boston Globe, Buckingham Palace responded to the claim. They neither confirmed nor denied Charlotte's possible ancestry: \"This has been rumored for years and years. It is a matter of history, and frankly, we’ve got far more important things to talk about.\"", "Given that historians differ so widely on whether Charlotte was the first mixed-race queen in British royalty, we rate this claim as “Unproven.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]