["The photo, published here on March 4, has been shared more than 6,000 times after being posted to an Australia-based Facebook group with more than 180,000 followers.", "The caption superimposed above the image states: “Even with the Corona Virus panic buying, no one wants to eat Vegan food.”", "Panic-buying has been reported across the globe in the US, Europe, Australia and Asia during the novel coronavirus epidemic, which has killed more than 7,000 people and infected over 180,000 others worldwide, AFP reported here and here.", "Below is a screenshot of the misleading post:", "The photo was also shared alongside an identical claim on Twitter here, here, here and here, as well as, on Facebook here, here, here and here.", "The claim also appeared in other languages, such as here in Dutch and here in Turkish.", "The claim is false; the photo has circulated online since at least September 2017 in a post about panic buying Houston, a major city in the US state of Texas, ahead of a hurricane.", "A reverse Google image search found that the photo was published on September 2, 2017 in this tweet by American comedian Matt Oswalt.", "\"You have a choice Houston, starve to death...or eat vegan.\"\n\t\t(ENTIRE CITY OF HOUSTON TAKES A BIG SWIG OF WHISKY)\n\t\t\"I'll see you in hell.\" pic.twitter.com/zAN2KoPHCo", "The caption of the photo reads: \"'You have a choice Houston, starve to death...or eat vegan.' (ENTIRE CITY OF HOUSTON TAKES A BIG SWIG OF WHISKY)'I'll see you in hell.'\"", "Products from US vegan brands such as Chao and Lightlife can be seen on the top two shelves in the photograph, as circled by AFP in the screenshot below:", "In an earlier post on August 31, 2017, Oswalt also tweeted about Hurricane Harvey, which first hit southeast Texas on August 25 that year.", "Empty shelves were reported in supermarkets across the US south, including in Houston and San Antonio, Texas and Florida.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]