["About this rating", "In October 2020, with just four weeks to go until Election Day, the reelection campaign of U.S. President Donald Trump posted a short video clip on Twitter saying it showed Democratic presidential candidate Joe Biden calling Trump supporters the \"dregs of society.\"", "The tweet, posted on Oct. 6 by @TrumpWarRoom, contained the following text: \"Joe Biden called Trump supporters the 'dregs of society.' The idea that Biden is a unifier is a joke.\" In the accompanying eight-second clip, Biden says:", "\"They're a small percentage of the American people. Virulent people. Some of them the dregs of society.\"", "However, the Trump campaign's presentation of Biden's remarks was deeply misleading. Viewed in proper context, it's clear that the former U.S. vice president was not referring to Trump supporters as a whole, but rather what he called \"the forces of intolerance\" throughout the world and in the United States, in particular the Ku Klux Klan and the \"alt-right.\"", "In the 2016 election, the Trump campaign capitalized on Democratic candidate Hillary Clinton's infamous claim that \"half\" of Trump's supporters constituted a \"basket of deplorables.\" The false attack on Biden — both in September 2018, when he made the remarks, and again in 2020 — appeared to be an attempt to create a similar narrative around Biden, who has pitched himself to voters as a moderate and unifying candidate.", "The short clip posted by the Trump campaign was taken from a much longer speech that Biden gave on Sept. 15, 2018, at the Walter E. Washington Convention Center in Washington, D.C. Biden was speaking at an annual dinner for the Human Rights Campaign, an LGBTQ rights non-profit.", "In order to provide the full context for Biden's \"dregs of society\" remark, the following is a transcript of the relevant section of his speech, and the moments leading up to it, with especially relevant remarks highlighted in bold. The section of the speech in question can be watched in full below:", "... Thanks to you, our children, my grandchildren will grow up in a world that's far more just, open-minded and humane. But our work is not yet done, by any stretch of the imagination. The stakes are much too high. As I said, we're faced with an administration, and some of its most ardent right-wing supporters from the Ku Klux Klan — the head of the Ku Klux Klan has endorsed [Trump] — and the alt-right, who are trying to undo all the progress you have made, and the little that Barack [Obama] and I have made with you.", "Today, we still don't have a federal law that explicitly protects LGBTQ [people] from being fired or evicted or denied service at a restaurant. In 28 states, you can still be fired for being gay. In 30 states, you can be fired if you're transgender. Legally fired. And here's what I want to remind you all: the American people are better than this. I promise you, they don't know that that is possible. We should be reminding them, day in and day out, that that it is still possible, because they will not support it. And as Chad [Human Rights Campaign President Chad Griffin] said, transgender Americans are still under attack in state legislatures, and face an epidemic of violence that claims far too many of their lives each year.", "And around the world, LGBTQ individuals face terror and torture. Chechnya, El Salvador, Malaysia, Tanzania. Even some of our democratic allies, like Romania, appear to be giving way to some narrow-minded divisive politics that have tried to define family here at home. The same kind of people. Any person of conscience, regardless of their religious or partisan beliefs, should be able to agree that discrimination and violence against any person, in any form, is simply intolerable, illegal, wrong.", "As you know, when I was vice president I spent a lot of time traveling around the world, and I'd speak out about this issue in these countries. And I'd be told, in some of the countries, \"It's cultural.\" Well let me tell you something, those who try to excuse this kind of discrimination in the name of culture, I say prejudice is prejudice and humanity is humanity. It is a crime. And using religion or culture as a license to discriminate, demonizing the community, individuals to score political points is no more justifiable around the world than it is here at home, and our policies should reflect that.", "But despite losing in the courts and in the court of public opinion, these forces of intolerance remain determined to undermine and roll back the progress you all have made. This time they, not you, have an ally in the White House. This time they have an ally. They're a small percentage of the American people. Virulent people. Some of them the dregs of society. And instead of using the full might of the executive branch to secure justice, dignity, safety for all, the president uses the White House as a literal — literal — bully pulpit, callously exerting his power over those who have little or none.", "It's clear that when Biden said \"some of them [are] the dregs of society,\" he was referring to the \"forces of intolerance\" he had already discussed in his speech, namely the Trump administration and its \"most ardent right-wing supporters,\" which Biden specified as including the Ku Klux Klan and the alt-right. He did not call Trump supporters, in general, \"the dregs of society.\"", "The clip was framed in this misleading way shortly after the speech, in September 2018. Right-wing conspiracy theorist Paul Joseph Watson tweeted it out, adding \"this goes way beyond 'deplorables,'\" and the president's son, Donald Trump Jr. promoted Watson's tweet, adding, \"We are all used to Creepy Joe saying stupid stuff but this is too far even for him.\"", "The false claim that Biden had described Trump's supporters as \"the dregs of society\" was given added credibility when Newsweek published an article, based on Trump Jr.'s tweet, with the erroneous headline, \"Donald Trump Jr. Says Joe Biden Went Too Far in Calling Trump Voters 'Dregs of Society.'\"", "Twitter has rules against what it labels \"synthetic and manipulated media,\" and its policies warn that \"we may label tweets containing synthetic and manipulated media to help people understand their authenticity and to provide additional context.\"", "The company has implemented that policy against Trump in the past. In March 2020, for example, Trump retweeted a video clip posted by his aide, Dan Scavino, which falsely presented Biden as endorsing Trump’s reelection. Scavino’s tweet, and Trump’s promotion of it, were both given the label “manipulated media” by Twitter.", "Twitter's policy categorizes \"isolative editing, omission of context, or presentation with false context\" (all three of which are features of @TrumpWarRoom's misleading October 2020 tweet), as \"subtler forms of manipulated media.\" Nonetheless, the company stipulates that such content \"may be labeled or removed on a case-by-case basis.\"", "Snopes asked Twitter whether the @TrumpWarRoom \"dregs\" tweet violated the company's rules against manipulated media, and whether they intended to take any action against the tweet or the @TrumpWarRoom account. We did not receive a response in time for publication, but we will update this fact check if we do.", "Da Silva, Chantal.  \"Donald Trump Jr. Says Joe Biden Went Too Far in Calling Trump Voters 'Dregs of Society.'\"\r\n  Newsweek.  17 September 2018.", "Twitter.  \"Synthetic and Manipulated Media Policy.\"\r\n  Accessed 7 October 2020.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]