["A viral video raised suspicion that ballots arriving after Michigan’s deadline were brought into Detroit’s TCF Center, where election workers were counting ballots.", "The video actually shows a photographer with a local news station carrying equipment into TCF.", "Viral video and images have fueled misinformation about people with cases and coolers entering Detroit’s TCF Center, the convention hall where election workers were processing and counting the city’s absentee ballots.", "The video and images, originally published by the Texas Scorecard, a product of the Tea Party-aligned group Empower Texans, have been widely shared on social media to illustrate claims that late-arriving ballots were being smuggled into the counting center after Michigan’s 8 p.m. deadline for returning absentee ballots. President Donald Trump’s son Eric Trump shared such claims in a tweet.", "But there’s no evidence of anything like that. Instead, a video shows a photographer entering the convention hall in the wee hours for news coverage of the workers counting ballots. Photos show reporters leaving the counting area and election workers reporting for duty and carrying containers of food.", "The Texas Scorecard published an article with a video and photos Wednesday that it says were shared by Kellye SoRelle, a Texas lawyer and member of Lawyers for Trump. The Texas Scorecard says SoRelle was working as a poll watcher in Detroit at TCF.", "The video shows a man unloading a white van and wheeling a wagon into Detroit’s TCF Center, the central processing and counting site for the city’s absentee ballots. According to the outlet, SoRelle took the video early Wednesday at 2:40 a.m.", "The narrator of the video says, \"polling places were closed, and yet we have a box,\" suggesting that the man was bringing in a new batch of ballots to be counted after Michigan’s 8 p.m. Election Day deadline for returning absentee ballots.", "The article says, \"SoRelle is raising alarms that the box may have been a ballot box that arrived long after all ballots were expected to have been received at the counting facility.\"", "But the man unloading a box from a van onto a wagon was carrying camera equipment, not ballots. Ross Jones, an investigative reporter with Detroit’s ABC affiliate WXYZ, wrote in a tweet that the purported \"ballot thief\" in the image was actually his photographer. \"He was bringing down equipment for our 12-hour shift,\" Jones wrote.", "Brett Kast, another reporter with WXYZ, replied: \"The man in this video is Josh, and this is his wagon. He is not a democrat operative, he is a photographer at @wxyzdetroit. The wagon was not hauling ballots into the TCF center, it was hauling equipment in to our crew…\"", "In a story posted early Thursday, WXYZ once again debunked the claim that the wagon brought into TCF was carrying ballots.", "The Texas Scorecard also includes four other images it says \"show suitcases and coolers moving in and out of the secure area where mail-in ballots were being counted during a shift change at 4 a.m.\"", "One photo shows a man leaving the absentee ballot counting area with a suitcase followed by a man carrying a camera tripod. A second photo, since deleted from the article, showed another man leaving the absentee ballot counting area with a suitcase, a small ladder and camera.", "NHK, Japan’s public broadcaster, confirmed that the men shown leaving the absentee ballot counting area are NHK correspondents.", "Other photos published by the Texas Scorecard show what appear to be election workers with coolers inside TCF. The people responsible for processing and tabulating absentee ballots work long shifts and cannot leave to get food. So many bring food with them.", "Brandon Waltens, the Texas Scorecard reporter who wrote the article, said he did not have any knowledge of what was inside the suitcases and coolers.", "Texas Scorecard said a video showing a man bringing in a wagon into TCF may have been bringing a box of invalid, late-arriving ballots to be counted, while images showed suspicious suitcases and coolers being brought into the counting area. It offered no evidence for its claim.", "The video of the man bringing the wagon into TCF showed a journalist from a local news station wheeling in photography equipment, not ballots. The other images showed reporters leaving the counting area with suitcases and election workers with coolers of food.", "We rate the claims False.", "Eric Trump, tweet, November 4, 2020", "The Gateway Pundit, Cassandra Fairbanks, \"WATCH: Suitcases and Coolers Rolled Into Detroit Voting Center at 4 AM, Brought Into Secure Counting Area,\" November 4, 2020", "The Washington Post, Callum Borchers, \"Blog known for spreading hoaxes says it will have a correspondent in Trump White House,\" January 20, 2017", "Texas Scorecard, Brandon Waltens, \"VIDEO: Wagons, Suitcases, and Coolers Roll Into Detroit Voting Center at 4 AM,\" November 4, 2020", "The Texas Tribune, Emma Platoff, \"Conservative group Empower Texans sues lawmaker to gain state House media credentials,\" April 17, 2019", "Ross Jones, tweet, November 4, 2020", "Brett Kast, tweet, November 5, 2020", "WXYZ, \"Video falsely claims possible voter fraud in Detroit. It actually shows a WXYZ photographer loading camera gear.,\" November 5, 2020", "Michigan Conservative Coalition, Facebook post, November 4, 2020", "Detroit Will Breathe, website, accessed November 5, 2020", "Michigan Bureau of Elections, Election Officials’ Manual, Absent Voter Ballot Election Day Processing", "The Detroit Free Press, Tresa Baldas, Kristen Jordan Shamus, Niraj Warikoo and Evan Petzold, \"Chaos erupts at TCF Center as Republican vote challengers cry foul in Detroit,\" November 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]