["About this rating", "In February 2019, a rumor circulated on social media that Jussi Smollett, the Empire actor accused of making false claims about being the victim of a hate crime, was the nephew of Democratic U.S. senator (and presidential candidate) Kamala Harris of California.", "Conservative radio host Kevin McCullough was one Twitter user who promoted the notion that Harris was Smollett's aunt:\n\nMcCullough deleted his tweet after it generated a considerable amount of ridicule.\nThe claim that Kamala Harris is Jussie Smollett's aunt was offered by a number of social media users, but the documentation presented with it was flimsy at best. In fact, the most substantial piece of \"evidence\" presented to support this conspiracy theory was that Smollett's mother and the California senator share a surname:\n\nSharing a last name does not constitute proof that these two women are siblings, however. In fact, the surname \"Harris\" is one of the most popular surnames in the United States, ranking in the top 30 of the 2010 U.S. Census.  We've examined the biographical information available for these two public figures and found that their family branches simply do not intersect.  \nKamala Harris, who was born in Oakland, California, has a single sibling, a younger sister named Maya who was born in Illinois. In order for Kamala to be Jussie Smollett's aunt, Maya -- who is only 16 years older than Smollett -- would have to his mother.  However, Smollett's mother's first name is Janet, not Maya, and she is from New Orleans, not Illinois.  \nNeither did we find any familial relationship between Kamala Harris and the Smollett family through marriage that might provide a basis for referring to Kamala as Jussie's \"aunt.\" Jussie Smollett was born in Santa Rosa, California, to Janet (Harris) Smollett and Joel Smollett Sr. (who migrated to the U.S. from Russia and Poland).  Jussie said the family moved to Queens when he was two years old, and afterwards, according to the New York Times, he grew up \"bouncing with [his] parents and siblings between New York and Los Angeles, as the kids pursued careers in modeling, acting and music.\"\nNeither Kamala Harris' husband, Douglas Emhoff, nor Maya Harris' husband, Tony West, has any discernible connection to Jussie's parents.   Emhoff hails from New York, graduated USC law school, is a prominent entertainment and intellectual property lawyer in Los Angeles, and has two grown children from a previous relationship.  West hails from San Francisco, graduated Stanford  law school, serves as general counsel and Chief Legal Officer at Uber, and has one daughter with his wife Maya.", "Conservative radio host Kevin McCullough was one Twitter user who promoted the notion that Harris was Smollett's aunt:", "McCullough deleted his tweet after it generated a considerable amount of ridicule.", "The claim that Kamala Harris is Jussie Smollett's aunt was offered by a number of social media users, but the documentation presented with it was flimsy at best. In fact, the most substantial piece of \"evidence\" presented to support this conspiracy theory was that Smollett's mother and the California senator share a surname:", "Sharing a last name does not constitute proof that these two women are siblings, however. In fact, the surname \"Harris\" is one of the most popular surnames in the United States, ranking in the top 30 of the 2010 U.S. Census.  We've examined the biographical information available for these two public figures and found that their family branches simply do not intersect.", "Kamala Harris, who was born in Oakland, California, has a single sibling, a younger sister named Maya who was born in Illinois. In order for Kamala to be Jussie Smollett's aunt, Maya -- who is only 16 years older than Smollett -- would have to his mother.  However, Smollett's mother's first name is Janet, not Maya, and she is from New Orleans, not Illinois.", "Neither did we find any familial relationship between Kamala Harris and the Smollett family through marriage that might provide a basis for referring to Kamala as Jussie's \"aunt.\" Jussie Smollett was born in Santa Rosa, California, to Janet (Harris) Smollett and Joel Smollett Sr. (who migrated to the U.S. from Russia and Poland).  Jussie said the family moved to Queens when he was two years old, and afterwards, according to the New York Times, he grew up \"bouncing with [his] parents and siblings between New York and Los Angeles, as the kids pursued careers in modeling, acting and music.\"", "Neither Kamala Harris' husband, Douglas Emhoff, nor Maya Harris' husband, Tony West, has any discernible connection to Jussie's parents.   Emhoff hails from New York, graduated USC law school, is a prominent entertainment and intellectual property lawyer in Los Angeles, and has two grown children from a previous relationship.  West hails from San Francisco, graduated Stanford  law school, serves as general counsel and Chief Legal Officer at Uber, and has one daughter with his wife Maya.", "Sullivan, Kevin.   \"'I Am Who I Am': Kamala Harris, Daughter of Indian and Jamaican Immigrants, Defines Herself Simply as 'American.'\"\r\n    The Washington Post.   2 February 2019.", "Ryzik, Melena.   \"The Smollett Family Business: Acting and Activism.\"\r\n    The New York Times.   9 March May 2016.", "Driscoll, Sharon.   \"Tony and Maya: Partners in Public Service.\"\r\n    Stanford Lawyer.   17 May 2010.", "Fearnow, Benjamin.   \"Conservative Radio Host Peddles Conspiracy Theory That Kamala Harris Is Jussie Smollet's Aunt, Later Deletes Tweet.\"\r\n    Newsweek.   24 February 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]