["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As the campaign reaches its final stretch, Democrats and their allies continue to accuse Ken Cuccinelli of holding extreme views on everything from climate change to birth control.", "NextGen Climate Action Committee, a Democratic-aligned super pac, has fired out a series of mailers during the last two weeks accusing Cuccinelli, among other things, of \"wanting to eliminate all forms of birth control.\"", "We asked Brian Mahar, a spokesman for the super pac, for proof of the claim. He cited a Sept. 4 editorial in The Washington Post criticizing Cuccinelli’s support of a 2007 bill in the General Assembly that would have extended to human embryos a \"right to the enjoyment of life\" from the moment of fertilization.", "The editorial said the failed legislation would have \"provided an opening to prohibit common methods of birth control, including the pill and intrauterine devices.\"", "The Post editorial, however, made no claim that every form of birth control -- including condoms and spermicides -- would have been banned under the bill.", "Debate over the impact of legislation that confers personhood from the moment of conception centers on how various forms of birth control work. No one disputes that devices that merely prevent fertilization wouldn’t be affected by personhood laws.", "The issue is that some forms -- including the intrauterine device, emergency contraception and birth control pills -- may also work by preventing implantation of a fertilized egg in the uterus. Some people say those methods go beyond mere contraception and are tantamount to causing an abortion.", "In 2012, as Virginia was debating another personhood measure, the American Congress of Obstetricians and Gynecologists released a statement saying laws that bestow rights from the moment of fertilization would restrict contraception choices.", "The group wrote, \"some of the most effective and reliable forms of contraception, such as oral contraceptives, intrauterine devices,, and other forms of FDA-approved hormonal contraceptives could be banned in states that adopt ‘personhood’ measures.\"", "But the organization’s statement, which was cited in editorial NextGen references, never said all forms of contraception would be banned. It said personhood laws would leave \"condoms, natural family planning and spermicides the only legally allowed forms of birth control.\"", "In a September Truth-O-Meter, we gave a Half True to Cuccinelli’s statement that he’s never supported legislation that invades contraceptive choices. We noted that while the personhood bills he’s backed never explicitly sought to ban birth control, they could have opened legal avenues to challenge certain forms of contraception.", "Cuccinelli has repeatedly said he would not seek to restrict contraception. We asked his campaign how he defines birth control but did not receive a clear response. As a state senator in 2003, Cuccinelli voted against a bill that would have specified that contraception that prevents implantation of a fertilized egg is not an abortion.", "Our ruling", "NextGen Climate Action Committee says Cuccinelli wants to \"eliminate all forms of birth control.\"", "The group cites an editorial that said personhood legislation Cuccinelli supported could have fostered legal challenges to types of contraception that prevent the implantation of fertilized eggs. But the editorial made no assertion Cuccinelli wants to ban all birth control devices.", "Cuccinelli has repeatedly said he has no interest in restricting contraception, which generally works by preventing ovulation or the fertilization of a human egg.", "NextGen doesn’t have a speck of proof to bolster its incendiary claim that Cuccinelli wants to ban all forms of birth control -- even condoms and spermicides. We rate it Pants of Fire.", "NextGen Climate Action Committee flier, Oct. 23, 2013.", "E-mail from Brian Mahar, spokesman for NextGen Climate Action Committee, Oct. 23, 2013.", "The Washington Post editorial, \"Ken Cuccinelli’s ‘personhood’ travails,\" Sept. 4, 2013.", "PolitiFact Virginia, \"Cuccinelli says he never backed legislation that limits contraception choices,\" Sept. 16, 2013.", "American Congress of Obstetricians and Gynecologists, \"ACOG statement on ‘personhood’ measures,\" Feb. 10, 2012.", "The Mayo Clinic, \"Birth control options: things to consider,\" accessed Oct. 23, 2013.", "The U.S. Department of Health and Human Services, \"Birth control methods fact sheet,\" accessed Oct. 23, 2013.", "The Food and Drug Administration, \"Birth Control: Medicines to help you,\" accessed Oct. 23, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]