["About this rating", "United States President Donald Trump took another swipe at Canada on 19 June 2018 during a speech about \"smugglers\" bringing shoes into the country from the United States, by mixing two pieces of a New York Post story.", "Trump, speaking at an event hosted by the National Federation of Independent Businesses (NFIB), said:", "There was a story two days ago in a major newspaper talking about people living in Canada, coming into the United States and smuggling things back into Canada because the tariffs are so massive. The tariffs to get common items back into Canada are so high that they have to smuggle them in. They buy shoes and they wear them. They scuff them up to make them sound old, or look old. No, we're treated horribly.", "The president did not identify the \"major newspaper\" that supposedly printed the story, but his statement was based on an op-ed published in the Post three days earlier by reporter Isabel Vincent. She wrote:", "A Canadian who once lived in Vancouver told me he would cross the border into Seattle to buy outdoor equipment that he simply couldn't find in Canada.", "\"Before we crossed back into Canada, we'd remove the price tags and make sure that the new equipment looked as dusty as possible,\" he said.", "Vincent, who said Canadian friends relied on her to help them bring goods across the border, also shared an anecdote regarding shoes, though it did not involve changing their appearance:", "A Toronto-based designer I know purchased two pairs of shoes (retail $800 each) online from a midtown department store and shipped them to my office. The Italian contraband sat under my desk for weeks until I could entrust them to a carrier who would be crossing the border. I finally convinced my nephew who had been visiting New York to stuff them into his back-pack and rendezvous with the designer in Toronto for the drop-off. My friend saved $159.59 in combined federal and provincial taxes, and $187.26 in estimated customs charges.", "The NFIB did not respond to a request for comment concerning the remark. The Footware Distributors and Retailers of America, though, rebuked Trump for his comment in a statement. The trade group's president and CEO Matt Priest said that \"anyone from anywhere\" was welcome to purchase shoes in the United States:", "The President seems misinformed about footwear trade. Consumers buying shoes in America already pay a very high tariff, upwards of 37.5 percent and 67.5 percent. NAFTA is not treating footwear consumers in America unfairly, the American government itself has not lowered footwear duties in a meaningful way in over 80 years. If the President is concerned about treating American footwear companies and consumers fairly, then he should have signed the TPP to lower footwear costs in America. Canada signed the TPP and will eventually get duty free shoes from Vietnam, a major sourcing hub, where American brands will ship directly into Canada duty free. Canadian’s have no real reason to \"smuggle\" their shoes because their government is already helping lower their costs through proper trade deals.", "The Canadian government does not identify any specific limitations on bringing American footwear into the country. Most goods worth more than 200 Canadian dollars are subject to duty and taxes if brought in more than 24 hours after purchase.", "Trump's remark was the latest in a series of verbal attacks against Canada and its prime minister, Justin Trudeau, accusing the country of taking economic advantage of the U.S. He has also threatened that the U.S. would exit its partnership in the North American Free Trade Agreement with Canada and Mexico, and did not discount that possibility in his remarks at the NFIB event, saying:", "We're trying to equalize it. It's not easy but we're getting there. We'll see whether or not we can make a reasonable NAFTA deal.", "\"WATCH: President Trump speaks at the National Federation of Independent Businesses.\" YouTube, uploaded by PBSNewsHour. 19 June 2018. https://youtu.be/ZiSnXNfbQ7k", "Polk, Andy. \"The Footwear Industry’s Business And Trade Association (FDRA) STRONGLY Responds To President Trumps Claims That Canadians Are “Smuggling” Shoes Into Canada From The US To Avoid Tariffs.\"\r\n    Footware Distributors and Retailers of America. 19 June 2018.", "Government of Canada. \"What You Can Bring Home to Canada.\"", "Vincent, Isabel. \"hy Canadians will never give up American products.\"\r\n    New York Post. 16 June 2018.", "Correction [20 June 2018]: Updated the story to reflect the article referenced in President Trump's speech.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]