["By Saranac Hale Spencer", "Posted on June 19, 2020", "Posts on social media cite an anonymous Craigslist ad to support the false claim that President Donald Trump’s reelection campaign is seeking “MINORITY Actors” to hold signs at his June 20 rally in Tulsa, Oklahoma. The Trump campaign says it didn’t post the ad, and Craigslist has removed it.", "President Donald Trump has scheduled his first campaign rally since the COVID-19 pandemic put a halt to large-scale gatherings. Trump’s last rally was on March 2 in Charlotte, North Carolina.", "The president is anticipating a large crowd at the rally planned on June 20 in Tulsa, Oklahoma. He recently told reporters, “we’re either close to or over one million people wanting to go.”", "In the days ahead of the June rally, an ad was posted on Craigslist in Tulsa, saying: “Excited and enthusiastic MINORITY Actors and Actresses needed to hold signs at event in Tulsa.” It went on to say, “This may be applied towards community service if necessary (in lieu of payment).”", "The map accompanying the ad showed the location of the BOK Center, where the rally is to be held, and listed June 20 as the date of the event. The arena has a capacity of about 19,000.", "While the ad didn’t specifically mention the Trump rally, the intended message was clear to social media users, who shared screenshots of the post with comments that said, “100% real Trump Craig’s List ad looking for ‘MINORITY ACTORS’ to come to Lumpy Covid Tulsa rally on Saturday” and “They are HIRING MINORITY ACTORS to pretend to be TRUMP SUPPORTERS!!!”", "But the ad was not placed by the Trump campaign, according to campaign spokesman Tim Murtaugh.", "Murtaugh tweeted a copy of one such claim with this statement: “This, obviously, is fake, and a recurring lie the trolls roll out a lot.”", "The ad was posted anonymously, with no information about the person or organization who created it.", "The original ad has been taken down and replaced with a note explaining that it was “flagged for removal.”", "Craigslist did not respond to our request for comment.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Actors Needed June 20 (Tulsa).” Tulsa.Craigslist.org. Internet Archive. Archived 15 Jun 2020.", "“‘Make America Great Again!’ Rally.” BOK Center. Accessed 18 Jun 2020.", "Murtaugh, Tim (@TimMurtaugh). “This, obviously, is fake, and a recurring lie the trolls roll out a lot.” Twitter. 15 Jun 2020.", "“This posting has been flagged for removal.” Tulsa.Craislist.org. Accessed 18 Jun 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]