["President Barack Obama is nearly out the door, but that hasn’t stopped the Internet from raising alarm bells about his policies.", "A recent post in a website called Conservative Tribune is headlined, \"OUTRAGE: Before Leaving, Obama Enacts Rules to Take $3,000 From EVERY American.\" Other sites repeated this line, including Maine Republic Email Alert, Allen West, Young Conservatives, and Angry Patriot (which amped up the allegation by calling it \"CORRUPT\").", "A reader asked us to delve deeper, so we did. (Conservative Tribune did not respond to an inquiry for this article.)", "It’s highly misleading.", "The article cites a Dec. 1, 2016, blog post titled, \"Passing $1 Trillion,\" by the American Action Forum, a group that describes itself as \"center-right\" and \"free-market.\" (Here’s some background on the group from our friends at FactCheck.org.)", "As a free-market group, reducing the regulatory burden is a core principle. So for years, the group has been tallying the costs of federal regulations, basing its work on the federal government’s own estimates of a regulation’s impact on both direct and indirect costs, including higher consumer prices, lower wages, and costs related to paperwork and other overhead.", "Late this year, the tally passed $1 trillion, which prompted the blog post in question. The $3,000 figure stems from the group’s calculation of $1 trillion in costs being spread out among the entire population. \"On a per capita basis, there are 324 million people in the U.S., equating to a regulatory burden of $3,080 per person,\" wrote Sam Batkins, the group’s director of regulatory policy.", "So the $3,000 figure is based on a nugget of truth. But the Conservative Tribune, and other websites that shared similar headlines, framed the finding in a way that is significantly misleading.", "Here are five problems in the description.", "The $3,000-a-person figure", "For starters, some of the $1 trillion figure that this is based on stems from regulations imposed before Obama took office. The $1 trillion figure \"tracked all net present value regulatory costs since 2005, so it includes the entire second half of the Bush administration,\" Batkins told PolitiFact.", "By our calculation, final rules under Obama alone accounted for $865 billion. That would produce a figure of $2,670 rather than $3,000. Not a dramatic difference, but one worth pointing out.", "And the annual cost of Obama’s regulations -- rather than the cumulative cost -- is a bit over $500 a person, according to the group’s calculations. That’s still substantial, but it’s not the wallop that $3,000 would be.", "The assertion that Obama did this \"right before leaving\"", "That’s not the case. This regulatory cost burden has been accumulating in fits and starts since more than a decade ago in 2005. In fact, the figure also includes regulatory costs that either \"have been or will be imposed during the next few years,\" the blog post said.", "That means that \"some of the costs might not be borne until the next decade,\" Batkins told PolitiFact.", "This would not hit \"every\" American, or all at once", "The headline phrase \"take $3,000 from every U.S. citizen\" makes it sound like people's taxes are going up $3,000 in one fell swoop. They are not.", "Rather, this amount would be drained over a long period of time and in myriad ways, with some people getting a bigger hit (by losing a job) and some a smaller hit (by having to pay a little more for products they buy).", "\"It’s correct to say that regulations don’t act like taxes,\" Batkins said. \"Many of the cost estimates take the form of higher prices for some consumer products, cars, air conditioners, and furnaces.\"", "This is an estimate, and it was calculated by a group with a perspective", "The headline does not make clear that these figures are estimates.", "The American Action Forum’s own post notes, \"There is probably no one ‘correct answer’ on the cumulative costs of regulation. These figures are just estimates (unadjusted for inflation) from federal regulators, some more than a decade old, which might have dubious value.\"", "And as we’ve noted, the American Action Fund has a free-market orientation. Other groups with different perspectives may frame the statistics accordingly.", "This calculation leaves out all benefits from these regulations", "The American Action Forum mentions in its blog post that the government also calculates benefits that spring from these regulatory costs. \"There are also benefits associated with many, but not all, of the largest regulations,\" Batkins told PolitiFact.", "All told, the group’s blog post says, \"AAF recorded $745 billion in annual benefits during the same period.\"", "Benefits from regulations implemented under Obama include prevention of foodborne illnesses through inspection, consumer protection in the financial sector, flammability standards for consumer products, reduced energy use from conservation standards, cleaner air from emissions standards, air cargo security standards, oil-well blowout preventer systems and nuclear reactor safety standards, among many others.", "So, using both the cost and benefit figures, the net cost of regulations would work out to less than $800 a person -- still a net cost, but much smaller than the $3,000 figure cited in the headline.", "Ultimately, for the headline to cite just the costs but not the benefits amounts to cherry picking.", "Our ruling", "The Conservative Tribune published a post titled, \"Before Leaving, Obama Enacts Rules to Take $3,000 From EVERY American,\" and other websites offered posts with similar headlines.", "The figure is based on a calculation from an anti-regulatory group, though we do give the conclusion some credence because the number is drawn from the federal government’s own estimates.", "However, the headline glosses over several important caveats. The costs were not solely imposed under Obama, and the ones that were on his watch occurred over an eight-year period, rather than just \"before leaving\" the White House.", "Finally, contrary to the headline’s implication, Americans will not be charged a $3,000 fee because of action taken in Obama’s final weeks. Rather, they would experience higher consumer costs or lower wages over many years, with a lot of variation from person to person, and going many years into the future. The calculation completely ignores the estimated benefits of these regulations, with a value that balances out about three-quarters of the cost figure cited.", "The statement contains an element of truth but ignores critical facts that would give a different impression, so we rate it Mostly False.", "Conservative Tribune, \"OUTRAGE: Before Leaving, Obama Enacts Rules to Take $3,000 From EVERY American,\" Dec. 2, 2016", "American Action Forum, \"Passing $1 Trillion\" (blog post), Dec. 1, 2016", "American Action Forum, \"Regulation Rodeo\" database, accessed Dec. 14, 2016", "Email interview with Sam Batkins, the group’s director of regulatory policy, Dec. 13, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]