["About this rating", "Dakota Access Vice President Joey Mahmoud said in an August 2016 court filing that if 1 January 2017 came and went without progress, third parties would be able to cancel business contracts related to the pipeline.", "Neither opponents or proponents have said that if it isn't completed by 1 January 2017 that it cannot be completed at all.", "The effect of delays past 1 January 2017 on the pipeline's future.", "On 18 November 2016, the Ring of Fire radio network published a story which  reported that if the Dakota Access Pipeline was not completed by 1 January 2017, contracts set to expire on that date could possibly kill the project completely:", "Though water protectors have held their ground at Standing Rock against the Dakota Access pipeline for months now, they need only push for a month and a half longer until it is possible that their mere presence may actually kill the oil-funneling project.", "Is it too good to be true? It might be – but it might also truly signal the end of this horrific struggle.", "This is due to a very specific deadline that the company producing the pipeline is under: if oil is not flowing by January 1, 2017, the two year contract expires. Though due to the massive investment the company has already made, they may try to continue building on the site, every day that the water protectors hold the land represents a massive hit to investors’ pocketbooks.", "According to a 17 November 2016 blog post published by Camp of the Sacred Stones, legal action taken by Dakota Access LLC against the U.S. Army Corps of Engineers hinged on that date:", "On Wednesday, November 16, 2016, just hours after the arrival of the drill at Standing Rock, Dakota Access LLC filed a lawsuit against the U.S. Army Corp of Engineers for delaying its decision on the last required easement. Standing Rock Sioux Tribal Chairman Dave Archambault said in response, “They are wrong and the lawsuit will not succeed. We are looking forward to discussing the easement with the Administration and explaining why it must be denied.” In their court documents, the company said that delays have already cost nearly $100 million and that \"further delay in the consideration of this case would add millions of dollars more each month in costs which cannot be recovered.\"", "This desperation comes from the company’s January 1, 2017 deadline for completing the project. Dakota Access has previously told the District Court that if they are not delivering oil by January 1, their shipper contracts will expire and the project will be in jeopardy. A new report by the Institute for Energy Economics and Financial Analysis, and issued just as the company’s lawsuit was being filed on Wednesday, confirmed these weaknesses in the financing of the project and questioned its entire economic rationale.", "On 16 November 2016, Indian Country Today reported that DAPL officials had told a court that the project would be jeopardized if the pipeline is not completed by 1 January 2017:", "“They are rushing to get the pipeline in the ground to meet that deadline, “ said Archambault. “The only urgency here was created by their own reckless choice to build the pipeline before it had all the permits to do so. They chose to reroute this pipeline away from Bismarck and put it at our doorstep and through our treaty lands and sacred places, even after we told them that it could not pass here. They made bad decisions and are now facing the consequences. The tide is turning against this project. We thank all of our water protectors who have raised their voices against it. You are being heard.”", "A 16 November 2016 report [PDF] published by the Institute for Energy Economics and Financial Analysis suggested that vested companies might back out after that date:", "DAPL faces a looming financial deadline. The pipeline’s principal backer, Energy Transfer Partners (ETP), has conceded in court proceedings that it has a contractual obligation to complete the project by January 1, 2017. If it misses this deadline, companies that have committed long-term to ship oil through the pipeline at 2014 prices have the right to rescind those commitments—and may well exercise that right.", "ETP will most likely miss this deadline. The company recently informed investors that it would take from 90 to 120 days to complete the pipeline after it receives its necessary easement from the Army Corps of Engineers to cross the Missouri River, which would push completion of the pipeline well past Jan. 1.", "The claim appeared to originate not with DAPL opponents (many of whom subsequently referenced it), but in an 18 August 2016 court statement, in which the company raised the possibility:", "Dakota Access Vice President Joey Mahmoud wrote in an Aug. 18 declaration to the court that the company had committed to completing the pipeline by Jan. 1, 2017.", "“The long-term transportation contracts give shippers a right to terminate their commitments if (Dakota Access Pipeline) is not in full service per the contract deadline,” Mahmoud wrote.", "By all accounts, stalling the Dakota Access Pipeline's construction beyond 1 January 2017 greatly increases the chance that associated commitments would be terminated by third parties. However, we could find no information suggesting that the 1 January 2017 date was a hard-and-fast deadline, rather than simply a company projection used to bolster arguments of urgency in court.", "Harte, Julia.   \"Federal Appeals Court Hears Arguments Over Dakota Access Pipeline.\"\r\n    Reuters.   5 October 2016.", "Hult, John.   \"Can The Dakota Access Pipeline Be Stopped?\"\r\n    Argus Leader.   4 November 2016.", "Kunkel, Cathy et. al.   \"“The High-Risk Financing Behind the Dakota Access Pipeline: A Potential Stranded Asset in the Bakken Region of North Dakota.\"\r\n    The Institute for Energy Economics and Financial Analysis.   16 November 2016.", "Mapes, Lynda V.   \"Trump’s Election Buoys Disputed Dakota Access Pipeline.\"\r\n    Seattle Times.   10 November 2016.", "Pember, Mary Annette.   \"Amid Reports Of Lake Oahe Drill In Place, Energy Transfer Files Suit Against Army Corps.\"\r\n    Indian Country.   16 November 2016.", "Robinson, Sydney.   \"DAPL Investors Getting Antsy: If Pipeline Doesn’t Move Oil by January First the Contract Expires.\"\r\n    Ring of Fire Radio.   18 November 2016.", "Wong, Julia Carrie and Sam Levin.   \"Dakota Pipeline Operator Goes To Court After Government Delays Construction.\"\r\n    The Guardian.   15 November 2016.", "Camp of the Sacred Stones.   \"Dakota Access Is In Financial Jeopardy.\"\r\n    17 November 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]