["About this rating", "A relatively small number of respondents in a survey by the graphic design company GraphicSprings chose \"gender neutral\" when asked what gender a modern Santa Claus should be.", "The survey used flawed methodology that probably wasn't intended to accurately measure public opinion so much as create a viral news story.", "In mid-December 2018, a graphic design company conducted a survey asking respondents in the U.S. and U.K. how they might change the conceptualization of Santa Claus to \"modernize\" his image.  Among the various responses were such suggestions as dressing Santa in skinny jeans and giving him an Amazon Prime membership.", "Among the survey questions, the GraphicSprings design company included one about whether Saint Nick should be a man, a woman, or \"gender neutral.\"", "Many headlines reporting on the survey focused on respondents' expressing their preference for a gender-neutral or female Santa Claus, a scrutiny perhaps not surprising in the age of social media flame wars. What wasn't discussed, however, was an aspect of the story that was key, albeit boring: the survey's methodology.", "GraphicSprings described their survey methodology as follows:", "Respondents ranged from 18 to 65+ and were based in both the UK and US. We used Google surveys and gathered responses during October and November 2018. Suggestions on how to change Santa were gathered from an open survey of 400 respondents from both the UK and US. A selection of these suggestions were then voted on by over 4000 people across the UK and US, with the most popular visualised in our graphic.", "GraphicSprings didn't explain who made the \"selection\" of suggestions that were included in the larger survey, or why they were chosen. Furthermore, many of the news stories about the survey didn't review the survey or note that the questions presented to participants were leading ones.", "For example, survey-takers were asked \"If you could 'rebrand' Santa for modern society, what gender would he be?\" Participants were provided three answers from which they could choose -- male, female or gender-neutral:", "Writing for the Australian popular culture and news site Junkee, journalist Joseph Earp described the survey as a savvy but cruel tour de force in marketing that succeeded in raising GraphicSprings' media profile:", "The study was designed to generate a controversial result. Participants didn’t come up with the idea to make Santa gender neutral: it was offered to them. The question wasn’t: ‘What would you do to modernise Santa?’, or even ‘What gender should Santa be?’", "The question fed participants gender neutral as an answer. That’s a kind of bias that real studies, conducted by companies that aren’t just trying to mine some outrage, would have worked on eliminating. And it’s a kind of bias that GraphicSpring had a vested interest in not eliminating. They wanted an attention-grabbing result that would piss off boomers already convinced of the evils of PC culture, and they got it.", "In other words, the results of a viral survey designed by a company that specializes in making business cards and flyers probably was not intended to accurately measure public opinion.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]