["About this rating", "On 18 January 2017, web site GotNews posted an article reporting that U.S. Rep. John Lewis, a Georgia Democrat who is perhaps most famous for participating in the Civil Rights Movement at the side of Martin Luther King, Jr., didn't pay property taxes on a $1 million townhouse located in the Capitol Hill neighborhood of Washington, D.C.:", "Trump-hating Democratic Georgia congressman John Lewis didn’t pay property taxes on his nearly $1 million fancy Washington, D.C. townhouse on Capitol Hill, despite being in Congress for decades, where the salary for a Representative starts at $174,000 per year.", "Lewis was in the news recently for saying he doesn’t see President-elect Donald J. Trump as “a legitimate president” because of the #RussianHackers Democratic conspiracy theory.", "The article displayed a table showing annual property tax payments for the home in question and a legal notice from 2010 alerting Lewis of a court action against him (the case was later dismissed). It's unclear how this table supposedly documents that Lewis \"didn’t pay property taxes on his nearly $1 million fancy Washington, D.C. townhouse,\" given that it lists tax payments due on the property for each of the last several years and shows nothing owing other than the most recent payment (for the last half of 2016):", "Moreover, a different view from the same D.C. Office of Tax and Revenue web site shows that the taxes on Lewis' property have indeed been collected, as due, for each of the last several years:", "We contacted Lewis's spokeswoman, Brenda Jones, who told us that he bought the home years before property values soared, that he still owns it, and that he is not behind on his taxes:", "He pays property taxes annually, just as all homeowners in DC do, and his taxes are paid and up to date.  Any report that he “avoids” paying taxes grasps at straws and is a desperate and unnecessary attempt to tarnish his credibility, instead of debating the substance of issues he has raised.", "Neither the home in question, nor any properties under Lewis' name, appeared on a database search of properties seized and placed on sale for failure to pay property taxes.", "A second item of alleged proof offered by GotNews.com was a 2010 \"notice of pendency of action,\" a legal notice of court actions relating to real property. The document appears to be a notice of a foreclosure hearing. That case, however, was dismissed on 11 February 2011:", "According to current public records available as of 19 January 2017, Lewis still owns the property, confirming that the case was dropped. It was purchased in 1988 (for an unknown price) and is currently valued at $865,790.", "An explanation offered by Lewis's office states that in 2010 he nearly lost his home to foreclosure but was able to stop the process:", "Rep. Lewis’s Washington, DC property was purchased decades ago for a fraction of its current value today. As most Washingtonians and any real property expert know, property values in the city have risen exponentially in the last 10 to15 years. Rep. Lewis is delighted that he made a wise investment years ago, and that his property’s value has skyrocketed. He also realizes he likely could not afford to purchase his own home were he seeking to buy it today. In 2010, he was subjected to attempts to foreclose upon his home, like many Americans during that period. He is fortunate that he was able to stop that process, though many Americans, including many hundreds of his constituents, were not as successful. His property taxes are paid and currently up to date.", "GotNews.   \"Trump-Hating Democratic @RepJohnLewis DIDN’T PAY TAXES On His Nearly $1 Million Fancy DC Townhouse.\"\r\n18 January 2017.", "Seipel, Brooke. \"Rep. John Lewis: Trump Isn't a 'Legitimate President.'\"\r\nThe Hill. 13 January 2017.", "Wootson, Cleve R. \"In Feud With John Lewis, Donald Trump Attacked 'One of the Most Respected People in America.'\"\r\nThe Washington Post.15 January 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]