["Sen. Harry Reid makes a Senate floor speech on July 29, 2015. (C-SPAN screenshot)", "An anti-abortion group recently released several secretly recorded videos of Planned Parenthood employees discussing fetal tissue, and that has given opponents of the abortion-providing health organization new momentum to shut off federal funding.", "During Senate floor debate on July 29, 2015, Senate Minority Leader Harry Reid, D-Nev., urged lawmakers to focus on consequences for women who rely on Planned Parenthood for health care beyond abortions if the federal funding is cut off.", "Planned Parenthood \"is the health care backbone for American women during their lives,\" Reid said. \"In fact, it's the only health care that a significant number of women get. About 30 percent of women, that's their health care.\"", "A reader thought that number sounded high and asked us to check it out.", "We started by doing some basic math.", "According to the 2013 Census Bureau population estimate, there were about 161 million women in the United States, of whom 131 million were age 15 or over -- the primary constituency for Planned Parenthood. Thirty percent of that number is about 39 million women.", "Did Planned Parenthood serve 39 million women who had no other health care options? Not even close.", "According to the most recent Planned Parenthood annual report, the organization saw 2.7 million patients in 2013, completing 10.6 million separate procedures. The biggest categories of procedures were sexually transmitted infection tests (3.7 million), reversible contraception (2.1 million), emergency contraception kits (1.4 million), pregnancy tests (1.1 million), and HIV tests (704,000). (For the record, the group disclosed that it performed 327,653 abortions during that period, or about 3 percent of all procedures.)", "Equally problematic, there's no indication in Planned Parenthood’s data that each of the 2.7 million patients had no other health care resources to rely on, as Reid said was the case.", "When we checked with Reid’s office, a spokesman said that the senator was speaking off the cuff and had meant to refer to a different statistic. That is a statistic -- often cited by Planned Parenthood itself -- is that \"one in five American women has chosen Planned Parenthood for health care at least once in her life.\" But that’s not what Reid said.", "Our ruling", "Reid said Planned Parenthood is \"the only health care that a significant number of women get. About 30 percent of women, that's their health care.\" That’s not the case -- Planned Parenthood saw 2.7 million patients in 2013, not the 39 million it would have needed to see for Reid’s claim to be accurate. Even if every Planned Parenthood patient had no other health care options, the group would have seen about 2 percent of women, not 30 percent. His office acknowledged that Reid, making off-the-cuff remarks, got the talking point wrong. In this case, he really got it wrong. We rate the statement Pants on Fire.", "Harry Reid, Senate floor speech, July 29, 2015", "Planned Parenthood Federation of America, annual report, 2013-2014", "Planned Parenthood Federation of America, \"Who We Are,\" accessed July 30, 2015", "Census Bureau, Annual Estimates of the Resident Population for Selected Age Groups by Sex: April 1, 2010 to July 1, 2014, accessed July 30, 2015", "Email interview with Adam Jentleson, spokesman for Harry Reid, July 30, 2015", "Email interview with Catherine Lozada, spokeswoman for Planned Parenthood Federation of America, July 30, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]