["About this rating", "Self-described democratic socialist and 2020 presidential candidate U.S. Sen. Bernie Sanders made a campaign stop at a food pantry in Detroit, Michigan, with fellow progressive politician U.S. Rep. Rashida Tlaib, D-Michigan. The photograph of the two in front of empty shelves apparently proved too much of a temptation for junk news site The Gateway Pundit.", "\"PERFECT! Two Radicals Bernie Sanders and Rashida Tlaib Stand in Front of Empty Grocery Store Shelves and Push Socialism,\" read the headline of an Oct. 29, 2019, Pundit story.", "It's not true. Sanders and Tlaib were at a food pantry, not a grocery store, and they were talking about basic services like water and power being cut off to low-income residents, not \"pushing socialism.\"", "The picture Gateway Pundit used is a screenshot taken from an Oct. 28, 2019, report by progressive TV news outlet The Young Turks, which sent correspondent Emma Vigeland to Brightmoor Connection Food Pantry in Detroit, where Sanders, an Independent from Vermont running as a Democrat, was joined by Tlaib, who represents Michigan's 13th district. That district includes the area of Detroit where the pantry is located.", "Here's what Sanders and Tlaib stated during the relevant portion of the interview:", "VIGELAND: Senator and Congresswoman, when we're talking about water scarcity, we're also talking about infrastructure, and nationally the conversation seems to be about privatizing that infrastructure effort. Can you talk about how you're going to combat that, specifically coming from the right.", "SANDERS: When I talk about infrastructure, I think what is generally thought that you're talking about is roads and bridges, and that's important. But what is increasingly important in Detroit and all over this country is to make sure that people have clean drinking water at a rate that they can afford. Water is a basic necessity of life, it doesn't get more basic than that. Food and water. You don't survive without it. And people should not — large corporations should not be making huge profits in terms of ownership of water. That is something we will combat 100 percent.", "TLAIB: Yeah I mean, it's pretty simple for me. I'm going to combat privatization of our infrastructure by saying no. It's as simple as that. No. It can't happen. I've watched a lighting authority come into my city and pretty much blacken out a whole neighborhood. They didn't deserve to be left behind, because why? Because who wrote the bill? It was the private industry that came in and wrote the bill and basically left some of the most neglected neighborhoods without any lights. So even just a simple quasi-governmental authority bled into profits before the people and I just can't stand by and say, \"yeah let's figure out a middle ground.\" We can't, I've seen it over and over again in my city and the community I grew up in where it just doesn't work that way. We need it to stay in the pubic's hands for us to have oversight and accountability.", "Hoft, Jim.   \"PERFECT! Two Radicals Bernie Sanders and Rashida Tlaib Stand in Front of Empty Grocery Store Shelves and Push Socialism.\"\r\n   The Gateway Pundit.   29 October 2019.", "The Young Turks. \"Bernie and Rashida Tlaib Visit Food Pantry.\"\r\n  YouTube. 28 October 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]