["About this rating", "On 29 December 2016, UFO Sightings Daily blogger Scott Waring posted an image from the Mars Curiosity Rover that purportedly shows the presence of a \"hairy spider monkey\" on Mars:", "I found this four legged alien creature on Mars and it looks like a hairy spider monkey. The longer upper arms are holding it up as well as its shorter lower legs. If you add light to the face, you can easily make out two eyes. As you can see, this animal is watching the Mars rover.", "The image in question is authentic, at least. It was taken with Curiosity's “Mastcam” on 11 March 2016, some 1,278 Martian days into its mission. The geographic feature photographed is the Naukluft Plateau, and it can be viewed, with full context, in the online repository of Curiosity’s raw photo data:", "Although news outlets such as the Daily Mail reported this photographic sleuthing as news, our position is that this four-legged ‘spider monkey’ is nothing more than an interesting rock or rock formation. The assertion of complex life on Mars, which a primate-like creature would undoubtedly be, requires basic necessities that would almost certainly have been uncovered by the numerous orbiters and rovers that have been exploring Mars since the 1960s.", "Most notably, this organism would require food. As a reference point, the amount of energy it takes for the closely related howler monkey to merely exist (let alone grow) in a tropical environment is 602 Calories per day. As this specific primate-like critter would be surviving in temperatures that regularly hit -100ºF, its metabolic costs would undoubtedly be higher.", "As the unequivocal presence of organic compounds suitable for present day, non-chemotrophic metabolism has yet to be found, it is unclear where in the barren sandstones of the Naukluft Plateau this energy would come from. Still, If you want to poke around for even more context and/or Martian lifeforms, GigaPan user Neville Thompson stitched all of the photos together in this gorgeous panorama.", "Liberatore, Stacy.   \"Alien Hunter Claims to Have Spotted a 'Hairy Spider Monkey' and 'Slug Animal' on Mars Among Several Bizarre Sightings\"\r\n    Daily Mail.   30 December 2016.", "Pontzer, Herman, et al.   \"Primate Energy Expenditure and Life History.\"\r\n    Proceedings of the National Academy of Sciences..   28 January 2014.", "Westerterp-Plantenga, M.S., et al.   \"Energy Metabolism in Humans at a Lowered Ambient Temperature.\"\r\n    European Journal of Clinical Nutrition.   April 2002.", "Grotzinger, John, P.    \"Habitability, Taphonomy, and the Search for Organic Carbon on Mars.\"\r\n    Science.   24 January 2014.", "Lakdawalla, Emily.    \"Curiosity Update, Sols 1250-1310: Across the Naukluft Plateau.\"\r\n    The Planetary Society.   13 April 2016.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]