["About this rating", "Makes you proud, doesn't it?", "Left to right:\nPrincess Letizia of Spain,\nFrench first lady Carla Bruni,\nand, yep, you guessed it.", "Comparing the physical attractiveness and fashion style of the spouses of national leaders is common fodder for gossip magazines and newspaper columns, particularly in Europe.   Hence, when U.S. First Lady Michelle Obama encountered Carla Bruni-Sarkozy (the former model who is the wife of French president Nicolas Sarkozy) in Strasbourg prior to a NATO summit in April 2009, the UK's Guardian newspaper termed the occasion a \"fashion face-off\" and reported in detail (along with critical commentary) about what each woman was wearing:", "Today, the two fashion titans clashed in sartorial battle in Strasbourg, as the US and French presidents met ahead of the Nato summit. Michelle wore a black coat with a floral pattern of pink poppies. The collar was ruched and tied loosely around the neck. It was rather lovely. Teamed with low kitten heels in black patent leather, the look achieved exactly the right balance of cheeriness and glamour.", "Carla, on the other hand, has gone for a cropped-sleeve coat in a soft grey, which is one of her favourite colours: she wore it a lot last year. And that's part of the problem — it feels like we've seen it all before. Despite the matching pussybow, compared to Michelle, Carla actually looks a bit washed out and (we can't believe we're about to say this) prim and proper. A flash of colour or a fashionable statement accessory could have taken this outfit to another level — but that's just not Carla's style.", "Later that month, Carla Bruni-Sarkozy encountered Princess Letizia (the wife of Prince Felipe, the son of King Juan Carlos and Queen Sofía of Spain and heir apparent to the Spanish throne) at a dinner hosted by the Spanish royal family at the Zarzuela Palace outside of Madrid.  Once again, a UK newspaper (the Daily Mail) gave a blow-by-blow account of the two women's sartorial choices:", "Both were clad in resplendent ball gowns. Miss Bruni wore her hair in a sleek chignon and opted for a simple high-necked black ensemble with an open back.", "Meanwhile Princess Letizia donned a tiara over her tumbling curls and dressed in a satin eggshell blue gown, complete with a glittering train.", "Earlier in the day at lunch it appeared that the first round had gone to Spain, with the 36-year-old princess looking stunning in a figure-hugging cerise dress and matching towering heels.", "Miss Bruni, 41, might have been regretting her choice of a conservative Christian Dior blue dress — even if it did have price tag of around £1,500 — and signature low-heel shoes from Christian Louboutin costing around £320.", "A photograph from the latter event has been manipulated (as shown above) to add a figure representing Michelle Obama, making her appear to come off a very distant third in fashion sense with her plain, rumpled skirt contrasting with the shapely and stylish backsides of the two European women.  That image is clearly a fabricated one, as Michelle Obama was not present at the Spanish dinner (she was back in Washington, where she participated in the unveiling of a memorial bust of Sojourner Truth), and other newspaper pictures of the same scene do not include her in the position shown (i.e., the Michelle Obama figure  was obviously added to the original photograph later):", "In fact, the Michelle Obama figure is pictured with clothing like that which she wore well over a year after the dinner attended by Carla Bruni-Sarkozy and Princess Letizia, at a casual meeting with Spain's King Juan Carlos and Queen Sofia in Palma de Mallorca during the First Lady's vacation trip of August 2010:", "Gardner, David.   \"The Day Carla Met Her Match.\"\r\n    The Daily Mail.   28 April 2009.", "Holmes, Rachel.   \"Michelle Obama's Fashion Face-Off with Carla Bruni-Sarkozy.\"\r\n    The Guardian.   3 April 2009.", "Associated Press.   \"First Lady Honors Abolitionist Sojourner Truth.\"x\r\n    The Guardian.   28 April 2009.", "Associated Press.   \"Michelle Obama Meets Spain's King.\"\r\n     Boston Herald.   8 August 2010.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]