["The claim was published on Facebook by a New Zealand-based user here.", "The post shows an image of children receiving a vaccine. The text superimposed below claims that “autopsies after the war proved that the 1918 flu was not a 'flu' at all” and that it was actually “caused by random dosages of an experimental 'bacterial meningitis vaccine'”.", "The post goes on to claim: “The massive, multiple assaults with additional vaccines on the unprepared immune systems of soldiers and civilians created a 'killing field'. Those that were not vaccinated were not affected.\"", "A similar claim was also shared hundreds of times by Facebook users from around the world here, here and here. It also resurfaced in a TikTok video here in April 2022.", "The claim, however, is false.", "The 1918 Spanish flu pandemic is estimated to have infected about 500 million people, approximately one third of the world’s population at that time. According to the US Centers for Disease Control and Prevention (CDC), “the vulnerability of healthy young adults and the lack of vaccines and treatments created a major public health crisis, causing at least 50 million deaths worldwide”.", "The CDC says the pandemic was caused by the “H1N1 virus with genes of avian origin”.", "It states: “The 1918 influenza pandemic was the most severe pandemic in recent history. It was caused by an H1N1 virus with genes of avian origin. Although there is not universal consensus regarding where the virus originated, it spread worldwide during 1918-1919.”", "Dr Peter Hobbins, a University of Sydney historian specialising in medicine and technology, told AFP that autopsies conducted after the 1918 Spanish flu pandemic did not show that an experimental bacterial meningitis vaccine caused the virus outbreak.", "“Many autopsies were conducted in patients who died from 'Spanish' flu, which confirmed that the primary cause of death was the filling of the lungs with fluid, either due to the disease or to the body's over-active immune response to infection.", "“There was a clear link between the clinical syndrome of 'Spanish' flu and the autopsy presentation, and no suggestion that the deaths were due to a proposed experimental vaccine,\" he said in the November 23 email.", "The real cause of the 1918 Spanish flu epidemic was a novel strain of Influenza A virus, Dr Hobbins said. He added that attempts around the world were made to create a vaccine, but at the time it was unclear what “the causative agent was, as the microscopes in use were not powerful enough to see viruses\".", "Dr Hobbins estimates that between one quarter and one third of New Zealand’s population was infected during the 1918 Spanish flu pandemic.", "New Zealand, Dr Hobbins added, had no mass vaccination campaign against bacterial meningitis at the time.", "“This scale and intensity of infection could not have been caused by the proposed experimental 'bacterial meningitis' vaccination - partly because it did not exist, and partly because the only mass vaccination campaign underway at the time was against the influenza itself,” he explained.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]