["Last week this article in The Star newspaper, reporting that two people had starved to death in Turkana, sparked an online debate among Kenyans over the drought.", "Various images showing men, women and children in dreadful situations were shared alongside posts castigating the government for allowing its people to die from hunger.", "But at least five widely shared photos being used to illustrate the current drought are actually old images, in one case dating back as long ago as 1993.", "The first photo, showing an emaciated man outside his hut, was shared on this Facebook group with more than 950,000 followers. But a reverse image search revealed it was used in a video about Turkana, published on YouTube by the radio station Capital FM on September 2, 2011.", "The same image can also be seen in recent tweets that use the hashtag #TurkanaDrought or include the phrase “Turkana hunger”.", "In the Capital FM video, the man is identified as Kaler Uyereng, one of the millions of people affected by the 2011 drought which severely hit Kenya, forcing the then president Mwai Kibaki to declare a national emergency.", "The second image shows a boy surrounded by the carcasses of dead animals. Similarly, some posts have suggested that it shows the current situation in northern Kenya.", "However, a reverse image search showed that the picture had been posted on the website of the charity World Vision in 2017. It was accompanied by the caption: “9-year-old Ejiem sits with the carcass of his favorite sheep, Merireng, in Turkana, Kenya. The East Africa drought has caused the death of many animals like Merireng. (©2017 World Vision/photo by Jon Warren)”.", "Similarly, a photo of a woman and two children feeding on dry bones, which is being used in social media posts to illustrate the current drought, is also a photograph from the World Vision website. It does show a drought in Turkana county, but it was again taken in 2017.", "The fourth image shows a little boy lying on his stomach and drinking from a pool of muddy water.", "But a reverse image search on Google revealed the image was in fact taken in 2009 by a photographer for Reuters news agency in Ethiopia, during a severe drought which also hit Uganda, Somalia, and Kenya.", "A caption on it read: “A boy drinks water from a pond in Bule Duba village in the outskirts of Moyale, near the edge of Oroma and Somali regions of Ethiopia, June 12, 2009.”", "Finally, a fifth image shows a distraught mother carrying her starving child, whose ribs are protruding and can easily be counted. The image was shared on this Facebook group, which has more than 350,000 members.", "This image was in fact taken by an AFP photographer in 1993 in Kongor, in what is today South Sudan.", "BBC reporter Roncliffe Odit has been in Turkana this week and has been documenting the effects of the drought in photos posted on Twitter. Speaking to AFP by telephone, Odit confirmed that he met many people suffering from desperate hunger.", "“We landed in Turkana on Friday, March 15, 2019, to do a totally different story but changed our course when we saw the drought conversation trending on social media. Our editor asked us to go into the villages to find out if it was indeed true what was being reported online. We headed to a village outside Lodwar town where we were met by faces that speak of severe starvation,” Odit told us.", "“I met a blind woman in her 80s living alone as her two sons have moved away with the livestock to look for pasture. She had not eaten for three days, and her neighbours told me that they strived to bring her at least some porridge when they could.\"", "On Sunday, I personally captured this photo of Mama Mariam Loolio, 85, and blind. She had done 3 days without food...\n\t\tAt Kakwanyang’ Village in Turkana County...#WeCannotIgnore #BeyondPressConfrences https://t.co/uVPtexvZM9", "Odit also reported that he had met a man so weakened by hunger that he could barely lift himself from the ground.", "It’s barely 12 hours since I met this great Mzee Lomoni Lewan, who is around 70 years old, from Lotukumo Village in Nakuruo Sub-Location, Turkana County...#WeCannotIgnore #BeyondPressConfrences https://t.co/2R42VYQeAZ", "Other photos posted by Odit on Twitter also show the desperate state of affairs in some parts of Turkana County.", "This is Mama Audan Loteng' Takwa; she’s 63, and a widow...#WeCannotIgnore #BeyondPressConfrences https://t.co/vFmxxXLu9Y", "Selina is due in the next 3 months, but she has done 2 days without a meal...#WeCannotIgnore #BeyondPressConfrences https://t.co/7ZLIkRKco0", "Odit told AFP that sources who spoke to him confirmed that two people had died from starvation in the area.", "The government has so far said it is unaware of any deaths caused by starvation in Turkana since the reports hit local media last week.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]