["The image was published here in an April 3, 2019 Facebook post which claims it shows Modi touching Sonia Gandhi’s feet.", "India’s election started on April 11. Here is an AFP report on the polls.", "The misleading post’s Hindi-language caption says: “Please ask your son not to talk about 72,000 rupees and 2.2 million jobs otherwise I will be nowhere and will have to return to Guajarat, where people can not be lured by false promises anymore.”", "Sonia Gandhi’s son, Rahul Gandhi, is president of the Indian National Congress party.", "Rahul Gandhi has promised 72,000 INR ($1,000 USD) to the 50 million poorest Indian families if he wins elections, according to media reports for example here by India Today.", "On the campaign trail, he also pledged to to fill 2.2 million vacant posts in different government offices by March 2020.", "The two promises feature in the party’s official pre-poll manifesto released on April 2, 2019, which can be seen here.", "Rahul Gandhi has also tweeted about his pledge to fill 2.2 million vacant posts here.", "Modi was previously chief minister of India’s Gujarat state.", "Below is a screenshot of the misleading post:", "The misleading image and the same caption has been posted multiple times on Facebook, for example here and here, and on Twitter here.", "But a reverse image search on Google found the photo in the misleading post is a doctored version of a photo taken by the PTI news agency in September 2013.", "Here is a report containing the original picture published on the NDTV website on 25 September 2013.", "The original photo shows Modi touching the feet of his senior party colleague L K Advani. Here is a BBC profile of Advani.", "The photo is credited to PTI and has a caption saying: “Narendra Modi touched LK Advani's feet on a huge stage in Bhopal today, but the BJP's senior-most leader scripted yet another awkward moment for the party by barely looking at the party's prime ministerial candidate.”", "Below is the screenshot of the original image published on NDTV website.", "A Google reverse image search of the image of Sonia Gandhi used in the misleading post found that it was taken from a 2009 AFP image.", "The original image can be seen here on AFP’s Image Forum website.", "The original image has a caption that says in part: “India's Congress Party President Sonia Gandhi (R), her daughter Priyanka Gandhi (2R), her son Rahul Gandhi (2L) and husband of Priyanka, Robert Vadra (C) walk during a memorial ceremony for slain former Indian Prime Minister Rajiv Gandhi on his 18th death anniversary, in New Delhi, 21 May 2009.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]