["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "After U.S. Rep. Alexandria Ocasio-Cortez, D-N.Y., unveiled the Green New Deal, Republican critics said it would eventually ground air travel.", "Sen. Rick Scott, R-Fla., outlined his opposition to the Democrats’ Green New Deal in a Feb. 25th Orlando Sentinel op-ed:", "\"If you are not familiar with it, here’s the cliff notes version: It calls for rebuilding or retrofitting every building in America in the next 10 years, eliminating all fossil fuels in 10 years, eliminating nuclear power, and working towards ending air travel (to be replaced with high-speed rail).\"", "Scott described mayhem if a Democrat wins the presidency; some 2020 presidential candidates are co-sponsors of the Green New Deal.", "\"What then? Tear down all buildings, eliminate oil and gas, and stop air travel?\"", "Let’s hit the brakes right there -- do the Democrats want to end air travel?", "We found that Scott is ignoring the actual text of the resolution. The resolution does not ground airplanes, either now or in the future. And climate advocates told us the elimination of air travel isn’t a practical goal.", "The \"Green New Deal,\" resolution was introduced by Ocasio-Cortez on Feb. 7 and has 89 Democratic co-sponsors.", "A companion measure in the Senate, introduced by Sen. Ed Markey, D-Mass., has nearly a dozen sponsors -- all Democrats -- including presidential candidates Cory Booker, Kirsten Gillibrand, Kamala Harris, Amy Klobuchar, Bernie Sanders and Elizabeth Warren.", "Broadly, these resolutions address ways to curb climate change and protect the environment. Even if it were to pass both chambers, the resolution would be nonbinding.", "So what does the House resolution say about air travel? In a word, nothing. It makes no mention of airplanes at all. It does call for \"overhauling transportation systems in the United States to remove pollution and greenhouse gas emissions from the transportation sector as much as is technologically feasible,\" which includes \"investment in high-speed rail.\"", "We reached out to Scott’s press office and did not hear back by deadline, but the senator was probably referring to some supporting documents released by Ocasio-Cortez’s staff.", "A frequently asked questions, or FAQ, document mentioned airplanes twice, stating (emphasis ours) \"we aren’t sure that we’ll be able to fully get rid of farting cows and airplanes that fast, but we think we can ramp up renewable manufacturing and power production, retrofit every building in America, build the smart grid, overhaul transportation and agriculture, plant lots of trees and restore our ecosystem to get to net-zero.\"", "The FAQ also called for the United States to \"totally overhaul transportation by massively expanding electric vehicle manufacturing, build charging stations everywhere, build out high-speed rail at a scale where air travel stops becoming necessary, create affordable public transit available to all, with goal to replace every combustion-engine vehicle.\"", "(For the record, according to the UC Santa Barbara ScienceLine, \"cows do contribute to global warming, although in fact they mostly do so by burping rather than farting.\")", "As soon as the the FAQ document became public, the idea that the Democrats wanted to make air travel obsolete was picked up by Fox News and some Republican politicians, including President Donald Trump.", "Ocasio-Cortez’s press office did not reply for this fact-check, but her chief of staff previously said that there were many shared documents among various interest groups, and that the release of this particular document was a mistake.", "Experts on climate change say it’s important to focus on the language in the actual resolution and not the FAQ, which carries no weight.", "\"It seems to me those lines from the FAQ were lighthearted and ill-considered, and it’s not clear why they were posted,\" said Sean Hecht, Co-Executive Director, Emmett Institute on Climate Change and the Environment at UCLA law school.", "Hecht noted that the FAQ doesn’t include any regulatory strategy to ban or even reduce air travel.", "\"It’s framed even in the FAQ as creating conditions where ‘air travel stops becoming necessary’ because alternatives are available -- not limiting or ending air travel,\" he said.", "David Weiskopf, climate policy director for NextGen Climate America, said the Green New Deal calls for a \"net-zero\" goal, which recognizes that emissions -- including from air travel -- won’t be eliminated in 10 years, so there would need to find negative emissions to balance them out. (NextGen Climate America was started by billionaire Tom Steyer. In 2018, the PAC supported Scott’s Democratic opponent, Bill Nelson.)", "\"The comment about cows and planes is not at all an expression of a policy goal to actually eliminate either. It is delivering information that some supporters may not want to hear -- that we will not zero out emissions completely, so we need some additional negative emissions -- expressed in what I take to be a colloquial tone that unfortunately left it open to misconstrual by critics,\" he said. \"No serious observer, supporter of the Green New Deal, climate scientist, or other climate advocate would take these statements as expressing a policy aim to eliminate cows or planes.\"", "Air travel retains a unique role in moving people long distances.", "\"When people rank the difficulty of finding structural solutions to greenhouse gas emissions in various sectors, air travel is one of the hardest both technologically and practically, and there aren’t serious policy proposals yet that would solve the issue through limiting air travel or changing the energy sources for commercial aircraft on a significant scale,\" Hecht said. \"So it’s not a priority for policy.\"", "Serious steps that the United States could take to reduce emissions from air travel emissions would include more efficient planes, more direct routes and alternative bio-based low-carbon fuels.", "In the long run, electric planes may be feasible, said Paul Bledsoe, a strategic advisor at the Progressive Policy Institute and a lecturer on environmental policy at American University.", "\"No serious climate experts advocate ending air travel -- that's simply a red-herring,\" said Bledsoe, who was a climate change advisor to the Clinton White House.", "Time to bring this fact-check in for a landing.", "Scott wrote in an op-ed that the Democrats’ Green New Deal includes \"working towards ending air travel.\"", "The resolution makes no mention of ending air travel. Instead, it calls for \"overhauling transportation systems,\" which includes \"investment in high-speed rail.\" Scott seized on a messaging document from Democrats that mentioned, perhaps in jest, getting rid of \"farting cows and airplanes.\" But we found no evidence that getting rid of airplanes is a serious policy idea from climate advocates.", "We rate this statement False.", "U.S. Sen. Rick Scott op-ed Orlando Sentinel, Feb. 25, 2019", "Green New Deal resolution", "Green New Deal FAQGreen New Deal FAQ (archived)", "Saikat Chakrabarti, tweet, Feb. 9, 2019", "Donald Trump, tweet, Feb. 9, 2019", "Washington Post blog, Liz Cheney's claim that the 'Green New Deal' would eliminate air travel; Death panels, but for deciding who gets to board a flight? Nope. Feb. 14, 2019", "Courier Journal, McConnell to allow vote on Green New Deal, Feb. 14, 2019", "President Donald Trump, El Paso rally, Feb. 11, 2019", "Fox News, Green New Deal: Ocasio-Cortez aims to make air travel obsolete, aid those ‘unwilling’ to work, Feb. 7, 2019", "New York Times, False Claim On El Paso, Repeated In El Paso, Feb. 13, 2019", "National Review, \"Udder Madness,\" Feb. 8, 2019", "Washington Post, \"Ocasio-Cortez retracts erroneous information about Green New Deal backed by 2020 Democratic candidates,\" Feb. 11, 2019", "CNN, Interview with Amy Klobuchar, Feb. 12, 2019", "Factcheck.org, ‘Green New Deal’ Doesn’t Call for ‘End’ to Air Travel, Feb. 12, 2019", "Sen. Mitch McConnell campaign, Tweet, Feb. 12, 2019", "Sen. John Barrasso, Barrasso on Green New Deal: We Need Solutions, Not Socialism, Feb. 12, 2019", "U.S. Rep. Alexandria Ocasio-Cortez, Tweet, Feb. 12, 2019", "TechCrunch, The electric aircraft is taking off July 8, 2018", "NextGen America, Memo about Florida, Nov. 1, 2018", "UCSB ScienceLine, Do cow farts contribute to global warming? May 2, 2011", "Washington Post, \"Ocasio-Cortez retracts erroneous information about Green New Deal backed by 2020 Democratic candidates,\" Feb. 11, 2019", "New York Times, Ocasio-Cortez Team Flubs a Green New Deal Summary, and Republicans Pounce, Feb. 11, 2019", "Vox, Alexandria Ocasio-Cortez’s rocky rollout of the Green New Deal, explained, Feb. 11, 2015", "Interview, Giselle Barry, Senator Edward J. Markey (D-Mass.) spokeswoman, Feb 26, 2019", "Interview, Sean Hecht, Co-Executive Director of the Emmett Institute on Climate Change and the Environment, and Evan Frankel Professor of Policy and Practice, at UCLA School of Law, Feb. 27, 2019", "Interview, David Weiskopf, Climate Policy Director for NextGen Climate America, Feb. 27, 2019", "Interview, Paul Bledsoe, strategic advisor at the Progressive Policy Institute and a lecturer on environmental policy at American University who served on the White House Climate Change Task Force under President Clinton, Feb. 26, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]