["Deirdre Imus argued that the number of unauthorized immigrants is higher than under Ronald Reagan.", "The crisis of young Central Americans showing up at the border has presented pundits another opportunity to compare the records of President Barack Obama and President Ronald Reagan.", "We caught Deidre Imus, a Fox Business contributor, debating presidential immigration scorecards with Fox News analyst Lis Wiehl on July 23, 2014.", "\"What has happened under President (Barack) Obama, is people thinking they can come here, especially unaccompanied minors, thinking they are getting amnesty,\" Imus said on her husband Don’s show Imus in the Morning.", "Wiehl shot back that this had been going on a long time and in fact, it was no different under Reagan. Imus was nonplussed.", "Imus: \"They were not pouring in like that, Lis. Are you really going to say that?\"", "Wiehl: \"Yes, they were. They were pouring in. Yes, they were.\"", "Imus: \"No, they weren’t. No, they were not.\"", "A reader asked us to find out who was right.", "The weight of the evidence favors Wiehl, not Imus. Less people are illegally entering, or trying to illegally enter, the country under Obama than Reagan.", "There are two ways to measure the pressure at the border. You can look at total apprehensions by the U.S. Border Patrol and you can look at changes in the estimates of the undocumented population in the country. Neither is perfect, but apprehension numbers have the advantage that at least they are based on the actual reports of people detained by federal agents, rather than surveys by the Census Bureau. We’ll look at the apprehension data first.", "Apprehensions", "Using data from U.S. Customs and Border Protection we can see the number of people stopped along the southwest border. This table covers the number of attempted crossings during the Reagan years.", "Year", "Apprehensions", "1988", "942,861", "1987", "1,122,067", "1986", "1,615,844", "1985", "1,183,351", "1984", "1,058,276", "1983", "1,033,974", "1982", "745,820", "1981", "749,808", "Average", "1,056,500", "And this one covers the same border for the Obama years.", "Year", "Apprehensions", "2013", "414,397", "2012", "356,873", "2011", "327,577", "2010", "447,731", "2009", "540,865", "Average", "417,489", "It’s worth noting that apprehensions include everyone who is caught in the United States illegally. This would include the unaccompanied minors who have stirred such concern recently. We know the number of these young people has been rising rapidly and the data in this table only run through 2013.", "It’s fair to ask if the exponential growth among children would be enough to change the results of this comparison if we had a complete count for 2014. The answer is, not likely. In 2013, the unaccompanied children represented about 6 percent of the total. While they might be the focus of the current debate, even if they continue to grow dramatically, they have a limited impact on the overall numbers.", "There is another issue. Susan Martin, a migration policy expert at Georgetown University, cautions that border patrol tactics changed between the 1980s and today.", "\"The basic strategy in the 1980s, and before, was to apprehend and then return people immediately back to Mexico,\" Martin said. \"A substantial number attempted re-entry until they were successful. It was, in effect, a revolving door. Beginning in the Clinton administration, the strategy shifted to deterrence.\"", "For a while, that deterrence strategy, which included fingerprinting and a hardened border, tended to push the numbers down. For the purposes of this fact-check, the point is that changes in tactics and policies will change the apprehension statistics.", "With that caveat, there were far more apprehensions during the Reagan administration than during the Obama administration.", "Estimated undocumented population", "Measuring the number of undocumented people during most of the Reagan years is difficult. Before 1986, the Census Bureau made no allowance for people who were in the country without authorization. The bureau’s best estimate was that starting in 1980, about 200,000 undocumented people entered the country each year.", "In 1986, the Census Bureau began tracking these numbers, but much more significant than survey methods, 1986 brought a major immigration reform law that offered amnesty to people who had been in the country continuously since 1982. In short order, more than 1.5 million people applied for and gained legal status.", "The standard way to measure the flow of unauthorized people into the country is to see how that population changes from year to year. But with people converting from illegal to legal status, simple comparisons became tricky during the last two years of Reagan’s term.", "Jeffrey Passel is a senior demographer with the Pew Research Center and is a leading authority on immigration statistics. Allowing for the people who changed their status, Passel finds \"a net increase of about 1.6 million\" during the Reagan years. To put that in annual terms, while the flow might have gone up and down, the average rate of 200,000 per year held true throughout Reagan’s administration.", "For Obama, Passel said the numbers are \"far less than under Reagan.\"", "Passel said there was a net increase of 370,000 undocumented people and the average annual change was 120,000 from 2009-12.", "Data from the Department of Homeland Security show an actual decline. The estimated undocumented population in 2010 was 11.6 million. For 2011, it was 11.5 million, and in 2012, it was 11.4 million. (We don’t include 2009 because of a major revision in Census Bureau methodology that prevents a direct comparison.)", "By definition, estimating is not an exact science and so Homeland Security summarized the trend as \"little to no change.\"", "\"It is unlikely that the unauthorized immigrant population increased after 2007,\" the department wrote in 2011, \"given relatively high U.S. unemployment, improved economic conditions in Mexico, record low numbers of apprehensions of unauthorized immigrants at U.S. borders, and greater levels of border enforcement.\"", "Martin at Georgetown University underscored that much of the trend is due to basic economics.", "\"Employer demand is certainly a major factor in explaining shifts in movement,\" Martin said. \"When the economy tanked in 2008, particularly in sectors such as construction, the number of new arrivals plummeted to what is estimated to be net zero growth in undocumented migration.\"", "According to the Pew Research Center, the unauthorized immigrant population rose slightly in 2012 to 11.7 million. But that still leaves the Obama years with fewer new undocumented people than Reagan.", "Our ruling", "Imus said that people \"were not pouring in\" under Reagan like they are now. The numbers tell a different story. The apprehension figures, even allowing for changes in tactics, show an average of over a million attempts by people to cross the border during the Reagan years. For Obama, the average is about 417,000.", "If we count the size of the undocumented population, the best estimates are that it rose 200,000 per year under Reagan. The highest estimate for Obama is 120,000 per year.", "We rate the claim False.", "Fox Business, Imus in the Morning, July 23, 2014", "Congressional Research Service, Unauthorized Aliens Residing in the United  States: Estimates Since 1986, Dec. 13, 2012", "Rand Corporation/Urban Institute,  Undocumented Migration to the United States, 1990", "Jeffrey Passel, Estimating the number of undocumented aliens, 1986", "U.S. Department of Homeland Security, Estimates of the Unauthorized Immigrant Population Residing in the United States: January 2012, March 2013", "U.S. Department of Homeland Security, Estimates of the Unauthorized Immigrant Population Residing in the United States: January 2011, March 2012", "U.S. Department of Homeland Security, Estimates of the Unauthorized Immigrant Population Residing in the United States: January 2010, March 2011", "Pew Research Center, Population Decline of Unauthorized Immigrants Stalls, May Have Reversed, Sept. 23, 2013", "U.S. Customs and Border Protection,  Total illegal alien apprehensions by fiscal year - Southwest border 1960-2013", "Department of Homeland Security, Apprehensions by the U.S. Border  Patrol: 2005–2010, July 2011", "U.S. Customs and Border Protection, Southwest Border Unaccompanied Alien Children", "Washington Post, Congress tried to fix immigration back in 1986. Why did it fail?, Jan. 30, 2013", "PolitiFact, Yep. Reagan did the A-word, Jan. 6, 2008", "Email interview, Susan Martin, director, Institute for the Study of International Migration, Georgetown University, July 23, 2014", "Email interview, Jeffrey Passel, senior demographer, Pew Research Center, July 23, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]