["“Italy: hydroxychloroquine works! France: hydroxychloroquine works! Spain: hydroxychloroquine works! Brazil: hydroxychloroquine works! Dr. Fauci: there's no strong evidence it works. No strong evidence? There's the evidence of the entire world's medical community,” an April 5, 2020 tweet by an American journalist says.", "The same claim also appears on Facebook here, here, here and here and on Instagram here.", "Fauci, the director of the National Institute of Allergy and Infectious Diseases and a member of the coronavirus task force, has advised American presidents for decades and led US government efforts to counter diseases including HIV/AIDS.", "But he has been strongly criticized by some supporters of Donald Trump because he has not matched the president’s enthusiastic endorsement of hydroxychloroquine as a treatment for COVID-19, and is sometimes perceived as disagreeing with the US leader.", "The call to #FireFauci has circulated on Twitter, and Trump himself retweeted one tweet with the hashtag.", "Fauci has acknowledged anecdotal evidence that hydroxychloroquine has been beneficial when used as a treatment for COVID-19 patients, but emphasized that clinical testing is needed to scientifically determine if the drug is beneficial, NIAID press officer Kathy Stover told AFP by email.", "Countries are expanding access to hydroxychloroquine and chloroquine, related compounds that are synthetic forms of quinine, which comes from cinchona trees and has been used for centuries to treat malaria.", "The medicines have shown early promise against the COVID-19 illness in initial studies in France and China, which led Trump to call them a \"gift from God\" in late March, even as experts including Fauci urge caution until clinical trials can validate their effectiveness.", "Trump has touted hydroxychloroquine and antibiotic azithromycin as potential “game changers” in countering the pandemic, which has left more than 145,000 people dead worldwide.", "The US Food and Drug Administration has issued an Emergency Use Authorization allowing healthcare providers to prescribe hydroxychloroquine for adults unable to participate in clinical trials, along with dosage and administration guidance.", "However, the claim that Italy, France, Spain and Brazil have confirmed that the drug “works” is false.", "The Italian Medicines Agency, a public institution that regulates pharmaceuticals in Italy, has published a handbook on the use of hydroxychloroquine \"in the therapy of adult patients with COVID-19.\"", "The official guide calls evidence of the drug’s effectiveness against the virus “preliminary” and “anecdotal”-- in line with Fauci’s assessment.", "“Since the therapeutic use of hydroxychloroquine is entering clinical practice on the basis of incomplete evidence, a randomized study evaluating its clinical efficacy is urgently needed,” the handbook says.", "Notably, the guide also states: \"At the present stage of knowledge, the association of hydroxychloroquine with lopinavir/ritonavir or azithromycin is not recommended\" -- the combination of drugs touted by Trump in a March 21 tweet that garnered heavy pushback.", "AFP Factuel has previously published a fact check about whether the French government has validated a drug protocol for COVID-19, which found that it has not.", "“In the context of the emergence of the SARS-CoV-2 coronavirus, preliminary data suggests a potential effect of hydroxychloroquine on this virus, without this being a demonstration of efficacy,” a March 30 guide on France’s National Agency for the Safety of Medicines and Health Products website says.", "“To date, no drug, including hydroxychloroquine, has demonstrated its effectiveness according to evaluation standards in the treatment or prevention of this disease,” the document says.", "Two decrees available on Legifrance, the official website of the French government, explain that the state has authorized both the use of hydroxychloroquine and the combination lopinavir/ritonavir -- medication generally used to treat HIV/AIDS -- for patients with COVID-19 in a hospital setting, subject to doctor decision for serious cases.", "The Spanish Agency for Medicine and Health Products also says that no specific drugs have been validated to treat COVID-19.", "\"To date, there are only partial, preliminary data, sometimes only in vitro or even contradictory, on the efficacy of one product or another, which is why, whenever possible, conducting clinical studies should be prioritized -- which offers a plausible treatment alternative while also generating useful knowledge,” it says.", "The agency’s advisory on the use of hydroxychloroquine and chloroquine notes that no clinical trials have been published on using either to treat a novel coronavirus infection, and recommends “extreme caution” for patients with chronic medical conditions, as their prescribed medications could interact with hydroxychloroquine and cause arrhythmias.", "“The intention of the document is to provide information to professionals about some particularities of these treatments and should not be considered under any circumstances as a recommendation for use or prioritization of use by the Agency,” the advisory says.", "The Brazilian Health Ministry has begun to distribute 3.4 million units of chloroquine and hydroxychloroquine to states for use by patients with severe forms of COVID-19, the ministry announced in a March 25 advisory.", "The National Health Surveillance Agency noted on March 31 that “available studies on the efficacy of these medicines are not yet conclusive.”", "The drug “is indicated only for hospitalized patients. Chloroquine and hydroxychloroquine will complement all other supports used in the treatment of the patient in Brazil, such as ventilatory assistance and medications for symptoms such as fever and malaise,” the health ministry advisory says.", "“Both chloroquine and hydroxychloroquine are not indicated to prevent the disease nor to treat mild cases,” it says.", "Minister of Health Luiz Henrique Mandetta also issued an alert to people who go to pharmacies in search of chloroquine: \"I want to make a request to the population: do not use this medicine outside the hospital environment. This medicine has many side effects that can harm health.”", "Each of the countries has said that clinical trials to determine the efficacy of hydroxychloroquine are needed, and that public health advisories will be updated as new information becomes available.", "The US National Institutes of Health announced on April 9 that a new clinical trial to evaluate the safety and effectiveness of hydroxychloroquine for the treatment of adults hospitalized with COVID-19 has begun. The first participants are enrolled at the Vanderbilt University Medical Center in Nashville, Tennessee.", "AFP Fact Check has debunked more than 330 examples of false or misleading information about the novel coronavirus crisis. A complete list of our fact checks on the topic in English can be found here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]