["Wisconsin Gov. Scott Walker’s support of concealed carry gave his critics, some of whom want to recall him from office in 2012, another reason to slam him.\n\nOn Oct. 30, 2011, two days before the concealed carrying of guns and other weapons became legal in Wisconsin, one visitor to a Facebook site that bashes Walker took a shot at the Republican governor and the law. She posted this statement from the Wisconsin Anti-Violence Effort Educational Fund:\n\n\"People are five to seven times more likely to be murdered in workplaces that allow firearms than in those that prohibit it.\"\n\nConcealed carry has drawn high interest from gun owners -- more than 80,000 application forms for permits were downloaded by 9 a.m. on the first day the law took effect -- and from people who fear more gun carrying will lead to more violence. So we decided to check WAVE’s statement.\n\nIn becoming the 49th state to legalize concealed carry, Wisconsin generally allows people age 21 and over to carry hidden handguns, stun guns, most knives and other weapons. But there are restrictions, including some that apply to workplaces.\n\nOwners and occupants of property can prohibit concealed carry on or in the property. And employers can prohibit employees from carrying concealed weapons while on the job.\n\nWAVE, which describes itself as the \"only statewide grassroots organization solely dedicated to reducing gun violence, injuries and deaths,\" has been pushing businesses to post signs prohibiting concealed carry on their premises. It has made the claim that people are five to seven times more likely to be murdered in workplaces that allow firearms to tens of thousands of people through its website, emails and direct mail, said executive director Jeri Bonavia.\n\nThe claim, she said, is based on a May 2005 article in the American Journal of Public Health, which publishes peer-reviewed scientific research.\n\nThe article was written by researchers from the University of North Carolina’s Department of Epidemiology and Injury Prevention Research Center. We also found an earlier article on the same study, which appeared in another research publication, the American Journal of Epidemiology.\n\nThe researchers examined 152 homicides that occurred in 143 workplaces in North Carolina from January 1994 through March 1998. They concluded that workplaces where guns were permitted \"were five to seven times more likely to be the site of a worker homicide relative to those where all weapons were prohibited.\"\n\nSo, the researchers said workplaces that allowed guns were five to seven times more likely to be the site of a homicide. In contrast, WAVE said people are five to seven times more likely to be murdered in workplaces that allow firearms.\n\nWe asked Stephen Marshall, one of the researchers, whether WAVE’s wording was an accurate expression of what his study found; he simply reiterated the phrasing used in the study.\n\nWe put the same question to other researchers; some said they thought WAVE’s statement was an essentially accurate expression of what the study found, while others thought WAVE’s wording was problematic.\n\nBut there’s a more important question in terms of whether WAVE’s claim is accurate: Does the study’s major finding -- North Carolina workplaces that allowed guns were much more likely to be the site of a homicide -- apply to other states, including Wisconsin?\n\nMarshall said one could not assume that the five-to-seven-times statistic from his study would be true for Wisconsin or any other place.\n\nOther experts, however, gave a range of answers on whether the finding of the North Carolina study is applicable to Wisconsin workplaces.\n\nApplicability unknown: Susan Gerberich, co-director of the Regional Injury Prevention Center at the University of Minnesota, said that because the study was limited to North Carolina, it is not known whether the increased risk of workplace homicide would be true in other places.\n\nCorinne Peek-Assa, director of the University of Iowa Injury Prevention Research Center, said \"generalizing epidemiologic studies is never simple.\"\n\nAnd Mary Vriniotis, research specialist with the Harvard Injury Control Research Center, said: \"This study provides good evidence that workplaces allowing firearms increase the risk of workplace homicide,\" but \"it's hard to say whether the findings in Wisconsin would be the same.\"\n\nApplicability possible: Epidemiology professor Sabrina Walsh of the University of Kentucky Injury Prevention and Research Center said it is possible the higher workplace homicide risk found in North Carolina would be true in other states.\n\nAnd Stephen Hargarten, director of the Medical College of Wisconsin Injury Research Center, said the North Carolina study should be cause for concern in Wisconsin that workplace homicides would occur more often in workplaces that allow guns than in those that don’t.\n\nApplicability likely: Daniel Webster, co-director of the Johns Hopkins University Center for Gun Policy and Research, said that although the five-to-seven times statistic found in the North Carolina wouldn’t automatically apply to other states, \"I don’t have any reason to think you’d have radically different findings\" if the North Carolina study were replicated in Wisconsin.\n\nAll the researchers said they were not aware of any other study like the one done in North Carolina.\n\nOur conclusion\n\nCiting a university study, the Wisconsin Anti-Violence Effort said: \"People are five to seven times more likely to be murdered in workplaces that allow firearms than in those that prohibit it.\"\n\nSome experts faulted WAVE -- though others didn’t -- for using different wording than the study itself, which said North Carolina workplaces that allowed guns were five to seven times more likely to be the site of a homicide.\n\nSome experts said they could not conclude from the North Carolina study whether the higher likelihood of workplace homicide would be true in other places like Wisconsin. But other experts said the North Carolina study was proof that the workplace homicide rate in Wisconsin likely would be at least somewhat higher in workplaces that allow guns compared to workplaces that don’t.\n\nIn sum, WAVE’s statement is generally accurate, but leaves out important details, such as that the study applied only to North Carolina.\n\nThat’s our definition for Half True.", "Wisconsin Anti-Violence Effort Educational Fund, \"Guns and alcohol don’t mix\" online petition\n\nWisconsin Anti-Violence Effort Educational Fund, About WAVE page", "S--- Scott Walker is Doing to My State Facebook page, WAVE posting, Oct. 30, 2011", "Wisconsin Anti-Violence Effort Educational Fund, flier\n\nAmerican Journal of Public Health, \"Employer policies toward guns and the risk of homicide in the workplace?,\" May 2005\n\nInterview and email interview, Wisconsin Anti-Violence Effort Educational Fund executive director Jeri Bonavia, Oct. 31 and Nov. 1 and 2, 2011\n\nJSOnline.com, \"More than 80,000 concealed carry applications downloaded,\" Nov. 1, 2011\n\nWisconsin Department of Justice, concealed carry questions and answers, Oct. 20, 2011\n\nInterview, Medical College of Wisconsin Injury Research Center director Dr. Stephen Hargarten, Nov. 3, 2011\n\nIndustrial Safety & Hygiene News, \"Murders more likely in workplaces allowing weapons,\" May 27, 2005\n\nEmail interview, University of North Carolina Injury Prevention Research Center interim director and epidemiology professor Stephen Marshall, Nov. 2 and 3, 2011\n\nEmail interview, University of Minnesota Regional Injury Prevention Center co-director Susan Gerberich, Nov. 3, 2011\n\nAmerican Journal of Epidemiology, \"Homicide on the job: Workplace and community determinants,\" March 12, 2001\n\nEmail interview, University of Iowa Injury Prevention Research Center director Corinne Peek-Assa, Nov. 3, 2011\n\nInterview, Johns Hopkins University Center for Gun Policy and Research co-director Daniel Webster, Nov. 3, 2011\n\nInterview, University of Kentucky Injury Prevention and Research Center epidemiology professor Sabrina Walsh, Nov. 3, 2011\n\nMilwaukee Journal Sentinel, \"Questions and answers on Wisconsin’s new law, going into effect Tuesday,\" Oct. 30, 2011\n\nInterview and email interview, Harvard Injury Control Research Center research specialist and communications liaison Mary Vriniotis, Nov. 4, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]