["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As the nation winds down to a government shutdown and possible default on its debt, the fight over President Barack Obama’s health care law continues.", "PolitiFact Georgia was asked to check a claim made by Georgia Congressman Tom Graves about the law, more commonly referred to as Obamacare. Graves, a Republican from Ranger, has become one of the legislative leaders for a GOP push in the U.S. House to defund Obama’s health care law in order to prevent the government shutdown.", "During an appearance last weekend on ABC’s \"This Week,\" Graves defended his plan and cited additional evidence to show that support for Obamacare is dwindling.", "In response to a question about a Wall Street Journal editorial regarding the GOPs inept strategizing on budget issues, Graves said:", "\"That’s their opinion. An editorial clearly is what that is. But when you read the Chicago Tribune, they say delay and stop Obamacare,\" Graves said. \"Warren Buffett says stop it now, start over. … It’s not just Republicans, this is widespread.\"", "Graves’ comments about Buffett were familiar to us and to our audience, which asked us to review the claim. Did Warren Buffett, one of Obama’s early presidential backers, withdraw support for the president’s signature public policy legacy?", "Graves’ claim about Buffett was set in motion by posts from conservative bloggers, who began posting earlier this month, that the Omaha billionaire recently said \"scrap Obamacare and start all over.\" The claim originated with a Sept. 13 post on Money Morning website titled \"Buffett: Scrap Obamacare and Start Over.\" That post used a portion of Buffett’s comments from three years ago, before the health care law was passed. Other sites, including the Weekly Standard and Wall Street Journal, linked to or included portions of the Money Morning post in their stories.", "Our PolitiFact national colleagues recently completed a fact check of the bloggers’ claim, and found the statements were taken out of context and not representative of Buffett’s opinions. The claim was rated Pants On Fire. The same day as the Sept. 17 PolitiFact article, the Washington Examiner also ran a story discrediting the bloggers’ Buffett claim. And FactCheck.org reviewed the claim this week.", "We asked Graves’ office about his ABC News statements.", "The office noted that the Money Morning claim, along with follow-up stories by other media outlets, included inaccurate timeline context with their Buffett claim. But outside of the faulty time element, Buffett did say he would stop Obamacare, start over and explain how to do that, Graves’ office said. And, because Graves did not attribute an inaccurate time frame to Buffett’s comments, they believe his statement was true, the office said.", "But what exactly did Buffett say about Obamacare, when did he say it and what are his current thoughts on the matter?", "Buffett’s Obamacare statements included in the Money Morning blog were taken from an interview he gave with CNBC on March 1, 2010. A Politico article from the same year -- which was also quoted by Graves’ office in response to our questions -- summarized the interview. In that interview, Buffett was asked whether he was \"in favor of scrapping this and going back to start over.\" He said: \"I would be if I were President Obama.\"", "What the blog posts and Graves did not include in their comments was the full context of Buffett’s statements. At the time, Buffett, chairman and CEO of Berkshire Hathaway Inc., was referring to a pending health care bill. (The Affordable Care Act was signed into law days later on March 23, 2010.)", "Buffett went on to say that he would be in favor of scrapping the Senate version of the bill, but that he’d vote for it instead of doing nothing. Ultimately, Buffett said he’d like to see a plan that really attacked (health care) costs.", "Last week, Buffett refuted the assertion that he did not support Obamacare.", "\"I’ve never suggested nor thought Obamacare should be scrapped,\" Buffett said in an interview with the Omaha World-Herald. \"I support it. It relates to providing medical care for all Americans. That’s something I’ve thought should be done for a long, long time.\"", "Buffett’s assistant, Debbie Bosanek, told us in an email that Buffett’s office set the record straight for any news organization that contacted them. She also mentioned her boss’s explanation during a CNBC news interview last week.", "After fact checkers began exploring the claim, the Weekly Standard updated its original blog post to say: \"It appears that Buffett made his anti-Obamacare comments in 2010, thereby showing that he, like most of the American people, has opposed Obamacare since even before it was passed …\"", "So what about Graves’ claim?", "The Georgia congressman stated that Warren Buffett said stop Obamacare now and start over. The claim was similar to other blogger claims debunked by fact checkers, and based on an interview Buffett gave three years ago before Obamacare was signed into law. Buffett did say he would scrap the then Senate bill, but also noted that he would vote for it instead of continuing with the existing health care situation.", "Graves’ claim may not have misrepresented Buffett’s comments as being recent like the bloggers did, but his comments were made after similar claims about Buffett were found to be misleading. And Graves still made the claim, without any additional context, five days after several fact checkers debunked the claim.", "We rate Graves’ statement Pants on Fire.", "PolitiFact, \"Bloggers say Warren Buffett recently turned against Obamacare,\" Becky Bowers and Louis Jacobson, Sept. 17, 2013", "ABC News, \"Rep. Tom Graves defends Obamacare de-funding effort,\" Isobel Markham, Sept. 22, 2013", "Email interview, office of U.S. Rep. Tom Graves, Sept. 24, 2013", "Email interview, Debbie Bosanek, assistant to Warren Buffett, Sept. 24, 2013", "The Atlanta Journal-Constitution, Political Insider blog, \"In the defund-Obamacare fight, Tom Graves readies for his close-up,\" Jim Galloway, Sept. 21, 2013", "Washington Examiner, \"What Warren Buffett didn’t say against Obamacare,\" Tim Mak, Sept. 17, 2013", "Omaha World-Herald, \"Warren Buffett says reports he wants to scrap Obamacare are ‘outrageous,’\" Steve Jordan, Sept. 18, 2013", "CNBC, \"Warren Buffett advises scrapping Obamacare,\" YouTube video uploaded by The Foundry Blog, March 1, 2010", "Politico, \"Warren Buffett would scrap health care bill,\" Andy Barr, March 1, 2010", "FactCheck.org, \"Warren Buffett on Obamacare,\" Eugene Kiely, Sept. 24, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]