["About this rating", "In August 2018, a meme describing the Hollywood-friendly nature of the life of an ex-slave turned Congressman named Robert Smalls went viral:", "Each assertion provided in this meme is generally factual, save for the fact that Smalls’ escape took place in 1862 rather than 1861.", "Smalls was born in the home of his mother’s master, John H. McKee, in Beaufort, South Carolina, in 1839. (Either McKee or McKee’s son may have been Smalls' father, but this is unconfirmed.) When Smalls was a teenager, his mother asked McKee to allow her son to be rented out for work in Charleston, South Carolina, where he was eventually hired as a deckhand on the coastal cotton transport steamship Planter. In short order, Smalls became the ship’s de facto pilot.", "According to a biography of Smalls by historian Henry Louis Gates, Jr., “few knew Charleston harbor better than Robert Smalls,” and this knowledge became the ticket to his and his family's freedom.", "At the onset of the Civil War, the Planter (with Smalls among its crew) was commissioned by the Confederacy for a variety of wartime activities, during which the ship played a role in destroying a Union lighthouse, transporting arms, and mapping the intricacies of the Atlantic coast. By May 1862, the Union Navy had set up a large blockade around much of the Atlantic and Gulf coasts, cutting of the shipment of supplies to the Confederacy. Smalls and his fellow slaves quietly developed plans to surrender to the Union ships that comprised this blockade.", "Gregarious, intelligent, and reliable, Smalls had been granted a great deal of trust by the white Confederates in charge of the Planter, and on the night of 12 May 1862, the white officers left the ship in his charge while it was in port. This was the opportunity Smalls and his band had been waiting for. Smalls sneaked his family and several other slaves onto the ship and took it out of port, a complex task that involved impersonating the white captain of the ship by wearing his wide-brimmed straw hat while expertly giving secret coded signals to Confederate checkpoints. Gates described that moment as follows:", "Just before dawn on May 13, 1862, Robert Smalls and a crew composed of fellow slaves, in the absence of the white captain and his two mates, slipped a cotton steamer off the dock, picked up family members at a rendezvous point, then slowly navigated their way through the harbor. Smalls, doubling as the captain, even donning the captain’s wide-brimmed straw hat to help to hide his face, responded with the proper coded signals at two Confederate checkpoints, including at Fort Sumter itself, and other defense positions. Cleared, Smalls sailed into the open seas. Once outside of Confederate waters, he had his crew raise a white flag and surrendered his ship to the blockading Union fleet.", "After a tense approach in which Union ships almost opened fire on the Planter, Smalls surrendered the ship and, along with it, a massive cargo of artillery that just happened to be stored aboard. According to U.S Navy accounts, Smalls' first words upon reaching the blockade were, “Good morning, sir! I’ve brought you some of the old United States guns, sir!”", "Smalls became a celebrity in the North and had a $4,000 bounty put on his head by the Confederacy. In addition to securing his freedom, Small was awarded $1,500 as a reward for the ship and its guns, which he used after the war to purchase the home in which he was born from his former master. According to Gates, Smalls “personally lobbied the Secretary of War Edwin Stanton to begin enlisting black soldiers. After President Lincoln acted a few months later, Smalls was said to have recruited 5,000 soldiers by himself.” According to a biography of Smalls provided by the U.S. House of Representatives:", "His escape was symbolic of the Union cause, and the publication of his name and former enslaved status in northern propaganda proved demoralizing for the South. Smalls spent the remainder of the war balancing his role as a spokesperson for African Americans with his service in the Union Armed Forces. Piloting both the Planter, which was re-outfitted as a troop transport, and later the ironclad Keokuk, Smalls used his intimate knowledge of the South Carolina Sea Islands to advance the Union military campaign in nearly 17 engagements.", "In one of those engagements, Smalls refused to surrender to a Confederate ship in the face of his commanding officer’s cowardice, which led to his becoming the first black captain of a United States ship:", "He assumed command of the Planter when, under “very hot fire,” its white captain became so “demoralized” he hid in the “coal-bunker.” For his valiancy, Smalls was promoted to the rank of captain himself, and from December 1863 on, earned $150 a month, making him one of the highest paid black soldiers of the war. Poetically, when the war ended in April 1865, Smalls was on board the Planter in a ceremony in Charleston Harbor.", "Following the war, Smalls entered political life, and from 1870 to 1874 he served in the South Carolina state senate before easily winning a seat in the U.S. House of Representatives as a Republican. Smalls served five non-consecutive House terms before South Carolina was redistricted by Democrats to limit the number of blacks elected to Congress. Jim Crow, voter suppression, and violence overtook the Reconstruction-era politics in which he was a key player:", "Following the war, Smalls continued to push the boundaries of freedom as a first-generation black politician, serving in the South Carolina state assembly and senate, and for five nonconsecutive terms in the U.S. House of Representatives (1874-1886) before watching his state roll back Reconstruction in a revised 1895 constitution that stripped blacks of their voting rights.", "Smalls died a free man in the same Beaufort, South Carolina, property where he had been born a slave. By the time of his death in 1915, however, Smalls had become a U.S. Representative, a war hero, a civil rights activist, and a homeowner. “My race needs no special defense,” he famously said, “for the past history of them in this country proves them to be equal of any people anywhere. All they need is an equal chance in the battle of life.”", "Cowley, Charles.   \"The Career of Gen. Robert Smalls.\"\r\n    The Romance of History in \"The Black County\".   1882.", "Gates Jr., Henry Louis. \"Which Slave Sailed Himself to Freedom?\"\r\n    The Root.   20 May 2013.", "Thomas-Lester, Avis. \"Civil War Hero Robert Smalls Seized the Opportunity to Be Free.\"\r\n    The Washington Post.   2 March 2012.", "U.S. House of Representatives.   \"Smalls, Robert.\"\r\n    Accessed 21 August 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]