["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A worker walks through a baggage claim area at a nearly-empty O'Hare International Airport on April 2, 2020 in Chicago, Illinois. (Photo by Scott Olson/Getty Images)", "The CDC is not testing passengers for COVID-19 as they get on or off airplanes and trains.", "The federal government is screening certain passengers at 13 airports.", "Screening can include looking for symptoms, but it’s not the same as a test.", "President Donald Trump said he was considering whether to stop domestic travel between U.S. hotspots for COVID-19.", "As he explained his reluctance to harm the transportation industry, Trump inaccurately said airline and train passengers were already being tested for the disease.", "\"We have to get our country back, we have to start moving again, we have to start working again,\" Trump said April 1. \"Now, they’re doing tests on airlines — very strong tests — for getting on, getting off. They’re doing tests on trains — getting on, getting off. But when you start closing up entire transportation systems and then opening them up, that’s a very tough thing to do.\"", "We asked the White House for evidence and did not get a response.", "The Centers for Disease Control and Prevention told us it is not testing passengers at airports or train stations, a spokesperson told PolitiFact.", "It’s possible that Trump was referring to screening of passengers, which is happening at 13 airports for international flights. That isn’t the same as testing.", "Screening someone for symptoms can flag someone who could potentially have COVID-19, but it’s not as definitive as a test. It is impractical to test passengers at airports and train stations, given the slow delivery of most results and limited availability for people with symptoms.", "The CDC screening includes a temperature and symptoms check for travelers coming from foreign countries.", "Airport screenings for some international travel began earlier in the crisis. The CDC announced Jan. 17 it would screen passengers from Wuhan, China, for COVID-19 at the San Francisco, New York and Los Angeles airports. The screenings have expanded to include 13 airports, including Miami, Chicago, Detroit and Boston. They primarily affect American citizens, legal permanent residents and their immediate families who have recently been in China, Iran, or certain European countries.", "Travelers returning from international travel are advised to stay home for 14 days, monitor their health, and practice social distancing.", "Some states have implemented their own screening practices, with mixed results. In Florida, Gov. Ron DeSantis ordered screening (not testing) at Florida airports for passengers from New York, New Jersey and Connecticut. Shortly after, some passengers told the Sun Sentinel that their temperatures were not taken and they saw no visible signs of screening.", "In Broward County, officials are collecting forms from passengers on certain flights from the New York tri-state area, said Greg Meyer, a spokesman for the Fort Lauderdale-Hollywood International Airport.", "Representatives for airports in Chicago, Philadelphia and Detroit said passengers were not taking tests as they board or exit airplanes.", "\"Screening may occur in airports, but testing does not,\" said Florence Brown, a spokeswoman for the airport in Philadelphia.", "U.S. Customs and Border Protection agents are screening international travelers for visible signs of illness, such as coughing or having difficulty breathing, Brown said. International passengers from countries affected by COVID-19 may also receive a printed guide from the CDC.", "We contacted spokespersons for multiple airlines and did not get a response. We did not hear back from Amtrak by deadline.", "Trump said, \"Now, they’re doing tests on airlines — very strong tests — for getting on, getting off.  They’re doing tests on trains — getting on, getting off.\"", "Passengers on planes and trains are not being tested for COVID-19. It’s possible that Trump was referring to screenings, which could include a temperature check or a questionnaire. But even screenings are not as widespread as he said; they are happening at 13 airports for certain countries.", "Trump's statement about \"very strong tests\" at transportation hubs rates Pants on Fire.", "White House, Remarks by President Trump, Vice President Pence, and Members of the Coronavirus Task Force in Press Briefing, April 1, 2020", "CNN, Fact check: Trump falsely claims plane and train passengers are being tested for the coronavirus, April 2, 2020", "Congressional Research Service, COVID-19 and Passenger Airline Travel, March 20, 2020", "Gov. Ron DeSantis, Order 20-80, March 23, 2020", "Transportation Security Administration, Coronavirus (COVID-19) information, April 5, 2020", "U.S. Centers for Disease Control and Prevention, Public Health Screening to Begin at 3 U.S. Airports for 2019 Novel Coronavirus, Jan. 17, 2020", "CDC, Health alert for travelers, 2020", "U.S. Department of Homeland Security, Department of Homeland Security Outlines New Process for Americans Returning from Certain European Countries, China, and Iran, March 13, 2020", "DHS, Fact Sheet: DHS Notice of Arrival Restrictions on China, Iran and Certain Countries of Europe, March 17, 2020", "Rev.com, Florida Governor Ron DeSantis Coronavirus Briefing Transcript, March 24, 2020", "Sun Sentinel, Aren’t New York flyers supposed to be screened in Florida? It might be less than you thought, March 25, 2020", "Email interview, Arleen Porcell, U.S. Centers for Disease Control and Prevention spokeswoman, April 6, 2020", "Email interview, Taylor Garland, a spokeswoman for the Association of Flight Attendants-CWA, April 6, 2020", "Email interview, Florence Brown, City of Philadelphia – Division of Aviation", "Philadelphia International and Northeast Airports spokeswoman, April 6, 2020", "Email interview, Greg Meyer, Broward County Aviation Department spokesman, April 6, 2020", "Email interview, Greg Chin, Miami International Airport spokesman, April 6, 2020", "Email interview, Lisa Gass, Wayne County Airport Authority spokeswoman, April 6, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]