["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "PawSox fans cheer at McCoy Stadium during the final game of the 2012 season. (Providence Journal/Glenn Osmundson)", "A group of investors, including the president of the Boston Red Sox,  announced Monday that they had bought the Red Sox Triple A franchise, the the Pawtucket Red Sox.", "In doing so, they revealed they want to move the team to Providence and build a new 10,000-seat stadium on land that became available after the relocation of Route 195. Home runs over the right-field wall would land in the Providence River.", "Details of the project are still emerging. On Tuesday, the new owners told The Providence Journal that they planned to build the stadium with their own money but were exploring various public-subsidy options, including asking the state to give them the land, which had  been earmarked for a public park.", "One of the new owners, lawyer James J. Skeffington, was asked what such a public-partnership might look like in an interview Tuesday with reporter Gene Valicenti on WPRO-AM.", "\"You know, there’s only 30 cities that have Triple A teams in the United States, in major league baseball. And virtually every one of them [is] playing in government owned ballparks,\" Skeffington said.", "He went on to say that such arrangements were a way for cities and towns to induce the owners of those Triple A teams to play there.", "We wondered if Skeffington was right about the number of publicly-owned ballparks.", "We reached out to Skeffington, who told us his information was based on a consultant’s report that he would provide to us.", "After we called Skeffington, we contacted each of the 30 Triple A teams to find out who owns their ballpark.", "We learned that only three were privately owned: Security Service Field, the Colorado Springs Sky Sox’s stadium; BB and T Ballpark, home of the Charlotte Knights;  and Raley Field, the Sacramento River Cats’ ballpark.", "Skeffington identified four stadiums as being privately owned, but our research concluded that one of those ballparks -- Aces Ballpark in Reno, Nev. -- is, in fact, publically owned.", "That park has been owned by the City Redevelopment Agency of Reno since 2013, according to Eric Edelstein, president of the Reno Aces.", "We note that there is much debate over whether public support for professional sport teams, such as helping to build stadiums, is a wise use of public money. That is beyond the scope of this fact-check.", "Our ruling", "James Skeffington said that \"virtually\" all of the 30 Triple A teams play in government-owned ballparks.", "Our research found that 27 of the 30 stadiums those teams play in are owned by a city, county or other government entity, as seen in Reno.", "We note that the word virtually is not an absolute. Given that, we rate the claim as True.", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "\"The Gene Valicenti Show,\" WPRO-AM radio, James J. Skeffington, Feb. 24, 2015", "Interview and emails, James J. Skeffington, Feb. 24, 2015", "Interviews and emails with staff at the 30 Triple A baseball teams, Feb. 24-25,2015", "Interview, Eric Edelstein, president of the Reno Aces, Feb. 25, 2015", "Interview, Dan Rajkowski, chief operating officer of the Charlotte Knights, Feb. 25, 2015", "AAA Ballpark Data, information sheet on AAA baseball teams and their ballparks, provided by James Skeffington, president of the Boston Red Sox, Feb. 24, 2015", "The Providence Journal, \"New PawSox Owners Eye Riverfront Stadium,\"  Feb. 23, 2015", "The Providence Journal, \"New PawSox Owners Expect to Finance Stadium Themselves,\" Feb. 25, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]