["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump tweeted a doctored video that falsely suggested CNN attempted to stoke racial tension with its coverage of a viral video of two toddlers.", "CNN and other media outlets accurately covered the 2019 story and showed the full video of the boys hugging and playing together.", "Twitter marked Trump’s tweet with a “manipulated media” label, and the parents of the boys have denounced the president’s post.", "President Donald Trump shared a manipulated video on Twitter that claimed CNN aired fake headlines and lied about the relationship between two toddlers in order to stoke racial tension.", "The video, which Twitter marked with a \"manipulated media\" label, displays the CNN logo and a banner that says, \"Terrified todler (sic) runs from racist baby,\" as a black toddler runs down a sidewalk and a white toddler runs after him. The banner switches to \"Racist baby probably voted for Trump.\"", "The video then fades to black and text appears on the screen that reads, \"This is what really happened,\" before showing the full video of the boys excitedly running toward each other and embracing.", "It concludes with text that says, \"America is not the problem. Fake News is. If you see something, say something. Only you can prevent fake news dumpster fires.\"", "Trump shared a deceptively edited video. CNN never ran those headlines, and it accurately covered the story in 2019.", "The video was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. Trump, because he is a politician, is exempt from Facebook’s policies against sharing false or misleading information. But other people online have shared the same video, and they are not exempt from the Facebook fact-checking program. (Read more about our partnership with Facebook.)", "The video of the toddlers — Maxwell and Finnegan — was taken in the Washington Heights neighborhood of New York City and was posted on Facebook in September 2019 by Michael Cisneros, Maxwell’s father.", "The clip quickly went viral, and the boys and their parents appeared on various shows, including a CNN broadcast and the Ellen DeGeneres Show.", "Several media outlets, CNN included, accurately covered the story and showed the full video of the boys hugging and then running down the sidewalk.", "Cisneros told CNN last year that the boys are best friends and that he posted the video because it was a beautiful moment to share in the midst of racism and hate in the world.", "In response to Trump’s post, Cisneros wrote in a Facebook post, \"HE WILL NOT TURN THIS LOVING, BEAUTIFUL VIDEO TO FURTHER HIS HATE AGENDA!!!!!!\"", "\"Utterly shocked. Trump posted this on his Twitter. For all you Trump supporters, I hope that his use of their beautiful video in this way disgusts you. It should,\" Finnegan’s mom, Erica Russo McKenna, said on Facebook.", "The manipulated video includes a watermark for a Twitter account called @CapreDonktum, which routinely creates and posts satirical memes and parody videos.", "A CNN spokesperson also responded to Trump’s post on Twitter.", "\"CNN did cover this story — exactly as it happened,\" the tweet reads. \"Just as we reported your positions on race (and poll numbers). We’ll continue working with facts rather than tweeting fake videos that exploit innocent children. We invite you to do the same. Be better.\"", "CNN did cover this story - exactly as it happened. Just as we reported your positions on race (and poll numbers). We’ll continue working with facts rather than tweeting fake videos that exploit innocent children. We invite you to do the same. Be better. https://t.co/T1nBtejZta", "Trump tweeted a video that suggests CNN aired false information about the relationship between two toddlers.", "The video is doctored. CNN did not air the headlines that appear in the clip.", "We rate this Pants on Fire!", "Twitter, Donald Trump tweet, June 18, 2020", "NBC, Twitter labels video tweeted by Trump as 'manipulated media', June 19, 2020", "CNN, Trump tweets fake video exploiting toddlers, Twitter labels it 'manipulated media', June 19, 2020", "CNN, These two toddlers are showing us what real-life besties look like, Sept. 10, 2019", "CNN tweet, June 18, 2020", "Facebook, Michael D Cisneros video, September 2019", "Facebook, Erica McKenna post, June 18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]