["By Robert Farley", "Posted on March 26, 2020", "Hitting back at New York Gov. Andrew Cuomo’s pleas for the federal government to provide more ventilators, President Donald Trump misleadingly claimed Cuomo rejected a 2015 recommendation to purchase 15,000 ventilators and instead “established death panels” and “lotteries.”", "Contrary to the president’s claim, a task force in 2015 did not make a recommendation about purchasing more ventilators. The report — “Ventilator Allocation Guidelines” — provided guidelines for New York hospitals on how they should decide which patients get ventilators in the event of a severe influenza pandemic.", "The coronavirus pandemic has exploded in New York, where nearly half of the more than 81,000 confirmed cases in the U.S. were located, as of March 26.", "Cuomo said at a press conference on March 24 that the state had an urgent need for more ventilators to deal with an anticipated peak in demand in two weeks for patients needing help to breathe. The state will need at least 30,000 ventilators, he said, and it so far had obtained 7,000.", "“There is no other way for us to get these ventilators,” Cuomo said. “We’ve tried everything else. The only way we can obtain these ventilators is from the federal government. Period.”", "Cuomo said the federal government had, to that point, only provided an additional 400 ventilators, though Vice President Mike Pence said in an interview on Fox News later that day that the federal government would be sending 4,000 more to New York in the next two days.", "Speaking at a Fox News virtual town hall hours after Cuomo made his comments, Trump said that despite Cuomo’s “complaining,” the federal government was “doing probably more — definitely more for [New York] — than anybody else.”", "Trump said that while the federal government is and will continue to help New York, Cuomo “is supposed to be buying his own ventilators.”", "While saying he was “not blaming” Cuomo for the shortage of ventilators, Trump added that in 2015 Cuomo “refused to order 15,000 ventilators” so “he shouldn’t be talking about us.”", "Reading from an article on a conservative website, Trump said Cuomo “rejected buying recommended 16,000 ventilators in 2015 for a pandemic” and that he “established death panels and lotteries instead.”", "Trump on Fox News, March 24: So he had a chance to buy, in 2015, 16,000 ventilators at a very low price and he turned it down. I’m not blaming him or anything else, but he shouldn’t be talking about us. He’s supposed to be buying his own ventilators. We’re going to help. …", "We’re working very, very hard for the people of New York. We’re working along with him, and then I watch him on the show, complaining. And he had 16,000 ventilators that he could have had at a great price and he didn’t buy them.", "That’s a misleading framing of an effort in 2015 in New York to provide guidelines for which patients should get ventilators in the event of a shortage during a severe pandemic.", "But let’s unravel Trump’s comments a bit.", "The president read directly from the headline of a story in the Gateway Pundit, a conservative website, which originally stated, “NY Gov. Cuomo Rejected Buying Recommended 16,000 Ventilators in 2015 for Pandemic, Established Death Panels and Lottery Instead.”", "The article was about a syndicated column by Betsy McCaughey, a former Republican lieutenant governor of New York, who wrote:", "McCaughey, March 18: After learning that the state’s stockpile of medical equipment had 16,000 fewer ventilators than New Yorkers would need in a severe pandemic, Gov. Andrew Cuomo came to a fork in the road in 2015. He could have chosen to buy more ventilators. Instead, he asked his health commissioner, Howard Zucker to assemble a task force and draft rules for rationing the ventilators they already had.", "That task force came up with rules that will be imposed when ventilators run short. Patients assigned a red code will have the highest access, and other patients will be assigned green, yellow or blue (the worst) depending on a “triage officer’s” decision. In truth, a death officer. Let’s not sugarcoat it. It won’t be up to your own doctor.", "Cuomo could have purchased the additional 16,000 needed ventilators for $36,000 apiece or a total of $576 million in 2015. It’s a lot of money but less than the $750 million he threw away on a boondoggle “Buffalo Billion” solar panel factory. When it comes to state budget priorities, spending half a percent of the budget on ventilators is a no brainer.", "McCaughey is referring to “Ventilator Allocation Guidelines,” a 272-page report produced by the New York State Task Force on Life and the Law and the New York State Department of Health in 2015. The group modeled the demands that would be placed on the New York health care system under moderate and severe influenza pandemic scenarios.", "The severe scenario was based on the scale of the 1918 Spanish flu pandemic. The analysis concluded that during a severe influenza pandemic, there would likely be a shortfall of 15,783 ventilators during the peak week of demand.", "Using the assumption that there would be a shortage of ventilators in a severe influenza pandemic, the task force created the guidelines to provide “an ethical and clinical framework” for deciding which patients would get one. The guidelines were “crafted to provide the greatest benefit to as many patients as possible” and to “limit loss of life in the face of such a mass disaster,” according to an FAQ section on the report.", "But contrary to the president’s claim, the task force did not make a recommendation about purchasing more ventilators. That was outside the scope of the report, Valerie Gutmann Koch, the former senior attorney and special consultant to the New York State Task Force on Life and the Law, told us via email.", "Trump “obviously didn’t read the document he’s citing,” Dani Lever, a spokeswoman for Cuomo, said in a statement to The Hill. “This was a 5 year old advisory task force report, which never recommended the State procure ventilators — it merely referenced that New York wouldn’t be equipped with enough ventilators for a 1918 flu pandemic. No one is, including Mr. Trump.”", "The report states that New York added 2,000 ventilators between 2007 — when the first draft guidelines were developed — and 2015, enough so that there would not be a shortage in the event of a moderate influenza pandemic. However, the report states, “there are no current plans to buy enough ventilators for the most severe model.”", "“The State’s current approach to stockpiling a limited number of ventilators balances the need to prepare for a potential pandemic against the need to maintain adequate funding for current and ongoing health care expenses,” the report states. “Furthermore, severe staffing shortages are anticipated, and purchasing additional ventilators beyond a threshold will not save additional lives, because there will not be a sufficient number of trained staff to operate them.”", "In the FAQ section accompanying the report, the task force stated:", "Q: Can the State stockpile as many ventilators as would be needed in a severe pandemic?", "A: Even if New York State purchases additional ventilators, the demand would quickly outpace supply in a severe pandemic. No matter how many ventilators are available, in a severe pandemic there will be shortages because so many people will be sick at the same time. In addition, even with enough ventilators, a sufficient number of trained staff may not be available to operate them, particularly because health care workers will be among the ill.", "Q: What can hospitals do to reduce the demand for ventilators in a pandemic?", "A: Before the Guidelines are implemented, hospitals should practice “surge capacity” to reduce the need for ventilators. For example, elective procedures that require ventilators should be canceled and/or postponed during the period of emergency. For a moderate pandemic, surge capacity practices may be enough to meet the increased demand for ventilators. However, in the event of a severe pandemic, surge capacity measures would still fall short of addressing the anticipated demand for ventilators.", "Asked in a press conference on March 25 about the task force and whether it had suggested New York should increase its stockpile of ventilators, Cuomo responded, “that’s not the fact.”", "“There was an advisory commission called … Life and the Law, that had a chart in 2015 that said, if you had the 1918 Spanish flu pandemic, you may need ‘X’ number of ventilators,” Cuomo said. “There’s no state in the United States that bought ventilators for the 1918 Spanish flu pandemic. The federal government did not buy ventilators for the 1918 Spanish flu pandemic. Nobody in the world bought ventilators in preparation for a 1918 Spanish flu pandemic.”", "Not mentioned by the president was that McCaughey, in the fuller op-ed that appeared in the New York Post, was also critical of the federal government’s preparedness.", "Wrote McCaughey: “To be fair, governments everywhere stockpiled too little. Washington didn’t do much better: The federal Strategic National Stockpile is undersupplied to meet the coronavirus emergency.”", "Although the New York report did not explicitly recommend the purchase of additional ventilators, one of the task force members, Samuel Gorovitz, a philosophy professor at Syracuse University, told us via email that he wishes leaders at the time had reflected “about the overall context” of the report and decided additional purchases were “a prudent thing to do.”", "A New York Times analysis of the 2015 task force report and a study by the Johns Hopkins Center for Health Security concluded that New York has slightly fewer ventilators per capita than the national average.", "It’s also misleading to describe the triage committees overseeing the ventilator allocation guidelines as “death panels.”", "“I am clear that it [the 2015 report] did not recommend ‘death panels’ or anything that could plausibly be described that way,” Gorovitz, who served on the task force, told us. “Like the Covid-19 guidelines under development now, it anticipated the possible need to make tragic decisions. And if Gov. Cuomo had bought 20,000 ventilators in 2015, we would still need to be prepared to face and make such decisions. Better to be thoughtful about how to minimize their awfulness than to pretend the need can be avoided.”", "“Death panels” — a term the Gateway Pundit used to describe the New York guidelines and which was repeated by Trump — is a phrase that was popularized — misleadingly so — by former Republican vice presidential candidate Sarah Palin in 2009 to describe Medicare payments for end-of-life counseling by physicians as part of the then-proposed Affordable Care Act. Palin later used the term to criticize a panel created under the new health care law to slow the growth of Medicare spending, claiming, wrongly, that it would be used to ration health care.", "Koch, the senior attorney for the task force who is currently the director of law and ethics at the MacLean Center for Clinical Medical Ethics at the University of Chicago and faculty fellow at DePaul University College of Law, also said it is inaccurate to call the triage committees proposed by the New York task force “death panels.”", "“The 2015 ventilator allocation protocol is intended to save the most lives in an influenza pandemic where there are a limited number of available ventilators,” Koch told us. “It is grounded in a solid ethical and legal foundation and balance the goal of saving the most lives with important societal values, such as protecting vulnerable populations, to build support from both the general public and health care staff. The recommendations are based on a number of important ethical principles, identified through years of deliberation and analysis, and with significant public outreach.", "“The duty to steward resources is the need to responsibly manage resources during periods of true scarcity,” Koch said. “The duty to plan is the responsibility of government to plan for a foreseeable crisis. Distributive justice requires that an allocation system is applied broadly and consistently to be fair to all. Transparency ensures that the process of developing a clinical ventilator allocation protocol is open to feedback and revision, which helps promote public trust in the guidelines. The guidelines recommend triage officers/committees to implement the protocol in order to ensure fairness and equality. To ensure that patients receive the best care possible in a pandemic, the guidelines provide that a patient’s attending physician does not determine whether his/her patient receives or continues with ventilator therapy; instead, a triage officer or triage committee makes the decision.”", "An article published in the New England Journal of Medicine on March 23 advocated the nationwide development of “strategies for rationing during pandemics” and cited the New York task force’s efforts as an example.", "“Though some people may denounce triage committees as ‘death panels,’ in fact they would be just the opposite — their goal would be to save the most lives possible in a time of unprecedented crisis,” the authors wrote.", "It is also inaccurate, Koch told us in an email, to describe the guidelines proposed by the task force as a “lottery,” as the headline Trump cited did.", "Koch, March 25: The task force examined various nonclinical approaches to allocating ventilators. These included distributing ventilators on a first-come first-served basis, randomizing ventilator allocation (sometimes known as a lottery), requiring only informal clinical judgment in making decisions about ventilator allocation, and prioritizing certain patient categories, such as health care workers, older patients, and those with certain social criteria. The task force, however, rejected these methods, saying that they should not be used as the primary triage strategy because they are often subjective and/or do not support the goal of saving the most lives. Thus, it is wholly inaccurate to describe the guidelines as a lottery system. Rather, the allocation protocol uses only clinical factors to evaluate a patient’s likelihood of survival and determine his or her access to ventilator therapy. Under the Guidelines, under no circumstance will a decision regarding ventilator allocation be based on non-clinical factors such as race, ethnicity, sexual orientation, socio-economic status, perceived quality of life, ability to pay, or role in the community.", "The guidelines did envision using a lottery in limited circumstances. Although “[a] patient’s likelihood of survival … is the most important consideration when evaluating a patient … there may be a situation where multiple patients have been assigned a red color code, which indicates they all have the highest level of access to ventilator therapy, and they all have equal (or near equal) likelihoods of survival.”", "“If the eligible patient pool consists of only adults or only children, a randomization process, such as a lottery, is used each time a ventilator becomes available because there are no other evidence–based clinical factors available to consider,” the guidelines state.", "As for Trump’s claim that Cuomo in 2015 “had a chance to buy” 16,000 ventilators “at a very low price,” and that “he had 16,000 ventilators that he could have had at a great price and he didn’t buy them,” to be clear, there was no discount being offered for the purchase of 16,000 ventilators back in 2015.", "The federal government also has a cache of ventilators in the CDC’s Strategic National Stockpile. The government does not publicize the contents of the federal stockpile, but Dr. Richard Branson, a professor of surgery emeritus at the University of Cincinnati and the editor-in-chief of the journal Respiratory Care, told Politico there are believed to be around 20,000 ventilators in the national emergency stockpile.", "Research published in Emerging Infectious Diseases in 2017 concluded that the number of ventilators in the national stockpile “might not suffice to meet demand during a severe public health emergency.” The Wall Street Journal reported on March 23 that state officials in Washington and Massachusetts “say they have received a fraction of what they sought from the national stockpile,” including for medical equipment.", "Using CDC estimates on the projected scope of the coronavirus pandemic, the authors of a recent article in the New England Journal of Medicine projected that in the U.S. “the number of patients needing ventilation could range between 1.4 and 31 patients per ventilator.”", "“Whether it will be necessary to ration ventilators will depend on the pace of the pandemic and how many patients need ventilation at the same time, but many analysts warn that the risk is high,” the authors wrote.", "To sum up, while the task force report did highlight a shortage of ventilators in the event of a severe influenza pandemic, it did not recommend whether the state should buy more ventilators (and hire the staff necessary to operate them). And it is misleading to call those guidelines a “death panel” or “lotteries.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]