["The photo was shared in a Facebook post here on June 6, 2018.", "The posts’ Hindi language caption says: “Our uncle (chacha) Nehru, fighting the battle for independence”.", "Below is a screenshot of the misleading post:", "Jawaharlal Nehru (1889-1964) was a key figure in India's nationalist movement, and the first Prime Minister of Independent India.", "The same photo was also shared on Facebook with a similar claim here, and here.", "The claim is false; the photo shows an actor playing Nehru in the 2013 play ‘Drawing the Line’.", "A Google reverse image search found the photo was published here on the website for the UK's Metro newspaper on December 11, 2013.", "Below is a screenshot of the review, which includes the same image as the one used in the misleading Facebook posts:", "The caption below the photo reads: “Drawing The Line starring Silas Carson and Lucy Black”.", "According to this summary of the play on the website of the Hampstead Theatre, London, where the play was performed in 2013, “Drawing The Line” is set in 1947 and follows a judge sent to British India and deputed to draw the boundary that will demarcate the soon to be independent states of India and Pakistan.", "On the play's official web page on the Hampstead Theatre website here, the “Cast & creatives” section states Silas Carson played Nehru and actress Lucy Black played Edwina Mountbatten.", "The false Facebook posts have previously been debunked by fact-checking organisation Altnews here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]