["About this rating", "In October 2018, a meme comparing President Trump and various politicians to Biff Tannen and other characters from the popular Back to the Future film franchise began circulating on social media:", "Before we get to the \"why\" of this meme (isn't this a fairly common pose in both the movie world and in reality?), let's look at the very basic claim: Are these images real?", "The top picture originated with a press conference held in the White House Rose Garden on 2 October 2018, during which President Trump touted a new trade agreement with Canada and Mexico. This still image appears to have come from a controversial moment during the event when President Trump reportedly insulted reporter Cecilia Vega, saying: \"I know you're not thinking, you never do.\"", "The same four men pictured in this viral mashup can be seen in a video of the exchange from The Guardian:", "The bottom portion of this meme is also a genuine still from the 1985 film Back to the Future, taken from a scene in which Biff Tannen and his crew of bullies enter the diner to pressure George McFly into finishing their homework for them:", "This meme used genuine images to show that President Trump stood in a similar pose to the fictional character Biff Tannen in the movie Back to the Future. But why would anyone care? Is it that unusual to see four men standing in a line?", "The answer is that this item catches people's attention because it play on the long-running humorous notion that President Trump and Biff Tannen share a number of personality traits:", "There’s a very specific analog between Biff Tannen, the bully and bad guy in almost every timeline in Back to the Future Part II, and a certain political figure (Donald Trump) who is rather popular in the United States right now. He’s been handed the keys to fortune, he’s unrepentantly used that fortune exclusively for himself, and he’s even become a public advocate for plastic surgery for women in his family.", "It is not hard to put two and two together.", "These sorts of jokes have become quite common over the years and have even warranted responses from the cast and crew of the iconic movie.", "Bob Gale, the screenwriter for the Back to the Future films, told The Daily Beast in 2015 that Biff was based (entirely or in part) on Donald Trump. However, we examined a bit of the history behind the movie and found that Gale was likely exaggerating about Trump's importance to the character when he made those comments. Tom Wilson, the actor who played Biff, also said that his performance was not based on any specific real individual.", "While Donald Trump may not have been the sole inspiration for Biff Tannen, some fans can't help but draw comparisons between the two. Here's a clip from Back to the Future II that imagines Trump in Biff's position:", "Fritze, John.   \"White House Corrects Transcript to Reflect President Trump's Insult.\"\r\n    USA Today.   2 October 2018.", "Zaru, Deena.   \"Paper: Trump Is Biff from 'Back to the Future'.\"\r\n    CNN.   16 August 2017.", "Collins, Ben.   \"'Back to the Future' Writer: Biff Tannen Is Based on Donald Trump.\"\r\n    The Daily Beast.   21 October 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]