["About this rating", "Cats are known to sit within the boundaries of a shape taped to the floor, according to an animal behavior expert. However, it is likely that online videos documenting this behavior exhibit representation and confirmation bias, in that videos that confirm the idea that cats sit in taped squares are more likely to be posted and shared than videos showing otherwise.", "A cat will not always sit within the boundaries of a shape taped to the square, nor will it spend a lengthy amount of time within its confines.", "Cats took over the internet yet again in fall 2020 when a number of social media posters shared their furry, feline friends sitting within the confines of a square taped to the floor.", "It’s not the first time the “cat in a taped square” has infatuated internet cat lovers. The trend first went viral in the mid-2000s when cat lovers noticed that making a square on the floor with tape created a welcoming space for their cat “like a magnet drawn to its partner.” The phenomenon was rediscovered in April 2017 when cat lovers again shared the odd behavior on Twitter.", "This claim is partly true, though there are some caveats to note.", "Cats have been observed sitting within the boundaries of a square or circle shape that is taped to the floor, according to Monique Udell, an applied animal behaviorist and associate professor at the Oregon State University. But to be fair, cats don’t always sit within the boundaries of a square as many social media users pointed out. Rather, it’s likely that videos shared online of cats exhibiting this behavior are the result of representation or confirmation bias.", "“A quick look at the data on cat behavior towards the tape circle [or square] would suggest that this phenomenon may not be as robust as it might seem online,” explained Udell. “Certainly some cats do enter the circle some of the time, however online we might also be seeing representation and confirmation bias, where videos that confirm the idea that cats sit in taped squares are more likely to be posted and shared than a video where a cat may just walk away from the circle.”", "Many cats are known to investigate or rest in boxes or nooks and make nests when they are ready to give birth. But Udell said that linking this protective behavior to intentionally sitting in taped shapes on the floor is “a bit of a stretch.” Udell and her team recently conducted a study that involved placing a taped 1-meter circle on the floor and next to the cat’s owner, who sat in the middle. Though the research was in review at the time of writing, it was found that cats spent over 70% of the 2-minute testing period sitting within the circle next to their owner. But when a cat was left alone in the room, they spent just 6% of the two-minute period.", "The claim that a cat always sits in a square taped to the floor is inaccurate. Confirmation bias aside, it could be that a cat is simply trying to be closer to its owner — or the action is simply a coincidence.", "“Another way to look at it is: How many circles and squares can you see right now in your environment (patterns on flooring, items left on the floor, or a welcome mat) that your cat is not sitting on — this might be a clue that something deeper is going on, either with cat behavior, with human psychology, or both,” said Udell.", "In the wild, felines must distinguish places to hide for their survival. But an inability to distinguish between actual hiding spaces and a simple shape on the ground would be detrimental to their ability to hide from predators or hunt prey. Though science may not have a definitive answer about a cat’s inclination to sit in a taped box, Udell added that this sort of exploration helps to guide scientific discovery, particularly as it relates to humanity’s furry felines.", "“However, the fact that people are curious about why cats do this behavior is promising, because the truth is we cannot know for sure why cats behave the way we do unless we ask these questions and support science that aims to find the answers,” said Udell. “There is a lot that we can learn about cat behavior, and the more we come to understand our feline friends the better we can meet their welfare needs and improve our interactions with them.\"", "Bender, Kelli.   \"The Internet Discovers Surprisingly Easy Way to Get Your Cat to Sit Exactly Where you Want.\"\r\n    People.   13 April 2017.", "Dodman, Nicholas.   \"Why Cats Love to Sit on Squares.\"\r\n    The Conversation.   19 April 2017.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]