["About this rating", "Sinclair Lewis (1885-1951), the American novelist hailed for such 20th-century classics as Main Street, Elmer Gantry, Dodsworth, and Babbit, also literally wrote the book on the fascist takeover of America, it turns out.", "The premise of It Can't Happen Here, published at a time (1935) when authoritarian regimes were flexing their muscles all across Europe and Americans had great difficulty imagining a Hitler or Mussolini coming to power in the land of the free, was that it can happen here. Lewis painted a vivid counterfactual portrait of a United States of America sliding into dictatorship, one that is still cited as a cautionary tale to this day:", "The main character, Buzz Windrip, appeals to voters with a mix of crass language and nativist ideology. Once elected, he solidifies his power by energizing his base against immigrants, people on welfare, and the liberal press. The novel has been called “frighteningly contemporary” in the wake of the Trump campaign and election.", "As Time magazine noted on 16 November 2016, It Can't Happen Here was completely sold out on Amazon.com and Books-A-Million within a week of the 2016 U.S. presidential election. The election's aftermath also saw the recirculation of a famous quote attributed to Sinclair Lewis, a line often said to have come directly from the novel: \"When fascism comes to America it will be wrapped in the flag and carrying a cross.\"", "Although that statement sounds like a sentiment Lewis would have agreed with, there's no record of his actually writing or saying it, according to the web site of the Sinclair Lewis Society:", "Here's our most asked question:", "Q: Did Sinclair Lewis say, \"When Fascism comes to America, it will be wrapped in the flag and carrying a cross\"?", "A: This quote sounds like something Sinclair Lewis might have said or written, but we've never been able to find this exact quote. Here are passages from two novels Lewis wrote that are similar to the quote attributed to him.", "From It Can't Happen Here: \"But he saw too that in America the struggle was befogged by the fact that the worst Fascists were they who disowned the word 'Fascism' and preached enslavement to Capitalism under the style of Constitutional and Traditional Native American Liberty.\"", "From Gideon Planish: \"I just wish people wouldn't quote Lincoln or the Bible, or hang out the flag or the cross, to cover up something that belongs more to the bank-book and the three golden balls.\"", "There was also a play called Strangers in the late 1970s which had a similar quote, but no one, including one of Lewis’s biographers, Richard Lingeman, has ever been able to locate the original citation.", "The same quote has been erroneously attributed to Louisiana governor and U.S. senator Huey Long (1893-1935), who, ironically, was said by some to be a real-life model for Lewis's fascist leader in It Can't Happen Here. A similar quote (probably spurious as well) that came to be attributed to Huey Long after his death was, \"When fascism comes to America, it will be called anti-fascism.\"", "Though we have found passages by other authors that share certain words, phrases, and sentiments in common with the quote attributed to Lewis, we have not found an exact match anywhere. We came across this bit, for example, in coverage of a speech by one James Waterman Wise Jr. in the 5 February 1936 edition of The Christian Century:", "James Waterman Wise, Jr., in a recent address here before the liberal John Reed club said that Hearst and Coughlin are the two chief exponents of fascism in America. If fascism comes, he added, it will not be identified with any \"shirt\" movement, nor with an \"insignia,\" but it will probably be \"wrapped up in the American flag and heralded as a plea for liberty and preservation of the constitution.\"", "And this observation appeared in John Thomas Flynn's As We Go Marching, published in 1944:", "But when fascism comes it will not be in the form of an anti-American movement or pro-Hitler bund, practicing disloyalty. Nor will it come in the form of a crusade against war. It will appear rather in the luminous robes of flaming patriotism; it will take some genuinely indigenous shape and color, and it will spread only because its leaders, who are not yet visible, will know how to locate the great springs of public opinion and desire and the streams of thought that flow from them and will know how to attract to their banners leaders who can command the support of the controlling minorities in American public life. The danger lies not so much in the would-be Fuhrers who may arise, but in the presence in our midst of certainly deeply running currents of hope and appetite and opinion. The war upon fascism must be begun there.", "Close, Kerry.   \"Sinclair Lewis Novel 'It Can't Happen Here' Sells Out Online.\"\r\n   Time.   16 November 2016.", "Flynn, John Thomas.   As We Go Marching.\r\n   Auburn, AL:   Ludwig Von Mises Institute, 1944.    ISBN 9781610164979.", "Lewis, Sinclair.   It Can't Happen Here.\r\n   New York: Doubleday, 1935.", "Harris, Malcom.   \"It Really Can Happen Here: The Novel That Foreshadowed Donald Trump's Authoritarian Appeal.\r\n   Salon.   29 September 2015.", "The Christian Century, Volume 53.   \"Speakers Draw Dark Picture of Future.\"\r\n   Chicago: Christian Century Company, 1936", "The Sinclair Lewis Society.   \"Here's Our Most Asked Question.\"\r\n   2012.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]