["“YPG forces destroyed 4 Turkish Humvees and two tanks, including an M1 Abrams tank,” claims a video published on YouTube in English in 2018. The video has resurfaced in the aftermath of Turkey’s invasion of northern Syria in early October 2019, including via this tweet in French.", "At the time of the 2018 YouTube video’s publication, Turkey had launched an air and ground offensive named Operation Olive Branch, against the Kurdish militia known as the People’s Protection Unit (YPG).", "On October 9, Turkey launched a new ground offensive in Syria following US President Donald Trump’s announcement that US troops stationed in the country would leave.", "The thirty second video shows blurry images of sustained fire followed by a series of spectacular explosions.", "However, one detail - noticeable after increasing the video’s brightness - seems to show that this is not a video shot on a battlefield. At the 20 second mark, several people on the right side of the image seem to be standing and watching, some of whom are filming the explosions with cellphones.", "Our colleagues from the Turkish fact-checking website Teyit, who verified the same video, mentioned in their article a similar video shot at a gun show in the southern US state of Kentucky.", "Keri Sumner, manager for the Knob Creek Gun Range, an open air shooting range near West Point, Kentucky, told AFP in an email that the video indeed shows an event organized on their premises twice a year, although she was not able to specify when exactly.", "“It’s definitely our night shoot we have during our machine gun shoot and military show. The cars set up down range, the timing starts and the explosive charges we have set up once someone hits the barrels of gasoline giving the large fireballs,” Sumner, who is the daughter of the range owner and social media manager for the company, said.", "In order to illustrate her explanation, Sumner sent AFP the image below, a screenshot of the video complete with descriptions of the different elements. Spectators behind a fence on the right, a tent for the machine gun shooters in the background, and a single shooter on the left, facing away from the camera.", "An AFP photograph of this event from an April 2019, available here, gives a clearer view of the usual set up for the event, showing two tents and spectators filming with their phones.", "The video claiming to show an exchange of fire in Afrin was originally posted on April 9, 2017 by a US Facebook page dedicated to firearms. The publication’s author clearly identifies the images as a video of the Knob Creek Gun Range gun show.", "The same scene was filmed from another angle and published on Twitter in April 2017.", "Had a great time Knob creek Machine gun shoot pic.twitter.com/jQXt4pQH8V", "The event, complete with a firearms fair, was founded in 1965. It is now one of the world’s largest private gun range.", "Here is an October 11 AFP report on the conflict in Syria. At least 100,000 civilians have been forced to flee according to the United Nations.", "This article was translated from French by Louis Baudoin-Laarman.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]