["A 45-second video shows a platoon huddled in a pit exposed to smoke. In the background, a man can be heard instructing the soldiers in Hindi to stand their ground. This video has gone viral with the claim that the Indian army conducted a chemical attack drill.", "Twitter user @evazhengll tweeted the viral video and wrote, “Indian army conducts chemical attack drill – no protective equipment, no decontamination measures, inhuman! Are these soldiers the lower caste members in India?” As per their Twitter bio, the user is from China and a Fudan University alum. This video has been viewed over 39,000 (archived link). Multiple users shared the viral video with identical text on Twitter.", "Indian army conducts chemical attack drill – no protective equipment, no decontamination measures, inhuman! Are these soldiers the lower caste members in India? 阿三的防化学武器攻击训练，毫无人性的对待低种姓士兵 pic.twitter.com/uZ4wWZoIy9", "— Eva Zheng 郑怡斌 عائشة (@evazhengll) June 30, 2020", "Another Twitter account @CNPakWW quote-tweeted @evazhengll’s tweet and wrote, “This is now Nepali Gorkha soldiers are treated by the Indian Army. They are known as the bravest warriors but they are treated as lower caste soldiers. This is a chemical attack drill without any protective equipment. It can cause permanent damage” (archived link). This tweet was quote-tweeted by a Nepali Twitter user @Irmaknepal who wrote, “Shame on terrorist Indian Army. Don’t worry, we’ll retaliate soon [nepal flag emoji] (archived link).", "This slideshow requires JavaScript.", "Two Facebook users also posted the viral video along with the claim made by @CNPakWW.", "As per our research, the viral video was posted by a verified Weibo account on June 28. In the course of this fact-check, we will look at the following:", "Alt News performed a reverse image search on multiple keyframes of the viral video but could not find any relevant results.", "Analysis of the viral video", "We observed that the word “commando” was written behind the t-shirts of one of the men.", "Readers should note that both tweets by @evazhengll and @CNPakWW have addressed the viral video as a chemical attack drill. Looking at the video, the smoke appears to be tear gas. Using these two points as a clue, Alt News performed a keyword search on YouTube and found three similar videos. As per the description, the videos show tear gas drills by National Security Guard (NSG), a counter-terrorism unit under the Ministry of Home Affairs.", "Alt News reached out to NSG officers via sources in the Indian Army. According to one of the officers, the viral video shows training for “resistance to tear gas during civic action.”", "Viral video was shared by a verified Weibo account", "We analysed the Weibo logo on the top right corner of the viral video and noticed Chinese text below the logo.", "A keyword search ‘灬黑礼服灬’ (translates to ‘black dress’ in English) revealed that the account belongs to a verified user on Weibo. This account has posted several videos related to the military.", "Alt News rummaged the user’s timeline and found that they had posted the same video on June 28. This video is 15 seconds longer than the viral video. It was posted with the Chinese text, “#China-IndiaBorderConflict# The Daily of the Indian Army: Training Smokescreen Adaptation Without anti-virus equipment, you can only improve your adaptability. Indian soldiers are powerful! (Translated via Google from #中印边境冲突# 印军的日常：训练烟幕弹适应 没有防毒装备，只能提高适应力了，印度兵厉害啊.)", "The claim that the video represents a ‘chemical attack’ drill performed by Indian soldiers without any protective gear was found to be baseless.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]