["The images were published here on Weibo on November 12, 2020. The post has been shared almost 600 times.", "The post’s simplified Chinese caption translates to English as: “Goodnight, the Earth. / Aerial night view captured by NASA.”", "The images were also published alongside similar claims in 2020 on Weibo here, here and here and on Facebook here, here and here; and in 2015 on Facebook here, on Weibo here and on Twitter here.", "However, the claim is false.", "A combined reverse image and keyword search found the same images published on the Shutterstock page of Anton Balaz, a Russia-based artist. They can be seen here, here, here, here, here, here, here, here and here.", "Below are three sets of comparisons between the misleading Weibo images (L) and the Shutterstock images Anton Balazh (R):", "The description on all the images reads: “Elements of this image furnished by NASA”.", "In response to the misleading posts, Balaz told AFP that the images are “3D renderings”.", "In an Instagram Direct Message on November 22, 2020, Balaz wrote: “All of these images were created in 3D modeling software based on textures provided by NASA for free use. The description of each image, as requested by Shutterstock, states that it is a 3D rendering.”", "Similar misleading claims were also debunked by Weibo here and the Chinese state media fjsen.com’s fact-checking team here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]