["The post, published here February 7, 2019 and shared nearly 2,000 times, shows two photos: one is labeled “MANILA” and has rundown buildings, while the other says “DAVAO” and shows skyscrapers.", "Below is a screenshot of the photos:", "The post's caption, when translated into English, says: “To those arrogant people from Manila whichever way you look at it you still have no match for Davao City. Davao City is still richer than Manila”.", "Manila is the capital of the Philippines and in the nation’s north, while Davao city is located in the south and is the hometown of Philippine President Rodrigo Duterte.", "A reverse image search traced the photo labelled “MANILA” back to an account on Flickr, an online photo-sharing platform.", "Here is a screenshot of the photo, which was taken February 22, 2008:", "The caption on Flickr says the picture shows Dharavi, a slum in Mumbai.", "The original photo and the misleading image contain the same key details: a blue steel bridge with clothes draped on it, a low wall in the foreground and a person in a white shirt crossing the bridge.", "A reverse image search traced the photo labelled “DAVAO” back to a post on a real estate site called HOPPLER magazine.", "Below is a screenshot of the September 2, 2015 post:", "The title of the article is: “9 Reasons Why You Should Move to BGC”. BGC refers to Bonifacio Global City, an area that is close to the Philippine capital Manila.", "The same part of Bonifacio Global City can be seen on Google Earth.", "The misleading photo and the Google Earth image contain these same key features:", "1 - a building with the name “Sun Life”", "2 -  Twin buildings with blue facades", "3 - A building with slanted lines", "Here is the Google Earth image:", "Here is the misleading image:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]