["About this rating", "The Onion may be the most well known source of satire in the United States, but its content still manages to fool readers on occasion, especially when they encounter it removed from its original context.  That phenomenon occurred yet again on 18 August 2018, when the Facebook page \"Black Twitter\" posted a video purportedly showing a news report about a judge in Detroit who ruled that a white female teenager accused of murder should stand trial as an African-American man instead:", "This video was not a genuine news report, but rather a spoof of issues involving race and crime that was produced for the for the Onion News Network's satirical news show \"The FactZone with Brooke Alvarez.\"  This particular segment appeared in the show's debut episode, which aired on 21 June 2011 on the  IFC channel.", "The original video from The Onion's website can be viewed below:", "It doesn't appear that the \"Black Twitter\" Facebook page shared this video with the intent of fooling followers, as the following response was posted after some viewers mistook the video for a genuine news report:", "Just going to put here, since I didn't know there would be this many people thinking it's real/or that it's racist. It's a fake news satire video, that's making fun of the court/judicial system, and how racist America is and how it treats Black people vs how kindly and fairly it treats white people, and white people know this, not wanting to be treated how black people are treated in the system/want to keep white privilege the way it is. the video is not real, it's satire.", "Extra note: No, it's not a \"Prank\" or a \"Joke\" someone played on the white girl, everyone is in on the skit. Again, you have to look up Satire.", "A contemporaneous report from TIME magazine provides some additional context about the satirical show that featured this clip:", "When you first lay eyes on cable-news anchor Brooke Alvarez, you may suspect you've seen her somewhere before. Brisk, blond and vulpine, she's the picture of a dozen beautiful and terrifying news readers familiar from Fox News and elsewhere. Alvarez tears into her teleprompter copy like an eagle skeletonizing its kill; as techno-martial music plays and graphics swarm about her, she declares, \"You've just been cleared to enter ... the FactZone!\"", "The anchor of the fictional newscast FactZone with Brooke Alvarez on the IFC Channel's Onion News Network is played by Suzanne Sena, who so effectively nails the mannerisms of a cable-news anchor because she was one, for Fox. The casting choice is a brilliant meta-joke: the philosophy behind this TV spin-off from the Peabody Award-winning satirists at the Onion is that 24-hour news is itself a kind of performance. Which makes it a rich subject and — even more so than the newspapers that the Onion has long spoofed — a tough one. It didn't take a comedy writer, after all, to give us cable-news shows hosted by a former governor disgraced in a sex scandal and by a doomsday prophet given to on-air weeping. Is it possible to make cable news funnier than it already is?", "The Onion News Network.   \"Judge Rules White Girl Will Be Tried as Black Adult.\"\r\n    22 January 2011.", "Poniewozik, James.   \"The Onion's New Fake News Show.\"\r\n    TIME.   20 January 2011.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]