["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Since as early as October 2019, Snopes readers have inquired about headlines and social media posts that claim burning sage \"kills 94% of bacteria.\" In 2020, the question took on new significance for some readers as the United States grappled with a surge of reported cases of the COVID-19 coronavirus disease.", "Though burning some plants has been scientifically shown to eliminate airborne bacterium, there is inconclusive evidence to suggest that burning sage – or “smudging” – is capable of purifying the air in confined spaces.", "The \"94%\" claim is based on a 2007 study published in the Journal of Ethnopharmacology in which researchers analyzed the ability of “medicinal smoke” to cleanse a room of certain airborne bacteria. Reports have since circulated the internet, incorrectly lumping sage into a long ingredient list that included dried roots and leaves tested as part of the experiment.", "“This is highly controversial since breathing in smoke has known harms, yet the antibacterial benefits are uncertain,” Dean of Yale School of Public Health Dr. Sten Vermund told Snopes. Vermund added that there is no evidence that burning sage kills either bacteria or viruses like SARS-CoV-2, the coronavirus responsible for the severe respiratory disease COVID-19.", "As part of the 2007 study, researchers from the National Botanical Research Institute in India burned medicinal smoke from havan samagri within a confined space to determine whether certain herbs contained antimicrobial properties. Havan samagri is a “mixture of odoriferous and medicinal herbs” that contains dozens of various types of wood, herbs, fruit and seeds used in Vedic Hindu tradition. However, sage was not included in the study’s ingredient list. One hour of burning havan samagri was shown to kill more than 94% of airborne bacteria – and the effects were not short-lived. The evidence further suggested that medicinal smoke had the ability to “purify” or “disinfect” the air for up to 24 hours in a closed room. Even after a month, the researchers found that certain pathogenic bacteria were still absent from the room, such as those that cause respiratory and gastrointestinal infections.", "Though it appears havan samagri may have some antimicrobial properties when burned, the findings do not suggest its use has any impact on viruses like SARS-CoV-2. This is, in part, due to the biological differences between bacteria and viruses. The Mayo Clinic notes that bacteria are capable of thriving in “many different types of environments” whereas viruses require living hosts to multiply.", "The way that COVID-19 spreads and how long it is present in the air also plays a role. The virus is known to transmit via respiratory droplets produced when an infected person coughs, sneezes, or talks and land in the mouth or nose of someone nearby.", "Evidence also suggests that the virus spreads when an individual touches a contaminated surface and then touches their mouth, eyes, or nose, though recently published guidelines from the Centers for Disease Control and Prevention (CDC) caution that “this is not thought to be the main way the virus spreads.” It is not known how long SARS-CoV-2 may persist on surfaces and research from the U.S. National Institutes of Health suggests the virus may last at least several hours and up to three days on certain surfaces. Different surfaces and different conditions – such as humidity, temperature, sunlight, and air movements – may see different results. Higher humidity, higher temperature, more airflow, and more sunlight or UV light are less-than-ideal conditions for SARS-CoV-2.", "“This is subject of uncertainty and will differ for indoor and outdoor spaces. Certain ‘super-spreader’ events have suggested that individuals in the wrong place (i.e. poorly ventilated indoor spaces) at the wrong time may mean considerable risk. But as a rule of thumb, aerosols can disperse across an indoor space,” explained Vermund.", "The CDC recommends using a combination of soap, water, and surface disinfectants identified by the U.S. Environmental Protection Agency to sanitize spaces for the COVID-19 virus. Vermund added that heating, ventilation, and air conditioning (HVAC) system operations can also be adjusted or increased to spur great air circulation.", "“In the absence of an HVAC system in a building, strategic and well-planned outward-facing fans can be placed in windows to create a negative pressure area (as one sees in some kitchens and attics) that can decrease levels of virus in the air,” said Vermund. “Of course, mask use, physical distancing, hand/face/surface hygiene, outdoor activities, small crowds, and testing and contact tracing are all vital.”", "Though sage is not known to eliminate airborne bacteria or viruses, the herb has been shown to contain antiseptic properties that are beneficial to human health. Previous research has found that sage mouthwash effectively reduced the number of mouth bacteria and may work as an effective treatment for certain mental health conditions, diabetes, and cancer. Further studies have shown that sage includes anti-inflammatory and antioxidant effects, among other health benefits.", "Smudging is an ancient ritual that holds both cultural and practical significance whereby a person burns certain plants in an effort to cleanse space. In early Indian writing dating between the 6th and 8th centuries BCE, it was believed that fumigating an operating room by burning mustard, butter, and salt was an early form of “antisepsis,\" yet it was also practiced to keep evil spirits away, according to a 2018 study published in the Indian Journal of Otology. Similarly, a 2020 study published in the journal Tel Aviv described the chemical residue of marijuana and frankincense discovered at a 2,000-year-old limestone altar in modern Israel. It was thought that both were burned as a way to administer their therapeutic benefits when ceremonial participants inhaled smoke.", "Shekhar Nautiyal, Chandra, Singh Chauhan, Puneet, Laxman Nene, Yeshwant.   “Medicinal smoke reduces airborne bacteria”\r\n    Journal of Ethnopharmacology.   Dec. 2007.", "KX News.   \"Burning Sage Kills 94% of Airborne Bacteria, Research Shows.\"\r\n    KRON4.   16 Dec 2019.", "Rouy-Beheshti, Maryam, et al.   \"The Antibacterial Effect of Sage Extract (Salvia Officinalis) Mouthwash Against Streptococcus Mutans in Dental Plaque: A Randomized Clinical Trial.\"\r\n    Iranian Journal of Microbiology.   June 2015.", "Hamidpour, Mohsen.   \"Chemistry, Pharmacology, and Medicinal Property of Sage (Salvia) to Prevent and Cure Illnesses such as Obesity, Diabetes, Depression, Dementia, Lupus, Autism, Heart Disease, and Cancer.\"\r\n    Journal of Traditional and Complementary Medicine.   April-June 2014.", "Ghorbani, Ahmad and Mahdi Esmaeilizadeh.   \"Pharmacological Properties of Salvia Officinalis and Its Components.\"\r\n    Journal of Traditional and Complementary Medicine.   Oct. 2017.", "Samanth, TU, et al.   \"Effect of Smoke from Medicinal Herbs on the Nosocomial Infections in ENT Outpatient Department.\"\r\n    Indian Journal of Ontology.   24 May 2018.", "Arie, Eran, Rosen, Baruch, Namdar, Dvory.   \"Cannabis and Frankincense at the Judahite Shrine of Arad.\"\r\n    Tel Aviv.   28 May 2020.", "Collins, Nancy.   \"Science Says Burning Sage Can Clear The Air And Improve Your Health.\"\r\n    Lifehack.   Accessed 17 July 2020.", "Steckelberg, James.   \"Bacterial vs. Viral Infections: How Do They Differ?.\"\r\n    Mayo Clinic.   September 2017.", "\"Coronavirus Disease 2019 (COVID-19) How It Spreads.\"\r\n    CDC.   16 June 2020.", "NIH Research Matters. \"Study Suggests New Coronavirus May Remain on Surfaces for Days.\"\r\n      24 March 2020.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]