["By Angelo Fichera", "Posted on November 13, 2018", "Q: Was Susan Orfanos, the mother of a shooting victim in Thousand Oaks, California, also interviewed by news outlets after other mass shootings in 2016 and 2017?", "A: No. A Facebook post misidentifies two other women as Orfanos.", "Following the Nov. 7 shooting in a bar in Thousand Oaks, California, that left 13 people dead, the mother of one of the victims made a tearful, forceful plea for gun control in front of cameras.", "“I don’t want prayers. I don’t want thoughts. I want gun control,” Susan Orfanos said. “And I hope to God nobody else sends me any more prayers. I want gun control. No more guns.”", "Orfanos’ son, U.S. Navy veteran Telemachus “Tel” Orfanos, had previously survived the mass October 2017 Las Vegas shooting before being killed in the Borderline Bar & Grill.", "Now, conspiracy theorists have used images of the mother alongside photos of women affected by other mass shootings to advance the idea that she is an actor, and that they are all the same person. The fact-free assertion is not unlike claims we debunked about the students who survived the Parkland, Florida, high school shooting.", "A Facebook user, who appears to subscribe to the massive “QAnon” conspiracy theory, spread the unsubstantiated claim about Orfanos by posting a screenshot of her interview with screenshots of a mother and of a victim from other mass shootings. He wrote: “JUST SO YOU KNOW NOT ONLY WAS SHE A MOM OF THE CALIFORNIA AND ORLANDO SHOOTINGS, BUT SHE WAS A VITCIM (sic) OF THE Las Vegas SHOOTING TOO!! 😂😂😂”", "The other images are not of Orfanos, nor do they resemble her — something that didn’t stop thousands from sharing and liking versions of the conspiracy theory through memes and posts on Twitter, Instagram and YouTube.", "The woman wearing a pink shirt in the Facebook post is actually Christine Leinonen, whose son, Christopher “Drew” Leinonen, died in the 2016 Orlando, Florida, shooting in the Pulse nightclub. The image of Leinonen is taken from an ABC News interview with George Stephanopoulos before she learned that her son had been killed.", "Leinonen has since helped form the Dru Project, an LGBTQ+ advocacy organization, and spoke in favor of gun control at the 2016 Democratic National Convention.", "Another woman falsely identified as being Orfanos is Jan Lambourne, who was shot in the abdomen during the 2017 Las Vegas shooting and survived. The image in the Facebook post is a screenshot from a CBC News interview she gave while recovering in the hospital. Lambourne, of the Manitoba province of Canada, can be seen in more recent photographs in a report documenting her recovery.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Bernhardt, Darren. “Wounded Manitoban hid under wheelbarrow to survive Las Vegas massacre.” CBC News. 3 Oct 2017.", "Keneally, Meghan and Doug Lantz. “Mother of Orlando Shooting Victim Searching for Answers.” ABC News. 13 Jun 2016.", "Law, Tara. “Navy Veteran Survived Las Vegas Shooting Only to Be Killed in the Borderline Bar 1 Year Later.” 9 Nov 2018.", "Stanley-Becker, Isaac. “Thousand Oaks parents: ‘I don’t want prayers. I don’t want thoughts. I want gun control.’” The Washington Post. 9 Nov 2018.", "Stewart, Briar. “‘I still need to heal’: 1 year after the Vegas massacre, a Canadian survivor struggles.” CBC News. 20 Sep 2018.", "“Team.” The Dru Project. Accessed 13 Nov 2018.", "Villa, Lissandra. “Read the Emotional Speech From an Orlando Victim’s Mother.” Time. 28 Jul 2016.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]