["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "If you inhabit the more liberal corners of social media, you may have seen a list of 10 Republican bills in your feed -- a reminder of the substantive changes that could result from unified GOP control of Washington.", "Here’s the text of a common version that’s circulating:", "OK - It's important to pay attention to the Russian spy drama, but let's not ignore the fact that the following bills HAVE been introduced:", "1. HR 861 Terminate the Environmental Protection Agency", "2. HR 610 Vouchers for Public Education", "3. HR 899 Terminate the Department of Education", "4. HJR 69 Repeal Rule Protecting Wildlife", "5. HR 370 Repeal Affordable Care Act", "6. HR 354 Defund Planned Parenthood", "7. HR 785 National Right to Work (this one ends unions)", "8. HR 83 Mobilizing Against Sanctuary Cities Bill", "9. HR 147 Criminalizing Abortion (\"Prenatal Nondiscrimination Act\")", "10. HR 808 Sanctions against Iran", "Please copy/paste and share widely. Call your House Representative and ask them to not only vote \"NO\"...but to speak up for our rights, health & safety, and our beautiful country.", "How accurate is the post? All 10 bills cited do exist, and most (though not all) have been accurately described.", "But a majority of the bills mentioned haven’t advanced very far or attracted more than a few co-sponsors, so many are relative longshots for actually becoming law.", "How accurate are the descriptions?", "Most of the bills listed are described by their official title, or by a truncated version of the official title. So those strike us as being accurate.", "But for a few bills, the description is overly broad or misleading.", "One of those -- H.J.R. 69 -- is described as \"Repeal Rule Protecting Wildlife.\" That’s on the right track, but whoever reads this wouldn’t know that it’s specific to certain types of federal land in Alaska.", "The measure is an effort to overturn a federal rule using the Congressional Review Act, which allows Congress to repeal executive branch regulations under certain circumstances. The measure in question would overrule an Obama administration rule governing non-subsistence taking of wildlife on National Wildlife Refuge land in Alaska.", "As it happens, this is the only one of the 10 measures that has passed the House already. It passed by a mostly party-line, 225-193 margin on Feb. 16, 2017. It is now awaiting action in the Senate.", "Another bill with a somewhat exaggerated description is H.R. 785, which is listed as \"National Right to Work (this one ends unions).\"", "Right-to-work laws say workers can’t be forced to join a union. They do this by making it harder to form a union, and it’s true that on average, states that have right-to-work laws have significantly lower unionization rates than states that don’t. But it’s an exaggeration to say that it \"ends\" unions.", "In fact six of the states that have right to work laws have between 10 and 16 percent of their workforces unionized -- Indiana, Iowa, Kentucky, Michigan, Nevada, and West Virginia. And the remainder of right-to-work states do have unions -- they’re just less common than in the states that don’t have a right-to-work law.", "The third and last of the exaggerated descriptions refers to H.R. 147, which is listed as \"Criminalizing Abortion (‘Prenatal Nondiscrimination Act’).\"", "This bill would criminalize one particular kind of abortion -- one sought \"based on the sex, gender, color or race of the child, or the race of a parent.\" That’s not to say it’s not controversial -- it is. Referring to last year’s version of the bill, then-Rep. Loretta Sanchez, D-Calif., called the measure \"an affront to all minority women, especially Latinas and immigrant women, who already face disproportionate barriers to access health care and health education.\"", "But contrary to the most obvious reading of the social media post, this bill would not criminalize abortion across the board.", "How much support do these bills have?", "A few are likely to go far. For the rest, probably not. Let’s start with the bills where eventual passage seems quite plausible.", "As we noted, the Alaska wildlife measure has already passed the House and must now be taken up by the Senate.", "Two other bills listed are unlikely to move in the version listed, but the ideas contained within them are likely to be taken up by the GOP leadership on a high-priority basis.", "One is H.R. 370, which would repeal the Affordable Care Act. H.R. 370 itself doesn’t have a single co-sponsor, but repealing Obama’s health care law is a high priority for House Republicans. An actual repeal-and-replace bill was released on March 6, and that is the likelier vehicle to be considered by the chamber.", "The other measure that’s likely to advance, but not in the version listed in the post, is H.R. 354, which would stop federal funding for abortion providers such as Planned Parenthood. Federal funding for abortions is already banned, but opponents of abortion say that federal funding should be stopped for non-abortion services provided by clinics that offer abortions.", "The draft of the Obamacare repeal bill unveiled on March 6 would stop funding for such organizations.", "Of the other seven bills, none has advanced beyond introduction, and all but one have a minimal number of co-sponsors, all of them Republicans. Here’s the rundown, as of March 7, 2017:", "• H.R. 861 -- \"Terminate the Environmental Protection Agency\" -- one sponsor, three co-sponsors.", "• H.R. 610 -- \"Vouchers for Public Education\" -- one sponsor, three co-sponsors.", "• H.R. 899 -- \"Terminate the Department of Education\" -- one sponsor, eight co-sponsors.", "• H.R. 785 -- \"National Right to Work (this one ends unions) -- one sponsor, 15 co-sponsors.", "• H.R. 83 -- \"Mobilizing Against Sanctuary Cities Bill\" -- one sponsor, nine co-sponsors.", "• H.R. 147 -- \"Criminalizing Abortion (‘Prenatal Nondiscrimination Act’)\" -- one sponsor, 59 co-sponsors.", "• H.R. 808 -- \"Sanctions against Iran\" -- one sponsor, four co-sponsors.", "So just one of these bills have attracted co-sponsorship of more than 15 out of the 435 House members. The one that did, on prenatal sex selection, has been introduced for several congresses running and has only moved beyond introduction once. That was in 2012, when the House leadership put it up under so-called suspension of the rules. That means that a bill is fast-tracked to a vote, but to pass, it needs to win two-thirds support. The bill failed to meet the two-thirds threshold; on a mostly party-line vote, it secured 246 votes in favor and 168 votes against.", "For the rest, it’s conceivable that these can pass, especially in an environment -- as we have now -- with unified Republican control. Many of these bills address issues that President Donald Trump has advocated.", "That said, the House has only a limited amount of time, and co-sponsorship and committee consideration are key indications of what ranks high on the leadership’s agenda. On these metrics, the remaining seven bills fall short of being considered top-tier priorities.", "Rather, these bills may have more of an impact in keeping the GOP base happy.", "John Feehery, a former aide to then-House Speaker Dennis Hastert, said most of the bills on the list seem \"like click-bait for fundraising to me. I find it it hard (to believe) that they go anywhere.\" Feehery is now president of the bipartisan lobbying firm Quinn Gillespie Associates.", "Our ruling", "The social media post listed 10 bills that it said have been introduced in the House by Republicans.", "All 10 bills in the post have in fact been introduced. Seven were described accurately, while three had somewhat exaggerated descriptions. Meanwhile, one of the 10 bills has passed, and two seem to be on a fast track, while the other seven are more accurately considered longshots.", "So the post is largely correct, but it includes some exaggerated language, and it fails to distinguish between top-tier agenda items and priorities further back in the pack. We rate it Mostly True.", "Social media post, received by PolitiFact on March 6, 2017", "Congress.gov, bill summary pages for H.R. 861, H.R. 610, H.R. 899, H.J.R. 69, H.R. 785. H.R. 147, H.R. 785, H.R. 83, H.R. 147, H.R. 808, accessed March 7, 2017", "House Obamacare replacement bill text, accessed March 7, 2017", "National Right to Work Foundation, \"Right to Work States,\" accessed March 7, 2017", "Bureau of Labor Statistics, \"Union affiliation of employed wage and salary workers by state,\" accessed March 7, 2017", "Juneau Empire, \"Senate passes ANWR drilling resolution, which faces final concurrence vote in the House,\" Feb. 23, 2017", "Huffington Post, \"Congresswomen Of Color Denounce ‘Racist’ Abortion Bill,\" April 14, 2016", "Email interview with John Feehery, president of Quinn-Gillespie Associates, March 7, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]