["By Eugene Kiely", "Posted on September 29, 2020", "Sen. Kamala Harris, the Democratic vice presidential nominee, urged her Twitter followers “to help post bail for those protesting on the ground in Minnesota.” That appeal is now being used in an attack ad to portray her as helping to free an accused child rapist.", "The ad is the work of Preserve America PAC, a super PAC that has quickly spent more than $50 million since being formed on Aug. 31. It says, “Biden’s pick for vice president helped raise money that got a man out of jail after he allegedly sexually penetrated a child, an 8-year-old girl.”", "But Harris, a former California state attorney general, asked the public to bail out protesters – not an alleged sex offender. She did so in a June 1 tweet.", "If you’re able to, chip in now to the @MNFreedomFund to help post bail for those protesting on the ground in Minnesota. https://t.co/t8LXowKIbw", "— Kamala Harris (@KamalaHarris) June 1, 2020", "The Minnesota Freedom Fund is a nonprofit that assists low-income people unable to pay cash bail or a commercial bail bondsman. Those accused of a crime who can’t post bail must remain in custody before trials or hearings.", "“It doesn’t matter whether you are guilty or innocent — if you cannot afford to post your bail, you will stay in jail until your trial,” the group says, adding that the system “criminalizes poverty” and disproportionately affects Blacks and other minority groups. The cash bail amount is returned once the accused appears for the trial.", "The Biden/Harris campaign proposes to end cash bail, which it says “incarcerates people who are presumed innocent” and “disproportionately harms low-income individuals.” Instead, it proposes instituting a pretrial system “that is fair and does not inject further discrimination or bias into the process.”", "The Minnesota Freedom Fund had raised a modest amount of money before the death of George Floyd — a Black man who died after a white police officer knelt on his neck during an arrest in Minneapolis on May 25. The group gained tax-exempt status in 2017, and raised about $53,000 that year and about $110,000 in 2018.", "Since Floyd’s death, the group has raised more than $30 million with the help of supporters such as Harris. But very little of that money was needed to bail out protesters — many of whom were issued citations, and were not detained. In a Sept. 4 post, the group said it had “paid $3,475,000 for county bails,” but only $210,000 of that was used for protest-related bails.", "One of those helped by the fund was Timothy Wayne Columbus, who is the accused child rapist referenced in the ad. The conservative Daily Caller, which is cited in the ad, reported on Sept. 16 that the alleged rape occurred in 2015, and the Minnesota Freedom Fund paid $75,000 on July 1 to secure Columbus’ release from a Minneapolis jail pending trial.", "According to state court records, Judge Tamara Garcia granted Columbus conditional release on $75,000 cash bail on July 1. The next day, according to the Daily Caller story, he filed a request to return bail to a third party – the Minnesota Freedom Fund.", "The ad makes an emotional appeal to voters based on only part of the story.", "It doesn’t explain that Harris was seeking to raise money for protesters, not an accused sex offender, and it ignores that any decision to grant or deny bail is made by a judge. It also implies that anyone accused of a crime should remain behind bars pending trial, when, in fact, anyone who can post bail, if a judge grants it, would be released.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]