["About this rating", "Leaflets were created and distributed in the city of Munich in 2013 to reinforce cultural standards in mixed bathing areas such as pools after a number of complaints were registered by German swimmers.", "The country of Germany did not create the leaflets; the leaflets were not distributed in response to an incident in Cologne in 2015-2016; the leaflets were not created after a wave of Syrian immigrants came to Europe in 2015; the complaints were not entirely or primarily related to sexual assault or misconduct.", "As Germany rang in the New Year in 2016, a number of assaults were reported in Cologne and other cities. As many as 600 reports were lodged, and people quickly moved to blame recent refugees and migrants for what was framed as a novel spate of violence against women on that night.", "On 1 February 2016, Britain's Daily Mail published an article titled \"Germany hands out cartoon etiquette guides at swimming baths after dozens of women were groped by migrants,\" which held:", "In the wake of the sex assaults in Cologne on New Year's Eve and a wave of reported cases of sexual harassment in swimming baths, officials have now created a special cartoon guide on appropriate etiquette.", "The illustrations feature German captions with subtitles in English and Arabic and warn migrants not to wear underwear instead of swimming trunks, harass women, or push them in the water.", "The Daily Mail maintained that the leaflets were created in response to the events in Cologne in late 2015 or early 2016. That outlet was far from the only source for such claims; blogger Steven Crowder published a 27 January 2016 item titled \"Germany Takes Measures To Curb Islamic Rape… With Leaflets?\" That post similarly posited that the leaflets were Germany's official response to the purported widespread, refugee-centric sexual assaults on New Year's Eve:", "The last time there was a festival in Cologne, it was New Year’s Eve. Amongst the fireworks and yuletide feelings, a thousand women (who were asking for it apparently) were sexually assaulted by Muslim refugees. Hey, the festive spirit was moving them too, just in different ways. Some Western men and women share a kiss, maybe in Islam you just rape a little bit. It’s cultural, you racist, try to understand. Plus some of these women were “half naked” as in the men could see their faces. Burkas are making a ton more sense, aren’t they ladies?", "... Thanks to this nifty thing called the Internet, a lot of women have aired their grievances with not only their governments, but against Islamic men ... The solution to the migrant rape culture? You’re going to love this. A leaflet campaign teaching Muslim migrants to just say “No” to the rape. I’m as serious as herpes. Officials in Germany are handing out flyers explaining to the refugees how to properly behave themselves.", "The image's most visible appearance was in a 15 January 2015 item in the German version of The Local, titled \"Town bans male refugees from pools amid complaints.\"  A portion was included in this version that described the true origin and purpose of the leaflets.  The article explained that they were available in multiple languages for immigrants from a variety of backgrounds, and served a general purpose of providing information for individuals unfamiliar with public bathing protocols, including safety instructions:", "Meanwhile in Bavaria, swimming pools have issued leaflets with simple pictorial instructions on behaviour for migrants who may never have swum in public before.", "The leaflets are available in multiple languages, including Arabic, French, Pashto and Somali, and include safety and behaviour tips in a comic book style.", "As the more complete image above illustrated, two or three of 13 frames pertained to co-ed swimming comportment. The rest addressed water safety, appropriate attire, and common hygienic practices for individuals unfamiliar with public pools.", "The article continued, contextualizing the portion about co-ed bathing areas and dating the leaflets to 2013, well before recent, larger waves of people began seeking refuge in Europe:", "Particular emphasis is placed on stopping physical and verbal harassment of women, with images showing a red \"no\" symbol over an outstretched hand reaching for a woman in a bikini.", "A Munich city spokesman told DPA that officials conceived the leaflets in 2013 after increasing numbers of problems in the city's 18 public swimming pools.", "\"The ground rule of respect for women – whatever clothing they're wearing – is unfortunately not respected by all our swimmers. That's why there is an explicit indication about it,\" the spokesman said.", "As the article stated, the leaflets were created due to a number of unspecified \"problems,\" not specifically to curb sexual assaults. A larger picture suggested that the problems did not entirely (or even primarily) stem from behavior in public bathing areas, and the bulk of tips covered safety, sanitation, and clothing.", "While it's true that the leaflets were created and distributed in Munich following \"problems\" in public bathing areas, the leaflets came long before any events in Cologne on New Year's Eve in 2015 or 2016, as they were created in 2013. Additionally, the leaflets were produced in a variety of languages, and there was no evidence that their creation was prompted by any complaints about how immigrants or refugees behaved toward female swimmers.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]