["A visible proliferation of disinformation on social media post-Balakot airstrike attempts to portray that 292 terrorists were killed in the Indian Air Force retaliation. The circulation of false images has been relentless, despite the Defence Minister herself saying that there are “no numbers” to give out.", "Alt News discovered that previously debunked images have resurfaced on social media, including an extensive circulation on WhatsApp, to show devastation across the border. The claims are being espoused with the help of a manufactured WhatsApp chat, which was taken down (archive) by its creator after Alt News’s fact-check report.", "A Twitter user Shekhar Chahal shared a WhatsApp chat with an alleged Pakistani, who he claimed is a resident of Balakot. The ‘friend’ suggested that the Indian Air Force’s air strike killed 292 terrorists of JeM. Chahal is followed by prime minister Narendra Modi on Twitter.", "In the chat, Chahal’s ‘friend’ said that his mother is the dean of ‘Balakot Medical University’ and was responsible for examining the dead bodies of the slain terrorists.", "Alt News, however, discovered that there is no such institution called ‘Balakot Medical University’. In fact, the nearest medical college is situated at a distance of over 40 km from Balakot.", "Moreover, the chat was replete with erroneous Urdu, hinting at its falseness. For instance, ‘nazdiki’ was spelt was ‘najdiki’; ‘pareshan’ was written as ‘paresan’; ‘Alhamdulillah’ was spelt as ‘Allamuddiah’; ‘tashreef’ was written as ‘tasreef’.", "After Alt News’s fact-check, Chahal took down his tweet but clearly not before the damage was done.", "A set of images accompanying the manufactured WhatsApp chat shows dead bodies shrouded in white.", "All of these photographs pertain to the 2015 heatwave in Pakistan that killed thousands of people. Alt News discovered original images on Getty (1, 2, 3) and TIME via a simple Google reverse-image search.", "Another image doing rounds of social media shows mass graves.", "While Alt News was unable to discern its exact source, we found a 2016 article that carried the same photograph.", "Google reverse-image search also threw up a 2013 New York Times article carrying a similar image. The photograph was sourced to Associated Press, which described it as, “Pakistani men prepare the graves of Saturday’s bombing victims in Quetta, Pakistan, Sunday, Feb. 17, 2013.” This photograph seemed to be of the same location as the viral image but taken from a different angle.", "You can read a detailed report on all the above images here.", "The collage highlighted above showcases alleged before-after photographs of the site bombed in the Balakot airstrike. This is an attempt to portray that while the building on the ‘before’ image (left) stands tall, the same building in the ‘after’ image (right) now stands pulverised. The identical imagery was also used in a Zee News broadcast.", "We, however, found that these are old, unrelated images. The site shown by Zee News was not the bombed site, and was, in fact, situated 5 km away from the site that was bombed. Moreover, the satellite image viral on social media and used by Zee News was five years old. Alt New’s detailed fact-check can be accessed here.", "Circulating the same imagery, again and again, suggests an attempt to create a false perception in people’s minds. After India’s retaliation for the Pulwama terror attack, there has been a visible attempt to portray that the airstrike was able to take on nearly 300 terrorists. BJP President Amit Shah made similar claims despite the Indian Air Force and the government refusing to give a number.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]