["About this rating", "This is a sentence spoken by Trump, not a piece of modernist stream-of-consciousness pastiche. pic.twitter.com/vfhdKzg9Uy", "— Stig Abell (@StigAbell) August 9, 2016", "On 19 July 2016, Republican presidential candidate Donald Trump appeared at Sun City’s Magnolia Hall in South Carolina to deliver a noontime speech.  The event was an otherwise unremarkable campaign stop, save for one portion of Trump's speech (transcribed below) in which he apparently started out attempting to criticize the nuclear deal that the Obama administration negotiated with Iran but veered into a minute-and-a-half long sentence that spanned his uncle's academic qualifications, his own education, Democrats' denying Republicans' credentials, the power of nuclear technology, the number of American prisoners freed by Iran in conjunction with the nuclear deal, and the adeptness of \"Persian\" negotiators (particularly women), before circling back to how the Iranians \"killed us\" in the nuclear deal:", "\"Look, having nuclear — my uncle was a great professor and scientist and engineer, Dr. John Trump at MIT; good genes, very good genes, OK, very smart, the Wharton School of Finance, very good, very smart — you know, if you’re a conservative Republican, if I were a liberal, if, like, OK, if I ran as a liberal Democrat, they would say I'm one of the smartest people anywhere in the world — it’s true! — but when you're a conservative Republican they try — oh, do they do a number — that’s why I always start off: Went to Wharton, was a good student, went there, went there, did this, built a fortune — you know I have to give my like credentials all the time, because we’re a little disadvantaged — but you look at the nuclear deal, the thing that really bothers me — it would have been so easy, and it’s not as important as these lives are — nuclear is so powerful; my uncle explained that to me many, many years ago, the power and that was 35 years ago; he would explain the power of what's going to happen and he was right, who would have thought? — but when you look at what's going on with the four prisoners — now it used to be three, now it’s four — but when it was three and even now, I would have said it's all in the messenger; fellas, and it is fellas because, you know, they don't, they haven’t figured that the women are smarter right now than the men, so, you know, it’s gonna take them about another 150 years — but the Persians are great negotiators, the Iranians are great negotiators, so, and they, they just killed, they just killed us, this is horrible.\"", "The one thing that puzzles us the most about this sprawling statement is this: Donald Trump's late uncle, Dr. John Trump, was indeed a renowned professor at MIT, and among his many notable contributions to science were developing methods for treating cancer through radiation and studying how to radiate deep tumors without harming nearby healthy tissue.  But what did he reveal to his nephew about \"nuclear\" 35 years ago that it would have been surprising for anyone to think of?", "“My uncle used to tell me about nuclear before nuclear was nuclear\" and \"He would tell me, ‘There are things that are happening that could be potentially so bad for the world in terms of weaponry,'\" Donald Trump has claimed, even though the U.S. had already developed and used nuclear weapons before he was born (1946).  Could anyone have really been unaware or doubtful that \"nuclear is powerful\" in the 1980s, when Dr. Trump supposedly informed his nephew of that fact?", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]