["President Barack Obama and Vice President Joe Biden campaigned for their fellow Democrat Jon Corzine as he fought in 2009 for re-election as New Jersey’s governor.\n\nThey may now be regretting that choice.\n\nCorzine, the chairman and CEO of MF Global when it collapsed this fall, has been compelled to testify in front of several Congressional panels about the up to $1.2 billion in client money that disappeared during the firm’s bankruptcy. Using audio from Corzine’s testimony earlier this month and other video clips, the National Republican Congressional Committee released a web ad that ties Corzine, a former senator and governor of New Jersey, to the Obama administration.\n\nIn the ad posted to YouTube on Dec. 15,  Biden says of Corzine, \"he's the smartest guy that I know in terms of the economy and on finance, I really mean this.\" As Biden makes the comment, a headline in the corner of the video reads: \"MF Global Proves Enron-Era Accounting Lives On,\" linking MF Global to the Texas-based energy company that went bankrupt and became a symbol of corporate fraud.\n\nPolitiFact New Jersey found that Biden made the comment during a May 2009 appearance with Corzine in Lodi to tout a project funded by the federal stimulus act, formally known as the American Recovery and Reinvestment Act.\n\nThe ad shows only a short segment of Biden’s speech, but we found two videos on YouTube with Biden’s longer comments -- one of which was posted by an account for Corzine.\n\n\"Look, the governor just laid out for you the overlap that exists in terms of the things your state is doing and leading on, on energy conservation, on wind and solar, what your state is doing on building schools and investing in education, what your state is doing on health care. And it's not coincidental that that's what the Recovery Act is,\" Biden said.  \n\n\"It's not coincidental that the things he did here turned out to be the exact same things the Recovery Act has, because way back in the transition period, before we were sworn in, when Barack Obama and I were literally sitting in a desk in a high rise in Chicago beginning to plan how we would try to get this economy out of a ditch. Literally, the first guy I called was Jon Corzine. Not a joke. Not a joke. Because first of all, he's the smartest guy that I know in terms of the economy and on finance, I really mean this.\"\n\nSo Biden praised Corzine’s financial prowess then, but is it fair to tie those past comments to what’s happening now?\n\nMichele Claibourn, a research associate at the University of Virginia’s Weldon Cooper Center for Public Service, and Tobe Berkovitz, an associate professor of advertising at Boston University who also works as a political media consultant for campaigns, said yes.\n\nClaibourn said in an email that \"prior praise of Corzine strikes me as relevant insofar as Biden’s/Obama’s praise calls into question the judgment of the administration.\"\n\nBerkovitz said Corzine \"had a reputation in terms of being fiscally brilliant and all that and so to say well things have changed now, this is a man who received the accolades of the president, of the vice president and they now should be held accountable for the opinions of the man.\"\n\n\"You can’t say, ‘well I’d like to take that back,’\" he said.\n\nOur ruling\n\nThe National Republican Congressional Committee released an ad that links Corzine to the Obama administration. In it,  Biden says, \"he’s the smartest guy that I know, in terms of the economy and on finance, I really mean this.\"\n\nBiden made the comment about Corzine before MF Global collapsed and customer funds disappeared, but they’re still the vice president’s words.\n\nWe rate the statement True.", "To comment on this ruling, go to NJ.com.", "National Republican Congressional Committee, New NRCC Web Ad: Obama Admin Sings Praises of Frank Pallone’s Donor Jon Corzine, Dec. 16, 2011\n\nNational Republican Congressional Committee‘s YouTube Channel, Corzine - Where's the money?, Dec. 15, 2011\n\nNew Jersey Department of Transportation, Governor Corzine and Vice President Joe Biden visit the State's first Infrastructure Project Accelerated by American Recovery and Reinvestment Act, May 7, 2009\n\nGov. Jon Corzine’s YouTube Channel, Vice President Praises Gov's Leadership on Economic Recovery,  posted May 8, 2009\n\nEmail interview with Michele P. Claibourn, research associate at University of Virginia’s Weldon Cooper Center for Public Service, Dec. 19, 2011\n\nInterview with Tobe Berkovitz, associate professor of advertising at Boston University, Dec. 20, 2011\n\nYouTube, Joe Biden calls Jon Corzine for Advice Again, Nov. 14, 2011\n\nYouTube, Joe Biden Visits Lodi, NJ pt. 4, May 7, 2009\n\nReuters, Analysis: MF Global proves Enron-era accounting lives on, Dec. 2, 2011", "The Star-Ledger, VP Joe Biden tells Jerseyans Corzine will work for health care and the economy, Oct. 19, 2009\n\nThe Star-Ledger, Biden kicking off stimulus project, May 7, 2009\n\nOffice of Governor Jon Corzine, Governor Corzine and Vice President Joe Biden visit the State's first Infrastructure Project Accelerated by American Recovery and Reinvestment Act, May 7, 2009\n\nThe Star-Ledger, President Obama campaigns with Corzine in Camden, Nov. 1, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]