["By Bala Thenappan", "Posted on August 11, 2020", "Kamala Harris, former Vice President Joe Biden’s running mate, is eligible to serve as U.S. president, contrary to the false claims of viral posts on Facebook. Her mother is from India and her father from Jamaica — but Harris was born in Oakland, California.", "Former Vice President Joe Biden, the presumptive Democratic presidential nominee, announced on Twitter on Aug. 11 that his vice presidential running mate is California Sen. Kamala Harris.", "But multiple posts on Facebook falsely claim that — in the event Biden is unable to serve out his term –Harris is ineligible to serve as president because she’s an “anchor baby” whose parents are immigrants.", "Days before Biden had even announced his choice of running mate, the posts said: “Joe Biden chose Kamala Harris as his VP.” The posts go on to claim, “If crazy Joe cannot serve his full term, Kamala cannot by constitutional law become President. She is an anchor baby, mother is from India, father is Jamaican, and neither were american citizens at time of her birth. That means the Presidency would fall on Speaker of the house. Recently Nancy Pelosi stated that she was next in line to become President. THAT in itself is reason to vote her out in November. Democrats have worked the whole scenario out and I believe that is why they chose Kamala Harris.”", "In an email to FactCheck.Org, Josh Chafetz, a professor at Georgetown University Law Center who specializes in constitutional law, described the Facebook posts as “racist nonsense.”", "Chafetz explained: “To serve as president, one must be at least 35 years old, have been a resident of the United States for at least 14 years, and be a ‘natural born Citizen’ (Article II, sec. 1 of the Constitution).  Additionally, one cannot have already been president for more than a term and a half (22nd Amendment).”", "As we’ve reported before, Harris, whose mother is from India and whose father is from Jamaica, was born in Oakland, California, which makes her a natural born U.S. citizen and eligible to serve as president. She was born Oct. 20, 1964, according to the Biographical Directory of the United States Congress.", "Chafetz added that the fact that Harris’s parents are immigrants is “wholly irrelevant.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Biden’s VP Pick: Who is the Front Runner Kamala Harris?” BBC. 11 Aug 2020.", "“Biden Picks Kamala Harris as His Running Mate.” Bloomberg News. 11 Aug 2020.", "Cadelago, Christopher. “Biden picks Kamala Harris as VP nominee.” Politico. 11 Aug 2020.", "Chafetz, Josh. Professor of law, Georgetown University Law Center. Email to FactCheck.org. 11 Aug 2020.", "Detrow, Scott. “Kamala Harris Is Seen As the Clear Front-Runner to Be Joe Biden’s Running Mate.” NPR. 22 Jun 2020.", "Fichera, Angelo. “Meme Uses Deception to Accuse Harris of ‘Lies.’” FactCheck.Org. 5 Jul 2019.", "U.S. Constitution. Article II. Legal Information Institute, Cornell Law School. Accessed 11 Aug 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]