["The video was viewed more than 4,700 times after being published here on Facebook on April 8.", "The post’s Urdu-language caption translates to English as: \"Another great step by the government for the spread of coronavirus in the country. Today Afghan border was opened. Thousands of people entered the country without corona test.\"", "Below is a screenshot of the misleading Facebook post:", "The novel coronavirus has so far killed at least 91 people and infected 5,230 more in Pakistan as of April 13, according to official government records.", "The same video was also shared alongside a similar claim on Facebook here and on Twitter here.", "The claim is false; the footage actually shows Afghan nationals leaving Pakistan and returning to Afghanistan in early April 2020. The crossing occurred after Pakistan, which sealed its borders in March, made special temporary arrangements for the stranded Afghans in Pakistan to leave via the Torkham border.", "British newspaper The Daily Telegraph published the same footage on April 8, 2020 on YouTube here. The video is titled: “Thousands rush across Pakistan-Afghanistan border after officials lift Covid-19 restrictions”.", "The video’s description reads: “Thousands of Afghan streamed across the Pakistan border to their homeland on Tuesday [April 7, 2020] overwhelming authorities who had opened the frontier after more than two weeks of restrictions to stop the spread of Covid-19.", "“Video from the Torkham border crossing near the Khyber Pass showed large crowds of Afghans running through, apparently bypassing official attempts to check paperwork and enforce quarantine.”", "Below is a screenshot comparison of the video in misleading Facebook post (L) and video in The Telegraph report (R):", "The special border crossing was announced by Pakistani Foreign Ministry spokeswoman Aisha Farooqui on April 4.", "“On Afghanistan’s special request & on humanitarian considerations,we are allowing exit of nationals, wishing to go back to their country,through Torkham & Chaman border crossings on 6-9 April,” Farooqui wrote on Twitter here. “We remain in solidarity with our Afghan brethren at this time of global pandemic.”", "Below is a screenshot of the tweet:", "Pakistani newspaper The News reported here that an estimated 10,000 Afghans left Pakistan during the allowed crossing. Voice of America Deewa also published different footage showing Afghans rushing to leave Pakistan on Twitter here on April 7, 2020.", "A closer analysis of the footage shared in the misleading posts also shows that people are exiting a gate that bears the Pakistani flag, indicating they are leaving Pakistan and entering Afghanistan.", "Below is a screenshot comparison of the misleading Facebook post (L) and this Google Maps photo of the Torkham crossing (R) with the gate circled in red.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]