["The photo which has been shared multiple times, for example here by a page with more than 300,000 followers, and here, shows the cover of a book which features an illustration of Leni Robredo’s husband Jesse, who died in 2012.", "The headline of the book in the photograph, when translated to English, says: \"'Dad, why does Mom have no brains?' The question of Jesse Robredo's children\".", "The misleading Facebook post’s status says: \"Why indeed?\"", "Below is a screenshot of one of the Facebook posts, which were first shared in 2017 with similar posts appearing more recently, for example here in November 2018.", "Jesse Robredo is the late husband of Philippine vice president Leni Robredo. He was also a member of the Liberal party, the main opposition party in the country, to which Leni Robredo belongs. He died in a plane crash on August 18, 2012.", "Comments like the one below indicate some Facebook users believed the misleading post:", "This comment, when translated to English, says:  “That's a nice book..!! Distribute this already in the national bookstore..!!!\"", "National Bookstore is one of the biggest bookstores chains in the Philippines.", "An online search using tools from Intel Techniques traced the photo back to a 2017 tweet by CNN Philippines.", "On the eve of her birthday, VP @lenirobredo will launch children's book \"'Nay, Ano ang Bayani? Ang Kwento ni Jesse Robredo\" | @anjocalimario pic.twitter.com/52tYELODmg", "The title of the book in the original photo, when translated to English, says: “‘Mom, what is a hero?’ The Story of Jesse Robredo”", "The misleading photo and the original photo contain these same distinctive details: a woman in a black top sitting in the top right hand corner of the frame, children in white shirts and people in yellow shirts sitting on chairs in the foreground, and large yellow boards covered with photos and text visible in the background.", "Photos of the real book's cover can also be seen here in a 2017 tweet by the vice president on her official Twitter account.", "Earlier: Launch of \"Nay, Ano ang Bayani?: Ang Kwento ni Jesse Robredo\"—a children's book that tells the leadership journey of Jesse Robredo pic.twitter.com/nlL0gyuVFO", "The misleading post has been shared more than 3,000 times by Facebook groups and pages which support Philippine President Rodrigo Duterte and his daughter, Sara Duterte.", "UPDATE: this post has been updated to clarify in paragraph 1 that Leni Robredo did not write the book about her late husband", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]