["About this rating", "Jumping into a pile of poop is just part of a regular day’s work for sewage divers in Australia. In January 2021, Redditors shared an image of a man named Brendan, claiming that he was a “poop diver.”", "Brendan’s story comes from a 2014 profile published by Vice that describes him as a sewage diver. Brendan’s job involves him diving into all kinds of environments with negligible air circulation, with piles of refuse being just one of those. He runs a Melbourne company called East West Dive and Salvage, which offers “contaminated diving operations\":", "[...] we offer a wide range of underwater and wet services. These include full contamination diving, potable water diving, wharf carpentry including underwater cutting and drilling, underwater grout and concrete pouring, confined space works, underwater video inspections, nondestructive testing and vessel and coxswain hire.", "On why such diving is necessary, Brendan said: “I'm doing it because in Australia, we don't process our sewerage with chemicals. We get bacteria to break down the solids by aerating them with big stirring machines, 24 hours a day. It's a very aggressive environment, and moving parts constantly break.”", "He found himself diving in blind to repair machines intended to mix the sewage, because there was no visibility down there. Most of his work was done “by feel.” A short 2018 video by Vice shared more details about Brendan’s work:", "Since this is a real job in Australia, we rate this claim as “True.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]