["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Students from the Medical College of Wisconsin learn from a medical recruiter for the Army about the physical demands on soldiers. (Michael Sears photo)", "So, if three out of every four young adults are not eligible for the military, but two out of every three high school graduates go onto college, what does that say?", "To Wisconsin state Rep. Dale Kooyenga, a military intelligence officer in the Army Reserves and a veteran of the Iraq War, it says this:", "\"Today, it is more difficult to enlist in the United States military than it is to enroll in college.\"", "That’s a broad claim from Kooyenga, a suburban Milwaukee Republican who made the statement in his April 1, 2016 constituent newsletter. He was asserting that \"if we are going to continue to be the world’s military leader, we must also become a leader in education.\"", "Kooyenga seems to have a compelling talking point.", "But, as defense manpower specialist Beth Asch told us, it’s also \"a mashup of a lot of ideas in one sentence.\"", "Post-high school", "Both the military and college are post-high school pursuits that require a high school diploma. But the similarities more or less end there.", "The military is looking for soldiers; colleges are looking for students.", "The minimum requirements to get into the military are pretty standard, even if they vary somewhat by branch. But the entrance requirements to get into Harvard are much different than those for getting into a community college.", "The military will pay you; but most students need to pay for college.", "So, in terms of Kooyenga’s claim: More difficult for whom?", "It’s more difficult for an overweight person with good grades to get into the military; but it’s more difficult for a fit person with bad grades to get into college.", "All that being said, Kooyenga does have some numbers on his side.", "The statistics", "Asch, an economist with the RAND Corp. think tank, said statistics Kooyenga cited to us to back his claim are generally on target.", "Military: Defense Department estimates dating back to at least 2009 say roughly 75 percent of Americans ages 17 to 24 would not qualify to enlist in the military.", "One reason is being overweight. Indeed, when first lady Michelle Obama said in 2011 that more than one-quarter of America’s young adults are too fat to serve in the U.S. military, PolitiFact Georgia rated her claim True.", "Other common reasons for being barred from the military, besides lacking a high school diploma: Conviction of a felony or serious misdemeanor; prior drug or alcohol abuse; and current prescription-drug use for attention-deficit hyperactivity disorder (ADHD).", "College: Federal statistics, including one Kooyenga cited, show that roughly 66 percent of people who graduate from high school go onto college. (For 2015 high school graduates, 69 percent had enrolled in colleges or universities by October 2015, according to a federal report.)", "But, the two sets of figures reinforce the point that, while Kooyenga’s claim was broad, it really comes down to individual characteristics as to whether it’s more difficult for a person to get into the military versus college.", "Our rating", "Kooyenga said: \"Today, it is more difficult to enlist in the U.S. military than it is to enroll in college.\"", "There isn’t definitive evidence to prove the claim, given that it mixes apples and oranges: The military and college are entirely different pursuits with different sets of minimum standards for getting in, and among colleges, the entrance requirements vary widely.", "At the same time, there are credible estimates saying that roughly 75 percent of young adults in America wouldn’t be eligible to enlist if they tried, while roughly two out of three high school graduates go on to a two- or four-year college.", "For a statement that is partially accurate, our rating is Half True.", "Rep. Dale Kooyenga, e-newsletter, April 1, 2016", "Email, Rep. Dale Kooyenga legislative assistant Rachel Vander Wiele, April 26, 2016", "Interview, Wisconsin School Counselor Association executive director Stacy Eslick, May 17, 2016", "Interview, RAND Corp. senior economist defense manpower Beth Asch, May 26, 2016", "U.S. Bureau of Labor Statistics, \"College enrollment and work activity of 2015 high school graduates,\" April 28, 2016", "FactCheck.org, \"Carson botches military eligibility statistic,\" Feb. 26, 2016", "New York Times, \"Fewer U.S. Graduates Opt for College After High School,\" April 25, 2014", "CNN Money, \"Getting into the military is getting tougher,\"  May 15, 2013", "Wall Street Journal, \"Recruits' Ineligibility Tests the Military,\" June 27, 2014", "PolitiFact Rhode Island, \"Author Bing West says 75% of young adults in U.S. not mentally or physically fit to serve in military,\" March 2, 2014", "Email, The Education Trust chief executive officer Kati Haycock, May 25, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]