["On December 16, far-right British commentator Katie Hopkins tweeted a video of a man adorning a skull cap pelting a brick at a sedentary bus. She claimed, “The mentality of the Islamists protesting against the Citizenship Bill”. She further opined, “Why would India want these types as citizens Hindus build. Islamists destroy. Keep going Modi. Hooray for #CAB2019”. So far, the tweet has amassed close to 8,200 retweets. Hopkins has been featured on Indian media outlets like Republic TV, India Today and Times Now.", "The mentality of the Islamists protesting against the Citizenship Bill", "Why would India want these types as citizens?", "Hindus build. Islamists destroy.", "Keep going Modi. Hooray for #CAB2019 pic.twitter.com/z59bByh0Ou", "— Katie Hopkins (@KTHopkins) December 16, 2019", "The British commentator had quote-tweeted a video posted by Twitter handle @AhmAsmiYodha which was retweeted by Pakistani-Canadian author Tarek Fatah. This tweet has garnered close to 1,200 retweets.", "With the help of digital verification tool Invid, Alt News broke the video into multiple frames and reverse searched these on the Russian search engine Yandex. We found the same video posted on YouTube on August 31, 2019.", "We then performed another reverse search of the above, better quality clip, on Yandex. A similar image of another person pelting a stone at the same bus was found in the search results.", "Further investigation revealed that the video is from Surat, Gujarat from almost three years ago. “સુરત:-ઉધનામાં BRTS રોડ પર એક બસ ચાલકે એક રહદારી ને અડફેટે લેતા આકસ્માત (Surat: Accident on Udhna BRTS road after a bus driver hits a pedestrian -translated)”, reads the title of the video, posted by a YouTube channel News4India on January 28, 2017.", "In the video posted below, one can see that a group of people are pelting bricks at the bus, whereas in the viral video, the portion where a man donning a skull cap was throwing a brick was mischievously clipped.", "According to the video report, an accident took place on Satya Nagar BRTS road after a pedestrian was hit by a bus in Surat’s Udhna area. It is being said that the pedestrian had suffered serious injuries and was shifted to civil hospital. The incident triggered outrage among the people and stones were pelted at the bus and the bus’s glass was shattered. The police reached the spot and pacified the situation. A case was registered by the police against the driver.", "Gujarati daily Divya Bhaskar also reported that the driver was thrashed by people after which he fled from the scene.", "Joining the bandwagon, filmmaker Vivek Agnihotri tweeted the video with the message, “A peaceful student in a peaceful protest. Straight from the University of Nizam-e-Mustafa.” Agnihotri’s tweet was retweeted more than 1,500 times.", "A peaceful student in a peaceful protest. Straight from the University of Nizam-e-Mustafa.", "pic.twitter.com/DKMCv9QuNi", "— Vivek Ranjan Agnihotri (@vivekagnihotri) December 17, 2019", "Twitter handle @TheAngryLord also posted the video while saying, “Dange karne wale apne kapdo se pehchane jaate hain (The rioters are identified by their clothing -translated)”. It is noteworthy that Prime Minister Narendra Modi made a similar remark while addressing an election rally in Jharkhand on December 15. He said, “Those who are creating violence can be identified by their clothes itself.”", "Dange karne wale apne kapdo se pehchane jaate hain… pic.twitter.com/m7Tthx2zkf", "— INFERNO 2.0 (@TheAngryLord) December 17, 2019", "In conclusion, an almost-three-year-old video of public outrage over an accident in Surat, Gujarat was clipped and shared as an anti-CAA protester from the Muslim community vandalising a bus in India.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]