["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Assemblymember Deborah Glick speaks in the New York State Assembly. (Courtesy: Assembly Majority Facebook Page)", "Assembly Democrats want to guarantee access to abortion for New York state residents if the Supreme Court overturns the landmark Roe v. Wade decision.", "A bill, commonly referred to as the Reproductive Health Act, would change state law to guarantee women the choice to have or refuse an abortion or contraception if the Supreme Court reverses Roe v. Wade. Different versions of the bill have been introduced for at least seven years in the Legislature. This year’s debate over the measure included tough questions to the bill’s sponsor, Assemblymember Deborah J. Glick, from members opposed to the bill.", "\"So, if a baby is born intact and alive but has not yet taken its first breath, it has no rights?\" Assemblymember Steven F. McLaughlin asked. \"Is that the position you are taking?\"", "\"New York state law says you are alive when you begin to breathe,\" Glick said. \"That’s not me, that’s just the law.\"", "Is Glick right? Is that the law?", "State abortion law", "Glick said her definition comes from the current state law on abortion.", "The definition is included in the state’s penal law, or criminal code, which defines the crime of abortion, where someone intentionally causes a pregnancy to be terminated without consent or justification.", "The law says a person, \"when referring to the victim of a homicide, means a human being who has been born and is alive.\"", "So a fetus inside the womb is not considered a person, and therefore does not have rights under state law. That is why someone can legally have an abortion after being pregnant for 24 weeks to preserve the life of the mother.", "State health law", "State health law goes a step further in defining when someone is considered born.", "Under Public Health Law, live birth is defined as \"the complete expulsion or extraction from its mother of a product of conception, irrespective of the duration of pregnancy, which, after such separation, breathes or shows any other evidence of life such as beating of the heart, pulsation of the umbilical cord, or definite movement of voluntary muscles, whether or not the umbilical cord has been cut or the placenta is attached; each product of such a birth is considered live born.\"", "It is up to a medical professional to determine if there is evidence of life in the infant. If the medical professional finds evidence, it is legally considered the birth of a person.", "\"The reality is that if they are born and alive they are a person and have full rights,\" Glick said in a phone interview. \"And that is the determination of a medical person at the time.\"", "Our ruling", "Glick said during an Assembly debate that \"New York state law says you are alive when you begin to breathe.\"", "State law says a person has been born alive when the fetus has exited the woman’s body and shows signs of life. The law specifically mentions breathing as one of the signs. But the law also mentions other evidence of life, such as a beating heart.", "We rate this claim as Mostly True.", "Assembly Debate on the Reproductive Health Act, Jan. 17, 2017, Accessed Jan. 17, 2017", "Phone conversation with Assemblymember Deborah Glick", "The Reproductive Health Act, 2017, Assembly Bill 1748", "Article 125 of the New York State Penal Law, New York State Law Database", "Article 41, Title 3 of the New York State Public Health Law, New York State Law Database", "Article 131 of the New York State Education Law, NYS Dept. of Education Website", "Letter from Attorney General Eric Schneiderman’s Counsel on New York State abortion law, Sept. 7, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]