["On June 17, a UK-based news platform Epistle News published a report that claimed India has captured the Chinese side of Pangong Lake for the first time since 1962. The article is no longer accessible on the website. However, the tweet (archive link) posted by Epistle News Twitter account shows such an article was indeed published.", "Prashant Patel Umrao similarly tweeted, “According to a report, Bharat has captured the Chinese side of Pangong Lake- a region that was taken under china’s control post the 1962 war.” His tweet has been retweeted over 5,000 times (archive link). Umrao has often been found sharing misinformation on social media.", "Ashish Pandey, member of Uttar Pradesh chief minister social media hub tweeted an identical tweet as Umrao’s (archive link). Vibhor Anand posted a similar tweet. He wrote, “Big and Confirmed: #IndiaChinaFaceOff Indian Forces have captured the Chinese side of Pangong Lake codenamed Finger 8.” Anand’s tweet gained over 1,000 retweets (archive link).", "The article is no longer available on Epistle News website, however, there is a screenshot of the same. As per the screenshot, the opening paragraph read, “In a fresh twist to ongoing India-China skirmishes, unconfirmed sources have asserted that India has now captured the Chinese side of Pangong Lake – a region that was taken under China’s control post the 1962 Indo-China war.” The article also included an image that showed Indian soldiers waving a flag with their fists raised in the air.", "Since then several people on Facebook and Twitter have shared the article. A Facebook user even copy-pasted the entire article while sharing a post by BJP Rajya Sabha member Subramanian Swamy (archive link). The first paragraph is identical to the one in the screenshot attached above.", "In the course of this article, Alt New will investigate the following: 1) Epistle News website 2) Twitter account of Epistle News", "Alt News performed a keyword search and found that no other website has made the claim that India has captured the Chinese side of Pangong Lake. Moreover, neither the Government of India nor the Indian army has made any such announcement. In fact, both India and China have agreed to de-escalate, meaning that it is improbable that New Delhi will engage in an offensive of this scale. Yet several social media users have shared the claim promoted by a sketchy website called Epistle News which has  .co.uk domain and as per it’s Twitter bio it is based out of London.", "Alt News analysed the website and Twitter account of Epistle News and found several traits that indicate that it’s not a news website but a set up to push pro-government propaganda.", "We visited the website and noticed that along with the article in question, it had also published another piece which claimed that the Indian army killed 43 Chinese troopers.", "On June 17, Alt News published a report on how a section of the media and journalists misrepresented ANI’s tweet on alleged casualties on the Chinese side as “43 Chinese soldiers killed”. We also noticed that not a single article on the website is responsive. All of them lead to ‘404 Not Found’ error page.", "Epistle News claimed that there were DDoS attacks against the website. However, the website’s homepage is accessible but not individual articles. Typically, in the case of DDoS attacks, the entire website goes down.", "Our website is facing multiple DDoS attacks after posting this article. We’ve taken our whole website down for a while and will update you as soon as the issue is resolved.", "We thank you for your patience and support.", "— Epistle News (@EpistleNews) June 17, 2020", "As per Amazon’s web analytics service Alexa, the website has a world rank of 2,865,605. Alexa has anakysed its internet traffic and engagement over the past 90 days.", "Alt News performed a reverse image search of the photo shown in the Epistle News tweet and found that it was published by several media outlets, including The Print which had used it as a representative image in an article from March and credited it to ANI.", "While the image does not seem to be on the public domain, another reverse image search led to a similar image published by India Today on January 26, 2020.", "As per the article, the image shows soldiers celebrating the 2020 Republic Day at the LoC. The differences between the two images are — A) Soldiers’ fists aren’t raised and B) Images are not shot at the exact time. Apart from that, both images are identical — A) They show the same nine Indian army soldiers; B) In both the images the fifth trooper is holding the flag and C) The location is the same.", "On January 25, an India Today broadcast showed the soldiers in the viral image singing a patriotic song. The relevant section begins from 2:44 seconds in the video.", "As per the website, the Twitter handle of Epistle News is @EpistleNews. As per its Twitter bio, the account was created in 2016. A low follower count, after a period of four years, indicates that it is not a genuine news organisation. As of this writing, the account has posted only 88 tweets since its inception which is atypical and suspicious of a news website.", "Using a tool called accountanalysis.app, we found that the top three hashtags promoted by the handle were India, Trump and Indore. It is highly uncharacteristic of a ‘UK-based’ website to not publish top stories related to the UK.", "The screenshot below shows tweets from Indore posted by ‘UK-based’ Epistle News.", "Furthermore, the first tweet of the account was posted on October 8, 2018. The tweet reveals that Epistle News was initially hosted on blogpost.in which suggests that a person of Indian-origin is behind the portal.", "https://t.co/tQZPcINXYM", "— Epistle News (@EpistleNews) October 8, 2016", "Prashant Patel Umrao and several other social media users shared the false claim that India has captured the Chinese side of Pangong Lake for the first time since 1962 based on an unreliable website Epistle News. The article is no longer accessible on the website.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]