["About this rating", "In early February 2016, JebBush.com redirected to the web site of Donald Trump.", "Trump tweeted boasting about the redirect; the Trump campaign appeared to be responsible.", "Who was responsible for the redirection.", "On 15 February 2016, social media users began sharing the above-reproduced tweet. On first glance, it appeared to be a boast from Donald Trump about registering JebBush.com because Bush's campaign \"forgot to renew\" the domain.", "However, the tweet didn't appear anywhere on Trump's recent Twitter feed, and the image clearly showed a handle of @P0TUSTrump, not Trump's known Twitter handle of @RealDonaldTrump. The tweet was visible on the account @P0TUSTrump, dated 6 January 2016:", "The redirection wasn't actually news in January or February 2016; on 7 December 2015, The Hill reported:", "The long-standing feud between Republican presidential front-runner Donald Trump and GOP rival Jeb Bush escalated on Monday, with a site with the former Florida governor’s name redirecting to Trump’s campaign website homepage.", "A site with the domain name JebBush.com redirects to the real estate mogul’s official presidential campaign page, donaldjtrump.com, and features Trump’s slogan with options to support or donate to his campaign.", "Bush’s official presidential campaign page uses the domain name Jeb2016.com.", "It wasn't clear whether Bush ever maintained a web presence at JebBush.com; no cached copies were available through web archive sites. Domain registration records indicated that the Trump campaign wasn't necessarily linked to the prank:", "Ultimately, it was true JebBush.com redirected to Donald Trump's web site. But Trump didn't brag about the redirect on Twitter, nor was he likely responsible for it. Finally, it didn't appear Bush's campaign ever maintained a web site at JebBush.com for any parties to specifically \"take over.\" It wasn't clear who specifically registered the domain, set up the redirect to Trump's site, or why they did so.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]