["About this rating", "The exterior of the pictured house did survive Hurricane Ike.", "The house in question did not exist until 2006 and thus could not have been saved by an exorcism performed in 1988.", "In September 2008, Hurricane Ike made landfall in Galveston, Texas, the site of the deadliest hurricane in American history 108 years earlier, and caused multiple deaths and an estimated $30 billion in property damage throughout Texas, Louisiana, and Florida. Hundreds of thousands of people were forced to evacuate their homes before and during the storm.", "According to the National Hurricane Center, the Bolivar Peninsula suffered the worst devastation and most destructive storm surges in the United States. That narrow stretch of land between Galveston Bay and the Gulf of Mexico was also the site of one of the iconic images to emerge in the aftermath of Hurricane Ike: the \"Last House Standing.\"", "Associated Press photographer David J. Phillip took a series of photographs of the house that were captioned as picturing \"a beachfront home stand[ing] among the debris in Gilchrist, Texas on Sunday, Sept. 14, 2008 after Hurricane Ike hit the area.\"", "Another view of the same house was provided by the Federal Emergency Management Agency (FEMA):", "Over the intervening years, the remarkable image became the subject of a viral meme which claimed that supernatural forces, rather than pure chance, were to thank for the house's escaping destruction.  For example, in May 2018, the \"Scary Facts\" Facebook page shared this meme:", "The beachfront home, which stood surrounded by debris from neighboring properties, belonged to then 53-year-old cost analyst Pam Adams and her husband Warren, a 63-year-old retired electrical designer and U.S. Marine veteran.", "In 2005, Hurricane Rita had destroyed the couple's home in Gilchrist, so they rebuilt a house on the same site. Therefore, the claim made in the meme, that an exorcism in 1988 later saved the Adamses' home, is false because the house didn't exist until 2006.", "The real reason the house survived the hurricane was more prosaic. In a 2008 interview with the Houston Chronicle, Warren Adams suggested elevation played a key role:", "It was built to Galveston County code, he said, which anticipates 130-mile-per-hour winds on the seaward side of the county. But the elevation may have helped. Adams said he built high, in part, to get a break on flood insurance. The home sits 15 feet above ground.", "\"The piece of land my house is sitting on was probably one of the highest above sea level in the area, about 8 or 9 feet above sea level before we even started the house,\" he said. \"I think the house is about 16 inches higher than it needs to be.\"", "Although the structure remained standing, the interior did not survive unscathed, as CNN reported that \"Everything was waterlogged and covered in mud. [Pam] Adams said they had to throw clothing, furniture and other destroyed possessions out their windows to stop mold from growing.\"", "For a time after the storm, the Adamses resided in an apartment in Baytown, Texas, and seriously considered abandoning Bolivar Peninsula and moving on. But in the end, they stayed put and rebuilt the house again, along with some (though not all) of their neighbors.  In a blog post, Pam Adams later explained the couple's decision to stay:", "One day, I was driving down Hwy. 87 towards my home, and the sunset shining under my home caused me to pull over and just sit and look at her. I knew at that moment that I could not walk away. The feeling I had was that this picture was the most beautiful, heartfelt sight that I’d ever seen. My crippled home sat engulfed in the sunset on the Gulf.", "Somehow, I knew at that moment that we could not walk away from her. She didn’t float away from us, or be blown to pieces, so we had to roll up our sleeves and give it one more try to live by the water.", "The Last House Standing was inhabitable again within a year, and in 2010 Pam Adams even opened a bar and restaurant nearby called FantaSea BBQ & Grill. (Warren Adams died in 2016 at the age of 71.)", "The survival of the Adams home amid the devastation Hurricane Ike caused on the Bolivar Peninsula was truly remarkable, and aerial photographs of it standing alone in the immediate aftermath of the storm have proven iconic. But an exorcism supposedly performed in 1988, a full eighteen years before the house was built, had nothing to with any of it.", "Berg, Robbie.   \"Tropical Cyclone Report -- Hurricane Ike.\"\r\n    National Hurricane Center.   23 January 2009.", "Galeshouse, Maggie.   \"Owners Return to Last Home Left in Bolivar Town.\"\r\n    Houston Chronicle.   26 September 2008.", "Hawkins-Gaar, Katie.   \"Christmas at the 'Last House Standing.'\"\r\n    CNN.   22 December 2008.", "Adams, Pam.   \"Sister of the Salt Shares Why She Loves Bolivar.\"\r\n    Crystal Beach Local News.   Unknown publication date.", "Hanna, Jason.   \"Owners of 'Last House Standing' Part of Peninsula's Comeback.\"\r\n    CNN.   26 July 2011.", "The [Galveston County] Daily News.   \"James Warren Adams -- Obituary.\"\r\n    27 November 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]