["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This Doonesbury comic strip took Fox News to task for politicizing fears about Ebola. (Washington Post/Trudeau)", "A day before PolitiFact unveiled that exaggerations about Ebola took top honors as the 2014 Lie of the Year, the comic strip Doonesbury took aim at the very same target.", "The strip’s author Garry Trudeau imagined an interview between his characters NPR host Mark Slackmeyer, and Fox News correspondent Roland Hedley.", "Hedley: We’re very proud of our Ebola unit. We covered Obama’s bungling of the epidemic from the Dallas debacle to the election.", "Slackmeyer: Have any idea how many Americans died from Ebola during that time?", "Hedley: Um ... No. I’d have to run the numbers on that.", "Slackmeyer: None. Not a single one. Want to know how many died of gunfire during that same period?", "Hedley: I don’t see how that’s relevant.", "Slackmeyer: Statistically, about 3,000.", "For the record, Trudeau is correct about the number of Americans who died from Ebola. The two people who succumbed on American soil were not American citizens.", "But we wanted to take a closer look at Trudeau’s statement that \"statistically, about 3,000\" people died of gunfire between the events in Dallas and the November election. That word \"statistically\" struck us as a particularly careful choice.", "To refresh your memory, Thomas Eric Duncan was admitted to a Dallas hospital on Sept. 28. Duncan ultimately died and then two nurses who treated him contracted the disease. They both survived. The election took place on Nov. 4.", "Trudeau explained to us that he based his number on annual deaths due to guns that he found on a website run by the School of Public Health at the University of Sydney in Australia.  The yearly totals only went through 2011 so Trudeau looked back five years and took the lowest number.  He divided to find the weekly average and used that for the five weeks between Duncan becoming ill and the election.", "\"It's obviously only a statistically typical five-week period,\" Trudeau said. \"For all I know there could have been a major lull in gun violence in October. But for purposes of argumentative contrast, I felt it accurately reflected the magnitude of harm our epidemic of gun violence inflicts.\"", "Using the Centers for Disease Control and Prevention’s aptly named Wonder database, we found monthly numbers that ran through 2012. For simplicity, we summed deaths for October and the first four days of November. This approach was slightly more precise than Trudeau’s and as this table shows, it more than confirmed Trudeau’s claim. (Adding a few days in September would only make the case stronger.)", "Year", "October", "Nov. (4 days)", "Total", "2012", "2,733", "364", "3,097", "2011", "2,748", "344", "3,092", "2010", "2,725", "336", "3,061", "2009", "2,655", "333", "2,988", "2008", "2,626", "339", "2,965", "Average", "3,041", "We don’t know exactly how many people died over that time period in 2014, and we won’t know for about a year. But Trudeau’s figure is very much in line with past trends, and as Trudeau noted to us, the numbers have been stable for many years.", "Suicide looms large", "The most important caveat to Trudeau’s statement is that it includes suicides. In 2012, the CDC classified 20,666 deaths as due to \"intentional self-harm\" by any sort of firearm. The number of deaths by assault, or what we might call homicide? 11,622.", "Gun violence is an umbrella term that covers all manner of deaths when a weapon is fired. It includes suicide, criminal homicide, police shootings, cases when the intent is unknown, and a strange category called \"exposure to inanimate mechanical force - firearm.\"", "When you hear about gun violence, it might suggest solely people killing each other. That would be inaccurate. Roughly two-thirds of the deaths are people killing themselves.", "Also, the CDC data records the death of residents, but it doesn’t track their citizenship status. Trudeau contrasted gun deaths with the deaths of Americans due to Ebola. We found no information that made the distinction.", "A note about Fox News", "While Fox News devoted many minutes if not hours to Ebola coverage, and not always with pinpoint accuracy, on Oct. 15 host Shepard Smith delivered a 4-minute monologue saying that fear of Ebola is \"not based in fact or reason.\" Smith decried the tendency of politicians and news organizations to hype the hysteria.", "Our ruling", "Garry Trudeau, speaking through his characters in Doonesbury, said that in the time between the Ebola scare in Dallas and the election, \"statistically\" about 3,000 Americans died from gunfire.", "The latest data from the CDC bears that out. Using a five-year average, we found 3,041 deaths in the relevant time period.", "Given that the debate over gun deaths in this country often centers on homicides or accidental shootings, it is important to note that about two-thirds of the total would likely be suicides. Plus, the CDC data counts the deaths of residents, which might include some noncitizens. Still, the number of deaths is in line with what Trudeau said, even if the precise figures will vary.", "The claim is accurate but it requires some clarification. Accordingly, we rate it Mostly True.", "Washington Post, Doonesbury, Dec. 14, 2014", "Gunpolicy.org, Sydney School of Public Health, University of Sydney", "Centers for Disease Control and Prevention,Wonder database - underlying cause of death", "National Vital Statistics Report, Number of deaths, death rates, and age-adjusted death rates for injury by firearms, by race and sex: United States, 1999–2010, May 8, 2013", "Centers for Disease Control and Prevention, Fast Stats: Assault or Homicide", "New York Times, Dallas Closes the Door on Its Ebola Scare, Nov. 7, 2014", "Fox News, Shepard Smith on Ebola, Oct. 15, 2014", "Interview, Jeff Lancashire, public information officer, National Center for Health Statistics, Centers for Disease Control, Dec. 16, 2014", "Email interview, Garry Trudeau, creator of Doonesbury, Dec. 15, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]