["About this rating", "WRCBtv's election night software tests were briefly visible to the public, and the station acknowledged and explained why that was the case.", "The scenario was not inexplicable, clear evidence of rigging, or unprecedented/uncommon.", "On 3 November 2016, multiple web sites published articles reporting that a Chattanooga-area NBC affiliate accidentally posted the results of the 2016 election early (suggesting the outcome was \"fixed\" for Hillary Clinton):", "The results are published in the typical format used by mainstream news networks and display Presidential and Congressional results, the popular vote count, electoral votes, and percentage of precincts reporting in. The page was taken down soon after, but is available via the internet archive. The results of the Presidential contest name Hillary Clinton the winner with 41.7 million votes or 42% of the total. Trump, on the other hand, received 40.1 million votes or 40%. The results also gave Gary Johnson 8% while Jill Stein received 5%.", "However, the posted premature results were not exclusive to NBC nor its Tennessee affiliate. The page was pulled directly from the content management platform, WorldNow.com, which is used by major networks including NBC, CBS, ABC, and Fox. These media companies use the platform, also known as Frankly, to power their news content. Many news affiliates display this on their webpage, including the NBC affiliate that posted the premature results, by showing “powered by Frankly” at the bottom of their pages. The results information can still be found on an FTP server at WorldNow.com. In addition, the leaked page showing national results, another page on the WorldNow.com FTP servers appear to show the Presidential election results state by state. These results show Clinton winning in states like Texas (42%-40%), Florida (44-40%), Pennsylvania (44-40%), and South Carolina (44-39%), all of which are “battleground” states as well as must-wins for Clinton.", "A screenshot archived from the worldnow.com domain and and attributed to WRCB was shared with various versions of the story.", "The general election claim is nearly identical to a similar rumor that the Indiana primary was rigged against Bernie Sanders and for Hillary Clinton, with election results shared by a news station prior to the actual vote given as proof.  However:", "A newsroom employee told us that the station was testing its primary night reporting functions that day (a common practice in newsrooms ahead of invariably busy election days). The employee said that such results were tested for every candidate in every race, and that they weren't the only visuals available ahead of the state's 3 May 2016 primary.", "The glitch is similar to other instances in which pre-written obituaries for notable people have gone live before their deaths, a circumstance so common as to have its own Wikipedia page.", "This phenomenon appears in nearly every election. In 2012, ABC and CBS affiliates prompted similar rumors with in-house result tabulation tests appearing to predict President Barack Obama's re-election:", "Normally, such mistakes are merely chuckled over before being dismissed in favor of the real news of the day. However, the nature of what was broadcast by each of those two stations made at least a few people wonder if the fix wasn't in for a particular candidate because each displayed results for the 2012 presidential election, an event then over two weeks away.", "On 5 November 2016, WRCB openly acknowledged the existence of and purpose for the leak of the election \"results\":", "Unpublished test election data appeared for a brief time on public servers this week for multiple news organizations that subscribe to the Associated Press election results service, including WRCB. Part of the test is to determine how the \"winner check-mark\" graphic and layout will appear on different platforms.", "\"AP goes to great lengths to clearly mark test data and advises its customers to do the same,\" said AP Media Relations Manager Lauren Easton.", "The test data appeared for several state and national races, including president. Now that testing is complete, WRCB has removed the test data stream to return results to zero in preparation for election night. It is possible the test data stream may need to be turned on again for brief periods of time as designers continue testing the graphics.", "This has been the practice of news organizations for decades.", "The station (and other Associated Press affiliates) did not post election results early, but instead suffered an extremely common glitch while testing election night software that inadvertently exposed sample outcomes to the public during routine testing.", "WRCBtv.   \"News Organizations Test Their Election Graphics Before All Elections.\"\r\n    5 November 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]