["‼️ATTENTION ‼️We wish to draw your attention to a series of social media posts doing the rounds alleging that HELB systems have been hacked or that police are arresting students who are HELB Beneficiaries. This is not true.Treat this as FAKE NEWS! pic.twitter.com/woWe0UBZzA", "Please complete this form to receive the HTML sharing code.", "A fact-checker has rated your Facebook or Instagram post as “false”, “altered”, “partly false” or “missing context”. This could have serious consequences. What do you do?", "Click on our guide for the steps you should follow.", "Africa Check is a partner in\nMeta's third-party fact-checking programme\nto help stop the spread of false information on social media.", "The content we rate as “false” will be downgraded on Facebook and Instagram. This means fewer people will see it.", "You can also help identify false information on Facebook. This\nguide explains how.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]