["About this rating", "In late October 2020, barely a week before the upcoming U.S. presidential election in which the COVID-19 pandemic that had killed 225,000 Americans to date was a major issue, White House chief of staff Mark Meadows was heavily criticized for declaring that “We’re not going to control the pandemic.”", "At the same time, social media users were circulating a purported tweet from presidential candidate Joe Biden in which he purportedly issued a prescient warning, barely a month before the first known case of the coronavirus disease, that said \"We are not prepared for a pandemic\" due to President Donald Trump's rollbacks of progress in global health security:", "This tweet was in fact genuine, posted to Joe Biden's Twitter account on Oct. 25, 2019. The tweet was prompted by an article published the previous day by The Washington Post detailing a recent Global Health Security Index report which assessed that \"no country — the United States included — is fully prepared to respond to a deliberate or accidental [outbreak] threat with the potential to wipe out humanity.\"", "\"We are not prepared for a pandemic,\" the former vice president wrote, several weeks ahead of COVID-19's being identified as an emerging threat. \"Trump has rolled back progress President Obama and I made to strengthen global health security. We need leadership that builds public trust, focuses on real threats, and mobilizes the world to stop outbreaks before they reach our shores\":", "It is believed that the patient with the first identified case of the COVID-19 coronavirus disease began exhibiting symptoms of that malady on Dec. 1, 2019 — just over five weeks after Biden's tweet about America's lack of pandemic preparedness.", "Sun, Lena H.   \"None of These 195 Countries — The U.S. Included — Is Fully Prepared for a Pandemic, Report Says.\"\r\n    The Washington Post.   24 October 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]