["Last week, Kenya's High Commission to South Africa confirmed to local media that Kenyans were among the victims of arson, looting and physical aggression in the xenophobic attacks. As reported by AFP, the wave of xenophobic violence in South Africa has left 12 people dead and hundreds of foreigners displaced.", "The photograph of Haambote was shared to the Facebook page Group Kenya, in a post that identified him as a Kenyan victim of the South African violence.", "“Xenophobia in SA: Njoroge Gathiru from Murang'a brutalised, wife raped, children murdered, mall looted. Police in SA claims the attacks are justifiable. Kenya's foreign ministry has not issued a statement,” read the caption on the Facebook post, which was shared 100 times and attracted more than 400 comments and reactions. We’ve archived the post here.", "To track down where the photo came from, we carried out a reverse image search on Google which revealed that it first appeared online on July 14, 2019, in an article published by the Zambian Observer. So it was already clear that it was not taken during the recent xenophobic violence in South Africa, which began on September 1.", "The article on the Zambian Observer describes an assault on a man by a machete-wielding gang as he went to visit his wife’s grave. While the picture is not captioned, the article itself bears the byline “Christopher Haambote” and it was written in first person, indicating that the writer was describing his own experience.", "A search on Facebook to locate Mr Haambote led us to this Facebook account, and the profile picture appeared similar to the man seen in the Zambian Observer. We contacted the man on Facebook messenger, and he offered to speak to us via WhatsApp.", "‘Greatly distressed by the fake story’", "Haambote, a 59-year-old farmer, told AFP that a friend had alerted him to the fact that his photograph was circulating in misleading online posts.", "“Some journalist friend of mine informed me...The face is mine but I am a Zambian living in Lusaka bearing the name Christopher Haambote. I have been greatly distressed by the fake story,” Haambote told AFP via WhatsApp message.", "“I almost died on that day and I do not like the fact that people are using my face in such a way. It was a very traumatizing day and it is unfortunate that through the circulation of this picture I am forced to relive the events of the day,” he added.", "AFP also conducted an interview with Haambote via WhatsApp video, where he was wearing the shirt he was attacked in.", "Haambote directed us to a July 14, 2019 Facebook post he wrote about the assault two years previously, noting that the Zambian Observer had lifted his words from his personal account.", "He told us: “That Saturday I was visiting my wife’s tomb to place flowers, a tradition I had developed since her passing more than three years ago. On the same day, there was another burial of an outspoken youthful opposition leader belonging to the (UPND) opposition political party at the same graveyard.  A brawl erupted between UPND supporters and those of Zambia’s ruling political party (the Patriotic Front or PF).”", "Haambote said that though he is an ardent opposition supporter, he had not been attending the burial of the UPND leader when he was caught up in the trouble that flared afterwards.", "This 2017 report by the Lusaka Times notes that Zambian police recorded four assaults at the Leopard Memorial Park in Lusaka between UPND and PF supporters on June 24, 2017. Haambote is listed as being among the four who were beaten up.", "Though the assault was two years ago, Haambote told AFP that he took to Facebook to write about it this year in order to draw a parallel with an attack launched against Zambian justice minister Given Lubinda by PF supporters, as reported here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]