["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Joni Ernst, R-Iowa, gave the 2015 GOP rebuttal to the State of the Union.", "Now that the Republicans have won control in the Senate, one of the biggest questions is what they will do on health care. Fox News host Sean Hannity hammered home one strategy in his post-election analysis Nov. 5.", "Talking to Republican Louisiana U.S. Rep. Bill Cassidy, who is in a runoff with incumbent Democratic Sen. Mary Landrieu, Hannity said, \"Every single candidate like yourself running for office said you will vote to repeal and replace Obamacare.\"", "Later, in an interview with Republican National Committee chairman Reince Priebus, Hannity said, \"Every candidate that won in the Senate promised to repeal and replace Obamacare,\" Hannity said.", "And he made the same point with Cory Gardner, who defeated incumbent Democrat Sen. Mark Udall in Colorado. \"Every Republican that won elections last night, including yourself, you said repeal/replace Obamacare.\"", "All within the span of an hour.", "Here we're focusing on the 10 new Republicans joining the Senate. (The outcomes of races in Alaska and Louisiana are still pending.)", "By and large, Hannity has a point.", "The list", "David Perdue - Georgia: Posted on his campaign website, \"We need to repeal Obamacare and replace it with more affordable free market solutions.\"", "Joni Ernst - Iowa: Posted on her campaign website, \"Joni is staunchly opposed to the Obamacare law. Joni supports immediate action to repeal Obamacare and replace it with common sense, free-market alternatives.\"", "Thom Tillis - North Carolina: Posted on his campaign website, \"As North Carolina’s U.S. senator, Tillis will push for repeal of Obamacare, a balanced budget, and conservative economic policy.\" In the most literal sense, Tillis fails to say he would replace the Affordable Care Act. The closest he comes is a vague promise \"to work to implement private sector solutions to reduce health care costs for North Carolinians.\"", "Ben Sasse - Nebraska: In listing his agenda on his campaign website, Sasse included \"repeal Obamacare.\" Sasse would replace it with a plan that creates a new tax deduction for individually-purchased insurance, allows people to buy insurance across state lines, makes health savings accounts more financially attractive, and reduces federal controls on state Medicaid programs. Notably, on Medicare, Sasse would raise the eligibility age and reduce benefits for the wealthy.", "Mike Rounds - South Dakota: Posted on his campaign website, \"Mike opposes Obamacare and would work to repeal and replace it with market-based, patient-centered solutions.\"", "Tom Cotton - Arkansas: PolitiFact explored Cotton’s opposition to Obamacare and found several statements like this one on his congressional website, \"I will fight to repeal and replace Obamacare with free-market reforms that empower patients and doctors to make health-care decisions. … Obamacare must be repealed entirely.\"", "James Lankford - Oklahoma: Posted to his Senate campaign website \"More than 55 times in the past three years I have voted to repeal, replace or delay the Obamacare law.\" Further down on that page, Lankford wrote, \"I am a co-sponsor of the conservative replacement for Obamacare HR 3590. I am also the author of the only alternative that completely returns the oversight of health care back to the states.\"", "Cory Gardner - Colorado: Posted a petition to repeal Obamacare on his campaign website. The section on that site that summarized Gardner’s record said, \"He supports legislation that repeals this misguided law and replaces it with a solution that allows the purchase of insurance across state lines, bolsters state high-risk pools to provide for those with pre-existing conditions, and enacts badly needed tort reform to reduce medical costs, among other ideas.\"", "Shelley Moore Capito - West Virginia: During an October debate, Capito said, \"What I would vote for is to repeal and replace. I voted for that 50 times but I also recognize that the ACA has some very good things about it.\" Capito went on to say she supported the ban on denying insurance for pre-existing conditions and giving parents the chance to keep kids on their plans until they turn 26.", "Steve Daines - Montana: When Health and Human Services Secretary Kathleen Sebelius announced her resignation, Daines said, \"While Secretary Sebelius’ resignation is a good start, it’s not enough — we need to repeal Obamacare before further harm comes to Montana families, and replace it with Montana-driven reforms that put the patient and their doctor — not government bureaucrats — in charge of health care decisions.\"", "But during an October debate, when Daines was asked about repealing Obamacare, he gave a slightly nuanced response, \"I did not vote against Obamacare 40 times. Should check my record. I voted against it once, to repeal Obamacare. That’s my voting record.\"", "During a June debate, Daines said he supports the law’s ban on denying insurance for pre-existing conditions and giving parents the chance to keep kids on their plans until they turn 26.", "Our ruling", "Hannity said that the new Republican senators campaigned on a platform to repeal and replace Obamacare. All 10 new Republican senators said during their campaigns either that Obamacare should be repealed or that they had voted to repeal it.", "The record on replacement is a little more nuanced. Republicans generally either explicitly say they want to replace Obamacare or more generally talk about health policy changes they support or parts of the Affordable Care Act that they’d like to keep.", "Bottom line, Hannity is clearly right on the trend line. We rate his claim Mostly True.", "UPDATE: After our fact-check published, Sasse's office pointed out additional details Sasse offered in his plan to replace Obamacare. Those comments are now included in this article. The rating remains Mostly True.", "Congressional Quarterly, RNC Chairman Reince Priebus Interviewed on Fox News, Nov. 5, 2014", "CNSNews.com, 100% of Newly Elected GOP Senators Campaigned on Repealing Obamacare, Nov. 5, 2014", "Perdue for U.S. Senate, The Issues", "Joni Ernst for U.S. Senate, The issues", "Thom Tillis for U.S. Senate, Meet Thom", "Sasse for Nebraska, Agenda", "Sasse for Nebraska, The anti-Obamacare recovery plan: A conservative blueprint for a healthier America", "Rounds for Senate, Putting an End to Obamacare", "PolitiFact, Tom Cotton says he wouldn't back changes for those on Medicare, but the ACA repeal he supports would, Oct. 16, 2014", "Ontheissues.org, Tom Cotton on Health Care", "Lankford for Senate, My stance: Healthcare, May 2, 2014", "Lankford for Senate, Health care", "Rep. Steve Daines, Daines statement on HHS Secretary Sebelius resignation, April 14, 2014", "Tea Party Express, Steve Daines for U.S. Senate,", "What the Folly, Election 2014 Montana Senate debate transcript: Question on Obamacare, Oct. 21, 2014", "Missoulian, Senate debate: Walsh urges health care for all; Daines wants 'Obamacare' gone, June 14 , 2014", "C-Span, West Virginia Senate debate, Oct. 7, 2014", "Rep. Shelley Moore Capito, Capito Votes to Repeal President Obama's \"Train Wreck\", May 16, 2013", "Cory Gardner for Senate, Repeal Obamacare", "Cory Gardner for Senate, Cory’s record", "Rep. Cory Gardner, Gardner statement on the \"Repeal of Obamacare Act\",", "PolitiFact, Pro-Democratic group says North Carolina Senate candidate Thom Tillis would let pre-existing condition protections disappear, Feb. 13, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]