["About this rating", "On 30 July 2017, the conservative Truth Division web site reported that the United States' national debt had fallen to a \"surprising\" extent in the seven months since the inauguration of President Donald Trump:", "President Donald Trump and his administration are undoing the government’s rampant spending that occurred under former President Obama’s watch.", "According the U.S. Treasury’s direct record, a surprising amount of money has been saved over the course of seven months. On January 20th, the day Trump was inaugurated, the total debt was $19,947,304,555,212.49. On July 30th, seven short months later, it’s at $19,844,938,940,351.37. Overall the debt has decreased by $102,365,614,861.12.", "We have checked these numbers and set them in context, and found that the national debt did indeed fall by $102 billion between 20 January and the end of July 2017. This decline is also historically remarkable, in both absolute and percentage terms. This six-month fall in the national debt is also significant when measured against the size of the overall economy.", "National debt — the basics", "The national debt is, in brief, the total value of what the federal government owes, and is made up of accumulated annual deficits (when the government spends more than it receives in taxes and other income). It is made up of \"public debt\" and \"intragovernmental holdings.\" Public debt is, essentially, debt held by sources outside the central government. Intragovernmental holdings are debts between agencies within the federal government, in the form of government trust funds, such as Social Security trust funds.", "National debt — the numbers", "According to figures published by the Treasury Department's Bureau of Fiscal Services on the TreasuryDirect web site, the national debt was $19.84 trillion on 27 July 2017 (not 30 July, as stated by Truth Division. On 20 January, it was $19.95 trillion.", "That shows a fall of $102.37 billion, or 0.51 percent, over a period of 131 business days. To set that in context, we analyzed national debt data stretching back to 12 July 1993, and examined every 131-day period in the last 24 years. You can download a spreadsheet containing all the relevant data here.", "Debt-to-GDP ratio", "The national debt, however, is best viewed with reference to the overall economy. If two countries have about the same national debt, the one with the smaller economy will likely be more constrained in its spending, whereas the larger economy — despite having the same level of debt — will be less affected in terms of economic and fiscal policy.", "A good way of checking this is to compare the size of the debt to the size of the economy, measured as GDP (gross domestic product). GDP is the combined market value of all goods and services produced in a given jurisdiction (in this case, the United States). This comparison between the size of the national debt and the size of the economy is known as the debt-to-GDP ratio.", "While the Treasury Department publishes the national debt for every business day, GDP is only published on a quarterly basis (once every three months). In order to compare the debt-to-GDP ratio on 27 July with the same figure on Inauguration Day, we have to get a little bit creative.", "For example, we know that the United States GDP was $18.9 trillion at the end of December 2016 (the end of the fourth quarter), according to figures published by the Bureau of Economic Analysis.", "We also know that the national debt on 30 December 2016 was $19.98 trillion, so the estimated debt-to-GDP ratio on that date was 105.67 percent. In other words, the debts of the United States federal government were 5.67 percent bigger than the size of the Unites States economy (when measured by GDP).", "At the end of the first quarter of 2017 (the end of March), GDP was $19.06 trillion. And we know that on 31 March, the national debt was $19.85 trillion, meaning the debt-to-GDP ratio was 104.14 percent — a healthier number than at the end of December. But to estimate GDP for all the days in between 30 December and 31 March (including 20 January, Inauguration Day) we have to cheat a little bit. You can read more about our methodology by downloading this spreadsheet, but here's what our estimates revealed:", "Causes", "The Truth Division, a conservative, openly pro-Trump web site, clearly attributes this decline in the national debt to the president, claiming he and his administration are \"undoing the government's rampant spending\" and \"keeping his promises regarding fiscal responsibility\". However, the article does not cite any examples of actions taken by Donald Trump which would support this conclusion.", "Jared Bernstein, a senior fellow at the Center on Budget and Policy Priorities and former economic adviser to Vice President Joe Biden, dismissed any claims that President Trump is responsible:", "Trump hasn't legislated anything that would have any impact on the fiscal accounts, so it simply doesn't make sense on the face it.", "Instead, Bernstein told us, the cause of the drop in the debt is simple — the federal debt ceiling that has been in place since March 2017.", "If you look at a plot of the total debt right now, it's holding steady at the limit, because to go over the limit is unconstitutional. So you either have to engage in extraordinary measures or eventually default, and the latter is unimaginable so right now Treasury is engaged in the former.", "That is, they are delaying or suspending various payments that need to be made, particularly within some of their intra-governmental accounts... By those measures, they can hold the national debt where it is for a certain amount of time.", "Eventually, Bernstein says, the debt ceiling will have to be lifted, and the payments that had been delayed will cause the national debt to increase once again.", "That pattern can be seen in this chart, which shows the national debt from January 2011 up to the end of July 2017. There are four flat lines showing four periods during which the debt ceiling was frozen: from May to August 2011; May to October 2013; March to October 2015; and the ongoing period since March 2017.", "Conclusion", "The Truth Division article accurately describes the extent to which the national debt fell between the inauguration of Donald Trump in January 2017 and the end of July of the same year. And it rightly describes this fall as \"surprising\", since it ranks among the very largest 131-day declines in the national debt since July 1993, both in absolute and percentage terms.", "Similarly, the decline in both components of the national debt — public debt and intragovernmental holdings — was highly significant between 20 January and 27 July 2017, both in absolute and percentage terms, and as we have shown, the national debt has fallen by an estimated 2.25 percent since Inauguration Day — even when measured against the size of the overall Unites States economy. Whether or not any actions or decisions made by Donald Trump have caused or contributed to these historically remarkable declines in the debt is a question that goes beyond the scope of this particular fact check.", "Unfortunately, the  national debt resumed its upward march in August 2017 and by mid-August 2018 stood at about $21.3 trillion (up $1.4 trillion since Inauguration Day), so the early 2017 drop has not proved to be a long-term trend.", "A spreadsheet containing all the data relevant to this article can be downloaded here.", "Bureau of Fiscal Services.    \"Frequently Asked Questions About the Public Debt\".\r\n  TreasuryDirect.gov.    1 April 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]