["By Lori Robertson", "Posted on October 30, 2020", "In a campaign rally in Wisconsin, President Donald Trump falsely claimed the state’s dairy farms were “decimated” under the Obama/Biden administration but “now … are doing very well,” and he greatly overstated the potential impact of the new trade agreement with Canada and Mexico.", "Dairy and agricultural market experts told us changes in the industry, including in milk prices, overproduction and consolidation, under both administrations largely have been due to market forces.", "Andrew M. Novaković, a professor emeritus of agricultural economics at Cornell University, said that cyclical milk prices, which hit a peak in 2014 and then declined, “occur almost entirely due to market forces. Presidents Obama and Trump deserve little if any credit or blame for these oscillations.”", "A consolidation trend — of fewer but bigger dairy farms — has been happening “for quite some time now,” Chad Hart, a professor of economics and crop markets specialist at Iowa State University, told us in a phone interview. A decline in the number of producers continued under the Trump administration, he said.", "It’s true that dairy farmers generally applauded the new United States-Mexico-Canada trade agreement, which went into effect on July 1, but Trump claimed “our dairy exports to Canada are expected to surge by at least 100%.” We found no support for that figure, and the president’s campaign didn’t respond to our query.", "The International Trade Commission estimated dairy exports to Canada would increase by 43.8%, while dairy imports from Canada would go up 139.5% under the agreement, which would take six years to largely implement. The ITC described the overall impact as “small.”", "Trump made his claims in an Oct. 27 rally in West Salem, Wisconsin.", "Trump, Oct. 27: Wisconsin dairy farms were decimated under the Obama and Biden nightmare. They were decimated, and now you are doing very well, and you know Canada took advantage of you very much. You know that right? Not anymore. Under the USMCA our dairy exports to Canada are expected to surge by at least 100%.", "Since the mid-1990s, milk prices “have gone from high to low back to high on a roughly 3-year cycle,” Novaković told us in an email. “Late 2014, in the middle of President Obama’s time in office, prices hit an amazing peak for farmers. As these things do, what went up came down and from 2015 to mid-2019 milk prices were in the doldrums.”", "When prices hit that high point in 2014, farmers reacted by producing more milk, which then resulted in too much milk.", "Mike Hutjens, professor emeritus at the University of Illinois animal sciences department, told us that after the “record high milk prices” in 2014, “dairy farms expanded and milked more cows leading to surplus milk which reduced profitability in 2015. As a result, 2016, 2017, 2018, and first half of 2019 results in marginal profitability depending on herd size, management, and milk yield.”", "Here’s what happened to milk prices in the U.S. starting in 2011, according to data from the U.S. Department of Agriculture.", "“Prices have been extremely low, production’s been extremely high,” Hart said, creating “financial hardships” in the industry.", "Despite the low prices, production in Wisconsin in 2016, President Barack Obama’s last year in office, set records, according to a report by the state Department of Agriculture, under Republican Gov. Scott Walker. “Wisconsin continues to maintain its leadership as America’s Dairyland with more dairy farms than any other state,” the report said. “In 2016, Wisconsin surpassed 30 billion pounds of milk production in a single year for the first time. The state’s dairy processors set a record of their own, producing 3.2 billion pounds of cheese.”", "Last year, under Trump, Wisconsin produced 3.36 billion pounds of cheese — an increase of 5% since 2016. It produced 30.6 billion pounds of milk in 2019 – an increase of 1.6%.", "Hutjens told us in a phone interview that there’s enough milk in the U.S. to feed all of Canada many times over. The amount of milk needed to feed its entire population is only one-tenth of the U.S. milk supply. “We have more cows in this country than we need and they’re milking very well,” he said.", "Overproduction, Hart said, is a global issue.", "“We have continued to see very strong dairy production worldwide that has led to low global prices for milk and is driving significant consolidation,” Hart said, mentioning Australia and New Zealand as two active dairy trade countries seeing the same type of trend toward larger but fewer farms.", "In 2019, 10% of Wisconsin’s dairy farms closed, a record amount, breaking the previous record set in 2018.", "The number of cows has held “fairly steady,” Hart said, but there are fewer farmers. (Milk cows in Wisconsin numbered 1,257,000 in 2009, 1,279,000 in 2016 and 1,267,000 in 2019, according to state data.) Smaller farmers have sold their cows “to a neighbor down the road whose herd has gotten larger.”", "“That’s where you could argue there’s been some decimation,” he said. “Was that related to the Obama/Biden administration? … The answer is no.”", "“The decline in Wisconsin dairy farm numbers, even as production increases in total, is a long-standing phenomenon, with few if any notable ‘kinks’ in the curves,” Novaković said. “This is really no different for the national numbers and for most other states.”", "He shared a chart that shows a long-term trend dating back to the 1930s of production rising, while the number of farms have dropped.", "We recreated part of the chart, using 2003-2019 USDA data for milk production and milk cow herds. Hart told us he would equate each herd to a producer.", "“Trump is not correct,” Hutjens told us of the “decimated” claim. The industry “was supply and demand driven based on a capitalism program” under Obama.", "Milk prices began an upswing in 2019, dropped considerably earlier this year as the COVID-19 pandemic took hold, and have rebounded since.", "The USMCA created more opportunity for U.S. dairy farmers to export products to Canada. Both countries made concessions, Hart explained, but the concessions were larger from the Canadian side.", "Both countries agreed to higher quotas of dairy imports, with the volumes increasing quickly in the first six years. In his Oct. 27 rally, Trump claimed “we got rid of the tariffs,” but tariffs do still exist. Even before the USMCA, some dairy exports to Canada could enter duty-free, but tariffs would kick in above a certain threshold. The new trade agreement raises such thresholds.", "Back in April 2019, Trump said this in Green Bay: “The International Trade Commission recently announced that under the USMCA American dairy exports to Canada are expected to surge by more than 50%, OK?”", "A year-and-a-half later, in Waukesha, Wisconsin, Trump increased his trade figure. “Under the USMCA our dairy exports to Canada — are expected to surge by 50 to 100 percent, and very quickly,” he said in the Oct. 24 rally. (Here, too, he falsely claimed the state’s dairy farms were “decimated” under the previous administration.)", "Three days later, Trump upped the figure again — to “at least 100%.” We found no support for that amount, and the experts we consulted knew of no such figure, either.", "In an April 2019 report, the ITC did estimate a sizable percentage increase in dairy exports to Canada, and in imports from Canada, in what it called “upper bound” figures.", "“The economy-wide modeling results estimate a $226.8 million (0.1 percent) gain in total U.S. dairy product output from USMCA when compared to the baseline,” the ITC report said. “U.S. dairy exports would be $314.5 million (7.1 percent) above the baseline, with an increase of $227.0 million (43.8 percent) in U.S. exports to Canada. Total U.S. imports would be $227.9 million (9.0 percent) higher, with an additional $161.7 million (139.5 percent) of imports from Canada.” That’s over a six-year implementation window.", "Despite the large percentage changes, the ITC described the overall estimated impact as “small” in terms of increased market access and exports, “contributing to limited positive impacts on dairy production and employment.”", "So, Trump was close to correct back in April 2019 when he used the “more than 50%” figure for export increases to Canada, but he then doubled the figure in his recent Wisconsin rallies.", "The USMCA, “which really only has been in effect since August, was hugely oversold to begin with,” Novaković said. “Basically every US dairy market analyst said it would have a positive but small benefit for US dairy product manufacturers, with an emphasis on small.”", "If every provision is fully implemented, he said, the balance of trade for dairy between the two countries “would scarcely wiggle because we agreed to buy as much as they did.”", "Hart noted that one of the highlights of the USMCA for the U.S. dairy industry is that it didn’t do any harm to the Mexico market, which is a much larger dairy market for the U.S. “Even if we were to reach 100% growth,” the figure Trump used, “Mexico would still be a bigger market for us than Canada,” Hart said.", "The ITC report shows total 2017 dairy exports were $4.6 billion, with $1.3 billion of that exports to Mexico and $442 million exports to Canada. (The U.S. imported $2.3 billion in dairy products that year, with only $93 million coming from Mexico and $125 million from Canada.)", "Hutjens told us the new trade agreement is “much better” in regards to trade with Canada, but so far, we’re “not seeing much impact,” because Canada has yet to implement the provisions.", "“Canada is holding off on implementing the agreement even though it went into effect legally in August,” Novaković said. “Canadian dairy farmers have been furious with [Prime Minister Justin] Trudeau and give him plenty of reason to drag his feet. The pandemic and closed border contribute to making it a bit easier to do the slow walk on the new deal.”", "In his Oct. 27 rally, Trump said that “Canada treated us badly, 287% tariff. Can you believe that? … I learned about that I said, ‘It’s time to get out of that crazy NAFTA.'”", "As we’ve explained before, high tariffs in Canada apply after dairy imports reach a certain threshold. NAFTA — the North American Free Trade Agreement — didn’t address the dairy trade. It didn’t create high tariffs but left the two countries’ tariffs or quotas in place. This was by mutual agreement, Novaković told us.", "“The original NAFTA agreement was approved at a time when both the US and Canada have very protectionist policies for their dairy industries,” he said. “Both countries readily agreed to continue very tight restrictions on trade in dairy products. … It wasn’t some big fight we lost.”", "The USMCA still has restrictions but increased the trade allowed on both sides, as we explained.", "Both Novaković and Hutjens noted that farmers in the U.S., including dairy farmers, are now receiving large subsidies from the Trump administration, first through payments designed to blunt the impact of lost exports under Trump’s trade war and now through pandemic-relief payments.", "“Dairy farmers and grain farmers can attribute 1/3 of their profits in 2020” to direct payments from the government, Hutjens said. Novaković put the farm subsidy figure at one-third to one-half of farm income.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Swing State Watch is an occasional series about false and misleading political messages in key states that will help decide the 2020 presidential election.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]