["“This is What Propaganda and conditioning looks like. There is no *Office* of president elect,” the post said after Trump made unsubstantiated allegations of electoral fraud and refused to concede.", "“This is not a briefing, its a mans opinions. This is called Arrogation. Its designed to make you think someone has authority because it looks like they do,” the November 17, 2020 post continues, adding that Joe Biden was never certified elected in any US states.", "According to a search using social media analysis tool CrowdTangle, posts shared the claim as early as November 10, 2020, here. It has also appeared more recently, including here.", "Although the term “Office of the President-elect” is an informal title, it has been commonly used during transitions of government in the US.", "These two AFP photos, for example, show how Joe Biden was not the first president-elect to use the title at press conferences during the transition period between a November election and January inauguration.", "Likewise, Barack Obama’s presidential transition website included the title, on the top left of the page here. The same phrasing can also be found throughout the Obama-Biden official transition memo, here and the Trump-Pence memo, here:", "The transition websites for Obama, change.gov and Trump, greatagain.gov both became operational the day after Election Day.", "The office of the president elect “is entirely a ‘common’ and ‘informal’ term,” John P Burke, a professor of political science at the University of Vermont, and the author of books on presidential transitions, told AFP via email. “I doubt anybody complained about the use of the term in the past,” he added.", "In a related claim, on November 15 a tweet shared more than 25,000 times said that the US “Congress made an official statement” saying that Joe Biden was not president-elect. This is inaccurate.", "The evidence advanced in the tweet was a letter sent on November 13 by Republican Congressman Jody Hice, who is Ranking Member of the House Subcommittee on Government Operations but does not represent the whole Congress.", "Hice’s letter to the General Services Administration said that, because of factors including the Trump campaign’s legal challenges over supposed voting irregularities, and lack of a concession, “there is no apparent President-Elect.”", "A subsequent letter on November 19 signed by several House Democrats, including Subcommittee on Government Operations Chairman Gerry Connolly, asked GSA Administrator Emily Murphy to unblock millions of dollars for use in the transition process.", "“At this stage, there is no conceivable argument that Joe Biden and Kamala Harris are not ‘the apparent successful candidates for the office of President and Vice President,’” they wrote.", "The Democrats questioned why there had been a delay in the process when Biden “has now collected more votes than any other candidate for president in history” and won a clear majority of Electoral College votes.", "The GSA does not pick the election winner, but “ascertains the apparent successful candidate once a winner is clear,” the agency’s website says.", "GSA chief Murphy finally released a letter to Joe Biden on November 23 saying she had ascertained Biden to be the “apparent president-elect” to whom transition resources would be made available.“", "She cited “recent developments involving legal challenges and certifications of election results” for her decision. It came after Trump’s team repeatedly failed to convince judges that there were widespread irregularities in the voting process.", "Although at the time the first posts were shared, key states had not officially certified their results, Michigan did so on the day Murphy endorsed the transition, and Pennsylvania and Nevada certified the results of their state ballots a day later.", "The GSA’s  letter came more than two weeks after the Center for Presidential Transition Advisory Board, constituted equally of Democratic and Republican members, also formally recognized Biden as president-elect.", "“While there will be legal disputes requiring adjudication, the outcome is sufficiently clear that the transition process must now begin,” they wrote.", "AFP Fact Check has debunked dozens of false and misleading claims about the US 2020 presidential election, available here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]