["About this rating", "On 22 May 2016, the web site HeavierMetal.net published an article reporting that the American heavy metal band  Lamb of God had been given an award for \"excellence in faith outreach\" by mega-church pastor Joel Osteen, who mistakenly believed them to be a Christian band based on their name alone:", "Lamb of God, who was previously named ‘Burn the Priest’, accepted the “excellence in faith outreach” award from mega-church pastor Joel Osteen, who judging by their name, believed the band to be a Christian band. It was obvious by those in attendance that Osteen was not familiar with the group, having referred to them as a ‘well known country band’.", "There was no truth to this article. HeavierMetal.net is the satirical sister site of the music news site RockFeed.Net, and while HeavierMetal.net doesn't explicitly state that its content is satirical in nature, a disclaimer on the site does provide a few hints about the humorous scope of its material", "We often break news stories several years before anyone else reports them, thus sometimes causing some to have a difficult time accepting the truth.", "Our staff works around the clock earning well below minimum wage to bring you the stories you care about, regardless of whether or not anyone else is reporting on them.", "We’re sorry you’re mad about one of the stories we wrote — but we didn’t make it this far by caring about what you think of us. We must report the news so that people who only read headlines can remain informed!", "If you’re still reading this far and can’t figure out if what you read was a joke or not — you should probably reconsider using the internet.", "HeavierMetal.net was also responsible for spreading fake news stories about Rob Zombie's getting kicked out of the Academy Awards ceremony, and Metallica singer James Hetfield's releasing a country album.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]