["About this rating", "In 2020, as much of the world started adhering to new social distancing guidelines to combat the spread of a new strain of coronavirus, photographs started to circulate on social media that supposedly showed how nature was re-emerging in the absence of humans. One such image supposedly showed a flock of flamingos crowding a canal in Venice, Italy:", "This is not a genuine photograph. Although flamingos can be found in Italy, the above-displayed image is a digital artwork imagining flamingos swimming in the famous canals of Venice.", "This image was created by Kristina Makeeva, a digital artist who goes by the handle @hobopeeba on Instagram. This image was posted to that Instagram page on April 24, 2020, along with a caption identifying the image as \"art.\"", "Makeeva wrote: \"Art 2020 ▪️ when people stay at home - city is filled with other residents.\"", "While Makeeva labeled this image as \"Art,\" many people who viewed the image on Instagram were still curious if this was a real photograph. Makeeva responded to many of these commentators and informed them that \"no,\" this was not a real photograph:", "The Instagram page for @Hobopeeba is full of similarly fantastical images. The biography for this page also notes that Makeeva is a \"Photographer & cat & engineer-wizard from Moscow\" and a \"Modern converter from ordinary to magic.\"", "Interestingly, this image went viral as a similar, but real, scene played out in Mumbai. In mid-April 2020, an estimated 150,000 flamingos were spotted off the coast of Mumbai.", "Time magazine reported:", "As people around the world stay inside to fight the spread of coronavirus, wild animals have begun to enjoy the newfound space. That appears to be what’s happened in the metropolitan region of Mumbai, India, where a record-breaking number of flamingos have migrated, painting the wetlands pink, according to local reports.", "The Bombay Natural History Society (BNHS) estimates that around 25% more flamingos have migrated to the region compared to last year, likely caused by the decrease in human activity, the Hindustan Times reports. The Science Times calculates around 150,000 flamingos have come to the area.", "Here's a photograph from Getty Images showing this large flock of flamingos in India:", "Flamingos are seen in huge numbers behind NRI colony in Talawe wetland, Nerul, during nationwide lockdown due to Coronavirus, on April 18, 2020 in Mumbai, India. (Photo by Pratik Chorge/Hindustan Times via Getty Images)", "Carlisle, Madeleine.   \"Over 100,000 Flamingos Reportedly Descend on Mumbai Amid India's Strict Coronavirus Lockdown.\"\r\n    Time.   2 May 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]