["By Lori Robertson", "Posted on August 5, 2016", "Donald Trump wrongly said that “they’re shooting our police at record levels.” The record for police firearm deaths, and deaths of officers overall, in recent decades was set in the 1970s.", "He went on to say those shootings were up 50 percent or “much higher than that from last year.” That’s true. According to figures from the National Law Enforcement Officers Memorial Fund, there were 32 firearm fatalities of law enforcement officers as of July 20 this year, compared with 18 at that point in 2015. That’s an increase of 78 percent.", "But the highest number of firearm-related fatalities at the midpoint of the year occurred in 1973, when 84 law enforcement officers were killed with a gun. These numbers come from NLEOMF’s midyear report for 2016.", "Trump made the claims in a rally in Portland, Maine, on Aug. 4:", "Trump, Aug. 4: … they’re shooting our police at record levels. Fifty percent up, and I said 50 percent, it’s actually much higher than that from last year.", "The number of shooting deaths of officers in 2016 — a year in which five officers were killed by a sniper in Dallas and three officers were shot and killed in Baton Rouge the same month — is substantially higher than the number for the first half of 2015. But as we said, it’s not a “record level.”", "The NLEOMF report also gives averages for firearm-related deaths at the midyear point by decade. That average for the 1970s was 63; in the 1980s, it was 44. By the 2010 decade, it had dropped to an average of 26. So, the 32 firearm fatalities for the first half of 2016 are higher than the average for the 2010 decade, but lower than what we’ve seen in decades past.", "As we wrote the last time we addressed a Trump claim about police officer deaths, the 1970s were an especially deadly time for law enforcement. In looking at deaths from all causes since 1956, the highest number occurred in 1974, with 280 law enforcement deaths.", "The National Law Enforcement Officers Memorial Fund also provided us with data going back to 1920 on the yearly felonious deaths of officers — deaths involving a criminal act. That would include shootings, but also deaths involving other weapons, or vehicle crashes or strikings. As the chart below shows, the record year for felonious deaths was actually 1930, with 196 deaths. The yearly numbers went down for several decades and then rose again in the 1970s, to 170 in 1973, declining again after that. A spike occurred in 2001 due to the Sept. 11 terrorist attacks. Through July 20, 2016, there have been 46 felonious deaths this year.", "https://www.sharethefacts.co/share/372a74c6-2548-437a-9e7f-025ced8da7f1", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]