["By Rem Rieder, Jessica McDonald, Robert Farley, Lori Robertson and D'Angelo Gore", "Posted on September 2, 2020", "In an interview with Fox News’ Laura Ingraham that aired over two days, President Donald Trump made several false, misleading and unsubstantiated claims:", "And there was more: The president repeated falsehoods about COVID-19, ventilators and low-income housing in the suburbs.", "The interview aired on Aug. 31 and Sept. 1.", "Trump falsely took credit for bringing in the National Guard to help quell violent protests in Kenosha, Wisconsin, after Jacob Blake, a Black man, was shot in the back by police seven times on Aug. 23. In fact, Wisconsin Gov. Tony Evers activated the guard early in the morning of Aug. 24, well before Trump weighed in.", "Trump: We could solve that problem [Portland] quickly. Like I did in Kenosha. You know, Kenosha went through three or four days. You wouldn’t have a Kenosha right now. We demanded that they send in the National Guard. Called the governor. And in all fairness, the governor did it. Not enough, but it was enough to put it out. And we ultimately put in where we had 1,000 people and we put it out quickly. You wouldn’t have Kenosha right now.", "Trump also tweeted on Aug. 31 that he was the one who brought in the guard.", "If I didn’t INSIST on having the National Guard activate and go into Kenosha, Wisconsin, there would be no Kenosha right now. Also, there would have been great death and injury. I want to thank Law Enforcement and the National Guard. I will see you on Tuesday!", "— Donald J. Trump (@realDonaldTrump) August 31, 2020", "But Evers had acted quickly to activate the guard. Trump had nothing to do with it.", "Kenosha County Executive Jim Kreuser immediately took issue with Trump’s tweet. “That is a false statement,” Kreuser said at a press conference Aug. 31, adding, “and for someone to say that we wouldn’t exist but for their actions, I believe it to be false.”", "The Blake shooting took place around 5:30 p.m. Aug. 23. As the protests began that evening, local officials contacted Evers’ office, Maj. Gen. Paul Knapp, adjutant general of the Wisconsin National Guard, told the Kenosha News. “Shortly thereafter when the unrest started to occur, local authorities here made contact with the governor’s office as early as that evening,” Knapp said.", "Knapp said that at 3:09 a.m. Aug. 24 he was told to activate the guard’s Quick Reaction Force, a force of 125 soldiers who can mobilize within 12 hours. They were in Kenosha that day.", "The governor’s office said in a statement Aug. 24 that Evers had “authorized the Wisconsin National Guard to support local law enforcement in Kenosha County to help protect critical infrastructure and assist in maintaining public safety and the ability of individuals to peacefully protest.” By Aug. 25 there were 250 guard members on the ground, according to Knapp.", "So when Trump tweeted on Aug. 25 that the “Governor should call in the National Guard in Wisconsin,” the guardsmen had already been deployed.", "Governor should call in the National Guard in Wisconsin. It is ready, willing, and more than able. End problem FAST!", "— Donald J. Trump (@realDonaldTrump) August 26, 2020", "On Aug. 26 Evers authorized another 500 guardsmen for Kenosha. That same day, Trump fired off another false tweet: “TODAY, I will be sending federal law enforcement and the National Guard to Kenosha, WI to restore LAW and ORDER!”", "On Aug. 27, Evers announced that additional guardsmen would be arriving in Kenosha from Michigan, Arizona and Alabama.", "Neither the White House nor the Trump campaign responded to our request for comment.", "In remarks Sept. 1 before boarding Air Force One for a trip to Kenosha, Trump said, “And it all stopped immediately upon the National Guard’s arrival” in Kenosha. But that wasn’t the case. While the first guardsmen arrived on Aug. 24, the tumult continued on the evenings of Aug. 24 and 25. It was on Aug. 25 that 17-year-old Kyle Rittenhouse, of Antioch, Illinois, allegedly fatally shot two people and wounded a third.", "Before boarding the plane, Trump also said without evidence that he saw “anarchists” trying to break into the house of Kenosha Mayor John Antaramian. That never happened, the mayor said.", "Trump, Sept. 1: I saw last night where these radical anarchists were trying to get into the mayor’s house, and lots of bad things were happening to this poor, foolish, very stupid mayor. … They had tremendous numbers of people, really, harassing him horribly, and, I guess, trying to break into his house.", "Antaramian said in a statement there were no angry mobs.", "Antaramian, Sept. 1: I want to dispel the President’s statement that angry mobs were trying to get into my house last night. Nothing of the sort happened. The statement in the President’s video is completely false.", "Near the end of the first day of Ingraham’s aired interview, Trump brought up New York and COVID-19, blaming the governor of the state for coronavirus deaths in nursing homes and incorrectly stating that if New York could be excluded from U.S. statistics, America would have “the best numbers in the world.”", "Trump: [Cuomo] killed 11,000 people with bad decisions on nursing homes. He’s the number one state in the country by far for death. I mean, probably in the whole world, for death. You take New York out of the equation, I think we have among the best numbers anyway, but you take New York, we have the best numbers in the world, countrywide.", "With respect to Cuomo, Trump is referring to the governor’s controversial March 25 advisory that stated that no nursing home resident “shall be denied re-admission or admission … based on a confirmed or suspected diagnosis of COVID-19” and that nursing homes are “prohibited from requiring a hospitalized resident who is determined medically stable to be tested for COVID-19 prior to admission or readmission.”", "Critics have argued that the policy allowed patients returning from the hospital to seed infections in nursing homes, leading to a high number of avoidable deaths.", "In May, Cuomo rescinded the policy with an executive order that required hospitals to release patients to nursing homes only after a negative COVID-19 test.", "As a Kaiser Health News fact-check article explains, the motivation for the original policy may have been to avoid overwhelming hospitals, but many nursing homes interpreted the directive to mean that they could not refuse infected patients, even though that’s not strictly what the rules said.", "Cuomo has been defensive about the policy, going so far as to issue a report from the New York State Department of Health in July that concluded the data indicate infections in nursing homes came from staff members, not from returning residents.", "According to the report, which was revised on July 20, 98% of nursing homes that received a returning patient already had a suspected or confirmed COVID-19 case in the facility, and the peak of nursing home deaths in early April is consistent with the timing of the peak of staff infections. The report also argued that by the time patients were readmitted to a nursing home, they would no longer be infectious.", "Many outside experts, however, did not think the report could rule out an effect of the directive on fatalities. “I don’t think this report convincingly demonstrates that the policy was not another important driver of deaths,” City University of New York epidemiologist Denis Nash told ProPublica.", "At the same time, Kaiser Health News reported that experts agreed with the general idea that staffers and possibly visitors were the primary drivers of death within the state’s nursing homes.", "“Based on the timeline of the policy and deaths in the city, it is very unlikely that policy contributed to thousands of deaths,” Columbia University epidemiologist Rupak Shivakoti told KHN.", "That rebuts the president’s claim that Cuomo’s “bad decisions” caused “11,000 deaths.”", "The state reports only 6,639 confirmed and presumed deaths in nursing homes and adult care facilities through Sept. 1, although that tally is widely believed to be an undercount, since it only includes deaths that occurred in a facility, not residents who died in the hospital, for example.", "The White House did not explain the source of the 11,000 number, but that estimate has been used in news reports to describe how far off New York’s death count might be. An Aug. 11 Associated Press story explained that the Kaiser Family Foundation found that for the 43 states with data, nursing home deaths on average accounted for 44% of all COVID-19 deaths (the percentage has since fallen to 43% for 45 states). Applying that percentage to New York, according to the article, “would translate to more than 11,000 nursing home deaths.”", "Also, the president’s related claim that New York entirely skews the U.S. mortality figures is off-base — and reminiscent of his false claim last month that removing the New York tri-state area would give America a better per-capita death rate than “our peer nations of Western Europe.”", "While it’s true that New York has more raw COVID-19 deaths than any other state, it’s second — behind New Jersey — in terms of deaths per capita. And removing the state from national statistics does not give the U.S. the “best numbers in the world.”", "Data from the Centers for Disease Control and Prevention show the state reported a total of 32,662 COVID-19 deaths as of Sept. 2, or 168 deaths per 100,000 people, using 2019 U.S. Census Bureau figures.", "Excluding New York from the U.S. totals — a dubious prospect, given the unfairness to other nations —  improves America’s relative standing on two mortality metrics, but only slightly.", "On per-capita deaths, the U.S. falls from 56 deaths per 100,000 to 49. On Johns Hopkins University’s ranking of 169 countries on per-capita deaths, that moves America from the 11th highest spot to the 12th, better than the one additional country of Mexico.", "On the case fatality rate, or the percentage of people who are known to be infected who die, the U.S. drops from 3.0% to 2.7%. That’s enough to improve from the 55th highest mortality rate to tying with Chile, Moldova, Austria, Estonia and Uruguay for the 66th highest spot, per Johns Hopkins’ list. But it’s still worse than around 60% of the world.", "Neither change benefits the U.S. all that much, and certainly not to the degree that Trump claims. Moreover, even removing New York’s death toll from the U.S. total, America still has the highest number of COVID-19 deaths than any other nation.", "Listing his accomplishments on the military, Trump said, “I’m bringing many of the troops home and most of the troops home.” But the number of troops in Afghanistan, Iraq and Syria is currently nearly the same as it was in the last month under Obama. And the overall number of overseas troops is only slightly smaller.", "Trump: On the military, I’ve accomplished, first of all I’m bringing many of the troops home and most of the troops home, even cutting down Germany. Okay?", "Trump’s comment on Fox News was similar to one he made at the Republican National Convention, when he said, “Unlike previous administrations I have kept America out of new wars, and our troops are coming home.” Those kinds of sentiments have been a familiar refrain during Trump’s presidency, such as when he said during a cabinet meeting in October 2019, “We’re bringing our troops back home. I got elected on bringing our soldiers back home.”", "But the president hasn’t made much headway in reducing the number of U.S. troops in conflict zones, or overseas in general.", "According to the Pentagon’s Defense Manpower Data Center, there were about 15,000 troops total in Afghanistan, Iraq and Syria on Dec. 31, 2016, near the end of the Obama presidency (9,294 in Afghanistan, 5,540 in Iraq and 204 in Syria). A spokesman for the Department of Defense told us, “U.S. force levels in Afghanistan currently remain in the mid-8,000s with the goal to reduce that number to less than 5,000 by the end of November. U.S. forces in Iraq number approximately 5,200 and in Syria number approximately 500.” That puts the current levels at about 14,200, or about 5% lower than when Obama left office.", "Trump said recently that he expects the number of troops in Afghanistan to be cut to under 5,000 by November, but that hasn’t happened yet.", "The total number of overseas troops was about 199,000 in the last month of the Obama administration, according to the Defense Manpower Data Center. The most recently available figures from the DMDC in June put the number at 171,025. But that figure comes with a large asterisk. Beginning in December 2017, the Trump administration stopped reporting the troop levels in Afghanistan, Iraq and Syria in its DMDC data for overseas troop levels. A Pentagon spokesperson told us those figures are withheld for “security purposes.”", "But as we said, DoD provided us approximate figures for those three countries. Adding the approximated figures to the reported figure for the remaining overseas troop levels, the total comes to about 185,000. That’s about a 7% decrease from the final Obama levels.", "Citing Pentagon leaders, the Washington Post reported in late July that Trump was making a concerted push to significantly reduce overseas troop levels by Election Day in November. But despite the president’s efforts to fulfill his 2016 campaign promise to significantly reduce the number of U.S. troops serving overseas, the article notes, “Trump has been stymied at virtually every turn” as members of his administration and military leaders “have talked Trump out of specific withdrawals or employed delaying tactics.”", "Trump recently approved plans to reduce the number of troops in Germany by 9,500 (from about 34,500), but not all of them will be coming home. According to Joseph Parent, a professor of international relations at the University of Notre Dame, roughly half of them are being redeployed within Europe, and the other half would return to the U.S.  — “but that has not yet been approved.”", "While Trump has cut overseas troop levels a bit, and promises more by November, by any measure, it is a stretch to claim, as Trump did, that he is bringing “most of the troops home.”", "In Michigan, the stay-at-home order was lifted on June 1, though the state ordered a stop to indoor service at bars in July. In North Carolina, some businesses began reopening in May, and the state will enter a new phase of reopening on Sept. 4. Yet Trump claimed both states were “closed.”", "He further distorted the facts in claiming: “These states that are closed are run by Democrats.” Although Trump used the term “closed,” no states are any longer under stay-at-home orders. Most states have restrictions, though. According to a Washington Post analysis, updated Aug. 28, only one state has “major” restrictions – California, which has a Democratic governor. And 16 more states (including Washington, D.C.) have “moderate” restrictions, including three with Republican governors.", "Among the 24 states that have paused or reversed their reopenings, 11 have Republican governors and 13 have Democratic governors, according to a New York Times analysis updated Sept. 1.", "Trump: Michigan is closed. All of these states that are closed. North Carolina is closed. These states that are closed are run by Democrats. And the reason they’re closed is because we have an election on Nov. 3, and they don’t want the opening of the states and they don’t want the income. They want to keep it nice and closed.", "The president exaggerated the situation in Michigan and North Carolina and floated a political motivation for state closures that falls apart upon a closer look at state actions.", "On June 1, Michigan Gov. Gretchen Whitmer, a Democrat, lifted the state stay-at-home order, allowing some businesses to reopen, such as retailers and restaurants at limited capacity. A month later, however, she ordered indoor service at bars in the lower part of the state closed, after a cluster of cases were linked to one East Lansing bar in late June. By early July, 174 cases were linked to the bar. Whitmer later extended the indoor-bar-closure to the rest of the state, for bars that get more than 70% of their sales from alcohol.", "Michigan is in what the New York Times labels a “reversing” phase. Other states in the “reversing” phase include four with Republican governors and six with Democratic governors. For instance, Florida and Texas — also in the “reversing” category and led by Republican governors — ordered bar closures or a stop to on-premise consumption of alcohol in late June when coronavirus cases spiked in those states.", "North Carolina is in the “pausing” phase, according to the Times, along with five other Democratic-led states and seven Republican-led states. Gov. Roy Cooper declared that some businesses could reopen in May, though the state remained paused in its “Phase 2” guidelines throughout the summer. Cooper announced a “modest step forward” to the next reopening phase to begin Sept. 4.", "Other states that are in the process of “reopening,” by the Times’ categorization, include two Republican states and four Democratic ones.", "Trump also claimed: “They’re keeping the churches closed on purpose. You have churches that still aren’t open but you’re allowed to go to a casino.” While some churches may be closed, the Times analysis shows every state but California allows places of worship to be open. California allows churches to be open in some counties and casinos in “some areas,” the Times says.", "Referring to the 1994 crime bill championed by then-Sen. Biden, Trump said “And look what Biden did in 1994. What he did to people, to black people. … He called them super-predators.” Actually, that was a phrase famously uttered by Hillary Clinton.", "We couldn’t find any evidence that Biden has used that term, and the Trump campaign and the White House did not respond to our inquiry seeking backup.", "The context for Trump’s comments in the Fox News interview is the Violent Crime Control and Law Enforcement Act of 1994, which Biden, as chairman of the Senate Judiciary Committee, largely wrote and shepherded through the legislative process. Although the bill received bipartisan support at the time, it has been criticized for some of its provisions, such as mandatory minimum sentencing, and its impact on mass incarceration, particularly of Black men. As we have written, the trend of increasing imprisonment began well before 1994, but experts told us the 1994 law exacerbated the issue.", "Trump: Criminal justice reform was such a big deal. And look what Biden did in 1994. What he did to people, to black people —", "Ingraham: He called the criminals predators.", "Trump: Well, he called them predators —", "Ingraham: Super-predators.", "Trump: — super-predators, actually. He called them super-predators.", "As we said, it was actually Hillary Clinton who used the phrase “super-predator” in a 1996 speech at New Hampshire’s Keene State College in support of the 1994 crime bill, which was signed by her husband, then-President Bill Clinton.", "“They are not just gangs of kids anymore,” Clinton said. “They are often the kinds of kids that are called ‘superpredators.’ No conscience, no empathy. We can talk about why they ended up that way, but first we have to bring them to heel.”", "Her use of the phrase was repeatedly raised during her 2016 presidential bid — by Trump.", "African American voters “also know that she’ll do nothing for them once the election is over. She never does and that will never ever change. Many of them will never forget her calling young African-American men super predators. Not nice,” Trump said at a campaign rally in New Hampshire in September 2016, one of at least eight campaign speeches in which he brought up her use of the term.", "In August of that year, Trump tweeted, “How quickly people forget that Crooked Hillary called African-American youth “SUPER PREDATORS” – Has she apologized?”", "Actually, she had apologized for using the phrase, though she never specifically linked the term to “African-Americans youth,” as Trump said, only to “gangs of kids.”", "“In that speech, I was talking about the impact violent crime and vicious drug cartels were having on communities across the country and the particular danger they posed to children and families,” Clinton told the Washington Post in February 2016. “Looking back, I shouldn’t have used those words, and I wouldn’t use them today.”", "We should note that Trump was initially correct that Biden did refer to some criminals as “predators.”", "Speaking in favor of the crime bill in an impassioned speech from the floor of the Senate in 1993, Biden used the term “predator” in much the same context that Clinton used the term “super-predator.”", "“We have predators on our streets that society has in fact, in part because of its neglect, created,” Biden said, adding that many of them are “beyond the pale,” and that “we have an obligation to cordon them off from the rest of society.”", "(In a March 2019 article about Biden’s comments, Bill Russo, a spokesman for Biden, told CNN: “Then-Senator Biden was referring specifically to violent crimes in the selected quotes. He was not talking about a kid stealing a candy bar, but someone who committed sexual assault, manslaughter, or murder. In contrast, he says in the same speech that we need a different approach for nonviolent crimes. Specifically, he says we ‘need to keep people who are first time offenders, non-violent offenders, or potential first-time offenders who in fact are people getting themselves into the crime stream from the first time — that they should be diverted from the system.'”)", "We should note that Trump, too, has used the term “predators” to refer to violent criminals. In his 2000 book, “The America We Deserve,” Trump praised then-New York City Mayor Rudy Giuliani for cracking down on criminals in New York City.", "“If I were in charge of things, life would be even tougher for these predators,” Trump added.", "During the Ingraham interview, Trump told a murky, evidence-free story about people “in the dark shadows” pulling the strings of Biden and about “thugs wearing … black uniforms … on a plane.” Ingraham said the talk about dark shadows “sounds like conspiracy theory.”", "Ingraham: Who do you think is pulling Biden’s strings? Is it former Obama officials?", "Trump: People that you’ve never heard of, people that are in the dark shadows. People that are–", "Ingraham: What does that mean? That sounds like conspiracy theory, dark shadows. What is that?", "Trump: No. People that you haven’t heard of. They’re people that are on the streets, they’re people that are controlling the streets. We had somebody get on a plane from a certain city this weekend. And in the plane, it was almost completely loaded with thugs wearing these dark uniforms, black uniforms with gear and this and that. They’re on a plane.", "Ingraham: Where — where was this?", "Trump: I’ll tell you sometime, but it’s under investigation right now. But they came from a certain city, and this person was coming to the Republican National Convention. And there were like seven people on the plane like this person and then a lot of people were on the plane to do big damage. They were coming …", "Ingraham: Planning for Washington.", "Trump: Yeah. This was all — this is all happening.", "He was asked about the episode on Sept. 1 before he boarded Air Force One for Kenosha, but things didn’t get any clearer.", "This time Trump said that “the entire plane filled up with the looters, the anarchists, the rioters — people that obviously were looking for trouble.” He said he had a source who was on the flight and “felt very uncomfortable.” He said he would see if he could get his source to speak to the press.", "Trump, Sept. 1: Yeah, I can tell you that — I can probably refer you to the person, and they could do it. I’d like to ask that person if it was okay. But a person was on a plane, said that there were about six people like that person, more or less. And what happened is the entire plane filled up with the looters, the anarchists, the rioters — people that obviously were looking for trouble. And the person felt very uncomfortable on the plane. This would be a person you know. So I will see whether or not I can get that person. I’ll let them know, and I’ll see whether or not I can get that person to speak to you. But this was a firsthand account of a plane going from Washington to wherever.", "This story is so vague and specifics-free that there really aren’t facts to check. There is one significant internal contradiction between the two statements. In the Ingraham interview, the “thugs” were on their way to Washington, D.C., to do “big damage” at the Republican National Convention, which was held Aug. 24-27. In his Sept. 1 comments, Trump said “the looters, the anarchists, the rioters” had boarded a plane headed in an entirely different direction, “going from Washington to wherever.”", "There is also the question of how such a large cadre of obvious troublemakers could have all made it past the forces of the Transportation Security Administration.", "Neither the White House nor the Trump campaign responded to our questions about Trump’s claim.", "NBC News’ Ben Collins pointed out that the baffling story was reminiscent of a viral Facebook post from June.", "President Trump tonight: \"We had somebody get on a plane… it was almost completely loaded with thugs, wearing these dark uniforms, black uniforms.\"", "Viral Facebook rumor from June: \"At least a dozen males got off the plane in Boise from Seattle, dressed head to toe in black.\" pic.twitter.com/xn5YrM1R2k", "— Ben Collins (@oneunderscore__) September 1, 2020", "Misleads on number of COVID-19 deaths. Trump repeated a statistic he previously shared on Twitter that falsely claimed “only 6%” of reported COVID-19 deaths were from the coronavirus.", "“And by the way, I saw a statistic come out the other day talking about only 6% of the people actually died from COVID,” he said, “which is a very interesting — that they died from other reasons.”", "Ingraham pointed out that’s not what the data showed — that in fact, the figure was referring to the propensity of coronavirus patients to have comorbidities, or other health conditions, which has long been known — and that “COVID might ultimately have been the key morbidity to hit them.”", "“It could be,” Trump allowed, “but it’s an interesting statistic.”", "As we have written, the statistic comes from the CDC, which noted that for 6% of deaths involving COVID-19 between Feb. 1 and Aug. 22, COVID-19 was the only cause of death mentioned on the death certificate. That doesn’t mean that those were the only patients who died from COVID-19.", "Because infection with the coronavirus can trigger other conditions, such as pneumonia or acute respiratory distress syndrome, it’s not surprising that many COVID-19 patients who died would have other causes of death listed on their death certificates. And because it’s well known that chronic conditions such as diabetes and high blood pressure tend to make COVID-19 more severe, it’s also expected that many patients would have those diseases listed as contributors as well.", "The CDC’s National Center for Health Statistics told us that contrary to Trump’s suggestion, the underlying cause of death — the condition ultimately responsible for a patient’s demise — was COVID-19 in 92% of deaths involving the coronavirus.", "Suburbs: Trump falsely claimed that he “ended the regulation … that mandated low-income housing” in the suburbs. Experts told us the 2015 Housing and Urban Development “Affirmatively Furthering Fair Housing” rule that Secretary Ben Carson announced he will terminate did not require low-income housing to be built in the suburbs or anywhere else. The rule changed the process for jurisdictions that receive HUD funding to show how they plan to address fair housing issues in their communities. The rule specifically says it “does not impose any land use decisions or zoning laws on any local government.”", "Ventilators: Trump, talking about the Strategic National Stockpile, again falsely claimed that the federal government initially “didn’t have ventilators” to treat COVID-19 patients because “we had empty cupboards when I got there.” In June, a spokesperson for the Department of Health and Human Services told us that the SNS had 16,660 ventilators “immediately available for use” in March 2020, which “would not have been much different” from the “total number of ventilators in the SNS inventory immediately available for use” when Trump was inaugurated in January 2017. As of June 17, Trump had inherited more ventilators than were distributed from the stockpile during the pandemic.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]