["The photo was published in this Facebook post on April 11, 2019 and shared more than 20,000 times.", "The Facebook post was published the same day that voting in India’s 2019 elections began. This is an AFP report published on April 11 about the polls.", "The Hindi-language caption translates to English as: “BJP activists caught red-handed on their way to to cast votes wearing Muslim women’s burka in Saharanpur.”", "Below is a screenshot of the post:", "“BJP” refers to India’s ruling Bharatiya Janata Party. This is its official Twitter account.", "“Saharanpur” refers to a district and parliamentary constituency in the northern Indian state of Uttar Pradesh.", "The photos were also shared on Facebook here and on Twitter here with the same claim.", "A reverse image search of the photo on Google found that the exact same image has circulated online since at least October 2015.", "The photo was published by an Indian news and entertainment site on October 1, 2015 here in a report about a man allegedly caught throwing beef in a temple.", "Below is a screenshot of the report:", "The headline reads: “This FB Post Allegedly Exposes RSS Activists In Burkha, Throwing Beef In Temple”.", "“RSS” refers to Indian Hindu organisation Rashtriya Swayamsevak Sangh. This is a description of the group on the Britannica online encyclopedia.", "The article states: “The post shows pictures of a man wearing a burka being paraded in Azamgarh, it is claimed that he is an RSS activists caught red handed while throwing beef in a temple.”", "“Azamgarh” is a city in the Indian state of Uttar Pradesh.", "The same photo was used in other Indian media reports about the same incident here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]