["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A viral but false story on Facebook invokes the controversial Common Core program endorsed by former President Barack Obama.", "\"Florida school drops Common Core — soars to number one,\" said the headline in Neon Nettle in June 2018. The same headline has circulated at least since 2017 and gained traction at the end of 2019.", "Neon Nettle is a London-based website which states that \"we believe the mainstream media has become less valid as it continues to push engineered narratives through an ever-increasingly censored internet.\"", "The Facebook post was flagged as part of the company’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The story says that a charter school, Mason Classical Academy in Naples, rejected the Common Core State Standards Initiative because it \"deliberately dumbs down children,  creating unnecessary and complicated techniques for working out relatively simple problems.\"", "Snopes fact-checked the same claim about the school in March 2018 and rated it False. Snopes and news reports show that the charter school never adopted Common Core in the first place, so it makes no sense to claim that getting rid of it was the driving force behind high test scores. State rankings show that the school has consistently been an A-rated school.", "A St. Augustine Record editorial in February 2019 quoted the school principal, David Hull, disputing the claim that the school vaulted after dropping Common Core.", "\"The general theme of the original article argues that MCA is a charter school that has abandoned Common Core, and doing so catapulted the school to number one status. The pursuit of truth requires humility, so I therefore must admit, although the argument is on the right track, the author misses much of the bigger picture,\" Hull said.", "The school’s website makes it clear that it does not adhere to Common Core: \"Students in Kindergarten through 8th grade follow the Core Knowledge Sequence (not to be confused with Common Core).\"", "Common Core refers to a set of national education standards adopted by the majority of states, including Florida, during the Obama administration. From the beginning, Common Core faced fierce opposition from some opponents including in Florida. We have fact-checked multiple falsehoods about Common Core including that  the standards aim \"to instill federally determined attitudes and mindsets in students including political and religious beliefs.\"", "Florida Gov. Ron DeSantis called for getting rid of Common Core. The state’s education commissioner, Richard Corcoran, is expected to present new state curriculum standards to the Legislature in 2020.", "Neon Nettle said that \"Florida school drops Common Core — soars to number one.\"", "The school never adopted Common Core in the first place.", "This statement rates False.", "Neon Nettle, Florida School Drops Common Core – Soars To Number One, June 27, 2018", "Snopes, Did Ditching Common Core Cause a Florida School’s Test Results to Improve? March 20, 2018", "St. Augustine Record editorial, \"A Common Core crash-and-burn?\" Feb. 13, 2019", "Florida Department of Education, Florida school grades, 2019", "Tampa Bay Times, DeSantis takes aim at Common Core in executive order, Jan. 31, 2019", "National Conference of State Legislatures, Common Core status map, Aug. 14, 2017", "PolitiFact, Fact-checking attacks on Common Core school standards, Oct. 21, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]