["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this image released by the White House, President Donald Trump works in the Presidential Suite at Walter Reed National Military Medical Center in Bethesda, Md., on Oct. 3, 2020, after testing positive for COVID-19. (AP)", "The post was published by a supporter of QAnon, a baseless conspiracy theory that says Trump is secretly fighting a cabal of pedophiles.", "It’s inaccurate to say that Trump is on Air Force One instead of staying at Walter Reed. Photo and video evidence place the president at Walter Reed National Military Medical Center.", "There is no evidence that Trump is faking his illness.", "As Donald Trump fights to recover from the coronavirus, some social media users claim the president isn’t actually at a military hospital in Maryland.", "\"He is not there! He is on AF1,\" says an Oct. 2 Facebook post.", "\"AF1 Spotted today!!! But didn't he get Rushed to Walter Reed Medical Center??\" wrote another Facebook user.", "\"How can Trump Be In 2 Places at Once?!!! Is the World About to find out about Cl0nes?\" another post asks.", "The posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "All of the posts were published by people who have promoted QAnon, a baseless conspiracy theory that says Trump is secretly fighting a cabal of Satan-worshipping, cannibalistic pedophiles. QAnon supporters have claimed that Trump’s hospitalization at Walter Reed National Military Medical Center is actually a cover for mass arrests and executions of his political foes.", "There is no evidence that’s the case — and the Facebook posts are wrong to say that Trump is on Air Force One instead of staying at Walter Reed.", "The posts rely on a mix of screenshots from QAnon accounts, photos of Trump and posts from Q, the anonymous internet persona behind the conspiracy theory. None of it proves Trump is on Air Force One. We reached out to the original poster for additional evidence, but we didn’t hear back.", "How do we know Trump is at Walter Reed? Here’s a rough timeline of the president’s status over the past few days.", "On Oct. 2, Trump posted a video on Twitter shortly before departing the White House on Marine One. There is footage and photo evidence of him both leaving the White House and arriving at Walter Reed.", "On Oct. 3, Trump’s medical team held a press conference on the president’s condition outside the hospital. Later in the day, Trump posted another video on Twitter thanking the healthcare workers at Walter Reed. The White House also released two photos that show Trump looking at documents or signing a piece of paper in the presidential suite at Walter Reed.", "RELATED: Fact-checking misinformation about Trump, COVID-19", "On Oct. 4, Trump’s medical team gave another update on his condition outside the hospital. Dr. Brian Garibaldi, a pulmonary physician, said the president could be discharged as soon as Monday.", "A reporter for New York Magazine, Yashar Ali, debunked the claim that Trump wasn’t really at Walter Reed. Tweeting a version of the Trump video, he wrote: \"I can't believe some of you conspiracy theorists are forcing me to do this, but a former USSS (Secret Service) agent who was on President Obama's detail has confirmed to me that this is indeed the larger office inside METU (Medical Evaluation & Treatment Unit) at Walter Reed.\"", "There is also no evidence that Trump is faking his illness. That unfounded theory is outweighed by the significant amount of evidence showing that Trump does, in fact, have COVID-19.", "The Facebook post is inaccurate and makes a ridiculous claim. We rate it Pants on Fire!", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "AP Images, accessed Oct. 4, 2020", "The Associated Press, \"Trump, stricken by COVID-19, flown to military hospital,\" Oct. 3, 2020", "C-SPAN, \"President Trump Arrival at Walter Reed Medical Center, Bethesda, Maryland,\" Oct. 2, 2020", "C-SPAN, \"President Trump White House Departure for Walter Reed Medical Center,\" Oct. 2, 2020", "C-SPAN, \"Walter Reed Medical Center Briefing on President's Condition,\" Oct. 4, 2020", "C-SPAN, \"Walter Reed News Conference on President Trump's Condition,\" Oct. 3, 2020", "The Daily Beast, \"QAnon: Trump Getting COVID Is Good News,\" Oct. 3, 2020", "Facebook post, Oct. 2, 2020", "Facebook post, Oct. 3, 2020", "Facebook post, Oct. 3, 2020", "PolitiFact, \"The evidence that Trump is telling the truth about his positive coronavirus test,\" Oct. 2, 2020", "PolitiFact, \"What is QAnon, the baseless conspiracy spilling into US politics?\" Aug. 27, 2020", "Tweet from Donald Trump, Oct. 2, 2020", "Tweet from Donald Trump, Oct. 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]