["Sen. Rand Paul, R-Ky., drew boos on \"The View\" when he said that most Americans of modest means don't have an income tax burden. But he had a point.", "Sen. Rand Paul, R-Ky., drew a backlash from the audience of ABC’s \"The View\" when he argued that lower-income Americans get off pretty easy under the U.S. tax system.", "Richer Americans, he said, carry most of the freight.", "\"We’ve taken the poor off of the rolls. They don’t pay income tax any more. Most people below $50,000 don’t pay any income tax,\" Paul said during the Oct. 11 episode. \"The top 1 percent in our country pay 40%.\"", "At that point, the audience began to object, and cohost Sunny Hostin told Paul, \"Our audience says that’s not true.\"", "But Paul doubled down. \"The IRS statistics say the top 1% in our country pay 40% of the income tax,\" he said.", "We looked into it and found the senator was largely correct.", "When we reached out to Paul’s office, they said he was referring to the most recent projections for 2019 by the Joint Committee on Taxation, the official arbiter of tax analysis for Congress.", "For the federal income tax, the committee found that every income group below $50,000 paid a negative average share of the income burden. That means that, on the whole, families in these income groups got deductions and credits that reduced their federal income tax liability below zero.", "Meanwhile, the same analysis provided a snapshot of the tax burden shouldered by the top 1.2 percent of tax filers, those earning at least $500,000. This elite group collectively footed 51.5% of the nation’s individual income tax bill. That’s a larger share than what Paul said.", "So if you look at the federal income tax, Paul’s comment on the view is on target.", "Individual taxes aren’t the only ones Americans pay.", "If you factor in other federal taxes, including payroll and excise taxes, the numbers change.", "The same Joint Committee on Taxation analysis found that those earning less than $50,000 paid 4.3% of all federal taxes. That’s still a relatively light burden, since these taxpayers earned 13% of all income generated.", "As for Americans earning more than $500,000, their share of the tax burden declines to 30.7% once you add in these other federal taxes.", "A few other analyses are broadly in line with the joint committee’s data and what Paul said.", "An annual analysis by the IRS found that in 2017, the top 1% paid 38.5% of federal income taxes. And taxpayers earning under $50,000 paid 5.98 percent of income taxes. (Not nothing, as Paul said, but not nearly as much.)", "Meanwhile, the Urban Institute-Brookings Institution Tax Policy Center, a nonpartisan think tank, estimated the breakdown for all federal taxes in 2019.", "The center found that those earning up to about $50,000 in income collectively paid about 4.2% of all federal taxes, while the top 1% paid about 27 percent of all federal taxes.", "These are averages, and individual tax burdens can vary.", "\"The results depend on the specific situations faced by taxpayers, such as whether or not they have children,\" said Mark Mazur, the Tax Policy Center’s director.", "Paul said that \"most people below $50,000 don’t pay any income tax. The top 1 percent in our country pay 40%.\"", "Because he limited his comments to the federal income tax, Paul’s numbers are broadly accurate, and they even underplay the tax burden on the top 1%.", "The picture shifts once you include other types of federal taxation. Those below $50,000 still pay a small share of the full federal tax burden, but the share paid by the top 1% falls to about 30%.", "So Paul’s statement is accurate but needs additional information. We rate the statement Mostly True.", "Rand Paul, remarks on ABC’s \"The View,\" Oct. 11, 2019", "Joint Committee on Taxation, \"Table A-6.─Distribution of Income and Taxes, and Average Tax Rates in 2019 (Projected),\" March 20, 2019", "Internal Revenue Service, Statistics of Income Table 1, 2017 edition", "Urban Institute-Brookings Institution Tax Policy Center, \"Baseline Distribution of Income and Federal Taxes, All Tax Units, by Expanded Cash Income Percentile, 2019,\" accessed Oct. 17, 2019", "Email interview with Mark Mazur, director of the Urban Institute-Brookings Institution Tax Policy Center, Oct. 16, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]