["On February 12, Bharatiya Janata Party (BJP) MP Satyadev Pachauri alleged that his party lost 36 seats in the recently concluded Delhi assembly elections by a margin of fewer than 2000 votes. He tweeted, “Add this to the seats won:8 It comes to 44 seats 3% more voting could have changed the entire game.” It may be noted that the BJP procured eight out of 70 assembly seats in the recently concluded Delhi polls and the Aam Aadmi Party (AAP) was re-elected to form government. The tweet has now been deleted (archive).", "The same message was shared by many other individuals on Twitter. One Biswajit Roy tweeted the same claim.", "A relevant keyword search on Twitter led us to a tweet by the official handle of Sudarshan News. The TV channel had posted similar information as Pachauri at 10:57 am on February 11. It said, “भाजपा के आशा के कारन (Reasons of hope for BJP)”. The assertion that BJP lost with a margin of 2000 votes from 36 seats originated from this tweet. However, it is important to note that the channel’s claim was about the party trailing with those many numbers of votes before the final result was declared.", "भाजपा के आशा के कारन।", "१०० से कम मतों का अंतर ८ स्थानों पर। १००० से कम मतों का अंतर १९ स्थानों पर। २००० से कम मतों का अंतर ९ स्थान। #DelhiResults #DelhiBanayGaKhalistan2020 #DelhiElections #Delhi @BJP4India @AamAadmiParty @INCIndia", "— Sudarshan News (@SudarshanNewsTV) February 11, 2020", "“The Delhi assembly elections saw a close fight in at least 13 constituencies where victory margins ranged from below 7,000 votes to as low as 753,” stated an article by Hindustan Times on February 12. According to the report, poll data suggests that there was a close fight on at least nine assembly seats where the margin between the winner and the runner-up was less than 5000 votes.", "We then cross-checked with the data available on the official website of the Election Commission of India and confirmed the findings of the report. Only two BJP candidates – Sat Prakash Rana from Bijwasan (753) and Raj Kumar Bhatia from Adarsh Nagar (1589) – lost the elections with a margin below 2000 votes.", "A day after the final results of the assembly elections was declared, BJP MP Satyadev Pachauri falsely claimed that 36 BJP candidates lost with a margin of fewer than 2000 votes. Whereas, in reality, only two candidates witnessed such neck-and-neck competition.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]