["The misleading claim was published in this Facebook on January 24, 2020.", "The post, which shows people wearing masks and protective clothing in China next to an image of a snake, has been shared more than 11,000 times.", "Below is a screenshot of the misleading Facebook post:", "The post’s Sinhala-language caption translates to English as: “Seems more dangerous than anticipated”.", "The Sinhala-language text on the image translates to English as below: \n\t“By now China’s Wuhan city has been sealed off along with 11 million people and since no drugs have been found to treat coronavirus, doctors say they all would most likely die. It is also noted that this virus could turn worse in March and it has by now spread to Japan, Thailand and America. It has also been found that this situation is a result of consuming the meat of the Chinese cobra. Chinese government notes the city was closed off to avoid a grave situation that would arise if this spread all over the world. By this time, even the Huanggang city has been sealed off with a 7.5 million population.”", "A new strain of the coronavirus was discovered in China more than one month ago. It has killed at least 82 people and infected more than 2,700 people across China, as reported here by AFP on January 28, 2020. The virus has now infected people in more than a dozen countries, including the United States.", "The government of Wuhan announced on January 23, 2020, that it was suspending all entrance and exits to the city as a precautionary measure to stop further transmission of the virus, as reported here by AFP. The neighbouring city of Huanggang was also placed on lockdown from the same day.", "A similar claim was published on Facebook here, here and here.", "The claim is false; Chinese authorities have not projected all 11 million people quarantined in Wuhan will die from the virus.", "Strict measures were undertaken to stop the spread of the virus, according to this China Daily article, shared on the website of the National Health Commission of the People’s Republic of China on January 23, 2020.", "The report’s first paragraph reads: “China is taking more stringent measures in hospitals to safeguard healthcare workers amid the ongoing outbreak of pneumonia caused by the new coronavirus strain, and training for such employees will be enhanced nationwide, the country's top health authority said on Jan 22.”", "There is a currently no vaccine for the new strain of coronavirus but most patients will recover on their own, according to the US Centers for Disease Control and Prevention.", "The Shanghai Municipal Health Commission announced on January 26, 2020, that a 56-year-old woman was successfully treated for the virus, Malaysian newspaper The Star reported, citing Chinese state media.", "Dr Shawn Vasoo, the acting clinical director at  Singapore’s National Centre for Infectious Diseases, estimated that around 20 percent of the people infected with the virus would become very ill.", "The claim in the misleading posts that the virus originated from snake meat has not yet been confirmed. A group of Chinese scientists published a paper in the Journal of Medical Virology on January 22, 2020, about the claim.", "Upon analysing the genetic sequence of the Wuhan virus, they found that the protein codes in the virus are similar to those in snakes -- they used samples from the many banded krait and the Chinese cobra, which are common in the area -- and believed the virus might have been transmitted from snakes to humans.", "It could also have originated from bats, but there could have been an “intermediate host” in the transmission to humans, possibly snakes, as AFP reported on January 23, 2020.", "Scientists have said more tests will be needed to confirm its origin, the South China Morning Post reported on January 23, 2020.", "CORRECTION: This story was updated on January 28, 2020, to change the number of death toll from the virus from “at least 80” to “at least 82”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]