["The photos were posted here on Facebook on December 15, 2019, and have been shared more than 56,000 times since.", "The top photo shows a crying child; the one in the bottom left-hand corner features a group of men sitting on the floor; and the image in the bottom right depicts women and children being surrounded by armed officers.", "The Indonesian-language caption translates to English as: “LISTENING millions of Muslims forced to convert, detained in concentration camps in China, tortured, raped, brain-washed, forced to drink alcohol, forced to eat pork, give up their religion. This is another disaster but no one talks about it. #SaveUyghur”.", "Below is a screenshot of the misleading post:", "The same photos have also been shared tens of thousands of times on Facebook here, here and here alongside a similar claim.", "China has been accused of running camps and prisons to detain the Uighur population in Xinjiang. Researchers said more than a million people could have been held in such detention camps, AFP reported here on November 13, 2019.", "However, the photos have been shared in a misleading context. The first image shows a crying child at a Uighur solidarity rally in Istanbul, Turkey, in 2018; the second photo shows suspected Uighurs at a migrant shelter in Thailand in 2014; and the third picture shows Uighurs protesting in Urumqi, the capital of China’s Xinjiang region, in 2009.", "A reverse image and keyword search on Google found this AFP photo, dated July 5, 2018, of the same crying child.", "The caption of the AFP photo reads: “A boy reacts as Turkish plain clothes police officers try push back demonstrators during a protest of supporters of the mostly Muslim Uighur minority and Turkish nationalists to denounce China’s treatment of ethnic Uighur Muslims during a deadly riot in July 2009 in Urumqi, in front of the Chinese consulate in Istanbul, on July 5, 2018. Nearly 200 people died during a series of violent riots that broke out on July 5, 2009 over several days in Urumqi, the capital city of the Xinjiang Uyghur Autonomous Region, in northwestern China, between Uyghurs and Han people.”", "Below is a screenshot comparison of the first photo in the misleading post (L) and the AFP photo (R):", "Another reverse image search of the second image showing a group of men led to this Reuters photo dated March 14, 2014.", "The Reuters caption states: “Suspected Uighurs from China’s troubled far-western region of Xinjiang, sit inside a temporary shelter after they were detained at the immigration regional headquarters near the Thailand-Malaysia border in Hat Yai, Songkla March 14, 2014. About 200 people rescued by police from a human smuggling camp in southern Thailand on Wednesday are suspected Uighur Muslims from China’s troubled far-western region of Xinjiang, say Thai police.”", "Below is a screenshot comparison of the second photo in the misleading post (L) and the Reuters photo (R):", "Thai police said the group claimed they were Turkish but they had no documents to prove that, according to this Reuters report published on the same day. “The group in Hat Yai shows strong similarities to Turkic-speaking Uighur asylum-seekers who have been detained in Bangkok, police sources say,” the report further said.", "A reverse image search found the third photo published here on Getty Images on July 7, 2009.", "The Getty caption says: “Chinese policemen push Uighur women who are protesting at a street on July 7, 2009 in Urumqi, the capital of Xinjiang Uighur autonomous region, China. Hundreds of Uighur people have taken to the streets protesting after their relatives were detained by authorities after Sunday’s protest. Ethnic riots in the capital of the Muslim Xinjiang region on Sunday saw 156 people killed. Police officers, soldiers and firefighters were dispatched to contain the rioting with hundreds of people being detained.”", "Below is a screenshot comparison of the third photo in the misleading post (L) and the Getty Images photo (R):", "UPDATE: The rating in the header image of this fact-check report has been updated on December 30, 2019, to \"Misleading\" to reflect the indirect claim.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]