["Children sit at a bench in an orphanage in Liberia. (AP Photo)", "The good majority of orphans in institutions are not actually parentless, according to the charity founded by author J.K. Rowling.", "\"An estimated 8 million children worldwide live in orphanages or residential institutions. Shockingly, 80 percent of these children are not orphans,\" says Lumos, a group dedicated to ending the institualization of children by 2050. \"Children need families, not orphanages.\"", "Is it true?", "Well, maybe. The data Lumos relies on comes from credible sources, but the reality is the information available is outdated and, to some extent, unreliable.", "The number of orphans living in some institution -- the 8 million figure -- has been floating around for decades. It seems to originate from a 1985 report by Defence for Children International.", "A more recent tally by the United Nations Children’s Fund (UNICEF) pins the number at 2 million, but UNICEF cautions that this is likely to be severely underestimated due to underreporting as \"many institutions are unregistered, and many countries do not regularly collect and report data on children in institutional care.\"", "The claim that 80 percent of children living in an institution are not orphans, meanwhile, comes from a 2009 estimate from Save the Children, an international children’s rights charity. The charity claims that \"four out of five children in institutional care have one or both parents alive.\"", "These children are placed in orphanages despite having at least one living parent because of poverty or social exclusion (i.e. gender or disability discrimination).", "Neither figure can be verified without more comprehensive statistical studies than currently available, said Jedd Medefind, the president of the Christian Alliance for Orphans.", "Most studies are conducted on a local level and \"these numbers vary greatly by individual orphanage as well as by region of the world,\" Medefind aid.", "UNICEF reports, for example, that 77 percent of more than 11,000 children in orphanages in Cambodia in 2009 had at least one living parent. In Sri Lanka, that number was 90 percent in 2007. On the low end, 39 percent of orphans in Zimbabwe had least one parent Here’s a map from Lumos that illustrates the regional differences.", "So what exactly is so troubling about having children with parents living in orphanages?", "Decades of research show that children, especially younger children, placed in institutional care are more likely to experience poor health, developmental delay and emotional attachment disorders. So rather than supporting institutions that have poor track records, UNICEF and virtually all children’s rights groups favor helping destitute families and communities provide care.", "While not all orphans can be returned to families or relatives, \"we can say with confidence that a portion of the children currently living in orphanages could be returned to live with relatives with certain supports and appropriate oversight,\" Medefind said.", "In the United States, there were over 415,000 children in foster in 2014, according to the Department of Health and Human Services.", "Our ruling", "Lumos said, \"An estimated 8 million children worldwide live in orphanages or residential institutions. Shockingly, 80 percent of these children are not orphans.\"", "Both figures are plausible though not verifiable.", "A UNICEF report estimated 2 million institutionalized orphans but noted that this is likely severely underestimated. Local studies on the number of institutionalized orphans with at least one parent, meanwhile, range from 30 to over 90 percent.", "We rate this claim Half True.", "Lumos Foundation, Fact Sheet, 2016", "Better Care Network, Global Facts About Orphanages, August 2009", "Faith to Action Initiative, Children, Orphanages and Families, March 2014", "Christian Alliance for Orphans, On Understanding Orphan Statistics, October 2015", "National Geographic, \"The Orphanage Problem,\" July 31, 2013", "Save the Children, \"Keeping Children Out of Harmful Institutions,\" 2009", "Better Care Network and Save the Children, \"The Risk of Harm to Young Children in Institutional Care,\" 2009", "UNICEF, \"For Every Child,\" 2016", "UNICEF, \"Progress for Children,\" September 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]