["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Mondelez International said Feb. 4, 2021, that it plans to close its Nabisco bakery in Fair Lawn, N.J., shown in this 1998 file photo. (AP)", "• Mondelez International, Nabisco’s parent company, will close biscuit bakeries in New Jersey and Georgia by summer 2021.", "• The company linked the closures to “aging infrastructure and outdated production capabilities,” not President Joe Biden’s election.", "• Mondelez said no U.S. jobs will go to Mexico because of these two closures.", "Mondelez International, Nabisco’s parent company, announced Feb. 4 that it would close two biscuit bakeries by summer 2021, one in Fair Lawn, N.J., and the other in Atlanta.", "Social media users linked the company’s announcement to President Joe Biden’s election.", "\"Nabisco is closing plants in Georgia and New Jersey moving to Mexico,\" reads a Feb. 11 Facebook post. \"Congratulations on electing Biden.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "More than 400 jobs will be lost as a result of the Georgia plant closure, and another 600 people will likely lose their jobs as a result of the New Jersey plant closure.", "But there is no indication that the company’s decision to close the plants was linked to the outcome of the 2020 presidential election. (Other fact-checking organizations have also debunked this claim.) And the company says it’s not moving jobs or production from those sites to Mexico.", "Mondelez is based in Chicago, with U.S. headquarters in northern New Jersey. A spokesperson for Mondelez directed PolitiFact to its Feb. 4 statement, which said it would be focusing U.S. production on \"strategically located\" bakeries in Richmond, Va., Chicago and Portland, Ore.", "The company said the New Jersey and Georgia facilities were \"no longer strategic assets from a geographic footprint perspective.\"", "\"Both face significant operational challenges, including aging infrastructure and outdated production capabilities, which would have required significant investment to bring them to the modernized state required for the future,\" the statement read.", "Mondelez said production from the two closing sites would shift its other U.S. bakeries, not abroad.", "\"No U.S. jobs will go to Mexico related to these two closures, and U.S. biscuit production levels will be maintained,\" the company said.", "Posts claim that Nabisco is closing plants in Georgia and New Jersey and \"moving to Mexico\" because of Biden’s election.", "Mondelez, which owns the brand, announced the plant closures Feb. 4, but there is no evidence that they are due to Biden’s election. The company said production from the two sites will shift to its other U.S. bakeries, not to Mexico.", "We rate this claim False.", "Facebook post, Feb. 11, 2021", "Mondelez International, \"Mondelēz International to Close Two U.S. Biscuit Bakeries Later this Year,\" Feb. 4, 2021", "NJ.com, \"600 to lose jobs when N.J. Nabisco plant closes by end of summer,\" Feb. 5, 2021", "Fox 5 Atlanta, \"Bakery plant to close in southwest Atlanta after nearly 80 years,\" Feb. 4, 2021", "NJ.com, \"Nabisco factory in N.J. may close, company says,\" Nov. 18, 2020", "Northeast Times, \"Mondelez closes old Nabisco plant,\" Feb. 7, 2014", "Email exchange with Laurie M. Guzzinati, Mondelez International’s senior director for corporate & government affairs North America, Feb. 12, 2021", "USA Today, \"Fact check: Nabisco factory shutdowns not related to President Joe Biden, jobs not going to Mexico,\" Feb. 11, 2021", "Reuters, \"Fact check: GA and NJ Nabisco plant closures not moving jobs to Mexico, parent company says,\" Feb. 12, 2021", "NorthJersey.com, \"Nabisco plant in Fair Lawn to close permanently in late summer,\" Feb. 5, 2021", "Associated Press, \"Nabisco plant to close, leaving as many as 600 jobless,\" Feb. 6, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]