["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former Vice President Joe Biden and Sen. Kamala Harris, D-Calif., participate in a Democratic presidential primary debate on July 31, 2019, in Detroit. (AP/Sancya)", "Viewers of the Detroit Democratic debates got an encore showdown between former Vice President Joe Biden and California Sen. Kamala Harris when the topic of busing reemerged.", "This time, Biden tried to turn the tables on Harris for her attacks on his busing record, accusing her of failing to desegregate schools in Los Angeles and San Francisco during her two-term stint as attorney general of California.", "Biden also recalled a scandal that occurred on Harris’s watch while she was district attorney of San Francisco. Biden said:", "\"Secondly, she also was in a situation where she had a police department when she was there that, in fact, was abusing people's rights.", "\"And the fact was that she in fact was told by her own people, her own staff, that she should do something about and disclose to defense attorneys like me that you, in fact, have been — the police officer did something that did not give you information that would exculpate your client.", "\"She didn't do that. She never did it. And so, what happened? Along came a federal judge and said enough, enough, and he freed 1,000 of these people. If you doubt me, Google ‘1,000 prisoners freed Kamala Harris.’\"", "\"That is simply not true,\" Harris responded.", "So, who’s right? We followed Biden’s suggestion and Googled away.", "We found that Biden’s version of events captures the gist of what happened but misses the mark on a few details.", "A June report from the Wall Street Journal said that in 2005, when Harris was district attorney, her staff encouraged her to adopt a \"Brady policy\" requiring her office’s prosecutors to inform defendants of past misconduct by police and other law enforcement in accordance with Supreme Court precedent.", "Brady policies are named after a 1963 Supreme Court ruling that said prosecutors must turn over all evidence that could potentially exonerate the defendant.", "Harris did not institute such a policy, and in 2010, a crime lab technician in San Francisco was caught stealing drug evidence from the lab for personal use. That meant some lab results had been jeopardized, and more than 1,000 drug cases were dismissed or dropped, according to the Associated Press.", "The San Francisco Police Department was in charge of running the lab, but a Superior Court judge rebuked Harris and her office for violating defendants’ rights, writing in a scathing decision that Harris \"failed to disclose information that clearly should have been disclosed.\"", "The judge also wrote that \"individuals at the highest levels of the district attorney’s office\" knew that the technician, who had a criminal record, \"was not a dependable witness at trial.\"", "As the scandal unfolded, Harris instituted a Brady policy.", "Biden’s account was largely in line with what’s been reported, but he botched a few key details that are worth setting straight.", "For starters, the scandal resulted in the district attorney’s office dismissing or dropping about 1,000 cases, not \"1,000 prisoners freed,\" as Biden said.", "Second, Harris eventually implemented a policy mandating the handover of exculpatory evidence, meaning Biden’s claim that \"she never did it\" was not right.", "Biden also mistook the gender and title of the judge who stepped in to reprimand Harris. The judge, Anne-Christine Massullo, presides in the Superior Court of San Francisco County.", "Defending Harris, her campaign told us, \"Harris was not in charge of the crime lab and did not personally see the memo raising issues about the lab technician. Once the issue was brought to her attention, the senator notified defense attorneys and took the extraordinary step of dismissing an estimated 1,000 drug-related cases — including those of whom had already been convicted and/or sentenced.\"", "That argument is countered by the Wall Street Journal, which claims to have reviewed several memos about the issue that Harris’s staff members sent her in 2005, as well as a memo \"from the desk of Kamala D. Harris\" that went to top staff members and \"indicated that she had seen the recommendations.\" (PolitiFact could not obtain copies of the memos.)", "Harris also seemed to own up to what happened in a March interview with the Washington Post. \"I take full responsibility,\" she said. \"The buck stops with me.\"", "Biden said Harris oversaw a police department that was \"abusing people’s rights\" and did not \"disclose to defense attorneys\" when there was exculpatory evidence: \"She didn't do that. She never did it. And so, what happened? Along came a federal judge and said enough, enough, and he freed 1,000 of these people.\"", "According to the Wall Street Journal, Harris rejected staff recommendations urging her to adopt a \"Brady policy\" in 2005, and that lack of action backfired in 2010 when a scandal broke out and roughly 1,000 drug cases had to be dropped or dismissed. Harris later added such a policy.", "Overall, Biden’s statement is largely accurate but needs a few clarifications, including that there were 1,000 cases dismissed or dropped, not 1,000 prisoners freed.", "We rate this statement Mostly True.", "CNN, \"Watch night two of the CNN debate: Part 3,\" July 31, 2019", "Superior Court of the State of California County of San Francisco, Decision from Judge Anne-Christine Massullo, May 17, 2010", "U.S. Supreme Court, Brady vs. Maryland, May 13, 1963", "The Wall Street Journal, \"Kamala Harris Didn’t Act for 5 Years on Policy to Help Ensure Fair Trials,\" June 10, 2019", "The Washington Post, \"Crime lab scandal rocked Kamala Harris’s term as San Francisco district attorney,\" March 6, 2019", "The Mercury News, \"1,000 San Francisco drug cases to be dismissed in lab scandal,\" April 1, 2010", "SFGate, \"Judge rips Harris’ office for hiding problems,\" May 21, 2010", "CNN, \"Fact check: CNN’s Democratic debate, night 2,\" Aug. 1, 2019", "FactCheck.org, \"FactChecking July’s Round Two Debate,\" Aug. 1, 2019", "The Sacramento Bee, \"Fact check: Did Kamala Harris block evidence that would have freed inmates?\" July 31, 2019", "The New York Times, \"Debate Fact Check: What Were They Talking About, and What Was True?\" July 31, 2019", "NBC News, \"Fact-check: The July Democratic debate 2019, Night 2,\" July 31, 2019", "ABC News, \"Democratic debate night 2: Fact-checking the candidates on the issues,\" Aug. 1, 2019", "Email interview with Andrew Bates, rapid response director for Joe Biden’s campaign, Aug. 1, 2019", "Statement from Kamala Harris’s campaign, Aug. 1, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]