["The photos were published here on Facebook on November 16, 2020. The post has been shared 197 times.", "The post’s Burmese-language caption translates to English as: “Minister of Religious Affairs attended Islamic Muhammad's Day celebration. #Buddhist pagodas are not open yet #Buddhist monasteries are not allowed to practice fasting yet. #Credit”", "As per this statement released by Myanmar's Ministry of Health and Sports on November 19, 2020, people are advised to “stay at home as much as possible” as part of the country's efforts to curb the spread of the novel coronavirus.", "The release reads, in part: “In order not to get infected the coronavirus, we would like to request the public not to travel if there is no important matter, avoid public gathering and stay at home as much as possible by abiding the rules released by the Myanmar Ministry of Health and Sports.”", "COVID-19 ရောဂါ ကူးစက်ပျံ့နှံ့မှုမရှိစေရေး ပြည်သူများ နေအိမ်တွင်နေထိုင်ရေး ပန်ကြားချက်  (၂၀၂၀ ပြည့်နှစ်၊ နိုဝင်ဘာလ ၁၉ ရက်)", "Myanmar reported its first cases of Covid-19 on March 23, 2020, as AFP stated here.", "The photos were also shared in this post on November 16, 2020 alongside a similar claim.", "They were published again, alongside a similar claim, on Facebook here, here, here, here, here and here.", "The first photo was also published here with a similar claim on Twitter.", "However, the claim is false.", "A reverse Google image search found the photos were published here by Myanmar-based media site One News Myanmar on November 16, 2019.", "The report's Burmese title states: “The Ministry of Religious Affairs urges loyalty to the country by following religious teachings”.", "It reads, in part: “Thura U Aung Ko, Union Minister of Religious Affairs and Culture said that every citizen should follow the teachings of his or her religion and be loyal to the country. He made the remarks at the opening ceremony of the Prophet Mohammed's Birthday at the M3 Food Center in Rangoon on the morning of 16 November (2019).”", "Below are screenshot comparisons of the photos in the misleading post (L) and the One News Myanmar report (R):", "Myanmar government media also reported here and here that the Minister joined the event in 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]