["Lt. Gov. Carlos Lopez-Cantera introduced U.S. Sen. Marco Rubio at the Miami-Dade County Republican Party's annual Lincoln Day dinner in June 2015. Lopez-Canter is running for Rubio's Senate seat. (Miami Herald.)", "Lt. Gov. Carlos Lopez-Cantera became the first Hispanic candidate to enter the Florida Senate race to replace U.S. Sen. Marco Rubio on July 15.", "Florida Democratic Party chair Allison Tant leveled a series of charges against the Republican, but the one that caught our attention was this one: that Lopez- Cantera \"voiced enthusiastic support for bringing an Arizona-style immigration law to Florida, calling the measure 'common sense.’ \"", "Lopez-Cantera, who was born in Spain to Cuban parents, is hoping to draw part of his support from Hispanic voters. Is it true that he was an enthusiastic supporter for an Arizona-style law, which some Hispanics feared would lead to racial profiling?", "Tant has omitted the full story about what Lopez-Cantera said about bringing such a law to Florida.", "What Lopez-Cantera said about the law in 2010", "Signed into law by Arizona Gov. Jan Brewer in 2010, SB 1070 requires police who stop a person to verify his or her immigration status if the officer reasonably suspects the person of being in the country illegally. (The U.S. Supreme Court upheld the key part of the law about police stops but struck down other portions in 2012.)", "In Florida at the time, two GOP candidates for governor -- Attorney General Bill McCollum and Rick Scott -- both expressed support for the law. Once elected however, Scott broke his promise to bring such a law to Florida.", "As PolitiFact Florida noted in 2014 after Scott chose Lopez-Cantera as his new No. 2, Lopez-Cantera expressed mixed views about an Arizona-style law between 2010 and 2011.", "\"As far as I’m concerned, I don’t think Florida has a problem like Arizona does,\" state Rep. Lopez-Cantera told the Miami Herald in May 2010. \"I realize there’s a problem in Arizona. They have a serious problem, but I don't think you can compare it to Florida.\"", "In August 2010, Lopez-Cantera told the Tampa Bay Times: \"I am concerned that this could jeopardize civil liberties.\"", "In November 2010, as Rep. William Snyder, R-Stuart, was drafting a bill for the upcoming session, Lopez-Cantera told the Tampa Tribune, \"As far as what the House is focusing on for the next year, I can tell you that's not high on the priority list,\" adding the House's primary concern was about the economy, not immigration.", "What Lopez-Cantera said about the law in 2011", "As House majority leader and Miami-Dade’s delegation chair in 2011, Lopez-Cantera had to deal with two conflicting viewpoints within the GOP: hardliners who wanted a crackdown and Hispanic lawmakers and constituents who viewed such a push as anti-Hispanic.", "Legislators introduced the Florida Immigration Enforcement Act as HB 7089 and a similar bill in the Senate, SB 2040. The bills were not identical to Arizona’s law, but for immigrant advocates it raised fears that it would increase racial profiling. Some business-backed groups also raised concerns because there was a component that related to employers.", "The House bill would have required police to check the immigration status of a subject of a criminal investigation if the police had \"reasonable suspicion\" the person was in the country illegally. Also, employers would be required to check workers’ immigration status. The Senate counterpart didn’t go as far and only let police police check the status of an inmate -- not a person under investigation -- and it gave some wiggle room to employers.", "In March 2011, the House judiciary committee passed the bill 12-6. Lopez-Cantera wasn’t a member of that committee. But in his press release after the vote -- as Tant noted in her attack -- he spoke positively about the bill.", "\"Chairman Snyder and the Judiciary Committee recognize the unique and diverse history of our state and have worked hard to bring all stakeholders to the table to produce this piece of common sense, Florida immigration reform. This legislation is designed to preserve employment opportunities for Floridians through the use of the E-Verify system.", "\"The bill does not require law enforcement officers to ask individuals for immigration documentation during routine traffic stops. It does, however, give law enforcement officers the tools necessary to enforce the immigration laws of the United States.", "\"I look forward to watching this reasonable and effective approach to immigration reform work its way through the legislative process.\"", "Lopez-Cantera didn’t state in the press release how he would vote on the bill.", "Activists opposing the bills turned up the heat and targeted Lopez-Cantera, holding a protest in front of his office.", "While the attacks were going on, the Herald reported that Lopez-Cantera planned to vote against the bill. \"Florida doesn’t need an immigration law,\" he said in April 2011.", "While the Senate passed a version of the bill, it never reached the full House, so Lopez-Cantera didn’t vote on it, and the bill died.", "(A press release from the Florida Democratic Party with Tant’s quote said that Lopez-Cantera \"voted\" for the law, but when we asked about that party spokesman Max Steele said it should have said \"supported.\")", "In 2014, PolitiFact Florida fact-checked a claim by the Democratic Hispanic Caucus Miami-Dade chapter that in 2011 \"Lopez-Cantera 'staunchly supported' a Florida bill modeled after Arizona’s immigration law.\" We rated that claim Mostly False.", "Steele defended Tant’s claim about Lopez-Cantera’s comments and support for the law.", "\"I can understand why the previous claim that he ‘staunchly supported’ the measure would receive the ruling it got, but our claim is that he ‘voiced enthusiastic support’ and called it ‘common sense,’ \" Steele said. \"He did voice support. He did call it common sense. The fact that he had other feelings at other times doesn’t change his praise of this measure in his capacity as majority leader.\"", "A campaign adviser for Lopez-Cantera had nothing to add beyond our previous findings.", "Our ruling", "Tant said that Lopez-Cantera \"voiced enthusiastic support for bringing an Arizona-style immigration law to Florida, calling the measure 'common sense.’ \"", "Lopez-Cantera did call such a bill \"common sense,\" and he expressed support for it after a committee voted in favor in March 2011. However, Tant omits that in 2010 Lopez-Cantera said he didn’t think such a law was necessary and by April 2011, after he took heat over it, he said he wouldn’t vote for the bill — and he never had to.", "Tant has cherry-picked one statement Lopez-Cantera made in favor of the bill while ignoring multiple statements he made opposing it. We rate her claim Mostly False.", "Florida Democratic Party, Press release, July 15, 2015", "Arizona Republic, \"Arizona Immigration law: Supreme Court upholds key portion of Senate Bill 1070,\" June 25, 2013", "Tampa Tribune, \"Immigration law push alive,\" Nov. 26, 2010", "PolitiFact Florida, \"Democratic Hispanic group says Lopez-Cantera ‘staunchly supported’ an immigration enforcement bill,\" Jan. 21, 2014", "National Immigration Law Center, \"Florida’s anti-immigrant legislation,\" April 22, 2011", "Democratic Hispanic Caucus of Florida Miami-Dade County chapter press release, \"Rick Scott wants the Hispanic vote but does not deserve it,\" Jan. 16, 2014", "Florida Democratic Party press release, \"Wrong for Florida: Just like Rick Scott, Carlos Lopez-Cantera supported Arizona-style immigration laws,\" Jan. 2014", "Florida House, Judiciary committee vote on HB7089, March 10, 2011", "Florida Senate, SB2040, Senate vote May 4, 2011", "Florida House Majority Office, Statement by House Majority Leader on Florida Immigration Enforcement Act, March 10, 2011", "Facebook, We are Florida! post about rally, April 16, 2011", "Miami Herald, \"Radio ads turn up heat on immigration,\"April 20, 2011", "Miami Herald, \"Activists avow court fight against anti-immigration legislation,\" April 21, 2011", "Miami Herald/Tampa Bay Times, \"Immigration crackdown moves in Florida House,\" March 11, 2014", "Miami Herald’s Naked Politics blog, \"McCollum’s Cuban supporters ok with his stand on Arizona’s immigration law,\" May 13, 2010", "Tampa Bay Times, \"McCollum unveils bill on illegals,\"Aug. 12, 2010", "Miami Herald, \"Hispanics urge Rick Scott: reduce immigration emphasis,\" Sept. 1, 2010", "Miami Herald Naked Politics blog, \"Rick Scott’s LG, Lopez-Cantera, is a deal-making loyalist, Marco Rubio-pal,\" Jan. 19, 2014", "Palm Beach Post, \"Immigration debate: Bill splits GOP, Cuban-American base,\" April 23, 2011", "New York Times, \"Supreme Court decision on Arizona immigration law,\" June 25, 2012", "PolitiFact Scott-O-Meter, Bring Arizona’s immigration law to Florida, Most recent update June 25, 2012", "Interview, Max Steele, Florida Democratic Party spokesman, July 15, 2015", "Interview, Rick Wilson, campaign senior adviser for Carlos Lopez-Cantera, July 15, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]