["A photograph has been shared widely on social media, which shows an advertisement of a Congress party on a van. Those who have shared this image have claimed that the van is a mortuary van, and ridiculed the Congress party for using it for its political campaign.", "कांग्रेस मनोरंजन पार्टी", "Posted by The India Eye on Monday, August 13, 2018", "The above post is by a Facebook page The India Eye. It has over 1.8 million followers. This photograph was posted on August 13, 2018 and so far, it has been shared over 2600 times. The text on the image says कांग्रेस मनोरंजन पार्टी (Congress manoranjan party) and reads “देश को लूटने वाली कांग्रेस के पास इतने पैसे भी नहीं क्या जो शव ले जाने वाली गाडी से प्रचार करने में जुटी है” (Congress which looted the country does not even have money, they are using a mortuary van for political campaigning- translated). The photo and the accompanying message has also been shared widely on Twitter where it has been tweeted by many right-wing users.", "अच्छा ! इंतेज़ाम भी कर लिया पहले खुद ही गले मिले,आंख रहे फिर मार..! शव वाहिनी रथ से कर रहे खुद का प्रचार..! सोनिया तोहरे लाल की,माया अपरम्पार..! इसी तरह लगे रहो मोदी जी करेंगे तुमको तड़ीपार…!! कुछ बचा है लिखने के लिए ?? pic.twitter.com/GiEk2yscvf", "— Bablu Sharma 🇮🇳 ‏ (@Bsharma7) July 21, 2018", "The person who posted this tweet is followed on Twitter by Prime Minister Narendra Modi. Numerous other social media users who are followed by the Prime Minister and ministers of the Central Government have shared this photograph which clearly shows शव वाहिनी (mortuary van) written on it.", "A simple Google reverse image search reveals that the photograph that is circulating on social media is photoshopped. In the original image, there is no mention of शव वाहिनी or mortuary van written on the vehicle. The original image was found in a report by News18 of July 18, 2018, according to which the picture of Congress leader Digvijaya Singh was missing from the party’s campaign launched in the state.", "As can be seen in the juxtaposed images above, in the photoshopped image the words shav vahini can be seen on the vehicle which are not present in the original photo. Also, the side grill of the vehicle is missing in the photoshopped image.", "This photoshopped image has been doing the rounds on social media over the past few weeks, since the Jan Jagran Yatra, a mass outreach programme of the Congress party ahead of the Madhya Pradesh assembly election was announced in July, 2018. This photoshopped image has already been debunked by Navbharat Times and Boom.", "With election to the Madhya Pradesh assembly barely a few months away, hectic political campaigning is already underway on social media. Through this photoshopped image, an attempt was made to portray the Congress as a desperate party which will stoop to new lows for votes.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]