["Trump tweets claim of \"serious voter fraud in Virginia, New Hampshire and California.\"", "Two weeks after winning the 2016 election, President-elect Donald Trump is back on the voter fraud attack -- claiming millions of people voted illegally, thereby robbing him of the popular vote.", "On Sunday night, Trump unleashed a barrage of tweets claiming - without evidence - that he would have won the nation’s popular vote \"if you deduct the millions of people who voted illegally.\" By the latest tally, Trump’s Democratic rival Hillary Clinton won the country’s popular vote by more than 2 million votes, but lost the Electoral College contest that decides the election.", "Trump followed up with a second tweet alleging \"serious voter fraud\" in Virginia, California and New Hampshire, three states that voted for Clinton on Nov. 8.", "While our friends at PolitiFact national have examined whether millions of people voted illegally, here in New Hampshire we wanted to look into whether \"serious voter fraud\" existed in the state.", "Voter fraud in N.H.?", "To get right to the point, top election officials in the New Hampshire Secretary of State’s Office, New Hampshire Attorney General’s Office and U.S. Attorney’s Office in New Hampshire all said they have received no complaints of voter fraud in the most recent election.", "On Monday, Trump spokesman Jason Miller cited a national study done by the Pew Research Center showing that approximately 24 million voter registrations in the United States are no longer valid or inaccurate. However, no one from Trump’s office has offered any evidence of \"serious voter fraud\" in New Hampshire.", "While New Hampshire is not without election day fraud, it has not happened on a widespread scale.", "In New Hampshire, the attorney general’s office has prosecuted two criminal fraud cases, one civil fraud case and investigated other complaints since 2012, Assistant Attorney General Brian Buonamano said.", "Buonamano told the Associated Press he has no evidence to back up Trump’s claims. Buonamano said his office is looking into fewer than five complaints that involve possible voter fraud since 2012 and none so far this election. (He didn’t provide an exact number.)", "About 729,000 people voted on Nov. 8 in New Hampshire, according to the Secretary of State’s office.", "Historically, instances of voter fraud-- even allegations -- have been scant in New Hampshire, according to Secretary of State Bill Gardner, the state’s top election officer.", "\"I have no basis to say it’s rampant, and there are ways we can deal with it,\" Gardner said earlier this month.", "State law requires voters to show a valid ID at the polls. If they don’t have one, their picture is taken and they have to sign an affidavit swearing they are who they say they are. After the election is over, the Secretary of State’s office will send out confirmation letters to those people to check their identities.", "\"If you’re someone who shouldn’t be voting, you’re probably not going to want your picture taken,\" Gardner said in an interview Monday. \"We’ve done a lot to protect the integrity of the election process.\"", "Assistant U.S. Attorney Mark Zuckerman said his office received no complaints of voter fraud in the most recent election. Zuckerman has served as the district elections officer in New Hampshire for the last 10 years.", "\"Local election officials, from what I can see, take their responsibility very seriously and undertake to run as transparent and trouble free elections as they can,\" Zuckerman said. \"We haven’t seen those incidents occur.\"", "Eyes on the polls", "Because of speculation of voter fraud leading up to the election, both Republicans and Democrats employed volunteer poll watchers to monitor the voting process.", "One of those watchers was Chip Fagan, a Willis, Mass. resident who volunteered to observe the polls in the town of Bow for the New Hampshire Republican Party on election day.", "\"Everything here is pretty well organized,\" Fagan said on Nov. 8. \"They’ve got backup systems for backup systems. They’re really well organized, from the traffic direction to the set up. We want to make sure everyone has the chance to vote.\"", "Nashua City Clerk Tricia Piecuch said she noticed nothing out of the ordinary on Election Day in the state’s second largest city, located on the border with Massachusetts. Though the lines were long, she said, things ran smoothly.", "\"We did not receive any reports of any issues,\" Piecuch said. \"The hype with this election is you always are prepared for the worst and hope for the best. We were prepared.\"", "Piecuch said she had learned the news of Trump’s tweet on a thread with other local election officials in New Hampshire, who were talking about the president-elect’s latest allegation.", "\"They would like to see the proof,\" Piecuch said.", "New Hampshire receives so few election complaints that the Attorney General’s Office currently has one part-time attorney dedicated to them. But that doesn’t mean they’re all dealt with swiftly. The office recently asked for more money to fund an additional employee to help investigate a backlog of about 50 election-law complaint investigations that are still open. Some date back to 2012.", "Trump’s claim is similar to one made by Governor-elect Chris Sununu in the final weeks of the November election. He claimed New Hampshire Democrats were rigging elections by busing in Massachusetts residents to vote on election day.", "New Hampshire’s election officials said just three voter fraud cases have been prosecuted in the last four years, and Sununu could offer no evidence of Democrats busing out-of-state voters in on Election Day. Politifact NH rated that claim Pants on Fire.", "Our rating", "Trump claimed \"serious voter fraud\" existed in New Hampshire and two other states on election day, Nov. 8.", "Those in charge of overseeing New Hampshire’s elections and investigating election complaints said any instances of voter fraud in the state have historically been extremely rare. The most recent election was no exception, with no complaints of voter fraud filed in an election in which more than 728,000 ballots were cast.", "It’s a reckless claim with zero evidence.", "We rate the claim Pants on Fire.", "Donald Trump Twitter post, Nov. 28, 2016", "PolitiFact NH, \"Republican candidate for governor Chris Sununu says Mass. voters bused across border to vote in NH,\" Nov. 5, 2016", "Politifact, \"Donald Trump's baseless claims about the election being 'rigged',\" Aug. 15, 2016", "Pew Center on the States, \"Inaccurate, Costly, and Inefficient, Evidence That America’s Voter Registration System Needs an Upgrade,\" February 2012", "Interview with New Hampshire Secretary of State Bill Gardner, Nov. 28, 2016", "Interview with Asst. U.S. Attorney Mark Zuckerman, Nov. 28, 2016", "Interview with Nashua City Clerk Tricia Piecuch, Nov. 28, 2016", "Associated Press, \"Republicans looking to tighten New Hampshire election laws,\" Nov. 28, 2016", "Concord Monitor, \"Capital Beat: Talk of election complaints touchy subject in State House,\" Nov. 27, 2016", "Concord Monitor, \"Poll monitors keeping an eye out for voter fraud in N.H.\", Nov. 8, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]