["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "House Speaker Nancy Pelosi of Calif., center, and other members of Congress, kneel and observe a moment of silence at the Capitol's Emancipation Hall. (AP Photo/Manuel Balce Ceneta)", "Ghanaian leaders likely wore the Kente cloth in the 1700s and 1800s when they were part of the slave trade, but it was not a mark of a slave trader.", "The cloth took on its modern meaning of black independence starting in the 1800s as a form of opposition to British rule.", "Typically, politicians use words to make a point. But on June 8, congressional Democrats draped themselves in a bright African fabric and knelt in protest of police killing of blacks. The statement might have been wordless, but the blowback was not.", "A Facebook user posted an image of the event with a message of his own about the fabric on the Democrats’ shoulders. It is called Kente cloth.", "\"The Kente cloth was worn by affluent African slave traders,\" reads a June10 Facebook post. \"This would be like honoring Jews by wearing swastikas.\"", "We reached people who study the history of the Kente cloth. They said the post dropped a couple of hundred years of history.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The first Kente cloth emerged about 500 years ago in the area of West Africa now known as Ghana. The dominant group were the Ashanti, who, by the early 1800s, controlled nearly all of the area of present-day Ghana. (Asante is an alternative spelling.)", "The Ashanti played a well-documented role in the European slave trade. In the 1700s, millions of Africans passed through Ghana ports, having been sold to British and Dutch slavers in exchange for weapons and other European goods. The British abolished slavery in 1807, but enforcement of the ban in Western Africa was weak.", "So, at the time of the slave trade, Ashanti royalty wore Kente. However, art historians say that the brilliant colors and patterns of the modern version came after the British banned the slave trade.", "But more important, what happened under the British changed the fabric from something a person wore, to a symbol of who a person was.", "Through the 1800s, the Ashanti fought a long-running battle against the British, until  1902, when Britain declared Ghana a colony.", "\"There was a long tradition of contesting colonial rule by adopting local dress styles by more radical members of the new African middle class that emerged in the British colonies of West Africa,\" said London-based researcher and African textile dealer Duncan Clarke. \"The suggestion that it is a symbol of slave traders is not one I have seen before.\"", "In 1957, Ghana became the first sub-Saharan African British colony to gain independence.", "Kwame Nkrumah, the first African-born prime minister to oversee Ghana following its independence, wore a Kente cloth when he came to Washington to meet President Dwight Eisenhower.", "\"Nkrumah was claiming the mantle of indigenous leadership,\" said Swarthmore College professor of religion James Padilioni. \"The fabric represented the return of self-rule to that land.\"", "African American thought leaders, including sociologist W. E. B. Du Bois and poet Maya Angelou, moved to Ghana in the early 1960s. Padilioni said that by 1970, many black churches adopted the cloth as liturgical vestments, and in the 1980s, Bronx hip-hop artists such as Afrika Bombaataa used it, too.", "\"These are the cultural contexts for why in the U.S., for most black Americans, Kente is about a certain type of black pride birthed during the 1960s Civil Rights movement and the black freedom struggle,\" Padilioni said.", "At the Democratic event, members of the Congressional Black Caucus distributed the Kente cloths to their colleagues. The sight of white politicians draped in the Kente cloth drew barbs from people who saw it as a superficial use of African symbolism. Rep. Karen Bass, D-Calif., head of the Congressional Black Caucus, didn’t see it that way.", "\"The significance of the Kente cloth is our African heritage and for those of you without that heritage who are acting in solidarity,\" Bass told reporters.", "As for the comparison to the swastika and Jews?", "\"Bending and stretching the truth, to say the least,\" said Padilioni.", "Nazi leader Adolf Hitler in 1920 adopted the swastika as the symbol of the National Socialist Party in Germany. It was the central symbol on the Nazi flag and came to represent the party’s goal of racial purification. Under that banner, 6 million Jews were murdered. It is the enduring symbol of the white supremacist movement.", "A post on Facebook said that Democrats wearing the Kente cloth \"worn by affluent African slave traders\" is \"like honoring Jews by wearing swastikas.\"", "A simplified version of the fabric was worn at a time when African leaders were part of the slave trade. No evidence suggests it was the mark of a slave trader.", "In the 1800s, the cloth began to take on the meaning of African identity in opposition to British rule. The first independent prime minister of Ghana wore it when he met Eisenhower in 1958. It became tied to the Civil Rights movement, and was adopted by black clergy and black musicians.", "The people we reached who study textile history say it has never been tied to slavery the way the swastika is tied to Nazis.", "We rate this claim False.", "Facebook, Post, June 10, 2020", "Philadelphia Museum of Art, Kente cloth, accessed June 11, 2020", "BBC, Why were US Democrats wearing Ghana’s kente cloth?, June 9, 2020", "Nanjala Nyabola, tweet, June 8, 2020", "Washington Post, Kente cloth is beloved in Ghana. Why did Democrats wear it?, June 9, 2020", "CSDT.org, Kente cloth, accessed June 11, 2020", "African Arts, Kente Cloth of Ghana, Spring 1970", "African Arts, Ghanaian Interweaving in the Nineteenth Century: A New Perspective on Ewe and Asante Textile History, Winter 2006", "African American Intellectual History Society, The History and Significance of Kente Cloth in the Black Diaspora, May 22, 2017", "Britannica, Asante empire, accessed June 11, 2020", "PBS, Slave kingdoms — Ashanti Kingdom, accessed June 11, 2020", "New York Times, Ghana's Uneasy Embrace of Slavery's Diaspora, Dec. 27, 2005", "William and Mary Quarterly, The Transatlantic Slave Trade in Ghanaian Academic Historiography: History, Memory, and Power, October 2009", "Ohio State University, After Abolition: Britain and the Slave Trade Since 1807, July 2008", "National Museum of African Art, Wrapped in pride: Ghanaian Kente and African American identity, accessed June 11, 2020", "New Yorker, The Embarrassment of Democrats Wearing Kente-Cloth Stoles, June 9, 2020", "Email exchange, Duncan Clarke, independent researcher and African textile dealer, June 11, 2020", "Email exchange, Sarah Fee, senior curator, Global Fashion and Textiles, Royal Ontario Museum, June 11, 2020", "Email exchange, James Padilioni Jr, visiting assistant professor of Religion, Swarthmore College, June 11, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]