["The lengthy claim was published on Facebook here on May 31. It has been shared more than 3,000 times.", "The post contains a photo of a syringe overlaid with Tagalog-language text that states: \"Don’t get vaccinated mate!\"", "Similar posts warning of the purported dangers of vaccines have also been shared on Facebook here, here and here.", "Coronavirus acronym", "The Facebook post's caption states in part: “COVID 19 =means Certificate Of Vaccination Identity with 19, 1=A 9=I for AI= Artificial Intelligence / This is not really the name of the virus, but this is an International plan to control and limit the population.\"", "This claim is false; “COVID-19” stands for “coronavirus disease 2019”, the World Health Organization (WHO) announced on February 11, 2020.", "It was so named following the “guidelines previously developed with the World Organisation for Animal Health (OIE) and the Food and Agriculture Organization of the United Nations (FAO).”", "This WHO document that outlines the best practices in naming new human infectious diseases states: “If the pathogen that causes the disease is known, it should be part of the disease name (e.g. coronavirus, influenza virus, salmonella).”", "COVID-19 is a disease caused by a novel coronavirus. The first major outbreak of the disease was in the Chinese city of Wuhan in late 2019, before it spread to other parts of the world. As of June 18, COVID-19 has claimed more than 445,000 lives worldwide, according to WHO data.", "The new coronavirus that causes COVID-19 has been named “severe acute respiratory syndrome coronavirus 2” or “SARS-CoV-2” by the International Committee on Taxonomy of Viruses, owing to its genetic relation to the coronavirus responsible for the 2003 SARS outbreak.", "Vaccine myth", "The Facebook post also warns against being injected with a potential COVID-19 vaccine. \"Companies and the media are being bribed right now to do mass vaccination,\" it states. \"There are two components to this future vaccine that are not identified yet and still secret. But the third is ' SQUALENE '.\"", "This claim is misleading; as of June 2020, a vaccine for COVID-19 had not been approved by the WHO. Several scientific teams around the world were racing to create a vaccine, as AFP reported here.", "Squalene has also been proven safe to use in vaccines, according to global health experts.", "This WHO information page states: “Over 22 million doses of squalene-containing flu vaccine have been administered. The absence of significant vaccine-related adverse events following this number of\n\tdoses suggests that squalene in vaccines has no significant risk.”", "Squalene is used in FLUAD, a flu vaccine designed for people 65 years and older and approved in 38 countries, the CDC states in this information page. “Squalene, a naturally occurring substance found\n\tin humans, animals and plants, is highly purified for the vaccine manufacturing process.”", "FLUAD’s most common adverse effects “were mild to moderate and were temporary, and included pain, redness at the injection site, headache, muscle aches, and malaise,” the CDC adds.", "5G technology hoax", "The post also repeats false claims about the purported health risks associated with 5G technology. “5G has been installed in cities across the whole world, to weaken our immune defense,\" it states.", "The claim has been repeatedly debunked by AFP and other fact-check organisations.", "Radio wave exposure to 5G has not been shown to have any impact on the immune system or pose any health threats, AFP reported here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]