["Nigerian newspaper the Vanguard claimed that Nigeria is ranked “15th in the world” and “top in Africa” for its suicide rate.", "A Nigerian newspaper quoted a US-based expert on trauma as saying the country has the 15th highest suicide rate in the world and the highest in Africa.", "Nigeria’s suicide rate does place it 15th in the world according to the most recent data.", "But in Africa Nigeria has the seventh highest rate, with Lesotho having the highest.", "​​​​​​Nigeria is ranked “15th in the world” and “top in Africa” for its suicide rate, according to an article on the link between trauma and suicide in the country.", "The June 2019 story in Nigerian newspaper the Vanguard attributed these rankings to Dr Ani Kalayjian, the founder of a US-based organisation that raises awareness about the effects of traumatic events on people.", "Kalayjian was in Nigeria to train local health professionals on trauma management.", "But do these two claims about Africa’s most populous country check out?", "\"Nigeria ranks 15th in the world for its suicide rate”", "We contacted Kalayjian to check if the statistics were correctly attributed to her. “Yes [for the] suicide rate as per World Health Organization (2016) Nigeria is at 15th in the world,” she said.", "In 2018, Africa Check investigated a similar claim that Nigeria had 15 suicides per 100,000 people every year. We found that the accurate crude suicide death rate was lower, at 9.5 suicides per 100,000 people in 2016.", "This was according to global mortality statistics from the WHO’s 2016 Global Health Observatory data repository.", "The crude suicide rate is the number of suicide deaths in a year, divided by the population and multiplied by 100,000. As Nigeria is one of a number of countries that do not yet have high quality data, the WHO used mortality rate models to determine this rate.", "The 2016 global health estimates were still the most recent global data on suicide rates, Oye Gureje, a professor of psychiatry, told Africa Check. He is also director of the WHO mental health research and training centre at the University of Ibadan. The estimates were last updated in 2018.", "Two estimated mortality rates from suicide are given, namely age-standardised and crude. This is according to Dr Alexandra Fleischmann, a scientist at the department of mental health and substance abuse at the WHO.", "“For comparisons between countries, age-standardised rates are the most appropriate to look at,” Fleischmann told Africa Check.", "The age-standardised rate adjusts for differences in the age distribution of the population, assuming a standard population for all countries, she said.", "“Indeed, according to the GHE for 2016, Nigeria ranked 15th in the age-standardised suicide rate in the world,” Fleischmann said.", "On this, Kalayjian was correct, even if she had a higher crude suicide rate.", "“Nigeria has the highest suicide rate in Africa.”", "WHO data shows Nigeria had an age-standardised suicide rate of 17.3 per 100,000 people in 2016, which placed it seventh on the continent.", "Lesotho had the highest suicide rate on this score, at 28.9 suicide rates per 100,000 people. On the other side of the scale, Morocco had the lowest.", "Further reading:\nhttps://africacheck.org/reports/spectator-index-tweet-exaggerates-nigerias-suicide-rate/\nhttps://africacheck.org/reports/1-5-nigerian-adults-suffer-long-term-depression-world-bank-revises-brief/", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]