["“If your child gets this virus their going to hospital alone in a van with people they don’t know to a room they don’t know to be with people they don’t know,” warns a poster that was shared on social media as a photo on March 25, 2020. “Think about it. Stay In,” the post adds.", "However, this post is misleading and hospitals AFP contacted in Canada allow visits from one parent or guardian.", "With more than 20,000 confirmed cases on April 23, 2020 the French-speaking province of Quebec is by far the hardest hit in the country, despite having implemented some of the most drastic confinement rules in Canada, with intercity movement forbidden.", "Bryan Gélinas, a spokesman for Quebec’s largest hospital network, the CHU de Québec-Université Laval, told AFP by email, “No policy corroborates this publication.”", "“A COVID-19 positive minor can be accompanied by a parent,” Gélinas added. However, a parent would then also be considered COVID-19 positive and would be confined in the child’s room.", "Restricting visitors is necessary as the virus is mainly transmitted by respiration and physical contact, and a patient can already be contagious even before the first symptoms appear.", "In the central province of Ontario, Canada’s most populous and second most affected by the pandemic with more than 12,000 confirmed cases, rules are not as drastic. At Sick Kids, a pediatric hospital in Toronto, new rules for COVID-19 stipulate that “only ONE adult caregiver per patient is allowed in the hospital.”", "Gillian Howard, a spokeswoman for the University Health Network, which oversees four hospitals in Toronto, said that “if you are in close contact with someone who is COVID positive, you would be asked to wear a mask while in the hospital, and self-isolate at home.”", "In the western province of Alberta, although provincial health authorities have mandated that no visitors will be permitted to visit patients, there are several exceptions to the rule, including for pediatric patients.", "Only one visitor is allowed at a time, but the Alberta Health Services COVID-19 web page specifies that “the unit manager/charge nurse may, in rare situations, approve two visitors at one time on a case-by-case basis.” Alberta had 3,400 confirmed cases.", "Similarly, the British Columbia’s Children Hospital in Vancouver allows only one adult caregiver for outpatient clinics, two adult caregivers for in-patient areas, and one adult caregiver visit for children in the emergency department.", "Although British Columbia was one of the first areas affected by the pandemic in Canada, its number of confirmed cases is stable at just over 1,700.", "Provincial health authorities declined to share the ages of COVID-19 patients in their jurisdiction. A report by the Canadian Paediatrics Society on the novel coronavirus in children mentions that symptoms in children are similar to those in adults “namely fever, dry cough and fatigue.”", "The same flyer circulated in the US, where AFP Fact Check also found it to be misleading.", "AFP Fact Check has debunked more than 365 examples of misinformation about the novel coronavirus crisis.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]