["As the farmers’ protest now enters its fourth month, social media has been rife with a number of different viral claims linked to the ongoing movement, many of which were proven to be false. Recently, a graphic containing the picture of farmer leader VM Singh was widely shared. Users are claiming that Singh is part of the Congress party and has been participating in demonstrations in support of farmers despite owning property worth Rs 631 crores. The claim is viral against the backdrop of Congress leader Rahul Gandhi targeting the centre over its closeness to billionaire industrialists Ambani and Adani. Viral messages have hinted at political conspiracies behind the protests, alleging that Congress members are leading the farmers’ agitation., “Congress leader who owned property worth Rs. 631 crore in 2009 is now posing as a farmer and helping run the movement. You must have seen Rahul Gandhi repeatedly taking shots at Ambani and Adani. Now, check out the reality of these so-called Congress farmers,” wrote Avinash Srivastava. (Archive link)", "साल 2009 मे 631 करोड़ की संपत्ति का मालिक कांग्रेस नेता किसान बन के आन्दोलन चलाने में सहयोगी है। राहुल गांधी को आपने…", "Posted by Avinash Srivastava on Sunday, December 13, 2020", "Twitter user @BefittingFacts also shared the claim. This account has been repeatedly found promoting misinformation. It was also permanently suspended by Twitter multiple times in the past yet continues to operate under a changed username against Twitter policy. (Archive link)", "Sardar V M Singh demanding MSP Law is a Congress leader. He was Lok Sabha candidate from Pilibhit. In 2009 he has assets worth ₹6.32 billion. #GareebKisaan pic.twitter.com/Sn9a8Sl4Gm", "— Facts (@BefittingFacts) December 12, 2020", "In an article dated December 12, 2020, right-wing website OpIndia called VM Singh a Congress leader. In fact, this is not the first time it has identified Singh as a party member. (Archive link)", "OpIndia’s article was tweeted by RSS ideologue and RBI director Swaminathan Gurumurthy (archive link). Gurumurthy has shared a number of false claims on social media. You can find a detailed report on these claims here.", "All his sins are washed by media. ‘Farmer leader’ VM Singh protesting against farm bills is actually a Congress leader accused in 8 cases, has assets worth Rs 631 crores according to his list of assets for Pillibhit Lok Sabha seat for 2009 https://t.co/rpYHmxKIko via @OpIndia_com", "— S Gurumurthy (@sgurumurthy) December 13, 2020", "The graphic is being circulated widely on Twitter and Facebook.", "Two different claims have been made about VM Singh on social media. The first is that he is a Congress leader, and second, he has assets worth Rs. 631 crore. This article will fact-check both claims separately.", "Is VM Singh a Congress leader?", "VM Singh left the Congress in 2012 and joined the Trinamool Congress (TMC). He has contested elections as a Congress candidate in 2007 and 2009. After his exit from the party, he contested from a TMC seat from UP’s Barkhera. According to a 2015 Times of India report, he is also the first cousin of BJP leader Maneka Gandhi. Singh launched the Rashtriya Kisan Mazdoor Party on December 23, 2015, and fielded 21 candidates from his party in the 2017 elections. However, none of them won. Singh’s Twitter bio also states ‘Ex MLA’ and ‘Proud Farmer’.", "Alt News reached out to VM Singh’s office about his supposed affiliation to the Congress and were told he is not a member of the party any more. He had left Congress back in 2012 to continue working for farmers. Singh had a falling out with the then Congress government at the centre regarding farmers’ issues and later formed a party of his own in 2015.", "What is VM Singh’s net worth?", "Alt News found an Economic Times report dated April 24, 2009, which mentions that VM Singh was the richest candidate with declared net worth of Rs 631 crore. Using ‘My Neta’ database, we discovered that he owned assets worth more than Rs. 632 crore.", "Singh’s office told Alt News that all the property he owns is agricultural land. According to The Economic Times, he has two non-agricultural plots, reported to be worth close to Rs 206 crore. Apart from this, he owns agricultural land estimated to be valued at Rs 414 crore. He also owns three vehicles and two houses worth Rs 14 lakh and Rs 11 crores respectively.", "It is worth mentioning that VM Singh was the convenor of the All India Kisan Sangharsh Coordination Committee (AIKSSC) until recently. The Hindu reported on December 14, 2020, that he was removed from this post. An Aaj Tak report dated December 13, 2020 stated that AIKSSC did not agree with Singh’s statement about the MSP Guarantee Act and had distanced themselves from it.", "To sum up, farmer leader VM Singh resigned from the Congress party in 2012. While he does own assets valued at Rs 632 crore, he is no longer affiliated to the Congress.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]