["About this rating", "In January 2020, readers asked us about a wave of widely shared social media videos that some observers presented as evidence that Prince Charles had \"snubbed\" or ignored U.S. Vice President Mike Pence at an official event, failing or refusing to shake Pence's hand.", "The video clips emerged from the World Holocaust Forum in Jerusalem on Jan. 23. The footage shows Prince Charles apparently arriving at the event, greeting several people standing or sitting in a row, but not shaking hands with Pence or his wife, the second lady Karen Pence. Several Twitter users claimed the clip was evidence that Charles had \"snubbed,\" or \"shunned,\" or otherwise made some loaded, meaningful, negative gesture by not shaking hands with the vice president in that instance:", "A similar clip was also posted to Facebook by the right-leaning radio host Wayne Dupree, along with the following description \"Prince Charles Snubs VP Mike Pence.\"", "Charles clearly did not shake hands with either of the Pences, in that instance, but the claim that that was part of a broader, negative comportment towards the vice president and second lady, or that Charles \"snubbed\" or ignored them, is not supported by available evidence.", "Firstly, Charles did actually greet Pence as the prince shuffled past him. The most authoritative video available, that posted by Israel's official Holocaust memorial Yad Vashem, clearly shows that Charles greeted the vice president, saying \"Mr. Pence\" (headphones might be required):", "Secondly, neither of the Pences extended their hands for a handshake, either. The claim that Charles \"snubbed\" them would require an interaction in which he turned down a greeting or handshake that was offered to him. That was not the case in the instance shown in the videos. In fact, both Pences stood with their fingers interlaced or hands folded as Charles walked past, meaning their hands were not readily available for a handshake in the first place.", "After Charles moved past the couple, Pence's hand appeared for a moment in the video, at first glance giving some viewers the impression he had been holding his hand out for a handshake. However, on closer inspection the video footage clearly shows that Pence's hand was extended because he had patted Prince Charles on the arm:", "Finally, there is a simple explanation for the absence of a mutual handshake between Charles and each of the Pences — they had already met, greeted one another, and shaken hands before the moment shown in the widely shared video clips.", "Pence's spokesperson, Katie Waldman, later posted to Twitter a 30-second video showing that earlier greeting between the three. It clearly shows mutual handshakes and cordial greetings between Charles and both Pences, along with some friendly looking conversation (the audio was removed from the video, so we can't tell what they said to one another):", "That video evidence corroborates the explanation a spokesperson for the Royal Family provided to BBC, saying that: \"The prince and Mr Pence had a 'long and warm conversation' before the ceremony began.\"", "The absence of a handshake later on was not a snub by Charles towards the Pences, any more than it was a snub by the Pences towards Charles. The three had simply already performed their mutual \"meet-and-greet.\"", "BBC News.  \"Did Prince Charles 'Snub' U.S. Vice-President Mike Pence?\"\r\n  23 January 2020.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]