["On November 30, Twitter user @_shwetanshi posted two photos of a man with severe head injuries and wrote, “रात को कुछ मुस्लिम लड़के हिंदू लड़कियो को परेशान कर रहे थे उस वक्त धवल बारोट #महेसाना (गुजरात) से है #विश्व_हिन्दू_परिषद के कार्यकर्ता हैं उन्होंने लड़कियों को बचा लिया और सही सलामत घर भेज दिया जिहादियों को पता चलते ही धवल बारोट को लड़के बुला कर जेहादियों ने तलवार और पाइप से मारा (Some Muslim boys were harassing Hindu girls at night. Dhaval Barot, a member of Vishva Hindu Parishad, saved the girls and sent them home. As a result, the Jedhadists thrashed Dhaval with sword and pipe).” This post has been retweeted and liked more than 550 times.", "[Warning: Images might be disturbing for some users. Viewer discretion is advised.]", "Twitter user @mdhaka21 posted a similar tweet on December 1 but with a slight variation. In this post, the user shared only one of the images and added that 15-20 people thrashed Dhaval. The tweet received over 1,000 likes and retweets.", "Upon searching the phrase “धवल बारोट #महेसाना (Dhaval Barot #Mehsana)” on Twitter and Facebook, Alt News found that these images are being circulated on social media with similar claims since September.", "On September 12, GSTV News, an Ahmedabad-based news channel, reported the incident as “love jihad.” A video from the outlet’s official YouTube channel shows both the anchor and the correspondent referring to the incident as “love jihad.” The victim is addressed as Dhaval Brahmbhatt.", "Alt News couldn’t trace the source of the viral images, however, they seem authentic because similar images of Dhaval have been used by GSTV News and Divya Bhaskar.", "However, unlike on social media, Dhaval’s last name is reported as Brahmbhatt and not Barot. A report from September 13 in Divya Bhaskar includes a statement from DYSP Manjita Vanzara according to which this was a personal quarrel, not a communal dispute.", "Alt News contacted Mehsana police and found that Dhaval knew the people who attacked him. The police also informed that the claim that Dhaval was protecting Hindu girls from ‘Jihadists’ is baseless. The police confirmed that Dhaval was attacked with a sword and wooden-logs. They added that both the parties are looking to solve the case legally.", "Furthermore, the FIR of the case is available on the Gujarat Police website.", "According to FIR filed by Dhaval (I/0136/2019), his full name is Dhavalkumar Mukundbhai Shantilal Brahmbhatt. Dhaval accuses Kushal Thakor, Sharukh, Yashr, Ejaj Khan and an unknown person for the assault. He claimed to have reprimanded the group for sitting with girls at night. In response, the accused attacked Dhaval with a sword and a wooden-log. It is noteworthy that one of the accused mentioned in the FIR hails from the same community as Dhaval.", "The FIR (II/0206/2019) filed by the persons who allegedly assaulted Dhaval was lodged by Almas Khan (s/o Ashraf Khan Pathan). It mentions Dhaval and one Viki as the accused. According to Khan, he attacked in provocation by Dhaval.", "The FIRs filed by both parties make it clear that there is no element of communal violence. Social media claims and the report by GSTV are false.", "[Update: The photographs have resurfaced on social media with the same false communal narrative in light of the coronavirus pandemic. From the Facebook account of one Surya Bhai, they were posted on April 10, 2020, and have received 2,000 shares so far.]", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]