["Viral photos of large letters on a mountain that spell out \"TRUMP\" – similar in style to the iconic Hollywood sign – caused controversy on social media as users suggested there were political motives behind the sign's removal.", "The posts claim that California officials took it down because it \"might distract drivers\" but disregard other large billboards on LA freeways.", "“The sign went up on a private property in Los Angeles Tuesday morning. It was far from the 405 freeway but visible because it was on a hillside,” reads a Facebook post Oct. 8. “Within a few hours, California government officials went onto the private property and took it down, saying it ‘might distract drivers.’”", "Similarversions of the claim have been shared widely across Facebook.", "\"Whether you like the sign or not a government that can do something like that should enrage and concern EVERYONE no matter what side you're on,\" one user wrote.", "USA TODAY was unable to reach the posters for comment.", "President Donald Trump shared a video of the sign on Twitter and wrote, \"Vote TRUMP California. No more blackouts, shutdowns, ridiculous forrest fires, or water “rationing” (coming soon). We can win in California NOW!\"", "Fact check: Fake Trump quote about battling coronavirus, his body", "Lauren Wonder, chief public information officer for the California Department of Transportation, told USA TODAY the sign was removed from the sight of drivers in response to a safety concern by the California Highway Patrol.", "\"The sign did not meet state regulations for temporary political signs within view of a state highway, and state law directs Caltrans to remove unauthorized signs,\" she said in an email.", "Section 5405.3 of the State Outdoor Advertising Act allows an exemption for the placement of \"Temporary Political Signs\" along certain highways; however, there are restrictions.", "“These signs are not to be placed within the state right-of-way. In addition, signs cannot be visible within 660 feet from the edge of the right-of-way of a classified ‘landscaped freeway,’” the text reads.", "Fact check:Some of viral post's facts that 'stand up for the Golden State' lack context", "The letters went up overnight along the northbound 405 Freeway, according to CBS Los Angeles.", "KTLA reported that the California Highway Patrol's incident log shows that the sign was first reported at 6:41 a.m. Oct. 6 and referred to it as a \"traffic hazard.\" The reporting party was concerned the sign could spark a blaze because it was placed in an area with dry brush, according to the log.", "KTLA noted that the area has seen destructive brush fires in the past few years, the Getty Fire in 2019 and the Skirball Fire in 2017.", "Eric Menjivar with the California Department of Transportation told KTLA that motorists were slowing down to take photos, which created a traffic hazard.", "Wonder told the Los Angeles Times that because the sign was on private property, workers \"laid it down so it wasn't a visual distraction\" but did not completely remove the sign.", "\"This was a life and safety issue because there were concerns about distracted driving,\" Wonder said.", "Fact check:Trump's hospital records, weight have not been released", "The California Department of Transportation confirmed that the Trump sign along the 405 Freeway was removed from sight. Many posts don't mention that the sign did not meet state regulations and there were concerns about it sparking a fire in an area with a history of wildfires. We rate this claim as MISSING CONTEXT, based on our research.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]