["By Angelo Fichera", "Posted on June 5, 2020", "LEGO isn’t discontinuing the sale of its law enforcement-themed toys, despite an erroneous social media claim. The confusion arose after the company temporarily suspended some marketing efforts — not sales — amid the U.S. protests following the death of George Floyd.", "The LEGO Group moved this week to temporarily stop marketing more than 30 products relating to law enforcement, but it hasn’t stopped selling the products altogether, as some social media users have wrongly claimed.", "On June 2, a trade publication called the Toy Book obtained and published an email in which a third-party asked affiliate partners on LEGO’s behalf to remove more than 30 products from websites “and any marketing ASAP.” The email cited “recent events.” On its website, LEGO describes its affiliates as “helping to drive traffic and sales through your website to LEGO.com.”", "The move arrived amid the protests across the U.S. against police brutality and racial injustice that have followed the death of George Floyd in police custody in Minneapolis. Among the products cited in the email were the LEGO City Police Station, LEGO City Fire Station and other similar products — including an adult White House set.", "But the news sparked confusion that the company would be, as one post said, “pulling their Lego City Police playsets from stores indefinitely.” Another tweet, which earned more than 1 million likes, said, “THEY PULLED ALL LEGO POLICE SETS FROM THE SHELVES.”", "The erroneous claim further drew attention on Twitter when President Donald Trump’s campaign manager, Brad Parscale, wrote on June 4: “This is nuts. @LEGO_Group is removing playsets featuring police, firefighters & emergency vehicles. Even ditching an adult White House kit. We ought to stress the good in law enforcement for kids. What does @JoeBiden think about LEGO erasing cops?”", "Responding to Parscale, the company said: “We are not removing any LEGO sets from sale. Reports otherwise are false.”", "The company also addressed the claims in another June 4 tweet, saying that the “intention was to temporarily pause digital advertising in response to events in the US” — not end sales.", "LEGO’s website shows the products in question still available.", "Michael McNally, senior director of brand relations for the LEGO Group, told us in an email: “Generations of children have loved playing with … our LEGO Police and Firefighter sets which can often be found in our LEGO CITY line and is a constant in our collection. These were available last week, are available now, and will always be available to our fans.”", "“Given the tragic events in the US over the past 10 days, we did pause all digital marketing, including content that could be perceived insensitive if promoted at this time,” McNally said. “We intend to resume digital marketing next Monday.”", "McNally, saying the company stands “with the black community against racism and inequality,” said LEGO intends to donate “$4 million to organizations in the United States dedicated to non-profits that support black children and others that educate all children and families about tolerance and racial equality.” He said details about that donation are not yet finalized.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“City | Themes.” LEGO.com. Accessed 5 Jun 2020.", "LEGO (@LEGO_Group). “We’ve seen incorrect reports saying we’ve removed some LEGO sets from sale. To be clear, that is not the case and reports otherwise are false. Our intention was to temporarily pause digital advertising in response to events in the US. We hope this clears things up.” Twitter. 4 Jun 2020.", "McNally, Michael. Senior director of brand relations, the LEGO Group. Email to FactCheck.org. 5 Jun 2020.", "“The LEGO.com Affiliate Program.” LEGO.com. Accessed 5 Jun 2020.", "Zahn, James. “LEGO Pulls Back Police Playset Affiliate Marketing Amid George Floyd Protests (UPDATED).” Toy Book. 2 Jun 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]