["About this rating", "In July 2020, Snopes readers asked about a story published by The BL website headlined, \"Lt. Col. Vindman quits army after admitting he falsely testified at President Trump’s impeachment inquiry.\"", "The BL story was published on July 9, 2020, one day after Vindman announced he was retiring from his 21-year career of military service. As the former Ukraine expert on the National Security Council, Vindman had served as a key witness against U.S. President Donald Trump during impeachment hearings in the winter of 2019. Those hearings centered on claims of abuse of power and obstruction of Congress, charges stemming from allegations that Trump tried to strong-arm Ukraine's president into digging up dirt on Trump's 2020 Democratic presidential rival Joe Biden.", "Vindman was the target of a smear campaign resulting from his testimony.", "An Iraq War veteran, Vindman did retire from the Army in early July 2020. But not after \"admitting he falsely testified\" during the impeachment hearing. Instead, Vindman cited \"a campaign of bullying, intimidation, and retaliation\" by Trump for ending his Army career. Vindman was ousted by Trump from his security council post in early February 2020 and escorted from the White House shortly after Trump was acquitted by the Senate.", "The \"false testimony\" accusation stems from records of an April 21, 2019, phone call between Trump and Ukrainian President Volodymyr Zelensky, one of two phone calls between the two leaders that came under scrutiny during the impeachment inquiry.", "During questioning by Democratic impeachment legal counsel Daniel Goldman, Vindman acknowledged that his readout of a call between Trump and Zelensky contained a talking point about \"rooting out corruption\" that Trump didn't say in the April 21, 2019, phone call.", "When asked by Goldman if the readout contained a false statement, Vindman noted that the readouts were intended as both call records but also messaging tools that generally telegraph U.S. policy priorities. Here is a transcript of that portion of the testimony, with our added emphasis on the relevant portion:", "GOLDMAN: Now, you testified, both of you, about the April 21st call, a little earlier.", "And, Colonel Vindman, you indicated that you did include in your talking points the idea of Ukraine rooting out corruption, but that President Trump did not mention corruption.", "I want to go to the White House readout from the April 21st call. And at the -- I'm not going to read the whole thing. But do you see the highlighted portion, where it says \"root out corruption?\"", "VINDMAN: Yes.", "GOLDMAN: So, in the end, this readout was false, is that right?", "VINDMAN: That's -- that's -- maybe that's a bit of -- it's not entirely accurate. But I'm not sure if I would describe it as false. It was consistent with U.S. policy. And these items are used as messaging tools also.", "So a statement that goes out, in addition to, you know, reading out the meeting itself, is also a messaging platform to indicate what is important with regards to U.S. policy.", "GOLDMAN: So it is a part of U.S. official policy that Ukraine should root out corruption, even if President Trump did not mention it in that 21st -- April 21st phone call, is that right?", "VINDMAN: Certainly.", "During the same testimony, Vindman stated that the phrase about rooting out corruption was included in recommended talking points given to Trump before the call, but that Trump neglected to say them while talking to Zelensky. The reason it was included was because the U.S. has spent billions of dollars in foreign aid promoting anti-corruption reform efforts in Ukraine.", "In the days leading up to Vindman's testimony, the White House had blamed him for a discrepancy between the call readout and the transcript of the call released by the White House, which made no mention of fighting corruption.", "Trump was ultimately impeached by the U.S. House for abuse of power and obstruction of Congress but acquitted in the Senate.", "Washington Post Staff. \"Transcript: Vindman and Williams Testify in Front of the House Intelligence Committee on Nov. 19.\"\r\n  The Washington Post. 19 November 2019.", "Colvin, Jill and Lolita C. Baldor. \"Vindman Retiring from Army, Lawyer Blames Trump.\"\r\n  The Associated Press. 8 July 2020.", "Saletan, William. \"The Authoritarian Smear Campaign Against Alexander Vindman.\"\r\n  Slate. 31 October 2019.", "Baker, Peter, et al. \"Trump Fires Impeachment Witnesses Gordon Sondland and Alexander Vindman in Post-Acquittal Purge.\"\r\n  The New York Times. 7 February 2020.", "Fandos, Nicholas and Michael D. Shear. \"Trump Impeached for Abuse of Power and Obstruction of Congress.\"\r\n  The New York Times. 18 December 2019.", "Gans-Morse, Jordan. \"Ukraine Has Been Waging War on Corruption. A U.S. President Encouraging a 'Favor' Could Undermine These Reforms.\"\r\n  The Washington Post. 30 September 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]