["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "GOP Congressman Kevin McCarthy of Bakersfield, Calif. AP file photo.", "Republican House Majority Leader Kevin McCarthy of Bakersfield is no fan of the Affordable Care Act, also known as Obamacare.", "But did he accurately characterize sign-ups under the federal health law in a recent interview on Fox Business?", "Here’s what he said in the interview on June 11, 2017:", "\"Remember this, under Obamacare it mandates that you have health insurance. If you don’t, you have to pay a penalty or take a waiver. More people, almost twice as many, pay the penalty or take the waiver than signed up for it.\"", "McCarthy is correct that Obamacare requires people to have health insurance, unless they pay a penalty or claim an exemption.", "Exemptions are granted based on household income levels.", "But we wanted to know: Have almost twice as many people really declined health coverage -- by paying the penalty or taking a waiver -- as signed up for Obamacare?", "And what counts for a ‘sign-up’ under Obamacare?", "We set out on a fact check.", "Our research", "We asked McCarthy’s spokesman for evidence supporting the claim. For the penalty and exemptions, he cited figures from an IRS report to Congress based on tax year 2015, the latest year for which numbers are available.", "They show:", "6.5 million people paid a penalty in 2015", "12.7 million people claimed an exemption in 2015", "Altogether, 19.2 million declined Obamacare coverage that year. These figures are widely accepted by health policy experts.", "For Obamacare sign-ups, McCarthy’s spokesman cited a 12.2 million figure for the most recent enrollment period. It’s based on a Centers for Medicare and Medicaid Services news release, though health policy experts say it’s far from the full picture on Obamacare sign-ups. It shows the number who selected or were automatically re-enrolled in an Obamacare marketplace plan nationally.", "Looking at the numbers, 19.2 million is not \"almost twice as many\" as 12.2 million.", "There’s also the larger question: Are the marketplaces the full picture of Obamacare sign-ups?", "Absolutely not, health policy experts told us.", "‘The missing piece’", "President Obama signed the Affordable Care Act into law in 2010. The federal law, however, did not go into effect until 2014.", "When it did, it created two ways to increase the number of people with health insurance in the United States -- the exchanges and an expanded Medicaid program -- said Gerald Kominski, director of the UCLA Center for Health Policy Research.", "Total sign-ups under the Affordable Care Act’s are closer to 20 million when adding enrollment through the exchanges and Medicaid expansion, Kominski said. That figure comes from a March 2016 report by the Department of Health and Human Services.", "\"It’s a false statement,\" Kominski said of McCarthy’s claim. \"The category that the congressman conveniently left out of his narrative (is) the roughly 14 million people who were newly enrolled in Medicaid programs around the country. It’s the missing piece.\"", "\"To ignore one category and exclusively focus on the other is disingenuous,\" he added. \"Either that or it shows a fundamental lack of (understanding) of the law.\"", "Kominski advocates for the Affordable Care Act as \"a great step forward\" on his website.", "‘It’s certainly part of Obamacare’", "Joy Melnikow, Director of the UC Davis Center for Healthcare Policy and Research, agreed Medicaid can’t be ignored.", "\"It’s certainly part of Obamacare,\" Melnikow said. \"It was the bigger piece of what Obamacare did.\"", "The two main parts of Obamacare, the marketplaces and Medicaid, are more connected than some might think, she added.", "\"When someone goes to buy insurance on the exchange, the process solicits information about that individual’s income to see if they qualify for Medicaid. If they qualify for Medicaid, the exchange insurance sign-up will route them to sign up for Medicaid.\"", "Absolute conclusions?", "Drawing an absolute conclusion about how many people signed up for Medicaid because of Obamacare isn’t so simple, noted one health researcher.", "\"There’s not a clean, easy way to measure who signed up because of the Affordable Care Act,\" said Cynthia Cox, who studies the ACA at the Kaiser Family Foundation, a nonprofit research organization.", "It’s not always clear, she added, whether enrollees signed up because they heard about Medicaid expansion under the ACA or for other unrelated reasons.", "Our ruling", "Congressman Kevin McCarthy claimed almost twice as many people have paid a penalty or taken a waiver as signed up for Obamacare.", "By focusing only on enrollment through the Obamacare exchanges, McCarthy’s claim presents a narrow and misleading look at total insurance sign-ups under the federal health law. Even under the limited view, those foregoing insurance do not amount to \"almost twice\" the exchange sign-ups.", "Most notably, the congressman’s claim ignores the huge category of Medicaid expansion under Obamacare. Of the 20 million people who gained coverage under Obamacare through early 2016, about 14 million were under Medicaid.", "The data show about the same number of people declined coverage -- not \"almost twice as many\" -- as signed-up for Obamacare.", "We rate McCarthy’s statement False.", "FALSE – The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "div class='artembed'>", "Rep. Kevin McCarthy, speech on House floor, July 12, 2017", "Matt Sparks, spokesman for Rep. Kevin McCarthy, July 17, 2017", "Gerald Kominski, director, UCLA Center for Health Policy Research, interview, July 14, 2017", "Joy Melnikow, director, UC Davis Center for Healthcare Policy and Research, interview, July 18, 2017", "Cynthia Cox, associate director, Program for the Study of Health Reform and Private Insurance, Kaiser Family Foundation, interview, July 14, 2017", "Department of Health and Human Services, \"Health Insurance and the Affordable Care Act, 2010-2016,\" March 3, 2016", "Centers for Medicare and Medicaid Services, news release, HEALTH INSURANCE MARKETPLACES 2017 OPEN ENROLLMENT PERIOD FINAL ENROLLMENT REPORT: NOVEMBER 1, 2016 – JANUARY 31, 2017, March 15, 2017", "Centers for Medicare and Medicaid Services, news release, High Costs, Lack of Affordability Most Common Factors that Lead Consumers to Cancel Health Insurance Coverage, June 12, 2017", "Kaiser Family Foundation, \"Assessing ACA Marketplace Enrollment,\" March 2016", "IRS Commissioner John Koskinen, Letter to members of Congress on 2016 Affordable Care Act tax filings, Jan. 9, 2017", "PolitiFact, 4 questions on the fight over Obamacare and what happens next, July 20, 2017", "Washington Post Fact Checker, Trump’s fishy suggestion that nearly 20 million are paying an Obamacare penalty, March 2, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]