["The post featuring the video was shared more than 500 times on Facebook before the post (archived here) was removed.", "A man in the clip claimed that Gates and his wife Melinda were planning to depopulate Africa by forcing people to take Covid-19 vaccines. He also alleged the Microsoft co-founder helped create the coronavirus as part of the depopulation plot.", "“Don’t take the vaccine cus even bill gate did not vaccinate his family (sic),” reads the post published by a page called “Igbo Efuna media” on January 29, 2021.", "The claims were repeated in newspaper and website headlines, shown alongside the video.", "The man in the clip denies the existence of Covid-19 in Nigeria and urges his followers in Igbo -- a language spoken mostly in the country’s southeast region -- to ignore official directives about the disease and the vaccines developed to fight it.", "AFP Fact Check has debunked claims about the alleged depopulation plan on several occasions, including here and here.", "Comments made by Gates regarding population have repeatedly been taken out of context.", "In a 2012 interview available on YouTube, he said that “population is growing the fastest in places where people are less able to deal with it”. One of the ways to manage this growth in countries like Nigeria, Yemen and Niger was by giving women tools to help them and their children live healthier lives, he said.", "These and other comments made by Gates on the issue, including here and here, have been repurposed by critics and conspiracy theorists to mean that he wants to “depopulate” Africa by sterilising women through engineered vaccines .", "The video also has a screenshot of an online story claiming that the Gates refused to vaccinate their children, while pressing other parents to do so.", "AFP Fact Check traced the article to a controversial website called “The Truth Seeker” which had published a purported interview from 2018 with an unnamed physician who “served as Bill Gates’ private doctor in Seattle in the 1990s”. The story quoted the alleged GP as saying that “the Microsoft founder and vaccine proponent ‘refused to vaccinate his own children’ when they were young”.", "While the website ran the interview in January 2019, it linked to the now-deleted original version published in February 2018 on a website called Transcend Media Services. The story was credited to Baxter Dmitry -- a byline that has appeared on at least one other discredited conspiracy article debunked here by AFP Fact Check.", "Transcend Media wrote on its disclosure page: “Multiple videos and articles containing hoaxes and false information about the Corona pandemic have been removed” for “inaccuracies and/or misleading information”.", "Melinda Gates has spoken up about the issue of her children and their vaccination record more than once.", "“All three of my children are fully vaccinated,” she wrote in a Facebook post from April 2019. “Vaccines work. And when fewer people decide to get them, we all become more vulnerable to disease.”", "The Bill & Melinda Gates Foundation denied the claim in an email to AFP Fact Check.", "The foundation has invested billions of dollars into vaccine research over the last two decades. Their partnership with the vaccine alliance Gavi aims to ensure millions of Covid-19 shots reach poorer nations.", "Meanwhile, Gates, 65, said in January that he had received a Covid-19 vaccine.", "One of the benefits of being 65 is that I’m eligible for the COVID-19 vaccine. I got my first dose this week, and I feel great. Thank you to all of the scientists, trial participants, regulators, and frontline healthcare workers who got us to this point. pic.twitter.com/67SIfrG1Yd", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]