["About this rating", "Augmented reality game Pokémon Go was an instant hit after it was released in summer 2016.  The fad led to rumor after rumor, including the potential for a Hogwarts-themed version of the game dubbed \"Harry Potter Go.\"", "What began as speculative memes and petitions developed into solid rumors that Niantic immediately decided to build upon its success by releasing a Harry Potter variant. Before long, the buzz transcended social media to reach news media, with reports that Harry Potter Go was set for a 2017 release. Some articles simply speculated, but outlets like Hello Giggles and NME reported in July 2016 that \"Harry Potter Go\" was definitely, well, a go:", "The creators of Pokémon Go are developing a Harry Potter version of the game.", "Niantic have announced that they will be making Harry Potter Go following the success of their Pokémon game.", "Since over 15 million users worldwide have downloaded Pokémon Go, fans of the J.K. Rowling books and films have been petitioning Warner Bros to create a Harry Potter game.", "Hello Giggles reports that Niantic's senior developer Marcus Figueroa said the company had decided to create the game as \"the demand for this title was absolutely insane, so we figured we'd give it a shot.\"", "The story seems to have first appeared on JTXHNews, which referenced an apparently nonexistent interview with gaming outlet IGN:", "Niantic’s senior developer Marcus Figueroa announced the new project in an interview with IGN", "We have acquired the rights for the app. The demand for this title was absolutely insane, so we figured we’d give it a shot. If we’re lucky we might see a launch by early 2017, but it’s hard to tell this early in the project.", "When pressed for details, Figueroa had this to say", "We want to do something with schools of witchcraft and wizardry, similar to pokestops in Pokemon GO. As wells a quest system, and possibly large scale completely interactive events, but no promises. That’s all I can say.", "JTHXNews appears visually identical to hoax purveyors that spread viral fabrications claiming that celebrities are moving to (or experiencing flat tires in) small towns across Canada and the United States.", "On the same day NME reported that Harry Potter Go was in development, Gizmodo pointed out that no record of a \"Marcus Figeroa\" at Niantic exists, and no such announcement appeared anywhere other than a fake news outlet. Niantic made no such announcement in July or August 2016, and did not indicate that any plans for \"Harry Potter Go\" were in even the earliest planning stages.", "However, that doesn't rule out a Harry Potter Go game eventually appearing, as Pokémon Go was first conceived as an April Fool's Day hoax in 2014.", "On 8 November 2017, the \"hoax\" became reality when Niantic announced that it would be releasing a Pokémon Go-type augmented reality game for Harry Potter enthusiasts. The game will be called \"Harry Potter: Wizards Unite\":", "We're incredibly excited to announce this next step in the evolution of AR mobile entertainment. With Harry Potter: Wizards Unite, players that have been dreaming of becoming real life Wizards will finally get the chance to experience J.K. Rowling’s Wizarding World. Players will learn spells, explore their real world neighborhoods and cities to discover & fight legendary beasts and team up with others to take down powerful enemies. We're thrilled to partner with Warner Bros. Interactive Entertainment, and WB Games San Francisco’s development team to bring this magical and beloved series to life in a brand new way. Harry Potter: Wizards Unite will leverage the full stack of the Niantic Platform while also providing an opportunity to pioneer all new technology and gameplay mechanics.", "While details remain sketchy so far, we have updated the rating on this page from \"False\" to \"True\" to update the new (augmented) reality.", "Boyd, Brittany.   \"OMG! There's Going To Be A \"Harry Potter Go\" Game!\"\r\n    Hello Giggles.   30 July 2016.", "Daly, Rhian.   \"Pokémon Go Creators Are Working On A Harry Potter Go Game.\"\r\n    NME.   31 July 2016.", "Haikel, Dominique.   \"A Harry Potter Version Of Pokémon Go Might Be Happening: Here Are More Mashups We're Dying to Play.\"\r\n    E!.   21 July 2016.", "Jacomina, Kristina.   \"Pokemon Go: Niantic To Develop Harry Potter App Next? Details Here!\"\r\n    Morning Ledger.   20 July 2016.", "Starkey, Adam.   \"There’s A Harry Potter Version Of Pokemon Go On The Way Apparently.\"\r\n    Metro.co.uk.   31 July 2016.", "Velocci, Carli.   \"No, Niantic Isn't Making A Harry Potter Version Of Pokémon Go.\"\r\n    Gizmodo.   31 July 2016.", "Updated to reflect rating change from \"True\" to \"False\" after Niantic's announcement that there will be a Harry Potter-themed game.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]