["Donald Trump Jr. on Oct. 26 retweeted a Daily Mail article about a sharp drop in influenza-related deaths this year.", "\"We went from 75,000 flu deaths last year in America to almost 0,\" he added. \"Does anyone actually believe that? Or do you think there may be allocation games being played to manipulate the truth?\"", "His tweet — which has been seen by tens of thousands of people — was screenshotted and widely shared on Facebook going viral in a post by user Tyler Zed. As of Oct. 30, it has been shared more than 5,400 times and has gathered hundreds of comments.", "Neither Trump nor Zed immediately returned a request for comment.", "USA TODAY has previously debunked several claims asserting that different flu seasons were deadlier than the COVID-19 pandemic. These fact-checks have determined that COVID-19 is deadlier than the 2018-2019 flu season, the 1918 Spanish flu and the 2009 swine flu pandemic.", "Nor have the Centers for Disease Control and Prevention stopped reporting flu deaths as COVID-19 has ravaged the country, USA TODAY reporting found.", "CDC data does not support Trump's claim.", "More:Fact check: What's true and what's false about coronavirus?", "Flu seasons vary from year to year and don't have a strict timeline. Last year, flu season was the longest in a decade, lasting 21 weeks.", "“In the United States, flu season occurs in the fall and winter. While influenza viruses circulate year-round, most of the time flu activity peaks between December and February, but activity can last as late as May,\" the CDC website explains.", "To account for this ambiguous period, the CDC releases weekly U.S. influenza summary updates from October through May. The CDC's first report for the 2020-2021 flu season was posted for the week ending Oct. 3.", "It's too early to tell what this year's flu season will bring, an epidemic expert said.", "\"We don't know yet. We're hopeful there's fewer deaths, of course, and I think there are reasons to believe it will be fewer but we don't really know at this point,\" said David Aronoff, professor of medicine and director of the Infectious Disease Division at Vanderbilt University Medical Center in Nashville.", "The CDC uses mathematical estimates to retroactively measure the burden of each flu season.", "After each flu season, the CDC considers in-hospital death data and investigates death certificates to account for the total flu deaths. “(B)ecause not all deaths related to influenza occur in the hospital, we use death certificate data to estimate how likely deaths are to occur outside the hospital,” the CDC website explains.", "According to the CDC’s 2018-2019 estimates, there were 34,200 influenza-associated deaths from October 2018 to May 2019. For the 2019-2020 season, the CDC has released a preliminary estimate of 22,000 influenza related deaths.", "Even combining those seasons, from late fall 2018 to early spring 2020, there were approximately 56,000 flu deaths recorded by the CDC — not 75,000 as Trump claimed on Twitter.", "The CDC estimated 61,000 influenza-associated deaths in the 2017-2018 season.", "CDC reports low influenza activity in the U.S. through the week ending Oct. 24, after low numbers of the current flu strain were reported this summer.", "\"There's no reason for me to think that the seasonal flu rates or deaths are low because we've stopped looking for them, or are misrepresenting positive flu tests as something else, like COVID-19,\" Aronoff said. I've not heard of that being something that's happening. I think it's more likely than not that people have been diligent to look for influenza and are seeing less of it.\"", "The advice given to slow the spread of COVID-19 — handwashing, staying home with symptoms, covering your face when coughing — are nearly identical to those advised by public health officials to protect from catching the flu.", "\"To be fair, we probably should have been paying closer attention to hand hygiene and crowding, maybe even in some circumstances depending on how flu season is doing, wearing cloth face coverings, but you know ... we're learning a lot with this pandemic of COVID-19,\" Aronoff said.", "Public health authorities nationwide have also urged Americans to get flu shots if possible to help avoid a possible twin pandemic as gatherings move inside this winter.", "\"Coupled with immunizing for the flu, I really don't think there will be any nefarious plots, or conspiracy theory-type things to explain this. It makes perfectly good sense that by doing the things we're doing to reduce the transmission of SARS Co-V-2, we will be in a position to reduce the transmission of influenza. And that's something to really celebrate,\" Aronoff said.", "The claim that 75,000 Americans died of the flu last year and that flu death  rates are being manipulated is FALSE, because it is not supported by our research. The CDC's weekly reports on the 2020-2021 influenza season show this season's rates are similar to rates of past years at an early stage of the season. The total number of deaths in the 2018-19 and 2019-2020 seasons were not as high as claimed.", "Reach reporter Mariah Timms at mtimms@tennessean.com or 615-259-8344 and on Twitter @MariahTimms."]