["Since the start of the coronavirus pandemic, online skeptics questioned health officials' attempts to stop the spread of COVID-19. In recent months, social media users are using the Amish, a population known for its resistance to modern technology, to claim the threat posed by the virus is not real.", "One meme is using an altered photo to claim Amish people are unaffected by the virus because they don't own televisions.", "“Why isn’t COVID affecting you people?” reads a dialogue bubble above a woman wearing a mask.", "“We don’t have TV,” states the bubble above a man with a long beard and straw hat.", "Fact check:WHO recommends mask-wearing to prevent COVID-19 spread", "Versions of this meme have appeared on social media since late 2020, however, misconceptions about COVID-19’s impact on the Amish community have spread for months.", "Fact checkers debunked similar claims that COVID-19 spared Amish communities in September.", "“6 months later and the Amish are all still alive and Covid free. Their cure = No TV!” reads a post that circulated widely in September.", "Both versions of this claim are false. COVID-19 has affected Amish communities like any other population in America, regardless of the fact that Amish people don’t typically own televisions.", "USA TODAY contacted several social media users that posted the claim and has yet to receive a response.", "The image in the first meme is misleading because it is altered to appear as though it was taken since the pandemic began. The original image was posted to travel website Viator in April 2009 by user Angela S. In the photo, the woman is not wearing a mask.", "The photo was captioned “A nice talk with Amish people” and posted with reviews for a listing for a Philadelphia and Amish Country Day Trip tour.", "The tour brings visitors to Lancaster County, Pennsylvania, which is home to a large Amish community.", "Aside from the doctored image, it’s inaccurate to say that Amish communities haven’t been affected by COVID-19.", "The Centers for Disease Control and Prevention studied an outbreak in a rural Ohio Amish community in May. The outbreak prompted a CDC study, which concluded that the virus had spread at social gatherings where social distancing and mask-wearing practices were not followed because of community hesitancy.", "In August, the Indianapolis Star, part of the USA TODAY Network, reported on the spread of COVID-19 among Amish populations in Nappanee, Indiana.", "The Star reported that data on COVID-19 among the Amish is inconclusive since public health departments typically don’t gather COVID-19 demographic data broken down by religious group and because many Amish people have resisted testing.", "Some Amish people in Indiana and Lancaster, Pennsylvania don’t seek medical care for COVID-19 symptoms because they preferred at-home care where they could receive visitors.  Steven Nolt, a senior scholar at the Young Center for Anabaptist and Pietist Studies at Elizabethtown College, said some Amish people who died from COVID-19 died at home.", "In June, Dr. Stephen Diamantoni, Lancaster County coroner, said six members of the Old Order Amish died from COVID-19-related illnesses over just a few weeks.", "The Repository, also part of the USA TODAY Network, reported that Amish communities are more likely to engage in forms of alternative medicine than other religious groups. They also rely on spiritual healing and prayer, according to The Repository.", "Fact check:Merck discontinues COVID-19 vaccine work over weak immune response", "Some Amish people who contracted COVID-19 sought medical attention and recovered, the Star reported", "Other cultural factors like multigenerational homes and communal living could have increased the likelihood that COVID-19 spread among Amish communities.", ".", "Lisa Orn, a family medicine doctor from Nappanee, Indiana said that COVID-19-related misinformation and cultural distrust of government may have contributed to transmission of the disease in the Amish community.", "Fact check:COVID-19 can cause worse lung damage than smoking", "Although rules vary between Amish communities, owning electronics like televisions, radios and computers is typically forbidden for Amish life.", "This cultural aversion to technology poses a dilemma for health officials trying to reach Amish communities. To mitigate this communication barrier Penn Medicine Lancaster General Health partnered with Amish communities to convey medical guidance and minimize the spread of COVID-19 in Amish communities.", "The CDC noted that bishops and other community leaders have helped public health officials communicate updated health guidance to Amish communities.", "We rate the claim that Amish communities have been unaffected by COVID-19 because they don't own televisions FALSE because it is not supported by our research. There have been many cases of COVID-19 transmission and fatalities among Amish people. Coronavirus rates in Amish communities are difficult to ascertain because Amish people sometimes don't seek medical care or get tested and many public health entities don't track information on religious demographics as part of testing data.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]