["About this rating", "On Nov. 24, 2020, a rumor started circulating on social media that the right-wing website Parler had been hacked. This rumor, which held that Parler users had their Social Security numbers and private messages stolen, was largely based on a single (since deleted) tweet and a months-old screenshot.", "Rumors about Parler's being hacked went viral after Twitter user @Kevinabosch posted the following message: \"I've seen what looks like legit proof of 5000 compromised Parler accounts including DM's of some well-known figures. Hackers decompiled the app, zero day exploit etc.. I wish I could unsee what I've seen.\"", "This claim, however, came without evidence. And as Jane Lytvynenko, a Buzzfeed reporter who monitors social media for viral misinformation, noted, this account has shared inaccurate claims on social media before. By the morning of Nov. 25, this tweet was deleted.", "In addition to the unfounded claim displayed above, a screenshot supposedly showing proof of the hack was also circulated on social media:", "This screenshot, however, is not recent. It was taken in July 2020, more than four months before the current spate of rumors.", "Furthermore, this screenshot comes from an old WordPress installation of Parler, not from the site's app. Tech reporter Mikael Thalen noted that while this WordPress site may have once been used for simple blog posts, like announcements about the new social media site, it did not host any user data.", "Parler CEO John Matze disputed the rumors that his social media site was hacked, writing that \"we do not use WordPress products, nor WordPress databases.\"", "As of this writing, there's no evidence to show that any user data, including Social Security numbers or private messages, were hacked from Parler. This rumor originated with a seemingly baseless claim that was subsequently propped up by a months-old screenshot. Furthermore, the CEO of the company has called all of these allegations fake.", "We will update this article if any additional information comes to light.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]