["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Hopefuls for St. Petersburg mayor are divided on the city’s red light camera program.", "Mayoral candidate Kathleen Ford argued in her response to a Tampa Bay Times questionnaire that the city’s technology is flawed, the cost to appeal is \"prohibitively high\" and unfair, and the program should be stopped. Mayor Bill Foster, who pushed for the cameras, still supports them.", "Mayoral candidate Rick Kriseman aligns with Foster. \"I support them for the purposes of public safety, not as a revenue generator. ... The fact is that red light cameras change driver behavior and cut down on the most dangerous types of accidents,\" Kriseman wrote.", "We wanted to know if Kriseman’s point is accurate.", "St. Petersburg’s program", "The cameras seem to be just about everywhere.", "St. Petersburg is one of about 70 municipalities in Florida with red light cameras, along with five other cities in Pinellas County, Tampa, Miami, Clearwater and Orlando. About half of U.S. states have authorized the technology in the past two decades.", "The St. Petersburg program started in fall 2011 with cameras at 10 intersections. Tickets for running a red light are $158. (Locations here.) Already the cameras have been at the brink of wipeout, having survived a few City Council votes that would effectively end the program.", "A number of municipalities have had buyer’s remorse. In Houston, a voter referendum killed the program. Collier County (Fla.) commissioners voted to kill their program in December 2012 because they did not find evidence that the cameras reduced accidents. Los Angeles officials ended the program there after realizing it was difficult to pursue violators who ignored their tickets. An audit found the cameras did not improve public safety.", "Still, other cities tout benefits. More than a year in, the question remains for St. Pete: Are the cameras reducing the most dangerous crashes?", "A consultant’s performance report in December 2012 concluded that the red light crash rate fell by 31 percent at St. Petersburg traffic approaches with cameras from November 2011 to October 2012, compared to the three-year average preceding it. Crashes from red light running resulting in injury fell by 47 percent compared to the three-year average preceding the program, the consultants found.", "But the lengthy report omitted facts later reported by the Tampa Bay Times, such as the fact that rear-end wrecks at intersections with red light cameras jumped 44 percent and overall crashes at those intersections increased 10 percent compared to the previous year.", "Interpretations all depend on how you dice the data, said Michael Frederick, the city’s transportation manager. The consultant compared the first year of traffic data with a three-year average instead of data just for the year before. A more in-depth review is expected after three years with the cameras, he said.", "Not included in the report? Fatal crashes. Frederick said that’s because there were none in the year examined. University of South Florida researchers found that St. Pete averaged about one fatal crash a year in the years before the cameras went up.", "Many studies, many findings", "Both sides of the camera debate tout a plethora of research espousing their opinions.", "Kriseman’s campaign manager said he was talking about the effect of red light cameras in general on motorist behavior and dangerous crashes. The campaign sent materials from national pro-camera groups, the National Coalition for Safer Roads and the Insurance Institute for Highway Safety (funded by auto insurance companies), in addition to a study that appeared in The Journal of Trauma in 2010.", "We’ll sum up that research, as well as a couple others.", "• The Insurance Institute for Highway Safety asserts red light cameras reduce the most dangerous crashes, pointing to 2011 in-house research that found large cities with red light cameras between 2004-08 saw a 24 percent reduction in fatal red light running crashes compared to those without. The institute also points to a 2002 study in California, showing significant declines in injury crashes and right-angle injury crashes across the city after some intersections got cameras.", "• The Journal of Trauma study examined driver behavior for nine months at a dangerous intersection in a New Orleans suburb. The report concluded the cameras decreased the rate of red-light running and had a \"lasting effect on driver behavior.\" The study, however, said the cameras did not seem to prevent collisions at the intersection, recommending more studies over more time.", "• The Texas Transportation Institute of Texas A&M University examined crash records at 275 intersections in Texas cities with red light cameras. The researchers concluded that the most severe crashes, those at right angles, dropped 32 percent. Another study is planned this fall to examine what happened to crashes in cities that took down their red light cameras.", "• A 2004 study by the Urban Transit Institute at North Carolina A&T State University concluded no demonstrable safety benefit from red light cameras.", "\"There isn’t a conclusive study that would say that in all circumstances that red light cameras are going to provide the safety benefits that they’re looking at,\" said Jason Bittner, director of USF’s Center for Urban Transportation Research. \"It’s kind of on a case-by-case basis.\"", "More research", "Three USF researchers reviewed seven red light camera studies held up by the federal government as the best designed studies and found none concluded a statistical safety benefit from the cameras. They noted several government-funded studies actually stated injury or severe crashes increased with the cameras, according to their 2011 paper in Florida Public Health Review.", "The professors, who became interested in the cameras years ago because a portion of the revenue goes to trauma center hospitals, pointed out in 2011 that red light cameras often have a \"double effect\" on motorists: They are put at higher risk for fines and rear-end crashes.", "The researchers objected to the IIHS California study and others for not using scientific research methods, and have faulted other research for not taking into account traffic trends, such as the fact that the state has been seeing a decrease in red light running, said Barbara Langland Orban, a USF health policy professor.", "The professors agree that red light cameras influence driver behavior -- just not for the better (though they had not seen studies of psychological effects of the cameras on drivers).", "\"There’s a difference between a driver being more aware and a driver being more skittish,\" said Etienne Pracht, a USF professor of health care economics.", "We turned to another local camera critic. Matt Florell, who runs StPeteCameras.org, analyzed more than 20 North American red light camera studies published in academic journals or cited by government agencies and determined most of them showed an increase in total crashes with red light cameras installed. In the 15 studies that measured crashes with injury, there was an increase of 21 percent, Florell found.", "Florell is highly critical of the city’s one-year report, saying it cherry-picks statistics, lacks raw numbers and makes unproven assumptions.", "Our ruling", "Kriseman’s point is not new: Many supporters of red light cameras tout, as he did, that benefits include changed motorist behavior and reducing the most dangerous kind of crashes.", "We found some studies that say cameras changed motorist behavior -- by either putting them on high alert or teaching them a lesson. But whether they truly \"cut down on the most dangerous types of accidents\" remains a matter of much debate.", "We rate his claim Half True.", "Tampa Bay Times, Know Your Candidates guide for the mayor’s race, July 28, 2013", "Interview with Cesar Fernandez, Kriseman campaign manager, July 29, 2013", "PolitiFact Georgia, \"Red light cameras don’t impress Roswell,\" Nov. 27, 2012", "PolitiFact New Jersey, \"Michael Doherty says evidence is lacking that red-light cameras in New Jersey reduce accidents,\" June 28, 2012", "PolitiFact Georgia, \"Atlanta wants green light on red light cameras,\" Nov. 29, 2010", "Tampa Bay Times, \"St. Petersburg City Council allows expansion of red-light camera program,\"", "Sarasota Herald-Tribune, \"Red light camera study set,\" July 26, 2013", "National Coalition for Safer Roads press release, \"National Coalition for Safer Roads responds to recent yellow light timing myths in Florida,\" May 15, 2013", "Insurance Institute for Highway Safety, Q&A on red light running, accessed July 29, 2013", "The Journal of Trauma, \"Red Light Cameras: Do they change driver behavior and reduce accidents?\", March 2010", "Washington Post, \"Red light cameras save lives, study says,\" Feb. 1, 2011", "Federal Highway Administration, Red light cameras page, accessed July 29, 2013", "Tampa Bay Times, \"Missing from St. Petersburg council report on red light cameras: Crashes actually increased,\" Dec. 12, 2012", "Interview with Jason Bittner, director of Center for Urban Transportation Research, July 30, 2013", "Interviews with Barbara Langland-Orban, John Large and Etienne Pracht, University of South Florida professors who co-authored reports on red light cameras, July 30, 2013", "Tampa Bay Times, \"As red light cameras grow more popular, an academic dispute at USF simmers,\" April 24, 2010", "Interview with Matt Florell, founder, StPeteCameras.org", "Interview with Neil Gaffney, Federal Highway Administration spokesman, July 30, 2013", "Florida Public Health Review, \"An update on red light camera research: The need for federal standards in the interest of public safety,\" 2011", "Interview with Michael Frederick, City of St. Petersburg, neighborhood traffic manager, July 31, 2013", "Interview with Karen Morgan, AAA spokeswoman, July 31, 2013", "City of St. Petersburg, Stop on Red Annual Performance Evaluation, December 2012", "Miami Herald, \"South Florida cities find new ways to get money out of red light programs,\" July 20, 201", "Interview with Russ Rader, Insurance Institute for Highway Safety spokesman, July 31, 2013", "The Atlantic Cities, \"Compelling evidence that red-light cameras do make roads safer,\" Oct. 3, 2012", "Interview with Bernie Fette, Texas A&M Transportation Institute spoksman, Aug. 1, 2013", "Office of then-U.S. House of Representatives Majority Leader Dick Armey, \"The Red Light Running Crisis: Is It Intentional?\" May 2001", "Urban Transit Institute, \"A Detailed Investigation of Crash Risk Reduction Resulting From Red Light Cameras in Small Urban Areas,\" July 2004", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]