["A video of a group of women sitting in a room is circulating on the Gujarati social media ecosystem with the claim that a child-kidnapping gang was arrested. In the video, a man who is probably filming the video can be heard asking the women to show their faces. Facebook user Bharat Patel claimed, “છોકરા ઉપાડી જનાર ગેંગને સાબરકાંઠાના વડાલીથી તથા ખેડબ્રહ્મા નજીકના શ્યામનગર સ્ટેન્ડ પરથી પોલીસે ૯ લેડીઝ ને ઝડપી પાડેલ. (Police have arrested nine members of child-kidnapping gang near Shyamnagar bus stand of Sabarkantha’s Vadali -translated)” The message asserts that the women’s gang was nabbed by the police in Vadali city of Sabarkantha district, Gujarat.", "છોકરા ઉપાડી જનાર ગેંગને સાબરકાંઠાના વડાલીથી તથા ખેડબ્રહ્મા નજીકના શ્યામનગર સ્ટેન્ડ પરથી પોલીસે ૯ લેડીઝ ને ઝડપી પાડેલ. તા-૨૮/૯/૧૯..", "Posted by Bharat Patel on Saturday, 28 September 2019", "A few more people on Facebook shared the video with an identical claim.", "With a keyword search on Google, Alt News found a report published by Gujarati news portal MeraNews on September 28, 2019. According to the report, these women used to dress in professional attire and extort money from passers-by and vehicles owners. They used to roam in groups across the city and forcefully extort money from people. If a person refused to give money, the group would create a ruckus. Vadali police had arrested nine gang members near the vegetable market during a traffic-drive in Sabarkantha district.", "Alt News contacted Wadali police station regarding the matter. “This women’s gang that I had arrested is involved in the crime of extorting money from people by threating them on the roads. It has no connection with chid-kidnapping. We have filed a complaint against them for extorting money from people“, said PSI Paresh Jani rubbishing the social media claims. We were informed that all the members have been sent to jail.", "In conclusion, a video of a women’s gang arrested by the police for extorting money was shared on social media to further the rampant false child-kidnapping rumours in the state of Gujarat.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]