["The misleading image was posted on several Facebook pages, including in this public group which has over one million members according to CrowdTangle data.", "The manipulated photo showed the alleged nine-storey structure almost tipping over. The caption described the building, located in Nairobi’s eastern Kayole neighbourhood, as unsafe and structurally unsound.", "Analysis using a forensic tool built by French university ENS Paris-Saclay showed the image to be a forgery.", "The actual building is seven storeys high: the picture was manipulated by duplicating the top floor twice to make it appear taller and therefore more dangerous.", "Some Facebook users even exaggerated the manipulation further adding as many as 10 more floors.", "However, this manipulation was clumsy and obvious with even a cursory glance revealing the cloning and pasting at play and the resulting layers in both building and sky.", "A day after the pictures went viral on social media, Nairobi Governor Mike Sonko ordered the building to be demolished and called for the owner to be arrested.", "“My admin cannot sit back & watch innocent Kenyans trapped in collapsed buildings because of corruption. This morning a multi-agency team led by City Hall officials arrested owner of a condemned 7-storey building in Kayole for building without approvals/ignoring a demolition notice,” he tweeted.", "The construction of unsafe and structurally unsound buildings is common in Kenya’s capital. The Architectural Association of Kenya said that preliminary investigations indicated there were at least 788 dangerous buildings in Nairobi after 38 had been demolished.", "In April 2016, 52 people were killed after a seven-storey building in Nairobi’s Huruma area collapsed.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]