["A video of a man thrashing another with a stick was shared by Twitter user @TheZaiduLeaks which poses as a Pakistani handle. The clip was shared with the claim, “Graphic Content: Chinese Engineer in Karachi caught on video beating Pakistani driver for submitting fake petrol bill. Engineer from PowerChina Gansu Energy Co came to Pakistan under CPEC.” An archived link of the tweet can be viewed here in case the video is taken down.", "Graphic Content : Chinese Engineer in Karachi caught on video beating Pakistani driver for submitting fake petrol bill.", "Engineer from PowerChina Gansu Energy Co came to Pakistan under CPEC.", "My Dear Pakistani brothers & sisters we must raise our voice against this this behaviour pic.twitter.com/SuJK72C1TS", "— 🇵🇰Zaidu🇵🇰 (@TheZaiduLeaks) June 28, 2020", "The clip was subsequently picked up by hundreds of users on Twitter and Facebook who shared it with the same claim. Incidentally, the video was also broadcast by News18 on June 29 where the anchor claimed, “Some news coming in, a Chinese CPEC engineer has been caught on camera beating up a Pakistani driver…this took place in Karachi. The driver was beaten for submitting a fake petrol bill. The relation between Pakistan and China is at its lowest after investing crores of rupees in CPEC [and] not getting the desired results.”", "The broadcast has now been taken down from the social media accounts of News18 however, a screenshot of its tweet posted below. An archived link of the tweet can be accessed here.", "The clip was also played during a broadcast by News Nation where the anchor asserted that Pakistan has become a “slave” to China.", "The video is quite viral on the Indian social media ecosystem. Below is a tweet by Zee News anchor Sudhir Chaudhary which drew over 5,000 retweets as of this writing (archive).", "If this is true Pakistani Govt should arrest this Chinese national. Do they have the courage? https://t.co/OvPTWgUNCL", "— Sudhir Chaudhary (@sudhirchaudhary) June 29, 2020", "Defence expert Mihir Shah retweeted a tweet mocking China’s Belt and Road initiative.", "CPEC or China-Pakistan Economic Corridor is a part of China’s grand Belt and Road initiative which aims to connect Asia, Africa and Europe by heavily investing in infrastructural projects across the globe. The cost of the project is proving to be an expensive affair for local contractors in partner countries, including Pakistan, which are at serious risk of not being able to repay loans. CPEC aims to link Kashgar in China’s Xinjiang province to Gwadar deep seaport close to Pakistan’s border with Iran.", "A reverse-search of the video’s keyframes on Yandex lead to several Facebook posts from 2016 where the same video was shared. According to a post on I’m Malaysian 我是马来西亚人, the clip depicts a racial attack on a Chinese national in Malaysia.", "Several Malaysian websites had also reported on the incident. According to mynewshub.tv, a foreigner was beaten by his employers.", "As per an article on malaysiakini.com published on November 29, 2016, the police were trying to identify the perpetrator who was wearing a yellow t-shirt of Bersih 5, a pro-democracy group based in Malaysia.", "The Twitter bio of @TheZaiduLeaks reads, “All Tweets are for fun 100% fake imaginary” yet News18 broadcast a show based on a video promoted by the account. But this is not the first time that a news channel fell for the handle. Last year, the handle had shared a still from the HBO drama series ‘Game of Thrones’ as a Kashmiri girl with a pellet injury. This was ‘fact-checked’ by Times Now and declared ‘Pakistani propaganda’.", "Alt News had found that after its creation, @TheZaiduLeaks was promoted by an Indian user associated with the right-wing portal rightlog.in. Our detailed investigation into the handle can be read here.", "In yet another comical gaffe, News18 ran a whole show claiming that a Chinese national brutally thrashed his driver in Karachi. The channel also linked the old video from Malaysia to the CPEC project between Pakistan and China.", "[Update: The initial title of the article read “Chinese national beaten in Pakistan” which has been rectified. News18 took down its broadcast after this fact-check was published. A downloaded video of the same has been added to the report. News Nation’s broadcast has also been included.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]