["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Some state political leaders have signaled they may consider increasing the gasoline tax to raise money for more transportation projects in Georgia. Johnny Crawford /[email protected]", "Transportation trumped all other issues in a recent survey of the 10-county Atlanta region.", "Some lawmakers float the idea of hiking the state’s gasoline tax almost annually, but now leaders under the Gold Dome have signaled they may consider the move to tackle some of the traffic woes in the region and state.", "But the political will to increase one tax may hinge on the ability to lower, or eliminate, another. Specifically, former state Rep. Edward Lindsey, R-Atlanta, said the state may need to revoke local governments’ ability to levy sales taxes for nontransportation services such as education.", "\"The following two statements are both true: We have one of the lowest taxes on gasoline for transportation purposes in the country,\" he said. \"And we have some of the highest taxes on gasoline in the Southeast.\"", "How can that be? We decided to check it out.", "First breaking the claim into two pieces, does Georgia have one of the nation’s lowest gas taxes?", "Yes, according to state motor fuel tax data from the Federation of Tax Administrators.", "Georgians pay $19.3 cents in state taxes for every gallon of gasoline. That includes a 7.5-cent excise tax – or a special fixed tax paid on the purchase of specific items such as gasoline, alcohol and tobacco products.", "The rest comes from a 4 percent sales tax the state levies on gasoline. As of January, that 4 percent sales tax translated into 11.8 cents.", "Only 14 states had lower state tax rates, including both excise and state sales taxes. Three of them are our neighbors: South Carolina (16.75 cents per gallon), Florida (17.1 cents) and Alabama (18 cents).", "Motorists in our other two neighboring states paid more, 37.75 cents in North Carolina and 21.4 cents in Tennessee.", "So far, so good. Georgia does in fact have some of the lowest taxes earmarked for transportation in the nation.", "But to Lindsey’s point, the state collections do not include the local sales taxes that drive up the cost at the pump but do not always end up fixing roads.", "That’s because Georgia state law allows all counties to levy a 1 percent special purpose local option sales tax, or SPLOST, for specific projects ranging from transportation to education.", "Voters must approve a SPLOST by referendum. Although some jurisdictions, such as Forsyth County, have successfully included road projects in their referendums, voters in metro Atlanta and some other regions in the state defeated a penny sales tax for transportation two years ago.", "That is part of what has left roads, bridges and rails without enough money for repairs and growth – and why a study committee of politicians and business leaders is slated to recommend a new proposal by year’s end.", "Lindsey, who serves on that committee, unofficially known as the Plan B Committee, said he hopes drawing attention to the local sales taxes will show the state should wean local governments off those funds while simultaneously increasing the state collections, specifically for transportation projects.", "\"When we put a tax or a fee on gasoline, the average voter probably thinks those taxes are going to transportation and they’re not,\" Lindsey said.", "But are Georgians really paying some of the highest gas taxes in the region – and could therefore afford such a shift?", "That’s where the numbers get tricky.", "An October breakdown of motor fuel taxes by the American Petroleum Institute -- including fees and local taxes -- pushes what Georgians pay to 27.49 cents per gallon.", "Those local taxes and fees have a dramatic effect in Florida, as anyone who has trundled down to Disney World can attest. The API shows motorists there pay a state average of 36.02 cents per gallon.", "North Carolina motorists pay even more, 36.75 cents per gallon, according to the API data (although less than what the Federation of Tax Administrators’ data show).", "Wes Clarke, a senior associate at the Carl Vinson Institute of Government at the University of Georgia, co-wrote a 2010 study that showed Georgia had one of the lowest gas taxes in the nation,", "The API data, he said, show that Georgia still ranks third-highest of its neighbors (and all other Southern states, except Kentucky) when it comes to gas taxes.", "The ranking is misleading, though.", "Based on the API data, Georgia could increase its gas tax by 8 cents a gallon – more than doubling the current excise tax – and remain in third.", "In fact, the Fiscal Research Center in 2010 recommended a somewhat smaller increase to the excise tax – a penny a year for six years – to help solve Georgia’s transportation woes.", "That would bring Georgia up to the national average on excise taxes, without changing its ranking among neighboring states, said Peter Bluestone, a senior research associate at the Fiscal Research Center. That would result in less than a 0.3 percent increase at the gas station.", "\"Even if you add in the local taxes, we’re in the middle,\" Bluestone said. \"We do recommend an increase that would keep us there.\"", "So that means Lindsey is right in saying that Georgia has one of the lowest state tax rates in the nation.", "Other data show that, factoring in local taxes, Georgians still pay the third-most in the region when it comes to filling up at the pump.", "Lindsey errs in thinking a third-place ranking means the state is on par with the top two, which are among the highest in the nation.", "He undercuts his larger point about local gas taxes by ignoring Georgia falling a distant third in the region on what motorists pay for gasoline.", "But looking at rankings alone, Georgians do pay among the highest at the pump for the region but the lowest in the nation.", "We rate his statement Mostly True.", "The Atlanta Journal-Constitution Political Insider blog, Nov. 10, 2014,", "The Atlanta Journal-Constitution, \"Signs that transportation issues may be stalling metro Atlanta,\" Nov. 7, 2014,", "Fiscal Research Center, Georgia's Fuel Tax, December 2010", "Fiscal Research Center, Gasoline Taxes in Georgia, April 2006", "Carl Vinson Institute of Government, University of Georgia, \"The Motor Use Fuel Tax in Georgia: Collection Efficiency, Trends, and Projections,\" December 2010,", "Tax Foundation, State Gasoline Tax Rates 2009-2013, March 2013,", "Federation of Tax Administrators, State Motor Fuel Tax Rates, Jan. 1, 2014,", "American Petroleum Institute Gasoline Tax (map)", "American Petroleum Institute, State Motor Fuel Taxes 2014", "Phone interview with Edward Lindsey, former state representative and Plan B committee member, Nov. 14, 2014", "Phone interview with Wes Clarke, senior public service associate, Carl Vinson Institute of Government, University of Georgia, Nov. 14, 2014", "Phone interview with Peter Bluestone, senior research associate, Fiscal Research Center, Georgia State University, Nov. 14, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]