["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A video published on Facebook claims to show former President Barack Obama in jail. In fact, it shows him visiting Nelson Mandela's former prison cell in South Africa in 2013. (Screenshot from Facebook)", "Barack Obama has not been arrested. The false claim is connected to the baseless QAnon conspiracy theory.", "The video cited in the post shows Obama visiting the cell where Nelson Mandela was imprisoned in South Africa.", "A conspiracy theory linked to QAnon is using footage from 2013 to falsely claim former President Barack Obama is behind bars.", "In a video published Jan. 17, Gage Nelson, host of the conservative podcast America Divided, said: \"Barack Obama was arrested.\"", "\"With over 30,000 National Guard troops in DC, the rumor on the street is that, on Jan. 20, many people are going to jail,\" he said. \"Now there’s a video of Barack Obama in a jail cell.\"", "The clip was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) It was more than 42,000 views.", "Video evidence of Obama in jail sounds like a shocking scoop. But the footage Nelson shared doesn’t show that — it shows Obama visiting the cell where Nelson Mandela was held during South Africa’s apartheid government.", "The same clip was published by the Guardian on YouTube. It shows Obama looking around the cell on Robben Island where Mandela was imprisoned for 18 years. The Obamas visited the former prison in June 2013.", "Watch for yourself below:", "Unproven claims that Democrats will be arrested in the lead-up to Joe Biden’s inauguration have circulated on social media over the past few weeks. They’re related to the baseless QAnon conspiracy theory, which says President Donald Trump will soon announce mass arrests and executions of Democrats who are part of an underground child sex trafficking ring.", "If a former president were in jail, it would be big news. But we could find no evidence that Obama was arrested. We’ve debunked several similar hoaxes over the years.", "We reached out to the Obama Foundation for a comment, but we haven’t heard back.", "The Facebook post is inaccurate and ridiculous. We rate it Pants on Fire!", "Facebook post, Jan. 17, 2021", "PolitiFact, \"QAnon posts evade Facebook ban before Inauguration Day,\" Jan. 13, 2021", "PolitiFact, \"What is QAnon, the baseless conspiracy spilling into US politics?\" Aug. 27, 2020", "The White House, \"FLOTUS Travel Journal: Robben Island, An Experience We Will Never Forget,\" June 30, 2013", "YouTube video from the Guardian, July 2, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]