["The video was published in this Facebook post on December 7, 2019. It has been shared more than 460 times.", "The two-minute and six-second video shows four police officers with a dog arresting a man inside a mosque.", "Below is a screenshot of the misleading post:", "The post’s Indonesian-language caption translates in English as: “A blasphemy to the religion of Islam has happened again. A mosque, the holy house of God, is being degraded by infidels the enemy of God in Norway. For those of you who are not aware. Apparently the government of Norway has started to burn the Koran. A mosque imam was standing outside the mosque offering free Korans to anyone who needs it. And when the imam was reading the Koran, police officers entered the mosque with their shoes on and a dog. He asked them to remove their shoes and take the dog out of the mosque to protect the house of God. The police and the dog attacked and hit him.", "“The person who speaks in the video asks for the video to be shared and to make the incident known by the world. God is great. Oh God, help those who help your religion and exterminate those who want to exterminate your religion and Muslims! Amen.”", "The same video was also shared with a similar claim here and here on Facebook; here on Twitter and here on YouTube, where it has been viewed almost 800 times.", "The video was also shared in Arabic language here and here with the same claim.", "It was also shared in English here and here with a claim that the footage shows Norwegian police officers arresting someone who recited the Koran in a mosque, and here with a claim that Norwegian police entered a mosque to arrest a Muslim.", "The claims are false; the video has circulated in Dutch media reports about a man who was arrested for allegedly attacking police officers during a disturbance at a mosque in Rotterdam. The reports contained no reference to the man being arrested for reciting the Koran.", "A reverse image search and a keyword search on Google found the same two-minute, six-second video published on Facebook here on October 6, 2019.", "The Dutch-language caption translates to English as: “Police officers with a police dog detained a worshipper at Essalaam Mosque in Rotterdam. On September 17, 2019, the police received a message from the leadership of the mosque that they wanted to expel a man causing a disturbance. The four police officers had to use a police dog to overpower the man. The man’s family were also afraid to him. The 43-year-old Rotterdam resident is still in detention.”", "Multiple news reports in Dutch have also covered the incident, for example this October 4, 2019, report by Dutch-language daily newspaper De Telegraaf.", "Below is a screenshot of De Telegraaf’s report:", "The report’s headline translates to English as: “Officers with police dog overpower man in mosque”.", "The sub-headline reads in English as: “Images circulating on the internet show an arrest in the Rotterdam Essalam mosque in Rotterdam South. Four officers and a police dog are attacked by a man sitting in a corner of a room.”", "The first paragraph of the report reads: “On September 17, the police were called by the mosque because a man inside the Islamic prayer house on Vredesplein was making trouble, a police spokesperson told De Telegraaf. Officers went to the mosque with a dog. The board wanted him to go. The man's family are also afraid of him. He then attacked the officers. He was arrested and is still in detention, the spokesman said.”", "The man is 43 years old and he is from Rotterdam, the report said.", "De Telegraaf’s report also includes the same video of the incident.", "Below is a screenshot comparison between the video in the misleading post and the video posted by De Telegraaf:", "Essalam Mosque is located in the Dutch city of Rotterdam. Here is the interior of the mosque’s hall captured in a Google user's photo tagged at the mosque's location on Google Maps. It matches the interior seen in the footage.", "Other news organisations also reported the incident in the video, for example this report by Dutch broadcaster WNL Vandaag on October 4, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]