["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Thom Tillis, R-N.C., speaks during a campaign rally for President Donald Trump in Charlotte, N.C. in March 2020 (AP)", "During the first presidential debate of 2020, President Donald Trump touted his efforts to curb skyrocketing drug prices and declared that insulin is now \"so cheap, it’s like water.\" The response on social media was swift, and divided, with some people sharing pharmacy bills showing thousands of dollars they’d spent on insulin, while others boasted of newfound savings.", "The next day, a self-described progressive political action committee called Change Now jumped into the fray by releasing an ad that circulated on Facebook attacking Trump and Sen. Thom Tillis, R-N.C., on this issue.", "In the 30-second ad, a North Carolina woman in her 30s explains she was diagnosed with Type 1 diabetes at age 4.", "\"Donald Trump and Thom Tillis opposed legislation that would lower the price of insulin and other prescription drugs,\" she says. \"People with diabetes can’t afford to wait for Trump and Tillis to fight for us. ... We need affordable insulin now.\"", "(Posts sharing the quote were flagged as part of Facebook’s efforts to combat false news and misinformation on its news feed. Read more about PolitiFact’s partnership with Facebook.)", "In recent years, politicians on both sides of the aisle have committed to addressing the cost of insulin. This election cycle — coinciding with a looming threat to the Affordable Care Act and millions of people losing jobs and employer-sponsored health insurance during the pandemic — the high price of prescription drugs has gained new significance.", "Tillis is in one of the most heated Senate races in the country and has been repeatedly criticized by his opponent for receiving more than $400,000 in campaign contributions from the pharmaceutical and health product industries. Across the country, many voters say lowering prescription drug costs should be the top health priority for elected officials.", "So, did Trump and Tillis really oppose policies that would accomplish that goal? We decided to take a closer look.", "It turns out they’ve both opposed certain pieces of legislation that could have lowered the price of insulin and other prescription drugs, but they’ve also offered alternatives. The question is how aggressive those alternatives are and how many Americans would benefit from them.", "Change Now pointed to two congressional bills to support the ad’s claim: one opposed by Trump, and the other by Tillis.", "The first bill, known as H.R. 3, passed the House in December 2019, largely due to Democratic votes. It contains three main elements: decreasing out-of-pocket costs for people on Medicare, penalizing pharmaceutical companies that raise the price of drugs faster than the rate of inflation and — the most aggressive and controversial feature — allowing the federal government, which administers Medicare, to negotiate the price of certain drugs, including insulin. It also requires manufacturers to offer those agreed-on prices to private insurers, extending the benefits to a wider swath of Americans.", "Stacie Dusetzina, an associate professor of health policy at Vanderbilt University School of Medicine, called it \"the broadest-reaching policy that has been put forward\" on drug pricing.", "\"While a lot of reform has focused on Medicare beneficiaries, that misses many insulin users,\" Dusetzina said. \"H.R. 3 does the most to affect prices for young consumers, like the woman in the ad.\"", "At the time, Trump vowed to veto that bill, saying the price controls it imposed \"would likely undermine access to lifesaving medications\" by decreasing the incentive for companies to innovate. When we checked in with the Trump campaign about the ad, a spokesperson reiterated this position, adding that the president continues to seek better legislative options.", "The House bill in question, though, never made it to the president’s desk because the Senate didn’t take it up. Instead, the Senate Finance Committee proposed its own bill, which brings us to the second piece of legislation cited by Change Now.", "Known as the Prescription Drug Pricing Reduction Act of 2019, the Senate bill echoes two aims of the House proposal: decreasing out-of-pocket costs for people on Medicare and putting an inflation-based cap on some drug prices.", "That bill, too, stalled, with several Republican senators wary of the inflation cap. Among them was Tillis, who expressed concern that the measure could hamper innovation.", "So it’s true that Trump and Tillis have both opposed legislation that could lower the cost of insulin and other prescription drugs. But that’s not the full picture of what either politician has done on this issue.", "The Trump campaign provided a long list of actions taken by his administration to curb the high costs of medication, including a flurry of executive orders related to insulin and prescription drugs. Tillis’ campaign highlighted an alternative bill the senator co-sponsored to target drug costs. Let’s break them down one at a time.", "One of Trump’s orders aims to have Federally Qualified Health Centers provide insulin and EpiPens at a discounted rate to the low-income individuals they serve. These centers, however, are already required to offer sliding-scale payments, and a full discount to patients who earn below the federal poverty line, said Rachel Sachs, an associate professor of law at Washington University in St. Louis, who tracks drug-pricing laws.", "Another order deals with the importation of drugs from Canada, where they are often cheaper. Although the order specifically excludes biologic drugs, including insulin, the administration has requested proposals from private companies on how insulin could be safely brought in from other countries.", "The president also issued a particularly ambitious order that seeks to tie the price Medicare pays for drugs to a lower international reference price. The Trump administration, however, hasn’t released final regulations to implement that policy, which could take years. If implemented, the policy is expected to be challenged in court by the drug industry.", "Perhaps the most notable measure on insulin at the moment, experts said, is a federal demonstration project that Medicare plans can voluntarily opt into, to cap the monthly copay for insulin at $35 for some seniors. The project is slated to begin in January 2021, but its long-term future is uncertain, Sachs said, because it relies on parts of the Affordable Care Act, which could be struck down by a Supreme Court ruling later this year.", "In Congress, Tillis and five other Republican senators introduced an alternative drug-pricing bill last December, called the Lower Costs, More Cures Act.", "Tillis believes this is \"the better option,\" campaign spokesperson Andrew Romeo said, because \"in addition to helping control drug prices, the legislation also seeks to preserve America's capacity to research and develop lifesaving medications.\" It includes a monthly cap on insulin copays for Medicare beneficiaries and requires manufacturers to disclose prices in consumer ads.", "But experts said Tillis’ proposal is weaker than other options before the House and Senate. It doesn’t include an inflation cap, Sachs said, and the bill’s benefit would likely be limited to some seniors on Medicare, leaving out the more than 150 million Americans covered by private insurance.", "Jason Roberts, an associate professor of political science at the University of North Carolina-Chapel Hill, said the bill is largely symbolic.", "\"Tillis is getting hit for not supporting a bill that could move,\" Roberts said. \"Instead, he introduces something that has no chance of going anywhere, and he knows that. But it’s a way of trying to deflect that criticism without getting a lot accomplished.\"", "An ad sponsored by a progressive political action committee claims that Trump and Tillis have opposed legislation that would decrease the cost of insulin and other prescription drugs.", "Based on the two pieces of drug-pricing legislation Change Now points to, that’s accurate. Trump and Tillis have voiced opposition to prominent bills that experts say could decrease the cost of insulin for a broad group of Americans.", "Both politicians have proposed alternative policies to lower the price of insulin and other prescription drugs, but most of their proposals have not taken effect yet and are largely targeted at seniors.", "We rate the claim Mostly True.", "Change Now, Candis advertisement, accessed Oct. 14, 2020", "Email statement, Andrew Romeo, spokesperson for Sen. Thom Tillis campaign, Oct. 14, 2020", "Email statement, Courtney Parella, spokesperson for President Donald Trump campaign, Oct. 15, 2020", "Interview, Stacie Dusetzina, associate health policy professor at Vanderbilt University School of Medicine, Oct. 13, 2020", "Interview, Rachel Sachs, associate professor of law at Washington University in St. Louis, Oct. 13, 2020", "Interview, Jason Roberts, associate professor of political science at University of North Carolina-Chapel Hill, Oct. 13, 2020", "Kaiser Health News, Promises Kept? On Health Care, Trump’s Claims of ‘Monumental Steps’ Don’t Add Up, Sept. 28, 2020", "Kaiser Health News, Trump Approves Final Plan to Import Drugs From Canada ‘for a Fraction of the Price’, Sept. 25, 2020", "PolitiFact, Cunningham Half Right About Tillis Role in Prescription Drug Efforts, Sept. 24, 2020", "White House, Statement of Administration Policy on H.R. 3, Dec. 10, 2019", "The Washington Post, Trump Boasted He Made Insulin So Cheap ‘It’s Like Water.’ Americans With Diabetes Beg to Differ., Oct. 1, 2020", "Center for Responsive Politics, Campaign Contributions by Industry in Tillis-Cunningham Race, accessed Oct. 14, 2020", "The New York Times, Lawmakers in Both Parties Vow to Rein In Insulin Costs, April 10, 2019", "Kaiser Family Foundation, Health Insurance Coverage of Total Population, accessed Oct. 14, 2020", "Thom Tillis campaign, Press release on Lower Costs, More Cures Act, Dec. 20, 2019", "Centers for Medicare & Medicaid Services, Press release on insulin demonstration project, May 26, 2020", "The New York Times, Trump Issues Expansive Order Aimed at Lowering Drug Prices, Sept. 13, 2020", "White House, Executive Order on Access to Life-Saving Medications, July 24, 2020", "The Hill, Vulnerable Republicans Balk at Trump-Backed Drug Pricing Bill, Oct. 26, 2019", "Congress, Prescription Drug Price Reduction Act of 2019, accessed Oct. 14, 2020", "Congress, H.R. 3 Elijah Cummings Lower Drug Costs Now Act, accessed Oct. 14, 2020", "Health Resources and Services Administration, Health Center Program Compliance Manual, accessed Oct. 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]