["About this rating", "A meme from 2019 posited that Dr. Henry Kissinger, who served as U.S. National Security Advisor and Secretary of State during the Nixon and Ford administrations, delivered a speech to a World Health Organization (WHO) council on eugenics in 2009 at which he declared that the first step in controlling populations was to get them to accept mandatory vaccinations. Following that step, people would accept forcible organ donation, genetically modified children, and mandatory sterilization:", "Once the herd accepts mandatory forcible vaccination, it's game over! They will accept anything -- forcible blood or organ donation -- for the \"greater good.\" We can genetically modify children and sterilize them -- for the \"greater good.\" Control sheep minds and you control the herd. Vaccine makers stand to make billions, and many of you in this room today are investors. It's a big win-win! We thin out the herd and the herd pays us for providing extermination services. Now, what's for lunch, huh?", "The over-the-top nature of this putative Kissinger statement (particularly its concluding sentence) should be a strong indicator it's merely a fabrication. We find it unlikely that an experienced public speaker like Kissinger would use redundant adjectives (\"mandatory forcible vaccination\"), refer to the populace as a \"herd,\" or finish an address with the words \"Now, what's for lunch, huh?\" In no respect does it read like an excerpt from an actual speech.", "More to the point, the passage comprises an incoherent jumble of outlandish claims that could only make sense to a conspiracy theorist, leaping from forcible vaccinations to genetically modifying and sterilizing children to \"providing extermination services\" and \"thin[ning] out the herd.\" Our efforts to find any evidence at all that Henry Kissinger uttered these words, or that he took similar public positions on other occasions, were in vain.", "A \"World Health Organization Council on Eugenics\" does not exist, nor has such a body ever existed. The word \"eugenics\" has a long and sordid history, primarily as the name of a now-discredited social theory and movement from the early 20th century advocating the improvement of society by ensuring that people deemed genetically \"superior\" reproduce at a higher rate than those identified as \"inferior.\" On the rare occasions when eugenics is discussed in World Health Organization (WHO) documents, it's in a historical context emphasizing that the practice served as a basis for the genocidal policies of Nazi Germany.", "Kissinger is often portrayed as a kind of supervillain in the writings of conspiracy theorists, who have misquoted him before in the interests of identifying him with the alleged machinations of a secretive, elite cabal to rule the world. \"Depopulation should be the highest priority of foreign policy towards the third world,\" they've quoted him as saying. The statement meshes well with the ersatz sentiments attributed to Kissinger above. When pressed, however, nobody seems to be able to specify where or when he ever made any such pronouncements.", "Horowitz, Len.   \"Kissinger & Vaccinations - Bush Decisions Linked to 'Mark of the Beast' Numerology.\"\r\n  Rense.com.   Accessed 11 April 2019.", "Kevles, Daniel J.   \"Eugenics and Human Rights.\"\r\n   BMJ.   14 August 1999.", "Wertz, D.C. et al.   \"Review of Ethical Issues in Medical Genetics.\"\r\n    World Health Organization, 2003.", "World Health Organization et al.   \"Eliminating Forced, Coercive and Otherwise Involuntary Sterilization: An Interagency Statement.\"\r\n    2014.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]