["The post was published here on a Thailand-based Facebook page on July 8, 2019, where it has been shared more than 39,000 times.", "The lengthy Thai-language caption translates to English in part as: “#howdocancerpatientsdie? Russian research found out that the cause of cancer patients’ death is from carelessness.\"", "The post claims: \"If patients stop eating sugar, cancer cells will die naturally.\"", "It also claims: \"Mixing lemon with hot water and drinking it for three months is actually better than chemotherapy.", "It adds a final claim: \"Take spoonfuls of organic coconut oil morning and night, and cancer cells will gradually disappear.”", "Below is a screenshot of the misleading Thai-language post:", "Similar claims about cancer cures have also been shared in Thai-language posts here, here, here, here, here, and here.", "Similar claims about a no-sugar diet's cancer-killing abilities, and the benefits of hot water and lemon and coconut oil, have been in English on Facebook pages from America to Kenya.", "Multiple doctors told AFP that the claim that a sugar-free diet causes \"cancer cells (to) die naturally\" is false; scientific studies also show that normal, healthy cells need sugar for energy.", "Dr. Punlert Tanyakul, an oncologist at Phyathai Hospital in Bangkok, told AFP by phone on November 11, 2019, warned against a no-sugar diet.", "“It is certainly not good to cut sugar out of your diet as sugar is needed for every human being’s body. If you don’t have any sugar in your body, body cells will not be able to survive and will be unable to function.\"", "But he added that \"consuming too much sugar could increase the risks of cancer.”", "Glucose is a primary energy source for most cells, according to this report published by the US-based National Library of Medicine.", "The report states in part: “Glucose is a primary energy source for most cells and an important substrate for many biochemical reactions. As glucose is a need of each and every cell of the body, so are the glucose transporters”.", "This report, 'Curing cancer with effective methods for the better lives of patients', written by Dr. Isara Anongchanya for the Vejthani Hospital in Bangkok does not list a sugar-free diet as a cure for cancer.", "The \"effective methods\" for treating cancer listed in the report include: surgery, radiotherapy, chemotherapy, hormonal therapy, immunotherapy, and bone marrow/stem cell transplantation.", "This article published by UK based cancer charity Cancer Research UK states there is no evidence that a sugar-free diet can lower the risk of getting cancer or increase the chances of surviving it after diagnosis.", "Cancer Research also published a video on YouTube here headlined: \"Does Sugar Feed Cancer\".", "\"Fact: cutting out processed sugar won't kill cancer cells\" the video report says.", "The Cancer Research written report states in part: “Cancer cells usually grow quickly, multiplying at a fast rate, which takes a lot of energy. This means they need lots of glucose. Cancer cells also need lots of other nutrients too, such as amino acids and fats; it’s not just sugar they crave.", "“Here’s where the myth that sugar fuels cancer was born: if cancer cells need lots of glucose, then cutting sugar out of our diet must help stop cancer growth, and could even stop it developing in the first place. Unfortunately, it’s not that simple. All our healthy cells need glucose too, and there’s no way of telling our bodies to let healthy cells have the glucose they need, but not give it to cancer cells.", "“There’s no evidence that following a 'sugar-free' diet lowers the risk of getting cancer, or boosts the chances of surviving if you are diagnosed.”", "AFP has previously fact-checked claims that drinking hot lemon water can cure cancer in this report published in French on June 18, 2019.", "Professor Nicolas Boissel, a specialist in blood cancer at the Saint-Louis hospital in Paris, told AFP: \"Neither hot water, nor lemon, nor sugar-free diets have proven anti-cancer action. Lemon derivatives (like many other plants for that matter) have shown anti-cancer activity. This probably explains the confusion.”", "The misleading post also claims: \"Take spoonfuls of organic coconut oil morning and night, and cancer cells will gradually disappear.”", "Multiple other Thai-language posts on Facebook make similar claims about the purported role of coconut oil as a cure for cancer, for example here, here, and here.", "Below is a screenshot of one of the misleading Facebook posts:", "The misleading post's caption says: “Coconut oil’s effectiveness in killing colon cancer cells is as high as 93%” and it shares a link to a post with the same headline on a real estate blog.", "The claim is false.", "There is some evidence that lauric acid, which is found in coconut oil, could inhibit cancer cells’ growth, according to this study published by the US-based National Library of Medicine in 2017.", "But the study cautioned that: \"additional studies are warranted to further corroborate (lauric acid's) usefulness in more comprehensive therapeutic approaches.”", "Oncologist Dr Punlert told AFP that the claim that taking \"spoonfuls of organic coconut oil\" would cause cancer to disappear was incorrect.", "“The claim is false. We haven’t seen any evidence or information about the cancer treatment related to coconut oil in the human body.”", "This claim has previously been fact-checked by Africa Check in a June 2019 report published here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]