["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Priorities USA Action, a Democratic super PAC, announced a new digital and TV ad series criticizing President Donald Trump’s response to the coronavirus pandemic.", "Among the ads is a 15-second spot, titled \"Pause,\" that alleges Trump is trying to cut Medicare during the global health emergency.", "\"Our lives are on pause. We’re worried about our health. So why is Trump still trying to cut our Medicare? $451 billion in cuts in the middle of a deadly pandemic. Trump is putting us at risk,\" the commercial’s narrator says.", "The PAC, which was formed in 2011 to support President Barack Obama’s reelection campaign, has been tapped by Joe Biden, the presumptive Democratic presidential nominee, as his preferred choice among Democratic super PACS for big-donor giving.", "This ad caught our attention for two reasons. First, the term \"Medicare cuts\" has long been volleyed between both Republicans and Democrats in Congress and the White House — and often has proven to be a powerful political tool.", "Second, the connection between \"cuts\" to Medicare and the coronavirus pandemic was a new concept we wanted to explore.", "We reached out to Priorities USA Action to ask for the basis of these statements.", "Josh Schwerin, a PAC spokesperson, sent us a links to news articles and confirmed that the \"$451 billion in cuts\" referred to Trump’s 2021 proposed budget for Medicare.", "Asked to pinpoint where the $451 billion came from, Schwerin pointed us to a February ABC News article that said the president’s budget plan would \"whack away at federal spending on health care over the next 10 years ... including $451 billion less spent on Medicare.\" He also sent us links to a February Washington Blade article and February press release from Rep. Jahana Hayes (D-Conn.) — both of which also cited that figure.", "In fall 2010, a few months after the Affordable Care Act was enacted, Republicans aired midterm campaign ads attacking Democrats for \"cutting\" or \"gutting\" Medicare. The reason was the law included a $500 billion reduction in projected spending for Medicare over 10 years, which would be used to help fund the ACA.", "The Obama administration said the reductions in spending would come from lowering payments to Medicare Advantage plans and providers and would not affect the level of care that Medicare beneficiaries received. They also said it would help make the Medicare system more financially stable.", "Now, almost 10 years later, Democrats are using the same language to criticize the White House’s long-term plan for Medicare spending.", "\"‘Cuts’ is a term that has been thrown around for many years,\" said Tricia Neuman, executive director of the Program on Medicare Policy at the Kaiser Family Foundation. \"This is a semantic issue that often gets politicized, often in an election year.\" (Kaiser Health News is an editorially independent program of the foundation).", "Neuman explained that what is being considered here is a reduction in the projected increase in spending over a certain period. This reduction is based on estimates of how much the government is projected to spend on programs — factoring in proposed policy changes — for the following 10 years, taking into account current levels of spending, assumptions about economic growth and trends in use of Medicare coverage, said Neuman.", "Trump’s 2021 budget blueprint for Medicare estimated that spending would increase each of the 10 years. But the estimate also suggested that the administration’s proposed policy changes would reduce the spending increase compared with estimates of what would be spent if the changes were not implemented.", "\"Let’s say Medicare spends $100 in 2020 and is projected to spend $200 in 2021,\" Neuman said. \"If the budget said we’re going to reduce the growth in spending by $25, that's a reduction in an increase. But other people might call that a cut.\"", "We reached out to the Department of Health and Human Services, which oversees Medicare, for its take on that $451 billion figure, but have not heard back.", "Marc Goldwein, senior policy director for the nonpartisan Committee for a Responsible Federal Budget, said the actual figure could be anywhere from $400 billion to $600 billion, depending on how calculations are done. His analysis relied on the executive branch’s Office of Management and Budget calculations and landed on a figure close to $505 billion. Other variables, such as \"likely savings from drug price reform\" — yet to be enacted — move it closer to $600 billion.", "The left-leaning Center on Budget and Policy Priorities came up with a similar estimate: $501 billion. The Congressional Budget Office’s estimate not including savings generated from proposed drug pricing reforms was closer to $400 billion.", "In all cases, though, the reductions in Medicare spending would be achieved through proposals such as lowering payments to providers and paying the same amount for the same health service offered in different settings, among other things.", "Goldwein said these proposals for Medicare reform are largely bipartisan and \"either mimic or build upon\" those advanced during the Obama era. He also said that, in his organization’s view, the \"cuts\" are savings to the Medicare program and beneficiaries, who would see lower premiums and out-of-pocket medical costs.", "The policy experts said it’s likely the reductions in spending wouldn’t directly affect the care that Medicare beneficiaries receive. But provider groups have complained that lower reimbursements might drive some doctors to leave Medicare. Hospitals have argued against the proposal for equalizing payments for similar services because they say their overhead expenses are higher than those of a doctor’s office or off-site clinic and their higher rates help finance other necessary services.", "The Priorities USA Action ad also alleges that Trump is trying to cut Medicare \"in the middle of a deadly pandemic.\" But the timeline of events doesn’t support this statement.", "The White House released the 2021 budget proposal on Feb. 10 — well before the COVID-19 outbreak had become a part of our national consciousness.", "The first domestic case of COVID-19 was announced by the Centers for Disease Control and Prevention on Jan. 21. The World Health Organization declared the outbreak of the novel coronavirus a \"public health emergency of international concern\" on Jan. 30.", "On Feb. 10, the day the budget was released, the CDC put out a press release stating there were 13 cases of the disease in the U.S. CNN also published an article that day stating the vast majority of COVID-19 cases and deaths had occurred in China. Authorities didn’t announce the first U.S. death from COVID-19 until Feb. 29. The WHO declared a pandemic on March 11.", "\"These budget proposals were probably developed well before the pandemic hit the U.S. and hit it hard,\" said Neuman. However, she added, \"the administration hasn’t disavowed these proposals, but they also haven’t pushed them forward.\"", "Joseph Antos, a scholar in health care and retirement policy at the right-leaning American Enterprise Institute, said it was a \"ridiculous statement to connect cutting Medicare spending to the COVID crisis.\"", "\"The implication of the video that this is going on actively while we’re in the middle of this crisis, that’s dead wrong,\" said Antos.", "The Priorities ad said Trump is trying to make $451 billion in Medicare cuts \"in the middle of a deadly pandemic.\"", "This is an exaggerated attack, even before the pandemic is layered on top of it. The dollar figure itself is \"in the ballpark\" of what the policy proposals would generate in spending reductions, giving this ad a sliver of truth. However, in the Trump budget, the amount is spread out over ten years -- important context that was omitted.", "What’s in Trump’s budget proposal is not a direct cut to Medicare benefits. Instead, Priorities uses the age-old political tactic — employed on both sides of the aisle — of holding up a reduction in projected spending growth as a \"cut.\"", "Moreover, the ad leaves the impression that Trump is trying to whack Medicare for seniors at a time when panic is particularly high because of the coronavirus. But that connection to the pandemic is also misleading. The presidential budget was released weeks before most of the nation began to comprehend the threat of COVID-19.", "The claim contains an element of truth but ignores critical facts and context that would give a different impression. We rate it Mostly False.", "ABC News, \"3 things to know about Trump’s budget plan for Medicare, Medicaid,\" Feb. 11, 2020", "Centers for Disease Control and Prevention, \"First Travel-related Case of 2019 Novel Coronavirus Detected in the United States,\" Jan. 21, 2020", "Centers for Disease Control and Prevention, \"CDC Confirms 13th Case of 2019 Novel Coronavirus,\" Feb. 10, 2020", "Center on Budget and Policy Priorities, \"Medicare in the 2021 Trump Budget,\" Feb. 13, 2020", "Committee for a Responsible Federal Budget, \"The President’s Budget Saves Medicare $600 Billion While Reducing Out-of-Pocket Costs,\" Feb. 10, 2020", "Commonwealth Fund, \"That $716 Billion Medicare Cut: One Number, Three Competing Visions,\" Aug. 16, 2012", "Congressional Budget Office, \"Proposals Affecting Medicare — CBO’s Estimate of the President’s Fiscal Year 2021 Budget,\" March 25, 2020", "Rep. Jahana Hayes press release, \"Rep Hayes Condemns Trump Administration’s Proposed Cuts To Health Care, Social Security, SNAP, and Education Funding,\" Feb. 13, 2020", "CNN, \"February 10 coronavirus news,\" Feb. 10, 2020", "Email exchange with Josh Schwerin, senior strategist and director of communications, Priorities USA, May 21, 2020", "FactCheck.Org, \"Competing Claims on Trump’s Budget and Seniors,\" Feb. 18, 2020", "The New York Times, \"How the Coronavirus Pandemic Unfolded: a Timeline,\" May 26, 2020", "Office of Management and Budget, \"A Budget for America’s Future,\" Feb. 10, 2020", "Phone interview with Marc Goldwein, senior policy director, Committee for a Responsible Federal Budget, May 22, 2020", "Phone interview with Tricia Neuman, executive director of the Program on Medicare Policy, Kaiser Family Foundation, May 22, 2020", "Phone interview with Joseph Antos, scholar in health care and retirement policy, American Enterprise Institute, May 21, 2020", "Phone interview with Paul N. Van de Water, senior fellow, Center on Budget and Policy Priorities, May 22, 2020", "PolitiFact, \"‘Honest ad’ mostly wrong about Trump, taxes and Medicare,\" July 26, 2019", "PolitiFact, \"Republican exaggerations about cutting Medicare,\" Oct. 11, 2010", "Priorities USA, \"Pause - Medicare\" ad, May 19, 2020", "Priorities USA, \"Priorities USA Action Launches New TV and Digital Ads Linking Coronavirus Devastation to Trump’s Failure to Lead on Response,\" May 19, 2020", "Speaker of the House Nancy Pelosi Newsroom, \"Pelosi Statement on Trump Budget Summary,\" Feb. 9, 2020", "The Washington Blade, \"Trump’s budget seeks increased HIV funds ‚ but housing, global programs cut,\" Feb. 12, 2020", "The Wall Street Journal, \"Biden Campaign Indicates Priorities USA Is Preferred Super PAC,\" April 15, 2020", "The Washington Post, \"Democrats engage in ‘Mediscare spin’ on the Trump budget,\" March 15, 2019", "The Washington Post, \"What Trump proposed in his 2021 budget,\" Feb. 10, 2020", "World Health Organization, \"Statement on the second meeting of the International Health Regulations (2005) Emergency Committee regarding the outbreak of novel coronavirus (2019-nCoV),\" Jan. 30, 2020", "World Health Organization, \"WHO announces COVID-19 outbreak a pandemic,\" March 12, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]