["By Angelo Fichera", "Posted on January 9, 2020", "A fictitious tweet attributed to Rep. Ilhan Omar is circulating on social media. The congresswoman didn’t write that the “time for violence is now” over her disagreement with President Donald Trump’s actions on Iran.", "Rep. Ilhan Omar has used social media to publicly advocate against a potential war with Iran.", "But posts circulating online in recent days have spread a tweet about Iran that was falsely made to appear as if it came from the Democrat’s verified Twitter account. The fake tweet suggests Omar issued a call for “violence” — potentially against President Donald Trump — over the Middle East dispute. She didn’t.", "The fabricated tweet reads: “There is no way to overstate how ASHAMED I am to be called an ‘American.’ We need every world leader to rise up and demand that someone stops Trump from starting a catastrophic war with Iran. THE TIME FOR VIOLENCE IS NOW! #NoWarWithIran.”", "Dated Jan. 3, the bogus post includes a graphic with Omar’s photo and the words, “No War With Iran.”", "We could find no record of Omar posting that tweet, and a spokesman for Omar also confirmed to FactCheck.org that it wasn’t accurate.", "The screenshot instead appears to be a doctored version of an actual tweet Omar posted on Jan. 3, which includes the same “No War With Iran” graphic and some of the same words.", "“There is no way to overstate how dangerous this is. We need every voice to rise up and demand that Congress stop Trump from starting a catastrophic war with Iran. Sign the petition → bit.ly/IranPetitionIO #NoWarWithIran,” the real tweet reads.", "Omar’s tweet came the day after the U.S. killed Iranian Gen. Qassem Soleimani, prompting concerns about a possible war with Iran.", "The image of the bogus tweet was posted the same day by a Twitter account masquerading as a Fox News Channel account, as a researcher for Media Matters for America found. The fake Twitter account, archived online, was created this month and had only posted a few tweets before it was suspended.", "Even so, the falsified screenshot has migrated to Facebook — where it has been repeatedly posted by users.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Omar, Ilhan (@IlhanMN). “There is no way to overstate how dangerous this is. We need every voice to rise up and demand that Congress stop Trump from starting a catastrophic war with Iran. Sign the petition → http://bit.ly/IranPetitionIO #NoWarWithIran.” Twitter. 3 Jan 2020.", "“Remarks by President Trump on the Killing of Qasem Soleimani.” White House. 3 Jan 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]