["About this rating", "U.S. President Donald Trump's Fourth of July parade was both celebrated and criticized for its overt (and expensive) use of military vehicles. The event featured two M1 Abrams tanks, an M2 Bradley Fighting Vehicle, and, according to some confused social media users, a flyover by the Russian military.", "The idea that Russian planes flew over the Washington Memorial during Trump's parade appears to stem from two items: a satirical article published in The New Yorker and a typo from Trump.", "On July 3, 2019, humorist Andy Borowitz published a satirical article stating that Trump's parade would feature a flyover by Russian Su-24 fighter planes:", "Calling it “incredibly exciting news,” President Donald Trump revealed on Wednesday that his long-planned Fourth of July parade in Washington will include a flyover by Russian Su-24 fighter planes.", "“These are beautiful, gleaming Russian planes,” Trump boasted to Tucker Carlson, of Fox News. “I’m the first American President who’s had Russian fighters flying over Washington.”", "This, of course, is not a genuine news article. \"The Borowitz Report\" is a popular satirical column by the humorist. A disclaimer stating \"Satire from The Borowitz Report\" preceded this article, and the tags \"Satire\" and \"Humor\" followed after.", "Trump may have also contributed to the idea that Russian planes would be involved in the Fourth of July event. On the morning of the parade, Trump posted a message on Twitter that accidentally labeled \"Air Force One,\" the name of the United States' presidential plane, as \"Aircraft One,\" which is the title of a documentary about Russian President Vladimir Putin's plane:", "Trump deleted the flyover tweet and replaced it with a message correctly labeling his plane as \"Air Force One.\"", "In sum, the Russian military did not perform a flyover during President Trump's Fourth of July parade. Here's a video showing the U.S. military flyovers during the \"Salute to America\" event:", "Rieger, JM.   \"How Much Each Flyover Cost During Trump’s Fourth of July Event.\"\r\n    The Washington Post.   4 July 2019.", "Johnson, Megan.   \"Twitter Lampoons President Trump for 'Aircraft One' Typo: 'Does Anyone Onboard Know How to Run a Country'?\"\r\n    Yahoo News.   4 July 2019.", "Axelrod, Tal.   \"A Look at the Military Hardware in Trump's Fourth of July Celebration.\"\r\n    The Hill.   4 July 2019.", "Borowitz, Andy.   \"Trump’s Fourth of July Parade to Include Flyover by Russian Air Force.\"\r\n    The New Yorker.   3 July 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]