["Tens of thousands of demonstrators gathered Saturday in Washington, D.C., in support of President Donald Trump and unfounded claims of voter fraud during a \"Stop the Steal\" rally.", "One viral post on Facebook claims to show the \"million plus Trump supporters from all over the USA\" who showed up at the event. USA TODAY requested comment from this user, and the post was subsequently deleted.", "Elsewhere however, Facebook users continue sharing images of crowds claiming to be the rally.", "\"Amazing turnout in Washington DC at the Trump Support Rally! MAGA!\" wrote Facebook user Bonnie Carson. Five different aerial-view photos of large crowds gathering accompany Carson's post.", "Fact check:Election unlikely to be decided in the House, even if Trump refuses to concede", "A reverse Google search of the image reveals that three of the photos shared in the Facebook post are from a 2016 parade when the Cleveland Cavaliers won the NBA Championship, the first professional sports champion ship for the city in 52 years.", "One of the widely shared images claiming to show the D.C. rally was actually taken by Associated Press photographer Tom Withers on June 22, 2016. The image is captioned \"Cleveland Cavaliers fans gather to watch a parade celebrating the Cavaliers' NBA Championship in downtown Cleveland.\"", "A similar image used in the Facebook claim is also from the championship parade and is visible on the site of the Cleveland Neighborhood Progress.", "The team and officials at the Cleveland rally estimated that more than 1 million people attended the city's first championship parade since the Indians won the World Series in 1948, the Associated Press reported.", "Fact check: Photo claiming to show large Trump rally in Florida is of Swiss music festival", "Another reverse Google image search reveals one of the images is not even from the U.S., instead depicting a rally in London.", "The photo appears to be a screenshot of an aerial BBC footage taken during the 2018 People's Vote march to London's Parliament Square. The march was held in protest of UK's withdrawal from the European Union, popularly known as Brexit, petitioning for a second referendum.", "It is estimated nearly 700,000 were present during the march. Landmarks identifying the location as central London can be seen at the bottom of the screenshot – the InterContinental London toward the lower right of the frame and Aspley House, home of the first Duke of Wellington, Arthur Wellesley, bottom center.", "The final image of a crowd dotted with hues of red and blue does appear to be from the pro-Trump DC rally. NBC reporter Shomari Stone shared the vividly colored image on Twitter Nov. 14 which credits NBC Washington photojournalist Brooks Meriwether.", "There was much debate as to whether the image was photoshopped but NBC Washington's assistant news director Matt Glassman confirmed in an email to USA TODAY that Meriwether did take the photo around 11:55 a.m. Nov. 14 and that it was not altered.", "Despite many videos and photos from the rally showing thousands of people in large crowds, the protest was not nearly as large as the Cleveland 2016 championship parade or the People's Vote 2018 march.", "D.C. Mayor Muriel Bowser and the Metropolitan Police Department said earlier in the week that they would be monitoring the event but would not provide a crowd estimate, however, reporters on the scene estimated that tens of thousands were in attendance.", "The crowd was filled with red Make America Great Again hats and flags with Trump's name and many participants were not wearing face masks, USA TODAY reported.", "Later in the evening, at least 20 people were arrested and one stabbing took place after demonstrators clashed with counterprotesters, according to the Associated Press.", "Fact check: Dominion voting machines didn't delete votes from Trump, switch them to Biden", "We rate this claim as PARTLY FALSE, based on our research. Most of the images claiming to show a pro-Trump rally in Washington, D.C., are actually from a 2016 Cleveland championship parade, where over a million people were in attendance, and a Brexit protest in 2018. One of the photos in this post — which is shared in many other posts — is of Saturday's pro-Trump event in D.C.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]