["About this rating", "Some research indicates that specific bacteria linked with aggressive early childhood cavities may be transmitted between caregivers and small children; at least one small study involving four couples had similar findings.", "The transmissibility of cavities seemed restricted only to specific bacteria and circumstances.", "On 20 February 2016, ScienceDaily shared a University of Louisville press release titled \"Cavities are contagious, research shows,\" which said (without a link to any particular research):", "Dental caries, commonly known as tooth decay, is the single most common chronic childhood disease. In fact, it is an infectious disease. Mothers with cavities can transmit caries-producing oral bacteria to their babies when they clean pacifiers by sticking them in their own mouths or by sharing spoons.", "According to Liliana Rozo, D.D.S., assistant profesor, University of Louisville School of Dentistry, tooth decay can have a detrimental effect on a child's quality of life, performance in school and success in life. The disease can cause pain, inability to chew food well, embarrassment about discolored or damaged teeth, and distraction from play and learning.", "The original press release was either deleted or removed at some point, but the original version quite explicitly made no mention of either an active or recent study:", "According to Liliana Rozo, D.D.S., assistant profesor, University of Louisville School of Dentistry, tooth decay can have a detrimental effect on a child’s quality of life, performance in school and success in life. The disease can cause pain, inability to chew food well, embarrassment about discolored or damaged teeth, and distraction from play and learning.", "These are among the tips a dentist can discuss with parents during a free dental screening for children who are first time patients of the UofL School of Dentistry. This promotion is being offered now through the end of spring.", "In early 2011, TIME magazine and the New York Times were among outlets reporting on the purported risks of transmitting cavities:", "“Particularly, the easiest way to catch a cavity is when a mother is feeding a child,” Dr. Irwin Smigel, creator of Supersmile, told AOL Health. The mother will taste the food to check the temperature and then continue feeding the child. “Immediately, that’s how kids get cavities,” he says.", "Kissing between couples can also cause the spread of harmful bacteria. Smigel has seen many patients, particularly women, who have clean, healthy mouths, discover a cavity or two after entering into a relationship with a man who has cavities, gum disease or hasn’t been to the dentist in several years.", "Infants and children are especially vulnerable to the bacteria. A 2007 study conducted at the University of Queensland’s School of Dentistry in Australia found that cavity-causing bacteria was found in the mouths of 30% of 3-month-old babies and more than 80% of 24-month-olds with primary teeth.", "Research conducted in 2007 indicated the presence of certain bacteria in the mouths of infants was linked with severe childhood cavities, but it didn't detail how the purported transmission took place. Overall, that material simply concluded that \"strategies for the prevention of dental caries should include timely control of colonization of the cariogenic [cavity-causing] bacteria in the mouths of young children.\"", "The New York Times mentioned studies, but only referenced anecdotes:", "A number of studies have also shown that transmission can occur between couples, too. Dr. Mitchell has seen it in her own practice.", "“In one instance, a patient in her 40s who had never had a cavity suddenly developed two cavities and was starting to get some gum disease,” she said. She learned the woman had started dating a man who hadn’t been to a dentist in 18 years and had gum disease.", "In the described scenario, a change in diet, habits, or other factors presumably could have been a contributing factor. In 2010, a separate study of older children asserted that mother-to-child transmission had been \"suggested\" by other studies, but it was not described as necessarily definitive:", "Vertical transmission from mother to child has been suggested as the main pathway for mutans streptococci acquisition. Several studies reported similar mutans streptococci genotypes common to mother, father, and child ... Recent studies have suggested that horizontal transmission occurs readily within families[.]", "Dentistry texts published in 1999 were similarly inconclusive:", "Dental decay has been known since recorded history, but was not an important health problem until sucrose became a major component of the human diet. When sucrose is consumed frequently, an organism known as Streptococcus mutans emerges as the predominant organism, and it is this organism that has been uniquely associated with dental decay.", "In 1924 S mutans was isolated from human carious lesions, but subsequently was not thoroughly studied until the 1960s when it was re-identified as the etiologic agent of a transmissible caries infection in rodent models. In these studies, all of Koch's postulates for infectivity were fulfilled in animal models. However, it proved difficult to show that S mutans was a human dental pathogen, because S mutans appears to be a member of the normal flora on the teeth, and it was difficult to show that an increase in S mutans actually preceded and/or coincided with the earliest clinical lesion.", "As of 2007, studies indicated that suspected transmission from mother to child occurred \"shortly after birth\" and well prior to the appearance of teeth. Quite often, transmission was cited among several other factors (such as socioeconomic status, familial habits, and caretaking practices) observed in severe early childhood caries; it remained possible that transmission between individuals was one of several mitigating factors.", "By 2009, research remained inconclusive on the matter of cavity contagion:", "In 26% (7/27) of mother/child pairs, all of the child's isolates matched the mother. In 15% (4/27), some of the child's genotypes matched the mother, and in 59% (16/27), no isolates matched the mother. Maternal transmission was a mode of MS acquisition in 41% (11/27) of mother/child pairs, while acquisition from non-maternal sources occurred in 74% (20/27). Conclusions: MS genotypes that did not match maternal strains were identified in the majority of children (74%) within this S-ECC population. Evidence of maternal transmission was detected in 41% of mother/child pairs.", "As for the matter of transmission between intimate partners (with one fortunate enough to live a cavity-free life while their partner suffers with frequent decay) the sample size of the most commonly referenced research (1993) was exceedingly small:", "Of the 20 couples investigated, the 4 in which both spouses harbored A. actinomycetemcomitans and P. gingivalis were chosen for the transmission study. Three of these couples also harbored mutans streptococci ... The spouses in 2 couples shared the same sero- and ribotypes of A. actinomycetemcomitans and S. mutans. P. gingivalis ribotypes were identical in 2 couples. The result suggests transmission of oral bacteria between spouses.", "Of the people originally examined, the conclusion was based on results derived from four individuals, or two couples. Ongoing research has primarily focused on severe early childhood cavities, not broad A-to-B transmission of cavities. Evidence suggesting couples were cavity vectors (via kissing) was incomplete or anecdotal, and research into caregiver-to-child transmission typically involved a host of factors such as a household's socioeconomic profile, culture, smoking in the home, and other variables.", "Evidence did not disprove the idea that cavity-causing bacteria was transmitted between caregivers and children or intimate partners, but neither did it seem to be cause for alarm.", "Alaluusua, Satu.   \"Streptococcus Mutans Establishment And Dental Caries Experience In Children From 2 To 4 Years Old.\"\r\n    European Journal of Oral Sciences.   December 1983.", "Berkowitz, Robert J.   \"Mutans Streptococci: Acquisition And Transmission.\"\r\n    Pediatric Dentistry.   28 February 2008.", "Heflin, Julie.   \"Cavities Are Contagious.\"\r\n    University of Louisville Today.   18 February 2014.", "Law, V. et. al.   \"Factors Influencing Oral Colonization Of Mutans Streptococci In Young Children.\"\r\n    Australian Dental Journal.   June 2007.", "Doméjean, S. et. al.   \"Horizontal Transmission Of Mutans Streptococci In Children.\"\r\n    Journal of Dental Research.   January 2010.", "Loesch, Walter J.   \"Chapter 99, Microbiology of Dental Decay and Periodontal Disease.\"\r\n    Medical Microbiology, 4th Edition..   1996.", "Mitchell, Stephen C. et. al.   \"Maternal Transmission Of Mutans Streptococci In Severe-Early Childhood Caries.\"\r\n    Pediatric Dentistry.   May/June 2009,   pp. 193-201(9).", "Ninh, Amie.   \"Are Cavities Really Contagious?.\"\r\n    TIME.   7 April 2011.", "O'Connor, Anahad.   \"The Claim: Dental Cavities Can Be Contagious.\"\r\n    New York Times.   28 March 2011.", "Saarela, M. et. al.   \"Transmission Of Oral Bacterial Species Between Spouses.\"\r\n    Molecular Oral Microbiology.   December 1993.", "Simon, Lisa. al.   \"The Role Of Streptococcus Mutans And Oral Ecology In The Formation Of Dental Caries.\"\r\n    Journal of Young Investigators.   December 2007.", "ScienceDaily.   \"Cavities Are Contagious, Research Shows.\"\r\n    20 February 2014.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]