["The image was published here on Facebook on June 2, 2020. It has been shared more than 15,000 times.", "The Sinhala-language text superimposed above the image translates to English as: “This 14-year-old girl, who went to sleep while listening to music from her phone which she kept under the pillow, was found dead by her parents in the morning due to shock to the ear caused by earphones when the overheated phone exploded. It is everyone’s responsibility to be aware and raise awareness.”", "The post’s caption reads: “For your attention”.", "The image was shared alongside a similar claim on Facebook here and here.", "The claim is false.", "A reverse Google image search found that the image was created by Ukranian photographer Hanna Panchenko for an artistic series. Panchenko published the image on Instagram here on January 8, 2019.", "Below is a screenshot comparison of the misleading post’s image (L) and Panchenko’s image (R):", "Panchenko said she is in fact the woman posing in the photography.", "“I took this photo in January 2019 and it's titled ‘Bloody Music’. This photo was featured in my exhibition last Summer, this was a cameo and I used myself as a model,” she told AFP by email on June 3, 2020.", "The image was also featured on Panchenko’s website here:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]