["The image was published below an image of a climate change protest in this Facebook post on March 1, 2020.", "Below is a screenshot of the misleading post:", "The text superimposed on the top image in the meme reads: \"Australian kids taking a day off school to protest about saving the environment.\"", "The text superimposed on the bottom image reads: \"Australian kids giving up their Sunday to join Clean Up Australia and help the environment\"", "Clean Up Australia is a non-profit environmental organisation that has organised volunteer clean up days since 1990. The group describes itself here as one that “inspires and empowers communities to clean up, fix up and conserve our environment.”", "The meme was also shared on Facebook here, here, here, here, and here alongside a similar claim.", "The claim is misleading.", "A Clean Up Australia Day spokesperson told AFP the bottom image in the meme does not show any of its events.", "“[We're] confirming the image shared was not related to any Clean Up Australia event and we’ve seen that sentiment being expressed by a number of people, erroneously hoping to downplay the true number of young people involved in cleaning up the environment,” the spokesperson told AFP via email on March 3, 2020.", "The spokesperson added that it had 1,700 sites registered for its dedicated Schools Clean Up Day, which was held on February 28, 2020.", "“Clean Up events can happen at any time of the year – and relaxing the parameters even just to 1 Feb – 15 March 2020 sees the number of school and youth sites jump to over 3250 across Australia (again, not counting young people participating in registered ‘community’ sites), so I think it’s safe to say that young Australians have definitely stepped up to be part of Clean Up Australia activities,” they added.", "Clean Up Australia sent AFP photos of children involved in its events this year, as shown below:", "A keyword search on Google found an almost identical image to the bottom image in the misleading posts published on October 7, 2014 in this Reddit post.", "The caption states: \"Empty Sydney street\". No other context for the image is provided.", "Below is a comparison of the bottom image in the meme (L) and the image in the Reddit post (R):", "The top image in the meme was taken from this ABC Australia report which covered young Australians who joined a climate change protest in March 2019 on a schoolday. The photo was taken in the Australian city of Melbourne just outside Parliament House, the government office for the state of Victoria.", "Below is a screenshot of the photo as it appears in the report:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]