["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Robert Oswald debunked the post on his Cornell faculty page.", "COVID-19 is not a hoax. The virus has killed more than 332,000 Americans.", "A coronavirus conspiracy theory is being falsely attributed to a Cornell University professor on Facebook.", "The nearly 500-word post, published Dec. 28, includes a screenshot of Robert Oswald’s faculty page. Oswald is a professor in the Department of Molecular Medicine at Cornell.", "The post claims researchers have found that \"COVID-19 was imaginary and fictitious.\"", "(Screenshot from Facebook)", "\"I have a PhD in virology and immunology. I'm a clinical lab scientist and have tested 1500 ‘supposed’ positive Covid 19 samples collected here in S. California,\" the caption says. \"What we found was that all of the 1500 samples were mostly Influenza A and some were influenza B, but not a single case of Covid.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) It has more than 2,100 shares.", "There are several things wrong with the Facebook post.", "Oswald does not live in southern California, and he does not have a Ph.D. in virology or immunology. He did not write the text attributed to him — the text has been copied and pasted in social media posts and blog comments since at least Dec. 3. Oswald debunked the post in a statement on his faculty page.", "COVID-19 is not a hoax — and it wasn’t a plot orchestrated by China, as the post claims.", "\"COVID-19 is real,\" Oswald wrote in his statement. \"Any Facebook post that suggests otherwise is a hoax and is not true.\"", "Many researchers have isolated the full genome of the coronavirus, which has killed more than 332,000 Americans and sickened more than 19 million. To claim the virus is a hoax is inaccurate and ridiculous.", "We rate the Facebook post Pants on Fire!", "Cornell University College of Veterinary Medicine, Robert Oswald, PhD, accessed Dec. 29, 2020", "COVID Tracking Project, accessed Dec. 29, 2020", "Facebook post, Dec. 28, 2020", "Google Advanced Search, accessed Dec. 29, 2020", "National Library of Medicine, NCBI SARS-CoV-2 Resources, accessed Dec. 29, 2020", "PolitiFact, \"Facebook users are claiming there ‘is no’ coronavirus. That’s ridiculously wrong,\" March 19, 2020", "Snopes, \"Did Dr. Rob Oswald Claim COVID-19 Was a Hoax?\" Dec. 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]