["About this rating", "In mid-October 2017, readers began asking if Freddy Krueger (or \"Freddy Kruger\") from the Nightmare on Elm Street films was based on a real-life serial killer:", "Seeing this start to go around. I can't find anything about it and I'm sure I'm not the only one looking.", "The Freddy Kruger character was based on a real serial killer who lived in Cincinnati,OH in the 1800s. According to police files of the time, Mr. Kruger had killed at least twenty children within a three mile radius of where he lived. He reportedly murdered the children using only a gardening claw, and he lived inside an abandoned factory; having set up a small living area (and torture area) within the \"mechanical room\" of the facility. Oh...back then, a \"mechanical room\" was also known as a \"boiler room\".", "Mr. Kruger was eventually caught, tried, and found to be criminally insane. He spent the rest of his life in Kings Park Psychiatric Hospital before dying unexpectedly in his sleep at the age of 72.", "To this day (and LONG before the Elm St. films) Kings Park Psych Hospital was said to be haunted by the ghost of Freddy Kruger!", "Iterations of the rumor placed the \"real-life\" Freddy Krueger murders (often misspelled \"Kruger\") as local to Cincinnati, Brooklyn, and other areas. But copied and pasted versions elided the last line of what appeared to be the original share:", "Although the exact wording varied, the photographs of the \"Frederick Kruger\" gravestone (1838-1910) also had a brief note to the effect of: \"Actually, I just found this picture and made all this shit up & you actually read it ???? ... Happy October everyone????\".", "However, in October 2014 horror film creator Wes Craven disclosed that \"Freddy Krueger\" was based on a scary news report he read — not about a real human murderer:", "When asked where they actually got the idea for Freddy’s WTF-tastic dream powers, Craven recounted an old new story he’d read about a family trying to get their lives in order after escaping Cambodia. But the family’s son was haunted with post-traumatic stress that eventually killed him. From there, the genesis of Freddy Krueger was born:", "“I’d read an article in the L.A. Times about a family who had escaped the Killing Fields in Cambodia and managed to get to the U.S. Things were fine, and then suddenly the young son was having very disturbing nightmares. He told his parents he was afraid that if he slept, the thing chasing him would get him, so he tried to stay awake for days at a time. When he finally fell asleep, his parents thought this crisis was over. Then they heard screams in the middle of the night. By the time they got to him, he was dead. He died in the middle of a nightmare. Here was a youngster having a vision of a horror that everyone older was denying. That became the central line of Nightmare on Elm Street.”", "Although Craven's commentary was real, the circulating \"Frederick Kruger\" gravestone is entirely unrelated to a \"real\" Freddy Kruger, and instead was intended as a Halloween joke. Over time, however, the description was copied and pasted without its last line, spoiling the joke and confusing horror film buffs.", "Moore, Trent.   \"Wes Craven Reveals The Terrifying True Story That Inspired Freddy Krueger.\"\r\n    SyFy Wire.   20 October 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]