["By Saranac Hale Spencer", "Posted on November 3, 2020", "A story circulating on social media deceptively claims “Bad Things Are Happening in PA.” It overstates the significance of a video that shows a Republican poll watcher being denied access to a Philadelphia polling place on Election Day, and it falsely claims that there was an illegal political sign at another city location.", "A deceptive story started circulating on Election Day with a headline claiming: “BREAKING: Bad Things Are Happening In PA; Poll Watcher TURNED AWAY, Voting Locations Have ‘Biden-Harris’ Signs.”", "The headline overstates the significance of an incident at one polling place on the morning of Nov. 3 and falsely claims that there was an illegal political sign at another location. It appeared on a site called TrendingPolitics — a self-described pro-Trump website that we’ve written about before. The story that followed warned readers to “be on guard” and stoked fear, saying, “don’t let anyone steal your vote.”", "But it doesn’t provide evidence that warranted such warnings. We’ll first address the claim about a Republican poll watcher being “turned away,” which is true, but it was the result of a misunderstanding – not an indication of fraud.", "The support for the claim that a poll watcher was “TURNED AWAY” came from a video posted on Twitter by a Trump supporter named Will Chamberlain. He posted the video with, “#StopTheSteal,” a hashtag used largely by those who claim that Democrats are trying to “steal” the election.", "By 4:30 p.m., the original video had more than 34,000 likes and had been promoted by the Trump campaign and major right-wing figures, such as Steve Bannon, as well as having been featured on several dubious websites.", "But the video and accompanying stories overstate what happened.", "The poll watcher was Gary Feldman, a Republican committeeman who told us in a phone interview that he was going to that location, in South Philadelphia, to collect information about how many voters had been there so far. He went to several other polling places during the day, estimating that he went to one per hour.", "“I had no other troubles during the day,” Feldman told us. “That was the only place that denied me.”", "He guessed that he would have been inside the polling place for about five minutes, if he had been allowed.", "“He was denied entry, at least initially,” Kevin Feeley, spokesman for the city commissioners, told FactCheck.org in a phone interview. “Honestly, it was a mistake.”", "The poll worker who initially rejected Feldman was under the impression that the ward number on the poll watcher’s certificate had to match the polling location, Feeley explained.", "In the video, Feldman tells two poll workers, “I have a citywide watcher’s certificate.” One of the poll workers responds, “It’s not for this location.”", "But, according to Philadelphia County’s guide for election officials, “Watchers are only permitted to be issued one Certificate for one Election District, but are permitted to use that Certificate to watch in ANY Ward/Division in Philadelphia.”", "Both Feeley and Jane Roh, spokeswoman for the district attorney, said the rule had recently been changed, but neither specified when.", "The DA’s office “contacted the workers there to make sure they were clear on the rules,” Roh said by email.", "The other claim in the story — that there were “illegal” Biden-Harris campaign signs at another Philadelphia polling place — is just wrong.", "A. Benjamin Mannes, a columnist for the conservative website Newsmax, tweeted a picture of a sign favoring Democrats outside of a Northeast Philadelphia polling place.", "That, too, was highlighted by the Trump campaign. Mike Roman, the campaign’s director of Election Day operations, retweeted it with the phrase, “Bad things are happening in Philly.” (Trump first coined that phrase in the Sept. 29 presidential debate, when he claimed poll watchers had been removed from a polling place in Philadelphia — a Democratic stronghold in the swing state of Pennsylvania. Although that hadn’t actually happened, the president declared: “Bad things happen in Philadelphia.”)", "But the DA’s election task force investigated the claim and found: “This polling place is located in an interior room and the sign in question is further than 10 feet from it. This tweet is deliberately deceptive.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Chamberlain, Will (@willchamberlain). “A poll watcher in Philly was just wrongfully prevented from entering the polling place #StopTheSteal.” Twitter. 3 Nov 2020.", "Roman, Mike (@mikeroman). “DEMOCRAT ELECTION OFFICIALS BANNING TRUMP POLL WATCHERS IN PHILLY. This is happening all over the City. The steal is on!” Twitter. 3 Nov 2020.", "Feldman, Gary. Poll watcher. Interview with FactCheck.org. 3 Nov 2020.", "Feeley, Kevin. Spokesman, Philadelphia City Commissioners. Interview with FactCheck.org. 3 Nov 2020.", "Roh, Jane. Spokeswoman, Philadelphia District Attorney’s Office. Email to FactCheck.org. 3 Nov 2020.", "Mannes, A. Benjamin (@PublicSafetySME). “This is our polling place in NE Philadelphia. Already a violation in sight.” Twitter. 3 Nov 2020.", "Roman, Mike (@mikeroman). “Bad things are happening in Philly.” Twitter. 3 Nov 2020.", "Philadelphia District Attorney’s Office (@philadao). “Members of our Election Task Force have investigated this allegation. This polling place is located in an interior room and the sign in question is further than 10 feet from it. This tweet is deliberately deceptive.” Twitter. 3 Nov. 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]