["A Facebook post shared nearly 1,000 times in South Africa claims that Mel Gibson has “blown the whistle on the epidemic of ‘parasites’ who ‘control Hollywood’ that are involved in #childSacrifice and. #pedophilia” (sic).", "The post alleges that the star said “every studio in Hollywood is bought and paid for with the blood of innocent children”.", "Internet searches of the post’s headline “MEL GIBSON'S SHOCKING REVELATION ON HOLLYWOOD” found articles with the same content here and here from March 4, 2020.", "The claim quotes Gibson as saying that “key players in the movie business... perform sacred rituals that are sick and totally at odds with the moral fabric that binds most patriotic Americans. The worst part: It’s an open secret in Hollywood and everyone wants in on it.”", "It alleges that the actor made the comments while promoting the movie “Daddy’s Home 2” in 2017 in London. More specifically, the post claims Gibson said these things to TV guests backstage after appearing on the Graham Norton Show.", "Brief red carpet interviews here, here and here at the London premiere strictly promoted the comedy and nothing else. The same could be said for another interview here in which Gibson and fellow actor John Lithgow are taught “dad jokes”.", "The closest Gibson appears to speak on the entertainment industry during the movie’s promotion is in this interview, again alongside Lithgow, where the pair are asked by Associated Press about the Weinstein sexual harassment scandal.", "Gibson describes it as a “tragic healing process” but makes none of the utterances claimed in the fake posts.", "Part of the claim is that Gibson made his comments after appearing on The Graham Norton Show for British television, where he allegedly called Hollywood an “institutionalised pedophile ring” that “use and abuse kids for their own sick spiritual beliefs.”", "He is also purported to have said that he was blacklisted by Hollywood in 2006 “for voicing his opinions about the industry that clashed with their liberal agenda,” but Gibson has featured in at least 14 movies since then.", "“They see the blood of a sexually abused infant as the ‘ultimate prize’ and say that it’s ‘highly enriched. Babies are like a ‘premium currency’ and hold a higher value of anything else you can think of: Diamonds, drugs, caviar, you name it. They are literally trading these kids like a currency for favors, movie roles, kickback,” the claims go on to say.", "No record", "There is no public record anywhere of Gibson making those statements and his publicist Alan Nierob denied the actor had ever said any of the quotes attributed to him.", "Nierob told AFP Fact Check he had not seen the claims before nor does he know where they stem from.", "But AFP Fact Check traced the probable origin of the claims to a story published in 2017 on a website formerly called Your News Wire that has since changed its name and removed the online article for failing to meet “editorial standards”.", "“When we moved domains to NewsPunch.com in 2019, stories like this no longer adhered to our new editorial standards.”", "“We originally published this story on our old domain YourNewsWire.com back in 2017,” said Sean Adl-Tabatabai, co-founder of News Punch (formerly Your News Wire), in an email to AFP Fact Check. “Back then we would screen bizarre stories from people who emailed in, and we would also source some of our stories from obscure blogs on the web -- many of these stories would then be published on the website.”", "The author who submitted the content and subsequently promoted a link to it on his Facebook page was Baxter Dmitry. His Facebook page describes him as a journalist who is “passionate about motor sports, military history and the truth”.", "“When we moved domains to NewsPunch.com in 2019, stories like this no longer adhered to our new editorial standards,” Adl-Tabatabai said. “Specifically there was no proof that Mel Gibson said any of the statements quoted in the original article. Because of this, we decided to unpublish the story, as the claims being made in it could not be adequately fact-checked by us.”", "Still, it hasn’t stopped the claim spreading online, particularly among QAnon conspiracy communities, like this Facebook page called  “Chasing The White Rabbit -17anon- .v2.0 Revived”, which shared the post here.", "The page, which was previously shut down and recreated on January 20, 2019, is managed by three people out of Poland and one person from the United States, according to the Facebook page transparency information, and it promotes the idea of a \"deep state satanic mafia\" that rules every aspect of the world.", "QAnon adherents generally believe that dozens of global elites, many seen as “left wing” or “liberal”, are behind a worldwide paedophile network. Part of their narrative casts US President Donald Trump as the avenger of abused children and the saviour of humanity.", "Another recent post published on the same page has been fact-checked by other independent organisations.", "Gibson took flak for an anti-Semitic tirade during a 2006 drunk-driving arrest. He later apologised, blaming it on alcoholism.", "He has voiced some criticism for Hollywood in the past. In a clip from an old interview shared on YouTube, Gibson spoke about arriving in Hollywood and the “cockroach resilience” a person needs to survive in the town.", "In the edited clip, which could be easily taken out of context, Gibson says: “A place like this can humiliate you and it can be humbling, it does rip your life to pieces if you’ll let it and it’s always pounding at the walls, these little guys, these little heathens with no soul downstairs with horns on their heads with a battering ram trying to beat your walls in, but that’s your own devils, you know.”", "However, he doesn’t say anything about paedophilia or child sacrifices.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]