["About this rating", "On 30 July 2017, Facebook user Marsha Barnes Beal published a post claiming that her mother was battling an infection caused by flesh-eating bacteria contracted at Myrtle Beach, South Carolina:", "All prayer warriors: Please remember my Mama, Bonita Fetterman in prayer. She was airlifted to Chapel Hill earlier today. She's now in ICU, heavily sedated, and on a breathing machine. However, she is stable! She came in contact with a life threating flesh eating bacteria after putting her feet in the water at Myrtle Beach! Surgery is the only option until it is completely cut away from her long! With the hopes of it not spreading. She is in need of special prayer!", "Missing from the post were basic details, such as the date of Fetterman's beach visit, how doctors purportedly traced the infection back to that visit, and whether anyone else was claiming to have been sickened by the same communicable bug. Nevertheless, the post caused significant alarm among would-be beachgoers who feared, naturally, that poor water quality posed a life-threatening risk.", "Medical claims can be difficult to verify due to patient privacy laws, but on 31 July 2017, WCSC/WMBF reported that this infection may have come from a simple cut:", "Neither DHEC [South Carolina Department of Health and Environmental Control] nor doctors have confirmed how the woman contracted the bacterial infection.", "The victim was airlifted to UNC Medical Center from Southeastern Hospital in Lumberton on Sunday morning in critical condition, according to messages received from her family members.", "According to her granddaughter, the family was vacationing in Myrtle Beach last week. The victim was on the balcony of their hotel when she lost her balance in the wind and cut her leg on a chair. The cut wasn’t serious, so she did not seek medical attention. According to family, she spent time in the ocean between 23rd Avenue North and 27th Avenue North in the days after she was cut.", "On Saturday, the day the family left Myrtle Beach to return to Lumberton, she discovered blisters on her leg. Later that night, the victim’s leg was completely purple and covered in blisters. Her blood pressure was also extremely low.", "The City of Myrtle Beach responded to the rumors in a 31 July 2017 Facebook post, acknowledging the claim but adding that it had not been definitively linked to water quality in Myrtle Beach:", "The City of Myrtle Beach is aware of a Facebook post that claims bacterial issues along the Grand Strand. We have had no reports and no direct contact about any such issues. The city has been unable to confirm the location or date of any such incident. At this point, all we have is a Facebook post, with no confirmation. Our ocean water quality is tested twice weekly, with excellent results. If we can determine where such contact may have occurred, we can order additional water quality tests to determine whether any connection exists.", "DHEC did not appear reluctant to close beaches when water quality tests indicated higher than acceptable levels of bacteria. On 29 June 2017, one such warning was issued. The Centers for Disease Control's page about necrotizing fasciitis explains that the condition is rare, and not attributable to a single bacterium (that is, nothing necessarily specific in a body of water is definitively linked with the development of necrotizing fasciitis):", "Although the media commonly calls it a “flesh-eating infection,” more than one type of bacterium can cause this rare disease. These bacteria include group A Streptococcus (group A strep), Klebsiella, Clostridium, Escherichia coli, Staphylococcus aureus, and Aeromonas hydrophila. Public health experts consider group A strep to be the most common cause of necrotizing fasciitis ... in cases of necrotizing fasciitis, bacteria spread quickly once they enter the body. They infect the fascia, connective tissue that surround muscles, nerves, fat, and blood vessels. The infection also damages the tissues next to the fascia. Sometimes toxins (poisons) made by these bacteria destroy the tissue they infect, causing it to die. When this happens, the infection is very serious and those infected can lose limbs or die.", "The CDC cautions the public to avoid \"spending time in whirlpools, hot tubs, swimming pools, and natural bodies of water (e.g., lakes, rivers, oceans) if you have an open wound or skin infection\" in order to avoid necrotizing fasciitis, adding that the majority of people who get necrotizing fasciitis \"have other health problems that may lower their body’s ability to fight infection\".", "A study published in August 2014 noted that a specific type of the illness was reported along warm-water coastal regions in the southeastern United States, Central and South America, and Asia, and that \"infection can occur via exposure through an open wound or other break in the skin, but infection has also been reported via ingestion of colonized oysters by patients with cirrhosis\".", "In response to our inquiry about the rumor, DHEC provided the following statement:", "DHEC is aware of the news reports of a potential case of necrotizing fasciitis in the Myrtle Beach area. It’s important to note that this condition is not necessarily associated with exposure to natural waters like oceans, lakes or rivers or poor water quality. Please see below for more information.", "About the condition:\nNecrotizing fasciitis is a serious complication associated with some bacterial skin infections. It advances quickly and results in the body’s soft tissue dying. (Necrotizing means “causing the death of tissues.”) Unfortunately, necrotizing fasciitis can be deadly in a very short amount of time. Accurate diagnosis, prompt antibiotic treatment and surgery are important to stopping infections associated with this condition.", "What causes the condition:\nMany different bacteria can cause this rare problem, but group A strep is the most common cause of necrotizing fasciitis. Infections from group A strep bacteria are generally mild and are easily treated. But in cases of necrotizing fasciitis, bacteria can enter the body, usually through a wound, and spread rapidly along the thin sheets of tissue that surround muscles and organs, called fascia. This is why the illness is called necrotizing fasciitis. Most people who develop this condition have weakened immune systems.", "How to prevent the condition:", "Statistics:\nIt’s important to note that not all cases of necrotizing fasciitis are reportable to DHEC, so we do not have specific data on the number of cases of necrotizing fasciitis. The most common type of infection that can be associated with necrotizing fasciitis is invasive Group A strep, which is a reportable infection in South Carolina. For 2016, 177 cases were reported in SC, and for 2017, 146 cases have been reported to date.", "Regarding water quality testing, this type of condition is not necessarily related to exposure to natural waters or water quality. The key to helping prevent it is proper wound care. This condition is rare in healthy people. DHEC will continue to conduct routine beach monitoring sampling in the Myrtle Beach area. Results of these samples can be found here: https://gis.dhec.sc.gov/beachaccess/.", "A woman did apparently develop necrotizing fasciitis following a minor injury in Myrtle Beach, South Carolina in July 2017. Necrotizing fasciitis itself is not a bacterium, but a disease typically associated with a wound or break in the skin, and can be caused by a number of bacteria. Public health officials in South Carolina are aware of the rumor, but have received no indication that there is cause for public concern about beach water quality. The water is routinely tested, and it has not revealed any water condition associated with bacteria-based risk to bathers.", "Drayton, Carli.   \"DHEC Releases Statement Regarding Potential Case Of Flesh-Eating Bacteria In Myrtle Beach.\"\r\n    WCSC/WMBF.   31 July 2017.", "South Carolina Department of Health and Environmental Control.   \"S.C. DHEC Issues Temporary Swimming Advisory.\"\r\n    29 June 2017.", "Centers for Disease Control and Prevention, National Center for Immunization and Respiratory Diseases, Division of Bacterial Diseases.   \"Necrotizing Fasciitis.\"\r\n    Accessed 1 August 2017.", "WSOC-TV.   \"Swimming Advisory Issued For Portion Of Surfside Beach.\"\r\n    15 June 2017.", "Current Problems in Surgery.   \"Necrotizing Soft Tissue Infections: Review And Current Concepts In Treatment, Systems Of Care, And Outcomes.\"\r\n    August 2014.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]