["By Lori Robertson", "Posted on May 15, 2020 | Updated on June 29, 2021", "The Wuhan Institute of Virology received $600,000 as part of a larger five-year U.S. government grant to a U.S.-based nonprofit studying emerging infectious diseases. But President Donald Trump put the figure at $7.5 million, saying he “ended it.”", "We asked the White House where the $7.5 million figure may have come from, but we haven’t received a response.", "False claims that the Wuhan lab had received $3.7 million in National Institutes of Health grant money have circulated online after an April 11 Daily Mail story made that assertion and Republican Rep. Matt Gaetz repeated it in a Fox News interview. The NIH didn’t award such a grant. Instead, it gave a grant totaling $3.4 million, beginning in 2014, to the U.S.-based EcoHealth Alliance to study the risk of the future emergence of coronaviruses from bats. And EcoHealth distributed $600,000 of that total to the Wuhan Institute of Virology, a collaborator on the project, pre-approved by NIH.", "We wrote about this distortion of the EcoHealth grant after the claim appeared in the conspiracy theory video “Plandemic.”", "Trump echoed the claim in an interview that aired May 14 on Fox Business News. Host Maria Bartiromo asked of the Wuhan institute, “Didn’t we as a country give money to that lab?” Trump responded:", "Trump, May 14: Yeah. As I understand it, before I got here, $7.5 million in 2014. And look, they said they were studying different things and you know, things like that happen. But, you know, money was given by the Obama administration early on. … I ended it. … I took a lot of heat too. They said, “Oh, we’re studying all sorts of stuff.” You saw what happened. I ended it.", "It’s unclear what other funding the president may be including in his figure. An April 16 Fox News story cited another $3.4 million grant, regarding a behavioral study, that may have included some funding that went to the Wuhan lab. But the grant, which was awarded to Cold Spring Harbor Laboratory in New York, hasn’t been terminated. It was originally for 2014-2019 and a second related grant was approved this year. We reached out to Cold Spring Harbor Lab, and we’ll update this story if we receive additional information.", "Fox News acknowledged that it was “not clear exactly how much U.S. funding went directly to the Wuhan Institute of Virology because it worked in collaboration with other institutions on the projects funded by the American grants.”", "Update, June 18: When we revisited this issue for another story, Cold Spring Harbor Laboratory told us no money from its grant went to the Wuhan lab. “[B]ased on CSHL’s records for its NIH R01 award MH101214, there is nothing to indicate that any money from this grant was provided to the Wuhan Institute of Virology,” Dagnia Zeidlickis, the lab’s vice president of communications, told us in an email.", "In the case of the EcoHealth grant — the one that was canceled — we do know how much went to the Wuhan lab and it was well short of even $1 million.", "In a statement, the NIH said the total grant to EcoHealth was $3.4 million over six years (2014 through 2019) and that the grant had been terminated. “NIH does not discuss details of the decision making process regarding specific grant awards,” the statement said. Information on the NIH website shows the project began on June 1, 2014, and was ended on April 24, 2020.", "Nearly all of the $3.4 million was part of a five-year grant awarded in 2014, EcoHealth spokesman Robert Kessler told us in an email, and the $600,000 given to the Wuhan Institute of Virology was part of that grant. In 2019, the project was renewed for another five years, and EcoHealth received $292,161 in 2019 before NIH canceled the grant last month.", "USA Today reported that about $76,000 had been budgeted for the Wuhan lab as part of the 2019 renewal. Kessler confirmed to us that money had been budgeted but it hadn’t been distributed to the lab before the grant was ended.", "The Wuhan, China, lab — located in the city where the novel coronavirus outbreak began in late 2019 — was pre-approved as a collaborator by NIH and the State Department, Kessler said. Researchers used the lab to conduct genetic analyses of the viruses.", "“In each of nearly 30 countries around the world where we work, we collaborate with local institutions, all of which are pre-approved by our federal funders,” EcoHealth said in an April 28 statement about the terminated funding. “It’s been EcoHealth Alliance’s position for the past 15 years that coronaviruses present a clear and immediate threat to our safety. That seems clearer now than ever before.”", "The NIH grant — technically funded through the NIH’s National Institute of Allergy and Infectious Diseases — backed research into the emergence of coronaviruses that can affect humans and originate in bats, which is the origin, experts suspect, of SARS-CoV-2, or the novel coronavirus, as well as severe acute respiratory syndrome, or SARS, virus, which caused a global outbreak in 2003, and the Middle East Respiratory Syndrome, or MERS, virus, identified in 2012.", "The EcoHealth project description on the NIH website says that zoonotic coronaviruses — meaning those that can transfer from animals to humans — “are a significant threat to global health” and that bats “appear to be the natural reservoir of these viruses.” The project “aims to understand what factors increase the risk of the next CoV emerging in people by studying CoV diversity in a critical zoonotic reservoir (Bats), at sites of high risk for emergence (wildlife markets) in an emerging disease hotspot (China).”", "EcoHealth, which has received government grant money nearly every year since 2002, according to an NIH database, said in its April 28 statement that the research terminated by the Trump administration “aimed to analyze the risk of coronavirus emergence and help in designing vaccines and drugs to protect us from COVID-19 and other coronavirus threats. In fact, genetic sequences of two bat coronaviruses that we discovered with this grant have been used as lab tools to test the breakthrough antiviral drug Remdesivir.”", "Clinical trials are underway to determine whether remdesivir is safe and effective in treating COVID-19. The Food and Drug Administration issued an emergency use authorization on May 1 for the drug based on early results.", "The Wuhan Institute of Virology has been the subject of baseless conspiracy theories claiming SARS-CoV-2 was created or manipulated in a lab. As we’ve written, the authors of a March article in Nature Medicine concluded: “Our analyses clearly show that SARS-CoV-2 is not a laboratory construct or a purposefully manipulated virus.”", "University of Sydney professor Edward Holmes, who was involved in mapping the genome of SARS-CoV-2, also said in an April statement: “Coronaviruses like SARS-CoV-2 are commonly found in wildlife species and frequently jump to new hosts. This is also the most likely explanation for the origin of SARS-CoV-2.”", "Responding to what he called “unfounded speculation” that a bat coronavirus named RaTG13, being kept at the Wuhan Institute of Virology, was the origin, Holmes said that for various reasons he concluded: “SARS-CoV-2 was not derived from RaTG13.” Holmes said more sampling of other animals “is needed to resolve the exact origins” of the novel coronavirus.", "The U.S. Intelligence Community said in an April 30 statement that it “concurs with the wide scientific consensus that the COVID-19 virus was not manmade or genetically modified,” and that it “will continue to rigorously examine emerging information and intelligence to determine whether the outbreak began through contact with infected animals or if it was the result of an accident at a laboratory in Wuhan.”", "In remarks the same day, Trump answered, “Yes, I have,” when asked if he had “seen anything at this point that gives you a high degree of confidence that the Wuhan Institute of Virology was the origin of this virus.” But the president also said: “We’re going to see where it comes from. And you know — look, you know every theory, whether you had the theory from the lab, you had the theory from many different — the bats, and the type of bat, and the bat is 40 miles away, so it couldn’t have been here and it couldn’t have been there. And we have a — there’s a lot of theories. But, yeah, we have people looking at it very, very strongly.”", "Investigations into the origin of the virus aside, Trump was wrong to claim the U.S. government has given $7.5 million to the Wuhan lab under his predecessor. The lab received only $600,000 through a five-year grant to EcoHealth Alliance, a grant that spanned both the Obama and Trump administrations and had been renewed last year. We don’t know how much, if anything, the lab may have received as part of other grants.", "Update, May 21, 2021: The exact origin of the coronavirus remains unknown. On May 14 the journal Science published a letter from 18 scientists calling for “more investigation” to determine how the pandemic began. “Theories of accidental release from a lab and zoonotic spillover both remain viable,” they wrote. “Knowing how COVID-19 emerged is critical for informing global strategies to mitigate the risk of future outbreaks.”", "Update, June 29, 2021: Please see our June 25 story “The Facts – and Gaps – on the Origin of the Coronavirus” for a detailed examination of the debate over the origin of the pandemic.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]