["Ashly Bos stretches on her toes to grab a box of instant mashed potatoes while shopping with her mother, Tanya, in Brooksville, Fla. The family of six gets just over $860 per month in food stamps.", "Federal bureaucrats are a favorite target at CPAC, the annual conservative conference that was held March 14-17, 2013. And in her address to the conference, U.S. Rep. Michele Bachmann, R-Minn., served up a doozy.", "How does it help the poor, she asked, when \"of every dollar that you hold in your hands, 70 cents of that dollar that's supposed to go to the poor doesn't. It actually goes to benefit the bureaucrats in Washington, D.C. Seventy cents on the dollar. That's how the president's caring works in practice. So three dollars in food stamps for the needy, seven dollars in salaries and pensions for the bureaucrats who are supposed to be taking care of the poor. So with all due respect, I ask you, how does this show that our president cares about the poor?\"", "Seventy percent of the food stamp budget goes to bureaucrats rather than beneficiaries? This sounded way off to us. So we looked into it.", "The real numbers", "We first turned to budget data for the U.S. Department of Agriculture, which runs the food stamp program. (We should point out that the food stamp program has officially been known as the Supplemental Nutrition Assistance Program, or SNAP, since October 2008).", "In 2012, the Food and Nutrition Service spent a little over $112 billion, an amount that includes not only food stamps but also several smaller nutrition programs for low-income Americans. Of this, $136.5 million was spent on administration. That works out to one tenth of 1 percent -- nowhere near 70 percent.", "The liberal Center on Budget and Policy Priorities came up with a somewhat larger percentage on administration in a 2012 briefing paper. The center came up with administrative costs of about 5 percent by including several other categories of spending, including state administrative costs and educational programs for SNAP participants.", "Bachmann did mention \"pensions,\" and if you add the retirement costs of SNAP employees it would boost the numbers a bit higher. But even the most generous accounting of SNAP’s administrative costs end up well short of 70 percent. What gives?", "Where Bachmann went wrong", "Bachmann’s office did not answer our inquiry, but experts say she probably got it from The Poverty of Welfare: Helping Others in Civil Society, a 1996 book by Michael Tanner of the libertarian Cato Institute. Tanner told PolitiFact that Bachmann is \"misquoting me in a subtle but important way.\"", "In his book, Tanner cited a claim by Robert L. Woodson -- president of the National Center for Neighborhood Enterprise and author of Breaking the Poverty Cycle: Private Sector Alternatives to the Welfare State -- that in the 1980s, 70 percent of every dollar went \"not to poor people but to government bureaucrats and others who serve the poor. Few private charities have the bureaucratic overhead and inefficiency of government programs.\"", "In a footnote, Tanner added, \"It is important to note that the 70 percent figure is not solely government administrative overhead. That figure also includes government payments to the non-poor on behalf of the poor. For example, Medicaid payments go to doctors. Housing subsidies are frequently paid directly to landlords.\"", "So, we see three problems here.", "First, Bachmann’s claim appears to be based on a 17-year-old study that cites data that may be a decade older than that. In an interview, Tanner said he quoted Woodson’s findings and then referenced a number of regional studies that reached similar conclusions.", "Second, the footnote makes clear that not all the people receiving federal anti-poverty money are \"bureaucrats.\"", "And third, even if you assume Woodson and Tanner are correct, the finding still doesn’t apply to SNAP, which is a pure cash benefit system without payments made to intermediaries such as doctors or landlords.", "Our ruling", "Bachmann said that of every \"three dollars in food stamps for the needy, seven dollars in salaries and pensions (go to) the bureaucrats who are supposed to be taking care of the poor.\"", "That is ridiculously off-base. Even the broadest calculation of administrative costs for SNAP tops out at 5 percent of program costs, far below the 70 percent Bachmann claims. And the scholar behind the statistic she appears to have used as support said Bachmann has misquoted his work. Pants on Fire!", "Michele Bachmann, speech to CPAC, March 16, 2013", "U.S. Department of Agriculture, Congressional Budget Justification, 2013", "Center on Budget and Policy Priorities, \"Romney's Charge That Most Federal Low-Income Spending Goes for ‘Overhead’ and ‘Bureaucrats’ Is False: For Major Low-Income Programs, More Than 90 Percent Goes to Beneficiaries,\" Jan. 23, 2012", "James Rolph Edwards, \"The Costs of Public Income Redistribution and Private Charity\" (Journal of Libertarian Studies), summer 2007", "Email interview with Michael Wiseman, George Washington University economist, March 18, 2013", "Email interview with John M. Palguta, vice president for policy at the Partnership for Public Service, March 18, 2013", "Email interview with Michael Tanner, senior fellow at the Cato Institute, March 18, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]