["As part of Sen. Cory Booker’s presidential primary campaign, the New Jersey Democrat talks about \"environmental justice\" — which seems to mean addressing the environmental factors that disproportionately affect people who are low-income and from minority backgrounds.", "One issue he’s highlighting: the impact of so-called Superfund sites, hazardous waste sites that are especially prevalent in Booker’s home state, and usually located in the same neighborhoods as low-income residents, often African American or Hispanic.", "In an April 29 interview with MSNBC, Booker cast that issue not only as a challenge for social justice and equality but also as a public health problem.", "\"We now have longitudinal data that shows that children born around Superfund sites have dramatically higher rates of birth defects, dramatically higher rates of autism,\" he said.", "This isn’t the first time Booker has made this argument, and it likely won’t be the last. So, we decided to dig in and see how it stands up to scrutiny.", "First, the data", "Booker’s press team sent us two Superfund studies: a 2008 paper on the association between toxic landfills and autism spectrum disorders (ASDs) and a 2011 study probing that association regarding congenital anomalies (the \"birth defects\" Booker mentioned).", "In the autism paper, researchers mapped the location of New Jersey Superfund sites and almost 500 children diagnosed with ASD from 1998 to 2006, finding that cases appeared in higher frequency closer to the sites. Those researchers also checked for a relationship between higher numbers of Superfund sites in a state and frequency of ASDs.", "That analysis \"reveal[ed] considerable overlap\" between high Superfund rates and autism diagnoses — though the authors were quick to caution that a correlation didn’t mean one caused the other.", "The 2014 paper looked at births from 1989 to 2003, near Superfund sites in Florida, Michigan, New Jersey, Pennsylvania and Texas — all of which were cleaned up at some point in that time frame. Before a site was cleaned up, infants were, on average, 20% to 25% more likely to have a congenital birth defect.", "\"This does suggest that the Superfund sites caused birth defects,\" argued Janet Currie, a study author and professor of economics and public affairs at Princeton University, in an email to KHN.", "Both of these are longitudinal studies, meaning the research was collected over time to track patterns and changes.", "Booker’s phrasing is quite deliberate – and that matters for his case", "We spoke to environmental health researchers unaffiliated with the studies. They said it would be very difficult to prove that being born near a Superfund site causes kids to be born with birth defects, or causes autism. It helps that in his statements Booker doesn’t try to make that case. One caveat, though, is that a casual listener could draw that conclusion.", "The studies he’s working with are \"fairly exploratory,\" said David Savitz, a professor of epidemiology at Brown University’s School of Public Health. While they support the idea of a link between autism and Superfund sites, or birth defects and such sites, they don’t go so far as to support a case for causality. Other factors could contribute, too.", "\"It’s not hard to imagine all the ways the communities proximal to waste sites may be different — a lot of ways other than just having the waste site,\" Savitz said.", "But Booker’s comments are rooted in legitimate data sources. Both those studies are peer-reviewed and suggest there could be some kind of relationship. So, the center of his claim — there is data that shows children near Superfund sites having higher rates of congenital abnormalities and autism — does, in fact, check out.", "Even so, environmental health experts said, much more work is needed to understand the nature of that claim. Risk factors for autism are still not well-identified. And congenital abnormalities can refer to a range of different problems — so research that lumps them together may gloss over important distinctions, especially when it comes to what might cause a specific birth defect.", "The bigger picture", "Booker is getting at a larger truth: Many chemicals found at Superfund sites are related to health problems, the experts said. And, those same experts added, his environmental justice framing is one that makes sense, too, given the demographics of those most often affected.", "From a policy standpoint, Savitz argued, Booker’s bigger point — that cleaning up Superfunds would improve health outcomes, in particular for marginalized people — is clearly true.", "The only real issue, some suggested, is his use of the word \"dramatically.\" The data suggests potential correlation, but whether it’s \"dramatic\" is far from clear.", "\"Certainly there is evidence to back up his claim,\" said Amanda Bakian, an assistant professor of psychiatry at the University of Utah, who studies environmental contributors to autism risk. \"There’s been work finding an association, but the relationship is modest. … We do need more research in this area.\"", "Our rating", "Booker is correct in saying data shows that children born near Superfund sites have higher rates of birth defects and autism. In this statement, he doesn’t specifically say there is a causal relationship — which is important, because the data does not necessarily say Superfund proximity causes those issues, and more research would be needed to support that claim.", "The use of the word \"dramatically\" causes a bit of trouble, however. The datasets show statistically significant correlations. But that isn’t the same thing as a \"dramatically higher rate.\"", "The statement is true, but could use more context. We rate it Mostly True.", "This fact check was reported and edited by Kaiser Health News. PolitiFact and KHN are partnering to fact-check claims about health care.", "Sen. Cory Booker (D-N.J.), comments on MSNBC, April 29, 2019.", "American Economic Review, \"Superfund Cleanups and Infant Health,\" May 2011.", "Associated Press, \"AP Find Climate Change Risk for 327 Toxic Superfund Sites,\" Dec. 22, 2017.", "CBS News, \"Cory Booker Makes ‘Environmental Justice’ Central to His White House Bid,\" April 26, 2019.", "Sen. Cory Booker’s Senate website, \"Booker Introduces Bill to Clean Up Superfund Sites,\" July 28, 2017.", "Sen. Cory Booker’s Senate website, \"U.S. Senator Booker Chairs First EPW Oversight Subcommittee Hearing on Superfund Sites,\" June 10, 2014.", "EPA, \"What Is Superfund?\" accessed April 30, 2019.", "EPA, \"Search for Superfund Sites Where You Live,\" accessed April 30, 2019.", "Environmental Health Insights, \"Autism Spectrum Disorders and Identified Toxic Land Fills: Co-Occurrence Across States,\" Aug. 20, 2008.", "The Greenville [S.C.] News, \"Cory Booker Says He Will Run Campaign Like He Ran Track, Without Eyes on Joe Biden,\" April 25, 2019.", "The [New Jersey] Star-Ledger, \"N.J. Leads the Nation in Superfund Sites. Now Cory Booker Can Do Something About It,\" Feb. 9, 2018.", "NJTV News, \"What EPA Funding Cuts Would Mean for New Jersey,\" March 20, 2017.", "Telephone interview with David Savitz, a professor of epidemiology at Brown University’s School of Public Health, April 30.", "Telephone interview with Amanda Bakian, an assistant professor of psychiatry at the University of Utah, April 30.", "Email interview with Janet Currie, professor of economics and policy affairs at Princeton University, April 30.", "Telephone interview with Dr. Sue Xue Ming, pediatric neurologist at Rutgers New Jersey Medical School. May 1, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]