["The image was published here on Facebook on July 24, 2020.", "The Malaysian-language caption translates to English as: “In Medina and Mecca, they don’t ‘shoot’ temperature on the head but on the hand is also allowed!", "“Because it is feared the brain can be affected if it is ‘always shot on’ by laser. Avoid being shot!”", "The image was also repeated alongside the same claim here, here and here on Facebook.", "The claim, however, is false. Health authorities say infrared thermometers are safe.", "The Malaysian Ministry of Health (KKM) retweeted a thread by a local doctor, Muhamad Shazwan Sazali, commenting on a viral video advocating a similar misleading claim.", "Infrared Thermometer adalah selamat dan tidak menyebabkan kanser. https://t.co/eseaZKo4Sn", "The ministry’s Malaysian-language tweet translates to English as: “Infrared Thermometers are safe and do not cause cancer.”", "Dr Shazwan’s tweet reads in part: “Infrared thermometers cause cancer? I don’t know who made this video, but this is clearly not accurate.”", "In this press release on August 3, 2020, Dr Noor Hisham Abdullah, Malaysia’s director general of health, said: “Non-contact infrared thermometers are not a shooting tool and do not emit radiation. It is designed to detect and absorb the infrared light signals from the surface of the skin and convert it to electricity signals. The electronic circuit in this thermometer processes these electrical signals to determine the human body’s temperature being measured and show it on the display screen. Since the infrared thermometer does not emit dangerous radiation, it is safe to use.”", "In this August 4, 2020 post on Facebook, Dr Ahmad Firdaus Mohd Haris, a medical doctor and co-founder of Medical Mythbusters Malaysia, wrote that the non-contact infrared thermometers “only have sensors that detect temperature on the surface of the body” and that temperatures are taken from the forehead because it is “more accurate” compared to other parts of the body.", "In a Facebook post dated July 25, 2020, here, the National Metrology Institute of Malaysia also explained that infrared thermometers are safe.", "They wrote: “Every object with a temperature of over 0 Kelvin (-273 degrees Celsius) will produce infrared spectrum or ray. Infrared thermometers will detect this infrared ray or spectrum on wavelengths between 8-14 micrometers and convert it to a temperature reading … No laser rays are involved for the human body’s temperature range.”", "The US Food and Drug Administration states here that thermometer guns “may reduce the risk of spreading disease between people.\"", "A reverse image search on Google found the image featured in the misleading posts previously appeared in this photo gallery published by Iran’s Mizan Online News Agency on July 22, 2020.", "Below is a screenshot of the photo on Mizan’s website – AFP has circled the relevant photo in red:", "The first sentence of the gallery’s Persian-language sub-headline translates to English as: “Every year, before the start of the hajj, the curtain of the Kaaba is lifted and white linen cloths are placed around the Kaaba.”", "Kaaba, considered by the most sacred spot for Muslims, is a shrine located near the centre of the Great Mosque in the Saudi city of Mecca.", "Another photo in the photo gallery shows a guard aiming the infrared thermometer at a man’s forehead, as shown below:", "AFP Fact Check has also debunked a similar false claim about thermometer guns causing brain damage here, and killing neurons here in Spanish.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]