["The video was shared on Facebook here. It has been viewed more than 4,400 times.", "It was published on January 10, 2021, one day after Indonesia’s Sriwijaya Air Flight SJ182, a Boeing 737-500 passenger jet carrying 62 people, crashed into the Java Sea minutes after taking off from the capital city Jakarta, AFP reported.", "The FM 93.1 logo and the Chinese name of this radio station Zhengzhou Economics Radio has been superimposed on the video.", "Underneath the logo, the simplified Chinese-language text translates to English as: “Cabin images before the Indonesian plane crash.", "“Some people broke down and cried; some stayed calm and peaceful.”", "The post’s caption, also written in simplified Chinese, translates as: “On the evening of January 9, Beijing time, the Indonesian missing plane crashed into the sea near Laki Island. There were 56 passengers on board, including 46 adults, seven children and three infants.”", "The video was also shared here and here on Facebook; here and here on YouTube; and here and here on Chinese video streaming site Tencent Video.", "The claim is false.", "A reverse image search on Google using keyframes from the Facebook video, followed by a keyword search, found this Facebook video published by user Dewi Rachmayani on May 5, 2016. Dewi is listed as a former journalist at Indonesian television channel NET Mediatama Televisi on her Facebook page.", "The same video was published with credit to Dewi Rachmayani here by US broadcasting company CNN, and here by UK newspaper The Guardian. The captions both state the footage shows heavy turbulence on an Etihad Airways flight traveling from Abu Dhabi to Jakarta on May 4, 2016.", "Identical visuals seen misleading videos can be seen from the 23-second mark of the clip published by Dewi Rachmayani.", "Below are three screenshot comparisons between the misleading video (L) and the clip published by Dewi Rachmayani (R):", "The same video was also debunked by AFP’s Africa fact-check team here after it circulated in false posts about an Ethiopian Airlines plane crash in 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]