["By Lori Robertson and Brooks Jackson", "Posted on June 28, 2017", "Republicans are spinning their health care bills’ impact on Medicaid:", "Toomey’s office says that the senator meant that the bill doesn’t cut off Medicaid expansion eligibility for anyone, not that no one would lose insurance coverage under the bill. It’s correct that the Senate bill allows states to continue to cover the expansion-eligible population — but at significantly lower levels of federal funding.", "The senator made his comments on CBS’ “Face the Nation” on June 25, the day before the CBO released its analysis of the legislation.", "Toomey, June 25: Yes, listen, it’s going to be a challenge, but I have to strongly disagree with the characterization that we’re somehow ending the Medicaid expansion.", "In fact, quite the contrary. The Senate bill will codify and make permanent the Medicaid expansion. And, in fact, we will have the federal government pay the lion’s share of the cost. Remember, Obamacare created a new category of eligibility. Working-age, able-bodied adults with no dependents for the first time became eligible for Medicaid if their income was below 138 percent of the poverty level.", "We are going to continue that eligibility. No one loses coverage. What we are going to do, gradually over seven years is transition from the 90 percent federal share that Obamacare created and transition that to where the federal government is still paying a majority, but the states are kicking in their fair share, an amount equivalent to what they pay for all the other categories of eligibility.", "The Senate bill isn’t “ending the Medicaid expansion” eligibility — it’s ending the enhanced federal funding of the expansion-eligible population under the ACA.", "Prior to the ACA, Medicaid was available to groups including qualified low-income families, pregnant women, children and the disabled. The ACA expanded eligibility to all individuals under age 65, including adults without dependent children, who earn up to 138 percent of the federal poverty level (about $16,643 a year for an individual), but only in states that adopted the expansion. As this brief from the nonpartisan Kaiser Family Foundation shows, the income cut-offs for parents varied widely among the states before the ACA, and only a few states offered eligibility to adults without dependents.", "The expanded eligibility under the ACA came with significant federal dollars. States got 100 percent federal funding for the expansion population from 2014 through 2016, and 95 percent federal funding this year. That percentage slowly goes down to 90 percent for 2020 and beyond.", "Thirty-one states and the District of Columbia have opted in to the expansion, and more than 11 million newly eligible adults had enrolled in Medicaid through March 2016, according to an analysis by the Kaiser Family Foundation of data from the Centers for Medicare & Medicaid Services.", "The Senate bill, called the Better Care Reconciliation Act, was introduced on June 22. It wouldn’t take away those states’ option to offer coverage to the expansion population, but it starts to reduce the federal funding in 2021, putting it at 85 percent. In 2022, federal funding would be 80 percent, dropping to 75 percent in 2023 and then to the standard state matching rate for 2024 and subsequent years.", "Standard state matching rates for other enrollees vary, from 50 percent to 75 percent, for an average of about 57 percent, the CBO said in its analysis of the Senate bill. In Toomey’s home state of Pennsylvania, where 700,000 of the newly eligible gained Medicaid coverage, the standard rate is 52 percent.", "That’s significantly lower than the 90 percent federal funding the state is set to receive under current law.", "Still, Toomey doesn’t think that most states that have expanded Medicaid would drop that expansion under the Senate bill, his office told us.", "“States, on average, are paid well over half of the cost for the expanded Medicaid population, which is the same rate that they receive for the aged, disabled, and children,” spokesman Steve Kelly told us in an email. “Also, the Senate bill provides for a seven-year phase-in of this transition. Senator Toomey believes that, with this level of federal funding and the extended smoothing period, states will have the ability to continue providing Medicaid to able-bodied, working age, childless adults, if they so wish.”", "The CBO disagrees. It said that “some states,” without specifying which or how many, “would no longer offer” expansion coverage. Currently, the 31 states and Washington, D.C., that have expanded Medicaid cover about 50 percent of the newly eligible population nationwide. The CBO expects that share to drop to about 30 percent in 2026 under the Senate bill.", "And under current law — with that enhanced federal funding — CBO expects that more states would opt-in for the expansion in the future, covering about 80 percent of the expansion-eligible population by 2026. Under the Senate bill, nonexpansion states could still choose to cover the expansion population, but they’d have to do so at standard state match rates, not getting any years of the enhanced federal funding. CBO “expects that no additional states would expand eligibility” under the Senate bill, “largely because states would pay for a greater share of costs for enrollees.”", "The CBO report says it doesn’t give “any explicit prediction about which states would make which choices” and that “how individual states would ultimately respond is highly uncertain.” But with reduced federal Medicaid funding under the Senate bill, states would need to make some choices on “whether to commit more of their own resources to finance the program at current-law levels or to reduce spending by cutting payments to health care providers and health plans, eliminating optional services, restricting eligibility for enrollment through work requirements and other changes, or (to the extent feasible) arriving at more efficient methods for delivering services,” CBO says.", "By 2026, CBO estimates that 15 million fewer people would have Medicaid coverage, with 5 million of those being would-be enrollees in states that would have opted in to the expansion in the future under current law. The other 10 million reduction in the insured is due to “all other effects on enrollment.” (See Figure 4.)", "An Urban Institute report, published in June, analyzed the House health care bill’s impact on Medicaid. That bill would eliminate the enhanced federal funding for new enrollees in expansion states, beginning in 2020, and drop enhanced funding for current enrollees who have a gap in coverage of one month. The Urban Institute said: “Many states may have no choice but to eliminate coverage of the expansion population because they would be unable to substantially increase their own spending. Moreover, they have limited scope to cut benefits and provider payment rates.”", "Kelly Whitener, an associate professor at the Georgetown University McCourt School of Public Policy’s Center for Children and Families, expects some elimination of expansion coverage would be inevitable under the Senate bill. She told us that Toomey’s comment on “Face the Nation” is “accurate in part,” as he described the decline in federal funding for the expansion under the Senate bill.", "But overall, Whitener said, “the reality is that fewer federal dollars mean fewer lives will be covered. This is especially true when the changes to the expansion population are considered together with changes to the Medicaid program overall, namely converting the program into a capped program through either a per capita cap or a per capita cap and block grant combination.” (The Senate bill would cap Medicaid funding to the states starting in 2020.)", "“States will be struggling to find a way to continue coverage for populations that pre-dated the ACA (children, some parents, pregnant women, people with disabilities) as well as those made newly eligible under the ACA, and it’s impossible to see how they do so without scaling back on coverage eventually,” said Whitener, who worked for the Senate finance committee from 2008 to 2014 and worked on the ACA legislation.", "We can’t predict the future, and Toomey is entitled to his opinion that expansion states would find a way to continue to cover the expansion population under Medicaid, even in the face of reduced federal funds. But experts, including the nonpartisan CBO, doubt that.", "FactCheck.org Rating:", "Read More", "White House Counselor Kellyanne Conway is claiming that President Trump could sign a bill reducing future Medicaid spending by roughly $800 billion without violating his campaign promise that “there will be no cuts.”", "“These are not cuts to Medicaid,” she said during an appearance on ABC’s “This Week” June 25.", "Actually, the proposed reductions she defends would trim Medicaid rolls by 4 million people in the first year, and 14 million to 15 million after 10 years, compared with levels that the CBO predicted under current law.", "The proposals also would end the long-standing federal practice of matching at least $1 for every $1 spent by states for Medicaid, with no limit. Instead, states would get a set amount for each person enrolled. And, as we explained, the proposals decrease the federal match under the ACA for the expansion-eligible population. The result of those changes effectively squeezes down projected federal Medicaid payments by roughly $800 billion over the next decade.", "As a candidate, Trump promised repeatedly that he wouldn’t cut Medicaid, or Medicare or Social Security, either. He boasted in a 2015 tweet, for example, that he was the “first & only” Republican candidate to make such a promise.", "I was the first & only potential GOP candidate to state there will be no cuts to Social Security, Medicare & Medicaid. Huckabee copied me.", "— Donald J. Trump (@realDonaldTrump) May 7, 2015", "“This Week” host George Stephanopoulos asked Conway if Trump was now going back on that promise. Her reply:", "Conway, June 25: These are not cuts to Medicaid, George. This slows the rate for the future and it allows governors more flexibility with Medicaid dollars", "And again, later she said:", "Conway, June 25: You keep calling them as cuts. But we don’t see them as cuts. It’s slowing the rate of growth in the future and getting Medicaid back to where it was. Obamacare expanded the pool of Medicaid recipients beyond its original intentions.", "But however one spins it, the bill currently being considered by the Senate — like the version passed by the House May 4 — would result in much less federal spending for Medicaid than under current law. And fewer people getting benefits.", "CBO estimates that — compared with what is projected under current law — the Senate bill would result in $772 billion less for Medicaid over the next decade, and that the House bill would reduce it by $834 billion.", "Is that a cut? Republican Sen. Susan Collins says it is. On the same ABC News program, she said, “I respectfully disagree” with Conway’s analysis.", "Worth noting also is that House Speaker Paul Ryan himself has called it a cut when Democrats similarly enacted a reduction in the future growth of Medicare spending by an estimated $716 billion to help finance the ACA.", "Ryan, when he was Mitt Romney’s running mate in the 2012 presidential campaign, said President Obama “turned Medicare into a piggy bank to fund Obamacare” and promised to “stop the raid on Medicare.”", "Conway claims that the Republican proposals are about “getting Medicaid back to where it was” before the ACA. But the plans go beyond that, making fundamental changes in how Medicaid is funded by imposing a per-capita cap.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]