["A video clip viral on social media is being shared with the claim that it shows a TMC worker pull-out a revolver at a BJP worker during a live debate on Zee News. “बंगाल में TMC के कार्यकर्ता ने BJP के कार्यकर्ता के ऊपर रिवाल्वर निकाला वह भी लाइव जी न्यूज़ के डिबेट में.? (In Bengal, a TMC worker pulled out a revolver at a BJP worker during a live Zee News debate.)” – used the caption used by one MItali Shah (@mitalishah121) to circulate the clip.", "बंगाल में TMC के कार्यकर्ता ने BJP के कार्यकर्ता के ऊपर रिवाल्वर निकाला वह भी लाइव जी न्यूज़ के डिबेट में.?😭😭 pic.twitter.com/uwNod24iNx", "— Mitali शाह मिताली (@mitalishah121) May 20, 2019", "The video is also doing rounds on Facebook. A page ‘पोल खोल. कॉम polkhol. com’ shared it with the caption, “TMC प्रवक्ता ने zee news live बंगला में bjp प्रवक्ता पर रिवाल्वर तानी । (TMC spokesperson pulled up a revolver at a BJP spokesperson during Zee News live.)” The video drew 23,000 shares at the time of writing this article.", "TMC प्रवक्ता ने zee news live बंगला में bjp प्रवक्ता पर रिवाल्वर तानी ।", "Posted by पोल खोल. कॉम polkhol. com on Saturday, 18 May 2019", "It is viral on both Facebook and Twitter.", "The same clip was posted by Twitter user Chowkidar Piyush (@piyushsinghk) on April 25. He shared it with the claim that it depicts a TMC leader pulling out a gun during a live debate. Piyush is followed by railway minister Piyush Goyal and BJP Delhi spokesperson Tajinder Pal Singh Bagga, and his video received over 27,000 views and nearly 3,000 retweets (archive).", "TMC MLA pulls out Gun during live TV debate. This is happening in India and we are talking of intolerance.", "Unbelievable but not shocking !#MamtaKeGunde CC : @KailashOnline @BJP4Bengal @TajinderBagga @me_locket pic.twitter.com/H4FCJCILm2", "— Chowkidar Piyush (@PiyushSinghk) April 25, 2019", "Several ‘chowkidar’ handles retweeted Piyush’s tweet.", "The video was also viral on Facebook, with several individual users posting it with the identical claim.", "Several people commented on Piyush’s tweet that the TMC leader had picked up a mike and not pulled out a gun. A careful analysis of the video revealed that this was indeed true. The live debate was organised by Zee News in West Bengal’s Cooch Behar. The TMC leader who lost his cool and picked up a mike was state minister Rabindra Nath Ghosh. The slow-motion video posted below clearly shows that the object in the hand of the TMC leader is a mike.", "A photo montage of relevant portions also shows Ghosh holding a mike.", "While the TMC leader’s conduct was undoubtedly inappropriate for national television, the claim that he pulled out a gun/revolver during a live debate is completely false. Such cases of misinformation, unlike clipped or doctored videos, can be easily debunked with a careful glimpse.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]