["About this rating", "As the police-custody death in the spring of 2020 of a Black man named George Floyd sparked a national reckoning over police brutality, the American dictionary Merriam-Webster also reconsidered its definition of \"racism.\" The company decided to revise the term after Kennedy Mitchum, a Black college student in Iowa, emailed editors in late May, urging a change.", "While the dictionary editors were still revising the wording in June and had not yet posted it, Snopes readers asked us about claims that the new definition would show \"only white people are racist\" (see example tweet below). We reached out to Peter Sokolowski, editor at large at Merriam-Webster, who said the assertion \"is entirely untrue.\"", "The assertion likely originated from Mitchum’s recommendation that the editors at Merriam-Webster include language about systemic racism. The dictionary entry for racism currently has three definitions, the first two of which already call attention to individual belief and systemic biases:", "1. : a belief that race is the primary determinant of human traits and capacities and that racial differences produce an inherent superiority of a particular race\n2. a) : a doctrine or political program based on the assumption of racism and designed to execute its principles\n    b) : a political or social system founded on racism\n3. : racial prejudice or discrimination", "FrontPage Magazine, a far-right publication, argued that the new definition’s emphasis on systemic racism would ignore the racism of Black people like activist Louis Farrakhan (the Southern Poverty Law Center has described Farrakhan’s rhetoric as racist). The magazine said:", "Racism, obviously, means disliking another race, viewing it as 'bad'. That's a definition that black nationalists and their leftist allies really hate because it raises the possibility that Farrakhan … can be racist. Instead they define racism as a system of oppression so that only people with power can be racist and only white people have power.", "But their reporting failed to mention that Merriam-Webster was not planning to eliminate or replace the first definition, which focuses on individual racism. Sokolowski told Snopes that both definitions of racism — individual beliefs and the structural or institutional consequences of those individual beliefs — are already in the dictionary. They planned to simply clarify and contemporize the wording in the second definition.", "The following example illustrates the distinctions between the notion of individual versus systemic racism in the dictionary entry. Civil rights activists Stokely Carmichael and Charles V. Hamilton explained the difference in their 1967 book \"Black Power: The Politics of Liberation\":", "When a black family moves into a home in a white neighborhood and is stoned, burned or routed out, they are victims of an overt act of individual racism which most people will condemn. But it is institutional racism that keeps black people locked in dilapidated slum tenements, subject to the daily prey of exploitative slumlords, merchants, loan sharks and discriminatory real estate agents. The society either pretends it does not know of this latter situation, or is in fact incapable of doing anything meaningful about it.", "Mitchum found this distinction lacking in conversations with white people who cited the first definition of the Merriam-Webster entry to deny their individual role in perpetuating racism but ignored the second. She emailed editors at Merriam-Webster in late May, arguing that the dictionary definition should be updated to reflect micro-aggressions and systemic racism.", "The editors agreed that the entry, which had not been changed in decades, needed a revision. They planned to expand the second definition of the entry, and sharpen its language to include explicit and implicit biases that contribute to racial discrimination. The role of systemic or institutional bias would be made clearer using examples like apartheid in South Africa.", "Sokolowski told Snopes that editors revise definitions based on usage:", "Our research shows that the word (racism) is not being used in new ways so much as it is being used more frequently, especially when referring to systemic oppression. Our revision will help people understand all the word’s meanings, and that meaning in particular, more easily.", "Finally, he argued that a dictionary could not capture everything about a word:", "... Our mandate is to report the various established meanings that words in the language have, not to shape those meanings according to what we think they should be ... Explaining the essential nature of a thing, idea, or emotion is beyond the ability and the mission of dictionary editors.", "Ultimately, Merriam-Webster was not planning to remove the definition of individual racism or add too much new information. Editors were simply expanding the second definition of their entry to make it clearer and in line with modern usage. We thus label the claim that the revision was being made to show only white people are racist as \"False.\"", "Casiano, Louis.   \"Missouri Woman Says She Contacted Merriam-Webster to Change Dictionary Definition of Racism.\"\r\n   Fox News.   9 June 2020.", "Greenfield, Daniel.   \"Merriam-Webster To Change Dictionary Definition of \"Racism\" to Show Only White People are Racist.\"\r\n   Frontpage Magazine.   10 June 2020.", "Hauser, Christine.   \"Merriam-Webster Revises 'Racism' Entry After Missouri Woman Asks for Changes.\"\r\n   The New York Times.   10 June 2020.", "Merriam-Webster.   \"racism.\"", "Mosley, Tonya, and Samantha Raphelson.   \"Merriam-Webster To Revise The Definition Of Racism After Receiving Recent Graduate's Letter.\"\r\n   WBUR.   12 June 2020.", "O'Dowd, Mary Francis.   \"Explainer: What is Systemic Racism and Institutional Racism?\"\r\n   The Conversation.   5 February 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]