["By Saranac Hale Spencer", "Posted on August 30, 2019", "A website that describes its content as satire posted a story falsely claiming that Malia Obama was arrested at Harvard University. She wasn’t, but that story has been copied by other sites and shared as though it’s true.", "Malia Obama has been a popular target for purveyors of misinformation; we’ve debunked claims about former President Barack Obama’s eldest daughter before.", "Another bogus claim, first published in the spring, has been picking up steam on social media recently.", "Several readers have asked us if what they’ve seen on Facebook is true. “Did Malia get arrested for using a powdery substance in the bathroom at Harvard?” one reader asked.", "No. That claim originated on a self-described satirical website called DailyWorldUpdate.us, which includes this disclaimer on its “About” page: “Everything on this website is fiction.” The website is part of a network of sites that says it posts made-up stories to provoke conservatives. We’ve written about a lot of the claims made by that network, which is called America’s Last Line of Defense.", "Often, stories that start on one of that network’s sites will get copied and re-posted by other sites that have no disclaimer. That’s what happened with the story about Malia Obama. DailyWorldUpdate.us posted its story on May 29, and other sites copied and shared the story as though it were true.", "For anyone who reads past the bogus headline — “Malia Obama Arrested Again, Complete Media Blackout” — there are some red flags in the story, including the statement that “Obama was held at the Harvard County jail.” Harvard University, where Obama is a student, is located in Cambridge, Massachusetts, which is in Middlesex County. There is no “Harvard County” in Massachusetts.", "Also, the fake mugshot of Obama was created using a photo of her carrying a backpack on a street in Manhattan in 2017.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Malia Obama Arrested Again, Complete Media Blackout.” DailyWorldUpdate.us. 29 May 2019.", "Massachusetts Counties. Secretary of the Commonwealth of Massachusetts. 27 Feb 2019.", "Kamau, Robert. Malia Ann Obama seen out in Manhattan on April 18, 2017 in New York City. 18 Apr 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]