["About this rating", "A New Jersey police officer gave a pregnant waitress named Courtney English a $100 tip.", "However, viral content websites took the true story and dramatized it into a 71-page article. The lengthy slideshow-style story included misleading information. For example, she did not \"run to the manager.\"", "On Feb. 15, 2019, a pregnant waitress in her third trimester received a generous $100 tip after serving lunch to a cop. It happened at the Lamp Post Diner in Clementon, New Jersey. A Voorhees County police officer had ordered a lunch that cost less than $9. He paid his bill and left the diner before the waitress, Courtney English, was shown the receipt by the hostess.", "The story ended up being reported by local and national news media. NJ.com reported that the tip \"brought her to tears\":", "As Courtney English worked the lunch crowd Friday at the Lamp Post Diner, she got to chatting with customers about the upcoming birth of her first child. English is nearly eight months pregnant and has been working at the Gloucester Township diner to save as much money as possible before her daughter arrives.", "What happened next brought her to tears.", "A police officer dining on a salad at a nearby table must have overheard the conversation, she said. When he left to pay the bill, the anonymous officer included a $100 tip on the $8.75 check, along with a simple note: \"Enjoy your first. You will never forget it.”", "This was all true.", "Then a viral content website seized on the story for profit. The person or people behind the website HouseDiver, which claimed to be managed from Israel, dramatized the tale of kindness into a 71-page slideshow-style article. Most of the pages contained about three sentences each.", "Since at least January 2021, the HouseDiver article was advertised on the Taboola advertising platform with a misleading headline: \"Pregnant Waitress Charges Cop $9 For Lunch, Moments Later She Runs To The Manager.\" Another ad read: \"[Pic] Heavily Pregnant Waitress Runs To Her Boss In Tears After Seeing What Cop Left Next To Bill.\"", "The strategy behind HouseDiver's 71-page article was known as advertising \"arbitrage.\" The goal for the website was to make more money on the ads displayed on each of the 71 pages than it cost to run the initial ad that lured readers to the story in the first place.", "HouseDiver appeared to have located a number of pictures of English and her child, who was born weeks after English received the $100 tip. The viral content website used multiple photographs of her child without her permission.", "We contacted English, who was eager to set the record straight. We asked her if she had seen the misleading and dramatized version of the story.", "\"I came across all of that too and was very upset,\" English said.", "She confirmed to us that she did not \"run to the manager.\" Further, she said that the story's writers \"came up with some really outlandish things\" and that much of it was \"over-exaggerated.\"", "We also notified her that it appeared pictures of her and her child had been used without her permission. \"Definitely without my permission,\" she said.", "Honestly, I just find it inappropriate that pictures I didn’t give permission to be used are all over the internet.", "Pictures of my minor child are being shared with false information and I just feel it’s an invasion of our privacy, as well as I didn’t consent to it.", "As for the real story of the waitress, the cop, and the $100 tip, Courtney English's father, Brian, shared his thoughts in a Facebook post. It read, in part:", "What a wonderful person to not only leave a VERY generous tip, but a lovely message. I don't know you Mr. Police Officer, but you made my little girl cry, and made her year. Thank you. I always had the utmost respect for officers, but you went above and beyond not just an officer, but a beautiful human being. God Bless.", "We provided information to English regarding how she can report the advertisement to the Taboola advertising platform. We also directed her to the contact page for housediver.com, the website that hosted her child's pictures without her permission.", "For further reading, we have previously reported on a similar instance of a viral content website seizing on another true story about something that was hidden in a necklace.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]