["About this rating", "Sometimes doing too good a job has repercussions, as the city government of Paris found out after getting fined for its hiring practices. Mayor Anne Hidalgo’s mission to hire more women in senior positions in the city government was perhaps deemed too successful when the French Ministry of Public Affairs slapped a nearly $110,000 fine on the city.", "The fine was imposed on the grounds that the city government had broken national rules on gender parity in its 2018 staffing. The rules under which the city was fined required that no more than 60% of one gender be appointed to top civil service positions in a given year. The law was amended in 2019 so that there would be no fines if a disproportionate number of men or women were hired in any given year as long as the overall gender balance was respected.", "The problem was that Hidalgo carried out these hirings in 2018, before the amendment was put in place. Her recruitment drive resulted in 69% of the jobs going to women.", "Hidalgo is the first female mayor of Paris. “The management of the city hall has, all of a sudden, become far too feminist,” she sarcastically said in response to the fine. But she was still proud of her efforts to hire women. While she called the decision to impose a fine “absurd,” she told everyone at a city council meeting, “I am going to rejoice that we have been sentenced to a fine.” She said she would deliver the amount herself to the head of the ministry of public affairs.", "The minister, Amélie de Montchalin, who pointed out that they had repealed the provision in 2019, declared that she wanted the fine to fund actions to promote women civil servants, and invited Hidalgo to discuss the matter with her.", "We rate this claim as “True.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]