["About this rating", "In mid-September 2017, videos purportedly showing a group of unidentified flying objects over Oklahoma City went viral, racking up millions of views within days:", "Unfortunately for UFO enthusiasts, the video appears to show neither Oklahoma City nor unidentified flying objects. The earliest iteration of this footage that we could uncover was on 16 September 2017, along with a description stating that the video was taken during the Utah State Fair, which coincides with reports from Utah news stations about how they were receiving calls about \"strange lights\" that were spotted in the sky.", "The footage shown above can also be seen in the following video, which compiled several clips also showing these \"UFOs\" in Utah, not Oklahoma City:", "At around the same time that these videos were taken, and at the same time that Utah news stations began to receive calls about \"strange lights\", a team of Navy paratroopers was dropping into Rice-Eccles Stadium for the Utah Utes football game against the San Jose State Spartans.", "YouTube user Paul Brown captured the moment from inside the stadium:", "The University of Utah Athletics Facebook page also uploaded a 360-degree video of the jump. In this video, you can see that the paratroopers used a sort of flair that gave them a unique, perhaps alien, appearance during the flight:", "The Utah State Fair was held only a few miles from Rice-Eccles Stadium. When the viral UFO video is watched knowing that a group of paratroopers dropped into a football stadium at the same time and just a few miles away, it becomes clear that the streaking lights are actually parachuters in free fall while dragging flares behind them.", "Fox 13 [UTAH].   \"Strange lights Spotted in Sky Above Salt Lake City.\"\r\n    16 September 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]