["Several pictures of men in camouflage uniforms surrounding an overturned bus have recently gone viral on social media. Users are claiming that these soldiers were on their way to Bihar for election duty when nine of them were killed in the accident. Tanuj Punia, Vice President of the Uttar Pradesh Congress Committee’s SC Department, made this claim while tweeting two photos from the incident on November 5. His Hindi caption read, “This bus with BSF jawans overturned in Darbhanga, 9 soldiers martyred, many injured, the jawans were heading to do election duty.” (Archive link)", "#दरभंगा में #बीएसएफ के जवानों से भरी बस पलटी, 9 जवान शहीद, कई घायल, चुनाव कराने जा रहे थे बीएसएफ जवान, मै ईश्वर से प्रार्थना करता हूँ शहीदों की आत्मा को शांति प्रदान करें..@INCUttarPradesh pic.twitter.com/JJx7V82v3g", "— Tanuj Punia (@punia_tanuj) November 5, 2020", "A Facebook page called ‘Ashutosh Kumar’ also posted the picture and accompanying claim, where it received more than 6,000 likes.", "We noticed that users have been circulating these images widely across Facebook and Twitter. They were also shared on the Facebook group ‘CRPF*Central Reserve Police Force*शहीदों का वलिदान‘, receiving close to 2,000 likes.", "Alt News performed a keyword search and found that there was indeed an incident where a bus overturned in Bihar’s Darbhanga-Muzaffarpur district. It found mention in various news reports published on November 5, but there was no news of any soldiers losing their lives. According to reports, 10 soldiers were injured in the mishap.", "A November 5 report by Aaj Tak stated, “A bus full of BSF jawans going for election duty in Muzaffarpur, Bihar overturned on Wednesday afternoon. Ten soldiers including the bus driver were injured. The injured soldiers have been admitted to the nearby Community Health Center for treatment. According to doctors, their condition is stable.”", "Company commander Vijay Bahadur told Aaj Tak, “We came to Singhwada on election duty. When the bus containing the jawans went from Lalpur Chowk towards the high school, it stopped a little ahead of the school gate because of confusion about the exact location. The bus was reversing along a narrow road to reach the school when the accident occurred.”", "We also investigated the viral images and found one in a photo gallery dated November 5 on the website ‘Sanmarg Live’. The image caption states, “Darbhanga November 5, 2020 – A bus ferrying polling security officers after it met with an accident ahead of the third phase of the Bihar Assembly election in Darbhanga district.”", "Finding no information regarding the death of any jawan, Alt News contacted the Katra and Sinhwada police stations. The SHO of both stations confirmed to us that there was no truth in the claims. Singhwada SHO told Alt News, “Everybody sustained mild injuries and left the hospital for their respective destinations the same day. No one was seriously injured. The claim that anyone died in this accident is completely wrong. ”", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]