["A picture of a woman’s corpse along with a wedding card from an interfaith marriage has been shared on both Twitter and Facebook. A woman’s photo also accompanies the posts, alleging that she is the one who died.", "Ab kya kahen inko, Rona bhi nahin aata. Lekin parivaar waalo ka soch kar dukhi hoti hun. This incident is from Jodhpur, Rajasthan. pic.twitter.com/P1BkpLcRIF", "— Prisha (@MeetPrisha) September 29, 2021", "It has been claimed that one ‘Prerna Vyas’ from Rajasthan’s Jodhpur was a victim of ‘love jihad’ after she happily married a Muslim man.", "This slideshow requires JavaScript.", "The images, barring the photo of the woman, were also shared last year. The wedding card has the name of the couple allegedly involved in this incident, Prerna Vyas and Sameer Khan. Netizens had shared the photos and claimed, “Love Jihad’s last stop… Death.” Twitter user @Aapki_Lekhika had shared these photos on her account with this message on September 11, 2020. Her tweet garnered more than 6,000 likes and had been retweeted 3,700 times before it was deleted. (Archived link to the tweet)", "These pictures were shared with the same claim by another Twitter account with ‘Hindu Jagran Manch Bareilly Braj Prant’ as its display name.", "A Facebook page titled ‘His Highness Copy-Pastia Baba’ had also posted these pictures with this claim.", "Image 1: Corpse", "When we did a reverse image search of the photograph of the dead woman, we came across a report by DNA from September 12, 2018. According to this report, a young woman’s body had been recovered in the Burdwan district of West Bengal on August 31, 2018. The girl’s face had been crushed with a stone. During the post-mortem, two phone numbers written in henna were found on the victim’s body. Tracing these numbers led the police to a person named Karan Singh, a resident of Mumbai. When he was shown a picture of the corpse, Singh told the police that the girl’s name was Jahana Khatoon and she was from Muzaffarpur, Bihar. He and Jahana were in love with each other. However, her family was unhappy with their relationship. Singh said that Jahana’s father made her end her relationship with him and tried to force her to come back home with them to Muzaffarpur. After getting this information, the police reached Jahana’s house in Muzaffarpur. There they came to know that she had been taken to Kolkata by her father and brother a few days earlier. Singh had also told the police that Jahana’s father Md Mushtaque and brother Md Jahid lived in Kolkata’s Park Circus area where they both worked as drivers.", "The police then arrested the father-son duo from Park Circus on September 9, 2018. During the interrogation, Md Mushtaque broke down and confessed that he was the one who had killed Jahana. Md Jahid was quoted as saying in the report, “We brought her to Kolkata and we had also made up our mind to get Karan and Jahana married. While we were on the way back with Jahana, my father said that we should kill her. While I was driving, my father took a rope that was inside the car and strangulated her. Later he asked me to stop the car and he dumped the body off the road and mutilated her head with a stone.”", "A few other media outlets, including News18, NDTV, Business Standard, and Zee News, had published reports on the incident.", "Image 2: Wedding card", "The image of the wedding card clearly shows the date of Sameer Khan and Prerna Vyas’s wedding as October 22, 2019. Therefore, it cannot be linked in any way to the West Bengal incident from 2018. The picture of this wedding card has, in fact, been circulating on social media since October 2019.", "Image 3: Photo of a woman", "The woman is Telugu actress Summiyya Mohammed. Her picture, publicly available on the internet (1 and 2), was misused to weave the fictional story.", "To sum it up, a case of ‘honour’ killing in 2018 is being shared on social media with false claims that a Hindu woman was murdered as a result of ‘love jihad’. The woman who was killed hailed from the Muslim community. This 2018 incident has nothing to do with an interfaith marriage that was held in October 2019. The wedding card is unrelated to the incident. Furthermore, Telugu actress Summiyya Mohammed’s picture was misused to claim she was the Hindu woman who succumbed to ‘love jihad’.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]