["By Angelo Fichera", "Posted on May 2, 2018", "Q: Did actress Allison Mack confess to selling children to the Clintons and Rothschilds?", "A: No. Mack has pleaded not guilty to sex trafficking charges. She has not “confessed” to selling children to anyone.", "The recent news about actress Allison Mack tells a bizarre and unsettling tale: The 35-year-old known for her role on “Smallville” is now accused by federal authorities of recruiting women into a cult where they were exploited for sex and labor.", "But there is no truth in a story that appeared on some websites that the actress confessed that “she sold children to the Rothschilds and Clintons.”", "That erroneous report, dated April 29 and published on yournewswire.com and thenewlypress.com, has racked up nearly 200,000 engagements on Facebook, where some users flagged the posts as potentially false. We’ve repeatedly found yournewswire.com to spread false information, including a recent fabrication about a video involving Hillary Clinton.", "Topped with a fictitious headline, the story blends fabricated details about Mack selling children to “Hollywood pedophiles and powerful politicians” and some accurate information about the allegations of her involvement in NXIVM — a company founded by Keith Raniere that bills itself as a self-help organization but that prosecutors say forced women to provide sex and labor.", "The Albany-based NXIVM, according to the U.S. attorney’s office for the Eastern District of New York, contained a secret society that required participants to offer “collateral” — such as nude photographs and damaging information about friends and family — in order to join. The women were branded with a symbol containing Raniere’s initials, officials say.", "Raniere and Mack face charges of sex trafficking, sex trafficking conspiracy and forced labor conspiracy, according to an indictment.", "While prosecutors did note in a court letter that there have been previous allegations Raniere had sex with girls as young as 12 and 15, officials have not entered charges against him or Mack that deal with children. Though the federal statute cited in the indictment can be applied to child sex trafficking, it also outlines the crime of sex trafficking of people “by force, fraud or coercion.”", "And nowhere in court documents or publicly has Mack made any confession regarding selling children, including to the Clintons. She pleaded not guilty at her April 20 arraignment but also signed a court document indicating she was negotiating with prosecutors.", "The story accurately mentions connections between NXIVM and prominent individuals such as the Seagram heiresses Sara and Clare Bronfman and Nancy Salzman. Law enforcement officials say Clare Bronfman has “financially backed” Raniere. Salzman is president and co-founder of Raniere’s other organization, Executive Success Programs.", "But the story then uses those associations to make false allegations about ties between NXIVM and the Clintons.", "For instance, the story claims that the Bronfman sisters, as well as Salzman, are “members of Bill Clinton’s foundation, the Clinton Global Initiative, which requires an annual $15,000 membership fee.”", "But a spokesman for the Clinton Foundation, of which the Global Initiative is a part, said that wasn’t the case. Brian Cookstra told us in an email that none of those individuals made donations to the foundation — and none are “members” of the Global Initiative “community.” He said members must make a “commitment to action” and that none of those women have.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories flagged by readers on the social media network.", "Application and Order of Excludable Delay, United States v. Allison Mack. U.S. District Court for the Eastern District of New York. 20 Apr 2018.", "Cookstra, Brian. Spokesman, Clinton Foundation. Email sent to FactCheck.org. 1 May 2018.", "“Founder of “NXIVM,” a Purported Self-Help Organization, and Actor Indicted for Sex Trafficking and Forced Labor Conspiracy.” Press release. U.S. Department of Justice. 20 Apr 2018.", "Indictment, United States v. Keith Raniere and Allison Mack. U.S. Attorney’s Office for the Eastern District of New York. 19 Apr 2018.", "Letter to The Honorable Steven M. Gold, Re: United States v. Keith Raniere. U.S. Attorney’s Office for the Eastern District of New York. 26 Mar 2018.", "“‘Smallville’ Star Confesses She Sold Children To Rothschilds And Clinton.” Yournewswire.com. 29 Apr 2018.", "“‘Smallville’ Star Confesses She Sold Children To Rothschilds And Clinton.” Thenewlypress.com. 29 Apr 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]