["A two-minute video which shows a group of men aggressively interrogating a man in a red shirt is widely circulating on social media. The men interrogating in Haryanvi ask – “who taught you this?” and “what is your plan?” Subsequently, they threaten to pour oil on the man and immolate him. It is also evident that the man being interrogated is severely injured – there is blood on his head, chest and legs.", "Several Twitter and Facebook users have shared the video with the claim that the man used an injection filled with spittle on fruits to spread coronavirus. The Hindi text associated with the video reads, “Found in Bawana. Planned to fill fruits with an injection filled with spit. After all, what do these people want? (translated from बवाना से मिला है ये। थूक को इंजेक्शन से फ्रूट्स में भरकर कोरोना फैलाने की तैयारी थी. आखिर ये लोग चाहते क्या हैं).”", "Facebook page Resurging Hinduism posted the viral video along with the Hindi text on April 6. Since then it has been shared over 1,200 times and viewed over 37,000 times. (archive link)", "बवाना से मिला है ये। थूक को इंजेक्शन से फ्रूट्स में भरकर कोरोना फैलाने की तैयारी थी", "बवाना से मिला है ये। थूक को इंजेक्शन से फ्रूट्स में भरकर कोरोना फैलाने की तैयारी थी", "Posted by Resurging Hinduism on Monday, April 6, 2020", "On April 9, media outlets including IndiaTV (archive link), Huffington Post (archive link) and The Quint (archive link) carried a report by Press Trust of India (PTI) which quoted the police as saying that a “22-year-old man was allegedly beaten to death in Delhi’s Bawana after he was suspected of a conspiracy to spread COVID-19”. Similarly, Maktoob Media (archive link) also published the report with the same claim.", "Alt News has received several requests to fact-check the video on WhatsApp (+91 76000 11160) and on our official Android application.", "Alt News performed a keyword search on Google and found a report by The Hindu (archive link) published on April 6. According to the report, Shamshad Ali, a 30-year-old man, was thrashed by a group of men in Harewali village in Bawana in outer-north Delhi over the suspicion that he was part of a “conspiracy” to spread coronavirus.", "Several media outlets including Indian Express, Times Now and Catch News reported the incident. However, unlike in the report by The Hindu, the man has been identified as 22-year old Dilshad alias Mehboob Ali. Alt News spoke with Assistant Commissioner of Police (ACP) Bawana who confirmed the man in the video is 22-year-old is Ali.", "Alt News found a longer video of the violent incident which we are refraining from adding to the fact-check. Those who wish can watch the full clip here.", "ACP Bawana informed that the claim that Ali used injections filled with spit on fruits is false. The ACP said that Ali had gone to attend a jamaat in Bhopal, Madhya Pradesh. While returning to Delhi in a truck, he was stopped by the police and taken to Guru Teg Bahadur Hospital for coronavirus screening. Since no symptoms were observed, Ali was allowed to go home where he was attacked by three men who have now been arrested.", "Delhi Police Additional PRO Anil Mittal said, “Naveen, 30 years old, Prashant 26 years old, Pramod 30 years old have been arrested in case FIR No. 189/2020 under Section 323 (Punishment for voluntarily causing hurt), Section 341 (Punishment for wrongful restraint), Section 506 (Punishment for criminal intimidation) and Section 34 (Acts done by several persons in furtherance of common intention) of the Indian Penal Code by the Bawana Police Station.” Furthermore, the officer informed that Ali has been booked under Section 188 (Disobedience to order duly promulgated by public servant) for breaking the lockdown protocol.", "It is noteworthy that Bollywood singer Kanika Kapoor was booked under IPC Section 188, Section 269 (negligent act likely to spread infection of disease dangerous to life) and Section 270 (malignant act likely to spread infection of disease dangerous to life). Had Ali been involved in an act to spread the infection a case would’ve been registered against him under the aforementioned IPC Sections. However, he has only been booked under Section 188 for flouting lockdown protocol.", "Mittal said, “22 years old Dilshad Ali, alias Mehboob resident of village Harevli is still admitted in Lok Nayak Jai Prakash Narayan (LNJP) Hospital, Delhi as a coronavirus suspect. The investigating officer of the case had a telephonic conversation with him today morning in which he stated that he is fine.”", "Alt News spoke with Ali’s family friend Akram Chaudhary who informed, “Ali is currently quarantined under suspicion of being infected with coronavirus.” Chaudhary also confirmed Ali’s name and age.", "Therefore, PTI-led reports carried by IndiaTV, Huffington Post and The Quint misreported that Ali died in the attack. Maktoob Media also incorrectly reported the same. Furthermore, The Hindu misidentified the survivor as 30-year-old Shamshad Ali.", "The man who was beaten is 22-year-old Dilshad Ali, alias Mehboob. While mainstream media misreported that he lost his life in the attack, social media added a false communal colour to the incident.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…"]