["“Marvelous Marvin dies after shot Boxing legend dead age 66 after ‘fighting effects of vaccine,’” says text included with an image of Hagler in a March 14, 2021 Facebook post.", "The claim -- which has circulated in articles as well as posts on social media -- appears to have originated from a since-removed March 13 Instagram post by Hagler’s former rival Thomas Hearns, whom he defeated in a 1985 bout known as “The War.”", "“A real true warrior Pray for the king and his family.. he’s in ICU fighting the after effects of the vaccine!” Hearns wrote in the post, which was liked almost 10,500 times.", "An online search using social media analysis tool Crowd Tangle suggests Hearns was the first to claim a vaccine link to Hagler’s death. In a later Instagram message, he sent “love to the Hagler family” and issued “an apology for any negative feelings that was brought to life.”", "Hearns did not respond to a query from AFP sent to his Instagram account.", "One YouTube TV channel posted that if Hagler “was killed” by the vaccine, “y’all can forget about black folks taking that shit.” Another post, from former Major League Baseball player Aubrey Huff, said Hagler had met a similar fate to that of Hank Aaron -- “two legends dead after taking the #covid19 vaccine.”", "AFP Fact Check has already debunked claims that the January 2021 death of baseball Hall of Famer Aaron was linked to the Moderna jab.", "The United States has administered more than 100 million vaccinations against Covid-19, but African Americans remain more reluctant than other racial groups to get a shot, though their acceptance has risen.", "There is no confirmation that Hagler, unlike Aaron, had even received a Covid-19 innoculation.", "In a March 13 announcement on Hagler’s official Facebook fan page, his wife, Kay Hagler, said he “passed away unexpectedly at his home here in New Hampshire.”", "She did not give a cause of death but, in a longer March 15 post on the same page, said she was “the only person close to him until the last minute” and rejected “stupid comment” about what happened.", "“For sure wasn’t the vaccine that caused his death . My baby left in peace with his usually smile and now is not the time to talk nonsense,” she wrote of the 66-year-old.", "The official website of Marvelous Marvin Hagler -- his legal name -- said he “died on March 13 of natural causes near his home in New Hampshire.”", "His death is not under investigation by New Hampshire’s medical examiner, Kate Giaquinto, director of communications with the Office of the Attorney General, told AFP by email.", "“The New Hampshire Medical Examiner will accept jurisdiction for unexplained and non-natural (ie homicide, suicide, accident) deaths,” she said. “Mr Marvin Hagler’s death did not fall under the jurisdiction of the medical examiner.”", "Asked whether, in general, a death after a Covid-19 vaccine would come within the examiner’s purview, she said that a determination is made “on a case-by-case basis and is dependent upon the medical information relative to each individual.”", "The US Centers for Disease Control and Prevention (CDC) says Covid-19 shots are safe, effective, and recommended. It says the Food and Drug Administration requires vaccine providers to report any death after a Covid-19 shot to the Vaccine Adverse Event Reporting System (VAERS). But reports of death to VAERS do not necessarily mean the shot caused the fatality, CDC cautions.", "In fact, of more than 1,900 reports of such deaths received by VAERS, subsequent investigations found no link to the vaccinations.", "“A review of available clinical information including death certificates, autopsy, and medical records revealed no evidence that vaccination contributed to patient deaths,” CDC says on its website.", "AFP fact check has debunked numerous false and misleading claims about Covid-19 vaccines.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]