["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A post on Facebook showed a grim photo of children’s bodies laid out in rows. Above it were the words, \"Thailand police found this in a container vehicle. Dead bodies of children. Their organs where (sic) found removed.\"", "The Feb. 28 post drew expressions of grief. One person wrote, \"Oh, my lord. So sad.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "In reality, the horrific photo comes from Ghouta, Syria, in August 2013, after a chemical attack. An identical image appeared on a Syrian news website at that time. A United Nations inspection team found \"clear and convincing evidence\" that Sarin gas had killed more than 1,500 people.", "The false tie between the dead children and organ harvesting goes back several years. Our fact-checking colleagues at Boom in India first debunked this in 2017, and did so again in 2018.", "The website Snopes first spotted this misuse of the photo in 2016.", "Among the phony posts, the countries involved can change. In addition to Thailand, Malaysia crops up as the place where the alleged crime occured.", "The real crime of Syria’s use of a deadly nerve agent on helpless people in 2013 led President Barack Obama to call for military action against Syria. Obama had said previously that if Syria crossed a \"red line,\" it would pay the price. But Obama said Congress should approve the mission, and with Afghanistan and Iraq as the backdrop, Congress had no appetite for stepping into another conflict.", "A Facebook post said a photo of rows of dead children showed the victims of organ trafficking. The picture comes from Syria in 2013 after a deadly chemical weapons attack. The false connection to organ trafficking dates back to 2016.", "We rate this Pants on Fire.", "Facebook, post, Feb 28, 2019", "Boom, Child Kidnapping Rumours Revived With Unrelated Images, WhatsApp Audio Messages, Nov. 16, 2018", "Boom, Child Kidnapping Rumours In India Being Spread With Syria Image, Pak Video, May 23, 2017", "Zamanalwsl.net, Assad's chemical attacks kill 871 children at least: NGO says, Aug. 24, 2013", "Busy.org, The Harvested Bodies of 700 Children Discovered in Malaysia, Feb. 22, 2017", "NPR, History Of U.S. Responses To Chemical Weapons Attacks In Syria, April 13, 2018", "United Nations, ‘Clear and convincing’ evidence of chemical weapons use in Syria, UN team reports, Sept. 16, 2013", "Snopes, Is This an Image of ‘Child Organ Trafficking Victims’ in Thailand?, Dec. 6, 2016", "New York Post, Syrian rebels claim more than 500, including dozens of kids, dead in chemical weapons attack; Obama calls for UN probe, Aug. 21, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]