["On Day 1, Republicans made numerous false and misleading claims on tax cuts, the economy, immigration and COVID-19, among other topics.", "By Eugene Kiely, Lori Robertson, Robert Farley, D'Angelo Gore, Jessica McDonald, Brooks Jackson and Rem Rieder", "Posted on August 25, 2020", "Speakers in the first night of the 2020 Republican National Convention engaged in political spin, particularly in making claims about Democratic presidential nominee Joe Biden’s policy positions:", "Several speakers at the convention misleadingly portrayed the Tax Cuts and Jobs Act of 2017, which Trump signed, as exclusively benefiting the middle class, while criticizing Biden’s tax plan as hurting “working families.” In fact, the Republican tax law largely benefitted the wealthy, while the Biden proposed tax increases would fall mainly on the top 1% of taxpayers.", "Sen. Scott, a Republican from South Carolina, said, “Joe Biden wants to come for your pocketbooks. … Unless, of course, you’re a blue state millionaire,” adding that “President Trump’s once-in-a-generation tax reform bill … lowered taxes for single moms, working families and those in need.” Similarly, Guilfoyle, Donald Trump Jr.’s girlfriend and chair of the Trump Victory Finance Committee, said, “President Trump cut middle-class taxes, putting tens of thousands of dollars back in the pockets of working-class Americans.”", "Haley, a former South Carolina governor who was Trump’s U.N. ambassador, speaking of “Joe Biden and the socialist left,” said: “They want massive tax hikes on working families.”", "The tax law Trump signed in December 2017 lowered many individual tax rates, nearly doubled the standard deduction, eliminated personal exemptions and increased child tax credits, among other changes. It also cut the top corporate tax rate from 35% to 21%.", "It is true that all income groups, on average, saw an income tax cut under Trump’s tax cuts, and 82% of middle-income earners — those with income between about $49,000 and $86,000 — received a tax cut that averaged about $1,050 in 2018, according to an analysis by the Tax Policy Center at the time.", "But the Tax Policy Center also found that the top 1% of taxpayers would receive 20.5% of the tax cut benefits in 2018 — increasing to 25.3% in 2025 and then jumping to 82.8% in 2027. (Most of the individual income tax provisions expire after 2025, but the corporate tax cut would remain in place, resulting in increasingly larger tax benefits to the top 1%.)", "Biden proposes to raise an additional $4 trillion in taxes over the next decade, but the top 1% of earners would bear the brunt of Biden’s increases, according to the Tax Policy Center. The three main provisions of his plan include:", "“Almost 54 percent of the tax increase would fall on the top 0.1 percent of the income distribution,” according to an analysis of Biden’s plan by the Penn Wharton Budget Model. The top 1% would see an average tax increase of about 40%, according to the Tax Policy Center.", "In one of his prime-time appearances during the convention, the president visited with a group of essential employees who have worked throughout the COVID-19 pandemic. He told one woman, a postal worker, that the Democrats want to get rid of postal workers.", "Trump, Aug. 24: And we’re taking good care of our postal workers. That I can tell you. Believe me, we’re not getting rid of our postal workers. You know, they’d like to sort of put that out there. If anybody does, it’s the Democrats, not the Republicans.", "In fact, House Democrats have repeatedly tried to obtain $25 billion in emergency funding for the U.S. Postal Service to make up for lost revenue during the pandemic, but the president has objected to direct funding for the USPS. And his administration has called for reducing the agency’s labor costs.", "The House Democrats first tried in March to include the $25 billion in the Coronavirus Aid, Relief, and Economic Security Act, or CARES Act. But Trump opposed the funding and it was removed, according to Rep. Gerry Connolly, a Virginia Democrat who chairs the House subcommittee on government operations, which includes oversight of the postal service. Instead, the CARES Act provided USPS with $10 billion in borrowing authority, giving the Treasury Department leverage to negotiate changes at the postal service, including cutting labor costs, as first outlined in a 2018 task force report.", "In May, the House Democrats tried again, passing the Health and Economic Recovery Omnibus Emergency Solutions, or HEROES Act, which included $25 billion for the postal service.", "Trump recently disclosed that he opposes giving the postal service $25 billion because of his opposition to mail-in voting, saying if the postal service doesn’t get the emergency funds “that means you can’t have universal mail-in voting because they’re not equipped to have it.”", "In addition, Louis DeJoy — a Trump ally and donor — took over as postmaster general in mid-June and began instituted cost-cutting initiatives, including reducing overtime. Those initiative have now been put on hold until after the election, due to Democratic concerns that such measures will delay the prompt delivery of mail-in ballots by the Nov. 3 election.", "In response to Trump’s opposition to USPS funding and mail-in ballots, as well as DeJoy’s operational changes, the House Democrats passed standalone legislation on Aug. 22 to provide the U.S. Postal Service with $25 billion in emergency funding. But Trump opposes that, too.", "Trump wrongly claimed, ”It used to take 17 years, 18 years, 20 years, 21 years … to get approval to build a highway,” but that under his administration, “We have it down to two years now, we’re going to have it down to one.” According to the latest statistics from the Federal Highway Administration, it took a median of 3.83 years in fiscal 2019 for projects requiring environmental impact statements to complete the process required by the National Environmental Policy Act. That’s the same or a bit longer than it took during the last five years of the Obama administration.", "Trump made the claim at the Republican National Convention on Aug. 24 after being formally nominated as the party’s presidential candidate.", "Trump, Aug. 24: They [the Biden team] are going to raise your regulations, make it impossible to build a highway. It used to take 17 years, 18 years, 20 years, 21 years, a long time in some cases, to get approval to build a highway, right? We have it down to two years now, we’re going to have it down to one. And it may get rejected for environmental or safety reasons, but we’re going to know it very quickly. We’re not going to take 17 years. … They took forever.", "Although there have been some exceptions, the median wait time to get permit approval has never been nearly as high as the president claimed. According to Federal Highway Administration data, the median wait time between fiscal years 1999 and 2016 ranged from 3.4 years to 7 years. After the method for tracking wait times was revised starting in fiscal 2012, the median wait time during the last five years of the Obama administration was 43.6 months, or 3.63 years.", "That median time has not been trimmed during the Trump years. The median wait time was 46 months in fiscal 2017, 47 months in fiscal 2018 and 46 months in 2019.", "Trump signed an executive order in August 2017 setting a “goal of completing all Federal environmental reviews and authorization decisions for major infrastructure projects within 2 years.” But that hasn’t been achieved. As we said, the median wait time in fiscal 2019, the latest year for available data, was 46 months, or 3.83 years.", "Donald Trump Jr. said his father “built the greatest economy our country has ever seen,” which isn’t true.", "Job growth actually slowed under Trump. The economy added nearly 8.1 million jobs during the three years before Trump took office, and 6.6 million in Trump’s first three years as president.", "Overall economic growth hasn’t been exceptional either. The best year of Trump’s presidency saw 3% growth in real (inflation-adjusted) gross domestic product, according to recently revised figures from the Bureau of Economic Analysis. That fell short of the 3.1% growth seen as recently as 2015, during then-President Barack Obama’s best year. As recently as 2004 and 2005, under George W. Bush, the economy grew 3.8% and 3.5%.", "Trump Jr. began by saying that until recently the country was seeing the “greatest prolonged economic expansion in American history.” That’s true, but the historic boom began under Obama seven-and-a-half years before Trump took office, in June 2009, and ended just three years into the Trump presidency, in February 2020.", "The expansion (as determined by the nonpartisan, independent National Bureau of Economic Research) lasted 128 months, topping the previous record expansion of 120 months. That one began late in George H. W. Bush’s term, ran the entire eight years of Bill Clinton’s presidency, and ended two months into the first term of Bush’s son George W. Bush.", "Some speakers falsely claimed that Biden wants to defund the police, even though Biden has explicitly said that he does not. The charges are part of a Trump campaign strategy to suggest that a Biden administration would mean an unsafe America with crime out of control and unanswered 911 calls.", "Trump has made this false claim many times, as have his campaign ads. But as we have written, Biden has said on a number of occasions that he is opposed to defunding the police, and a Biden spokesman told us the Democratic nominee supports more funding for police for some functions, such as initiatives to strengthen community relationships and for body-worn cameras. (As we’ve written, there is no agreed upon definition for the term “defund the police.” Some critics of the police really do want to abolish police forces and replace them with other forms of community safety entities. Others advocate shifting some money and functions away from police departments to social service agencies.)", "That didn’t stop speakers from making the untrue statement on the GOP convention opening night. For example, House Republican Whip Steve Scalise, who was shot during a congressional baseball game in 2017, said, “Biden has embraced the left’s insane mission to defund” the police.", "Scalise, Aug. 24: The left wants to defund the police. This is personal to me — I wouldn’t be here without the bravery and heroism of the men and women in law enforcement who saved my life. President Trump stands with those brave men and women. Joe Biden has embraced the left’s insane mission to defund them. There won’t be an America to leave to our children and grandchildren without those brave law enforcement officers and first responders.", "And Guilfoyle said Biden, Democratic vice presidential nominee Kamala Harris and “the rest of the socialists … will defund, dismantle and destroy America’s law enforcement. When you are in trouble, and need police, don’t count on the Democrats.”", "It’s important to remember that the federal government pays a small percentage of law enforcement expenses. According to a backgrounder by the Urban Institute, 86% of police funding in 2017 was from local governments, with additional money ponied up by state governments.", "And Biden has rejected the idea pushed by some on the left to defund the police. He made his position clear in an op-ed published in USA Today on June 10:", "Biden, June 10: While I do not believe federal dollars should go to police departments violating people’s rights or turning to violence as the first resort, I do not support defunding police. The better answer is to give police departments the resources they need to implement meaningful reforms, and to condition other federal dollars on completing those reforms.", "Nevertheless, Scalise and Guilfoyle weren’t the only speakers to say that Biden would significantly cut spending on law enforcement. Some speakers, like Donald Trump Jr., linked defunding the police to Democrats in general without specifically naming Biden. But Rep. Matt Gaetz, a Florida Republican, said that liberal Democratic Rep. Alexandria Ocasio-Cortez and socialists will be “pulling the strings” in a Biden administration.", "Gaetz, Aug. 24: Settle for Biden — that’s the hashtag promoted by AOC and the socialists. The woketopians will settle for Biden because they will make him an extra in a movie written and produced and directed by others. It’s a horror film, really. They’ll disarm you, empty the prisons, lock you in your home, and invite MS-13 to live next door. And the police aren’t coming when you call in Democrat run cities that are already being defunded, disbanded.", "Despite the fact that it is untrue, it seems clear that the GOP will be pushing this claim deeper into the campaign.", "Two speakers went after Democratic policy positions on the environment, but mischaracterized them.", "“If you watched the DNC last week, you probably noticed that Democrats spent a lot of time talking about how much they despise our president,“ said RNC Chairwoman McDaniel. “But we heard very little about their actual policies. Policies that would have been unthinkable a decade ago. Policies like banning fossil fuels.”", "Haley also made a similar claim, suggesting that a Biden-Harris administration would be controlled by the “socialist left” and would ban hydraulic fracturing as a method of extracting oil and natural gas.", "“Last time, Joe’s boss was Obama. … This time, it would be Pelosi, Sanders, and the Squad,” Haley said. “Their vision for America is socialism. … They want to ban fracking and kill millions of jobs.”", "While some Democrats support banning fracking, including Sen. Bernie Sanders and Ocasio-Cortez — and Kamala Harris did during her run as a presidential candidate — Biden’s climate change plan only calls for “banning new oil and gas permitting on public lands and waters.”", "That allows for existing fracking permits to continue on federal lands and does nothing to prohibit fracking on private land. Given that most fracking occurs on private or state-owned land, Biden’s policy is hardly a ban on fracking.", "Biden’s climate plan also doesn’t ban all fossil fuels, although it works to reduce society’s reliance on them, and aims for net-zero emissions no later than 2050. Net-zero means some emissions can occur, as long as those emissions are sequestered, or removed, and there is no net addition to the atmosphere. In theory, this allows fossil fuels to be used with carbon capture technologies or other sequestration efforts.", "Not even the Green New Deal called for a complete ban on all fossil fuels. Instead, the nonbinding resolution proposed getting to net-zero emissions within 10 years.", "As we have written, Biden has not always been clear when communicating about his climate change policies, but his platform does not include a full ban on either fossil fuels or fracking.", "In her remarks, McDaniel also incorrectly said that 10 million oil and gas jobs would be lost under Democrats. “Eliminating 10 million good paying oil and gas jobs is not nice,” she said.", "According to the American Petroleum Institute, 9.8 million Americans are supported by the oil and gas industry. But that’s a figure for 2011, and API is including indirect employment, or other positions made possible by the industry. Only 2.6 million of those jobs are actually in oil and gas, and the number includes part-time jobs.", "The 2020 U.S. Energy and Employment report suggests the number is lower, or just 1.5 million jobs. In either case, the number of oil and gas jobs is well below 10 million, and McDaniel also incorrectly assumes that all of the jobs would be lost, even though Democratic policies do not go that far.", "In contrasting Trump’s record on crime legislation with Biden’s, Georgia state Rep. Vernon Jones and Scott made misleading claims.", "Jones, a Democrat who has endorsed Trump, said of the president: “He delivered historic criminal justice reform. He ended — once and for all — the policy of incarceration of Black people, which has decimated our communities, caused by no other than Joe Biden. Democrats wouldn’t do it. Obama didn’t want to do it. And Joe Biden and Kamala Harris definitely wouldn’t do it.” (Jones’ prepared remarks said “mass incarceration.”)", "Scott also faulted Biden: “In 1994, Biden led the charge on a crime bill that put millions of Black Americans behind bars,” he said.", "But as we’ve written before, the blame for mass incarceration goes well beyond the Violent Crime Control and Law Enforcement Act of 1994, which received bipartisan support and was shepherded through the legislative process by then-Sen. Biden, chairman of the Senate Judiciary Committee. The trend of increasing imprisonment began well before 1994 — in the early 1970s — though experts say the 1994 law exacerbated the issue.", "“In the 1970s, the numbers of arrests and court caseloads increased, and prosecutors and judges became harsher in their charging and sentencing,” a two-year study by the National Research Council said. “In the 1980s, convicted defendants became more likely to serve prison time.” The report cited policies enacted by officials at all levels that expanded the use of incarceration, largely in response to decades of rising crime.", "But the 1994 crime bill included a federal “three-strikes” provision which required mandatory life imprisonment without possibility of parole for those who commit federal violent felonies if they had two or more previous convictions for violent felonies or drug trafficking crimes. And it included $8.7 billion for prison construction to states that passed “truth-in-sentencing” laws requiring that people convicted of violent crimes serve at least 85% of their sentences.", "“Although incarceration was already rising steadily before the crime bill, several of its provisions helped increase incarceration even further,” experts with the Brennan Center for Justice said in 2016. “On their own, states passed three-strikes laws, enacted mandatory minimums, eliminated parole, and removed judicial discretion in sentencing. By dangling bonus dollars, the crime bill encouraged states to remain on their tough-on-crime course.”", "As for Jones’ claim that Trump “ended — once and for all — the policy of [mass] incarceration of Black people,” the First Step Act, which Trump signed in 2018, doesn’t go that far, either. For one, it, like the 1994 crime law, concerns the federal prison system. Most of the country’s incarcerated population is in state prisons and local jails.", "However, the law did change mandatory minimums for some federal offenses.", "Jones claimed that “Obama didn’t want to do it,” but part of the 2018 law extended a change enacted under then-President Barack Obama. The Fair Sentencing Act of 2010 reduced a sentencing gap between crack and powder cocaine. (Biden, in 2008, said the disparity — which meant a defendant would need to possess 100 times more powder cocaine than crack to be subject to the same sentence — was “arbitrary, unnecessary, and unjust.”)", "The 2010 law applied to cases going forward, while the 2018 law was retroactive, as the nonpartisan Congressional Research Service explained in a 2019 report. Those affected can “submit a petition in\nfederal court to have their sentences reduced.”", "A 2020 Brennan Center for Justice post said some provisions in the 2018 law, “represent an important decrease in incarceration,” but “there’s still a long way to go.”", "“In some old crack cocaine cases, federal prosecutors are opposing resentencing motions or seeking to reincarcerate people who have just been released,” Ames Grawert, senior counsel with the Brennan Center, wrote in the June 23 post, pointing to a Washington Post investigation.", "Scott claimed that the Republican-crafted Tax Cuts and Jobs Act of 2017 actually increased federal revenue.", "“I know it is critical for us to have a tax code that encourages growth,” Scott said. “We actually saw revenues to the Treasury increase after we lowered taxes in 2017. Rest assured the Democrats do not want you to know that.”", "In nominal dollars, it’s true that federal revenue increased in fiscal years 2018 and 2019 when compared with fiscal year 2017. (The TCJA was signed into law on Dec. 22, 2017.)", "But when factoring for inflation, revenue in FY 2018 was lower than in FY 2017, according to a February analysis done by the Brookings Institution.", "Brookings also found that in FY 2018, actual revenue and revenue as a percentage of gross domestic product were both lower than what the nonpartisan Congressional Budget Office projected they would have been that year without the tax law.", "McDaniel misleadingly summarized the Democratic position on abortion when she said, “Policies that force jobs to flee our country or allow abortion up until the point of birth are not nice.”", "Many Democrats, including Biden, call for codifying Roe v. Wade, the 1973 Supreme Court decision that found the state cannot interfere with a woman’s right to an abortion before the end of the first trimester, but can regulate or prohibit abortions once a fetus becomes viable outside the womb.", "Most states prohibit abortion after certain gestational limits, with exceptions for the health of the mother.", "The notion that Democrats support the termination of advanced pregnancies for any reason gained steam last year when Trump inaccurately described a New York state abortion law and also mischaracterized comments from Virginia Gov. Ralph Northam about a state abortion bill in his state.", "As we explained, the New York law permits abortions after 24 weeks, but only if a health care professional determines the health or life of the mother is at risk, or the fetus is not viable. The Virginia bill, which did not become law, was similarly designed to allow the termination of a pregnancy after the second trimester if a doctor found “the continuation of the pregnancy is likely to result in the death of the woman or impair the mental or physical health of the woman.”", "Most abortions occur early in pregnancy. According to a 2018 Centers for Disease Control and Prevention report, 65.4% of abortions in 2015 were performed within the first eight weeks of pregnancy and 91.1% occurred by 13 weeks. Only 1.3% of abortions were done after 21 weeks.", "Donald Trump Jr. spun two claims related to the travel restrictions on China his father imposed in response to the spread of the coronavirus.", "Donald Trump Jr., Aug. 24: The president quickly took action and shut down travel from China. Joe Biden and his Democrat allies called my father a racist and xenophobe for doing it. They put political correctness ahead of the safety and security of the American people.", "Trump Jr.’s claim that his father “shut down travel from China” overstates the reach of the travel restrictions that were announced by the Trump administration on Jan. 31 and took effect on Feb. 2. The policy prohibited non-U.S. citizens who had traveled to China within the previous two weeks from entering the U.S.", "But there were also a host of exemptions — including for American citizens, permanent residents and the family members of both, and for trade. According to a New York Times report on April 4, nearly 40,000 people had arrived in the U.S. on direct flights from China between the date of that report and the day Trump imposed the travel restrictions.", "As for Trump Jr.’s claims that Biden “called my father a racist and xenophobe” for implementing the travel restrictions, that’s disputed by the Biden camp.", "On the day the White House announced the travel restrictions, Biden did say at a campaign event in Iowa that as the pandemic unfolds, Americans “need to have a president who they can trust what he says about it, that he is going to act rationally about it.” He added, “This is no time for Donald Trump’s record of hysteria and xenophobia – hysterical xenophobia – and fearmongering to lead the way instead of science.”", "The Biden campaign says Biden’s “reference to xenophobia was about Trump’s long record of scapegoating others at a time when the virus was emerging from China,” and that he was not talking about the travel ban. In an April 3 statement, the Biden campaign said Biden supported the administration’s travel restrictions on China.", "Earlier in the convention, Natalie Harp, an advisory board member for the Trump campaign, made the dubious claim that without the “China travel ban” — and, again, it was not a ban — “millions would have died.” There’s no evidence for that.", "Trump echoed that boast in his remarks after being formally nominated as the party’s presidential candidate.", "Trump, Aug. 24: Remember this though, we saved millions because if we didn’t move and if I didn’t put the ban on highly heavily infected people coming to our nation from China, that everybody told me not to do.", "As we’ve written, the body of research on travel restrictions shows they can, if they’re very strict, delay the path of the spread of diseases but do little to contain them. And as for Trump’s claim that “everybody told me not to do it,” Health and Human Services Secretary Alex Azar said it was the “uniform” recommendation of experts in his department.", "“The travel restrictions that we put in place in consultation with the president were very measured and incremental,” Azar told reporters on Feb. 7. “These were the uniform recommendations of the career public health officials here at HHS.”", "At least two speakers on the first night of the convention — Trump Jr. and Guilfoyle — falsely described Biden as an advocate for “open borders.” That’s a gross exaggeration of Biden’s position.", "Trump Jr., Aug. 24: His open border policies would drive wages down for Americans at a time when low-income workers were getting real wage increases for the first time in modern history.", "Guilfoyle, Aug. 24: Biden, Harris and the rest of the socialists will fundamentally change this nation – they want open borders.", "The claim echoes a frequent attack line leveled by Trump at then-Democratic presidential candidate Hillary Clinton back in the 2016 election. It’s as untrue for Biden now as it was for Clinton then.", "Biden supports a more open and welcoming immigration policy than the one championed by Trump. Biden supported the 2013 Senate immigration bill, the so-called Gang of Eight bill, which in addition to providing a path to earned citizenship for those then in the country illegally, would have included significant investments in border security. The bill would have roughly doubled the number of border patrol agents along the Mexican border, added 350 miles of new fencing, and added a host of security and technologies to prevent illegal immigration.", "Biden also supports the programs known as the Deferred Action for Parents of Americans and Lawful Permanent Residents, or DAPA, and the Deferred Action for Childhood Arrivals, or DACA, created by Obama. And Biden has vowed that he will halt construction of any more border wall (though he has stopped short of saying he would dismantle any fencing constructed during the Trump administration).", "But that’s not the same as advocating open borders.", "“I’m going to make sure that we have border protection, but it’s going to be based on making sure that we use high-tech capacity to deal with it. And at the ports of entry — that’s where all the bad stuff is happening,” Biden said in an interview on Aug. 5.", "Haley drew a false comparison in saying Biden “is good” for ISIS but Trump “took on ISIS and won.”", "In fact, about half of the territory held by the Islamic State, also known as ISIS, had been regained under the Obama administration, according to figures provided by the Trump administration.", "In a Dec. 21, 2017, briefing, Brett McGurk, then-special presidential envoy for the global coalition to counter ISIS, said that about 98% of the Islamic State land had been recovered by coalition forces, and 50% of that recovery had happened in 2017. “And significantly, 50 percent of all the territory that ISIS has lost, they have lost in the last 11 months, since January,” McGurk said.", "In March 2019, the Syrian Democratic Forces announced that the final stronghold in eastern Syria had been retaken.", "Estimates of the ISIS-held land vary. Figures from IHS Markit, an analytics and consultancy firm, show a smaller percentage of land recovered under Obama — 33%.", "Haley’s comments echo repeated previous claims by Trump that “we captured 100% of the ISIS caliphate. When I took office, we had almost nothing.” As we’ve explained, that’s false.", "In her remarks, Patty McCloskey, who, along with her husband, is facing felony charges for pointing guns at Black Lives Matter protesters who marched by their St. Louis home in June, falsely suggested that Trump eliminated a federal rule that “forced rezoning” in the suburbs.", "“They’re not satisfied with spreading the chaos and violence into our communities, they want to abolish the suburbs all-together by ending single-family home zoning,” McCloskey said. “This forced rezoning would bring crime, lawlessness and low-quality apartments into now thriving suburban neighborhoods. President Trump smartly ended this government overreach, but Joe Biden wants to bring it back.”", "As we’ve written before, what Trump’s Department of Housing and Urban Development has announced it will end is a 2015 HUD rule that was intended to reinforce a clause of the Fair Housing Act that requires HUD and other federal agencies to “affirmatively” further fair housing in “their programs and activities relating to housing and urban development.” The 1968 law prohibits discrimination in housing.", "A HUD fact sheet at the time defined “affirmatively furthering fair housing” as “taking meaningful actions, in addition to combating discrimination, that overcome patterns of segregation and foster inclusive communities free from barriers that restrict access to opportunity based on protected characteristics.”", "Experts told us the rule didn’t mandate low-income housing or rezoning. In fact, the rule said it “does not impose any land use decisions or zoning laws on any local government.” It established a more structured reporting process by which all jurisdictions that receive funding from HUD would use HUD-provided data and tools to develop a plan to address fair housing issues in their communities.", "Some “jurisdictions might identify” low-income housing or zoning reform “as remedies” to discriminatory housing practices, Robert Silverman, a professor in the University at Buffalo’s urban and regional planning department, told us. But many other methods could also be used, he said.", "Biden’s housing plan says he will implement the Obama administration’s fair housing rule that the Trump administration initially suspended in 2018. The plan also says he would sign legislation requiring states receiving certain federal block grants “to develop a strategy for inclusionary zoning.”", "Editor’s Note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Kiely, Eugene. “A Guide to the Tax Changes.” FactCheck.org. 20 Dec 2017.", "“Remarks by President Trump at Signing of H.R. 1, Tax Cuts and Jobs Bill Act, and H.R. 1370.” White House. 22 Dec 2017.", "“Distributional Analysis of the Conference Agreement for the Tax Cuts and Jobs Act.” Tax Policy Center. 18 Dec 2017.", "Mermin, Gordon B, et al. “An Analysis of Former Vice President Biden’s Tax Proposals.” Tax Policy Center. 5 Mar 2020.", "“The Updated Biden Tax Plan: Budgetary, Distributional, and Economic Effects.” Penn Wharton Budget Model. 10 Mar 2020.", "Longo, Adam. “Congressman says Trump directly involved in removing stimulus funds for Postal Service.” WUSA. 27 Mar 2020.", "Bogage, Jacob and Lisa Rein. “Trump administration considers leveraging emergency coronavirus loan to force Postal Service changes.” Washington Post. 23 Apr 2020.", "“United States Postal Service: A Sustainable Path Forward.” Task Force on the United States Postal System. 4 Dec 2018.", "U.S. House. “H.R., 6800. The Heroes Act.” 12 May 2020.", "Kiely, Eugene. “Trump Proves Biden Right on USPS Funding, Mail-In Ballots.” FactCheck.org. 14 Aug 2020.", "“A new era begins. DeJoy takes oath as Postmaster General.” U.S. Postal Service. 17 Jun 2020.", "Katz, Eric. “Looking to Cut Costs, New USPS Leader Takes Aim at Overtime and Late Trips.” Government Executive. 15 Jul 2020.", "Byrd, Haley et al. “House approves bill to send $25 billion to Postal Service and halt changes.” CNN. 22 Aug 2020.", "Federal Highway Administration. Estimated Time Required to Complete the NEPA Process. Accessed 24 Aug 2020.", "Whitehouse.gov. “Presidential Executive Order on Establishing Discipline and Accountability in the Environmental Review and Permitting Process for Infrastructure.” 15 Aug 2017.", "Whitehouse.gov. “Proclamation on Suspension of Entry as Immigrants and Nonimmigrants of Persons who Pose a Risk of Transmitting 2019 Novel Coronavirus.” 31 Jan 2020.", "Eder, Steve, Fountain, Henry, Keller, Michael H., Xiao, Muyi and Stevenson, Alexandra. “430,000 People Have Traveled From China to U.S. Since Coronavirus Surfaced.” New York Times. 4 Apr 2020.", "Tapper, Jake. “Biden campaign says he backs Trump’s China travel ban.” CNN. 3 Apr 2020.", "Robertson, Lori. “Trump’s Snowballing China Travel Claim.” FactCheck.org. 10 Apr 2020.", "Weixel, Nathaniel. “Trump health officials defend coronavirus quarantine, travel restrictions.” The Hill. 7 Feb 2020.", "Gore, D’Angelo, Robertson, Lori and Kiely, Eugene. “Groundhog Friday.” FactCheck.org. 26 Aug 2016.", "GovTrack. “S. 744 (113th): Border Security, Economic Opportunity, and Immigration Modernization Act.”", "Robertson, Lori. “FactChecking Trump’s Weekend Press Briefings.” FactCheck.org. 10 Aug 2020.", "Biden campaign website. “The Biden Plan for Securing Our Values as a Nation of Immigrants.” Accessed 24 Aug 2020.", "Siders, David. “Biden calls for enshrining Roe v. Wade in federal law.” Politico. 19 Jun 2019.", "“Roe v. Wade.” Oyez. Accessed 25 Aug 2020.", "“An Overview of Abortion Laws.” Guttmacher Institute. Updated 1 Aug 2020, accessed 25 Aug 2020.", "Kiely, Eugene et. al. “FactChecking the State of the Union.” FactCheck.org. 6 Feb 2020.", "Fichera, Angelo. “Addressing New York’s New Abortion Law.” FactCheck.org. 4 Feb 2019.", "Fertel, Isabella. “Meme Misquotes Virginia Governor on Abortion Bill.” FactCheck.org. 15 Feb 2020.", "“Abortion Surveillance — United States, 2015.” Morbidity and Mortality Weekly Report. U.S. Centers for Disease Control and Prevention. 23 Nov 2018.", "“What is hydraulic fracturing?” USGS. Accessed 25 Aug 2020.", "Frazin, Rachel. “Sanders introduces bill to ban fracking.” The Hill. 30 Jan 2020.", "Cama, Timothy and Nick Sobczyk. “Where Biden and Harris differ on the environment, climate.” E&E News. 12 Aug 2020.", "“The Biden Plan for a Clean Energy Revolution and Environmental Justice.” JoeBiden.com. Accessed 25 Aug 2020.", "Gore, D’Angelo. “Misleading Ad Targets Biden on Fossil Fuels, Fracking.” FactCheck.org. 10 Jun 2020.", "McDonald, Jessica. “The Facts on the ‘Green New Deal.’” FactCheck.org. 15 Feb 2019.", "“How Many Jobs Has The Oil And Natural Gas Industry Created?” American Petroleum Institute. Accessed 25 Aug 2020.", "American Petroleum Institute. “Economic Impacts of the Oil and Natural Gas Industry on the US Economy in 2011.” Jul 2013.", "“2020 U.S. Energy & Employment Report.” National Association of State Energy Officials and Energy Futures Initiative. 2020.", "Rieder, Rem. “Trump’s False, Recurring Claim About Biden’s Stance on Police.” FactCheck.org. 21 Jul 2020.", "Rieder, Rem. “Trump’s Deceptive Ad on Biden and Defunding the Police.“ FactCheck.org. 12 Jun 2020.", "Shear, Michael D.; Goldman, Adam; and Cochrane, Emily. “Congressman Steve Scalise Gravely Wounded in Alexandria Baseball Field Ambush.” New York Times. 14 Jun 2017.", "“Police and Corrections Expenditures.” Urban Institute. accessed 25 Aug 2020.", "Biden, Joe. “We must urgently root out systemic racism, from policing to housing to opportunity.” USA Today. 11 Jun 2020.", "Gore, D’Angelo. “Trump Misrepresents Obama-Era Fair Housing Rule.” FactCheck.org. 5 Aug 2020.", "U.S. Department of Housing and Urban Development. “HUD Announced Final Rule on Affirmatively Furthering Fair Housing.” 8 Jul 2015.", "U.S. Department of Housing and Urban Development. “Secretary Carson Terminated 2015 AFFH Rule.” 23 Jul 2020.", "Bureau of Labor Statistics. “Employment, Hours, and Earnings from the Current Employment Statistics survey (National); Total Nonfarm Employment, Seasonally Adjusted.” Data extracted 25 Aug 2020.", "U.S. Bureau of Economic Analysis. “Table 1.1.1. Percent Change From Preceding Period in Real Gross Domestic Product.” Interactive data extracted 25 Aug 2019.", "Business Cycle Dating Committee, National Bureau of Economic Research, Untitled Report determining June 2009 to be the end of a recession and start of an expansion. 20 Sep 2010.", "Business Cycle Dating Committee, National Bureau of Economic Research. “NBER Determination of the February 2020 Peak in Economic Activity.” 8 Jun 2020.", "National Bureau of Economic Research. “US Business Cycle Expansions and Contractions.” Accessed 25 Aug 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]