["Several users on Facebook and Twitter have shared a two-minute video of a woman crying and complaining that the police took her brother away after her neighbour vandalised their house. She claimed that they broke the gate and windows of her house. The woman also alleged that the family was attacked because they are from Bihar. She continues to sob throughout the video.", "Abhijat Mishra, national general secretary of Bharatiya Janata Yuva Morcha (BJYM), BJP’s youth wing, shared the viral video and wrote, “This young woman from Bihar stays in Siliguri in Bengal. But Mamata Banegree’s illegal Muslim immigrants from Bangladesh have attacked her. Look at her condition. Punished for being a Bihari #HinduDieBengalBurns (translated from ये बिहार की युवती, सिलीगुड़ी बंगाल में रहती हैं लेकिन ममता बानो के बंगलादेशी मुस्लिम घुसपैठियों ने इनके घर पर हमला कर दिया इनकी क्या हालत की आप देखिए बिहारी होने की सजा #मरता_हिन्दू_जलता_बंगाल). Mishra’s tweet was retweeted over 11,000 times and the viral video has been viewed over 2.5 lakh times. (archive link)", "ये बिहार की युवती, सिलीगुड़ी बंगाल में रहती हैं लेकिन ममता बानो के बंगलादेशी मुस्लिम घुसपैठियों ने इनके घर पर हमला कर दिया इनकी क्या हालत की आप देखिए", "बिहारी होने की सजा #मरता_हिन्दू_जलता_बंगाल pic.twitter.com/JNU1yLFFiR", "— Abhijat Mishra (@AbhijatMishr) May 13, 2020", "Several people on social media have shared the viral video along with same Hindi text as Mishra’s tweet.", "The video itself raises doubts about the communal angle. Nowhere in the clip does the woman claim that she and her family were attacked by illegal Muslim Bangladeshi immigrants. Here is the complete translation of her claims — “They have taken my younger brother to the police station without saying anything. These people treat us badly, just because we don’t have a father. My mother is a cancer patient. They always do such things. We don’t do anything — they fight us and bully us. They broke our home. from our gate to windows, they have damaged everything. [phone rings] Please help, what should I do? They hurt my mother as well — her hand is bleeding and I can’t even take her to the hospital because they are attacking if we step out. No one is doing anything, everyone is watching the commotion. They are saying — get rid of Biharis, we won’t let Biharis stay. We have purchased land here, don’t we have a right to purchase land in Bengal, being a Bihar? Only Bengalis have the right to purchase?”", "The video hints that the issue might be related to regionalism as opposed to religion.", "On May 14, Siliguri Police Commissionerate’s Facebook page shared a post which said that there is no communal angle to the story. As per the post, “A case has been lodged at Cyber Crime PS against Abhijat Mishra for false propaganda for making the issue a communal in his Twitter account.” The post also informed that the woman in the video is Anuradha Pandey and her family was heckled by Rubi Das and his family on May 12. Thus the social media claim that illegal “Muslim” immigrants from Bangladeshi attacked them is false. Siliguri Police Commissionerate further informed that a complaint was registered at New Jalpaiguri Police Station.", "One lady named Anuradha Pandey @ Anu of Ward no 35 under NJP PS posted one Video in her FB page alleging that she & her…", "Posted by Siliguri Police Commissionerate on Thursday, May 14, 2020", "West Bengal police tweeted a screenshot of the viral video and a screenshot of the Commissionerate’s Facebook post with #FakeNewsAlert on May 14.", "#FakeNewsAlert pic.twitter.com/GMdcVTT2Nr", "— West Bengal Police (@WBPolice) May 14, 2020", "The incident was earlier reported by Siliguri Times which said, “A clash allegedly erupted between two families in the Siliguri Bhaktinagar area over the disposal of garbage. As per the report, several members of the families were injured in the incident.” The article said that Pandey claimed that after protesting against garbage disposal near their house they were beaten up and their house was vandalised by the other family.", "Prior to our fact-check, Facto News has published a report on May 15.", "The viral video was shared with a false communal narrative which was debunked by Siliguri Police Commissionerate and West Bengal police.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]