["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Detroit Mayor Mike Duggan speaks at a press conference about new COVID-19 measures on Monday, November 16, 2020. (Detroit Free Press, Omar Abdel-Baqui)", "Detroit was once a coronavirus hotspot, but in the current phase of the pandemic, the city stands out for its low rate of new infections.", "Detroit’s surrounding suburbs have experienced a surge in coronavirus cases.", "Detroit’s rate is lower than that of the surrounding suburbs but it’s not the lowest in the state.", "In a Nov. 29 interview on Face the Nation, Detroit Mayor Mike Duggan was pressed on the resurgence of the coronavirus across Michigan.", "\"Most new cases of the virus are in and around the city of Detroit,\" host Margaret Brennan said.", "Duggan challenged that premise, responding that Detroit is an outlier compared with the metro area and the rest of the state in the latest phase of the pandemic. \"Detroit actually has the lowest infection rate in the state of Michigan,\" Duggan said. \"We’re half of that of the surrounding suburbs.\"", "Data on infection rates do show that after getting hit hard early, Detroit appears to have done a better job more recently of slowing the spread of the coronavirus than surrounding communities. But Duggan was incorrect in stating that Detroit’s infection rate is the lowest statewide. And while it was running at less than half the rate of the suburban areas in the beginning of November, that’s no longer the case.", "Nonetheless, he said Detroit can be an example for other parts of Michigan dealing with rising caseloads. \"Conventional wisdom at the start of the pandemic was that the most densely populated cities would have the highest infection rates,\" Duggan told PolitiFact Michigan. \"The people of Detroit have proven that widespread testing and masking up is what really matters in fighting the virus.\"", "Denise Fair, Chief Public Health Officer for the city, pointed to a number of factors that have contributed to the city’s low rate of new infections in a recent interview with Bridge Michigan. Among them, Fair mentioned the free drive-thru testing site set up by the city originally located at the State Fairgrounds and free transportation it offered to the site, Personal Protective Equipment shared with small businesses and community outreach and public service announcements regarding the risks associated with the coronavirus and how to prevent its spread.", "While the coronavirus pandemic has affected both urban and rural areas, the onset of the pandemic hit cities and their health systems particularly hard, and Detroit quickly became a hotspot for the coronavirus. At the height of its coronavirus outbreak in the spring, Detroit consistently reported more than 300 cases and dozens of deaths a day.", "Michigan Gov. Gretchen Whitmer responded with strict stay-at-home orders that closed schools and shuttered most businesses. The state also ramped up COVID-19 testing in hard-hit areas.", "Detroit’s testing program, along with businesses’ and residents’ compliance with mask orders, helped slow the rate of infection by mid-summer. But cases are now rising again, not only in Detroit, but across the state.", "Health experts look at the seven-day positivity rate as one key measure of how fast infection is spreading in a community. The seven-day positivity rate is a percentage derived by taking the number of COVID-19 tests that come back positive over the previous seven days and dividing it by the number of tests administered.", "When Duggan made his remarks, Detroit’s seven-day positivity rate was 8.2%, according to the city’s Health Department. That’s above the 5% threshold that the World Health Organizations considered a reasonable level for relaxing certain social restrictions.", "But Detroit was still doing better than surrounding areas. According to the University of Michigan’s MI Safe Start Map, the seven-day positivity rate was 14.9% in Wayne County excluding Detroit, 13.4% in neighboring Oakland County and 17.5% in Macomb County, as of Nov. 25.", "Data from early November show larger disparities in the tri-county area, with positivity rates in Detroit dropping below 5%, less than half the rates outside the city.", "Indeed, the MI Safe Start Map shows that Detroit’s seven-day positivity rate as of Nov. 25 was among the lowest in the state. (The figures include probable cases and exclude cases from correctional facilities.)", "But it wasn’t the lowest, as Duggan stated.", "Some counties in Michigan’s sparsely populated Upper Peninsula posted lower positivity rates during that period, including Alger (4.4%), Houghton (7.7%), Iron (6.7%), Luce (3.6%), Mackinac (4.1%) and Schoolcraft (5%). The population of these six counties — roughly 81,000 — is a small fraction of Detroit’s population of 670,000.", "Rural Emmet (6.1%), Gratiot (5.6%), Leelanau (7.8%) and Mason (7.9%) counties in the Lower Peninsula also recorded seven-day positivity rates on Nov. 25 that were also lower than Detroit’s.", "Even Washtenaw County, just west of Wayne County, had a lower rate: 6.4% as of Nov. 25.", "But Duggan said that the surge in infections in communities surrounding Detroit poses a public health threat to the entire metro area.", "\"We are one region. When Detroit got hit hard in March and April, Detroit patients were sent to outlying suburban hospitals,\" he told PolitiFact Michigan. \"Today, patients from the suburbs are being sent to Detroit hospitals, where we still have capacity. We need everybody in this region to make a real commitment to masking up and social distancing or all of Southeast Michigan will face a real hospital capacity crisis in the coming weeks.\"", "On Nov. 29, Duggan said that Detroit has \"the lowest infection rate in the state of Michigan\" and that the city’s infection rate was half that of its surrounding suburbs.", "According to the seven-day positivity rate available when Duggan made his remarks, Detroit had among the lowest infection rates in the state and a better rate than surrounding areas but its rate was not the lowest in the state or half that of its surrounding communities.", "We rate this claim Half True.", "Nisa Khan and Kristi Tanner contributed to this report.", "Face the Nation, YouTube, \"Detroit Mayor Mike Duggan says U.S. ‘not yet geared up’ for mass vaccinations,\" Nov. 29, 2020", "City of Detroit, Detroit Health Department, COVID-19 Dashboard", "John Roach, Director of Media Relations, City of Detroit, Mayor’s Office, email, Nov. 30", "University of Michigan, MI Safe Start Map, accessed Nov. 30, 2020", "Bridge Michigan, Olivia Lewis and Mike Wilkinson, \"Once a state hotspot, Detroit has one of the lowest rates of coronavirus in Michigan,\" Oct. 6, 2020", "U.S. Census Bureau, Alger County, Population Estimates Program, Jul. 1, 2019", "U.S. Census Bureau, Houghton County, Population Estimates Program, Jul. 1, 2019", "U.S. Census Bureau, Iron County, Population Estimates Program, Jul. 1, 2019", "U.S. Census Bureau, Luce County, Population Estimates Program, Jul. 1, 2019", "U.S. Census Bureau, Mackinac County, Population Estimates Program, Jul. 1, 2019", "U.S. Census Bureau, Schoolcraft County, Population Estimates Program, Jul. 1, 2019", "U.S. Census Bureau, Detroit city, Population Estimates Program, Jul. 1, 2019", "United States Department of Agriculture, Economic Research Service, 2013 Rural-Urban Continuum Codes, last updated Mar. 10, 2013", "The Detroit Free Press, M.L. Elrick, \"Mayor Duggan faults Washington, says it will take months to vaccinate Detroiters,\" Nov. 29, 2020", "Joshua Petrie, Research Assistant Professor, University of Michigan, School of Public Health, email, Dec. 1, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]