["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "As state leaders and the federal government developed plans for how the country would ease restrictions on social distancing amid the COVID-19 coronavirus pandemic in spring 2020, U.S. President Donald Trump repeatedly highlighted in public statements how often — and under what pretense — his administration spoke with governors over the phone. The calls, as he described them at a press briefing on April 20, helped establish \"our unified effort to defeat the virus.\"", "But as his references to the calls grew in March and April, so too did a rumor on social media about how the president framed his communications with governors. By mid-April 2020, hundreds of thousands of Twitter users had liked a tweet reading: \"Trump said that 'HUNDREDS of Governors are calling him.' We only have 50. Think about that. Take all the time you need.\"", "Additionally, numerous Facebook users contacted Snopes to ask about a similar claim on that platform, inquiries that included the following screenshot and a link to a Facebook status that has since been deleted:", "To determine the truth of the claim we studied transcriptions of Trump's public statements in the weeks leading to the viral posting. Between March 1 and April 21, the commander in chief made dozens of public appearances, including press briefings, FOX News interviews and other events. And during those appearances, he made reference to the country's \"governors\" hundreds of times, a Snopes analysis found.", "For example, on March 26, he told conservative political commentator Sean Hannity: \"We had a call today where almost every governor, just about — I would say all 50, just about, and it was like a love fest.\"", "Then, on March 30, he said in a call on the network's show \"Fox and Friends\":", "\"I get on calls, and I get on a lot of the governor calls where we'll have all 50 governors plus where we have some territories also, but we have 50 governors, and I'll tell you what, if you could listen to those calls, you'd never hear a complaint.\"", "Besides the TV media appearances, the president highlighted his communications with state leaders during White House press conferences designed to brief the nation on the federal government's response to the pandemic. During his remarks on April 13, for instance, Trump played a video featuring FOX News clips and apparent statements from \"bipartisan governors\" acknowledging the \"president's support\", and then Trump said:", "\"So we could give you hundreds of clips like that from governors — including Democratic or 'Democrat,' as I call them, governors, which is actually the correct term. We could give you hundreds of clips just like that,\" Trump said. \"But we could have given you — you saw the statements. We have hundreds of statements. Hundreds of statements, including from Democrats and Democrat governors.\"", "Similarly, on April 20, he used both the words \"governors\" and \"hundreds\" in the following statement:", "\"Earlier today, Vice President Pence spoke with governors from all 50 states about our unified effort to defeat the virus,\" Trump said. \"Prior to the call, we provided each governor with a list of the names, addresses, and phone numbers of the labs where they can find additional (COVID-19) testing capacity within their states — many, many labs. ...Hundreds and hundreds of labs are ready, willing, and able.\"", "An analysis of the president's Twitter activity shows he mentioned \"governors\" in 15 tweets within the same time frame, yet nowhere in his feed did he say he's been in contact with more than double the amount of existing U.S. governors.", "Considering the lack of evidence to show Trump made the erroneous statement in any public setting, we rate this claim \"False.\"", "White House.   \"Remarks by President Trump, Vice President Pence, and Members of the Coronavirus Task Force in Press Briefing\".\r\n   20 April 2020.", "Factbase Videos.   \"Interview: Donald Trump Calls In to Fox and Friends for An Interview - March 30, 2020\".\r\n   30 March 2020.", "Factbase Videos.   \"Interview: Sean Hannity Interviews Donald Trump Live Via Telephone - March 26, 2020\".\r\n   26 March 2020.", "White House.   \"Remarks by President Trump, Vice President Pence, and Members of the Coronavirus Task Force in Press Briefing\".\r\n   13 April 2020.", "C-SPAN.   \"President Trump with Coronavirus Task Force Briefing\".\r\n   13 April 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]