["West Bengal Chief Minister Mamata Banerjee suffered injuries to her left leg while campaigning in Nandigram on March 10. She was released two days later with a plaster on her leg. On March 16, several people shared two images of CM Banerjee and claimed that she faked her injury. A picture of the CM in the hospital shows that her injury is on the left leg while another photograph of her exiting the hospital in a wheelchair shows the plaster on her right leg.", "Twitter user @Vasudev00411816 posted these images and wrote, “In Two days Bandage dressing changed from left to right leg! Oscar for Bengal NAUTANKI ?” Facebook users have also shared these images. (1, 2)", "Alt News received several requests on our WhatsApp helpline number (+917600011160) and on our official mobile application to authenticate the claim.", "Image 1: CM Banerjee in hospital", "This image was published by multiple media outlets including The Indian Express on March 11. The image is credited to the Press Trust of India. It shows that the plaster is on the West Bengal CM’s left leg.", "Image 2: CM Banerjee on a wheelchair", "This image was tweeted by The Economics Times journalist Aman Sharma and shows the injury on the same leg.", "#MamataBannerjee is out of hospital pic.twitter.com/1u8NtPGyX2", "— Aman Sharma (@AmanKayamHai_ET) March 12, 2021", "However, the original photograph has been reversed to claim that the plaster was on CM Banerjee’s right leg when she left the hospital.", "Sharma has uploaded multiple images of CM Banerjee since March 12. All of them show that her left leg is injured. (1, 2, 3)", "The CM campaigning today pic.twitter.com/VFL3rqqE38", "— Aman Sharma (@AmanKayamHai_ET) March 16, 2021", "CM Banerjee’s injury shown in the images published by The Print and Zee5 is consistent with the photographs uploaded by Sharma. Video footage in the below NDTV bulletin from March 14 also confirms the same.", "Thus, an image of West Bengal Chief Minister Mamata Banerjee in a wheelchair was flipped horizontally (mirrored) to falsely claim that the dressing on her leg changed from left to right in a matter of two days. A mirror image was also used to falsely portray that JNUSU President Aishe Ghosh had faked her injury after the JNU violence.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]