["About this rating", "Dozens of people in Florida's Flagler County reported finding suspicious packages in their mailboxes containing Easter eggs, pamphlets with pornographic images, and other items.", "However, the explicit images were printed on paper wrapped around the Easter eggs, not tucked inside of them. In each egg was a fish-shaped cracker, a square of toilet paper, and a piece of candy or powdered juice packet.", "From the New York Post to TV news stations, news media nationwide jumped on a story about residents in Florida purportedly finding unsolicited, porn-filled Easter eggs in their mailboxes in April 2020.", "News coverage of the incident began after the Flagler County Sheriff's Office issued a news release April 6, 2020, asking for the public's help in finding the perpetrator.", "Two to three dozen people across the northeastern coastal county had called the office the day before, sheriff's spokeswoman Brittany Kershaw told Snopes, reporting the flags to their mailboxes in the upright position, even though those residents had already received the day's mail. \"They were confused,\" she said. \"People were upset because a lot of times their children went out to check the mailboxes.\"", "After opening the mailboxes, the Florida residents reported finding packages that included colorful plastic eggs, paper pamphlets with text and pornographic images, fish-shaped crackers, toilet paper scraps, and either a piece of candy or powdered juice packet, Kershaw said. Not all people received eggs; some only received the paper pamphlets with explicit images.", "\"The person who did this is not only a very sick individual but could actually be spreading COVID-19 by their actions,” Sheriff Rick Staly said in a news release referring to the coronavirus global pandemic. \"If anyone else receives something like this or has information on who did this, we ask that you call us immediately.\"", "News headlines such as Vice's \"Somebody Is Leaving Porn-Filled Easter Eggs in Florida Mailboxes\" began circulating online, and Twitter did what Twitter does with such a story: magnified it. \"Gives Peeps a whole new meaning,\" user @JoeMontelle replied to the New York Post's story.", "But the stories misreported exactly how the perpetrator distributed the porn: The pamphlets were rapped around the eggs like wrapping paper rather than tucked inside, according to crime-evidence photos obtained by Snopes. \"The pamphlet was folded up and wrapped around the egg,\" Kershaw said. \"In other instances where there was no egg, the pamphlet was just placed in the mailbox.\"", "Instead of porn, each egg contained one fish-shaped cracker, a square of toilet paper, and piece of candy or powdered juice packet, according to the photos.", "The placement of the porn aside, the news coverage continued unabated. And so did the Flagler County Sheriff's Office's investigation. On April 8, deputies arrested a 42-year-old woman who the sheriff's office said admitted to distributing the packages — spurring another round of news stories, such as the New York Post's \"Florida woman admits to stuffing porn-filled Easter eggs in mailboxes.\"", "Kershaw, of the sheriff's office, said the woman told deputies \"she was trying to educate the community on the behaviors of churches.\" The pamphlets called out some local churches and pastors by name, and the pornographic images were \"pretty much everything you can think of ... all different types and very explicit. She was upset that homosexuals were allowed to participate in church.\"", "Authorities arrested the suspect on suspicion of 11 counts of distributing obscene material, among other crimes. Kershaw said deputies had no reason to believe the woman was trying to spread the COVID-19 coronavirus disease that was sweeping across the globe at the time; she tested negative for symptoms of the virus.", "Boyce, Christopher.   \"Florida woman placed 400 pamphlets, porn-filled Easter eggs in strangers' mailboxes, deputies say\"\r\n   KIRO-TV.   9 April 2020.", "Castrodale, Jelisa.   \"Somebody Is Leaving Porn-Filled Easter Eggs in Florida Mailboxes.\"\r\n   Vice.   8 April 2020.", "Garger, Kenneth.   \"Florida woman admits to stuffing porn-filled Easter eggs in mailboxes.\"\r\n   New York Post.   9 April 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]