["“Muslims violence in Birmingham during Ramadan!!! They want to close the road to eat on the roads”. This message has been shared on social media along with a video that shows rioters attacking cars on a street. It has been claimed that the incident occurred in Birmingham, U.K when members of the Muslim community resorted to vandalism as they wanted to ‘eat on the roads’, in a reference to the practice of breaking fast during Ramadan. The video is circulating on YouTube, Twitter and Facebook.", "Renuka Jain, whom PM Modi follows on Twitter, has also shared this video with a similar context. Once again, the manner in which this video and the message has been shared suggests that it may be circulating on WhatsApp, as a large number of individual users have uploaded it on their Facebook timelines with identical or similar text.", "The video has also been uploaded on YouTube with the words “रमजान माह में लंदन में मुस्लिमो का हंगामा” (Violence by Muslims in London during month of Ramzan- translated).", "Alt News broke up the video into individual frames with InVid software for videos, and reverse searched the image via Google. A video demonstration of the fact-check can be seen below. We found that the incident in question occurred not in Birmingham, U.K but in Basel, Switzerland. Also, it has nothing to do with Islam or Muslims.", "The vandalism on display is in relation to a football match between Basel and Lucerne football clubs, and the violence took place on May 19 at Birsstrasse, Basel. According to reports, about 90 persons were involved in rioting and the police has arrested two people. Two people were injured in the clashes that took place. The incident was reported extensively by the media in Switzerland.", "This video is viral not only in India but has also been shared in other parts of the world. In each case, the video has been mischievously placed out of context, blaming some community or the other for this aggression.", "Hooliganism in Brazil", "This video has been shared by a YouTube channel RedeBrasil.NET with the claim that this vandalism took place in Brazil.", "Attack by Pakistanis", "Yet another version projects this incidents as the handiwork of Pakistanis in Birmingham, U.K", "Messages and posts that seek to create a rift among religious communities and reinforce prejudices are commonplace on social media. Old videos and photographs are often shared with provocative and inflammatory messages. Thus, it is not surprising that in the Indian context, this video of vandalism related to football is passed off as rioting by Muslims.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]