["About this rating", "President Donald Trump's short trip to the United Kingdom in July 2018 was accompanied by by protests, political intrigue, and typically intense scrutiny of his demeanor and actions, in particular during his meeting with Queen Elizabeth on 13 July.", "One theory to emerge after the visit was that the Queen had issued a coded, symbolic rebuke to Trump by wearing a brooch that had been gifted to her by Trump's predecessor, former U.S. president Barack Obama.", "The Huffington Post asked, for example, \"Did Queen Elizabeth, the 92-year-old monarch of the United Kingdom, throw some subtle shade at President Donald Trump during his recent U.K. visit?\" explaining that:", "It’s a popular theory that social media users are peddling this week, citing the royal’s interesting brooch choices as evidence. Last Thursday, the day Trump landed in Britain, the Queen was spotted wearing a brooch that was reportedly gifted to her in 2011 by then-President Barack Obama and First Lady Michelle Obama. The pin, a vintage piece made from 14-karat yellow gold, diamonds and moss agate, is known as the American State Visit Brooch.", "Vanity Fair elaborated on that subject as follows:", "The brooch she wore to meet Trump on Friday is the palm-leaf brooch, which the Queen Mother wore at the state funeral for King George VI. The brooch is pictured in the “Three Queens in Mourning” photograph...The brooches the Queen wore on the days adjacent to the Trump meeting are also included as part of the “theory,” since Trump was visiting the U.K. on both of those days, as well.", "On Thursday, she wore the brooch gifted to her by Barack and Michelle Obama in 2011 ... And on Saturday, she wore the sapphire brooch that was a gift from the Canadian people in 2017. As the theory goes, the choice to wear brooches from two of Trump’s slew of “enemies” — the Obamas and Canada — were intended to annoy the president, as well.", "The New York Post ran with the misleading headline \"Queen Elizabeth Wore Gift from Obama During Trump Meeting,\" which the article itself quickly contradicted by explaining that the Queen had worn the \"Obama brooch\" on the day Trump arrived in the UK, but the \"George VI\" brooch during her actual meeting with the U.S. First Couple.", "So headlines such as the New York Post's and the Daily Caller's, stating that Elizabeth II wore a brooch gifted by the Obamas during her meeting with the Trumps, are false.", "More broadly, we can't intuit the motivations behind the British monarch's fashion choices either in general or in these specific cases. The entire \"brooch theory\" is based on the premise that Queen Elizabeth personally doesn't like President Trump and is tacitly signaling her dislike to the public, but no concrete evidence supports that assumption.", "With that theory in mind, we're going to briefly examine the items worn by Queen Elizabeth on the three days of President Trump's visit to the U.K. and scrutinize the stated rationale behind the \"brooch warfare\" theory.", "Queen Elizabeth's jewelry choices are regularly tracked on a blog called \"From Her Majesty's Jewel Vault,\" and the brooch theory was most prominently expounded and promoted on Twitter by a user with the handle SamuraiKnitter.", "Day One -- 12 July 2018", "Trump arrived in the U.K. but did not meet Queen Elizabeth. At Windsor Castle, the Queen hosted the Archbishop of Canterbury, Justin Welby, and Ahmad al-Tayeb, a leading Sunni Muslim cleric and High Imam of al-Azhar in Egypt.", "According to \"From Her Majesty's Jewel Vault,\" on that day Queen Elizabeth wore a brooch given to her by the Obamas during their visit to the U.K. in May 2011. The Obamas purchased the item from the Tiny Jewel Box in Washington D.C., whose website describes it as \"a vintage American-made brooch from 1950 — with 14-karat yellow gold, diamonds and moss agate.\"", "Queen Elizabeth was seen wearing that brooch during a dinner hosted by the Obamas at the U.S. Embassy in London on 25 May 2011:", "Embed from Getty Images", "Below is a photograph of the Queen's visit with Welby and al-Tayeb on 12 July 2018. The image is not entirely clear, but Her Majesty does appear to be wearing that same brooch:", "It was an honour for myself and the Grand Imam of Al-Azhar to be received by Her Majesty The Queen at Windsor Castle today. #GrandImamUK (Photo: @PAImages) pic.twitter.com/JxIQjMtgO1", "— Archbishop of Canterbury (@JustinWelby) July 12, 2018", "It's possible that Queen Elizabeth chose to wear that particular brooch as a rebuke to President Trump, but we've seen nothing other than supposition that would support such a claim.", "Some awkwardness surrounded the initial announcement that U.K. Prime Minister Theresa May had invited President Trump, who is relatively unpopular in the U.K., to visit that country, so the Royal Family could possibly have had a reason to be put out by his trip. Queen Elizabeth also once made an off-hand joke in which she likened the sound of a hovering helicopter to both Trump and Obama. Nonetheless, these facts do not provide evidence of how President Trump is viewed by Queen Elizabeth, who is famous for keeping her personal feelings and political beliefs closely guarded.", "It is at least equally plausible that she simply decided to wear green jewelry to match the green on her dress; or that if her choice of brooch were in any influenced by Trump's visit, she simply chose to mark the occasion of the U.S. president's arrival in the U.K. with a piece of jewelry given to her by the last person to occupy that office.", "Day Two -- 13 July 2018", "Queen Elizabeth met with Donald and Melania Trump at Windsor Castle. The Queen wore a palm leaf brooch that she inherited from Elizabeth, the Queen Mother, upon her death in 2002, as \"From Her Majesty's Jewel Vault\" pointed out:", "Embed from Getty Images", "The purported rationale behind the theory that this choice also represented a rebuke to the U.S. president was laid out on Twitter by SamuraiKnitter:", "Jewel watchers nearly died, because it is the brooch worn in the famous \"Three Queens in Mourning\" photo, worn by the Queen Mum. [Queen Elizabeth] rolled up to tea with the tRUmps wearing the brooch her mother wore to her father's STATE FUNERAL.", "The photograph in question shows Elizabeth II (soon to be crowned), her grandmother Mary of Teck, and her mother Elizabeth (later the Queen Mother), attending the funeral of Elizabeth II's father, King George VI, in 1952.", "The implication here appears to be that Queen Elizabeth, by wearing the same brooch in meeting President Trump that her mother wore to her father's funeral, was symbolically marking the occasion as one of sadness and mourning.", "This theory might have made some sense if these were the only two occasions upon which the brooch was worn, but that is not the case. In fact, according to the blog whose information forms the basis of the \"brooch theory,\" Queen Elizabeth II has worn the \"palm leaf brooch\" on at least 27 other occasions, and it is one of her favorite pieces of jewelry.", "If one claims that Queen Elizabeth were engaging in a symbolic protest or expressing profound sadness by wearing the brooch to her meeting with Trump, one must also explain how she was symbolically protesting or expressing profound sadness at the Chelsea Flower Show in 2010, or in a meeting with Mexican president Enrique Pena Nieto in 2015, or on an official visit to Canada in 2010. Which brings us to the third part of the theory.", "Day Three -- 14 July 2018", "This day President Trump played golf at the Turnberry resort in Scotland, which he owns. Queen Elizabeth II hosted the King and Queen of Belgium at Windsor Castle, and for that occasion she wore a sapphire brooch which Canada's Governor General David Johnston gifted to her in July 2017:", "I was pleased to present the Sapphire Jubilee Snowflake Brooch to Her Majesty The Queen to mark 65 years of her reign. pic.twitter.com/Mbd6JJ9AYy", "— GGJuliePayette (@GGJuliePayette) July 19, 2017", "Queen Elizabeth can be seen wearing the brooch at Windsor Castle in July 2018, below:", "Bezoek aan Hare Majesteit Queen Elizabeth II in Windsor Castle @RoyalFamily pic.twitter.com/dp8SEunvhq", "— Belgian Royal Palace (@MonarchieBe) July 14, 2018", "SamuraiKnitter's explanation as to how Elizabeth again signaled President Trump as he golfed in Scotland, while she met her Belgian counterparts in Windsor, was again laid out in a series of tweets:", "It's called the Sapphire Jubillee Brooch, and it was given to the Queen of England as a gift for ruling for eleventy billion (okay, 65) [years]. From Canada. You know, who Trump's been screaming about and insulting. The commonwealth country and one of the UK's greatest allies. Them.", "The logic here is that by choosing to wear a brooch given to her by Canada's Governor-General, on a day when President Trump was still physically present in the U.K., Elizabeth II (who is Queen of the United Kingdom and Commonwealth countries, not merely England, as SamuraiKnitter falsely stated) was expressing solidarity with Canada as a sideways dig at the U.S. president, who has recently been strongly critical of Canadian Prime Minister Justin Trudeau.", "This might be true, or the Queen might simply have chosen a sapphire brooch to match the blue color in her dress, or picked that particular brooch because it had been almost exactly a year since she was presented with it.", "The second strand to the theory is that Queen Elizabeth may have deployed an ironic subversion of the term \"snowflake,\" a derogatory word typically used online by right-wing commentators to describe liberal adversaries, by choosing a piece of jewelry called the Sapphire Jubilee Snowflake Brooch.", "SamuraiKnitter outlined this second part of the theory in another series of tweets:", "If [Queen Elizabeth] knew the snowflake term, it's absolutely why this brooch was chosen. It's never been worn before and she has always before this worn a diamond maple leaf given to her...I can't possibly begin to guess what the Queen was thinking, but the facts as I know them are thus: 1. [Queen Elizabeth] has a brooch very heavily associated with Canada to the point it really is a signal flag. 2. She did not wear it. 3. She wore a jewel that she had never worn before. 4. That [sic] in the shape of a snowflake, sorta. 5. That was referred to as a snowflake somewhere in the press release about it. 6. [Queen Elizabeth] has amply proven she is a master of brooch warfare.", "This argument is a good example of circular reasoning. SamuraiKnitter claims it is noteworthy that, given that Queen Elizabeth wanted to express solidarity with Canada, she did not choose to wear the maple leaf brooch she typically opts for on occasions associated with Canada, so her choice of a different brooch must have had added significance.", "However, no evidence suggests Queen Elizabeth was attempting to make any statement relating to Canada in the first place. Once other (arguably far more plausible) explanations for her choice are advanced -- such as the brooch's sapphires matching the blue of her dress, for example -- it cannot be accepted as a given that her choice of the Jubilee Brooch had anything to do with Canada.", "Therefore, there is no reason to think that the choice of an unprecedented Canada-related brooch, in particular, has any further symbolic significance, and the \"snowflake\" theory falls down as no more than wild speculation based on very shaky logical premises.", "This is the case even if one accepts that Queen Elizabeth is familiar with the connotations of the term \"snowflake\" and that any expression of solidarity with Canada must necessarily be an oblique attack upon President Trump -- two more assumptions that stretch credulity.", "Queen Elizabeth's brooch choices over the three days of President Trump's visit can easily, and much more plausibly, be explained by other factors, and accepting or speculating that she was engaging in a weekend-long rebuke to the U.S. president requires the acceptance of assumptions that are simply not supported by concrete evidence.", "Order of Splendor.   \"The Maple Leaf Brooch.\"\r\n  From Her Majesty's Jewel Vault.   6 June 2012.", "Mosbergen, Dominique.   \"Queen Elizabeth May Have Shown Some Subtle Shade at Trump During His U.K. Visit.\"\r\n     Huffington Post.   18 July 2018.", "Duboff, Josh.   \"Did the Queen's Brooch Send a Secret Message About Donald Trump?\"\r\n      Vanity Fair.   17 July 2018.", "Lapin, Tamar.   \"Queen Elizabeth Wore Gift from Obama During Trump Meeting.\"\r\n     The New York Post.   18 July 2018.", "Cohen, Julia.   \"The Queen of England Wore the Brooch Obama Gave Her When She Met Trump.\"\r\n    The Daily Caller.  18 July 2018.", "Forani, Jonathan.   \"Did the Queen Commit 'Brooch Warfare' During Trump Visit?\"\r\n    CTV News.   17 July 2018.", "Order of Splendor.   \"Audience at Windsor Castle.\"\r\n     From Her Majesty's Jewel Vault.   12 July 2018.", "YouGov.   \"YouGov Survey Results (RE: Donald Trump) -- Fieldwork 29-30 January 2018.\"\r\n    6 February 2018.", "Selwyn-Holmes, Alex.   \"Three Queens in Mourning.\"\r\n    Iconic Photos.   21 April 2010.", "Order of Splendor.   \"The Queen Mother's Palm Leaf Brooch.\"\r\n    From Her Majesty's Jewel Vault.   11 July 2012.", "Brooks, Libby.   \"Thousands Protest Across Scotland as Trump Plays Golf.\"\r\n    The Guardian.   14 July 2018.", "Bilefsky, Dan and Catherine Porter.   \"Trump's 'Bully' Attack on Trudeau Outrages Canadians.\"\r\n    The New York Times.   10 June 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]