["About this rating", "On 16 November 2019, the MoronMajority.com website published an article positing that President Trump had posthumously pardoned notorious 1960s criminal Charles Manson, who passed away in prison in 2017 while serving out a life sentence:", "Just days after pardoning three service members convicted, or accused, of war crimes, Donald Trump has issued a posthumous pardon to the convicted cult leader, Charles Manson, who died in prison in 2017.", "Asked why he would pardon one of the most hated criminals in American history, Trump replied, “I always thought Charlie got a bum rap. He never killed anyone. It was his followers who committed the crimes.”", "Some are speculating this latest pardon is just another one of Trump’s outrageous acts meant to distract the American public from the ongoing impeachment proceedings. Others believe it is a setup to the much-anticipated pardon of his good friend and self-proclaimed “dirty trickster,” Roger Stone.", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows: \"The purpose of moronmajority.com is to illuminate important political issues through humor and satire.\"", "The MoronMajority.com article was reposted to the Daily Kos political website without the tagging and disclaimers identifying it as satire, and the following month author and presidential candidate Marianne Williamson reportedly tweeted (and then deleted) an outraged response to it as if it were a real news article:", "Deprospo, John.   \"Trump Pardons Charles Manson.\"\r\n    moronmajority.com.   16 November 2019.", "Jaeger, Max.   \"Marianne Williamson Falls for Fake News Story Claiming Trump Pardoned Charles Manson.\"\r\n    New York Post.   9 December 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]