["About this rating", "On 15 April 2019, as firefighters rushed to save the Notre Dame Cathedral in Paris from a fire, a slew of bad actors started to spread an unfounded narrative that blamed the fire on Muslims and connected the incident, which is being investigated as an accident by authorities, to churches that had been recently vandalized in France.", "The Facebook page 1776TV.com, for instance, shared a map that supposedly showed churches \"destroyed\" in France over the last four years:", "This map comes from the christianophobie.fr, a website dedicated to tracking acts of \"Christianophobia\" in France and the rest of the world. While this image is often shared as if it shows all of the churches that were \"destroyed\" in France, this map actually documents a wide range of nefarious activity, such as vandalism, theft, and arson, that occurred at both churches and cemeteries over an apparent span of two years (not four), covering 2017 and 2018.", "It should also be noted that while this map does document some relatively serious crimes, such as arson or the toppling of church statues, many of these pins correspond to graffiti-related incidents. We also found one pin related to a person's simply interrupting a church service.", "This map does not show churches that have been destroyed in France. However, it does correspond with what French authorities have reported concerning vandalism at places of worship in the country.", "Newsweek reported in March 2019 that France had seen a \"spate of attacks\" against Catholic churches:", "France has seen a spate of attacks against Catholic churches since the start of the year, vandalism that has included arson and desecration.", "Vandals have smashed statues, knocked down tabernacles, scattered or destroyed the Eucharist and torn down crosses, sparking fears of a rise in anti-Catholic sentiment in the country.", "In March 2019, France's central criminal intelligence service, SCRC, reported that there were approximately 875 acts of vandalism against Catholic churches in 2018. The Ministry of the Interior came to a similar conclusion.", "The Ministry of the Interior released a report in February 2019 that tallied the number of acts of degradation (or vandalism) against various religious establishments. The Ministry found that there were 1,063 anti-Christian acts in 2018 (approximately 700 of which related to property crimes and 100 of which related to violent acts), 541 anti-semitic acts (81 of which were related to violence, 102 related to property crimes), and 100 anti-Muslim acts.", "The Ministry stated that one reason churches were targeted more frequently than the places of worship of other religions was that France simply had more churches. France is home to approximately 40,000 churches:", "\"The ministry also said that the large number of degrades to Christian sites was partly explained by the higher number of churches compared to the places of worship of the other two religions.\"", "The Ministry noted that attacks on Muslims were at their lowest levels since 2010, attacks on Christians were at the same level as the previous year, and that attacks on the Jewish community rose in 2018.", "Christophe Castaner, minister of the interior, condemned acts of hate against all religious people and places of worship.", "\"Hate has no place in the Republic. We are determined to protect all French people, to protect secularism, the freedom not to believe, as to believe in respect, in complete safety. These numbers show that we must not let our guard down. Anti-Semitic, Islamophobic, anti-Christian, racist, xenophobic: there is no small attack, no small insult. Nothing will be tolerated: every culprit will have to be found and judged.\"", "Chamberlain, Samuel.   \"Notre Dame Cathedral Fire Being Investigated as Accident For Now, Prosecutors Say.\"\r\n    Fox News.   16 April 2019.\r\n\r\nSamuel Chamberlain By Samuel Chamberlain | Fox News", "Tharoor, Ishaan.   \"The Notre Dame Fire Ignites the West’s Far Right.\"\r\n    Washington Post.   17 April 2019.", "Lytvynenko, Jane; Silverman, Craig.   \"A Timeline of How the Notre Dame Fire Was Turned Into an Anti-Muslim Narrative.\"\r\n    Buzzfeed.   16 April 2019.", "McPartland, Ben.   \"'Turn France's Empty Churches into Mosques'.\"\r\n    The Local.   15 June 2015.", "Ministry of the Interior.   \"Fight Against Hatred, Discrimination, Racism and Anti-Semitism.\"\r\n    12 February 2019.", "CheckNews.   \"Is it True That 875 Churches Were Vandalized in France in One Year?\"\r\n    18 April 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]