["The photos were shared here on Facebook on February 1, 2021. It has been shared 4,800 times. The first and third photos show an aerial view of rows of two-storey houses on a vast land area. The second photo shows Erdogan, wearing a face mask, looking at buildings from a helicopter.", "The post's Indonesian-language caption translates to English as: “President Erdogan: I built 70,000 units of elite houses readily available for the Turkish people.", "“Erdogan inspects the construction project of 70,000 elite houses for Turkish people who lost their homes after an earthquake in 2020.”", "The photos have also appeared on Facebook here, here and here; as well as on Twitter here, here and here alongside a similar claim.", "The claim, however, is misleading.", "Erdogan photo", "A reverse image search on Google found the photo of Erdogan was published along with a media statement here, on the official website of the Turkish president, dated January 25, 2021.", "The press statement reads: “President Recep Tayyip Erdoğan made a speech at the 1st Anniversary Commemoration of Elazığ Earthquake and Key Handover Ceremony of Post-Earthquake Houses in Elazığ.", "“Noting that with the 5,500 more residences newly delivered to their owners, a total of 8,000 families have now been provided with new homes, President Erdoğan said: ‘We have built a brand new city that is modern, safe and fully equipped with social facilities for our nearly 100 thousand citizens in Elazığ with an investment of more than 5 billion liras. Turkey, which has built such a large number of top-quality residences in such a short time, is now capable of healing the wounds and redressing the grievances quickly.’”", "A 6.8-magnitude earthquake rocked the Turkish province of Elazig on January 24, 2020, killing dozens and injuring around 1,500 people, AFP reported here.", "Anadolu Agency, Turkey’s state-run news agency, also reported on Erdogan handing over the ownership of the houses for the quake victims here on January 25, 2021.", "Below is a screenshot comparison of the Erdogan photo in the misleading post (L) and his photo in the Turkish presidency website (R):", "Housing photos", "Reverse image searches found the other two photos were published in this press release of the government-run Konya Water and Sewage Company (KOSKI) in the Turkish city of Konya.", "Below is a screenshot of the article on the KOSKI website:", "According to the January 25, 2021, media statement, the Konya municipal government just completed the water and sewerage network for the new homes they are building for the residents of Dedemli village, which will be underwater after the Bozkir Dam opens.", "The construction of the new homes in Konya was also reported by Ruptly TV and Konya municipality government.", "Below are screenshot comparisons of the two housing photos in the misleading post (L) and the photos in the KOSKI website (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]