["About this rating", "Although recent events have inspired an email-circulated version featuring a soldier serving in Afghanistan, the tale about a serviceman using a deck of ordinary playing cards as an aid to prayer and meditation dates at least to at least 1788.", "Deck of Cards", "A young soldier was in his bunkhouse all alone one Sunday morning over in Afghanistan. It was quiet that day, the guns and the mortars, and land mines for some reason hadn't made a noise. The young soldier knew it was Sunday, the holiest day of the week. As he was sitting there, he got out an old deck of cards and laid them out across his bunk.", "Just then an army sergeant came in and said, \"Why aren't you with the rest of the platoon?\"", "The soldier replied, \"I thought I would stay behind and spend some time with the Lord.\"", "The sergeant said, \"Looks like you're going to play cards.\"", "The soldier said, \"No sir, you see, since we are not allowed to have Bibles or other spiritual books in this country, I've decided to talk to the Lord by studying this deck of cards.\"", "The sergeant asked in disbelief, \"How will you do that?\"", "\"You see the Ace, Sergeant, it reminds that there is only one God.\nThe Two represents the two parts of the Bible, Old and New Testaments.\nThe Three represents the Father, the Son, and the Holy Ghost.\nThe Four stands for the Four Apostles: Matthew, Mark, Luke and John.\nThe Five is for the five virgins that were ten but only five of them were glorified.\nThe Six is for the six days it took God to create the Heavens and Earth.\nThe Seven is for the day God rested after working the six days.\nThe Eight is for the family of Noah and his wife, their three sons and their wives, in which God saved the eight people from the flood that destroyed the earth for the first time.\nThe Nine is for the lepers that Jesus cleansed of leprosy.  He cleansed ten but nine never thanked Him.\nThe Ten represents the Ten Commandments that God handed down to Moses on tablets made of stone.\nThe Jack is a reminder of Satan. One of God's first angels, but he got kicked out of heaven for his sly and wicked ways and is now the joker of eternal hell.\nThe Queen stands for the Virgin Mary.\nThe King stands for Jesus, for he is the King of all kings.", "When I count the dots on all the cards, I come up with 365 total, one for every day of the year. There are a total of 52 cards in a deck, each is a week, 52 weeks in a year.", "The four suits represents the four seasons: Spring, Summer, Fall and Winter. Each suit has thirteen cards, there are exactly thirteen weeks in a quarter.", "So when I want to talk to God and thank Him, I just pull out this old deck of cards and they remind me of all that I have to be thankful for.\"", "The sergeant just stood there and after a minute, with tears in his eyes and pain in his heart, he said, \"Soldier, can I borrow that deck of cards?\"", "The popular song \"Deck of Cards\" (sometimes known as \"A Soldier's Prayer Book\") was written in 1948 by \"T.\" Texas Tyler and was recorded by (among others) Tex Ritter in 1948, Wink Martindale in 1959, and Bill Anderson in 1991.", "In that 1948 musical offering, the story is set during World War II and stars a soldier whose outfit, which has been fighting in North Africa, is newly arrived at Casino. One Sunday morning, some of the soldiers in that unit go to church; those who have prayer books read them during the service, but one soldier pulls out a deck of cards, prompting his sergeant to haul this apparent blasphemer before the provost marshal. In the emailed version of fifty-five years later, certain details about this prologue to the cards' meanings have been updated to better fit the current climate: the soldier sits alone in a bunkhouse rather than with his buddies in church because he's in a non-Christian country, and he turns to his deck of playing cards not because of a shortage of prayer books for the congregation but because Bibles are supposedly banned in Afghanistan. Once those scene-setting details are out of the way, the two versions dovetail, with the meanings of each of the cards agreeing from one version to the other.", "Differences between the two versions aside, is it an account of an actual event? The 1948 song concludes with \"Friends, I know this story is true, because I knew that soldier,\" a statement that on the surface would seem to confirm the veracity of the narrative. However, tellers of tales do sometimes add flourishes of such nature to their offerings, especially those of an inspirational or tear-jerking nature.", "Moreover, a broadsheet titled \"The Soldier's Prayer-Book\" which recounts the same story as the 1948 song \"Deck of Cards\" appears in an 1865 book about the history of playing cards. French versions of the tale were printed in 1778 and 1809. Throughout the years the story about the soldier, his playing cards, and his explanation of their meanings to a superior he's been brought before has gone by many names: Deck of Cards, The Soldier's Prayer Book, Cards Spiritualized. Some of the meanings assigned to the pasteboards have changed too: the queen symbolized the Queen of Sheba instead of Mary, and the jack was a knave. The older versions also mention the deck being divided into thirteen ranks, one for each (lunar) month, a detail dropped from more contemporary versions in recognition of modern society having moved away from the lunar calendar.", "Some point out that if you count up all the spots on the cards, you come up with only 364, not the 365 claimed. The 1865 version contained an explanation for that, which has also been dropped from newer accounts:", "When I count how many spots there are in a pack of cards, I find there are three hundred and sixty-five, there are so many days in the year.", "Stop, said the mayor that is a mistake. I grant it, said the soldier, but as I have never yet seen an Almanack that was teoroughly [sic] correct in all points it would have been impossible for me to have imitated an Almanack exactly without a mistake. Your observations are very correct said the mayor. Go on.", "Given that the tale has been in print since 1778, if the author of the 1948 song \"knew that soldier,\" as he claimed in the final line of the song, he was very long-lived indeed.", "Other catechism-type songs have been around for centuries. One such musical delight many (erroneously) think falls into this category is \"The 12 Days of Christmas,\" but a genuine example of the genre is \"A New Dial,\" a question-and-answer song dating to at least 1625, which assigns religious meanings to each of the twelve days of Christmas:", "What are they that are but one?\nWe have one God alone\nIn heaven above sits on His throne.", "What are they which are by two?\nTwo testaments, the old and new,\nWe do acknowledge to be true.", "What are they which are but three?\nThree persons in the Trinity\nWhich make one God in unity.", "What are they which are but four\nFour sweet Evangelists there are,\nChrist's birth, life, death which do declare.", "What are they which are but five?\nFive senses, like five kings, maintain\nIn every man a several reign.", "What are they which are but six?\nSix days to labor is not wrong,\nFor God himself did work so long.", "What are they which are but seven?\nSeven liberal arts hath God sent down\nWith divine skill man's soul to crown.", "What are they which are but eight?\nEight Beatitudes are there given\nUse them right and go to heaven.", "What are they which are but nine?\nNine Muses, like the heaven's nine spheres,\nWith sacred tunes entice our ears.", "What are they which are but ten?\nTen statutes God to Moses gave\nWhich, kept or broke, do spill or save.", "What are they which are but eleven?\nEleven thousand virgins did partake\nAnd suffered death for Jesus' sake.", "What are they which are but twelve?\nTwelve are attending on God's son;\nTwelve make our creed. The Dial's done.", "More legends and superstitions about the meaning of various combinations of cards can be found here.", "Glabb, Charles.   \"His Prayer Answered.\"\r\n    The Toronto Star.   26 November 1995   (p E4).", "Jones, Rebecca.   \"God Deals Deck of Cards.\"\r\n    Denver Rocky Mountain News.   9 May 1999   (p. D12).", "Osborne, Jerry.   \"Country Hit's Faith is in the Cards.\"\r\n    Chicago Sun-Times.   26 July 1996   (Weekend Plus; p. 22).", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]