["The doctored photo appeared after a suicide attack killed more than 40 Indian soldiers in Kashmir on February 14, 2019.", "It purports to show Gandhi next to a man who local media have identified as Aadil Ahmad of the Pakistan-based militant group Jaish-e-Mohammed (JeM), and responsible for the bombing. Here is one of those local media reports.", "Here is an AFP report from February 16, 2019, on the incident that also includes a reference to Ahmad being identified as the accused bomber.", "Below is a screenshot of the doctored photo posted to Facebook. Rahul Gandhi is on the right, wearing the cap.", "The Hindi text above the photos claims that Gandhi is a friend of the perpetrator of the attack and questions whether the opposition Congress party was involved.", "The doctored photo was also posted on Twitter, including here. Below is a screenshot of the misleading tweet.", "AFP did a reverse search of the image on Google, which showed many results of a photo of Gandhi in the same pose and same attire but next to someone who does not look like the man identified as the suicide bomber.", "AFP then did a second reverse image search on the highest resolution version of the photo that was found on the initial search. This led here to the original on the website of international photo agency Getty Images.", "Below is a screenshot of the photo on Getty's website.", "The caption alongside the photo on Getty states it was taken by a Hindustan Times photographer of  Gandhi in Barabanki, in the northern state of Uttar Pradesh, on the campaign trail for 2014 elections.", "The man standing beside Gandhi is clearly not Ahmad.", "This AFP fact check was published after several other fact checking organisations, including Boom,  The Quint and The Times of India, had debunked the photo with similar results.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]