["About this rating", "Former Miss Universe Alicia Machado made an allegedly risqué appearance on a TV reality show and was pictured topless in Playboy magazine.", "Alicia Machado has not starred in a series of pornographic films.", "During the first presidential debate between Donald Trump and Hillary Clinton on 26 September 2016, the latter noted that her opponent had made several highly public sexist remarks over the course of his career. One instance cited by Clinton occurred in 1996, when Trump called the recently crowned Miss Universe, Alicia Machado of Venezuela, \"Miss Piggy\" due to her post-pageant weight gain:", "CLINTON: This is a man who has called women pigs, slobs and dogs, and someone who has said pregnancy is an inconvenience to employers, who has said...", "TRUMP: I never said that.", "CLINTON: .... women don’t deserve equal pay unless they do as good a job as men.", "TRUMP: I didn’t say that.", "CLINTON: And one of the worst things he said was about a woman in a beauty contest. He loves beauty contests, supporting them and hanging around them. And he called this woman “Miss Piggy.” Then he called her “Miss Housekeeping,” because she was Latina. Donald, she has a name.", "TRUMP: Where did you find this? Where did you find this?", "CLINTON: Her name is Alicia Machado.", "Despite suggesting during the debate that he had said no such thing, Trump defended his 1996 remarks about Machado the following day:", "Trump didn't mention Machado's name but did discuss the 1996 Miss Universe winner, who gained a purported 42 pounds after being crowned. \"She was the worst we ever had. The worst. The absolute worst,\" Trump, who was an owner of the pageant, said. \"She was impossible. She was a Miss Universe contestant and ultimately a winner, who they had a tremendously difficult time with as Miss Universe.\"", "Shortly afterwards, various web sites began reporting that Machado, the former Miss Universe, had also \"appeared in pornographic videos\":", "Former Miss Universe winner Alicia Machado, who has been campaigning against Republican nominee Donald Trump for the Hillary Clinton campaign, has appeared in pornographic videos.", "Snippets of an adult film starring Machado are available on multiple free porn websites. Machado also appeared topless in Mexican Playboy in 2006 and 2012. Hillary Clinton invoked the 1996 Miss Universe winner in an attack on Trump during Monday’s debate.", "However, although searching on terms such as \"Alicia Machado Porn Star\" turns up several videos from free porn web sites, these videos don't actually star Alicia Machado:", "It should come as no surprise that celebrity nude photographs and sex videos drive major traffic on the Internet. But when legitimate photographs or videos are not available, hoaxsters often resort to creating their own. In some cases, this involves Photoshopping a famous face onto a nude or near-nude body (as was done with Sarah Palin),  or changing the title of a sex video if it features a porn actress who bears a resemblance to a celebrity", "The latter is the case with Alicia Machado. In 2009, a video clip purportedly showing the former Miss Universe winner engaging in anal sex was circulated online, and that is the clip that now most frequently shows up in response to web searches on the phrase \"Alicia Machado porn.\" However, the woman seen in that video is not Alicia Machado — the clip was taken from the 2004 DVD Apprentass 4, which features porn actress Angel Dark, and was later retitled to suggest it showed Alicia Machado:", "The two women bear a superficial resemblance to each other, but the woman in the film referenced above looks more like Angel Dark (first picture below) than Alicia Machado (second picture below):", "Machado is also often described as having been in a \"sex tape,\" a claim that stems from her 2005 appearance on the Spanish reality show La Granja (similar to the United States' The Real World), which she was reportedly kicked off of after being filmed having sex with another cast member:", "The romantic relationship between Alicia Machado and her fellow Venezuelan, baseball player Bob Abreu, is finished. The breakup was announced by the athlete himself in an interview with the Telefutura cable network.", "The remarks followed a scandal that erupted over Machado's appearance on the Spanish television program La Granja. In the course of that reality show, the former Miss Universe and Spanish actor Fernando Acaso were filmed having sex. After the incident, the Venezuelan actress and singer was booted from the program, and two weeks ago she apologized on the air to her boyfriend.", "\"I never thought things would happen like that. [Fernando] behaved very respectfully towards her as a woman\" Abreu says.  He also said that Machado would now have to think things through. Abreu emphasized that he is no longer Machado's boyfriend and said their relationship had ended before Machado went to Spain to participate in La Granja.", "However, the so-called \"sex tape\" stemming from that incident is perhaps the tamest video ever to be so termed, consisting of nothing more than some grainy, night-vision footage of a couple of covered figures writhing in a bed.  And reality television being what it is, the scene the tape depicts was quite possibly staged or fabricated.", "Alicia Machado did pose topless for Playboy magazine, though.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]