["About this rating", "On 20 December 2018, a counterfeit website posing as that of US Weekly published an article reporting that singer Kelly Clarkson had been fired from the television show The Voice. This website (gainestylist.com) used the same color scheme as US Weekly and put the celebrity magazine's logo in their header in order to deceive readers into thinking they were reading a genuine report from a real news outlet:", "But this was no genuine news article. The fabricated, attention-grabbing story was merely a gateway to an advertisement for an \"over-the-counter natural supplement.\"", "The first few paragraphs of this junk news article focused on the imaginary events that supposedly led to Clarkson's firing. The remainder of the article, however, touted the benefits of a diet pill that, according to the events of this fictional universe, helped Clarkson shed some weight:", "(Us Weekly News) – Competition on The Voice is heating up but fans were shocked after finding out that Kelly Clarkson was fired. NBC confirmed that they fired Clarkson but wouldn't comment further. Why the sudden departure for a judge who has only been with the show for two seasons? Did a jealous colleague get Kelly fired?", "What Really Happened?", "The drama all started when Jennifer Hudson was announced to be replaced by John Legend in the upcoming season. Hudson who was bitter about the replacement, claims she saw Kelly Clarkson taking some unknown pills backstage and reported it to NBC producers citing that it might be illicit drugs. Executives at NBC noticed that Kelly was losing weight at a rapid pace which left them with many questions about how exactly she was doing it. Pressure from Hudson for NBC to find out what was going on forced producers to terminate Clarkson's contract because they couldn't ask her straight up because of privacy issues nor have one of their stars taking drugs.", "After the extremely baseless accusations from NBC (and Jennifer Hudson), Clarkson finally fired back with her side of the story in an interview with Ellen. The TV star cleared the air and assured fans that she was not taking drugs, but what they saw her taking on set was Keto, an over-the-counter natural supplement she's been taking to lose weight.", "Clarkson was not fired from The Voice, she did not endorse (or use) this diet pill, and US Weekly did not publish reports of either activity.", "This isn't the first time a bogus website has used junk news and an imaginary celebrity endorsement to sell a questionable product. We've previously covered scams claiming that Melissa McCarthy had endorsed a diet pill, that Denzel Washington, Tiger Woods, and Jamie Foxx had touted a brain supplement, and that Ellen DeGeneres was quitting her show to start a skin-care line.", "You can read more about these celebrity endorsement scams here.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]