["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump speaks at the 2019 House Republican Conference Member Retreat Dinner in Baltimore Sept. 12, 2019. (AP)", "President Donald Trump, eager to make good on a campaign promise to end the United States’ reliance on foreign energy, claimed a premature victory.", "\"We are ending decades of foreign energy reliance to unleash the blessings of American energy independence,\" Trump said Sept. 12 at a dinner with the House Republican Conference in Baltimore.", "Moments later, Trump declared: \"We are very energy independent.\"", "While it’s not accurate to say the United States has already kicked its reliance on foreign sources of energy, the country is moving in this direction.", "The White House did not define energy independence when we asked. So we'll go with the generally agreed upon definition: producing as much energy as is consumed domestically.", "Several recent months have seen U.S. energy production outstrip consumption — which supports Trump’s claim. But overall, the data cuts against the notion that the United States is \"very energy independent.\"", "In the first five months of 2019, the United States used more energy than it produced. Specifically, the country produced 41.5 quadrillion British thermal units of energy, but consumed 42.1 quadrillion BTUs, according to the most recent data from the Energy Information Administration.", "Some individual months have seen the United States achieve \"energy independence,\" in the sense of producing more energy than Americans consumed. Two months in fall 2018 did so, and the United States produced more than it consumed in April and May of this year.", "The United States has been a net energy importer since 1953. But according to the Energy Information Administration, that’s likely to soon change. The EIA projects that with continued growth in American petroleum and natural gas exports, plus slow growth in U.S. energy consumption, the country is on track to become a net energy exporter by next year.", "Data from the last decade points to the country trending in that direction too. The gap between U.S. energy production and consumption has been narrowing for some time, and achieved even greater parity during Trump's presidency.", "That said, some experts argue it’s not in the United States’ best interest to be totally disengaged from the foreign energy market — for instance, when hurricanes in the Gulf threaten domestic sources.", "\"Without energy imports, we could not run our system optimally,\" said Frank Verrastro, an energy and national security expert at the Center for Strategic and International Studies.", "Still, given Trump’s campaign promise to achieve energy independence, he’s eager to claim a victory — and his claim may be on ever sturdier ground as Election Day 2020 approaches. But to say the United States right now is \"very energy independent\" is a touchdown celebration before reaching the end zone.", "Trump said the United States is \"very energy independent.\"", "It’s somewhat premature to label the United States energy independent given that Americans consumed more energy than the country produced for most of the last year that we have data. But the gap between U.S. energy production and consumption has been narrowing for some time, particularly during Trump’s presidency, and data shows several recent months where production outpaced American energy use.", "We rate this Half True.", "Speech by President Donald Trump, Sept. 12, 2019", "U.S. Energy Information Administration, \"Monthly Energy Review,\" Aug. 27, 2019", "U.S. Energy Information Administration, \"Annual Energy Outlook 2019,\" Jan. 24, 2019", "PolitiFact, \"Trump-O-Meter: Achieve energy independence,\" Dec. 8, 2017", "Email interview with Frank Verrastro, an energy and national security expert at the Center for Strategic and International Studies, Sept. 13, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]