["About this rating", "On 23 February 2017, a number of disreputable web sites, including PamelaGeller.com and TruthMonitor.com, posted stories reporting that Sweden had been \"rocked\" by a terrorist attack which involved a man throwing a fume-releasing canister into a train car. The stories were topped by headlines such as \"MASSIVE TERROR ATTACK ROCKS SWEDEN — Trump Was Right ...\":", "Liberals have spent the last few days mocking Donald Trump for claims he made that Sweden was suffering violence at the hands of Muslim migrants. The mainstream media claimed that Trump made this up from nothing, but what just happened in Sweden proves the president was right about what he said ...", "The UK Express reported that the city of Stockholm, Sweden was rocked by a terrorist attack when a masked man boarded a subway train and doused liquid on the passengers as the carriage doors slammed shut, trapping everyone inside. The attack occurred at Sankt Eriksplan station in the Swedish capitol.", "A spokesman for Swedish police confirmed an incident occurred on a train in Stockholm, but it was not related to terrorism and no one was hurt. Swedish newspapers including Aftonbladet published reports on the incident written by TT, a national wire service, stating the incident took place at about 9 p.m. at the Fridhemsplan subway station in central Stockholm, when a person dressed in dark colors sprayed a noxious substance into a train car.", "Neither the local news report nor the one from Express UK declared that the incident was a \"terrorist attack,\" much less one of a \"massive\" scale. The reports noted that victims experienced short-term breathing troubles, and the incident caused a temporary panic on the train:", "One witness, Alexander, 22, was on his way home from work and sat far back in the subway car when he noticed that people started to scream.", "He said: \"Suddenly lots of people were running back toward me. They kept both their mouth and eyes closed and cried and coughed.", "\"It seemed like pepper spray, or whatever it was that was thrown out, and we got huge respiratory problems.", "\"Then when the train arrived at Fridhemsplan they evacuated it.\"", "The detalis of the incident on Swedish train did not support claims the country had been \"rocked\" by a \"massive terrorist attack.\" The claim was reported in what appeared to be an effort by partisan and anti-Muslim publications to shore up statements made by President Donald Trump during a speech in Florida, in which he said:", "We've got to keep our country safe. You look at what's happening in Germany. You look at what's happening last night in Sweden. Sweden, who would believe this? Sweden. They took in large numbers. They're having problems like they never thought possible.", "Although the incident was not terror-related and no information has been released regarding the identity or nationality of the suspect, the episode has nevertheless resulted in increased scrutiny over crime and migration trends in Sweden.", "Miller, David.   \"MASSIVE TERROR ATTACK ROCKS SWEDEN – Trump Was Right ...\"\r\n   TruthMonitor.com.   23 February 2017.", "Geller, Pamela.  \"Terror in Sweden: Train Passengers in PANIC, CAN’T BREATHE, After Masked Man Throws Poisonous Liquid on Them.\"\r\n    PamellaGeller.com.   21 February 2017.", "Dassanayake, Dion, et al.   \"Train Passengers in Sweden Have ‘Breathing Problems’ After Liquid Thrown on Them.\"\r\n    Express UK.   22 February 2017.", "Ringstrom, Anna, and Jeff Mason.  \"Trump Baffles Sweden with Crime Comment, Says It Was Based on TV Report.\"\r\n    Reuters.   22 February 2017.", "TT.   \"Details: Uppgifter: Vätska Orsakade Andnöd i t-Bana.\"\r\n    Aftenbladet.   21 February 2017.", "FoxNews.com.   \"Ami Horowitz Defends Sweden Refugee Claims from Backlash Over Trump Remark.\"\r\n    21 February 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]