["About this rating", "Hunter Biden was discharged from the U.S. Navy Reserve after testing positive for cocaine.", "Hunter Biden received an administrative discharge, which is a form of discharge that does not include the \"dishonorable\" classification.", "During the contentious debate between U.S. presidential candidates Donald Trump and Joe Biden on Sep. 29, 2020, Biden referenced an article from The Atlantic where he took a shot at Trump, who supposedly referred to veterans who died in combat as being \"suckers\" and \"losers.\" When Biden spoke of his own son's military service, the following exchange took place:", "BIDEN: And speaking of my son, the way you talk about the military, the way you talk about them being losers and being, and just being suckers. My son was in Iraq. He spent a year there. He got, he got the Bronze Star. He got the Conspicuous Service Medal. He was not a loser. He was a patriot. And the people left behind there were heroes ...", "TRUMP: Really? You talking about Hunter? Are you talking about Hunter?", "BIDEN: ... and I resent -- I’m talking about my son, Beau Biden. You’re talking about ...", "TRUMP: I don’t know Beau. I know Hunter. Hunter got thrown out of the military. He was thrown out, dishonorably discharged for cocaine use.", "BIDEN: That's not true, he wasn’t dishonorably discharged. None of that is true.", "Joe Biden was speaking of his late son Beau, who as a member of the Delaware Army National Guard was deployed to Iraq in October 2008, where he remained for a year and received a Bronze Star Medal for his service (later passing away of brain cancer in 2015.) Trump, however, tried to shift the conversation to Biden's other son, Hunter, who served in the Navy Reserve, claiming that he \"got thrown out of the military\" and was \"dishonorably discharged for cocaine use.\"", "As reported in 2014, Hunter Biden was commissioned as an ensign by the Navy Reserve in 2012, when he was 42 years old:", "Hunter Biden, an ensign, [was] selected for commission as a reserve officer through the Direct Commission Officer program in 2012, according to Cmdr. Ryan Perry, a Navy spokesman. He was commissioned into the Navy Reserve unit for Navy Public Affairs Support Element East in Norfolk, Va. Biden, who had no prior military experience, was one of six officers commissioned nationally into the Navy Reserve public affairs division.", "Applicants to the direct commissioning program for the Public Affairs Reserve must hold a baccalaureate degree or higher from an accredited institution, preferably in the fields of communication, English, journalism, broadcasting, public relations, rhetoric/speech, marketing, international studies or public administration. Applicants may not have passed their 42nd birthday at time of commissioning or an age waiver is required. The board meets twice annually and, on average, about 35 people apply, Ryan said.", "Hunter Biden sought and received a waiver to join the service because of his age.", "The Wall Street Journal also reported that Biden had \"received a second Navy waiver because of a drug-related incident when he was a young man, according to people familiar with the matter.\"", "Hunter Biden's tenure in the U.S. Navy Reserve was a short one. In October 2014, the news broke that he had failed a drug test for cocaine in June 2013, and he was discharged in February 2014 (we note that it is more common to use the term \"dismissed\" instead of \"discharged\" for commissioned officers such as Biden, but in practical terms they refer to the same types of action). So, it is true, as Trump claimed, that Biden was discharged from the Navy for drug use. But it is not true, as Trump also claimed, that Biden's discharge was a \"dishonorable\" one.", "As the VA.org website (not affiliated with the U.S. government) observes, the U.S. military utilizes two forms of discharge — administrative and punitive. A dishonorable discharge is a form of punitive discharge:", "Many people are under the impression that military discharge comes in one of two forms: honorable or dishonorable. If an enlisted person received less than an honorable discharge they are often under the impression that they received a dishonorable discharge. However, to be clear, you would absolutely know if you received a dishonorable discharge ... it is designed to ruin your life ever after and is often accompanied by an extensive visit to a military prison.", "THERE ARE TWO FORMS OF MILITARY DISCHARGE", "1. Administrative – This form of discharge is given by the discharge authority, often a commanding officer of high rank.", "2. Punitive – This form of discharge is imposed by a court-martial.", "Dishonorable Discharge:", "This type of discharge is the worst anyone in the military can receive. It can only be given by a general court-martial for the highest of offenses, which are often accompanied by a prison sentence in a military prison.", "However, Dishonorable Discharges are generally only rendered for the most serious of offenses (e.g., treason, espionage, desertion, sexual assault, murder), not for drug offenses, and they require conviction at a general court-martial, something which did not take place in Biden's case. When news broke of his discharge, Biden acknowledged in a statement that it had been an administrative one:", "“It was the honor of my life to serve in the U.S. Navy, and I deeply regret and am embarrassed that my actions led to my administrative discharge,” Hunter Biden said in a statement distributed through his lawyer. “I respect the Navy's decision. With the love and support of my family, I'm moving forward.”", "[A] person familiar with the case said he “was treated no different than any other sailor.”", "Hunter Biden's discharge was therefore certainly not a dishonorable one, but most likely a general discharge, or an other than honorable discharge:", "General Discharge (under honorable conditions)", "This is often referred to as a general discharge and is bestowed upon those whose serve was faithful and honest in spite of some trouble -- as determined by the commander. You might receive this discharge if you were discharged on the basis of:", "o failure to maintain military standards in weight\no failure to maintain military standards in fitness\no failure to maintain military standards in dress\no failure to maintain military standards in appearance\no failure to progress in your training\no you received minor disciplinary infractions", "Other Than Honorable Discharge", "Of all the administrative discharges this is the worst. This is warranted if your discharge was for a pattern of bad behavior. This can include:", "a pattern of continued misconduct\nan act of serious misconduct\nabuse of authority\nfraternization", "Martinez, Luis and Arlette Saenz.   \"Joe Biden's Son Hunter Biden Discharged from Navy After Positive Cocaine Test.\"\r\n    ABC News.   16 October 2014.", "Nelson, Colleen McCain and Julian E. Barnes.   \"Biden’s Son Hunter Discharged from Navy Reserve After Failing Cocaine Test.\"\r\n    The Wall Street Journal.   16 October 2014.", "Murray, Shailagh.   \"Biden's Son Off to Iraq.\"\r\n    The Washington Post.   20 August 2008.", "McMichael, William H. and Jonathan Starkey.   \"Biden's Son Fails Drug Test, Is Discharged from Navy.\"\r\n    USA Today.   17 October 2014.", "VA.org.   \"Forms of Military Discharge.\"\r\n    Accessed 4 July 2015.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]