["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "It's been nearly 50 years since a sitting senator, John F. Kennedy, has won the presidency, and Barack Obama's recent TV ad assailing John McCain's education record is a good example why.", "Senators, especially those with long tenures like McCain, have to take a lot of votes and state a lot of positions, all of which can later be used against them – even if the bulk of the senator's record points to a different conclusion than the attacker's.", "That's certainly the case with Obama's ad, which claims, among other things, that McCain \"voted to cut education funding, against accountability standards. He even proposed abolishing the Department of Education.\"", "In each case, there's an example or two bolstering Obama's claims, but there are other examples in McCain's nearly 22 years in the Senate, more telling, that show that McCain generally supports increased funding for education, stronger accountability standards and a more powerful Education Department.", "On the first point, the Obama campaign cites a number of examples where McCain didn't support large increases in education funding backed by Democrats, but only one case in which McCain actually \"voted to cut education funding,\" as the ad alleges.", "It came in 1995, when McCain voted for a Republican budget resolution calling for a 1 percent cut in the education budget. In the end, the Education Department's budget was cut slightly that year — in the midst of the budget wars pitting then-President Clinton against the new Republican majority in Congress. But the education budget quickly rebounded and McCain in 2001 voted for the law known as the No Child Left Behind Act, which increased federal education funding by a whopping 33 percent, or $14-billion, in a single year.", "The McCain campaign in response to the ad's allegations noted a number of other occasions in which McCain has supported increased education funding. It's true that Democrats have supported large funding increases beyond what Republicans have backed, but the Education Department budget today is still 60 percent higher than when Bush took office, increases that have largely enjoyed McCain's backing.", "Obama again cherry picks the record to make a case that McCain opposes accountability standards. The Obama campaign cites a number of pre-No Child Left Behind votes in which McCain didn't support Democratic efforts to require states to establish accountability standards as a condition of federal funding. Many Republicans long opposed such conditions as a federal imposition on what is traditionally a state responsibility: education. It wasn't accountability standards that they opposed, rather federal intrusion into state responsibilities.", "Even so, when Bush proposed just that idea in 2001, Republicans, including McCain, voted to create the most rigorous education accountability standards ever imposed by the federal government on the states through the No Child Left Behind Act.", "Given the McCain campaign's pledge to fully fund the No Child Left Behind Act, and in that way endorse the expanded federal role in education that law calls for, it seems unlikely McCain has any intention of abolishing the Department of Education should he be elected.", "But for what it's worth, he did way back in 1994, when he said on CNN's\n\nLate Edition\n\nthat \"given the origins of the Department of Education, I would favor doing away with it.\"", "There's evidence, then, for each of Obama's charges, but entirely absent is the larger context. Obama is citing exceptions in the McCain record rather than the rule, and claims — erroneously — that failing to support the large increases in education funding backed by Democrats is the same as supporting cuts. As a result, we find the Obama campaign ad's claims to be Barely True.", "Senate vote #232,\n\nH.Con.Res. 67,\n\nMay 25, 1995", "Senate Vote #56,\n\nS.Amdt. 173 to S.Con.Res. 18,\n\nMarch 16, 2005", "Senate vote #69,\n\non S.Amdt. 185 to S.Amdt. 170 to H.Con.Res. 83,\n\nApril 4, 2001", "Senate vote #171,\n\non H.R. 4577,\n\nJune 30, 2000", "Senate vote #147,\n\non S.Amdt. 3649 to H.R. 4577,\n\nJune 27, 2000", "Senate vote #99,\n\non S.Amdt. 403 to S.Amdt. 358 to S. 1,\n\nMay 10, 2001", "Senate vote #90,\n\non S.Amdt. 3111 to S. 2,\n\nMay 3, 2000", "Senate Vote #47,\n\non S.Amdt. 62 to S.Amdt. 31 to S. 280,\n\nMarch 11, 1999", "Senate vote #30,\n\non S.Amdt. 32 to S.Amdt. 31 to S. 280,\n\nMarch 3, 1999", "CNN, Late Edition, Dec. 11, 1994", "Senate vote #371,\n\non S.Amdt. 32 to S.Amdt. 31 to S. 280,\n\nDec. 18, 2001", "Education Department,\n\nBudget, 1980-2007", "Education Week,\n\n\"New Obama Ad Attacks McCain's Education Record,\"\n\nby Alyson Klein, Sept. 9, 2008", "Senate vote #86,\n\non H.Con.Res. 68,\n\nApril 15, 1999", "John McCain,\n\nRemarks,\n\nCincinnati, July 16, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]