["Bollywood actor Kangana Ranaut became the epicentre of yet another controversy after terming Urmila Matondkar a “soft porn star” who is “not known for her acting”. Ranaut’s derisive comment was sparked by Matondkar asking Ranaut to first take stock of the “menace of drugs” in her own state Himachal Pradesh. Ranaut has been alleging that a “drug nexus” runs in the film industry.", "On September 17, an Amul advertisement featuring Matondkar began circulating on social media. Journalist Swati Chaturvedi tweeted the same and criticised the milk giant for coming up with a “disgusting” ad. “When did you join the IT cell”, questioned Chaturvedi who later deleted her tweet. The ad depicted a caricature of actor-turned-politician Urmila Matondkar from her 1995 film ‘Rangeela’.", "Historian and writer Rana Safvi also criticised Amul in a quote-tweet. Author Deepanjana tweeted the image, which NDTV’s Sreenivasan Jain quote-tweeted. All of them have taken down their tweets.", "This slideshow requires JavaScript.", "We also received requests on our official app to fact-check the Amul ad.", "As the milk cooperative is known for its topical ads featuring Amul girl since 1966, we went on its official website and found this cartoon posted in the list of Amul hits from 1995. This is the same year when the movie ‘Rangeela’ was released. The cartoon is a tribute to the film’s lead actor Urmila Matondkar.", "The ad is not recent but has drawn flak for the tagline “not MASOOM anymore” which is a reference to Matondkar’s film ‘Masoom’ where she played the daughter of the lead pair Naseeruddin Shah and Shabana Azmi as a child actor in 1982. ‘Rangeela’ director Ram Gopal Varma had a shared a photograph of the actor with the cast and director of ‘Masoom’.", "Hey ⁦@shekharkapur⁩ This is a priceless team photo of ur evergreen great film MASOOM ..Just can’t believe that little girl in ur hands grew up to become a RANGEELA🙏🙏🙏 pic.twitter.com/UnoE5suhUm", "— Ram Gopal Varma (@RGVzoomin) April 27, 2020", "Swati Chaturvedi, Deepanjana and Rana Safvi later acknowledged their faux pas.", "This slideshow requires JavaScript.", "In conclusion, social media users including journalists fell for a 1995 Amul cartoon tribute to ‘Rangeela’, assuming it to be Amul’s response to the controversy vis-a-vis Urmila Matondkar and Kangana Ranaut.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]