["On November 25, a ‘dharm sabha’ was organised at Ayodhya by the Vishwa Hindu Parishad which saw a large gathering. That day itself, social media was buzzing with video and images, purportedly of the gathering. The Facebook page I support BJP for Bengal posted a 15-second video with the message, “অযোধ্যা রাম মন্দির জমায়েত বিশ্বহিন্দু পরিষদ” (Sea of support for Ram Mandir by VHP- translated). The video has been viewed over 8000 times so far.", "অযোধ্যা রাম মন্দির জমায়েত বিশ্বহিন্দু পরিষদ", "Posted by I Support BJP for Bengal on Sunday, November 25, 2018", "Alt News used the InVid software to break down the video into several frames. We reverse searched one of the frames and found a tweet by Mumbai Mirror dated August 9, 2017 which had the full version of this video (33 seconds). Accompanying the video was the message, “#MarathaKrantiMorcha The community members chanting slogans as they pass-by the JJ flyover.” The video has been credited to Raju Shinde who is a photojournalist with Mumbai Mirror.", "#MarathaKrantiMorcha: The community members chanting slogans as they pass-by the JJ flyover. Video by Raju Shinde. pic.twitter.com/7dcWRvVlW7", "— Mumbai Mirror (@MumbaiMirror) August 9, 2017", "On November 25, a Facebook user Vikas Kattar posted a video with the message,“श्री #अयोध्या #धाम #टीम विश्व हिंदू दल बजरंग दल विश्व हिन्दू परिषद #साझा #शक्ति #प्रदर्शन जय भवानी”. The video has been viewed over 7000 times. In the video, a crowd can be seen waving saffron flags in front of a mosque.", "श्री #अयोध्या #धाम #टीम विश्व हिंदू दल बजरंग दल विश्व हिन्दू परिषद #साझा #शक्ति #प्रदर्शन जय भवानी", "Posted by विकास कट्टर on Sunday, November 25, 2018", "We again used the InVid tool to ascertain the truth of this video, and came across a number of links on YouTube of March 2018. This at least proves that the video is not of the recent gathering at Ayodhya. This video has been uploaded with the caption ‘Ram Navami Full Crowd In Karnataka Gulbarga 2k18‘. In the video which has gone viral, a black coloured bus can be seen in the midst of a crowd. In the video posted below, the words ‘Karnataka State Reserve Police’ can be seen written on the bus. This makes it clear that the video is not from Ayodhya but from Karnataka.", "Apart from this, a set of images has also been circulated, claimed to be of Ayodhya, posted by groups and individual users. Suryanarayan Bajrangdal, who describes himself on Facebook as the co-convenor of Bajrang Dal, has posted photographs claiming they are of the gathering at Ayodhya. His post has been shared over 500 times. Suryanarayan is followed by more than 9000 people on Facebook. His post has been shared by the Facebook groups Citizen Of INDIA and Namo Bharath – Narendra Modi For PM. Citizen of India has over 77000 followers whereas Namo Bharath- Narendra Modi for PM has over 5 lakh followers.", "The group मिशन राम मंदिर में अपने १०० मित्रों को जोड़े has posted these images with another set of photos, with the message, “You may not be able to go to Ayodhya on November 25 but at least encourage the bhakts headed for Ayodhya with the words Jai Shri Ram- translated”. This post has been shared over 1100 times and liked over 13,000 times. The photos have also been shared on the group WE SUPPORT PM MODI which has over 2 million members. Co-convenor of Bajrang Dal, Suryanarayan has posted 4 photographs, of which the second and the fourth image are the same.", "Using the Google reverse image search tool, we searched for the first image and came across the original image with the words ‘Maratha Kranti Morcha’.", "We found the original image on using the reverse image search tool. This photograph was taken by Indian Express photographer Dilip Joshi and appeared in an article of October 16, 2016 titled Maratha ‘silent march’ reaches Thane district’.", "Thus, we have seen that the videos and images shared on social media, claimed to be of the Ayodhya gathering of November 25, are unrelated and taken from different contexts.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]