["NCAA president Mark Emmert on ABC's \"This Week\" on Aug. 10, 2014.", "The line between amateur and professional for college athletes is up for grabs in the courts, but the NCAA continues to argue that its players are amateurs because they truly are students.", "Last week, a U.S. district court judge in California ruled against the college athletics association in a case filed by a former basketball player from the University of California at Los Angeles. The decision in Ed O’Bannon vs. NCAA said student-athletes cannot be banned from profiting off of their own names and likenesses.", "The NCAA plans to appeal the decision, at least in part, said president Mark Emmert on ABC News’ This Week Aug. 10. Emmert defended the athletes’ amateur status by emphasizing their academic successes.", "\"Many, many, many thousands of student-athletes take full advantage of the opportunity to be both a student and an athlete while they’re in college,\" Emmert said. \"The vast majority of them graduate. More graduate than the students who aren’t student-athletes. So I believe strongly, and more importantly, the evidence demonstrates that indeed they are students.\"", "With how much time student-athletes spend in practice, in games and on the road, we wondered if it’s true that they have higher graduation rates than their nonathlete peers.", "The rates", "The NCAA calculates its graduation success rate by tracking how many student-athletes graduate within six years of enrolling, including students who transfer between schools in good academic standing.", "Using this measurement, the NCAA Division I student-athlete graduation rate was 82 percent for students who enrolled in 2006 and graduated by 2012.", "In Division II, the graduation rate was 69 percent for the 2006 cohort. Division III schools aren’t required to disclose their graduation rates to the NCAA. But among those that did, the graduation rate for students who enrolled in 2005 was 88 percent.", "However, there is no general student body graduation data using the NCAA’s parameters.", "To show that the student-athlete graduation rate is higher than that of the student body, NCAA officials point to the federal graduation rate, which counts both student athletes and the general student body.", "It’s different than the NCAA measurement because it only counts students who graduate from the institution where they first enrolled and not transfer students. (The purpose is to measure retention.) To get an idea of the size difference between the two pools, the federal rate included 82,226 Division I student-athletes in 2012, and the NCAA rate included 91,701.", "The federal measurement tends to calculate a much lower student-athlete graduation rate than the NCAA’s measurement.", "Using this measurement, 65 percent of Division I student-athletes who enrolled in 2006 and graduated by 2012. This is only 1 percentage point higher than the general student body, which had a 64 percent graduation rate.", "The difference is a little bigger in the other divisions. Division II athletes had a graduation rate of 68 percent, while the general student body had a rate of 64 percent. For Division III (the 2005 cohort) the student-athlete rate was 54 percent compared with 48 percent generally.", "Researchers at the College Sports Research Institute at the University of South Carolina have also expressed concern that these calculations include part-time students in the general student body. Part-time students are less likely to graduate in the six-year time frame, bringing down an institution’s overall graduation rate. (The NCAA requires student-athletes to go to school full time.)", "The institute’s adjusted graduation rate calculations regularly show major negative gaps between Division I football and men’s basketball graduation rates and that of their nonathlete peers.", "Breaking it down further", "The graduation rates vary wildly by sport, school and demographic group.  For example, compare men’s basketball and football (what often comes to mind when we think college sports) to the general student body and other student-athletes:", "Group", "NCAA grad rate", "Federal grad rate", "General student body", "n/a", "64 percent", "All Div. I student-athletes", "82 percent", "65 percent", "Men’s basketball", "70 percent", "47 percent", "Football — bowl subdivision", "70 percent", "59 percent", "Football and basketball have the lowest graduation rates using the NCAA measurement. Additionally, more than half of the 18 women’s sports have graduation rates higher than 90 percent, while only one men’s sport — fencing — has a graduation rate above 90 percent.", "Under the federal measurement, the sports with the highest graduation rates are: men’s gymnastics with 88 percent, women’s gymnastics with 83 percent and women’s lacrosse with 80 percent.", "Some experts have taken issue with the NCAA’s claim because the graduation rates vary depending on the team, meaning one group’s success could mask another’s troubles.", "\"Emmert is not referring to football and men's basketball, which is considerably lower,\" said Gerald Gurney, a former senior associate athletic director for academics at Oklahoma University. \"The problem in college sports is not with the women's soccer team.\"", "Additionally, it’s difficult to compare the graduation rates and other academic successes of student-athletes to nonathletes because some programs keep their athletes up to NCAA academic standards \"by any means necessary,\" said Dave Ridpath, a professor of sports administration at Ohio University. He referenced the recent controversy at the University of North Carolina, where some football players were registered for fake classes to get easy As.", "\"Keeping them eligible by any means necessary … might lead to graduation, but are they educated?\" Ridpath said.", "Our ruling", "Emmert said, \"more (student-athletes) graduate than the students who aren’t student-athletes.\"", "Experts, the government and the NCAA don’t agree on how this data should be calculated. But the best and most recent measurement we have for drawing a comparison shows that the graduation rate among Division I student-athletes is about the same as the general student body, though it is higher for Division II and Division II.", "But the graduation rates are not the same across all sports, divisions, schools or demographics, so a group with a particularly good or bad graduation rate could skew the overall results.", "Because the data is inconclusive, we rate this claim Half True.", "ABC News, This Week transcript, Aug. 10, 2014", "NCAA, \"Trends in Graduation Success Rates,\" October 2013", "NCAA, \"DI Student Athletes Show Progress,\" Oct. 24, 2013", "NCAA, \"Trends in Academic Success Rates,\" November 2012", "NCAA, \"DIII graduation rates reflect student athlete success,\" Oct. 25, 2012", "College Sport Research Institute, Adjusted Graduation Gap reports, accessed Aug. 10, 2014", "Inside Higher Education, \"Gaps in Grad Rates for Athletes,\" Sept. 25, 2012", "Los Angeles Times, \"Judge rules against NCAA in Ed O'Bannon antitrust lawsuit,\" Aug. 8, 2014", "Email interview, Stacey Osburn, NCAA spokeswoman, Aug. 10, 2014", "Email interview, Gerald Gurney, a former senior associate athletic director for academics at Oklahoma University, Aug. 10, 2014", "Email interview, Dave Ridpath, professor of sports administration at Ohio University, Aug. 10, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]