["About this rating", "NPR published an article at 9:33 a.m. EST in advance of U.S. President Donald Trump’s \"Save America\" rally on Jan. 6, 2021. As riots later unfolded at the Capitol, the news outlet updated the original headline as Trump supporters stormed the building.", "The publication did not publish an article titled “Trump Supporters Storm U.S. Capitol, Clash With Police” before the event occurred.", "As news publications around the U.S. raced to accurately report the events of the Jan. 6, 2021, siege on the U.S. Capitol, live updates and edits were at the core of coverage as the story developed.", "Social media influencer Breck Worsham pointed out in a Jan. 7 post on conservative social media platform Parler that NPR had published an article with the headline, “Trump Supporters Storm Capitol, Clash With Police” at 9:33 am ET — more than three hours before the building had been breached. Worsham is a self-proclaimed journalist and “advocate for America and the Constitution” who had been banned from Twitter for “exposing the Anti-American agenda of the liberal left.\"", "But this claim is misleading and does not accurately detail the several iterations that the article experienced over the course of the Capitol riots on Jan. 6, 2021. Based on the URL link, the original article was indeed published at 9:33 a.m. EST but with the headline, \"Diehard Trump Supporters Gather in the Nation’s Capital to Protest Election Results,” which has been archived here and is highlighted in the screenshot below:", "As pro-Trump supporters who rejected his loss in the 2020 presidential contest stormed the Capitol, NPR updated its original article. In an email to Snopes, NPR Senior Publicist Ben Fishel confirmed that the original story’s headline had been updated to accurately reflect the turn of events on Jan. 6, and that this is NPR’s “standard practice in a developing story.”", "“I can confirm that NPR is neither clairvoyant nor were we a part of a (false) conspiracy of people who staged the events of Wednesday [Jan. 6],” wrote Fishel.", "Snopes searched through the internet archives to determine an accurate timeline of updates to the NPR story in question. Here is what we found:", "We then compared NPR’s article updates with a timeline of the Jan. 6 riot and the events that led up to the eventual storming of the Capitol.", "In a tweet, Trump announced that the doors to his \"Save America\" rally were to open at 7 a.m. EST. A C-SPAN stream of the event showed that the president took the stage about 3 1/2/ hours into the event, which mans his speech started around 10:30 a.m. EST. According to the archived video footage and a transcript by Factba.se, a database of Trump’s statements, the president told supporters to gather at the U.S. Capitol on at least two occasions:", "After this, we’re going to walk down — and I’ll be there with you — we’re going to walk down, we’re going to walk down — anyone you want, but I think right here — we’re going to walk down to the Capitol, and we’re going to cheer on our brave senators and congressmen and women. And we’re probably not going to be cheering so much for some of them. Because you’ll never take back our country with weakness, you have to show strength, and you have to be strong. We have come to demand that Congress do the right thing, and only count the electors who have been lawfully slated — lawfully slated. I know that everyone here will soon be marching over to the Capitol building to peacefully and patriotically make your votes heard today.", "Later in the speech, Trump added:", "The best is yet to come. We’re going to, we’re going to walk down Pennsylvania Avenue — I love Pennsylvania Avenue — and we’re going to the Capitol. And we’re going to try and give — the Democrats are hopeless, they never vote for anything, not even one vote — but we’re going to try to give our Republicans, the weak ones because the strong ones don’t need any of our help; we’re going to try and give them the kind of pride and boldness that they need to take back our country. So let’s walk down Pennsylvania Avenue.", "A timeline established by the Department of Defense outlined the events leading to the “violent attack” at the U.S. Capitol, which showed that D.C. Mayor Muriel Bowser had delivered a written request on Dec. 31, 2020, asking that the D.C. National Guard support local authorities in advance of the rally. For at least a week leading to the event, security personnel reviewed contingency-response options.", "At 1:05 p.m. EST on Jan. 6 — more than three hours after the original NPR story was published — the acting secretary of defense received reports of demonstrators moving toward the Capitol building. Capitol Police ordered an evacuation of the building 21 minutes later.", "In summary, it is true that NPR first ran a story covering Trump’s \"Save America\" rally at 9:33 a.m. EST, but the original headline did not foreshadow the eventual breach of the Capitol building, nor did it allude to a media conspiracy. A look through the internet archives showed that the URL remained the same, but the headline had been updated at least twice in order to accurately reflect events that had occurred as the story developed.", "Update [Jan. 20, 2021]: Updated to replace an inadvertently repeated blockquote with the intended passage.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]