["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "George Soros, a billionaire philanthropist, Holocaust survivor and Democratic campaign donor, has long been the target of misinformation and conspiracy theories.", "Now, he has allegedly been arrested in Switzerland after a military force stormed his retreat.", "A Facebook post claims the 88-year-old was taken into custody on Feb. 3 after members of a group named the \"Alliance\" stormed his retreat in Switzerland based on a tip from local police.", "The story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The rumor originated on BeforeItsNews.com, a junk website long known for spreading false stories and conspiracy theories.", "The Facebook post uses the first paragraph of the story: \"George Soros was said (to be) arrested in Switzerland at 13:23 GMT on Feb. 3, 2019. Evidently members of what was known as the Alliance stormed his retreat at St. Margrethen Berg, Switzerland, based on a tip from local police. The Alliance was a military force working under orders of the Pentagon, GITMO Military Tribunal Judges and in conjunction with legal entities across the globe.\"", "Soros has not been arrested, in Switzerland or elsewhere. The story is entirely contrived, from the fictional group that allegedly found him down to the web of wrongdoing he is said to have committed.", "At one point, the article, which is riddled with misspellings and grammatical errors, claims Soros was arrested via evidence provided by President Barack Obama. It said Obama has been in jail (in Guantanamo Bay) for treason for at least a month and revealed crimes of \"upper echelons of the Deep State to save his own skin.\"", "First of all, Obama hasn't been imprisoned for over a month. He was seen in public on Jan. 24 when he met with the Golden State Warriors in Washington. And, of course, if either he or Soros had been imprisoned, it would be huge, international news.", "There are no sources cited in the story, and no evidence to support it could be found in Swiss or other international media outlets. We also found no statements or reports from Swiss law enforcement on such an arrest.", "There is also no mention of this on Obama’s website, Soros’ Open Society Foundations website, or either of their social media accounts.", "\"There is no truth to the story whatsoever,\" Laura Silber, chief communications officer for Open Society Foundations, told us. \"It is nonsense from start to finish.\"", "The outlandish conspiracy theory has since been re-posted on various blogs and websites, and eventually turned into a social media post.", "We rate it Pants on Fire!", "Facebook post, Feb. 4, 2019", "PolitiFact, PolitiFact's guide to fake news websites and what they peddle, Accessed Feb. 8, 2019", "CBC Radio,  How conspiracy theories and anti-Semitism turned George Soros into a bogeyman for the American right, Nov. 2, 2018", "Beforeitsnews, \"George Soros Arrested; Obama Believed Charged With Treason,\" Feb. 3, 2019", "Snopes, Was George Soros Arrested in Switzerland in February 2019? Feb. 5, 2019", "The Guardian, Warriors visit with Barack Obama instead of Donald Trump during DC trip Jan. 25, 2019", "Swiss law enforcement agencies, Accessed Feb. 8, 2019", "Email interview, Laura Silber chief communication officer for Open Society Foundations, Feb. 8, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]