["Multiple posts on Facebook, for example this one published on May 25, 2018, and shared more than 13,000 times since, share an image showing a boy on his knees looking straight ahead, with a large bloodstain on the left side of his chest.", "The image also contains text above the picture of the boy, which says in English:", "\"A Palestinian young boy shot by israeli police, giving a final and freezing look to his killer. But this photo cannot be a viral to be spread because this ummah is deadly sleeping. (I’m also listed in ummah) #RamazanKareemInPalestine\"", "Below is a screenshot of one of the misleading Facebook posts:", "Other posts with the same photo and a similar caption appear elsewhere on Facebook, for example here, here and here, where it has been shared around 1,500 times, and on Twitter here and here.", "A reverse image search found that the photo is from a film called \"Mamlakat al-Naml\", or \"The Kingdom of Ants\" in English.", "Here are details of the film on the website of the 2012 Carthage Film Festival.", "The boy in the misleading Facebook posts, wearing the same checked shirt with the same bloodstain on the left-hand side, appears at 3:40 in a trailer for the film published here on September 11, 2012 on the website of Amman-based news organisation Al Bawaba.", "A clearer version of the same trailer was also posted here on the website of Fadi Hakim, a videographer who worked on the film’s post-production, according to his site. The same boy also appears at 3:40.", "The image below compares a screenshot of the misleading Facebook post (L) and a screenshot of the trailer (R):", "The film’s synopsis on the Carthage Film Festival website says, in part: \"Three generations of Palestinians are fighting for their survival and the survival of their dreams, in their own way. Adults, a generation of resistance in all its forms. They struggles to live, to love, to preserve the identity and land.\"", "The exact frame of the kneeling boy in the misleading Facebook post does not appear in the trailer, but the same child actor can be seen in a shorter promo video for the film published here on CineKlik, a middle eastern cinema information website.", "The boy with the same haircut and wearing the same light-coloured checked shirt with a large collar and a pocket on the left-hand side, but with no blood on it, appears at 1:11 in the CineKlik video.", "The CineKlik video is embedded below:", "UPDATE: This story was updated 21/03/2019 to add another example of a misleading Facebook post which has been shared more than 13,000 times", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]