["A video massively circulated on social media is being shared with the claim that the Delhi police halted an ambulance for Rahul Gandhi’s rally and the sick child who needed to get to the hospital lost her life. “राहुल गांधी की गाड़ियों के रैले के लिए दिल्ली पुलिस ने एम्बुलेंस रोकी….एम्बुलेंस में जिन्दगी और मौत से लड़ रही बच्ची थी .और अंत में बच्ची ने दम तोड़ दिया ! (The Delhi police halted an ambulance for Rahul Gandhi’s rally. For the child inside the ambulance, it was a matter of life and death. In the end, she died),” is the caption used to share the video, which shows a stationary ambulance in front of a police barricade, followed by a long stream of vehicles.", "राहुल गांधी की गाड़ियों के रैले के लिए दिल्ली पुलिस ने एम्बुलेंस रोकी,…. एम्बुलेंस में जिन्दगी और मौत से लड़ रही बच्ची थी .और अंत में बच्ची ने दम तोड़ दिया !😌", "Posted by जीतू प्रियद्रशी on Friday, 3 May 2019", "The 1:36-minute clip is viral on Facebook.", "Individual users on Twitter have also shared the video with the identical narrative.", "राहुल गांधी की गाड़ियों के रैले के लिए दिल्ली पुलिस ने एम्बुलेंस रोकी,….एम्बुलेंस में जिन्दगी और मौत से लड़ रही बच्ची थी .और अंत में बच्ची ने दम तोड़ दिया ! आज आपने शेयर नही किया तो आपके साथ भी ये हो सकता है तो फिर ये वीडियो पूरी दुनिया मे भेज दो। pic.twitter.com/Cm8GY69fKR", "— Ashok Odedra (@AshokOdedra5) May 3, 2019", "The claim that an ambulance was stopped from passing through due to Rahul Gandhi’s rally in Delhi is false. The video viral across social media platforms is from 2017 and was uploaded as a Facebook live by one user Preet Narula. The original clip almost two minutes long.", "vips are more important then child in ambulance", "Posted by Preet Narula on Friday, 31 March 2017", "Alt News also found a news report by Hindustan Times dated April 5, 2017, related to the incident. According to the report, the incident took place near the Indira Gandhi Indoor Stadium, and the route was blocked as the convoy of the Head of Malaysia was to pass from the area.", "The report also quotes a senior police officer who had said, “The ambulance was stuck behind several cars. We got the passage cleared and brought it ahead. In a span of few minutes, it was allowed to go.”", "Alt News had also fact-checked this video last month when it was viral as ‘Delhi police stopped an ambulance for BJP MP Manoj Tiwari.’", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]