["The misleading posts first appeared February 15, 2019, for example here, one day after a suicide attack killed more than 40 Indian soldiers in Indian-administered Kashmir.", "Here is an AFP report from February 16, 2019 about the suicide attack.", "The misleading claim has also been shared on Twitter, for example here where it has been shared more than 6,000 times.", "The Hindi text above the photos in the misleading posts says: ‘These are not coffins. These are our country’s debts.’", "The English text above the photos reads: ‘Cost of Freedom and Pain of loosing brothers !‬ #RIPBravehearts Jai Hind’", "The #RIPBravehearts hashtag is being used on social media posts, for example here on Facebook and here on Twitter, to commemorate the February 14, 2019 suicide attack in Kashmir.", "A reverse image search on Google found the first image used in the misleading post, which shows Indian soldiers with flag-draped coffins, has been posted online since at least 2014, for example here, here, and here.", "The articles credit the image to the Reuters news agency and say it shows Central Reserve Police Force personnel paying their respects to colleagues killed in a Maoist attack in the state of Chhattisgarh, eastern India, in June 2010.", "The bottom photo used in the misleading post shows a group of soldiers, two of whom are wiping their faces with white cloths.", "The image is actually a 2011 AFP photograph of Indian soldiers at an event in New Delhi.", "Below is a screenshot of the original photograph on AFP's Image Forum website:", "The caption of the image says: “Indian armed forces personnel react to the heat during a march at India Gate after a tribute ceremony to commemorate twelve years since the victory of the Kargil war in New Delhi on July 26, 2011.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]