["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate former Vice President Joe Biden speaks at Alexis Dupont High School in Wilmington, Del., on June 30, 2020. (AP)", "The White House requested that the CDC revise its initial reopening guidelines because they were “too prescriptive.”", "The CDC later released around 60 pages of detailed reopening guidelines, but certain sections were cut.", "The CDC said that the review and revision were part of a standard process with the White House coronavirus task force but some experts criticized the delay.", "Joe Biden berated President Donald Trump’s handling of the COVID-19 pandemic, saying in a recent speech in Delaware that Trump failed to take the necessary steps to get the virus under control.", "Biden, the presumptive Democratic presidential nominee, said the administration stifled and scaled back the Centers for Disease Control and Prevention’s initial guidelines on reopening the country.", "\"The CDC tried to develop clear guidelines about what the stages of reopening should look like — the administration delayed and scaled them back,\" Biden said June 30.", "Did they? Here’s what we found out.", "Biden’s campaign pointed us to a May 7, 2020, Associated Press report, which found that the Trump administration shelved part of a CDC document that contained step-by-step advice to local authorities on how and when to reopen businesses and public areas amid the pandemic.", "The 68-page CDC report, titled \"Guidance for Implementing the Opening Up America Again Framework,\" was supposed to publish on May 1, according to the AP, but the White House called it \"too prescriptive.\" The White House told the agency revise its guide because it didn’t align with Trump’s strategy of giving states the final say.", "The CDC released the approved 62-page report on May 20. (Some sections were released a few days earlier.) While it’s slightly shorter than the original, it still provides a detailed reopening roadmap for schools, camps, restaurants, child care facilities and transit organizations.", "In a May 8 press briefing, White House press secretary Kayleigh McEnany countered that the CDC guidelines weren't ready and said that a rogue employee leaked a draft that was still in the editing process.", "After the final guidelines were released, she was asked in another briefing why Trump didn’t make an announcement. McEnany said that sections of the document were already out and different appendixes had to be discussed first.", "\"The 60-page document was merely an aggregation of a lot of what was already out there, so it’s not as if this was new information that we were announcing, but it was more guidance pursuant to our ‘reopening of America’ guidance that was issued several weeks ago,\" McEnany said.", "The CDC also said the guidelines are meant to be taken together with the White House’s reopening guidance issued on April 17, 2020. But the White House version makes clear reopening decisions are up to state and local officials, while the CDC’s version includes more details, such as recommendations to help businesses decide when to shut down in the case of future outbreaks.", "The original plan also included instructions for faith-based organizations, which were stripped out of the final version.", "CNN reported that this section was one of the main holdups for publishing the CDC documents, because the Department of Health and Human Services’ Office for Civil Rights argued that faith-based organizations were being unfairly targeted. The department asked the CDC to ease social distancing recommendations for those groups, according to CNN, and encouraged federal health officials to let churchgoers congregate, saying that this aligned with the president’s agenda.", "The shelved CDC guide also recommended that nonessential travel should be avoided until the last phase of reopening, while the released version only mentions nonessential travel in relation to high-risk persons. The White House plan is looser on nonessential travel, too, and advises that communities \"minimize\" travel in Phase 1, and that in Phase 2, \"non-essential travel can resume.\"", "Some health experts and officials have criticized the delay, saying that detailed recommendations should have been available earlier.", "\"While it is not unusual for there to be White House review of forthcoming guidance, it is highly unusual for there to be a wholesale rewriting of guidelines at the request of the White House,\" said Jeffrey Levi, a professor of health policy and management at George Washington University.", "\"The holding back of recommendations regarding places of worship was particularly egregious given the high level of risk such indoor, mass gatherings can pose,\" Levi said. \"The shorter versions that were first released diminished their effectiveness, since they didn’t provide as much detail as people needed to know how best to implement them. This delayed implementation of best practices — which could potentially have placed people at greater risk.\"", "But the CDC told PolitiFact the report’s revisions were part of a standard interagency process with the White House coronavirus task force.", "\"There is an iterative effort to ensure effective, clear guidance is presented to the American people,\" said Benjamin Haynes, a spokesperson for the CDC. \"As part of the Administration’s whole of government approach to combating COVID-19, the CDC followed an inter-agency process of drafting considerations and submitting them to the White House Task Force for review and comment before posting the guidance for states to safely reopen.\"", "PolitiFact reached out to the White House for comment but did not hear back.", "Biden said that the Trump administration \"delayed and scaled back\" the CDC’s COVID-19 reopening guidelines.", "Biden is mostly on target. The CDC said that the delays were caused by review and revision that was part of a standard process. Still, the White House did request that the public health agency revise its initial guidelines to align more with Trump’s approach of leaving reopening decisions up to state and local governments.", "We rate this Mostly True.", "Joe Biden speech in Wilmington, De., June 30, 2020", "Associated Press, Trump administration buries detailed CDC advice on reopening, May 7, 2020", "Association Press, AP Exclusive: CDC guidance more restrictive than White House, May 13, 2020", "Centers for Disease Control and Prevention, Guidance for Opening Up America Again Framework, Accessed July 1, 2020", "Centers for Disease Control and Prevention, CDC releases resources to assist states to open, May 20, 2020", "Centers for Disease Control and Prevention, CDC Activities and Initiatives Supporting the COVID-19 Response and the President’s Plan for Opening America Up Again, May 20, 2020", "Whitehouse.gov, Press Briefing by Press Secretary Kayleigh McEnany, May 20, 2020", "Whitehouse.gov, Press Briefing by Press Secretary Kayleigh McEnany, May 8, 2020", "Politico, CDC releases scaled-back guidance on reopening after White House blocked earlier release, May 14, 2020", "CNN, CDC releases detailed guidance on reopening that had previously been shelved by White House, May 19, 2020", "CNN, READ: The full draft CDC guidelines on reopening from stay-at-home orders, May 14, 2020", "Email interview, Benjamin Haynes spokesperson at the Centers for Disease Control and Prevention, July 2, 2020", "Email interview, Jeffrey Levi professor of health policy and management at George Washington University, July 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]