["By Angelo Fichera", "Posted on May 18, 2018", "Q: Did the late surgeon Dean Lorich expose “Clinton Foundation corruption in Haiti”?", "A: No. Lorich co-authored an article criticizing the medical response to the 2010 earthquake in Haiti, not the Clinton Foundation.", "FULL QUESTION", "Is this true or not? THANK YOU!!!!", "FULL ANSWER", "For years, conspiracy theories have abounded tying Bill and Hillary Clinton to various deaths.", "One of the latest examples in that flow of wild tales is a story about a surgeon found dead in New York City who — a slew of questionable websites have falsely claimed — “exposed Clinton Foundation corruption in Haiti.”", "An article repeating that assertion appeared April 24 on dailypresser.com, leading our readers to ask us about its veracity. Facebook users also rightfully flagged the claim as potentially false.", "That story originally appeared in December 2017 on yournewswire.com, a website known to distribute fictitious reports. It has been recycled numerous times, as conspiracy theories often are. (It’s worth noting that the website also featured another story, which PolitiFact debunked, claiming that a Haitian official who died was set to “expose the extent of Clinton Foundation corruption and malpractice.”)", "Beneath its bogus headline, the story begins with an accurate detail: Dean Lorich, a 54-year-old respected surgeon, was found dead in his apartment — in December, not in late April, which the date on the dailypresser.com post implies. He was discovered with a knife in his torso, as was widely reported at the time.", "Lorich’s death was ruled a suicide, the New York City Police Department confirmed in an email to FactCheck.org.", "But the bogus article goes on to falsely claim that Lorich wrote “an article published by CNN, accusing the Clinton Foundation of widespread corruption and malpractice in Haiti that cost the lives of thousands of children.”", "Lorich did co-author a Jan. 25, 2010, opinion piece for CNN that offered a grim view of the medical response in Haiti immediately following the devastating earthquake. The natural disaster on Jan. 12, 2010, left hundreds of thousands of people dead and many more injured and homeless in the already impoverished country.", "The CNN piece describes how David L. Helfet, a doctor and one of the three co-authors, assembled a 13-member squad of medical professionals to travel to Haiti’s capital, Port-au-Prince, on a private plane within 24 hours of the earthquake. But the team encountered delays flying into the capital and, when it finally did get to Haiti, the doctors found the medical effort on the ground was ill-equipped, understaffed and poorly coordinated.", "The doctors’ article refers to the Clintons once and only in passing.", "“The difficulties in getting in — despite the intelligence we had from people on the ground and Dr. Helfet’s connections with Partners in Health and Bill and Hillary Clinton — only hinted at the difficulties we would have once we arrived,” they wrote.", "At no point did the doctors accuse the Clintons of wrongdoing, corruption, or of being the reason for the response’s shortcomings. Nor did they do so in a Wall Street Journal opinion piece that they wrote that same month.", "In the Wall Street Journal, the doctors did call the U.S. response an “embarrassment” and said they received “virtually no support from any branch of the U.S. government, including the State Department.” Hillary Clinton was secretary of state at the time.", "But Helfet told us by phone that their writings were not targeted at the Clinton Foundation or at anyone in particular.", "“It was against the whole (response) organization and the waste of resources and the lack of organization in Haiti,” said Helfet, director emeritus of the Orthopedic Trauma Service at the Hospital for Special Surgery in New York and a longtime friend of Lorich.", "Lorich was a fellow under Helfet at the Hospital for Special Surgery between 1995 and 1996, Helfet said. In 2002, Lorich returned to the hospital and became the associate director of the Orthopedic Trauma Service, where he worked until his death.", "Helfet, who called the conspiracy theory “ludicrous,” said he and Lorich talked nearly every day and that they hadn’t discussed the issues they faced in Haiti in years. He also said Lorich wasn’t political.", "“He was totally apolitical,” Helfet said. “He took care of a lot of people across the political spectrum that were injured in New York and he would get invited to political events — that was the extent of his political involvement.”", "The false story about Lorich also said the doctor voiced “his concerns to Hillary Clinton directly.”", "An email released by the State Department and published on WikiLeaks does show that Lorich expressed his concerns about the medical response in an email that was forwarded several times, eventually to Clinton. But what he wrote there is similar to the doctors’ published accounts; it likewise makes no mention of the Clintons or their foundation or corruption.", "The Clintons were involved in the response and recovery following the earthquake, in a variety of ways. In addition to Hillary Clinton’s role as secretary of state, Bill Clinton was the United Nations special envoy for Haiti and co-chaired the Interim Haiti Recovery Commission.", "The Clinton Foundation also spent millions in Haiti for efforts such as opening a cholera treatment center, assisting farmers and improving schools. But over the years, the Clintons’ work received mixed reviews in Haiti. Some Haitians lamented that Clinton-backed projects did not yield the number of jobs expected and that luxury hotels built seemed to mostly benefit foreign investors and the wealthy. Supporters pointed to other Clinton-associated projects, such as one that energized the peanut-farming industry, as indicators of progress.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories flagged by readers on the social media network.", "Eachempati, Soumitra R., et al. “Haiti: Obama’s Katrina.” The Wall Street Journal. 27 Jan 2010.", "Grimpel, John. Lieutenant, New York City Police Department. Email sent to FactCheck.org. 17 May 2018.", "Helfet, David L. Director emeritus, the Orthopedic Trauma Service at the Hospital for Special Surgery. Phone interview with FactCheck.org. 17 May 2018.", "Lorich, Dean. Associate director of the Orthopedic Trauma Service at the Hospital for Special Surgery and New York Presbyterian Hospital. Email sent to Christopher Born, Chief of Orthopedic Trauma at Brown University. 22 Jan 2010.", "Lorich, Dean, et al. “Doctors: Haiti medical situation shameful.” CNN.com. 25 Jan 2010.", "Pallardy, Richard. “Haiti earthquake of 2010.” Encyclopaedia Britannica. Accessed 16 May 2018.", "Sullivan, Kevin and Rosalind S. Helderman. “How the Clintons’ Haiti development plans succeed — and disappoint.” The Washington Post. 20 Mar 2015.", "“US Surgeon, Who Exposed Clinton Foundation Corruption In Haiti, Found Dead.” Dailypresser.com. 24 Apr 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]