["“लोकसभा टीवी के अनुसार राहुल गांधी के भाषण 48 लाख लोगो ने लाइव सुना जो रिकॉर्ड है.” (According to Lok Sabha TV, 48 lakh people have heard the speech of Rahul Gandhi live which is a record -translated) An image inscribed with the above text has been doing the rounds on social media. At the time of writing, it had been ‘liked’ more than 11000 times and shared more than 13000 times from a Facebook page, Rahul Gandhi For PM. The image claims that Rahul Gandhi’s speech in Lok Sabha on July 20, 2018 was seen by 48 lakh people live on Lok Sabha TV.", "शानदार, जबरदस्त, जिन्दाबाद", "Posted by Rahul Gandhi For PM on Friday, 20 July 2018", "It has been shared by many accounts on Facebook and Twitter. Moreover, a parody account of journalist Abhisar Sharma, निष्पक्ष आवाज़(@SirAbhisar) has also tweeted the same claim. The tweet had accumulated more than 3500 ‘likes’ and 970 retweets at the time of writing. Jayrajsinh Parmar, spokesperson of Gujarat Congress had also retweeted the claim from this account. It may be reiterated that this is a parody account and not the original Twitter handle of journalist Abhisar Sharma.", "Rahul Gandhi as next PM of INDIA, a Facebook page has also shared an image with the claim that 60 lakh viewers had watched Rahul Gandhi’s speech live on Lok Sabha TV.", "The historical speech of Rahul ji on #NoConfidenceMotion. 😊 #Must_Share 👍 👍 👍 👍", "Posted by Rahul Gandhi as next PM of INDIA on Saturday, 21 July 2018", "Alt News contacted Lok Sabha TV to ascertain the veracity of the claim. Aashish Joshi, Editor-in-chief of Lok Sabha TV refuted the claim saying, “Lok Sabha TV doesn’t produce any data concerning the viewership of the channel.”", "This is yet another instance when social media has been used to eulogise a political leader and their credentials embellished in order to create a popular perception.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]