["Various media organisations and officials have claimed that 70% of Nigerian children aren’t registered. We checked.", "Various media organisations and officials claim that seven out of ten Nigerian children are not registered with civil authorities", "The UN Children’s Fund says it doesn’t reflect their latest numbers, based on a 2016/17 survey.", "While the majority of Nigerian children under five are not registered, this figure is estimated at 53.1%, not the 70% reported.", "When Nigeria’s uncertain population figures are discussed, a startling statistic is frequently mentioned – that seven in ten of the country’s children aren’t registered.", "In August 2019, Nigerian newspaper New Telegraph claimed that “about 70% of the children born annually in Nigeria are not registered at birth”. It attributed the statistic to the UN Children’s Fund (Unicef).", "In December 2018, an even more notable source – an official of the National Population Commission – reportedly said as much at a workshop in the north-eastern state of Bauchi.", "But is this striking statistic correct?", "Africa Check sent the New Telegraph reporter a LinkedIn message asking for the exact source of the statistic, but he did not respond. Neither did the newspaper editor to a call and a WhatsApp message.", "Unicef communications officer Geoffrey Njoku told Africa Check the statistic is outdated.", "“According to the 2016/7 Multiple Indicator Cluster Survey, the percentage of children under 5 years whose births are registered is 46.8%.”", "Unicef collaborated with Nigeria’s National Bureau of Statistics to conduct the survey. Carried out from September 2016 to January 2017, it targeted a representative sample of 37,440 households across the country, of which 33,901 responded.", "Caregivers were asked whether their child had a birth certificate. If they had, the surveyor asked to see the certificate. If they didn’t, the caregiver was asked whether the child had been registered with Nigeria’s civil authorities.", "The surveyors were shown the birth certificates of close to a quarter of the children (23%). The birth certificate of another 20.2% – whose caregivers reported that the child had one – weren’t seen by the survey workers. Some 3.7% of the children didn’t have a birth certificate, though they were reported as registered. This left 53.1% of children unregistered, not 70% as often claimed.", "Njoku said Nigeria’s birth registration rate is low because “people don’t see it as important [and also because of] the tedious task of registration [and] the unofficial fees charged by the registration clerks.”", "Dr Bola Lukman Solanke, from the demography and social statistics department at Obafemi Awolowo University in Osun state, told Africa Check the unavailability of registration points in all public health facilities in the country is another problem.", "“A high number of births are recorded with traditional birth attendants who do not have the mandate to register births and so a lot of births that take place with them are unregistered,” he said. “Birth registration is part of civil registration and there are consequences for not registering births, which when enforced will push registration figures up.”", "Registration has increased from 23.3% in 2007 to 41.5% in 2011, according to previous rounds of the Multiple Indicator Cluster Survey. Under the Sustainable Development Goals, Nigeria has committed to registering every child’s birth by 2030.", "While journalists and officials frequently claim that seven out of ten children are not registered in Nigeria, this figure is outdated.", "The country’s 2016/7 Multiple Indicator Cluster Survey estimated that 53.1% of Nigerian children are unregistered.", "This fact-check was produced as part of an Africa Check fellowship completed by Emiene Odaudu from Nigeria Info FM.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]