["By Saranac Hale Spencer", "Posted on January 15, 2019", "Q: Did the Supreme Court rule that it is illegal to take the oath of office with anything but the Bible?", "A: No. That is a made-up claim that originated on a self-described satirical website.", "Did the United States Supreme Court rule that Congress has to swear on the bible?", "Members of the House of Representatives for the 116th Congress were sworn in as a group on Jan. 3.", "They also had individual ceremonial swearing-in pictures taken with House Speaker Nancy Pelosi later that day. Two new members — Rep. Rashida Tlaib and Rep. Ilhan Omar — put their hands on the Quran in their photos.", "Now a made-up story is circulating online claiming: “Supreme Court Rules 5-4: Oaths Not Taken on Bibles Illegal.” That’s false.", "First of all, the story originated on a website that has a disclaimer warning readers: “Everything on this website is fiction.” Parts of the made-up story, though, were copied by other sites without a disclaimer and presented as news.", "Besides that, there is misinformation in the story that should be corrected. For example, the story claims that the U.S. Constitution requires elected officials to be sworn in using the Bible. The Constitution says no such thing. Article VI requires that senators and representatives take an “oath or affirmation, to support this Constitution,” but it says nothing about using the Bible. In fact, the next part of that clause says, “no religious test shall ever be required as a qualification to any office or public trust under the United States.”", "Also, to be clear, there is no requirement that members hold anything or put their left hand on anything when they raise their right hand to take the oath of office, according to a recent report from the Congressional Research Service that describes the process in detail.", "And, of course, a quick check of recent Supreme Court decisions shows that the justices haven’t issued any rulings on the subject of oaths of office.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "C-SPAN (@cspan). “.@SpeakerPelosi administers the oath of office for members of the House of Representatives for the #116thCongress. https://cs.pn/2ArT47K.” Twitter. 3 Jan 2019.", "Pew Research Center. “Faith on the Hill: The religious composition of the 116th Congress.” 3 Jan 2019.", "“BREAKING: Supreme Court Rules 5-4: Oaths Not Taken on Bibles Illegal.” WeAreThellod.com. 6 Jan 2019.", "U.S. Constitution. Article VI. ConstitutionCenter.org. Accessed 14 Jan 2019.", "Congressional Research Service. “The First Day of a New Congress: A Guide to Proceedings on the House Floor.” 19 Dec 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]