["In one of the most widespread claims, popular American singer Keri Hilson asserted that coronavirus is caused by fifth-generation wireless technology, known as 5G. In a series of now-deleted tweets on March 16, 2020 (archived here), Hilson claimed  COVID-19 was not as widespread in Africa because of the absence of 5G.", "“People have been trying to warn us about 5G for YEARS. Petitions, organizations, studies…what we’re going through is the effects of radiation. 5G launched in CHINA. Nov 1, 2019. People dropped dead,” she wrote. “Turn off 5G by disabling LTE!!! Why do you think the virus is not happening in Africa like that? Not a 5G region. There may be a few bases there, but not as prevalent as other countries. It has nothing to do with melanin.”", "Hilson shared a viral YouTube video in which controversial American doctor Thomas Cowan, who remains on probation imposed by the Medical Board of California, argued that the novel coronavirus was created by 5G networks.", "In his video, Cowan claimed that Wuhan, the city where the novel coronavirus outbreak began, was the first city wholly covered by 5G in the world. Cowan and others who believe his theory claim that China launched 5G in October 2019 — two months before the outbreak started.", "Some of these claims about 5G causing novel coronavirus have been made in Facebook posts shared thousands of times, including a photograph of a poster accusing 5G network towers of being “the real cause for the virus deaths”.", "The posts also claim that “the vaccine” contains a chip to give personal information to authorities. However, according to the World Health Organization (WHO), there is not yet a vaccine or specific treatment for COVID-19.", "Experts differ on which country leads in the commercial use of 5G, but agree that the top nations are China, South Korea (the first to launch in 2019), the United Kingdom and the United States.", "In late October 2019, China rolled out the commercial use of 5G in 50 cities.", "Not only did the novel coronavirus not get its start in pioneering South Korea, but the virus has gained a foothold in many countries (for example, Malaysia, Iran, France, Singapore and Nigeria) without 5G networks.", "While there have been health concerns regarding the use of 5G networks — and mobile networks in general — owing to radiation, this has nothing to do with the outbreak of viruses, experts told AFP.", "Speaking to Keri Hilson’s claims, Yusuf Sambo, a researcher at the University of Glasgow who is testing 5G in Scotland, said: “I think she’s an amazing singer, but I am not sure she knows what she’s talking about. Yes, there are fears about the health implications of 5G but they have to do with cancer and not viral infections.”", "“One of her tweets actually advised people to ‘turn off 5G by disabling LTE’. She is literally saying ‘turn off 5G by disabling 4G’,” said Sambo.", "Fabien Heliot, a researcher who specialises in electromagnetic exposure in wireless communication at the University of Surrey, explained: “5G, like previous generations of cellular communication systems, is a RF-based (radiofrequency) technology that uses electromagnetic (EM) waveform to transmit information; EM-waveforms are themselves non-ionizing radiations.”", "Heliot said the waveforms in 5G are designed and transmitted similarly to 4G. “The main and only difference so far is ... that 5G can transmit more data by using larger frequency bandwidth at higher carrier frequency, and directivity of antennas at the base station.”", "Being a living thing, a virus cannot be created by radiation, added Heliot. “Actually it is the other way round — there are guidelines put in place to ensure that radiation does not harm living things.”", "5G and health", "Heliot said that “the possible side-effects of 5G are the same as 4G, 3G, 2G, Wi-Fi; all these wireless communication technologies use EM waveform that radiates energy”.", "He said 5G radiations are not as severe as “CT scan or x-ray technologies” which are used in medical care.", "The World Health Organization's website states that “a large number of studies have been performed over the last two decades to assess whether mobile phones pose a potential health risk. To date, no adverse health effects have been established as being caused by mobile phone use”.", "Regarding 5G, the WHO states: “Health-related conclusions are drawn from studies performed across the entire radio spectrum but, so far, only a few studies have been carried out at the frequencies to be used by 5G.", "“Tissue heating is the main mechanism of interaction between radiofrequency fields and the human body. Radiofrequency exposure levels from current technologies result in negligible temperature rise in the human body.", "“As the frequency increases, there is less penetration into the body tissues and absorption of the energy becomes more confined to the surface of the body (skin and eye). Provided that the overall exposure remains below international guidelines, no consequences for public health are anticipated.”", "Some countries are remaining cautious: In late January, France's Agency for Health and Safety highlighted a need for more data before 5G could be rolled out in the country.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]