["About this rating", "The photo shows model Katherine Webb sitting next to a child at a sporting event. The caption reads \"Awkward Kiss Cams: See What Happened After This Moment.\" This piece of advertising clickbait has been served across the web:", "The link goes to a 25-page, ad-infested slideshow that does not include any entry about Katherine Webb or make rany eference to the photo above. That's probably because the picture has nothing to do with a \"kiss cam.\"", "The photo shows Webb — a model and former Miss Alabama USA — attending the 2013 Bowl Championship Series game between Alabama and Notre Dame. At the time, Webb (now Webb-McCarron) was dating then-Alabama quarterback (and current Houston Texan) A.J. McCarron. The couple married in 2014.", "The photo shown in the ad represents a briefly notable moment that has nothing to do with the child in the picture. The photo roughly captures the time when ESPN announcer Brent Musburger was criticized for spending an excessive amount of time describing Webb's physical appearance when introducing her as McCarron's girlfriend.", "The introduction of a \"kiss cam\" in the slideshow's headline is baseless innuendo designed to drive clicks to a page littered with advertisements. As such, the implication presented in the ad is false.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]