["A video is doing rounds on social media with claims that the Mumbai police caught terrorists who were planning to plant a bomb in Virar DMart, Mumbai.", "Caught by Mumbai police planing bomb in Dmart virar…", "Posted by Prithviraj Ujwalrani Prakash Patil on Thursday, 14 February 2019", "Several individual users on Facebook have shared the clip where policemen can be seen escorting a man, whose face is covered with a black cloth, into a police jeep.", "From what it seems, the video is circulating on WhatsApp as well.", "If one Googles ‘Virar DMart Mumbai’, the search results throw up a bunch of media reports which say that a mock drill was conducted at the hypermarket on January 14.", "A Times of India article reported the incident as – “A counter-terror mock drill was conducted at a hypermarket in Virar on Thursday evening.” The news media organisation further added, “The half-an-hour drill caught shoppers and public by surprise. The drill was conducted by the Palghar district police along with Riot Control Police ( RCP) and Quick Response Team ( QRT) at 5 pm at the Dmart hypermarket at Virar.”", "The report also includes a video of the mock drill, which is the same as the one circulating on social media.", "Boomlive earlier debunked the video and spoke to Jayant Bajbale, Sub-Divisional Officer, Virar who confirmed that the incident represents a routine counter-terrorism mock drill. “It was an exercise of 30 minutes. There were 25 people from the QRT, and 15 from RCP and some from the local police station,” Bajbale told Boom.", "This wasn’t the first time that a video of a mock drill was viral as terrorists caught by police. In the past, Alt News had found a similar case related to Telangana. A Jharkhand police mock drill was also viral with two different narratives – 1, 2.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]