["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Did Golden State Warriors basketball player Steph Curry part ways with Nike because the company wouldn’t let him put bible verses on his shoes?", "That’s what one viral rumor on social media claims.", "The post features a photo of someone on a basketball court donning a pair of white and blue Under Armor shoes. The words, \"I can do all things..\" are written on the side of the sneakers. That’s the beginning of the Phillipians 4:13 Bible verse, \"I can do all things through Christ who strengthens me.\"", "Text below the photo reads:", "\"Steph Curry had to make a decision to either stop writing scripture in his shoe before every game while wearing Nikes, or wear a sneaker made by a company who would support his vision. Steph Curry decided that his faith was more important that (sic) the fortune he earned from Nike, so he cancelled his deal with Nike and now wears Under Armor sneakers and they print the scripture in his shoes for him. As a believer never compromise your faith to make any deal, any situation ir (sic) relationship work. God will always provide you with partners and connections who support your vision.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "It is accurate that Curry writes a variation of Phillipians 4:13 on his shoes –– he has since his college days –– but there is no evidence to support the claim that his Nike endorsement deal fell through because the company wouldn’t allow him to write scripture on his shoes. There have been no statements from Curry, Nike or Under Armour that say religion was a factor in any dealmaking.", "According to ESPN, Nike and Curry split in 2013 after Under Armour offered Curry, a young basketball player who soon emerged as one of the best in the league, more money than Nike.", "Curry said he started writing Phillippians 4:13 on his shoes for encouragement while he was playing at Davidson College. He has written a variation of it on his sneakers ever since.", "In the 2013 offseason, Curry and his father, Dell Curry, attended a pitch meeting to extend the Nike contract.", "But in the meeting, the elder Curry told ESPN it was clear from the start that the company didn’t consider his son a top-tier athlete. Among other missteps, Dell Curry said a Nike official mispronounced Steph’s first name Stephen (which is pronounced traditionally) as \"Steph-on,\" and one powerpoint slide featured Kevin Durant’s name instead. ESPN reported that Dell Curry said he stopped paying attention after that, and while they sat through the entirety of the pitch, \"the decision to leave Nike was in the works\" Writes ESPN:", "\"In the meeting, according to Dell, there was never a strong indication that Steph would become a signature athlete with Nike. ‘They have certain tiers of athletes,’ Dell says. ‘They have Kobe, LeBron and Durant, who were their three main guys. If he signed back with them, we're on that second tier.’\"", "Curry went on to sign a $4-million-a year deal with Under Armour that Nike failed to match. In 2015, the partnership was extended through 2024.", "It’s true that Curry writes his favorite Bible verse on his shoes, but there is no indication Nike barred him from writing the verse or that any such conflict over Curry writing Bible verses inspired Curry to leave the company and join Under Armour.", "We rate this False.", "Facebook post, March 29, 2016", "ESPN, You won't believe how Nike lost Steph to Under Armour, March 23, 2016", "Jacksonville.com, Fact Check: Did Stephen Curry drop Nike over a Bible verse?, March 25, 2016", "USA Today Sports, Steph Curry explains why he writes Philippians 4:13 on his sneakers, March 21, 2018", "TruthorFiction, Nike Wouldn’t Let Steph Curry Put Bible Passage on Shoes-Fiction!, March 2, 2016", "Getty Images, New Orleans Pelicans v Golden State Warriors; March 14, 2016", "Snopes, Nike didn't sign Steph Curry because the NBA star insisted on putting a Bible verse on his sneakers, Feb. 29, 2016", "ESPN, Stephen Curry extends sponsorship deal with Under Armour through 2024, Sept. 16, 2015", "ESPN, Decoding the sneaker scribbles of NBA stars, March 19, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]