["About this rating", "In June 2016, a video showing a mother forcibly shaving her daughter's head was widely circulated via social media, along with a backstory holding that the girl had made fun of a bald cancer patient, so her mother chose to give her \"a taste of her own medicine\" and shave her head as a punishment for her bullying.  The most popular version of the video was posted to the Facebook page Bizarrefeed under the caption \"Mom Shaves Girl's Head After She Bullied Girl with Cancer\":", "https://youtu.be/Ukv8rRxUX0k\n\nHowever, the very same video had been circulated online well over a year earlier with nary a mention of cancer; rather, back then the clip was accompanied by the claim that the young woman had been punished with a head-shaving after her mother had found naked pictures of her on Facebook:", "Mother shaves her daughter bald after seeing naked pictures of her daughter on Facebook", "It is still unclear for us which language is being spoken, but we can clearly state that the daughter and the mother both need some serious help. It is not a normal method to shave your daughter bald after she has performed something bad.", "Yes, what the daughter has done is not good for anybody, but the reaction of the mother will only make the situation worse.", "Neither version of the video was accompanied by anything (other than repetition) documenting that the proffered backstory was true.  Some commenters maintained that the dialogue indicates the girl in the video was punished for some form of licentiousness and makes no mention of bullying or cancer patients:", "Actually, it's not about bullying someone with cancer. The young daughter was being punished for having premarital sex and the family agreed to cut hair to make her unattractive to young men. Don't believe the headlines you read especially when it's in a different language.", "The persons shown in the video are speaking Portuguese, and since we happened to be in Brazil at the time this video went viral, we asked some bilingual locals if they could understand the dialogue.  They all acknowledged that the audio was very difficult to make out, and they gave responses ranging from \"See what happens when you laugh at people with cancer ...\" to \"See what happens with your brother ...\" (and the former group admitted they may have been influenced by knowing the video's supposed backstory).", "The details of the video (such as whom it pictures, and when and where it was taken) are unknown, there is no substantive documentation of what it depicts, the dialog is unclear, and we don't know who filmed it or whether what it shows was real or staged, so what the video's true backstory is remains unclear.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]