["By Corey Berman", "Posted on March 12, 2019", "A viral meme falsely claims that actor Kurt Russell “speaks out” against the Democratic Party. But the quotation attributed to him is made up.", "A meme circulating on Facebook claims to be quoting Kurt Russell when it says, “If the Dems regain power they have promised to abolish the 1st, 2nd, 4th, 5th, & 6th amendments. Also the Senate, the Electoral College, the Supreme Court, borders, ICE, and more. When do we get to declare them enemies of the state?”", "The meme dates to at least Oct. 11, 2018, when it was posted on the Facebook page of “We the People,” which says on its “about” page: “Dispensing truth as I see it with a little humor.”", "A version of that meme has been shared thousands of times since then — including on the Facebook page of America’s Last Line of Defense, a self-described satire site. Memes shared on America’s Last Line of Defense in the past have caused confusion among readers who do not recognize the content as satire.", "The page announced this week a “clean” fresh start and promised that future posts would be “branded” satire and “100 percent transparent.” America’s Last Line of Defense deleted the Kurt Russell meme, which misspelled Russell’s last name, and many others.", "This is not the first time Russell’s political statements have been fabricated. Around the midterm elections, a debunked meme claimed the actor said President Donald Trump was “dedicated & determined.” As we wrote at the time, false celebrity quotes and rumors remain common on social media.", "Russell publicly has said little about his political beliefs. “I have my political point of view, of course,” he said in a 2015 interview. “But I don’t like espousing it publicly.” In the same interview, he criticized both liberals and conservatives and called himself a “hardcore libertarian.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "America’s Last Line of Defense. Facebook post. 10 March 2019.", "Fichera, Angelo. “Bogus Kurt Russell Quote Strikes Again.” Factcheck.org. 5 Dec 2018.", "Stern, Marlow. “Kurt Russell Talks Cowboys, Guns, and Life as Hollywood’s Most ‘Hardcore’ Libertarian.” The Daily Beast. 22 Dec 2015.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]