["On June 30, a protest rally was taken out in Meerut, Uttar Pradesh over the recent incident of lynching of Tabrez Ansari in Jharkhand. The next day i.e. on July 1, the Hindi publication Hindustan, which belongs to the Hindustan Times group, published an article in its Meerut edition headlined, “आईएसआईएस के झंडे भी लहराए गए !” (ISIS flags were also waved!- translation). There are two photographs published along with the article. In one of the photos, a black and white striped banner can be seen. In the other photo can be seen two black coloured flags. Hindustan (Meerut Edition) July 1, 2019", "The article meanwhile states, “BJP leaders have complained to the police alleging ISIS flags were waved during the peace rally. A video has also been released and a complaint has been filed with the intelligence bureau. It has been alleged that the flag is of an organisation involved in anti-national activities. It has also been alleged that such organisations were behind the rally. The matter should be investigated. On the other hand, the organisers of the rally claimed that they were the flags of the Jamiat Ulema” (translated from Hindi). Interestingly, the online version of this article has qualified this statement about ISIS flags with a question mark, unlike the e-paper version.", "It may be noted that the write-up exclusively states that BJP leaders have made this allegation of ISIS banners being waved at the rally. However, the headline of the article explicitly states that ISIS flags were waved. Interestingly, Alt News found that the Lucknow edition of the newspaper has a different title, with no mention of ISIS flags. Instead, it has been reported with the narrative that the BJP has alleged that ISIS flags were waved at the rally.", "Hindustan (Lucknow Edition) July 1, 2019", "According to reports, police resorted to lathicharge after the crowd turned unruly and pelted stones at police personnel present at the spot. Further, it has been reported that the organisers of the rally had not taken prior permission.", "Expectedly, this claim that ISIS flags were present at the rally in Meerut found its way on to social media.", "यही देखना शेष रह गया था…", "उत्तर प्रदेश के मेरठ जिले में कल जिहादियों ने लहराए आईएसआईएस(isis) के झण्डे…", "और साहब इनका विश्वास जीतना चाहते है…..", "इसे कहते हैं हिन्दुओ के साथ विश्वासघात…. pic.twitter.com/6axkVPUz8e", "— अनामिका (@NeelKam99232900) July 1, 2019", "The same has been asserted in an article on the website BreakingTube. The website has published communally charged misinformation in the past.", "Alt News spoke to Akhilesh N Singh, SP City Meerut, who categorically stated that there is no information about ISIS flags being waved at the rally. “We have not seen (ISIS flags at the rally)” (translated). When asked about the report by Hindustan that BJP leaders have lodged a complaint with the police regarding the supposed presence of ISIS flags, Singh said, “We have not received any such complaint. Perhaps Hindustan would be able to clarify on this.” (translated).", "He however added, “They (protesters) pelted stones and did not allow an ambulance to pass. They did not have permission for the rally. A notice had been issued to them regarding this.” (translated).", "In one of the photographs published by Hindustan (right), two black-coloured flags can be seen. Black flags are commonly used in protest rallies and marches.", "In the other photo, a black and white striped banner can be seen (left).", "Alt News found that it is the banner of the Jamiat Ulema-e-Hind, an organisation of Islamic theologians and scholars.", "Moreover, there are significant differences between the banner of the Jamiat Ulema-e-Hind and the ISIS. A juxtaposed comparison is posted below for reference.", "It may be reiterated that UP police has confirmed that no ISIS flags were seen at the rally in Meerut. The report by Hindustan is an example of misinformation.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]