["About this rating", "According to Thorn, the non-profit organization started by Ashton Kutcher and Demi Moore, the use of their digital tools by law enforcement agencies had helped identify almost 6,000 child victims of sex trafficking between September 2015 and September 2017.", "The software had helped rescue (as opposed to identifying) 103 child victims of sex trafficking.", "In August 2018, the actor and activist Ashton Kutcher was the focus of viral social media posts praising his efforts to combat child sex trafficking through Thorn, the non-profit organization he founded in 2009 along with his then-wife, the actor and activist Demi Moore.", "On 25 August, Ayanna Miller posted to Facebook, comparing the publicity and attention surrounding the rappers Cardi B and Nicki Minaj with that given to Kutcher's efforts, which she claimed involved rescuing 6,000 children from exploitation:", "A few days later, a user with the handle @idabitxh copied and re-posted that message to Twitter, garnering more than 230,000 retweets within days:", "We stay talking about Cardi n Nicki and who sells the most albums, but can we start talking about how Ashton Kutcher developed a software to find girls who are being sold into the sex trade? and with this software he has discreetly rescued over 6,000 girls from human trafficking", "— Huda ✨ (@idabitxh) August 30, 2018", "Both these viral social media posts exaggerated an important detail about the already-commendable work of Thorn, the charity started by Kutcher and Moore.", "In their 2017 impact report, the organization averred that their digital tools, the Spotlight software in particular, had played a role in identifying almost 6,000 child victims of sex trafficking, and rescuing 103 of them:", "With the help of Thorn’s tools, law enforcement and investigators have been able to identify 5,791 child sex trafficking victims and rescue 103 children from situations where their sexual abuse was recorded and distributed.", "As stated by Thorn themselves, the organization's digital tools had helped identify -- not rescue -- almost 6,000 child victims, a distinction that has sometimes been overlooked. In May 2018, People magazine wrote about Thorn's 2017 impact report, accurately stating that the software had \"assisted law enforcement in identifying 5,894 child sex trafficking victims and rescuing 103 children ...\" However, the headline of the same article was misleading, falsely stating \"Ashton Kutcher Helps Save 6,000 From Sex Trafficking via His Organization With Demi Moore\" (emphasis added).", "According to Thorn, those figures were derived from two annual surveys of law enforcement agencies who use the Spotlight software, suggesting that the data cover the period between September 2015 and September 2017.", "Thorn has averred that, in total, Spotlight has been used by 1,430 law enforcement agencies thoughout every state in the United States and in Canada as well. It has played a role in 21,044 investigations and contributed to the identification of 18,119 victims of sex trafficking and exploitation, among them 5,791 children. Additionally, the use of Spotlight has contributed to the successful rescue of 103 children, according to the organization.", "Thorn maintains that the Spotlight tool allows law enforcement agencies to more quickly and efficiently investigate suspected sexual exploitation by providing them with a database and archive of online escort advertisements. According to Thorn, Spotlight \"uses machine learning algorithms to analyze escort data in order to pro-actively identify suspicious ads.\"", "We asked Thorn for updated figures on the use of Spotlight and its success in identifying and saving children from sex trafficking, but we did not receive a response in time for publication.", "Thorn.   \"2017 Impact Report.\"\r\n    May 2018.", "Thorn.   \"Spotlight Impact.\"\r\n    January 2018.", "Petit, Stephanie.   \"Ashton Kutcher Helps Save 6,000 from Sex Trafficking via His Organization with Demi Moore.\"\r\n    People.   30 May 2018.", "Thorn.   \"Spotlight: Human Trafficking Intelligence and Insight.\"\r\n    Accessed 4 September 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]