["By Angelo Fichera", "Posted on January 3, 2020", "A viral video clip takes former Vice President Joe Biden’s recent remarks about sexual and domestic violence out of context, leaving a false impression that he made a racist comment about the role of African and Asian nations in U.S. culture.", "Social media posts have spread a selectively edited video clip of Joe Biden that leaves a false impression about what he said during a recent campaign event.", "The misleading clip suggests that the Democratic presidential candidate made a racist remark at his Dec. 30 event in Derry, New Hampshire, while talking about U.S. culture. But the edit — shared in some cases by social media accounts supportive of President Donald Trump — shows only 18 seconds of what Biden said during his hour-long rally.", "The edited video shows Biden saying only: “Culture, our culture, our culture. It’s not imported from some African nation, or some Asian nation. It’s our English jurisprudential culture, our European culture.” It deceptively omits key words at the start and end of his remarks. In context, Biden was talking about longstanding cultural issues related to the treatment of women.", "Biden’s full, relevant remarks — broadcast live on Facebook by ABC News — came in response to a woman’s question (39:07) about his work regarding women, sexual assault and domestic violence. The former vice president called for “fundamentally changing our culture” (39:47), and spent about 10 minutes talking about related issues.", "2020 candidate Joe Biden campaigns in Derry, New HampshireL IVE", "HAPPENING NOW: 2020 candidate Joe Biden campaigns in Derry, New Hampshire. https://abcn.ws/2K0BLjq", "Posted by ABC News Live on Monday, December 30, 2019", "Specifically, Biden referenced the (debunked) notion that the phrase “rule of thumb” dates to an English common law allowing a husband to beat his wife, so long as the object used was not bigger than the circumference of his thumb. We note that the Oxford English Dictionary says that that “suggestion … cannot be substantiated,” and academics have cast doubt that such a circumference rule was established by English common law.", "Biden, among other things, also spoke about the historical reluctance of Americans to talk about domestic violence, his work sponsoring the Violence Against Women Act of 1993, and the need to confront sexual assault on college campuses. And it was within that context that he made the remark in question (50:28):", "Biden, Dec. 30: Folks this is about changing the culture, our culture, our culture. It’s not imported from some African nation, or some Asian nation. It’s our English jurisprudential culture, our European culture, that says it’s all right.", "The deceptive edit gave no indication Biden was discussing sexual assault and domestic violence. Captions on Twitter and Facebook further reinforced the false impression that he was rejecting the role of African or Asian nations in U.S. culture.", "“It’s almost like Joe Biden is a Racist,” wrote one Twitter user. A Facebook page said that “Biden proclaims the ‘European’ identity of America.” And on Instagram, an account supportive of Bernie Sanders, posted the clip and called Biden a “white supremacist.”", "In a show of its reach on Twitter, the Biden clip was promoted in a now-deleted tweet from the conservative website the Daily Caller — a tweet that was shared by conservative TV host Graham Ledger, which was then retweeted by Trump.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“2020 candidate Joe Biden campaigns in Derry, New Hampshire LIVE.” ABC News. Facebook. 30 Dec 2019.", "Kelly, Henry Ansgar. “‘Rule of Thumb’ and the Folklaw of the Husband’s Stick.” Journal of Legal Education. Vol. 44. No. 3 (September 1994).", "Shapiro, Stephanie. “The misunderstood ‘rule of thumb.’” The Baltimore Sun. 17 Apr 1998.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]