["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Tyson Foods team members receive Covid-19 vaccines from health officials at the Wilkesboro, N.C. facility on Wednesday, Feb. 3, 2021. (AP Images for Tyson Foods)", "•  The post copies information from a federal database of reports on adverse events that happen after vaccination. The agencies that maintain the database warn that the reports do not indicate whether an adverse event is linked to or caused by the vaccine.", "•  Vaccine experts describe the database as an early warning system to flag issues that may need further study. To establish causation, researchers examine if an adverse event is significantly more common in a population of vaccinated people than in non-vaccinated ones.", "• Safety data involving tens of thousands of people have shown the approved COVID-19 vaccines to be safe and effective. ​", "Learn the Risk, an anti-vaccine group, recently published a post on Facebook with a list of people who died after receiving COVID-19 vaccines.", "\"AGE 25. MALE. Vaccinated 12/22/2020. Found unresponsive and subsequently expired at home on 1/11/2021. Moderna vaccine,\" reads the first of almost 30 entries featured in the Feb. 9 post.", "These entries are copied from the Vaccine Adverse Events Reporting System, a national vaccine safety surveillance program set up by the U.S. Centers for Disease Control and Prevention and the Food and Drug Administration that records health issues that arise after vaccinations in the U.S.", "The implication: That the reports show that COVID-19 vaccines contributed to the deaths of dozens of people, as young as 24.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Vaccine skeptics commonly cite VAERS reports as evidence that vaccines are lethal or otherwise dangerous. But the agencies that run the tracking system warn that the reports shouldn’t be misinterpreted. Search results on the system come with this caveat: \"VAERS reports alone cannot be used to determine if a vaccine caused or contributed to an adverse event or illness.\"", "Without further study, vaccine experts say, it’s not possible to tell whether a particular adverse event is linked to the vaccine or merely occurred afterward as a coincidence, and they cautioned against drawing inferences from reports published in the database.", "Without that context, posts like this one risk misleading people by implying that the vaccine caused or contributed to these deaths.", "An adverse event is a health problem that arises after someone has received a vaccine. VAERS accepts and records any and all reports of adverse events, and the government acknowledges that \"reports may contain information that is incomplete, inaccurate, coincidental, or unverifiable.\"", "To illustrate the shortcomings of the database, one physician reported that a vaccine had turned him into the Incredible Hulk, the comic-book character. Both the CDC and the physician confirmed to PolitiFact that his report was initially accepted and entered into the system as an adverse event.", "Since VAERS doesn’t show whether an adverse event was caused by the vaccine or occurred coincidentally, it’s generally not useful on its own for assessing whether a vaccine poses a risk to human health, said Dr. Walter Orenstein, associate director of the Emory Vaccine Center in Atlanta.", "Instead, vaccine experts said, VAERS should be seen as a \"hypothesis-generating\" system, which helps scientists decide which negative side effects to test for.", "For example, in 1999, VAERS reports helped physicians realize that a rotavirus vaccine was associated with a form of bowel obstruction called intussusception, said Paul Offit, director of the Vaccine Education Center at the Children's Hospital of Philadelphia. After physicians monitoring the system noticed a cluster of reports detailing intussusception in young vaccinated children, they commissioned additional studies comparing vaccinated patients with non-vaccinated patients. These studies found that the incidence of intussusception in vaccinated patients was significantly higher than in a control group. The vaccine was pulled from the market.", "In this case, VAERS was used as an early warning system that prompted scientists to commission more comprehensive studies. The reports weren’t themselves used to make a determination about vaccine safety.", "\"A system like VAERS can never answer the question of whether a vaccine causes a particular outcome,\" said Offit. \"The only way to establish causation is through a study involving a control group.\"", "The COVID-19 vaccines now being rolled out to the public were subject to these kinds of studies to determine whether they caused serious health issues. Tens of thousands of people participated in clinical trials last year to demonstrate to regulators that the COVID-19 vaccines were safe. To receive FDA emergency-use authorization, vaccine manufacturers Pfizer and Moderna had to follow up with at least half of participants for at least two months after they received their vaccinations.", "A Facebook post from an anti-vaccine group shows a list of people who died after receiving COVID-19 vaccines, implying that the vaccine caused or contributed to those deaths.", "The claim relies on reports from a federal tracking system of adverse events occurring after vaccinations. The agencies that maintain that system warn that the reports should not be used to draw conclusions about whether a vaccine causes a particular adverse event. To establish causation, experts look beyond isolated data points to studies of large groups of people to see if a negative symptom is more prominent in vaccinated people than in non-vaccinated ones.", "The COVID-19 vaccines have been proven to be safe and effective in tens of thousands of people.", "We rate this statement Mostly False. ​", "Learn the Risk, a Facebook post, Feb. 9, 2021", "VAERS, About Us", "Vaxopedia, Using and misusing VAERS reports, Aug. 24, 2019", "PolitiFact, CDC accepts all manner of reported vaccination effects--even symptoms of the Hulk, May 11, 2017", "New England Journal of Medicine, Intussusception among infants given an oral rotavirus vaccine, Feb. 22, 2001", "Interview with Paul Offit, director of the Vaccine Education Center at the Children's Hospital of Philadelphia, Feb. 15, 2021", "Email interview with Walter Orenstein, associate director of the Emory Vaccine Center, Feb. 16, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]