["A Facebook post, on a page named “MTN Promo” has been shared over 208,000 times since it was published about a month ago. We’ve archived the post here. The page shares a screenshot of what looks like a service message from MTN, with the caption: “MTN is giving out 122GB data to Customers for free. All you have to do to qualify is type MTN AWOOF AND SEND US A MESSAGE.”", "A similar Facebook page, with the name “MTN Data Promo”, also claims to be giving out 50,000 iPhone XR handsets. The page shared a picture of the yellow version of the iPhoneXR with a caption reading: “We have more than 50k of MTN customized iPhone in stock to give out. All you have to do to win this phone is to type ‘MTN IPHONE’ without interrupted then use the ‘SEND MESSAGE’ button to chat us.” The post, archive here, has been shared over 8,000 times since it was posted on September 28, 2019.", "Many more such pages exist on Facebook. We archived some of them here, here, and here.", "We contacted MTN Nigeria to verify the “MTN Promo” page, and we were told the page is not being run by the company.", "Funso Aina, MTN Nigeria spokesman, told AFP via mail that the firm advertises and communicates “ongoing campaigns and activations” via its website and social media channels.", "“I can confirm to you that the FB account does not belong to MTN and we are presently not running a promo like the one you have described,” Aina said.", "Here is MTN Nigeria’s official Facebook page.", "This sort of scam is common in Nigeria. It is used to attract followers to a new Facebook page and for gathering the names, phone numbers and other personal details of unsuspecting Facebook users, AFP found in August.", "The pages ask that you send a message to retrieve your gift. So we sent them a message, and got an automatic response, saying: “Congratulations Oluwamayowa Tijani, you have successfully applied for MTN Data Promo. Have you received your prize? if not then do this small task below to get yours. Now LIKE our page, Share our post on your TIMELINE and to 7 ACTIVE FACEBOOK GROUPS for others to benefit from the program too so we can send your data. Now give us 4hrs or more to verify you followed the instructions before we can grant your request. Remember we will go through your account so cheating is not allowed. MTN Cares!”", "Hours later, the page sends you a link to the supposed iPhone to be won, and asks you to enter vital details including your phone numbers and addresses.", "The pages grow their number of followers through these “tasks” and the numerous shares from unsuspecting Facebook users seeking to get the promised gifts.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]