["Some Facebook users were unexpectedly logged out of their accounts due to a system change. It wasn’t an update to a tool that tracks users off-Facebook activity.", "The company’s “Off-Facebook Tracker,” a tool that enables users to have more control over how Facebook traces them on the internet, has been on the website since January 2020 and is unrelated to the logout glitch.", "The tool does not give Facebook the ability to track users’ bank account or email activity.", "Scores of Facebook users found themselves unexpectedly logged out of the social media app recently, causing confusion, with people frantically trying to remember their long-forgotten passwords.", "But while Facebook says the glitch was due to a system change, posts on well, Facebook, pointed to a more insidious reason:", "\"Who got logged off Facebook last night?\" a post shared Jan. 23 says. \"Want to know why??? Facebook updated last night with a new feature. They can now track ‘OFF FACEBOOK ACTIVITY,’ bank accounts, email, apps.... To turn it off go into your Facebook Settings, scroll down to OFF FACEBOOK ACTIVITY, then click CLEAR HISTORY then click MORE OPTIONS then MANAGE FUTURE ACTIVITY and turn off FUTURE ACTIVITY.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) It isn’t accurate.", "Here’s what happened.", "On Jan. 22, Facebook said it was looking into reports of people being logged out of their accounts, receiving a \"session expired\" notification before being prompted to log back in. The company confirmed the following morning that engineers had fixed the issue.", "\"On January 22, a configuration change caused some people to be logged out of their Facebook accounts. We investigated the issue and fixed it for everyone on January 23. We’re sorry for the inconvenience,\" a Facebook company spokesperson told PolitiFact in an email.", "Technology news website Engadget found that iPhone owners were most affected by the glitch and that people using two-factor authentication were having the most trouble, as the SMS codes needed to log back in were taking a long time to reach users.", "Facebook confirmed that its \"Off-Facebook Activity\" tracker has nothing to do with the logout issues, and is not part of a new update. It’s been available on the website for exactly one year. And it does not give Facebook the ability to track your bank account or email activity, as the post claims. It’s a tool offered to users, not an advertising tool itself.", "The tracker enables users to have more insight into how the company traces them online. Businesses send Facebook information about a user’s activity on their websites, and Facebook uses that information to show relevant ads in their newsfeed.", "The Off-Facebook Activity tool now allows users to see a summary of that data and clear it from their accounts if they choose to, Facebook CEO Mark Zuckerberg said in a January 2020 blog post.", "The tracker shows 180 days’ worth of data collected by Facebook. Besides clearing that history, users can also tell Facebook to stop adding data from their accounts by clicking \"Manage Future Activity\" and then toggling off the button next to \"Future Off-Facebook Activity,\" according to the Washington Post. Quick warning: Turning off your off-Facebook activity will mean losing access to apps and websites that you’ve used Facebook to login to in the past.", "Changing these settings doesn’t stop Facebook from gathering data from other businesses, it simply \"disconnects\" that data from your profile, which mostly means the company won’t use it to target you with ads.", "Some Facebook users who were recently logged out of their accounts claim that the company did it purposely to install an off-Facebook tracker that accesses their bank accounts, emails and more.", "This is wrong. The forced logouts were due to a system change glitch and has nothing to do with the company’s Off-Facebook tracker. The tool allows users to see how the company traces their activity on the internet and has been on the social media website since January 2020.", "We rate this False.", "Facebook post, Jan. 23, 2021", "Engadget, Facebook inexplicably logs out iPhone users, Jan. 23, 2021", "USA Today, Fact check: Facebook configuration change caused users to be logged out, Jan. 25, 2021", "Facebook, Starting the Decade by Giving You More Control Over Your Privacy, Jan. 28, 2020", "Washington Post, Facebook will now show you exactly how it stalks you — even when you’re not using Facebook, Jan. 28, 2020", "Emailed statement from a Facebook company spokesperson, Jan. 28, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]