["About this rating", "Prince Harry and Meghan, the Duchess of Sussex, gave a bombshell interview to Oprah Winfrey on March 7, 2021. In the interview, the couple revealed that they fled their lives as members of the working royal family for the sake of their physical and mental health, as well as the well-being of their family.", "In one portion of the interview that got the internet buzzing, the couple discussed how after they left England, they abruptly found their safety compromised in the area where they initially settled near Vancouver, Canada. This was in the early weeks of the COVID-19 pandemic. A British tabloid had just published their exact location, and the royal family had withdrawn security for the couple.", "\"Suddenly it dawned on me, 'Hang on a second, the borders could be closed, we're having our security removed, who knows how long the lockdown's gonna be. The world knows where we are. It’s not safe, it’s not secure, we probably need to get out of here,'\" the Prince told Winfrey.", "And get out of there they did, with the help of entertainment mogul Tyler Perry, who let the family stay at his own home in Los Angeles and also provided them with security. They stayed at Perry's home for several months, saying that it \"gave us breathing room to try to figure out what we were going to do,\" the Duchess recounted. The couple now resides near Santa Barbara, California.", "The unexpected role Perry played in the saga drew humorous takes among social media users who imagined his comedic character Madea meting out royal revenge for the toxic environment and racist abuse the couple described coming from both Buckingham Palace and the British press.", "Our efforts to reach Tyler Perry Studios for comment have been unsuccessful. However, the fact that the couple stayed at Perry's home isn't a secret, even though some may have heard it for the first time during the Winfrey interview. The couple simply confirmed what had been widely reported in the spring and summer of 2020 about their living situation.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]