["About this rating", "In the summer of 2018, the \"zero-tolerance\" immigration policy implemented by the administration of President Donald Trump and Attorney General Jeff Sessions had far-reaching political and social consequences.", "The policy — which has caused thousands of migrant parents to be separated from their children, often in uncertain and difficult circumstances — has prompted intense scrutiny and criticism, including from religious leaders up to Pope Francis. This religious opposition stepped up in June 2018, when Sessions invoked a biblical verse to justify the policy, Romans 13:", "1 Let everyone be subject to the governing authorities, for there is no authority except that which God has established. The authorities that exist have been established by God.", "2 Consequently, whoever rebels against the authority is rebelling against what God has instituted, and those who do so will bring judgment on themselves.", "3 For rulers hold no terror for those who do right, but for those who do wrong. Do you want to be free from fear of the one in authority? Then do what is right and you will be commended.", "4 For the one in authority is God’s servant for your good. But if you do wrong, be afraid, for rulers do not bear the sword for no reason. They are God’s servants, agents of wrath to bring punishment on the wrongdoer.", "5 Therefore, it is necessary to submit to the authorities, not only because of possible punishment but also as a matter of conscience.", "On 19 June, reports emerged that members of the United Methodist Church (to which Sessions belongs) had initiated quasi-judicial proceedings against him, including charges of child abuse:", "More than 600 clergy and lay members of the United Methodist Church have signed a letter bringing church charges against fellow member Attorney General Jeff Sessions for the zero tolerance immigration policy that has resulted in the separation of undocumented children from their parents at the U.S.-Mexico border.", "The formal accusation, issued on Monday, charges Sessions with numerous violations of the denomination’s Book of Discipline, including child abuse, immorality, racial discrimination and, for his citation of Romans 13 to defend the policy, the dissemination of doctrines contrary to the standards of the UMC.", "These reports are accurate. On 18 June 2018, some 640 United Methodist Church members and leaders signed their names to an open letter addressed to Rev. Sterling Boykin, a pastor at Sessions's home church in Mobile, Alabama, and Rev. Tracy Wines, a pastor at the Arlington, Virginia UMC congregation where Sessions regularly attends. The letter read:", "We write to you, Mr. Sessions’ pastors...in the hopes that you will, as members of our connectional system, dig deeply into Mr. Sessions’ advocacy and actions that have led to harm against thousands of vulnerable humans.", "The signatories, led by Rev. David Wright, a UMC pastor from Washington state, wrote that they hoped to avoid a trial against Sessions in the church's courts system, preferring instead a less formal \"reconciling process.\" Nonetheless, the group leveled four separate charges against the United States Attorney General:", "Under UMC rules, any member can bring a complaint against any other member based on their conduct, or an alleged violation of the church's Book of Discipline. Typically, efforts are made to de-escalate grievances via mediation by church leaders and measures such as \"supervision\" or \"just resolution.\" However, occasionally complaints can reach the UMC's Judicial Council, and pastors can be suspended or removed from their positions.", "In 2005, the Judicial Council caused controversy by handing down a series of rulings which excluded the LGBTQ community from participation in the church. The council defrocked a Philadelphia-based UMC minister on the grounds that she had publicly declared herself a lesbian and openly carried out a relationship with another woman, and it upheld the right of a pastor in South Hill, Virginia to prevent an openly gay man from joining his congregation.", "According to Rev. William Lawrence, a theologian, UMC elder and professor emeritus of American church history at Southern Methodist University in Dallas, Texas, it would be unprecedented for formal charges against a lay member (as opposed to a pastor) to escalate to the level of a church trial, rather than being resolved with mediation at the local or regional level. Lawrence told United Methodist News:", "I’m not aware of any circumstance in the 50-year history of The United Methodist Church when a complaint against a lay person moved beyond the stage of its resolution by a district superintendent or a pastor.", "We asked Rev. Tracy Wines and Rev. Sterling Boykin — Sessions's pastors and the addressees of the open letter — for their response to the charges, as well as their views on the Attorney General's \"zero-tolerance\" immigration policy and the separation of children from their parents. We did not receive a response from either pastor, in time for publication.", "However, a spokesperson for the Alabama-West Florida Conference, in which the Attorney General's home church is located, directed us to a statement issued on 18 June by the conference's bishop David Graves, who wrote:", "...It deeply troubles me and burdens my heart that innocent immigrant children are being separated from their parents. It was difficult to celebrate Father’s Day knowing these unjust acts were ongoing in this country.", "The 18 June complaint letter is arguably the most significant public UMC criticism to date of Sessions's immigration policy and the separation of children from their parents, but it is not the first time the Attorney General's co-religionists have voiced their opposition.", "On 15 June, Rev. Dr. Susan Henry-Crowe, who is the General Secretary of the UMC's General Board of Church and Society and a senior national official in the church, described the zero-tolerance immigration policy in scathing terms, calling Sessions's Biblical defense a \"shocking violation of the spirit of the Gospel\":", "In early May, Attorney General Jeff Sessions announced a “zero tolerance” policy resulting in de facto family separation: children are immediately removed from their parents as they are apprehended after crossing the U.S.-Mexico border. And three days ago, the Attorney General also announced a policy reversing protections for asylum seekers fleeing domestic abuse and gang violence. Neither threat of violence is now considered grounds for asylum.", "Furthermore — and in response to the ardent opposition from a wide array of faith communities — the officials responsible for these policies have recently used Christian scripture to justify their actions.", "To argue that these policies are consistent with Christian teaching is unsound, a flawed interpretation, and a shocking violation of the spirit of the Gospel.", "She added: \"Christian sacred texts should never be used to justify policies that oppress or harm children and families\" and urged UMC members to contact Sessions's Department of Justice directly to register their opposition to the policy, pointedly referring to him as \"our fellow United Methodist.\"", "Former First Lady Laura Bush (a prominent UMC member along with her husband, former President George W. Bush) condemned Sessions's policy as \"cruel\" and \"immoral\" and likened it to the internment of people of Japanese descent during World War II, in a high-profile column in the Washington Post.", "The Bush family's Dallas, Texas UMC pastor, Rev. Paul Rasmussen, had harsh words for Sessions' invocation of the Bible in defense of the immigration policy:", "The use of Holy Scripture to justify the separation of children from their parents is as ignorant and egregious an affront to God’s word as I’ve seen in ministry.", "— Paul Rasmussen (@revrasmussen) June 16, 2018", "We asked the Department of Justice for Sessions's response to these criticisms, as well as the complaint letter signed by 640 of his fellow UMC members and the charges brought against him, but we did not receive a response in time for publication.", "LaCapria, Kim.  \"Was the 'Law to Separate Families' Passed in 1997 or 'by Democrats'?\"\r\n  Snopes.com.  18 June 2018.", "Ingber, Sasha.  \"Faith Leaders Oppose Trump's Immigration Policy of Separating Children From Parents.\"\r\n  National Public Radio.  16 June 2018.", "Horowitz, Jason.  \"Pope Francis Criticizes Trump Administration on Family Separations.\"\r\n  New York Times.  20 June 2018.", "Long, Colleen.  \"Sessions Cites Bible to Defend Separating Immigrant Families.\"\r\n  Associated Press.  15 June 2018.", "Kuruvilla, Carol.  \"Methodists Bring Church Charges Against Jeff Sessions for Border Policy.\"\r\n  Huffington Post.  19 June 2018.", "United Methodist Church.  \"Book of Discipline: Chapter 362 -- Complaint Procedures.\"\r\n  UMC.org.  Unknown publication date.", "United Methodist Church.  \"Jurisdiction and Powers of the Judicial Council.\"\r\n  UMC.org.  2016.", "Banerjee, Neela.  \"Methodist Court Removes Openly Lesbian Minister.\"\r\n  New York Times.  1 November 2005.", "Hodges, Sam.  \"Clergy, Laity File Complaint Against Sessions.\"\r\n  United Methodist News/UMC.org.  18 June 2018.", "Bush, Laura.  \"Separating Children From Their Parents at the Border 'Breaks My Heart.'\"\r\n  Washington Post.  17 June 2018.", "Graves, Bishop David.  \"A Statement From Bishop David Graves Regarding Immigration and Family Separation.\"\r\n  Alabama-West Florida Conference of the United Methodist Church.  18 June 2018.", "Henry-Crowe, Rev. Dr. Susan.  \"Statement -- A Shocking Violation of the Spirit of the Gospel.\"\r\n  The United Methodist Church.  15 June 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]