["By Saranac Hale Spencer", "Posted on July 26, 2018", "Q: Has San Francisco given noncitizens “the right to vote in elections”?", "A: Yes, but only in San Francisco school board elections and only for parents, guardians or legal caregivers of children in the city’s schools.", "Has California State Governor Brown granted immigrants, illegal or not, the right to vote in State and/or National elections?", "and", "Is it true that San Francisco is registering non-U.S. citizens to vote?", "Voters in San Francisco approved a measure that will allow noncitizens with children to vote in school board elections.", "Stories about that measure — some of which are misleading — have prompted readers to ask us if it’s true.", "These are the facts:", "In 2016, San Francisco voters approved Local Measure N, with 54 percent of voters in favor. That measure allows any immigrant living in San Francisco who is of legal voting age and is the parent, guardian or caregiver for a child under the age of 19 to vote in school board elections. Noncitizens are not permitted to vote in any other elections.", "The law is in effect for the Nov. 6, 2018, school board election and will expire in 2022, unless the city’s board of supervisors votes to extend it, according to the San Francisco Department of Elections.", "Also, any information provided by immigrants registering to vote in school board elections will be accessible to federal agencies, including Immigration and Customs Enforcement, according to the elections department.", "Some stories circulating online have highlighted the ability of immigrants to vote, without giving equal weight to the crucial aspect that they are allowed to vote only in San Francisco school board elections.", "One such story was posted on the website American Journal Review, which tells readers on its “About” page that it “should not be considered an unbiased news source, rather we publish opinions and interpretations of the day’s news by Conservative and Libertarian bloggers.”", "That story cited an unfounded claim that 3 million votes were cast in the last presidential election by “illegal aliens,” an assertion that was first made by Gregg Phillips, who has advanced theories about widespread voter fraud, shortly after the 2016 presidential election and highlighted by then President-elect Donald Trump and the conspiracy theory website InfoWars. (We debunked several claims Trump has made — without evidence — about supposed voter fraud in the election. Numerous studies, including a 2014 Government Accountability Office report, have found the in-person voter fraud the president, and Phillips, alleged is virtually nonexistent.)", "At the time, Phillips said that an organization called True the Vote would “initiate legal action” based on his claim.", "However, True the Vote didn’t pursue it, according to the organization’s president, Catherine Engelbrecht.", "Although the American Journal Review story distorts the facts, it has been shared on social media pages with a combined following of more than 3 million and has been copied by at least two other dubious websites.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "Noncitizen Voting in School Board Elections — Ordinance No. 128-18. San Francisco Municipal Elections Code. 9 May 2018.", "Non-Citizen Registration and Voting. San Francisco Department of Elections. Accessed 25 Jul 2018.", "“Voters Still See Voter Fraud As A Problem.” Rasmussen Reports. 14 Jun 2018.", "“Voter Fraud.” HuffPost/YouGov. Huffingtonpost.com. 20 May 2018.", "Trump, Donald. “Serious voter fraud in Virginia, New Hampshire and California – so why isn’t the media reporting on this? Serious bias – big problem!” Twitter. 27 Nov 2016.", "Trump, Donald. “Remarks by President Trump at a Roundtable Discussion on Tax Reform.” White Sulphur Springs, West Virginia. 5 Apr 2018.", "Brennan Center For Justice. “Debunking the Voter Fraud Myth.” Brennancenter.org. 31 Jan 2017.", "“BREAKING: San Francisco Gives Illegal Aliens The Right To Vote in Elections.” AmericanJournalReview.com. 18 Jul 2018", "Engelbrecht, Catherine. President, True the Vote. Email response to FactCheck.org. 25 Jul 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]