["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Ann Wagner, R-Mo., has been circulating a petition, encouraging constituents to add their names to \"Stand for Life\" against Satanists, the ACLU and Planned Parenthood.", "She’s posted on Twitter and Facebook, linking to a petition on her campaign website, that says \"Satanists have teamed up with the ACLU and Planned Parenthood in Missouri to roll back the rights of the unborn.\"", "She went into more detail in an Oct. 25 Facebook post, Wagner wrote, \"As Planned Parenthood continues its march through Missouri to expand abortion practices, an organization called the Satanic Temple has emerged as their ally, pressuring legislators and filing state and federal lawsuits in an attempt to erase protections for the unborn. I refuse to stand by as unabashed Satanists challenge our respect for life in Missouri. Add your name to stand in support of life.\"", "In her social media posts, Wagner also includes a graphic that shows a red pentacle next to the text, \"Stand Against Planned Parenthood and The Church of Satan.\"", "We reached out to Wagner to see where she was getting this information. Her campaign manager, Brecht Mulvihill, sent us a link to a statement from The Satanic Temple, and linked to articles from The Kansas City Star, St. Louis Post-Dispatch, Newsweek, Slate and Huffington Post.", "We wanted to know, has The Satanic Temple \"teamed up\" with the ACLU and Planned Parenthood in Missouri as Wagner claims on her website?", "Planned Parenthood and The Satanic Temple have taken separate court cases seeking to lower restrictions on abortion in Missouri.", "In November 2016, Planned Parenthood filed a lawsuit challenging a Missouri statute that required abortion clinics to be licensed as \"ambulatory surgical centers.\" The lawsuit also challenged requirements that stipulated that physicians who provide abortions must have admitting privileges from a nearby hospital. After a judge ruled in favor of Planned Parenthood, Missouri Attorney General Josh Hawley and Director of Department of Health and Senior Services Randall Williams appealed the case.", "Most recently, Planned Parenthood and the ACLU of Missouri lost a separate lawsuit that challenged the state’s 72-hour waiting period requirement.", "The Satanic Temple has filed its own lawsuits at both a state and federal level challenging the state’s informed consent materials, ultrasound and 72-hour waiting period requirements.", "The organization is claiming the requirements violated a Satanic Temple member’s First Amendment rights.", "One of the first outlets to report the simultaneous court cases was a Slate article published on Sept. 12.", "The author suggests a recent increase in abortion access in the state may be because of The Satanic Temple’s lawsuit, writing, \"Missouri’s recent stroke of good fortune in the reproductive rights realm may have to do with intervention from the fiery underworld.\"", "The Slate article was picked up by other sites and is referenced in other articles from outlets such as The Kansas City Star and Patheos. Brietbart also wrote about the recent efforts by Planned Parenthood and The Satanic Temple.", "However, the Brietbart article took the story a bit further and claimed in its headline that the two organizations teamed up and that, \"The Satanic Temple has often lent its muscle to pro-abortion efforts alongside Planned Parenthood.\"", "The fact-checking website Snopes debunked this and rated this claim false in a fact-check published on Sept. 14.", "The Satanic Temple also tweeted about their independence:", "Wagner not only claimed that The Satanic Temple was \"teaming up\" with Planned Parenthood, but also the ACLU. Spokespersons from both organizations said there was no relationship with the temple.", "Lucien Greaves, co-founder and spokesman for The Satanic Temple, said early attempts to get the ACLU’s help didn’t work.", "\"We are not collaborating nor competing with Planned Parenthood and we have no formal relationship with the organization,\" Greaves said. \"We contacted the ACLU of Missouri when we were initially seeking legal counsel for the case we’re now litigating. After a few enthusiastic calls wherein we were led to believe they were interested in taking our case they soon stopped responding to our messages and we never heard from them again.\"", "Laurie F. Maffly-Kipp, a professor in the humanities and religious studies program at Washington University in St. Louis, observed that Wagner may be drawing connections between the two groups for political reasons.", "\"It looks like a scare tactic to me,\" Maffly-Kipp said. \"My observation is that many conservative Christians use the specter of Satanism as a way to rally support behind their cause.\"", "So what does The Church of Satan have to do with all of this?", "In Wagner’s Facebook post, she names The Satanic Temple in the text but also names The Church of Satan in the accompanying graphic. Those are two separate organizations.", "The Church of Satan pointed this out to Wagner by replying to her tweet with the incorrect graphic on Oct. 25, writing, \"We have nothing to do with this,\" and linking to a statement on its website.", "We reached out to The Church of Satan, which confirmed that Wagner seems to have its organization confused with The Satanic Temple.", "The Church of Satan said it has not received a response from Wagner to its tweet, and said it believes the confusion began with \"a mix of ignorance, laziness, and intentional misinformation.\"", "Rep. Ann Wagner claimed on her campaign website that \"Satanists have teamed up with the ACLU and Planned Parenthood in Missouri to roll back the rights of the unborn.\"", "The Satanic Temple, Planned Parenthood and the ACLU have all disputed the notion that the organizations are collaborating, teaming up or acting as allies.", "Furthermore, Wagner has incorrectly lumped the Church of Satan with The Satanic Temple.", "To hell with this claim. We rate it False.", "Tweet by Ann Wagner, Oct. 25", "Facebook post by Ann Wagner, Oct. 25", "Petition on Ann Wagner’s campaign website", "Tweet by The Satanic Temple, Sept. 14", "Tweet by the Church of Satan, Oct. 25", "Email Exchange, Brecht Mulvhill, Ann Wagner for Congress Campaign Manager, Nov. 6", "Email Exchange, Lucien Greaves, The Satanic Temple co-founder and spokesman, Nov. 6 and 14", "Email Exchange, The Church of Satan, Nov. 6", "Email Exchange and Phone Interview, Jesse Lawder, vice president for marketing, communications and external relations of Planned Parenthood of St. Louis Region and Southwest Missouri, Nov. 8-10", "Email Exchange, Daniela Velázquez, Director of Communications of the ACLU of Missouri, Nov. 9", "Email Exchange, Laurie F. Maffly-Kipp, Washington University in St. Louis professor, Nov. 11", "Slate article, Sept. 12", "Brietbart article, Sept. 13", "Snopes Fact Check, Sept. 14", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]