["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In March 2020, social media users started sharing clips from the 2018 South Korean television show \"My Secret Terrius,\" which supposedly showed characters using the word \"coronavirus.\"", "This is a real scene from a 2018 show. But while many people may have only heard the word \"coronavirus\" for the first time in 2020, it has been around for decades.", "Scientists first identified human coronaviruses in humans in the 1960s. Since then, we've seen a few coronavirus outbreaks, such as the MERS (Middle East respiratory syndrome) outbreak in 2012 and the SARS (severe acute respiratory syndrome) outbreak in 2002. In a longer version of this clip, the TV doctor explains how these diseases all come from the same group of viruses:", "The fictional coronavirus in the show is also rather different from the strain of coronavirus (COVID-19) that was spreading around the globe in early 2020. In the show, someone \"tweaked\" the virus in order to make it more deadly. In reality, that simply isn't possible. COVID-19 is not a human-made bioweapon. (You can read about that conspiracy theory's origins and scientific failings here.)", "The coronavirus in the show also has a 90% mortality rate. While we still have a lot to learn about COVID-19, the disease does not have a 90% mortality rate. The case fatality rate differs from country to country and can be influenced by various factors, such as the availability of supplies at hospitals. In places like Italy, where the outbreak has been severe, the fatality rate has climbed as high as 11%. In places like South Korea, where outbreaks were mitigated with a massive testing program, the fatality rate has been just over 1%.", "We should also note that some social media users shared clips of \"My Secret Terrius\" along with the claim that this was a \"Chinese\" show. While that may play into the human-made bioweapon conspiracy theory (again, that is a false rumor), this show actually comes from South Korea.", "In short: A 2018 show South Korean show called \"My Secret Terrius\" does mention the word \"coronavirus.\" However, this term predates the show by several decades. Furthermore, the fictional virus does not share the same traits as the strain of coronavirus (COVID-19) that was spreading around the world in early 2020.", "In other words, while COVID-19 is caused by a coronavirus, not all coronaviruses cause COVID-19.", "Henriques, Martha.   \"Coronavirus: Why Death and Mortality Rates Differ.\"  \r\n  BBC.   1 April 2020.", "Resnick, Brian.   \"12 Things Everyone Needs to Know About the Coronavirus Pandemic.\"\r\n    Vox.   2 April 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]