["Here we go again: A questionable Winston Churchill quote caught our fact-checking attention, continuing the trend of social media users posting bogus quotes of the British statesman online", "The Aug. 28 Facebook post features a photo of Churchill alongside text that reads:", "\"You have enemies? Good. That means you’ve stood up for something, sometime in your life. -Winston Churchill\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This quote does not belong to Churchill. It could not be found on the International Churchill Society’s website or in the Churchill Archive, which contains more than 800,000 pages of original documents. It is also included in the running list of \"All the ‘Quotes’ Winston Churchill Never Said\" by Richard Langworth, senior fellow at the Hillsdale College Churchill Project.", "David Freeman, director of publications at the International Churchill Society, told PolitiFact the quote is commonly misattributed to Churchill.", "\"It’s a common red herring,\" Freeman wrote in an email. \"Churchill never said it.\"", "The statement stems from an essay written by Victor Hugo some 30 years before Churchill was born.", "The quote is a modernized variation of a passage Hugo wrote in his 1845 essay \"Villemain:\"", "\"You have enemies? Why, it is the story of every man who has done a great deed or created a new idea. It is the cloud which thunders around everything that shines. Fame must have enemies, as light must have gnats. Do not bother yourself about it; disdain. Keep your mind serene as you keep your life clear.\"", "A Facebook post quotes Winston Churchill as once saying that having enemies is good because \"that means you’ve stood up for something, sometime in your life.\"", "The original version of the quote actually came from Victor Hugo in 1845, not Churchill.", "This post is False.", "Facebook post, Aug. 28, 2019", "Gizmodo, 9 Quotes From Winston Churchill That Are Totally Fake, Dec. 29, 2016", "Intellectual Takeout, 5 Famous Things Churchill DIDN'T Actually Say, Nov. 9, 2015", "International Churchill Society resources, Accessed Sept. 4,2019", "Churchill Archive search, Sept. 4, 2019", "RichardLangworth.com, All the \"Quotes\" Winston Churchill Never Said (1), Nov. 8, 2018", "Google Books, Things Seen and Essays by Victor Hugo, pg. 67, Accessed Sept. 4, 2019", "Quote Investigator, You Have Enemies? Why, It Is the Story of Every Man Who Has Done a Great Deed or Created a New Idea, Sept. 11, 2018", "Email interview, David Freeman, director of publications for the International Churchill Society, Sept. 4, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]