["The video was published here on Facebook on August 16, 2020.", "The post’s Hindi-language caption translates to English as: “The protectors of the constitution hoisted a blue flag instead of the tricolour today on the occasion of the Independence Day. Police arrived and attracted waving their sticks.”", "The blue flag represents the Dalit resistance, an anti-government party who says it is striving for equality in India, as reported here in AFP.", "“Tricolour” is a reference to India’s national flag.", "The video was also shared here, here, here, here and here on Facebook alongside a similar claim.", "The claim, however, is misleading.", "A reverse image search on Google found a similar video published here on YouTube on March 25, 2020.", "The video is titled “The Result of Violating Lockdown”. The footage in the misleading post corresponds to the YouTube video from the beginning to the 20-second mark.", "Below is a screenshot comparison of the misleading post (L) and the YouTube video (R):", "A screenshot of the YouTube video was also published here on Rajasthan Patrik, a local Hindi daily newspaper on March 25, 2020.", "India announced it had implemented a lockdown on March 25, 2020, as AFP reported here. Police officers were seen swinging \"lathi\" batons, a long hardened bamboo cane, to control some crowds on the street, as AFP reported here.", "A frame-by-frame analysis of the video shows the badge on the police officer’s uniform at the 11-second mark and the logo on the police car at the 20-second mark. It suggests the incident happened in Maharashtra, the western peninsular region of India.", "The same police officer uniform can be seen in the photos published here on Twitter by the Beed District Police on August 16, 2020.", "The logo seen on the police car, circled in red by AFP below, corresponds with the logo of the Maharashtra Police.", "The Hindi-language caption on the logo translates in English as: “Maharashtra Police”.", "The misleading post was also debunked by an Indian fact-checker BOOM here on August 16, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]