["About this rating", "In February 2019, a photograph supposedly showing a billboard in Dallas, Texas, featuring a hijab-wearing woman circulated on social media along with an Islamaphobic comment stating that the \"enemy is here\":", "This is a genuine photograph of a billboard seen in the U.S. While we haven't been able to pinpoint the source of this specific image, billboards featuring an image of a hijab-wearing woman were displayed in several major cities in the United States in 2019, including Dallas, Texas.", "The Islamic Circle of North America, a grassroots organization in the American Muslim community, and GainPeace, a non-profit organization whose main goal is to educate the general public about Islam, teamed up in February 2019 to create this billboard campaign with the purpose of supporting women who wear hijabs and dispeling rumors about Islam for the general public:", "A local Islamic group launched a billboard campaign to educate people about the hijab, the headscarf that’s often worn by Muslim women.", "The billboards are the first of their kind in the country, designed by a group called GainPeace, which encourages non-Muslims to call the organization and ask questions to gain a better understanding of why women wear the hijab. The billboards draw a similarity to the Christian religion where Mary is considered the mother of Jesus. She also wore a hijab ...", "“Wearing the hijab is 100 percent my choice. As contrary to the popular belief, hijab in no way oppresses us. In fact, it indicates the opposite as hijab symbolizes the power to women, and not inferiority,” Sara Ahmed, GainPeace volunteer, said.", "“Hijab is a simple yet powerful reminder of strength. I stand here today so that generations tomorrow do not feel deprived or threatened by their choice of dress. So that they may have the courage to stand by their beliefs, and so that this piece of cloth does not label them or categorize them with an unwanted label,” Kiran Malik, GainPeace volunteer, said.", "Ruman Sadiq, an outreach volunteer with the Dallas Chapter of the Islamic Circle of North America, said that the billboards had already generated a conversation in the city, and that while she received at least one call from a woman who was upset about the billboards, the call ended on a positive note:", "The groups want to show that the hijab is a sign of empowerment and that women of other religions also cover their heads. They point to Mary, the mother of Jesus, who wore a veil, and nuns.", "“It is also a form of liberation from strangers who dictate how women should dress in the society to be successful,” Sadiq said. “It’s to free us ourselves from being judged by our physical beauty, but rather our intellect and our character. It’s to preserve our modesty.”", "The billboard is already drawing attention and phone calls. Sadiq talked about an hour-long phone call the group received from an angry caller, who was upset about the billboard.", "“It was a 62-minute dialogue that we had with her and it ended on a very positive note,” Sadiq said. “She was very happy to clarify the misconceptions she had about the veil.”", "Here's a news report from the Chicago television station WGN about a similar billboard in that area:", "While the image of this billboard was frequently circulated on social media with comments about the \"enemy is here,\" the Anti-Defamation League's Center on Extremism pointed out that domestic right-wing extremists had accounted for far more deaths in the United States than Islamic extremists over the previous decade:", "ADL’s Center on Extremism, which has aggregated data going back to 1970, shows that over the last decade, a total of 73.3 percent of all extremist-related fatalities can be linked to domestic right-wing extremists, while 23.4 percent can be attributed to Islamic extremists. The remaining 3.2 percent were carried out by extremists who did not fall into either category.", "Anti-Defamation League.   \"Right-Wing Extremism Linked to Every 2018 Extremist Murder in the U.S., ADL Finds.\"\r\n    23 January 2019.", "Chavez, Stella.   \"Islamic Group Launches Hijab Billboard Campaign.\"\r\n    KERA News.   19 February 2019.", "Chavez, Stella.   \"Billboard Campaign in Dallas Aims to Dispel Misconceptions About Islam and the Hijab.\"\r\n    KERA News.   22 February 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]