["About this rating", "A pastel-colored wild bird reminiscent of a tub of sherbet ice cream created a flutter on social media in March 2021.", "A photograph of the brightly colored bird — complete with bright purple, orange, and green plumage — was shared on Twitter on March 8 by actor Sam Richardson. At the time of this writing, the post had been liked more than 18,000 times.", "Screengrab/Twitter", "And though the bird may look like a cross between a pigeon and a tie-dyed shirt, the photograph in question is real. A reverse-image search revealed that the photograph was taken on Jan. 29, 2012, and originally shared to Flickr by Singapore-based photographer Chon Lip Mun.", "The featured bird is known as a pink-necked green pigeon. Its scientific name is Treron vernans. According to the Field Museum of Natural History in Chicago, the bird is found in the subtropical and tropical habitats of Southeast Asia, including lowland and mangrove forests.", "Though the colorful bird does exist in the wild, it was not immediately clear if the viral photograph had been edited or enhanced in any way, though other photographs of the pigeon species show the colors as vibrantly. In an email to Snopes, a spokesperson with the Audubon Society said that they \"can’t say definitively, but the colors in this photo appear to be a bit more intense than other photos of the species.\" Snopes also contacted Mun but did not receive a response by the time of publication.", "Male pink-necked green pigeons are characterized by a powder-pink neck with an orange breast patch, gray-blue head, and yellow belly, according to the birdwatching site eBird. Females tend to be less striking in color and lack the pink- and orange-hued head and neck. Based on this information, it is likely that the photographed bird was a male.", "\"This pigeon species is sexually dimorphic, with the males being brighter and more colorful than females, which are yellow-green. So, the coloration is likely tied to mate choice,\" wrote Audubon.", "With stable populations throughout its home range, the pink-necked green pigeon is considered a species of least concern by the International Union for Conservation of Nature.", "And if you thought the pink-necked green pigeon was a sight to behold, be sure to check out the little green pigeon, the thick-billed green pigeon, and the cinnamon-headed green pigeon.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]