["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "With a jobless rate that continues to inch up in New Jersey, some state officials are focusing on more optimistic labor data.\n\nBut after a report last week that showed the state’s unemployment rate ticked up to 9.9 percent as 5,300 jobs were added in August, a Republican lawmaker trying to accentuate the positive fumbled her facts.\n\n\"We have more people working in the state of New Jersey today than we've ever had in our history, \" state Sen. Jennifer Beck told NJToday on Sept. 20. \"So we still have a struggle with those that are unemployed and looking, but we know businesses feel positive about what's going on in our economy and they're looking to hire and we got to keep working at it.\"\n\nWith a nearly double digit jobless rate, are more people working in New Jersey now than ever before?\n\nThat’s not true.\n\nBeck said in an e-mail that she misspoke, saying she \"meant to say ‘workforce’ instead of ‘working.’\"\n\nBut the key takeaway, she said, is \"that there are positive signs for our economy in the midst of some negative ones.\"\n\nThe labor force, as measured by the U.S. Bureau of Labor Statistics, includes employed people and those unemployed but looking for a job. People who are unemployed and not seeking work are not counted.\n\nIn June the number of people in New Jersey’s labor force was the highest ever, but that figure dropped in July and again in August.\n\nAlso, as a percentage of the state’s population -- excluding individuals younger than 16 years old, people who are institutionalized and active duty service members -- there’s instances dating to the late 1980s of greater participation in the labor force than now.\n\nAs for employment, the state isn’t setting any records.\n\nThe number of employed residents -- as well as the number of jobs in New Jersey, which the federal labor department measures in a separate survey -- peaked in the beginning of 2008 before falling precipitously during the last recession.\n\nFrom December 2007 through June 2009 -- the official start and end of the last recession, according to the National Bureau of Economic Research -- more than 140,000 New Jersey residents lost their job.\n\nAt the same time, the state shed more than 190,000 jobs overall, according to data from the federal labor department.\n\nAny gains since then have not been substantial enough to push the state above pre-recession peaks.\n\nIn August, according to preliminary data, less than 4.13 million New Jersey residents were employed, down from nearly 4.29 million in February 2008.\n\nThe state had roughly 4.1 million jobs -- including public and private sector employment -- in January 2008. Now, the state has more than 3.9 million jobs overall.\n\nSo the raw numbers prove Beck wrong.\n\nBut it’s also important to compare labor data as a rate to account for the size of the population, which could impact employment figures.\n\nFor decades, New Jersey’s employment rate was better.\n\nIn August, according to preliminary data, about 90 percent of people in the state in the workforce -- that is either employed or looking for work -- had a job. That’s the smallest percentage since March of 1977.\n\nOur ruling\n\nBeck said, \"we have more people working in the state of New Jersey today than we've ever had in our history.\"\n\nThat’s wrong.\n\nNew Jersey has not created enough jobs or put enough residents back to work to surpass the state’s 2008 employment peak.\n\nAnd for decades the state’s employment rate was higher than it is now.\n\nWe rate this statement False.\n\nTo comment on this ruling, go to NJ.com.", "NJToday, Sept. 20, 2012\n\nNew Jersey Department of Labor and Workforce Development, NJ Monthly Seasonally Adjusted Estimates, accessed Sept. 21, 2012\n\nNew Jersey Department of Labor and Workforce Development, New Jersey Employers Add Workers in August, Sept. 20, 2012\n\nU.S. Bureau of Labor Statistics, Employment, Hours, and Earnings - State and Metro Area, accessed Sept. 25, 2012\n\nE-mail from state Sen. Jennifer Beck, Sept. 26, 2012\n\nPolitiFact New Jersey, Jennifer Beck claims New Jersey residents are working at the highest rate in three years, July 1, 2012\n\nNational Bureau of Economic Research, Business Cycle Dating Committee, National Bureau of Economic Research, Sept. 20, 2010\n\nThe Star-Ledger, N.J. unemployment rate rises to 9.9 percent, highest in 3 decades, Sept. 20, 2012\n\nNJToday, Latest Job Numbers Cause Some Confusion, Sept. 20, 2012\n\nU.S. Bureau of Labor Statistics, Civilian Noninstitutional Population and Associated Rate and Ratio Measures for Model-Based Areas, accessed Sept. 25, 2012\n\nU.S. Bureau of Labor Statistics, How the Government Measures Unemployment, accessed Sept. 25, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]