["The photo, which shows the car park at Singapore General Hospital (SGH), was published in this Facebook post on March 29, 2020. It has been shared more than 460 times.", "The post’s caption reads: “Just a glimpse, of what appears to be:", "“SGH getting ready for the worst to come!! They converted the carparks to wards ... so please stay home !”", "Below is a screenshot of the misleading Facebook post:", "Singapore has confirmed 926 cases of COVID-19 and three deaths as of March 31, 2020.", "COVID-19 has killed at least 33,257 people and infected 697,244 others worldwide, according to this situation dashboard from the World Health Organization.", "The photo of the hospital car park was also shared alongside a similar claim on Facebook here, here and here.", "However, the claim is misleading.", "SGH issued a statement on its official Facebook page on March 30, 2020 clarifying that its car park would temporarily be used as a COVID-19 testing area.", "It reads: “We are aware of a message circulating on social media and text messaging platforms that SGH is converting its carpark into wards. This is totally untrue.", "“Part of the multi-storey carpark is used as an extended facility to assess patients conveyed by designated ambulances for COVID-19. Patients are not admitted to this facility as there are no inpatient amenities.", "“We urge the public to be socially responsible and not to share news from unverified source.”", "On March 20, 2020, SGH issued a statement announcing the conversion of its car park facilities as the number of COVID-19 cases increased in Singapore.", "The statement reads: “As the number of COVID-19 cases increases nationally, SGH has extended our testing capacity to receive patients conveyed by designated ambulances.", "“The extended capacity is located at a multi-storey car park on campus, and does not accept walk-in patients. Public who are unwell are advised to visit their nearest Public Health Preparedness Clinics (PHPCs), GP clinics or Polyclinics. The doctors will assess and refer you to any hospital if you are suspected to have COVID-19.”", "The car park was temporarily converted to screen for anyone presenting with a fever, according to this report published by the Singapore-based The Straits Times on March 20, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]