["About this rating", "Shakira is the popular Colombian-born singing star who burst on the music scene and won two 2000 Latin Grammy Awards for Best Female Pop Vocal Performance (\"Ojos Así\") and Best Female Rock Vocal Performance (\"Octavo Día\").", "Unfortunately, back in 2002 someone saw fit to attach Shakira's name to the same type of apocryphal, racist quote that has dogged designer Tommy Hilfiger for years (\"If I knew that blacks and Asians were going to wear my clothes, I would have never designed them\")  and has also been attributed to singer Lauryn Hill (\"I would rather die than have a white person buy one of my albums,\" also supposedly said during an MTV interview):", "This week the singer Shakira appeared on MTV in front of a live audience and talked to fans who called the studio. When an Israeli fan was put on the air, the singer refused to speak to her saying she'd \"rather have PIGS listening to her music than Israelis!\"", "I think it is a disgrace that a person like her is given a platform to express her incredibly outrageous views and that a network as big and influential as MTV did not condemn her expression. This is a singer who is rated no.1 in the world and in Israel with her smash hit \"whenever, wherever\".", "We can not turn a blind eye to these sayings anymore! I ask you all; please send this email to all your mailing lists to help spread the word on this terrible saying and to boycott the singers CDs", "Why Shakira would be the purported utterer of an vicious anti-Israeli statement is a mystery (perhaps because of her ethnicity — her father is American-born of Lebanese descent and her mother is Colombian), but MTV confirmed that she made no such statement on any of their programs, nor would they have broadcast it if she had.", "This rumor was even more implausible in light of the fact that on 30 April 2002, Shakira issued a statement defending herself against charges issued in a New York Daily News article that she had once modeled for a clothing line that allegedly purchased some of their product from a Brooklyn sweatshop.  It would have been rather foolish (and clueless) of her indeed to put out one public relations fire, then turn around and set her own house ablaze by making a outrageously racist statement on a widely-viewed television program.", "Associated Press.     “Factory Sued After Shakira Statement.”\r\n    The Baltimore Sun.   2 May 2002.", "Associated Press.   \"Shakira Unaware of Sweatshop Labour.\"\r\n    The Sydney Morning Herald.   3 May 2002.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]