["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "West Virginia Gov. Jim Justice speaks during his State of the State address on Feb. 10, 2021. (AP)", "• According to official Census data, West Virginia is the only state to see its population decline between 1950 and 2019.", "• The state had a small spurts of population growth in the 1970s and from 2000 to 2010.", "During the 2021 West Virginia legislative session, Gov. Jim Justice has pushed his marquee proposal: a repeal of the state income tax. West Virginia would become the 10th state without an income tax, and Justice said the switch could help bolster the state’s stagnant population.", "In a March 4 tweet announcing the proposal, Justice wrote, \"Today I submitted my plan to repeal our state personal income tax, putting more money in every West Virginian’s pocket on day one. WV is the only state to decline in population over the last 70 years. Our opportunity to change is now!\"", "Today I submitted my plan to repeal our state personal income tax, putting more money in every West Virginian’s pocket on day one. WV is the only state to decline in population over the last 70 years. Our opportunity to change is now!Read my plan here ⬇️https://t.co/vWU6QOTESc", "Is Justice right about West Virginia being the only state to see its population decline over the past 70 years? Justice’s office did not respond to requests for comment, but we looked at the underlying census data, and it backed him up.", "An analysis of population numbers by state from the 1950 census and the 2019 census estimates show that West Virginia is the only state to see a decrease in population over that time span.", "We looked at every state’s population in the decennial census, starting in 1950. Because final 2020 census results haven’t been released yet, we relied on the 2019 population estimate, which is released by the U.S. Census Bureau using a different method.", "At the top of the list are California, Texas, and Florida, each of which gained between 18 million and 29 million residents during that 69-year period.", "And at the bottom? West Virginia, with a loss of about 213,000 residents, or 11%. The other states near the bottom all had small gains rather than losses: North Dakota, South Dakota and Vermont each gained a small number of residents, from 142,000 to 246,000.", "On a percentage basis, Iowa, Pennsylvania, North Dakota, New York and Rhode Island were the states with the smallest increases. But only West Virginia actually lost people.", "We checked with William Frey, a census specialist at the Brookings Institution, to see whether there were any caveats we should note. The only issue Frey pointed out was that West Virginia’s population has not been in continuous decline during that period. There was a short and temporary bump in West Virginia’s population during the 1970s, and another modest one from 2000 to 2010.", "It’s also worth noting that the bulk of West Virginia’s population decline occurred before 1970, and that the population has been roughly flat since 1990. Had Justice chosen 1970 as a starting point instead of 1950, the comparison would have shown a small increase in population.", "For the record, there’s some correlation between the lack of an income tax and fast population growth, but it’s not perfect. Several of the fastest-growing states do lack an income tax, including Alaska, Florida, Nevada, Texas and Washington. But other states without an income tax have seen slow population growth, including South Dakota and Wyoming.", "Justice said that West Virginia \"is the only state to decline in population over the last 70 years.\"", "That’s correct. Every other state gained at least 142,000 residents during that period.", "We rate the statement True.", "Gov. Jim Justice, tweet, March 4, 2021", "U.S. Census Bureau, Demographic Trends in the 20th Century, Nov. 2002", "U.S. Census Bureau, State Population Totals and Components of Change: 2010-2019, Dec. 30, 2019", "Email interview with William Frey, senior fellow at the Brookings Institution, March 22, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]