["The 10-second video was posted here on Facebook on January 11, 2021. It has been viewed more than 4,000 times.", "It was shared alongside several other videos purporting to show a plane crash in Indonesia.", "The post’s caption, translated from Malaysian to English, reads: “The final moments of passengers from the sri wijaya plane…", "“Verily we belong to Allah, and verily to Him do we return...", "“The video from WhatsApp whether true from sri wijaya God only knows however the panicked moments in a flight like this are absolutely terrifying, I hope everyone on this flight is protected by Him. Amen”.", "Sriwijaya Air Flight SJ182, carrying 62 people, crashed into the Java Sea, four minutes after taking off from the Indonesian capital of Jakarta on January 9, 2021, AFP reported on the crash here.", "The video was viewed about 2,000 times after it was also shared here on Facebook, as well as on YouTube here, with a similar claim.", "The claim is false.", "A keyword search, followed by a reverse image search on Google of keyframes extracted from the video using digital verification tool InVID-WeVerify, found this video. It was uploaded to YouTube on October 26, 2019, by YouTube user Justine Robinson.", "The video’s title reads: “Insane turbulence Frontier Flight 226”. The caption states: “Denver to Baltimore 10/25/19 Frontier Flight 226”.", "The four-minute 50-second video shows the same scenes seen in the video in the misleading post, starting from the clip's one-minute 52-second mark.", "Frontier Airlines is an American low-cost air carrier.", "The YouTube video also appeared in this report about the turbulence during the Frontier Flight 226 published by blog site Flying High New on November 16, 2020.", "Below is a screenshot comparison of the video from the misleading post on Facebook (L) and the YouTube video (R) — with the same features circled in red by AFP:", "The other videos in the misleading posts, which purported to show footage from the Sriwijaya Air plane crash, have been debunked by AFP here, here, here, here, here, here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]