["Ahead of what’s expected to be a bruising battle for an Arkansas Senate seat, a pro-Democratic group called Patriot Majority USA is out with an ad attacking Rep. Tom Cotton, R-Ark., a potential challenger to incumbent Democrat Mark Pryor.", "Here’s the voice-over from the ad:", "\"Tom Cotton -- just elected and already seeking the national limelight. Behind the glitz, Tom Cotton forgot about us. Supporting a plan the Wall Street Journal said essentially ends Medicare, costing some seniors $6,000 more a year, while voting Congress taxpayer-funded health care for life. Congressman Cotton: Out for himself, not us.\"", "As our friends at the Washington Post Fact Checker recently noted, the major fact-checking outlets, including PolitiFact, have been critical of the ending-Medicare claim repeated in the ad.", "But in this item, we’ll look at the ad’s second claim, which we hadn’t seen before -- that Cotton voted to provide Congress with \"taxpayer-funded health care for life.\"", "PolitiFact didn’t hear back from the ad’s sponsors, but Ty Matsdorf -- a spokesman for Senate Majority PAC, a group apparently involved in the ad alongside Patriot Majority USA -- explained the group’s logic in an email to the Post’s Fact Checker.", "Matsdorf said that in March, Cotton voted for a repeal of President Barack Obama’s health care law. So how does this relate to health care for life? It gets a little complicated, so bear with us.", "Before Obama’s law was approved by Congress in 2010, Sen. Charles Grassley, R-Iowa, proposed an amendment that won enough votes to be attached to the measure. The amendment required lawmakers and their aides to obtain their health care through the new insurance marketplaces that were a cornerstone of the bill.", "So, if the health care law is ever repealed, the requirement that lawmakers and aides buy their health insurance through the insurance marketplace would be repealed as well.", "In its place, lawmakers and aides would return to what they’ve already been doing for years, which is to purchase insurance through the Federal Employee Health Benefit Program. This decades-old program was something of a model for the exchanges themselves: Under the program, federal employees under the age of 65 can choose among a variety of health insurance offerings; they pay a share of the premiums and their employer, the government, pays the rest, just as private-sector employers typically do for their employees.", "First off, we'll note that the vote in question was to repeal Obamacare, and that the impact on congressional health coverage amounted to only a tiny portion of the repeal effort. The ad portrays Cotton's vote as one that's greedy and self-interested for a member of Congress. But in reality, achieving the complicated legislative bank-shot suggested by the ad was not the point of the repeal vote.", "The claim also faces some important substantive problems:", "• \"Taxpayer-funded\" is technically correct, but misleading. \"Taxpayer-funded\" suggests that the employee is getting a free ride because the taxpayer is picking up the entire tab for health insurance. That’s not the case -- the worker pays a share of the premiums, roughly 25 percent, although the exact share can vary by plan.", "\"Federal employees still pay a portion of premiums, co-pays, co-insurance, and can face a deductible,\" said Joshua Archambault, director of health care policy at the Pioneer Institute, a free-market think tank.", "And while it’s technically true that taxpayers are indirectly paying the government’s share, this is no special perk for federal employees. The government simply happens to be their employer, filling the same role that most private employers above a certain size do when they offer health insurance to their workers on a shared-cost basis.", "• It’s not \"health care for life.\" The federal health plan doesn’t last forever: At age 65, Medicare kicks in. And before age 65, it’s no freebie gravy train. Unlike Medicare recipients, a federal health plan beneficiary \"has to elect to remain in the program -- if they stop paying, the coverage ends,\" said John Palguta, vice president for policy at the Partnership for Public Service, which promotes government service. (Federal workers on Medicare can choose to continue to purchase insurance off the federal plan as supplemental coverage, but it’s not mandatory.)", "And, of course, if the voters don’t send you back to Congress, or if you’re an aide who leaves to join a lobbying firm, your new employer will be picking up a share of your health insurance -- not the taxpayer.", "In all, Jonathan Oberlander, professor of social medicine and health policy and management at the University of North Carolina-Chapel Hill, said the ad makes \"a misleading and peculiar claim.\"", "Our ruling", "The ad suggests that Cotton, in a self-interested fashion, voted to provide lawmakers and aides with free ride from the taxpayers -- a boondoggle, basically. But viewed in context, the vote wasn't about that.", "Moreover, it’s a stretch to say the Federal Employee Health Benefit Program amounts to \"taxpayer-funded health care for life.\" While the government does fund a portion of federal employees’ health insurance costs, it does so in the same capacity as any private-sector employer that offers health insurance to its workers. And the coverage doesn’t last \"for life.\" We rate the claim Pants on Fire!", "Patriot Majority USA, \"Glitz\" (ad), June 27, 2013", "Washington Post Fact Checker, \"Four Pinocchios for the latest ‘Mediscare’ ad,\"  June 28, 2013", "Roll Call, \"Health Insurance Anxiety on Capitol Hill,\" April 25, 2013", "Email interview with Jonathan Oberlander, professor of social medicine and health policy and management at the University of North Carolina-Chapel Hill, June 28. 2013", "Email interview with John Palguta, vice president for policy at the Partnership for Public Service, June 28, 2013", "Email interview with Joshua Archambault, director of health care policy at the Pioneer Institute, June 28, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]