["About this rating", "On 3 February 2017, the disreputable web site YourNewsWire posted a story with the alarming but false claim that one of the reactors damaged in the 2011 disaster at Japan's Fukushima Daiichi nuclear power plant was on the verge of falling into the ocean:", "Scientists at the Fukushima Daiichi nuclear plant in Japan have declared a state of emergency as one of the reactors is on the verge of falling into the ocean.", "Lethal levels of radiation have been detected around the site which scientists say stems from a hole caused by melted nuclear fuel.", "No credible news reports have stated that a Fukushima reactor is about to fall into the ocean, nor has any Japanese government agency announced a state of emergency. YourNewsWire's exaggerated \"news\" seems to have been derived from media reports in early February 2017 about high levels of radiation found inside the containment vessel for reactor No. 2 at Fukushima power plant No. 1. The Japan Times reported of the situation that:", "The radiation level in the containment vessel of reactor 2 at the crippled Fukushima No. 1 power plant has reached a maximum of 530 sieverts per hour, the highest since the triple core meltdown in March 2011, Tokyo Electric Power Co. Holdings Inc. said.", "Tepco said that the blazing radiation reading was taken near the entrance to the space just below the pressure vessel, which contains the reactor core.", "The high figure indicates that some of the melted fuel that escaped the pressure vessel is nearby.", "At 530 sieverts, a person could die from even brief exposure, highlighting the difficulties ahead as the government and Tepco grope their way toward dismantling all three reactors crippled by the March 2011 disaster.", "In a statement they sent to us, Tepco confirmed the high radiation levels inside the reactor but noted no changes to radiation levels outside the unit:", "We estimated radiation levels at certain points inside the Unit 2 Primary Containment Vessel (one of it was as high as 530 Sv/h), based on the digital images obtained from the previous investigations (held on January 26 and 30) with a guiding pipe and camera. The level of radiation discovered was higher than expected (the previous highest measurement was 73 Sv/h), but we need further investigations to find out why the radiation got this high at this specific location.", "There has been no change to radiation levels outside the PCV. Extra precautions have been taken to prevent leaks of radiation during the investigation. The penetration pipe through the PCV wall is tightly shielded, and the work area is pressurized so that air only moves from the outside into the PCV and not the reverse. We routinely disclose on our website sampling results of radiation inside the reactor buildings and of the surrounding areas.", "Will Davis, a consultant and author in the nuclear energy field and former US Navy Nuclear Reactor Operator, told us the alarm raised in many media reports about the finding is unwarranted. Radiation levels are not spiking -- Tepco has been searching for damaged fuel and found it, so a high reading at the specific location was to be expected and further, it is safely contained:", "The high levels of radiation are to be found inside each of the three reactor buildings at Units 1, 2 and 3.  Each of the reactors suffered a meltdown as a result of complete loss of electrical power and damage by the tsunami.  Inside of each reactor building is a \"Primary Containment Vessel\" or PCV, and inside of that sort of suspended if you will is the reactor vessel.  The damaged fuel, which is highly radioactive is either partly inside the reactor vessel or down inside the containment vessel.  The really high levels of radiation are, and have been, inside of these containment vessels.  So this is where the high level is more or less limited to (although there are zones of significant but not nearly as high radiation in the reactor buildings outside the containment vessels as well).  The high reading that TEPCO obtained, which is to say the 530 Sv/hr reading in Unit 2, is very simply because TEPCO (the owner) is poking instrumentation and robots ever closer, inching toward the actual location of the damaged and melted fuel in order to determine its total location, and condition.  This is an extremely careful, deliberate process planned and executed over years and which just now has approached the melted fuel in Unit 2.   But it's important to know that radiation levels around and off the site aren't what's being reported here; they've remained what they were.", "This detection of a localized very high radiation level is exactly what was expected as the area was approached.  The reading is local, and does not represent anything being transmitted to the air, water, ground or region around the plant.  It's just as if someone had a light on in a room, and you confirmed that your eyes were detecting more light as you walked into the room.  It would not be a surprise and the light would still not reach any further than it did before.  Remember, this is a radiation field - radiation is coming through the air from the source of the damaged fuel.  This is not radioactive gas or any such being emitted to the atmosphere.  It cannot travel and intensity decreases with distance and shielding.", "Tepco announced on their official Facebook page that while conducting a survey of the containment unit, they \"found that some deposits had adhered to the structures directly below the Reactor Pressure Vessel (RPV) and that a part of the grating had sunken in at the center of the pedestal (the concrete base supporting the RPV).\"", "One possible explanation for the high radiation reading in the specific spot, San Diego State business professor Dr. Murray Jennex told us, is that \"crud,\" a term used to mean radioactive particles, had settled into that depression:", "The structures are holding but inside where the fuel melted, it went all over the place.  There was a lot of water pumped into this plant so stuff really got moved around, and I think what you have happening is a crud trap — a low point in pipe or tank where it gathers together. All that material went that direction, and that is a very high reading.", "Jennex, an expert on nuclear containment who has commented in-depth on the disaster, said exposure to radiation levels that high would be almost instantly fatal and surmised that Tepco would ultimately be forced to build a concrete sarcophagus around the unit like the one that encapsulates reactor no. 4 at Chernobyl. He added that they \"may have to let nature take its course for a while.\"", "The Guardian, which has a reporter posted in Tokyo, noted that Tepco says none of that radiation has leaked outside the containment unit. However, plans to send a robot in to survey the vessel seem to have been scuttled, as radiation at that level would destroy even a robot in less than two hours:", "A remote-controlled robot that Tepco intends to send into the No 2 reactor’s containment vessel is designed to withstand exposure to a total of 1,000 sieverts, meaning it would survive for less than two hours before malfunctioning.", "The firm said radiation was not leaking outside the reactor, adding that the robot would still prove useful since it would move from one spot to the other and encounter radiation of varying levels.", "Tepco and its network of partner companies at Fukushima Daiichi have yet to identify the location and condition of melted fuel in the three most seriously damaged reactors. Removing it safely represents a challenge unprecedented in the history of nuclear power.", "The Fukushima Daiichi disaster was the worst nuclear disaster since the explosion of a reactor at Soviet Union's Chernobyl nuclear power plant in 1986. Both incidents have been rated level 7, the most serious category for nuclear incidents according to an international scale used to measure such accidents.", "Adl-Tabatabai, Sean.   \"Japan Declare Crisis As Fukushima Reactor Begins Falling Into Ocean.\"\r\nYourNewsWire.   3 February 2017.", "The Japan Times.   \"Highest Radiation Reading Since 3/11 Detected at Fukushima No. 1 Reactor.\"\r\n3 February 2017.", "McCurry, Justin. \"Fukushima Nuclear Reactor Radiation at Highest Level Since 2011 Meltdown.\"\r\nThe Guardian. 3 February 2017.", "Davis, Will. \"Radiation Levels Not “Soaring” At Fukushima Daiichi.\"\r\nANS Nuclear Cafe. 7 February 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]