["“Superstar and singing legend Celine Dion dead at 51,” is the headline shared hundreds of times on Facebook. Those who click on the link in their social media newsfeed are directed to a webpage where a single video seems to confirm the news.", "However, the video is a cut and altered news segment from CNN’s New Day news show, which lasts just long enough for co-host John Bergman to say the words, “We have some terribly sad news to report this morning, heartbreaking, and devastating.” On the bottom of the screen, a fake news banner again proclaims Dion’s death.", "The video then stops, and in order to play more online users are forced to share the link on Facebook.", "The report “is absolutely false,” a representative from Dion’s talent agency told AFP.", "A search for the words “Celine Dion dead” yields no results on CNN’s website. The original video used in the hoax was a news segment announcing the death of US chef and TV star Anthony Bourdain on June 8, 2018.", "The identical clip can be seen in this CNN special report:", "Although the false report began to be shared on November 4, Dion, who is on a world tour until September 2020, sang in Detroit, at Michigan’s Little Ceasars Arena on the evening of November 5.", "“Céline” tweeted a photo of herself at the concert, and fans shared moments from the concert on Twitter and Facebook.", "Thank you Detroit for an incredible evening! We’ll be on stage on Nov. 18 in Montreal! Can’t wait!??/Merci Détroit pour la soirée incroyable! Nous remontons sur scène le 18 nov. prochain à Montréal! J’ai tellement hâte ! ??- Céline xx… #CourageWorldTour\n\n\t\t? : Brian Purnell pic.twitter.com/jO0L7GodSW", "The webpage that features the news of Dion’s death was created on November 2, 2019, according to domain identification tool Whois. This is often a good indication of a news website’s lack of credibility.", "The 51-year-old singer announced she would leave her residency of 16 years in Las Vegas in June 2019, and began a world tour to showcase her new album “Courage” in her native Canadian province of Quebec in September.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]