["About this rating", "The UK newspaper The Telegraph reported on 20 October 2016 that the World Health Organization (WHO) had revised their definition of infertility to include single men and women:", "Single men and women without medical issues will be classed as “infertile” if they do not have children but want to become a parent, the World Health Organisation is to announce.", "In a move which dramatically changes the definition of infertility, WHO will declare that it should no longer be regarded as simply a medical condition.", "The authors of the new global standards said the revised definition gave every individual “the right to reproduce”.", "Under the new terms, heterosexual single men and women, and gay men and  women who want to have children would be given the same priority as couples seeking IVF because of medical fertility problems.", "The organization's decision, the Telegraph stated, was \"likely to place pressure\" on the National Health Service to change their eligibility standards concerning in-vitro fertilization.", "However, even though the story was picked up by multiple news outlets, it did not include any material or comments from WHO. Instead, it quoted endocrinologist David Adamson, a leading reproductive health practitioner whose Huffington Post  contributor profile references him as a fertility expert for the WHO. According to the Telegraph, Adamson, listed as an author of the new WHO standards, said:", "The definition of infertility is now written in such a way that it includes the rights of all individuals to have a family, and that includes single men, single women, gay men, gay women.", "It puts a stake in the ground and says an individual's got a right to reproduce whether or not they have a partner. It's a big change.", "It fundamentally alters who should be included in this group and who should have access to healthcare. It sets an international legal standard. Countries are bound by it.", "We contacted Adamson to confirm the Telegraph's reporting, but did not respond. Meanwhile, WHO's  website has not reflected any changes to their terminology concerning infertility, which does not mention single people at all:", "The organization denied the Telegraph's reporting in a statement sent to us on 29 October 2016:", "In 2009, WHO joined with the International Committee for Monitoring Assisted Reproductive Technologies (ICMART) and other partners to develop a Glossary of definitions for infertility and fertility care. This Glossary included the clinical definition for infertility as “a disease of the reproductive system defined by the failure to achieve a clinical pregnancy after 12 months or more of regular unprotected sexual intercourse.” This is keeping with WHO definition of male and female infertility in the International Classification of Diseases (ICD 10)", "WHO has not changed its use of this definition. It is important to note that this definition provides a clinical description of infertility. It does not make any recommendations about the provision of fertility care services.", "WHO is currently collaborating with its partners to update the Glossary and consideration is being given to revising the definition of infertility. Should there be a change in the definition of infertility, it will remain a clinical description of infertility as a disease of the reproductive system and will not make recommendations about the provision of fertility care services.", "WHO definitions are contained in ICD and that glossary is not an official WHO publication but rather a work that WHO staff contribute to.", "The organization also reiterated their definition of infertility via Twitter:", "@pved Our definition of #infertility remains the same https://t.co/fbkyxzWocd", "— WHO (@WHO) October 22, 2016", "Bodkin, Henry.   \"Single Men Will Get the Right to Start a Family Under new Definition of Infertility.\"\r\n    The Telegraph.   20 October 2016.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]