["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Attorney General nominee Loretta Lynch testifies on Jan. 28, 2015.", "Democrats have recently been accusing Senate Republicans of obstructing the nomination of Loretta Lynch to succeed Eric Holder as attorney general.", "Lynch, currently the U.S. Attorney for the Eastern District of New York, would become the first African-American woman to head the Justice Department, but she’s been awaiting a confirmation vote by the full Senate for several months. While observers expect Lynch to win confirmation, the Senate’s Republican majority has been withholding a vote as leverage to secure other legislative items. In addition, some Republicans have taken issue with Lynch’s refusal to speak out against President Barack Obama’s executive actions on immigration, which some in the GOP have called unconstitutional.", "Obama himself decried the delay at a joint press conference with Italian Prime Minister Matteo Renzi on April 17, 2015.", "Obama called it a \"crazy situation where a woman who everybody agrees is qualified, who has gone after terrorists, who has worked with police officers to get gangs off the streets, who is trusted by the civil rights community and by police unions as being somebody who is fair and effective and a good manager -- nobody suggests otherwise -- who has been confirmed twice before by the United States Senate for one of the biggest law enforcement jobs in the country, has been now sitting there longer than the previous seven attorney general nominees combined.\"", "We wondered: Has Lynch’s nomination been \"sitting there longer than the previous seven Attorney General nominees combined\"?", "We looked at data from the Senate about the past seven nominees. Here’s a rundown, in reverse chronological order:", "Nominee", "President", "Nomination received by Senate", "Confirmed by Senate", "Days", "Eric Holder", "Obama", "Jan. 20, 2009", "Feb. 2, 2009", "13", "Michael Mukasey", "G.W. Bush", "Sept. 21, 2007", "Nov. 8, 2007", "17", "Alberto Gonzales", "G.W. Bush", "Jan. 4, 2005", "Feb. 3, 2005", "30", "John Ashcroft", "G.W. Bush", "Jan. 29, 2001", "Feb. 1, 2001", "3", "Janet Reno", "Clinton", "Feb. 26, 1993", "Mar. 11, 1993", "13", "William Barr", "G.H.W. Bush", "Oct. 25, 1991", "Nov. 20, 1991", "26", "Richard Thornburgh", "Reagan", "July 25, 1988", "Aug. 11, 1988", "17", "TOTAL", "119", "So the previous seven nominees waited a collective 119 days. How about Lynch? Here it gets a little complicated.", "Lynch’s nomination was initially received in the Senate on Nov. 13, 2014. The Senate -- then under lame-duck Democratic control -- did not move the nomination forward. One obvious problem, beyond a short calendar interrupted by Thanksgiving and Christmas breaks: Rushing the nomination through might have been seen as thwarting the will of the people, who had just voted for a Republican Senate.", "Then, the Obama administration resubmitted Lynch’s nomination to the newly Republican-held chamber on Jan. 7, 2015. That’s standard procedure when one Congress ends and another begins.", "If you count the entire period -- from Nov. 13 to April 17, the day of Obama’s remark -- then Lynch had waited for 155 days (and 158 by this article’s publication date). That’s easily more than the 119 logged by the previous seven nominees.", "However, if you count only the time after the Republicans took over the Senate -- the period for which Obama’s obstructionism argument is strongest -- the delay was 100 days by the time of Obama’s comments, and 103 by this article’s publication. That’s less than the 119 days waited by the previous seven nominees, though it’s possible the wait could ultimately reach or exceed 119 days if no action is taken by early May.", "Obama does has a point that the delay for Lynch -- however many days it was -- has been unusually long.", "Of the hundreds and hundreds of nominations submitted in recent decades, only a few have waited for longer than 100 days, according to the Senate Historical Office. Among the more notable waits:", "• Richard Cordray, nominated for director of the Consumer Financial Protection Bureau, 2011-13: 1+ years", "• Miguel Estrada, nominated for U.S. Circuit Court judgeship, 2003: 240 days", "• Richard Holbrooke, ambassador to the United Nations, 1999: 176 days", "• Lewis L. Strauss, nominated for Commerce Secretary, 1959: 152 days", "• Robert Gates, nominated for CIA Director, 1991: 134 days", "• Robert Bork, nominated for Supreme Court, 1987: 108 days", "Of these, the only nominee for an official Cabinet position to wait longer than Lynch was Strauss, and that was more than half a century ago.", "So Lynch’s case is pretty unusual by historical standards.", "Sarah Binder, a senior fellow at the Brookings Institution and a political scientist at George Washington University, sees the argument for starting the clock with the resubmission of Lynch’s nomination, but she added that focusing on that distinction misses the larger point.", "\"Presidents are typically given the right to field their own team,\" Binder said. \"Given Lynch's previous confirmations and stellar credentials, why force her and the president to wait so long for a confirmation vote?\"", "Burdett Loomis, a University of Kansas political scientist who has studied the Senate, agreed. \"There’s a little sleight of hand\" in Obama’s comment, \"but the overall message is that there’s been a lot of delay and that it’s historic in length.\"", "And it’s not as if Republicans were powerless to resist even if the Democratic-controlled Senate had tried to act, said Steven S. Smith, a political scientist and Senate expert at Washington University in St. Louis.", "\"The Democrats could have moved the nomination quickly at the end of the last Congress if the Republicans were not requiring cloture on everything, even nominations, which created a backlog of must-pass legislation and nominations as the Congress came to a close,\" Smith said.", "Our ruling", "Obama said that Lynch’s nomination \"has been now sitting there longer than the previous seven attorney general nominees combined.\"", "Mathematically, Obama was correct if you start counting from Lynch’s initial nomination, but short by 19 days if you start counting from the resubmission of her nomination to the newly installed Republican-controlled Senate. Either way, it’s clear that Obama has a point that Lynch’s delay has been long by historical standards, especially for a Cabinet nominee.", "We rate the claim Mostly True.", "Barack Obama, remarks at joint press conference with Italian Prime Minister Matteo Renzi, April 17, 2015", "U.S. Senate, \"Nominations & Treaties\" data page, accessed April 20, 2015", "CNN, \"Obama rips Senate over Lynch nomination: 'This is embarrassing,' \" April 17, 2015", "Fivethirtyeight.com, \"Loretta Lynch’s Prolonged Confirmation Wait Is Unusual, But Not Unprecedented,\" March 19, 2015", "Email interview with Donald Ritchie, historian of the U.S. Senate, April 20, 2015", "Email interview with Burdett Loomis, University of Kansas political scientist, April 20, 2015", "Email interview with Sarah Binder, senior fellow at the Brookings Institution and political scientist at George Washington University, April 20, 2015", "Email interview with Steven S. Smith, political scientist at Washington University in St. Louis, April 20, 2015", "Email interview with Frank Benenati, White House spokesman, April 20, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]