["By Angelo Fichera", "Posted on June 8, 2018", "Q: Was a recently discovered encampment in Arizona used as a “child rape camp”?", "A: There is no evidence to support that claim. Authorities say their investigation revealed no such criminal activity.", "Hi, would like your help with this story found on Facebook.", "“BREAKING: CHILD RAPE CAMP DISCOVERED NEAR TUCSON – PRISON CELL MADE FOR CHILDREN – RAPE TREE – CHILDREN’S TOYS – MASSIVE COVER-UP BY CITY OFFICIALS…”", "Thank you so much!", "The recent discovery of a homeless encampment in Tucson, Arizona, has become material for the latest viral conspiracy theory, one that claims the site was used for child trafficking and as a “rape camp.”", "But the Tucson Police Department has said its dayslong investigation yielded no evidence of such criminal activity — and U.S. Immigration and Customs Enforcement told FactCheck.org it “concurred with” that conclusion.", "“There were no obvious signs of any criminal activity out there — besides trespassing on private property,” Tucson Police Sgt. Pete Dugan told us in a June 7 interview, emphasizing there were no indications “of human trafficking or child sex trafficking.”", "The site has been turned over to the property owner, Dugan said.", "Still, unsubstantiated claims of nefarious activity have been widespread — making their way into reports by news organizations and onto a slew of questionable websites, including some that have tried connecting the conspiracy theory to the Clintons.", "The strange tale began May 29, when police responded to the site, near West Valencia Road and Interstate Highway 19. A homeless veterans group “had discovered the site and expressed concerns” about it, the police said.", "That group, Veterans on Patrol, headed by Michael Lewis Arthur Meyer, has posted a flurry of Facebook videos referring to #OperationBackyardBrawl. In the videos, Meyer speculates about the activity at the site (he calls it a “child sex camp”) and rejects the conclusions of authorities who have said otherwise (he says, “the experts from the government, they’re full of s—”).", "In the days after the initial discovery, local media reported on the unfounded claims. A June 1 headline on Patch.com read, “Underground Tucson Bunker Possibly Used In Child Sex Trafficking.”", "Local station KGUN-TV labeled its segment “Underground Bunker Found,” as part of the “KGUN9 Child Trafficking Series.” And News 4 Tucson (KVOA-TV) aired a segment — titled on YouTube “Homeless camp or child trafficking den?” — that was preceded by an anchor asking, “Is it an abandoned homeless camp or is it something more sinister?”", "The latter report showed viewers a number of seemingly benign findings at the camp: a mirror, a table with shaving cream and flea shampoo, as well as an area “where people probably slept.” It then showed “straps” on trees and a “bunker” with a small opening, and later mentioned children’s items, such as toys and clothes.", "“This place is meant for child trafficking — it’s meant for torturous, terrible things,” a volunteer with the veterans group said in that News 4 report.", "Dugan, however, said that “the items that we found there are just not uncommon from what we see at other camps around the town and county.”", "“Just because they’re homeless doesn’t mean they don’t use a mirror,” he added.", "As for the straps found on trees, Dugan said authorities “have seen similar types of things” at other homeless camps, and they are sometimes used to hang food out of the reach of animals.", "ICE, in a statement provided by a spokeswoman, said that “special agents who specialize in human smuggling and human trafficking collaborated with the Tucson Police Department on the information collected from the scene.”", "“Based on the information provided by TPD,” the agency said, it “concurred with the police department’s findings that nothing at the site validates the claims of possible human trafficking or child sex trafficking.”", "One video about the conspiracy theory, posted on the Facebook page “Stranger Than Fiction News,” received 41,000 shares. It referred to the matter as a “massive cover-up by city officials.”", "“People need to know we investigated it from the first report and continued to investigate it for days after,” Dugan told us, adding that the department continues to encourage residents to report perceived suspicious activity.", "Attempts to connect the camp to the Clintons echoed the debunked “Pizzagate” conspiracy theory, which posited that former Secretary of State Hillary Clinton was operating a child sex ring out of a Washington, D.C., pizza shop. Former first daughter Chelsea Clinton lamented the most recent conspiracy, referring to it on Twitter as “#Pizzagate 2.0.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "Dugan, Pete. Sergeant, Tucson Police Department. Phone interview with FactCheck.org. 7 Jun 2018.", "Mack, Lauren. Spokeswoman, U.S. Immigration and Customs Enforcement. Email sent to FactCheck.org. 8 Jun 2018.", "“Media Release: Suspicious Activity – W. Valencia Rd. and S. I-19.” Tucson Police Department. 4 Jun 2018.", "Robb, Amanda. “Anatomy of a Fake News Scandal.” Rolling Stone. 16 Nov 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]