["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Richmond City Council President Michelle Mosby pulled no punches in a recent radio ad that took aim at Joe Morrissey, one of her opponents in the city’s mayoral race.", "\"Joe has been a delegate in the General Assembly for eight years with no laws passed to help our black community with education or workforce,\" Mosby said in the 60-second clip that started running in early October.", "The ad began airing with polls showing Morrissey drawing substantial support from the black community. Mosby warns voters, \"Don’t trust him.\"", "Mosby told us back-up information for her claim about Morrissey’s General Assembly record can be found on the state’s Legislative Information System, which tracks measures that lawmakers write and pass every year. So we took a look.", "Morrissey served in the House from 2008 to 2015. We found a dozen bills that were signed into law for which Morrissey was listed either as the patron or chief co-patron.", "But almost all fell outside of Mosby’s specification regarding laws \"to help our black community with education or workforce.\" The lone exception we found was a 2009 law Morrissey wrote that required colleges, in the middle of a semester, to give full course credit to students who are deployed on active military duty.", "We asked Morrissey for his take on Mosby’s statement, and he sent us a letter pointing to 26 laws that he said \"had some connectivity to either education or workforce.\"", "Only three of the laws Morrissey cited were measures where he was chief patron:", "• The 2009 military academic credit law mentioned above.", "• A 2008 law to allow people who had their driver's license suspended for failure to pay fines to get a restricted driving permit if they showed there was a good reason they didn't pay their parking tickets. Morrissey's legislation was rolled into a similar bill sponsored by then-Del. Rosalyn Dance, D-Petersburg, that was signed into law.", "• A 2009 law that established guidelines for state investigations of licensed health professionals.", "Of the 26 laws Morrissey cited, the other 23 were measures he co-sponsored. Sometimes he was one of a few delegates backing a bill, but often he was among dozens of fellow lawmakers who supported a bill.", "Sometimes the connection between the statutes to which Morrissey points and the categories Mosby cites is tenuous. But we did find some that could fall into the broad categories of education and workforce issues:", "• Morrissey was one of 21 legislators who co-sponsored a 2010 law establishing virtual schools that allow public school students to take classes online.", "• In 2013, Morrissey was one of 26 co-sponsors of a law that established guidelines for school districts to tackle bullying.", "• In 2008, Morrissey was among 37 co-sponsors of a law authorizing $350 million in bonds for construction projects at colleges.", "In 2009, he was among nine sponsors of a law to establish guidelines for teaching financial literacy to K-12 students.", "Our ruling", "Mosby said \"Joe (Morrissey) has been a delegate in the General Assembly for eight years with no laws passed to help our black community with education or workforce.\"", "A review of Morrissey’s record shows he was not a prolific writer of laws that helped the black community in those two categories. But we don’t come up empty.", "Morrissey introduced a bill - which became a law under another legislator’s name - that allows people who can’t afford to pay traffic fines to keep driving. That will help some people - black and white - get to work.", "Morrissey wrote a law that requires colleges to give credit to students who are deployed by the military during mid-semester. That will help some people - black and white - complete college.", "So Mosby’s statement has some basis but also overlooks some of Morrissey’s broad legislative accomplishments. We rate it Half True.", "Richmond Times-Dispatch, \"In first attack ad of campaign, Mosby says she wouldn’t trust Morrissey with her daughter,\" Oct. 11, 2016. (An audio file attached to the story has a recording of Mosby’s radio ad).", "Email from Michelle Mosby, Oct. 13, 2016.", "Email from Joe Morrissey, Oct. 19, 2016.", "Legislative Information System, accessed Oct. 25-26, 2016.", "Legislative Information System, H.B. 1810, March 27, 2009.", "Legislative Information System, H.B. 1374, Jan. 9, 2008.", "Legislative Information System, H.B. 1852, March 27, 2009.", "Legislative Information System, H.B. 1388, April 11, 2010.", "Legislative Information Sytem, H.B. 1389, April 21, 2010.", "Legislative Information System, H.B. 1871, March 20, 2013.", "Richmond Times-Dispatch, \"Joe Morrissey’s lead in mayoral race shows racial and economic divide in Richmond politics,\" Sept. 2, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]