["About this rating", "In September 2018 a pro-police web site reported that controversial former pro football quarterback Colin Kaepernick donated $25,000 to Assata's Daughters, a non-profit named after Black Liberation Army member Assata Shakur:", "In 1977, Assata Shakur was convicted of aiding and abetting the murder of New Jersey state trooper Werner Foerster in 1973:", "Trooper Werner Foerster was shot and killed with his own service weapon after backing up another trooper who had stopped a vehicle containing two men and a woman on New Jersey Turnpike.", "The subjects started struggling with the troopers and were able to disarm Trooper Foerster. One of the men opened fire, killing Trooper Foerster and wounding the other trooper. Despite the wounds, the other trooper was able to return fire and killed of the subject.", "The three subjects were members of the Black Liberation Army.", "During her trial, Shakur denied any involvement in either Foerster's death or the shooting of his fellow trooper, James Harper:", "[Chesimard's] testimony ended suddenly when Mr. Ball asked her, “On that night of May 2nd, did you shoot, kill, execute or have anything to do with the death of Trooper Werner Foerster?”", "“No,” she replied, shaking her head.", "“Did you shoot or assault Trooper James Harper?”", "“No.”", "The state's case against Mrs. Chesimard, presented over eight weeks through a number of witnesses including Trooper Harper, tells how the trooper stopped white Pontiac bearing Vermont license plates because it had a faulty tail light at about 12:30 A.M. on May 2, 1973.", "Trooper Harper radioed for back‐up support and Trooper Foerster arrived as Mr. Harper began to question the occupants of the car. Mr. Squire, who was driving, went to the back of the car with Mr. Foerster and soon began scuffling with the trooper.", "Mr. Harper testified that Mrs. Chesimard reached down toward the floor of the car and the next thing he knew he was shot through the left shoulder. He testified that he had exchanged shots with both occupants of the car and made his way on foot back to the turnpike headquarters nearby. Trooper Foerster's body was found about an hour later.", "Mr. Squire drove Mr. Costan and Mrs. Chesimard five miles south on the toll road, carried them from the car to grassy spot off the road shoulder and fled when additional state troopers arrived. He was captured the following day. Mrs. Chesimard was wounded and Mr. Costan was dead when the police arrived", "Shakur was found guilty but escaped from prison in late 1979 and eventually made her way to Cuba, where she was granted political asylum and has lived ever since.", "Colin Kaepernick's donation to Assata's Daughters was part of a pledge the quarterback made in September 2016 to give a total of $1 million to charity. That donation was not recent news in September 2018, as it had been made more than a year earlier, in April 2017.", "Kaepernick's official website lists the donation and specifies what the funding was earmarked for:", "AMOUNT: $25,000", "Assata’s Daughters is a Chicago group that focuses on black female empowerment in the tradition of Asaata Shakur.", "This donation will specifically pay for:", "$2,500 Cop Watch\n$2,500 for Garden\n$5,000 Library\n$15,000 Teen Workshops.", "This will pay for 50 teens to attend workshops over a period of 1 year", "In May 2013, Shakur was placed on the Federal Bureau of Investigation's list of most wanted terrorists under her birth name, Joanne Deborah Chesimard. As of September 2018 she is still on that FBI list.", "Assata's Daughters states on their website that the organization \"carries on the tradition of radical liberatory activism encompassed by Assata Shakur,\" adding that \"We grew out of a critical gap in Chicago of programming for young women to get trained up in the radical political tradition of Black feminism, and to learn how to organize around the demand of abolition.\"", "As part of their \"cop watch\" program, the group also offers recommendations for people seeking to record police encounters, advising that those who record such incidents should not interfere with officers as they perform their duties and should \"try to de-escalate the situation, not escalate it.\"", "Assata's Daughters did not respond to a request for comment for this article.", "Sullivan, Joseph F.   \"Mrs. Chesimard, On Stand, Denies Having Weapon in Turnpike Shooting.\"\r\n    The New York Times.   16 March 1977", "Thompson, Krissah.   \"Assata Shakur Was Convicted of Murder. Is She a Terrorist?\"\r\n    The Washington Post.   8 May 2013.", "CORRECTION: A featured photograph of Shakur replaced an earlier photograph of a different activist.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]