["“There is no truth in the (media) reports of Modiji summoning me to Delhi. The (Delhi) trip was long planned. In fact, Modiji loves me like a son,” news agency IANS reported this tweet from Tripura Chief Minister, Biplab Deb. Deb has been in news recently for a spate of ridiculous statements and quoting “sources” several news outlets had reported that he was being summoned to Delhi by PM Modi. In the above context, Biplab Deb’s tweet reported by IANS seemed entirely believable. There was however one problem with it. It was not tweeted by Biplab Deb but a parody handle.", "The parody handle, which has now been deleted, had tweeted several hilarious statements including this one and was widely retweeted. A screenshot of the original tweet is still available and the words match those in IANS story. Tripura Chief Minister Biplab Deb’s verified Twitter handle is @BJPBiplab.", "The IANS story was published and tweeted by several media outlets including Times of India, Hindustan Times, Indian Express and India TV, among others. The story has now been withdrawn by IANS after realizing that it came from a false twitter account.", "How did a news agency like IANS fall for a parody twitter handle? Well it is not difficult given the statements of Biplab Deb over the last few days. Though everyone had a good laugh over this one, we have seen other instances where the objective of a parody handle is to mislead and peddle fake news. These fake twitter handles have often targeted individuals, ascribing fake quotes to them. The recent abuse faced by Rana Ayyub had started with one such fake quote.", "The parody handle’s tweet was retweeted over 1300 times and IANS wasn’t the only one to fall for it.", "When will you stop making foolish statements? Is it because you are not educated or just plain silly? Just because you have become CM that has not given you any right to speak gibberish. It hurts to see a young @BJP4India leader being laughed at and ridiculed cc @AmitShah", "— Udayan Bose (@boseudayan) April 30, 2018", "Considering how frequently tweets from parody handles have led to errors by individuals and news organisations, Twitter must consider having a proper visual indicator for parody handles.", "Donate Now", "Follow @free_thinker", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]