["By Robert Farley and Eugene Kiely", "Posted on November 19, 2018", "President Donald Trump in recent days has engaged in some post-election spin:", "Trump’s claim about the Florida race came during an interview on “Fox News Sunday” on Nov. 18, as the president boasted about the positive effect his campaigning had on behalf of several Senate candidates.", "Trump, Nov. 18: Look at Florida. I went down to Florida. Rick Scott won and he won by a lot. I don’t know what happened to all those votes that disappeared at the very end.", "According to the Florida Division of Elections, after a recount, Scott beat incumbent Florida Sen. Bill Nelson by 10,033 votes. That’s out of 8.19 million votes cast, a razor-thin margin of 0.12 percentage points. It was the closest Senate race in the country this year.", "That also makes it the narrowest win ever in a Senate race decided by Florida voters.", "“In short, the Rick Scott vs. Bill Nelson race goes down in the history books as the most competitive and narrowly-decided of the 38 U.S. Senate races in Florida during the direct election era,” Eric Ostermeier, a research associate for the Humphrey School of Public Affairs at the University of Minnesota, told us via email.", "Since the ratification of the 17th Amendment in 1913, U.S. Senators have been chosen by popular vote in each state — in other words via direct election. Prior to that, senators were chosen by state legislatures.", "Ostermeier, who runs a nonpartisan political news site, Smart Politics, at the Humphrey School’s Center for the Study of Politics and Governance, has compiled a list of the closest Senate elections in all 50 states. Only eight other states have ever had a closer Senate race than Florida’s this year.", "The New Hampshire Senate race in 1974 wins the crown as the closest in history. After a recount, the state’s secretary of state declared Democrat John Durkin the winner over Republican Louis Wyman by 10 votes. After its own partial recount, the state’s ballot commission concluded Wyman won by two votes. After a great deal of political and legal maneuvering, the two sides agreed to a special election do-over the following September and Durkin ended up winning by a convincing 27,000 votes.", "The second closest Senate election was the Minnesota race in 2008, when, after a mandatory recount, Democrat Al Franken edged Republican Norm Coleman by 225 votes, out of nearly 3 million votes cast.", "The Florida race wasn’t quite that close, but it was awfully close by historical standards.", "For days, Trump has complained about the Florida race, wrongly claiming that Scott “won” on election night “by a comfortable margin,” and that Democrats were trying to go back and “steal” the election. But, as we wrote, that wasn’t accurate. Election officials were counting absentee and provisional ballots, which reduced Scott’s lead. In addition, the razor-close results triggered an automatic machine and manual recount.", "So, while Scott’s margin of victory narrowed to just over 10,000 votes as a result of those counts, no votes “disappeared at the very end,” as Trump claimed. Nelson conceded the race on Nov. 18.", "“The only way for President Trump to claim that Scott won by ‘a lot’ is to simultaneously claim that either a) a very large number of votes were cast for Scott and not counted or b) a very large number of votes cast for Nelson were fraudulent and improperly counted,” Ostermeier said. “To date, no evidence has demonstrated either scenario. A U.S. Senate race has not been any closer than this one in the Sunshine State.”", "In a Nov. 16 tweet, the president complained that “fake news” was not telling the American people about his “epic victory” in the Senate and “only wants to speak of the House, where the Midterm results were better than other sitting Presidents.”", "People are not being told that the Republican Party is on track to pick up two seats in the U.S. Senate, and epic victory: 53 to 47. The Fake News Media only wants to speak of the House, where the Midterm results were better than other sitting Presidents.", "— Donald J. Trump (@realDonaldTrump) November 16, 2018", "The Republicans did retain control of the Senate, although it is still unclear if the party will wind up with 52 or 53 seats. This has been widely reported, despite the president’s claim of “fake news.”", "The party had 51 seats before the election and, as of Nov. 19, has netted one additional seat with Scott’s victory over Nelson in Florida. The GOP could further expand its Senate majority to 53 if Republican Sen. Cindy Hyde-Smith wins the Nov. 27 runoff election against Democratic challenger Mike Espy in Mississippi. (Neither candidate in Mississippi won a majority of the vote in the Nov. 6 general election, forcing a runoff.)", "Whether winning one or two seats qualifies as an “epic victory” is a matter of opinion. But it is true that the president’s party generally loses seats in midterm elections, as the Cook Political Report explained before the 2018 midterms.", "“History tells us that the president’s party will lose seats in midterm elections,” the Cook Political Report writes. “In the House, the president’s party has lost seats in 35 out of 38 elections (92%) since the end of the Civil War. In the Senate, the president’s party has lost seats in 19 out of 26 elections (73%) since 1913 (when the 17th Amendment allowed for direct election of Senators).”", "Although it maintained control of the Senate, the Republican Party lost the House. As of Nov. 19, the Republicans had a net loss of 37 seats — which is not “better than other sitting Presidents” in most midterm elections since 1946.", "The chart below shows that a net loss of 37 House seats, so far, is worse than the president’s party has done in 12 of the 19 midterm elections since 1946.", "The GOP House losses, however, are in line with unpopular presidents.", "“In Gallup’s polling history, presidents with job approval ratings below 50% have seen their party lose 37 House seats, on average, in midterm elections,” Jeffrey M. Jones, of Gallup, wrote prior to the election. “That compares with an average loss of 14 seats when presidents had approval ratings above 50%.”", "Trump’s approval ratings ranged from the mid-40s to the high-30s since taking office in January 2017, according to Gallup polling data.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]