["One viral Facebook post claims that \"the brilliant idea\" of combing nursing homes and orphanages in Canada has been implemented to provide more comfort and  \"the result exceeded all expectations.\"", "\"The elderly found loving grandchildren, and orphans for the first time felt what love and paternal care was,\" reads a March 11 Facebook post. \"Doctors are observing an improvement in all vital functions in the elderly, a great interest in life is awake in the eyes.\"", "Accompanying the text is an image of an elderly man holding a young child. The meme was posted to the Facebook group Wholesome Memes for Kindhearted Homies; it has over 1,200 shares and 3,800 reactions.", "USA TODAY was unable to reach the Facebook user for comment.", "Fact check: Viral post inaccurate in criticism of Democratic women on Cuomo allegations", "A reverse Google search of the meme posted by the Facebook user reveals that the claim recently went viral on LinkedIn, where it was shared by a couple of different users in February.", "In one of the LinkedIn posts, users asked for links proving that senior facilities were combined with orphanages. In response, the user who shared the post said she did not discover any evidence of senior living homes being combined with orphanages.", "Ann Murley, one of the LinkedIn users who shared the posts, told USA TODAY in a message that she never found anything to corroborate the story. Julia Tobiason, another LinkedIn user who shared the claim, told USA TODAY she found it on an article that was shared quite some time ago.", "In 2020, fact-checking site Misbar debunked a similar version of the claim that used a photo of elderly people carrying children. Misbar found that the image used in the meme to support the claim was actually taken in 2013 in Karlsruhe, Germany.", "Fact check: CDC study links mask mandates to slowing COVID-19 infections and deaths", "A search for assisted living facilitates and orphanages that have been merged resulted in no matches, however, there are reports of seniors visiting with kids at child care facilities in Canada.", "The Toronto Star reported in 2016 that seniors from a long-term care home spent time with children at a child care center to get seniors moving and have children develop empathy and understanding. The sessions included bimonthly cooking, crafts, bingo, Halloween parades and other activities to \"build connections between the children and the seniors,\" according to the article.", "Similarly, at the Montessori Chlildren's Community in Vancouver in 2016, seniors and children spent time doing crafts and the children would visit the seniors whenever they were not able to play outdoors or if the weather was bad, according to the Vancouver Sun.", "Daniel Fontaine, CEO of the B.C. Care Providers Association, told the Vancouver Sun that out of British Columbia's 460 government and private nursing homes, only a handful have daycares or doctor's offices on site. Further, none is attached to a facility that offers a variety of community services.", "Catrin Hedd Jones, a lecturer in dementia studies at Bangor University, wrote in 2017 for The Conversation that she took part in a project where nursery children were introduced to an adult daycare facility and both generations spent three days together doing activities implemented by a team of psychologists.", "They found that a few days in each others' company resulted in \"life affirming interactions\" and the care staff commented on how beneficial the intergenerational project had been.", "Fact check: Viral image of rare blue turtle actually shows an artist-made glass pendant", "The claim that nursing homes and orphanages were combined in Canada is FALSE, based on our research. While there are reports of kids from child care facilities spending time with seniors at nursing homes, there is no evidence of orphanages and long-term care facilities merging in Canada.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]