["The image was shared here by a Facebook page with more than 56,000 followers on March 29.", "Below is a screenshot of the post:", "The Hindi-language caption translates to English as: “Sister of a Janeu wearing upper-caste Hindu is wearing a cross instead of a Mangalsutra.”", "\"Janeu\" is a reference to a holy thread worn by Hindu men. This article published on March 5, 2017, by Indian TV channel Zee News explains the significance of the Janeu.", "\"Mangalsutra\" is a type of sacred gold necklace worn by married Hindu women. Here is a definition of mangalsutra in the Collins English Dictionary.", "“And she says that she is the daughter of Ganga. She is part of the corrupt family, who is out on bail,\" the misleading post's caption says.", "\"Ganga\" is a reference to India’s holy river, the Ganges.", "Gandhi describes herself as the General Secretary of the Indian National Congress party on her official Twitter profile.", "The misleading image and similar claims has been posted widely on Facebook, for example here and here, and on Twitter here.", "A reverse image search on Google found the photo had been doctored from this AFP image of Gandhi taken at a rally in 2017.", "Below is a screenshot of the image on the AFP website:", "The caption states: “Indian Congress Party leader Priyanka Gandhi arrives at a rally held to support party candidates during the ongoing Uttar Pradesh state assembly elections at Rae Bareli on February 17, 2017. Millions of voters in India's most populous state are casting their ballots in an ongoing contest seen as a key test for Narendra Modi halfway through his first term as prime minister. Uttar Pradesh is home to over 200 million people -- more than the entire population of Brazil -- and polls in the battleground state are a bellwether of national politics. SANJAY KANOJIA / AFP.”", "The image was also published here in a report by Abu Dhabi based newspaper The National on February 19, 2017.", "Here is a screenshot of the report:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]