["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Let's fight against fake news.", "March 2017 was a very newsy month in Washington D.C., chock-full of claims about wiretapping, health care reform and sanctuary cities.", "What about the \"arrest\" of House Minority Leader Nancy Pelosi?", "On March 10, 2017, internet posts started spreading this fake news story with headlines such as \"BREAKING: Nancy Pelosi Was Just Taken From Her Office In Handcuffs.\"", "PolitiFact California examined the origins of this claim as part of the inaugural International Fact-Checking Day, April 2, 2017. Organizers at Poynter.org describe the day as \"not a single event but a rallying cry for more facts - and fact-checking - in politics, journalism, and everyday life.\"", "Editor's note: Sunday, April 2, is International Fact-checking Day. To mark the day, PolitiFact will conduct a \"fact-check-a-thon\" on fake news. Here, our editor Angie Drobnic Holan explains the need for an International Fact-checking Day and how you can stand up for facts.", "In the posts we examined, the same false details emerged about the U.S. Secret Service arresting Pelosi, a Democrat from San Francisco, because she was \"wanted for questioning in a possible coup attempt against the president.\"", "No credible media sources repeated the story. Also, the fact-checking website Snopes.com, called it out as \"False\" on March 11, 2017.", "As is the case with several other claims checked before by PolitiFact, this fake news claim originally came from a website called TheLastLineOfDefense.org.", "As noted by Snopes.com, the claim then spread to other \"unreliable sites.\"", "TheLastLineOfDefense.org doesn’t identify the Pelosi story as fake, but its About Us page notes that \"all articles should be considered satirical and any and all quotes attributed to actual people complete and total baloney.\"", "The site has not responded to PolitiFact.", "Not locked up", "Rather than being behind bars, Pelosi has remained active in Washington D.C. and in her district in recent weeks.", "Here’s a look at what she’s been up to:", "-- Pelosi spoke at a press conference on March 13, 2017 in Washington D.C. in response to the Congressional Budget Office’s report on the GOP health care proposal", "-- Pelosi participated in a press conference on March 24, 2017 in Washington D.C. reacting to the GOP’s failed bid to repeal Obamacare", "-- Pelosi attended a town hall meeting with constituents in San Francisco on March 25, 2017", "-- Pelosi called for House Intelligence Committee Chairman Devin Nunes, R-California, to recuse himself from the panel’s investigation into Russian meddling in the 2016 presidential election", "In the end, the claim that Pelosi was \"just taken from her office in handcuffs\" is \"total baloney,\" to use a phrase from TheLastLineOfDefense.org.", "We rate it Pants on Fire.", "PANTS ON FIRE – The statement is not accurate and makes a ridiculous claim.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "TheLastLineOfDefense.org and usanewspost.us, BREAKING: Nancy Pelosi Was Just Taken From Her Office In Handcuffs, March 10, 2017", "Snopes.com, Nancy Pelosi Arrested by Secret Service for Coup Attempt? March 10, 2017", "Sfgate.com, Pelosi, Speier greet hundreds at Balboa High town hall meeting, March 26, 2017", "YouTube video, Nancy Pelosi and Chuck Schumer press conference on CBO Report, March 13, 2017", "House Democrats Facebook page, video of Nancy Pelosi, March 24, 2017", "New York Times, House Democrats Ask Devin Nunes to Recuse Himself From Russia Inquiry, March 27, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]