["About this rating", "Beagles have been used in the course of testing products from various industries (including pharmaceuticals, veterinary supplies, and cleaning products).", "An image does not depict a beagle blinded in animal testing carried out by L'Oreal cosmetics, nor does L'Oreal regularly carry out such testing.", "On 24 May 2016, a Facebook user published the above-reproduced image of a partially blinded beagle, along with the claim that it represented the harmful effects of cosmetics testing on animals:", "When cosmetics companies like L'Oreal want to test their products, they often use beagles. They take the potentially toxic ingredients in their products and stick them in the puppy's eye in large doses to test how much of a product is needed to cause harm. When they finish, they remove the Beagle's eye and start again on the other eye. When the beagle runs out of eyes, they kill him. This is why we never support animal testing companies.", "The photograph caused alarm and concern among animal lovers worried about whether the beagle's injuries were truly inflicted by L'Oreal (or any other cosmetics brand). A reverse image search revealed that the photograph had appeared years earlier on Portuguese-language web sites, with many English-language sites later using the same image to blame Mary Kay, Avon, or Procter & Gamble for the beagle's injuries:", "This doleful image was earlier published on a Brazilian web site, where it was identified as having been taken in the city of São Roque in relation to a controversy involving animal testing at the Instituto Royal laboratory, and it was also posted to Instagram in connection with rumors linked to that laboratory and location:", "An article published in the Brazilian version of the Epoch Times reported that the lab in question had been closed after protests by animal rights supporters and stated that the institute tested \"cosmetics and cleaning products\" of unspecified origin:", "The Royal Institute announced it is ending the activities of the laboratory in São Roque, in the state of São Paulo. The decision comes after the release of 178 beagle dogs, used in laboratory tests for cosmetics and cleaning products, by protesters. The case was widely reported and generated discussions on ethics related to the use of animals in testing. The institute has been investigated by prosecutors since 2012 for their mistreatment of animals.", "A 2013 news article also reported on the beagle controversy but made no specific mention of cosmetics testing at the lab in question:", "A group of animal rights activists have been camped in front of the Royal Institute in São Roque (SP) since they stormed the headquarters of the laboratory, which conducts research for the pharmaceutical and veterinary industries, among others. The protesters, including members of the Black Bloc SP, accused the company of the ill-treatment of beagle dogs used in research.", "Protests against the Royal Institute began just last year. Activists claim that the company practices irregularities and criminal acts against animals ... The Royal Institute defends their research on their web site and says they respect all national and international standards in dealing with dogs in the laboratory. The company is an Oscip (Civil Society Organization of Public Interest) and receives public money thanks to the support of funding agencies for scientific research. Animal advocates say the company does not have licenses and permits for the activities it performs.", "Contemporaneous articles mentioned \"cosmetic and pharmaceutical testing,\" and a blog post claimed the contraceptive Norplant was among the products tested on the since-liberated beagles. Scientists who worked for the lab lamented the loss of a decade of research in the clashes with animal rights activists:", "For the scientific director of the Royal Institute, João Antônio Pegas Henry, the damage is incalculable. John Anthony said that the biggest problem was not the liberation of animals, but rather the destruction of the building, material, and especially of their research.", "\"[The activists] destroyed the laboratory, including computers holding research data. We can fix the material damage, but the damage to science is incalculable. There was material that was in its final stages after a ten-year study. Everything was lost,\" says John Anthony.", "According to the coordinator of the National Council of Animal Experimentation Control (Concea), Marcelo Marcos Morales, the institute in São Roque is the most important laboratory of the country in relation to such experimentation.", "While the precise origin of the beagle photograph purportedly linked to L'Oreal research is unknown, the image was originally circulated as one linked to a 2012 controversy involving the since-closed Instituto Royal of São Roque. Testing carried out at the lab while it was operational was not restricted to cosmetics, and most reports named pharmaceutical and household products as the primary substances researched at the Institute. The photograph has long since been repurposed to claim a number of popular cosmetics brands such as MAC, Avon, Mary Kay, and Head & Shoulders were responsible for the beagle's injuries.", "On L'Oreal's web site, the brand discloses their policy on animal testing, a position a representative for L'Oreal reiterated to us on 27 May 2016:", "L’Oréal no longer tests on animals any of its products or any of its ingredients, anywhere in the world. Nor does L’Oréal delegate this task to others. The rare exception allowed is if regulatory authorities demand it for safety or regulatory purposes.", "This image was not the first spurious animal testing rumor attached L'Oreal on social media. Previously, a photograph of a sick rabbit unrelated to animal testing was circulated alongside claims that the animal was also a victim of cruel experiments carried out by L'Oreal.", "Lungarzo, Carlos Alberto.    \"O Que É O Instituto Royal?\"\r\n      RevistaForum.     31 October 2013.", "Menezes, Bruno.     \"Instituto Royal Fecha Laboratório Em São Roque.\"\r\n     The Epoch Times.     7 November 2013.", "Globo.    \"Após Denúncia De Maus-Tratos, Grupo Invade Laboratório E leva Cães Beagle.\"\r\n    18 October 2013.", "Globo.    \"Além De 178 Beagles, Sete Coelhos Também Foram Levados de Empresa.\"\r\n    18 October 2013.", "Globo.    \"Invasão Ao Prédio Do Instituto Royal Em São Roque Completa Um Ano.\"\r\n    18 October 2014.", "Veja.     \"Laboratório No Interior De São Paulo É Invadido Por Ativistas.\"\r\n    18 October 2013.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]