["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Denver Broncos personnel take part in a June 6, 2020, rally at a downtown Denver park over the death of George Floyd. (AP)", "NFL Commissioner Roger Goodell said in a June 5 statement that “black lives matter.”", "There is no evidence that the league is planning to fly a flag associated with the Black Lives Matter movement at football games.", "On the same day that NASCAR announced it was banning the Confederate flag from its races, Facebook users started to share rumors about another race-related change at sporting events.", "A June 10 text post claims that the NFL is planning to fly a \"‘Black Lives Matter’ flag under the American flag at games.\"", "\"Your thoughts?\" asks the post, which was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The rumor was published as tens of thousands of Americans across the country peacefully protest against police brutality and discrimination against black Americans. The protests began after the death of George Floyd in Minneapolis police custody.", "(Screenshot from Facebook)", "We reached out to the original poster for their evidence, but they didn’t supply any. Instead, they deleted the post. (We found several similar posts from conservative Facebook pages.)", "While NFL Commissioner Roger Goodell said in a recent statement that \"black lives matter,\" there is no evidence that the league is planning to fly a flag associated with the movement at football games.", "On June 5, the NFL released a video of Goodell talking about \"racism and the systematic oppression of Black People.\"", "\"We, the National Football League, admit we were wrong for not listening to NFL players earlier, and encourage all to speak out and peacefully protest,\" he said. \"We, the National Football League, believe black lives matter. I personally protest with you and want to be part of the much-needed change in this country.\"", "We, the NFL, condemn racism and the systematic oppression of Black People. We, the NFL, admit we were wrong for not listening to NFL players earlier and encourage all to speak out and peacefully protest. We, the NFL, believe Black Lives Matter. #InspireChange pic.twitter.com/ENWQP8A0sv", "The video was a nod to Colin Kaepernick, a civil rights activist and former quarterback for the San Francisco 49ers, though Goodell did not mention him by name. Kaepernick, who led the 49ers to the Super Bowl in 2013, returned to the spotlight during the 2016 season for choosing to sit or kneel during the pregame national anthem in protest of police brutality and discrimination against black Americans — a move that the NFL did not endorse.", "Kaepernick has not played in the NFL since that season. His 2017 grievance against the league, alleging that NFL teams colluded to keep him off their rosters, was settled in 2019.", "Nowhere in Goodell’s statement did he say that the NFL would fly a Black Lives Matter flag at football games. We could find no such promise on the league’s Twitter page, its website or reported in the media.", "We reached out to the NFL for a comment, but we haven’t heard back.", "The Facebook post is inaccurate. We rate it False.", "Facebook post, June 10, 2020", "Facebook post, June 10, 2020", "Facebook post, June 10, 2020", "Facebook post, June 11, 2020", "NBC Sports, \"NASCAR bans confederate flag,\" June 10, 2020", "NFL Communications, accessed June 11, 2020", "Twitter advanced search, accessed June 11, 2020", "Twitter video from the NFL, June 5, 2020", "The Washington Post, \"A timeline of Colin Kaepernick’s protests against police brutality,\" June 1, 2020", "Yahoo! Sports, \"Roger Goodell: NFL admits 'we were wrong' on player protests, says 'black lives matter,’\" June 5, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]