["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic vice presidential candidate Sen. Kamala Harris, D-Calif. speaks during a campaign event, Oct. 24, 2020, in Cleveland. (AP)", "The photo was taken from a video Kamala Harris tweeted in November 2019, when she attended a Turkey Trot in downtown Des Moines, Iowa.", "She does not appear intoxicated in the video, nor is she staggering or vomiting.", "We found no credible evidence that she was intoxicated in Cleveland on Oct. 24, when she was in town for a campaign rally.", "Democratic vice presidential nominee Kamala Harris stopped in Cleveland on Oct. 24 for a rally where she encouraged voters to endure long lines to cast a ballot.", "But later that day, an image of the California senator started to spread on social media. She looks hunched over, with her mouth open and her eyes closed.", "\"Throwing up in the bushes & staggering aimlessly at the #Cleveland airport was the last straw before staffers put #KamalaHarris back in the place and took off for #Oshkosh,\" one account posting the image said. \"Onlookers claim the clearly intoxicated Harris was confrontational but too weak to put up much of a fight.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) That’s because it actually shows Harris in Des Moines last Thanksgiving, when she was still running for president.", "The image comes from a video that Harris posted on Twitter on Nov. 28. She attended a turkey trot in downtown Des Moines that day while her brother-in-law ran the 5K race.", "\"Congratulations to all the Des Moines Turkey Trot runners,\" she tweeted. \"Now it’s time for some turkey.\"", "Congratulations to all the Des Moines Turkey Trot runners! Now, it’s time for some turkey. pic.twitter.com/mSKECEQSNG", "The exact frame featured in the Facebook post is about 5 seconds in, when Harris leans over to offer a child a cookie. She doesn’t appear \"clearly intoxicated,\" nor is she staggering or vomiting.", "We found no credible evidence that Harris was intoxicated then, or in Cleveland on Oct. 24.", "We rate this Facebook post Pants on Fire.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Oct. 24, 2020", "Cleveland Plain Dealer, Kamala Harris urges Ohioans to overcome obstacles, including long lines, to vote, Oct. 24, 2020", "Des Moines Register, Thanksgiving on the trail: Two presidential candidates spend the holiday in Iowa, Nov. 28, 2019", "Kamala Harris tweet, Nov. 28, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]