["About this rating", "Hunter Biden sat on the board of Ukrainian natural gas company Burisma from 2014 to 2019. The Wall Street Journal reported in 2015 that Ukrainians had donated more than citizens of any other country to the Clinton Foundation between 1999 and 2014.", "However, we found no evidence that either Hunter or Joe Biden engaged in any wrongdoing in relation to Burisma or Ukraine, or that any of Mitt Romney's sons worked for energy companies linked to Ukraine. John Kerry's stepson never conducted any business in Ukraine, and the association between Ukraine and a Paul Pelosi Jr.-linked energy company is bogus. We also found no evidence exists of any connection between donations to the Clinton Foundation and any of the aforementioned activities.", "Amid intensifying debate around the prospect of U.S. President Donald Trump's impeachment after it was revealed he had asked Ukrainian President Volodymyr Zelensky to investigate unsubstantiated rumors about former Vice President Joe Biden's dealings with that country, Republicans and Trump supporters hit back by attempting to tie several high-profile Democrats and their families to Ukraine.", "Right-leaning websites scrutinized the purported business activities of Paul Pelosi Jr., son of House Speaker Nancy Pelosi, and attempted to draw a meaningful connection between Ukraine and the Clintons.", "On Oct. 6, the Twitter account @RealJack posted a widely-shared tweet which claimed that the sons of Biden and Pelosi, as well as those of former Secretary of State John Kerry and Sen. Mitt Romney (R-Utah), had worked for \"energy companies doing business in Ukraine\":", "Biden's son\nPelosi's son\nRomney's son\nKerry’s son", "All are on the board of directors for energy companies doing business in Ukraine...", "Coincidence?", "No.", "— Jack Murphy (@RealJack) October 6, 2019", "@RealJack's claims were further promulgated when multiple Facebook accounts re-posted the wording of his tweet, including the group \"Texas for Donald Trump 2020\":", "On Oct. 8, the right-leaning, Trump-supporting Twitter account @Education4Libs attempted to draw all these strands together with a widely-shared, innuendo-laden tweet claiming that an unspecified conspiracy connected donations to the Clinton Foundation with the alleged business activities of the sons of prominent Democrats: \"From 1999-2014, Ukraine donated more money to the Clinton Foundation than any other foreign country. Biden, Pelosi, Kerry, & Romney all have children working for Ukrainian gas companies. And all of the people I mentioned want Trump impeached. Are you connecting the dots yet?\"", "From 1999-2014, Ukraine donated more money to the Clinton Foundation than any other foreign country.", "Biden, Pelosi, Kerry, & Romney all have children working for Ukrainian gas companies.", "And all of the people I mentioned want Trump impeached. Are you connecting the dots yet? ?", "— Educating Liberals (@Education4Libs) October 8, 2019", "These tweets constituted a mixture of some accurate statements with mostly false claims, as well as unsubstantiated suggestions of unspecified wrongdoing or corruption on the part of those involved.", "Clinton Foundation donations", "In 2015, the Wall Street Journal reported that between 1999 and 2014, Ukrainians had donated more than individuals of any other nationality to the Clinton Foundation, a non-profit humanitarian organization founded by former President Bill Clinton. So @Education4Libs' claim that Ukraine as a country -- rather than individual Ukrainian nationals -- had topped the list of donations was not backed up by the Journal's research.", "Hillary Clinton stepped away from her seat on the board of directors of the Clinton Foundation when she became Secretary of State in 2009. According to the foundation's website, neither she nor Bill nor Chelsea Clinton has ever derived any personal income from their involvement in the charity.", "The Bidens", "Hunter Biden, the former vice president's 49-year-old son, served on the board of Burisma Holdings, a major Ukrainian natural gas producer, from 2014 until April 2019, according to multiple reports. His decision to join the company's payroll caused some political discomfort at the time, since Burisma's owner had recently been embroiled in a money-laundering scandal and Biden's father, the vice president, was heading the Obama administration's efforts to discourage and crack down on corruption in Ukraine.", "However, no evidence has yet emerged suggesting that either Biden engaged in any wrongdoing with regard to Burisma or Ukraine, despite President Trump's efforts to have both men investigated. It is accurate to say that Hunter Biden worked for and was on the board of Burisma, a Ukrainian natural gas company, but no evidence indicates any link between his work there and Ukrainian donations to the Clinton Foundation.", "Furthermore, @Education4Libs claimed in October that Biden is \"working for\" a Ukrainian gas company, but that's not correct since he stepped down from his place on the board in April 2019.", "The Pelosis", "Paul Pelosi Jr., son of House Speaker Nancy Pelosi, was at one time on the board of a California-based oil-processing company called Viscoil, according to the account he gave in a video recorded in 2010. The link between Viscoil and Ukraine is either tenuous or non-existent and does not appear to involve Pelosi at all.", "Viscoil was linked to a somewhat shadowy figure going by the name \"Ana Shell,\" who claims to be an investor and environmental entrepreneur, and claims to have provided funding to both Viscoil and another entity called NRG Lab. The purported Ukraine connection arose from a YouTube video posted by \"NRG Lab Research Council\" in 2013, whose caption stated \"Mika Newton helped to secure the rights to build a plant for the production of SH-boxes in Ukraine.\"", "That single line from the caption of an NRG Lab promotional video was cited by Patrick Howley, who writes for The Epoch Times, a website known for promulgating pro-Trump misinformation, in advancing a link between Pelosi and an energy company that \"did business in Ukraine.\" However, the claim that Newton, a Ukrainian singer born Oksana Stefanivna Hrytsay, had any connection to NRG Lab or Viscoil, appears to be false.", "We found a Facebook page labelled \"Mika_Newton.official\" which appears distinctly unofficial, has very little content apart from \"Ana Shell\" promotional imagery, and includes the following description: \"Hi, my name's Mika Newton. This is my official page to support projects that NRGLab Singapore makes\":", "Neither Newton's actual official Facebook page nor her Instagram account (where she engages in prolific product promotion) contain any mention of NRG Lab, Viscoil, or \"Ana Shell.\" The link between NRG Lab, Newton, and production rights in Ukraine appears to be bogus.", "In any event, Pelosi appears to have ended his involvement with Viscoil before the bogus Mika Newton connection was ever made. A spokesperson for Speaker Pelosi told PolitiFact that: \"The company [Viscoil] was based in Southern California and focused solely on U.S. business. The company later reorganized under a different name [NRG Lab], but Paul Pelosi Jr. played no role in the new entity.\"", "Pelosi Jr. did travel to Ukraine in 2017, but that trip related to his work for the Corporate Governance Initiative and had no discernible link to Viscoil, NRG Lab, or \"Ana Shell.\"", "John Kerry", "This claim is riddled with errors. First off, former Secretary of State and 2004 Democratic presidential candidate John Kerry doesn't have a biological son. The man in question is his stepson, Chris Heinz, who was born to Kerry's wife, Teresa Heinz Kerry, and her first husband, John Heinz.", "Heinz appears to have been added to the list because of his former business partnership with Hunter Biden and their friend Devon Archer. The three men formed an investment firm called Rosemont Seneca, and both Archer and Biden later joined the board of Burisma. However, Heinz did not.", "In fact, according to reports by The Washington Post and the Washington Examiner, Heinz expressed his own reservations about Archer and Biden's decision at the time, which underlines just how inaccurate and wrongheaded the meme's inclusion of Heinz was.", "A spokesperson confirmed to Snopes that Heinz had never been involved in Burisma in any way, nor had he ever worked for or sat on the board of directors of any energy company, or even traveled to Ukraine.", "Mitt Romney", "Mitt and Ann Romney have five sons, and we found no evidence that any of them have ever had any involvement with either a \"Ukrainian gas company\" or an \"energy company doing business in Ukraine.\"", "The couple's oldest son Tagg (49) has worked as a vice president at Reebok, chief marketing officer for the Los Angeles Dodgers, founded the investment firm Solamere Capital, and worked as an advisor and surrogate during his father's 2002 Massachussetts gubernatorial campaign as well as his 2008 and 2012 presidential campaigns.", "Matt Romney was previously marketing director for the software company LavaStorm, worked as a real estate developer in California, and as a vice president for the real estate investment firm Excel Trust (which was acquired by the private equity firm Blackstone in 2015).", "Josh Romney is president of the Romney Group, a Utah-based real estate and property investment firm, and chairman and owner of Intercap Lending, a mortgage lender. He previously worked as a real estate developer in Salt Lake City.", "Ben Romney is a radiologist in Utah and Idaho, and Craig Romney, the youngest son, has worked in music production for the advertising firm McGarry Bowen and later for the real estate investment firm Sundance Bay.", "Contrary to @Education4Libs' claim, Romney had not called for President Trump's impeachment as of Oct. 8, undermining the putative basis for the Romney family's inclusion in the nonexistent conspiracy of wrongdoing to which the meme alluded.", "One America News Network.   \"Son of House Speaker Pelosi Made Money in Ukraine, Used Her in Ads.\"\r\n    4 October 2019.", "DCWhispers.com.   \"Bingo! Clinton Foundation Donor Amounts by Country -- Guess Who Was #1.\"\r\n    27 September 2019.", "Grimaldi, James V. and Rebecca Ballhaus.   \"Clinton Charity Tapped Foreign Friends.\"\r\n    The Wall Street Journal.   19 March 2015.", "Braun, Stephen and Lynn Berry.   \"The Story Behind Biden's Son, Ukraine and Trump's Claims.\"\r\n    Associated Press.   23 September 2019.", "Vogel, Kenneth P. and Iuliia Mendel.   \"Biden Faces Conflict of Interest Questions That Are Being Promoted by Trump and Allies.\"\r\n    The New York Times.   1 May 2019.", "Sonne, Paul et al .  \"The Gas Tycoon and the Vice-President's Son: The Story of Hunter Biden's Foray Into Ukraine.\"\r\n     The Washington Post.   28 September 2019.", "Wilkinson, Tracy and Sergei L. Loiko.   \"Former Ukraine Prosecutor Says He Saw No Evidence of Wrongdoing by Biden.\"\r\n    The Los Angeles Times.   29 September 2019.", "Goodman, Alana.   \"John Kerry's Son Cut Business Ties with Hunter Biden Over Ukrainian Oil Deal.\"\r\n    The Washington Examiner.   27 August 2019.", "Henson, Steve.   \"Little Takes Laid-Back Approach to Dodgers.\"\r\n    The Los Angeles Times.   2 December 2004.", "Mims, Bob.   \"Genealogy Website Gets Swamped by Searchers.\"\r\n    The Spokesman-Review.   29 May 1999.", "Luo, Michael.   \"Romneys Invade Iowa.\"\r\n    The New York Times/em>.   11 August 2007.", "Olson, Kyle.   \"Nancy Pelosi's Son Appears in Ukraine -- To Talk Soccer?\"\r\n    The American Mirror.   25 July 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]