["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sens. Amy Klobuchar, D-Minn., and John Barasso, R-Wyo., discuss the Keystone XL pipeline on \"Meet the Press\" Jan. 4, 2015.", "Considering the United States’ strength in energy production, the debate over building the Keystone XL pipeline has become a symbolic one, said Sen. Amy Klobuchar, D-Minn.", "On NBC’s Meet the Press on Jan. 4, 2015, Sen. John Barrasso, R-Wyo., said the new Republican Congress’ first priority in 2015 will be to pass a bill approving construction of the oil pipeline, which would stretch from Canada to Steele City, Neb., where it would connect with an existing pipeline that goes to the coast of Texas.", "Klobuchar responded by saying the project \"has merit\" but that the decision to build the pipeline should rest with President Barack Obama, not Congress. She said the debate has become a \"symbolic\" one that ignores America’s healthy energy market.", "\"We're now the no. 1 producer of oil in the world,\" she said. \"We've surpassed Saudi Arabia.\"", "We decided to check out the data and see if in fact the United States is the world’s top oil producer. As it turns out, the United States passed over Saudi Arabia about two years ago.", "According to the U.S. Energy Information Administration, which tracks global energy production and consumption statistics, the United States has produced more oil than Saudi Arabia since the fourth quarter of 2012. American oil production surpassed Russia in 2011.", "Here’s a chart showing the trend from the Energy Information Administration:", "In the third quarter of 2014 -- the most recent available data -- the United States produced 14.2 million barrels of oil per day; Saudi Arabia produced 11.7 million per day; and Russia produced 10.5 million per day. Together, that’s about 40 percent of total global production.", "This production growth has contributed to the United States’ ability to produce more oil than it imports for the first time in about 20 years.", "The Energy Information Administration expects American production to continue to grow in 2015, despite recent lower crude oil prices.", "Total oil production figures include crude oil, natural gas liquids and other liquid energy products.", "On top of oil, the United States produces significantly more natural gas than Saudi Arabia. According to the Energy Information Administration, United States energy production is about evenly split between petroleum and natural gas. Saudi Arabia, on the other hand, primarily produces petroleum.", "The majority of the United States’ oil production growth is concentrated in four regions: Bakken, N.D., Eagle Ford, Texas, the Niobrara region in the Upper Midwest, and the Permian Basin of Texas and New Mexico.", "North Dakota and Texas together comprise almost 50 percent of all crude oil production in the United States -- compared to 2010, when the two states combined produced just 26 percent of all United States crude oil production.", "In 2013, energy markets consultant group PIRA Energy published a report that said shale production is one of the driving forces behind the country’s production growth. Shale oil and gas are commonly associated with hydraulic fracturing, or fracking, which is the process of using water pressure to fracture a rock to release natural gas and oil. The United States is the world leader in shale gas production.", "There is at least one piece of context to keep in mind when looking at the United States’ oil production compared to Saudi Arabia, noted Leonardo Maugeri, an associate at Harvard University’s Geopolitics of Energy project. Saudi Arabia has a higher capacity than the United States to produce oil, but it chooses not to use it all -- so as not to inundate the global oil market.", "\"In other words, if Saudi Arabia produced at full capacity -- as the U.S. does -- its production would be higher than the U.S.,\" Maugeri said.", "Our ruling", "Klobuchar said the United States is \"now the No. 1 producer of oil in the world.\"", "The latest global oil production statistics back up Klobuchar’s claim. The United States has been the world’s largest oil producer since late 2012. We rate her statement True.", "Help fund PolitiFact's Kickstarter to live fact-check the 2015 State of the Union and GOP response.", "NBC, Meet the Press, Jan. 4, 2014", "U.S. Energy Information Administration, global oil production database, accessed Jan. 4, 2014", "U.S. Energy Information Administration, \"North America leads the world in production of shale gas,\" Oct. 23, 2013", "U.S. Energy Information Administration, \"U.S. expected to be largest producer of petroleum and natural gas hydrocarbons in 2013,\" Oct. 4, 2013", "U.S. Energy Information Administration, \"Despite lower crude oil prices, U.S. crude oil production expected to grow in 2015,\" Jan. 2, 2015", "Bloomberg News, \"U.S. Seen as Biggest Oil Producer After Overtaking Saudi Arabia,\" July 4, 2014", "Reuters, \"U.S. surges past Saudis to become world's top oil supplier - PIRA,\" Oct. 15, 2013", "Email interview, Klobuchar spokesman Rob Friedlander, Jan. 4, 2014", "Email interview, Leonardo Maugeri, associate at Harvard’s Geopolitics of Energy project, Jan. 4, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]