["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Vice President Mike Pence hands the electoral certificate from the state of Arizona to Sen. Amy Klobuchar, D-Minn., as he presides over a joint session of Congress as it convenes to count the Electoral College votes on Jan. 6, 2021. (AP)", "Federal law already requires citizenship to vote in elections and H.R. 1 would not change that policy.", "H.R. 1 says that the goal is to expand voter registration for eligible citizens.", "The legislation would step up the role of government agencies to forward individuals’ information for voter registration, but only citizens will be allowed to register.", "Former Vice President Mike Pence attacked the Democrats’ bill to expand voting rights in a recent op-ed, saying H.R. 1 would open the door to more votes cast by people who live in the U.S. without permission.", "Pence wrote that he shared concerns about the \"integrity of the 2020 election\" — although dozens of courts have upheld the results for President Joe Biden, without finding evidence of voter fraud. He lamented that Democrats in Congress were seeking to brazenly \"nationalize\" elections with H.R. 1, which passed the House March 3.", "\"The bill would force states to adopt universal mail-in ballots, early voting, same-day voter registration, online voter registration, and automatic voter registration for any individual listed in state and federal government databases, such as the Department of Motor Vehicles and welfare offices, ensuring duplicate registrations and that millions of illegal immigrants are quickly registered to vote,\" he wrote in The Daily Signal, a publication of the conservative Heritage Foundation where Pence is a fellow.", "In this fact-check, we wanted to review Pence’s statement that H.R. 1 would result in registering millions of immigrants who are in the country illegally or other ineligible noncitizens. (We rated his claim about \"universal mail-in ballots\" False.)", "Our reporting found that Pence used flawed logic to make his claim, and he ignored steps offered in H.R. 1 to ensure legal registrations by eligible citizens.", "Voters would continue to attest to their eligibility, including citizenship, when they register to vote. The penalties for a noncitizen who votes or registers to vote can include deportation, incarceration or fines.", "\"This is the law in the United States and in every state, and H.R. 1 does nothing to alter that,\" said David Becker, executive director of the Center for Election Innovation & Research executive director and founder. \"These laws have been very successful in minimizing noncitizens on the lists, and ensuring that only eligible citizens are registered and voting.\"", "H.R. 1 does not change federal law, which states that only eligible citizens can vote in federal elections. The goal of the legislation is to make it easier for eligible citizens to register.", "While some noncitizens have ended up on voter registration lists, often in error, voting by noncitizens is statistically rare. For example, Pennsylvania officials a few years ago said they found potentially 544 ballots cast by noncitizens in elections dating back to 2000 — out of 93 million ballots cast. That worked out to about 1 out of every 172,000 ballots.", "When we contacted the Heritage Foundation to ask for Pence’s evidence, a spokesperson pointed to provisions about automatic voter registration in the bill. They said that under H.R. 1, government agencies would forward information about people who wanted to register to election officials without knowing their citizenship status. But experts on election law dismissed Pence’s warning that \"millions\" of ineligible immigrants would be immediately added to the voter rolls.", "\"Nothing in H.R. 1’s provisions results in undocumented immigrants being ‘quickly registered to vote,’\" said Matthew Weil, an election expert at the Bipartisan Policy Center.", "Under the bill, a person interacting with a government office — such as the motor-vehicles department or public-assistance agency — would have their information forwarded to election officials for registration purposes unless they \"opt out.\" Some states already offer the opt-out process for voter registration, and others require applicants to opt in.", "This section of H.R. 1 explicitly states that the purpose is to enable governments \"to register all eligible citizens to vote.\"", "It goes on to say that government offices are to share voter-registration information only with eligible citizens. If the agency doesn’t know a person’s citizenship status, it would would direct them to a registration form where they would attest to their citizenship, as required by the National Voter Registration Act.", "It’s still up to a local election agency to determine whether the applicant is eligible to register to vote.", "Many of the government agencies that would be involved in the process already verify citizenship and would be able to filter out noncitizens, said Danielle Lang, a voting expert at the Campaign Legal Center.", "\"All of these voter registration options are already available in many states — both red and blue — and there is no evidence that they lead to significant numbers of noncitizens becoming registered to vote,\" Lang said.", "The Heritage Foundation spokesperson pointed to another provision in H.R. 1, which states that ineligible immigrants who are registered in error can’t be prosecuted or face adverse consequences related to their immigration status. But a person could still face prosecution if they lied during registration about their citizenship status, Lang said.", "Pence said H.R. 1 would mean \"that millions of illegal immigrants are quickly registered to vote.\"", "The bill does not permit voting by noncitizens in U.S. elections, whether they’re in the country legally or not. Pence was referring to a provision that would require automatic voter registration for people using services at government agencies. But that section says government agencies would pass along a person’s information for voter registration only if they are citizens. People would still be attesting that they are eligible to vote, with penalties for lying, and it would still be up to election officials to verify eligibility.", "The goal of the bill is to register eligible citizens. Pence’s warning that \"millions\" of ineligible noncitizens would be quickly added to the rolls is unsupported. We rate this statement False.", "PolitiFact senior correspondent Louis Jacobson contributed to this report.", "RELATED: Mike Pence is wrong that HR 1 forces states to shift to universal mail balloting", "RELATED: Trump misleads about HR 1 and voter registration for welfare recipients", "RELATED: Do states verify citizenship of voters in federal elections?", "RELATED: No, House Democrats did not vote to allow noncitizens to vote as part of HR 1", "Mike Pence, \"Election Integrity Is a National Imperative\" (op-ed in the Daily Signal), Mar. 3, 2021", "Congress.gov, H.R.1 - For the People Act of 2021, Introduced Jan. 4, 2021", "NPR, Some Noncitizens Do Wind Up Registered To Vote, But Usually Not On Purpose, Feb. 26, 2019", "AP, Pennsylvania finds 544 possibly illegal ballots since 2000, Oct. 25, 2017", "CNN, Fact check: Pence echoes Trump's Big Lie in dishonest op-ed on election rules, March 3, 2021", "Los Angeles Times, Layered on top of previous mistakes, California’s DMV finds an additional 1,500 people wrongly registered to vote under new system, Oct. 8, 2018", "Bipartisan Policy Center, Can H.R. 1 Improve Voter Registration? March 2, 2021", "Campaign Legal Center, The Bipartisan Origins & Impact of the For the People Act (H.R. 1/S. 1) Jan. 25, 2021", "Campaign Legal Center, For a More Accessible, Transparent and Responsive Government, CLC’s Trevor Potter Encourages Congress to Pass the \"For the People Act,\" Jan. 4, 2021", "Campaign Legal Center, How H.R. 1 Will Help Us Achieve a Government for the People, Jan. 4, 2021", "Brennan Center for Justice at NYU, Annotated Guide to the For the People Act of 2021, Jan. 20, 2021", "R Street, A Primer on H.R. 1, the \"For the People Act of 2021\" March 1, 2021", "Heritage Foundation, Statement to PolitiFact, March 4, 2021", "Email interview, Danielle Lang, Co-Director, Voting Rights & Redistricting at the Campaign Legal Center, March 4, 2021", "Email interview, Matthew Weil, director of the elections project at the Bipartisan Policy Center, March 4, 2021", "Email interview, David J. Becker, Center for Election Innovation & Research executive director and founder, March 4, 2021", "Email interview, Dan Weiner, deputy director of the Brennan Center's Election Reform Program, March 4, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]