["The poem was published alongside a photo of two masked women on Facebook here on April 4. The post has been shared more than 2,000 times.", "The post’s caption reads: “Timeless! History repeats itself. Came across this poem written in 1869, reprinted during 1919 Pandemic. It was written in 1869 by Kathleen O’Mara:”.", "The full poem, which is included in the caption, lists activities people can carry out at home during times of isolation. The post’s caption ends by reiterating that the poem was “reprinted during the Spanish flu pandemic, 1919”.", "Below is a screenshot of the misleading post:", "The poem was also shared alongside a similar claim here, here, here and here on Facebook; as well as here on Twitter.", "The posts circulated online as the world continued to fight the spread of the novel coronavirus, which causes the disease COVID-19. By April 2, about half the world's entire population had been called on or obliged by authorities to stay at home, AFP reported.", "But the claim about the poem's origin is false.", "A keyword search found it was in fact published on a blog here on March 16, 2020 by Catherine M. O’Meara, a retired teacher in the US. It is entitled “In the Time of Pandemic”.", "The website notes that “Copyright of all visual and written materials on The Daily Round belongs solely to Catherine M. O’Meara, 2011-Present.”", "In this March 30 blog post, O’Meara addressed her poem’s popularity during the ongoing coronavirus pandemic: “I have received such lovely versions of artistic collaboration with my poem, In the Time of Pandemic, and wanted to share some of this remarkable creativity and artistry with you. I so love the way artists have been inspired to augment and enhance my words with their creativity, and all for the good of us all.”", "Oprah Winfrey’s O, the Oprah Magazine interviewed O’Meara about her poem, which has been shared by self-help guru Deepak Chopra and model Bella Hadid.", "“I believe the same spirit is moving through artists and we're interpreting this suffering, and fear, and anxiety in ways that are bound to echo feelings and ideas being expressed in other ways,” O’Meara told O.", "O’Meara also uploaded various pandemic-themed poems and prose in March and April 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]