["About this rating", "In November 2018, pop ballad singing icon Celine Dion launched a children's clothing brand called Célinununu, with the aim of selling apparel designed to be gender-neutral. Many consumers likely would have never heard of the brand were it not for the National Catholic Register website's fixation with seeing demonic forces at work in marketing efforts.", "The Register interviewed a purported Catholic monsignor, John Esseff of Scranton, Pennsylvania -- who also functions as the local exorcist -- to weigh in on Dion's new unisex clothing line for a 21 November 2018 article headlined \"Exorcist Warns About Celine Dion’s Occult Children’s Clothing.\"", "In that article, Esseff was quoting as saying, \"The devil is going after children by confusing gender. When a child is born, what is the first things we say about that child? It’s a boy, or it’s a girl. That is the most natural thing in the world to say. But to say that there is no difference is satanic.\"", "That article, and others which were subsequently aggregated from it, were based on some rather far-fetched opinions. None of the clothes in the Célinununu line incorporates demonic imagery. Many feature large plus-signs that resemble the cross on the Swiss flag, some are emblazoned with stars, others bear skulls, while still others carry the phrase \"New Order.\"", "When asked about criticism of the new clothing line, Dion told women's lifestyle webiste Refinery29, \"Anytime you introduce change, you're going to get a bit of pushback — this is normal. We're also getting a lot of great feedback from people who understand that I’m not trying to tell parents how to raise their children. Every parent should do what they feel is right for them and for their children. We’re just offering other choices and letting them know that you don’t have to follow stereotypes.\"", "A collaborative effort between Dion and clothing brand Nununu, Célinununu's website offers a description for their vision of its aesthetic and makes no mention of the occult, stating that \"fashion has the power to shape people’s minds, inspire your children to be free and find their own individuality through clothes.\"", "In its reporting on the controversy, Yahoo! Lifestyle noted that \"Instead of sending some demonic secret message, it appears Dion’s new line just favors minimalism in both shapes and colors. With their simple designs, the clothes are black and white. If anything, Dion is encouraging our children to be goth.\"", "The conspiracy-minded became fixated with shirts bearing the phrase \"New Order,\" apparently confusing it with the popular \"New World Order\" conspiracy theory which asserts that a secret cabal of elites rules the world. The reference for the phrase on the clothes is unclear, but \"New Order\" is the name of an English rock band that became popular in alternative music scenes in the 1980s.", "Locating exorcists to talk about various social topics they find disagreeable is not a new practice for the National Catholic Register. In March 2019, readers inquired about their reportage revealing the purported demonic threat posed by various items being sold through the website of big box retailer Walmart.", "Armstrong, Patti.   \"Exorcist Warns About Celine Dion’s Occult Children’s Clothing.\"\r\n    National Catholic Register.   21 November 2019.", "Gutierrez, Lisa.   \"Exorcist Priest Warns of Celine Dion’s Clothing Line for Dids: ‘Definitely Satanic.'\"\r\n    The [Raleigh] News & Observer.   28 November 2018.", "Peoples, Landon.   \"Céline Dion Explains Why Her Next Move Is a Kids' Clothing Line.\"\r\n    Refinery29.   7 December 2018.", "Schreiber, Hope.   \"Some, Including an Exorcist, Are Convinced Celine Dion's New Children's Clothing Line Is 'Demonic.'\"\r\n    Yahoo! Lifestyle.   25 November 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]