["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Amidst the debate about the Trump administration's response to the COVID-19 coronavirus disease pandemic that began in early 2020, which many critics contended was too slow because the president initially failed to acknowledge the severity of the issue, social media users circulated a meme that supposedly documented a marked contradiction in the U.S. president's statements on the issue across time:", "According to this meme, as late as March 9, 2020, Donald Trump was still criticizing the press for supposedly \"inflam[ing] the CoronaVirus situation\" and quoting the U.S. surgeon general as asserting that, \"The risk is low to the average American.\" Yet a mere eight days later, according to the meme, Trump claimed he \"felt it was a pandemic long before it was called a pandemic.\"", "However observers might choose to interpret them, both of these statements are accurately dated and attributed to Trump in the meme. Trump tweeted the first statement on March 9:", "The latter was a statement Trump made during a Coronavirus Task Force press briefing from the White House on March 17. As can be seen in the following video (at the 1:05:00 mark), as Trump fielded a question from a reporter about whether his \"tone\" on the pandemic had suddenly changed the previous day, he declared, \"This is a pandemic. I felt it was a pandemic long before it was called a pandemic. All you had to do is look at other countries; I think now it's in almost 120 countries all over the world. No, I've always viewed it as very serious. There was no difference yesterday from days before\":", "The New York Times chronicled this statement from Trump and contrasted it with others he had made in the weeks leading up to it:", "For weeks, President Trump has minimized the coronavirus, mocked concern about it and treated the risk from it cavalierly. On [March 17] he took to the White House lectern and made a remarkable assertion: He knew it was a pandemic all along.", "“This is a pandemic,” Mr. Trump told reporters. “I felt it was a pandemic long before it was called a pandemic.”", "This is what Mr. Trump has actually said over the past two months:", "On Jan. 22, asked by a CNBC reporter whether there were “worries about a pandemic,” the president replied: “No, not at all. We have it totally under control. It’s one person coming in from China, and we have it under control. It’s going to be just fine.”", "On Feb. 26, at a White House news conference, commenting on the country’s first reported cases: “We’re going to be pretty soon at only five people. And we could be at just one or two people over the next short period of time. So we’ve had very good luck.”", "On Feb. 27, at a White House meeting: “It’s going to disappear. One day — it’s like a miracle — it will disappear.”", "On March 7, standing next to President Jair Bolsonaro of Brazil at Mar-a-Lago, his club in Palm Beach, Fla., when asked if he was concerned that the virus was spreading closer to Washington: “No, I’m not concerned at all. No, I’m not. No, we’ve done a great job.” (At least three members of the Brazilian delegation and one Trump donor at Mar-a-Lago that weekend later tested positive for the virus.)", "On March 16, in the White House briefing room, warning that the outbreak would “wash” away this summer: “So it could be right in that period of time where it, I say, wash — it washes through. Other people don’t like that term. But where it washes through.”", "But his assertion ... that he had long seen the pandemic coming was the most abrupt pivot yet from the voluminous number of claims and caustic remarks he has made about the disease.", "Rogers, Katie.   \"Trump Now Claims He Always Knew the Coronavirus Would Be a Pandemic.\"\r\n    The New York Times.   17 March 20.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]