["On November 12, BJP MP Satya Pal Singh posted an image of US Vice President-elect Kamal Harris in a saree and later deleted it. He wrote, “America’s Vice President-elect Kamala Harris, the one who learnt about mother India’s heritage from her mother. This seven-year-old image of her at a Ganesh temple in Chennai speaks a lot.” The tweet’s archive can be viewed here. As of writing this report, we found one instance each on Twitter and Facebook where the image was shared with the same claim.", "(Translated from अपनी माँ से माँ-भारती की संस्कृति सीखने वाली अमेरिका की मा.उपराष्ट्रपति बनने वाली श्रीमती कमला हैरिस ने 7 वर्ष पहले जब चेन्नई में गणेश मंदिर के दर्शन किये- तब की तस्वीर जो बहुत कुछ बयां करती है)", "On November 8, Principal Secy & CEO TN Tea Federation Supriya Sahu tweeted this image and wrote, “Kamala Harris. You are a trailblazer. Celebrations galore.” (archived link)", "வாழ்த்துக்கள் 🙏🌹💪 Kamala Harris. You are a trailblazer Celebrations galore. 😊#KamalaHarris @KamalaHarris #AmericaDecides pic.twitter.com/1ee8XdcWRp", "— Supriya Sahu IAS (@supriyasahuias) November 8, 2020", "Alt News performed a reverse image on Google and came across an identical image that shows a different woman wearing the same saree. It was posted in 2017 by Fashion Lady, a lifestyle website, in an article about various types of saree drapes. In 2018, the image was also published by Bollywood Shaadis. As per the articles, the image shows Madisaru style, a traditional saree drape prevalent in Chennai, where lower half is draped like a dhoti while the upper half looks like a saree.", "The image below compares the viral image and the photo published on Fashion Lady. Kamala Harris’s face has been morphed into the original image.", "The picture used for the photoshop was picked up from an article in The New York Times.", "As per her website in the Senate, Harris has African-American and South Asian-American heritage. Her mother, Shyamala is an Indian-American immigrant, activist, and breast cancer researcher. As per The Hindu, Harris’s maternal family has roots in Chennai.", "Thus an image from an Indian lifestyle website was morphed to portray US Vice President-elect Kamala Harris in a blue saree. On November 12, BJP MP Satya Pal Singh posted the image and falsely claimed that it is a seven-year-old image from a Ganesh Temple in Chennai. Singh deleted the post after it gained over 200 likes.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]