["By Brooks Jackson", "Posted on June 9, 2016", "Political attack ads all too often try to spin an opponent’s jaywalking tickets into felonies. As an example, consider Virginia Rep. Randy Forbes’ claim that his GOP primary opponent, Scott Taylor, “violated federal election law 19 times.”", "The claim results from overreaching by opposition researchers. The fact is, the Federal Election Commission has cited Taylor’s 2010 campaign committee for one and only one violation, for which the fine was $0.", "The other 18 “violations” were actually automatic “request for additional information” notices that the FEC staff continued to send to the defunct Taylor campaign committee for years, seeking additional reports and saying that the campaign “may” be violating reporting requirements. But the FEC finally decided in 2015 to let the matter drop without initiating any further enforcement action.", "The Forbes campaign has repeated this claim of 19 “violations” again and again. It appears on a Forbes website devoted to attacking Taylor as a “rule breaker” who isn’t fit for office. And it appeared in a companion TV spot that first aired last month.", "Where does the Forbes campaign come up with the other 18 “violations?” Here’s what really happened:", "In 2010, Taylor — a former Navy Seal sniper and a member of the Virginia House of Delegates — ran and lost a bid for the GOP nomination for Virginia’s 2nd Congressional District U.S. House seat.  Afterward, the campaign filed a routine financial report with the FEC showing that it had raised a total of nearly $42,000, had no outstanding debts or bills, and still had a little over $21,000 in the bank.", "But the next quarterly report deadline came and passed with no other report from Taylor. Even an inactive committee of a defeated candidate must continue to report what they do with any leftover money, so the FEC found “reason to believe” that Taylor’s committee (and several others) had violated reporting requirements. For Taylor’s committee, the FEC staff proposed an administrative fine of $990. The Taylor campaign was asked to respond.", "That matter was resolved a few months later, after the Taylor campaign filed a tardy “termination” report stating that it hadn’t raised or spent any money since the previous report. The FEC sent a letter, dated April 29, 2011, stating a “final determination” that the campaign committee (but not Taylor himself, technically) and the committee’s treasurer had violated the reporting requirements of the federal campaign law. The commissioners voted to close the file without assessing any fine.", "Unfortunately for Taylor, his “termination” report showed that the campaign had a cash balance of $34,281.72, which had somehow increased from the $21,127.64 cash balance shown on the previous report, even though no new donations or expenditures were noted.", "Whatever the amount of leftover cash, campaign committees can’t properly be terminated until accounts are zeroed out. So an FEC analyst sent the campaign a letter stating, “it appears that you have not yet met the requirements for terminating your committee,” and adding that the campaign “must submit a statement explaining how it plans to dispose of residual funds.”", "Taylor’s campaign didn’t respond. And for years thereafter, like clockwork every three months, the FEC staff sent “RFAI Failure to File” notices. In the FEC’s bureaucratese, “RFAI” stands for “Request for Additional Information.” The FEC states that an RFAI “affords the committee/filer an opportunity to correct or clarify the public record, if necessary.”", "So these are not official findings of a violation, which only the FEC commissioners themselves may make after formal proceedings. The staff-generated notices said “you may have failed to file” a required report, which “may” result in penalties. We stress, “may.”", "Why didn’t the Taylor campaign respond and clear up the matter? When we asked the current campaign manager Scott Weldon about this, he said the FEC kept sending its notices to a mailbox that the 2010 campaign ceased using after filing its “termination.” That’s plausible. The address was 2100 Mediterranean Avenue #247, and that was the address of a “Mail Depot” location, where mailboxes could be rented.", "The FEC finally gave up a year ago. On June 11, 2015, an FEC staffer sent a letter to the old Taylor campaign treasurer stating that “the Commission intends to administratively terminate your committee.” The letter added, “As such, your committee is no longer obligated to file reports.”", "We’ll note briefly here that this is only one example of “opposition overreach” by the Forbes campaign.", "Virginia voters go to the polls June 14. Forbes has represented the neighboring 4th Congressional District since 2001, but is switching districts to run in the 2nd District this year because a court-ordered change in his old district made it more competitive for a Democrat. The 2nd Congressional District incumbent Rep. Scott Rigell, who beat Taylor in the 2010 primary and went on to win the general election, is retiring after three terms in office.", "https://www.sharethefacts.co/share/825f4f63-4605-4192-b2f0-8f8998082002", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]