["“This incident happened in Bengaluru. The hapless female looks absolutely pathetic !!! Where is our country going?! When will the police act to make the women on the road to feel safe and protect them !!!!Spread this msg in the whole country. This is the least we can do.” This message is doing rounds on social media. The attached video shows a teary eyed woman recounting her ordeal of being harassed by a motorist on the road.", "This incident happened in Bengaluru. The hapless female looks absolutely pathetic !!!😰Where is our country going ?!When will the police act to make the women on the road to feel safe and protect them !!!!Spread this msg in the whole country. This is the least we can do. 👇👇 pic.twitter.com/R99RKzPkzK", "— RR Prakash Babu (@rr_prakash) May 7, 2018", "The video and the message is now viral on Facebook, WhatsApp and Twitter and has been shared thousands of times.", "In the video, the lady mentions a vehicle license plate number- WNC 618 and the make of the car – BMW, that was following her. Using the key words ‘BMW WNC 618’ on Google, we came across a Facebook post by a Malaysian entertainment portal, of March 2018. In the comments section of the post, a police statement with regard to the incident was posted. In the video, the lady also mentions an emergency number, 999. We looked up all countries where this emergency number has been deployed and Malaysia is one of them. Based on these clues, it emerged that the incident had taken place in March in Kuala Lumpur, Malaysia in March 2018.", "Kogee Sinniah, the lady in the video took to social media to highlight police inaction after the harassment she faced by a motorist. Sinniah uploaded the video on Facebook and it went viral in Malaysia. Her original Facebook post is embedded below.", "The country’s we live in…", "(This happened in Alam Damai Police Station – Cheras, Malaysia ) case is being investigated by Police and waiting for Legal Department to take Action. Today’s Date : 07/05/18 – perhaps waiting for after election day.", "Posted by Kogee Sinniah on Monday, 12 March 2018", "Sinniah posted the video on her Facebook timeline with a status, “The country’s we live in…(This happened in Alam Damai Police Station – Cheras, Malaysia ) case is being investigated by Police and waiting for Legal Department to take Action.” You can read about the incident in a local Malaysian paper, The Sun Daily.", "In a subsequent police action, three men were arrested and the police had issued a statement.", "With Karnataka elections around the corner, a group of people seem to be scanning the internet for incidents of violence and harassment in other countries so they can pass them off as examples of lawlessness in Karnataka. The objective of such fake news cropping up close to election time is clearly to build public opinion against the Karnataka government. The sheer amount of fake news being circulated before the Karnataka assembly elections is mind-boggling. Social media users have to be cautious before believing the content they come across at times like this.", "Donate Now", "Follow @free_thinker", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]