["“Deep in the heart of Delaware, Joe Biden sits in his basement. Alone. Hiding. Diminished,” says a narrator in the ad, which was tweeted by the Trump campaign’s official account on August 5, 2020.", "The same ad was also posted on Trump’s official Facebook page.", "Trump’s campaign has repeatedly accused Biden -- who has limited his public appearances during the deadly coronavirus pandemic -- of “hiding.” The US president has meanwhile campaigned from the White House, and held a controversial rally in June.", "In the ad, the words “Alone” and “Hiding” appear on a photo that seems to show an isolated Biden sitting on the floor.", "But it has been darkened, and it has been cropped to exclude the group of people who appeared in the original, which was shot by Liz Martin for The Gazette in December 2019. The Iowa newspaper said the image was used without its permission.", "The word “Diminished” then appears on another image of Biden, which seems to show him indoors with a hand raised to his forehead.", "But the outdoors background in the original -- shot by Mark Peterson for an October 2019 POLITICO article -- has been removed, as has the microphone Biden was holding.", "AFP Fact check has previously debunked misleadingly edited videos that Trump has spread of Biden and former Democratic presidential candidate Tom Steyer.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]