["The World Economic Forum’s Africa meeting, gathering political and business leaders from around the continent, took place in Cape Town on September 4-9 just as a wave of violence targeting immigrants shook South Africa.", "As reported by AFP, Nigeria did boycott the WEF over the unrest, which included attacks on numerous Nigerian-owned shops in Johannesburg.", "That announcement came a day after widely-shared reports claimed that Rwanda’s President Paul Kagame, DR Congo’s Felix Tshisekedi and Malawi’s Peter Mutharika were boycotting the major event in protest at the attacks.", "This tweet by Zimbabwean television host Josey Mahachie, reporting that the three leaders had “withdrawn” from the event, was retweeted nearly 7,000 times after it was posted at the height of the unrest on September 3:", "Many articles on Nigerian news websites similarly reported that the presidents had pulled out of the event, making an explicit link with the anti-immigrant violence in South Africa.", "“This is coming following the xenophobic attacks launched by South Africans against foreigners, especially Nigerians,” reported this article by Information Nigeria, which was shared more than 1,800 times on Facebook and quoted Mahachie’s tweet.", "The claim was also reported by numerous videos on YouTube, including one by CGTN Africa, archived here, which is captioned: “Rwanda, Malawi, DRC pull out in WEF in light of xenophobic attacks”. Nothing in the video supports the claim made in the caption, however.", "Another video, archived here and viewed more than 100,000 times, is captioned “South Africa Embarrassment for Africa as Presidents & Celebrities Boycott Events”. It goes on to state that the three presidents were boycotting the WEF following “senseless xenophobic attacks”.", "The boycott claim was reported widely across the continent, including by Kenyan newspaper The Star and Tanzanian newspaper The Citizen.", "There were however no official confirmations of such a boycott by any of the three governments involved -- which might seem surprising had it been true, as you would expect officials to publicise such a protest.", "Rwandan and South African governments debunk the claims", "Regarding Kagame’s attendance, both the South African and Rwandan governments rejected the claim that his non-appearance was linked to the unrest.", "“We are refuting these allegations. We knew that Rwanda was not coming. In their correspondence‚ they did not mention xenophobic attacks as the reason for not coming,” said Lunga Ngqengelele, spokesman of the South African department of international relations and co-operation, as quoted by The Times.", "Kagame’s communications advisor Yolande Makolo tweeted: “Not true, Rwanda has not withdrawn. President Kagame was unable to attend for other reasons, but there is a strong Rwandan delegation participating at the World Economic Forum-Africa in Cape Town, including three cabinet members,” she said.", "As for Tshisekedi’s attendance, Ngqengelele said: “There was never an indication from the DRC that they were coming.”", "WEF also denied a boycott by the three presidents", "Officials from the World Economic Forum confirmed that Kagame and Mutharika had said they would not be attending before the xenophobic attacks began on September 1, and that there had been no word from the government of DR Congo.", "In an interview with South Africa’s Radio 702, Oliver Cann, head of communications at WEF, said: “We were made aware on Saturday (August 31) that President Kagame of Rwanda was unable to join us and the notification was made to us in the previous week that president of Malawi was unable to join us.”", "As for the government of DR Congo, Cann said:  “We have not had actual communications with them for a few days. We assume that they are not joining us now, because we have not heard from them.” There had in any case been no communication from DR Congo’s government saying that Tshisekedi was boycotting the event over xenophobic unrest.", "The absence of the three leaders was “not a knee jerk reaction to events in South Africa”, Cann stressed.", "WEF’s Africa chief Elsie Kanza said she was surprised to see the reports, telling South African TV station eNCA that “one of the leaders -- Rwanda -- unfortunately had to cancel his participation last week, before the very unfortunate events”.", "After reports of the boycott began circulating on September 3, many Nigerians began calling on the president of Nigeria to follow suit -- via this widely-shared tweet, for example.", "Nigeria’s President Muhammadu Buhari had not been billed to attend, but Vice-President Yemi Osinbajo had been due to speak at the forum.", "As diplomatic tensions between Africa’s two superpowers rose over the attacks, Nigerian presidential media aide Bashir Ahmad confirmed that the government would not attend.", "Yes sir, Nigerian government has boycotted the World Economic Forum holding in Cape Town, South Africa, but some individuals from Nigeria including a former Minister are attending on their own. https://t.co/txMvLee3L3", "As reported by AFP, the unrest has claimed 12 lives since the start of September, while also sparking reprisal attacks against South African-owned businesses in Nigeria.", "The violence prompted a wave of misleading social media posts, some of which we’ve fact-checked here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]