["The image was published in this Facebook post on September 26, 2019. It shows a woman covering her face with her hands in a meeting, surrounded by men clapping and hugging her.", "The image has been shared more than 200 times.", "Below is a screenshot of the misleading post:", "The post's Indonesian-language caption translates to English as:\n\t\"Foreign Affairs minister cries tears of joy that the UN rejects Papua referendum great.\"", "The Indonesian-language text superimposed on the image translates to English as: “THE UN REJECTS PAPUA REFERENDUM PROPOSAL.”", "“THE UN STILL SUPPORTING INDONESIA SOVEREIGNTY OVER PAPUA CLOSING THE OPPORTUNITY FOR REFERENDUM BY FIGURES AND SUPPORTERS OF THE FREE PAPUA ORGANISATION.", "“Foreign Affairs minister, Retno Marsudi, cries tears of joy when the UN says it rejects Asia-Pacific countries’ proposal on a referendum for Papua and recognizes Papua an integral part of Indonesia.”", "Retno Marsudi is Indonesia’s Foreign Affairs Minister.", "“Papua” refers to the Indonesian’s easternmost region that comprises two provinces, Papua and West Papua.", "The Free Papua Organisation, also known as OPM in Indonesian, is “an umbrella term for the pro-independence movement engaged since 1965 in a struggle for Papuan independence”, according to this report by the Institute for Policy Analysis of Conflict.", "On September 6, 2019, Benny Wenda, an exiled Papua indepedence leader, called Indonesian President Joko Widodo to hold a UN-backed independence referendum as weeks of protests and riots rocked the Papua region.", "AFP reports about the recent disturbances were published here and here.", "The same image has also appeared in other Facebook posts here and here alongside a similar claim, where it has been shared thousands of times.", "The image has also circulated on Twitter here and here with a similar claim, and YouTube here.", "The claim is false; the photo shows the Indonesian foreign minister's reaction after the UN General Assembly elected Indonesia to serve as a non-permanent member of the Security Council in 2018.", "A reverse image search on Google found this Associated Press photo published on June 8, 2018.", "Below is a screenshot of the AP photo:", "The photo's caption states: “The Indonesian delegation reacts after being voted in during the election of five non-permanent members of the Security Council, Friday, June 8, 2018 at United Nations headquarters.”", "Below is a screenshot comparison of the image in the misleading post (L) and the AP photo (R):", "AFP also reported on the election of non-permanent members on June 9, 2018, here, titled: “Germany, South Africa, Indonesia to join UN Security Council in 2019.”", "The report's first paragraph states: “The UN General Assembly elected Belgium, the Dominican Republic, Germany, Indonesia and South Africa on Friday to serve as non-permanent members on the Security Council for two years starting in January.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]