["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "No man-made entity is larger than the U.S. government, says Sen. Mark Warner.", "The Virginia Democrat made the claim last month during an interview on a radio show hosted by one of his colleagues, Sen. Angus King, I-Maine. Warner was stressing his trademark theme: that Congress needs to take a more organized and long-range approach to budgeting instead of going from crisis to crisis.", "\"I think if folks across America understood how crazy what we were doing in that the largest enterprise in the world is the federal government of the United States of America,\" he said. \"The single largest subset of that is the Defense Department. When you run that large an enterprise on three- and six-month short-term funding resolutions, you actually cost the taxpayer more money that you save because you stop and start contracts, you’re not able to hire people for a long period of time...The amount kind of lost to the taxpayer as well as what it does to our military preparedness, for example, staying on defense, is a huge, huge issue.\"", "We wondered if the U.S. government really is the biggest show on earth.", "Warner spokesman Kevin Hall sent us links to the president’s budget proposal for fiscal year 2014, which ends in September, and to news articles listing the revenue and employee figures for large corporations.", "Let’s look at employees first. According to White House figures, Uncle Sam employed the equivalent of about 4.3 million full-time workers during the 2013 budget year, which ended Sept. 30. Of them, about 1.5 million are in the military and another 800,000 are civilian workers at the Department of Defense.", "For comparison, Warner’s office sent us a list of largest worldwide employers published in 2012 by the BBC. We searched on our own for a more current list, but couldn’t find one. Here are the largest employers, behind the U.S. government:", "There’s a problem with these figures, however. They don’t offer-to-apples comparison of central government employment in the United States to that in China, the world’s most populous country.", "Although the data give us an idea of the size of China’s military and its two largest state-owned companies, experts say there is no reliable data on how many people are employed in all sectors of the Chinese government.", "Two years ago, Liu Xirong, a member of the National People’s Congress in China, cited what he said were official figures showing his nation’s bureaucracy had grown from 6 million public servants in 2006 to 10 million in 2010, according to an article in News China. In response, the State Administration of Civil Service said China’s number of public servants stood at 6.89 million in 2010.", "These figures did not include state-owned enterprises and organizations, which would grow the number to more than 30 million, News China reported.", "Barry Bosworth, a senior fellow at the Brookings Institution who studies China’s economy, said it’s reasonable to include the employees of state-run corporations in the count. But even if you don’t, logic says China’s rolls of government workers would be longer than the United States’ roster of 4.3 million employees.", "\"In the U.S., labor is expensive and we have substituted technology as shown by the large decline in clerical workers,\" he said. \"In China, technology is expensive and workers are cheap. I do not know of any fully comparable data. I would be quite confident that on most comparisons, China's workforce would be larger, if for no other reason than the size of its army and security forces.\"", "In addition to number of employees, Warner’s office also told us it defines \"largest enterprise\" by the money an organization takes in and spends. We were pointed to the latest information in the CIA’s World Factbook. It shows the U.S. in 2012 -- with $2.5 trillion in revenues and $3.5 trillion in expenses -- topped all nations in both categories. China, by comparison, collected $1.9 trillion in and spent $2 trillion. Those figures don’t include revenues for China’s state-run corporations which, if added up, would easily exceed the U.S. government’s cash flow.", "The United States’ budget figures dwarf the finances of the largest corporations in the world.", "According to CNNMoney’s list,  Royal Dutch Shell had the largest revenues last year -- $482 billion. It was followed by WalMart, $469 billion; Exxon Mobil, $450 billion; Sinopec Group, $428 billion; and China National Petroleum, $409 billion.", "Our ruling", "Warner said the U.S government is the largest enterprise in the world. His staff said the statement was based on the federal government’s employment and budget.", "The claim runs aground in China. Warner’s office cites statistics that compare the employment of the U.S. government to parts of the Chinese government, but not the whole. China has issued conflicting numbers on its total number of civil servants, but they all greatly exceed the number of workers paid by the U.S. government.", "Warner is on better footing on the budgeting side of his claim. A variety of widely used statistics shows no government or corporation raises and spends more money than the U.S.", "So Warner is wrong on one of measurements and right on the other. We’ll split the difference and rate his statement Half True.", "Angus King, \"December’s Inside Maine on WGAN with Senator Mark Warner, part 1,\" quote at about 2:20, Dec. 16, 2013.", "Emails from Kevin Hall, Warner spokesman, Dec. 27, 2013, and Jan. 6, 2014.", "The White House, Fiscal Year 2014 proposal \"Performance and Management,\" (number of employees).", "BBC, \"Which is the world’s biggest employer?\" March 19, 2012.", "News China Magazine, \"Bloated Bureaucracy,\" June 2012.", "USA Today, \"The 10 largest employers in America,\" Aug. 22, 2013.", "Interview with Barry Bosworth, senior fellow at the Brookings Institution, Jan. 9, 2014.", "CIA, World Factbook, accessed Jan. 9, 2014.", "CNN Money, Global 500, 2011.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]