["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This May 5, 2019 file photo shows Microsoft co-founder Bill Gates at the annual Berkshire Hathaway shareholders meeting in Omaha, Neb. (AP)", "The £31.5 billion figure was calculated by multiplying an estimated cost per vaccine times the population of the United Kingdom. The estimated vaccine cost comes from a Daily Mail story, but we could find no other evidence to back it up.", "The Gates Foundation has pledged millions of dollars to companies developing potential coronavirus vaccines. There is no evidence that the charity stands to profit from them.", "The source of the Facebook post is a website that has published false conspiracy theories in the past.", "False claims about the Gates Foundation’s connection to the novel coronavirus know no borders.", "In a May 6 Facebook post, an alternative-health page and website called Revive Yourself claimed the philanthropic foundation of billionaires Bill and Melinda Gates stands to profit from the development of a COVID-19 vaccine in the United Kingdom.", "\"At £477 per vaccine, multiplied by 65 million people in the UK, The Bill & Melinda Gates Foundation are on course to make just under £31,500,000,000 from Great Britain alone. Let that sink in,\" the page wrote. \"And people still ask who benefits from this virus & lock down?\"", "That’s $38.4 billion in American dollars, by the way. The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The image in the post is a screenshot of a May 6 tweet from Ryan Martin, who runs Revive Yourself. The website publishes misleading claims about vaccines alongside recommendations for essential oils and supplements.", "(Screenshot from Facebook)", "We’ve fact-checked several false and misleading claims about the Gates Foundation’s connection to the coronavirus pandemic — Martin even included one of the false claims in his Facebook post. So we wanted to take a closer look at the post, which he also published on his site.", "The Gates Foundation has pledged millions of dollars to companies developing potential novel coronavirus vaccines. There is no evidence that the Gates Foundation stands to profit from these efforts. The false claim has been widely shared in conspiratorial groups on Facebook.", "The assertion that the Gates Foundation stands to make money from a potential coronavirus vaccine originated on a website with a track record of publishing misinformation.", "We reached out to Martin for evidence to back up his Facebook post and blog entry. He sent us a YouTube video from Zed Phoenix, who describes himself as an \"investigative journalist, author and broadcaster.\"", "In the video, which has more than 75,000 views, Phoenix makes the same claim about the Gates Foundation making money off a coronavirus vaccine. As evidence, Phoenix points to an article on BeforeItsNews.com, a website that has published false stories in the past. The story has been shared hundreds of times in Facebook groups for believers in conspiracies like QAnon, a broad right-wing conspiracy.", "The article claims without evidence that Gates \"reaps profits through Microsoft and his other companies\" from his philanthropic giving. The story makes several other false or misleading claims about the Gates Foundation, vaccines and the coronavirus pandemic — as does Martin’s Facebook post.", "\"The Facebook post contains a number of false claims about the Gates Foundation,\" the charity told us in an email. \"The foundation is not involved in the sale of vaccines in the United Kingdom, or anywhere else.\"", "The basis for the £31.5 billion figure in the Facebook post comes from a March 17 Daily Mail story.", "The article includes an estimated cost of £477 per injection of a coronavirus vaccine that’s being developed by Moderna Inc., a U.S. biotechnology company. The newspaper attributes the estimate simply to \"analysts.\"", "The Before It’s News story got the £31.5 billion figure by multiplying £477 times the population of the U.K., which was estimated to be around 66.4 million in June 2019.", "We could not find the cost estimate reported in other publications, or on Moderna’s website. So we reached out to the company for more information about the estimated cost of its vaccine, which entered a clinical trial in mid-March.", "We haven’t heard back, but the company told Business Insider in March that it would not \"price this higher than other respiratory-virus vaccines.\" Other pharmaceutical companies have offered similar statements.", "The Gates Foundation said in a Feb. 5 statement that it is investing up to $100 million for \"the global response to the 2019 novel coronavirus.\" That includes up to $60 million to \"accelerate the discovery, development and testing of vaccines, treatments and diagnostics for 2019-nCoV,\"  the scientific name for the novel coronavirus.", "There are 108 potential vaccines in development, according to the World Health Organization — at last eight of which are in clinical trials. The Gates Foundation is funding some of those efforts, but that doesn’t mean the philanthropy would share in future profits from a successful vaccine.", "RELATED: How close is a coronavirus vaccine?", "The Gates Foundation is a private nonprofit foundation that gets most of its money from contributions, specifically from the Gateses themselves through their family trust, according to the charity’s tax return. The trust’s most recent holdings report shows that it does not currently own stock in any of the companies that are working on coronavirus vaccines. Additionally, the Gates Foundation does not hold any patents related to the novel coronavirus.", "A Facebook post and several blog articles claim that the Gates Foundation could make more than £30 billion from a coronavirus vaccine.", "That number is based on multiplying a reported estimate of the cost of a potential COVID-19 vaccine times the population of the U.K. But the company developing the vaccine has not publicly released an estimate. And while the Gates Foundation has pledged millions of dollars to companies developing potential coronavirus vaccines, there is no evidence that it stands to profit from them.", "The Facebook post is inaccurate. We rate it False.", "Before It’s News, \"Breaking: Bill Gates Foundation and the Covid-19 Vaccine Network Scandal,\" April 20, 2020", "Bill and Melinda Gates Foundation, \"Bill & Melinda Gates Foundation Dedicates Additional Funding to the Novel Coronavirus Response,\" Feb. 5, 2020", "Bill and Melinda Gates Foundation, Form 990-PF for period ending December 2018", "Business Insider, \"A potential coronavirus vaccine funded by Bill Gates is set to begin testing in people, with the first patient expected to get it today,\" April 6, 2020", "Business Insider, \"The CEO of the buzzy biotech that's working on a potential coronavirus vaccine just pledged he won't set a high price for the shot,\" March 4, 2020", "Business Insider, \"Experts weigh in on how much a dose of a successful coronavirus vaccine could cost,\" May 4, 2020", "CrowdTangle, accessed May 13, 2020", "The Daily Mail, \"The desperate race to make a killing from coronavirus vaccine: With an estimated final cost of £477 per injection, there are potentially billions to be made from a coronavirus jab. TOM LEONARD examines the ethical minefield as experts search for the answer,\" March 17, 2020", "Email from the Gates Foundation, May 13, 2020", "Email from Ryan Martin, May 13, 2020", "Facebook post, May 6, 2020", "NewsGuard, beforeitsnews.com, accessed May 13, 2020", "PolitiFact, \"Anti-vaxxers spread conspiracy about Bill Gates and India’s polio vaccination,\" April 23, 2020", "PolitiFact, \"The Gates Foundation does not have a patent for the coronavirus,\" April 23, 2020", "PolitiFact, \"The race to create a coronavirus vaccine: A primer,\" April 6, 2020", "Revive Yourself, \"The Bill & Melinda Gates Foundation are on course to make just under £31,500,000,000 from Great Britain alone\"", "Tweet, May 6, 2020", "U.K. Office for National Statistics, Population estimates, accessed May 14, 2020’", "U.S. Securities and Exchange Commission, Bill & Melinda Gates Foundation Trust: Quarterly report filed by institutional managers, Holdings, Feb. 14, 2020", "World Health Organization, DRAFT landscape of COVID-19 candidate vaccines – 5 May 2020", "YouTube video, April 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]