["Some Revolutionary War events aren’t covered in the Broadway hit Hamilton. Lord Dunmore’s orders happen to be some of them.", "Dunmore, Virginia’s royal governor at the time of war, recently had his chance at the limelight when he was compared with Virginia's current Democratic governor, Ralph Northam, on the issue of gun control", "State Sen. Eric Burlison, R-Springfield, tweeted: \"Anyone who knows Virginia history can see the comparison with Lord Dunmore and @GovernorVA Ralph Northam. Remember, the American Revolution began when they came for the guns. #2ndAmendment\"", "Burlison tweeted this the day of a gun rally in Virginia.", "More than 22,000 people rallied outside the state Capitol on Jan. 20 in protest of gun control legislation Northam supported. Northam supported a bill that called for the ban of certain assault rifles, but it failed in the state Senate on Feb. 17. Other bills, ranging from giving local Virginian governments more ability to ban concealed carry in public places to reporting stolen guns, passed on Feb. 28.", "We reached out to Burlison’s office. His staff said that the senator did not mean to imply that Dunmore caused the Revolution, so we’re concentrating here on the sentence about guns. They also cited a History.com article as a summary of the war.", "Burlison’s tweet seems to simplify an entire revolution. So, we dusted off the history textbooks. Here’s what we found.", "This tweet was meant to call back on American history and use it as a cautionary tale — except the tale was taken out of context.", "The first battles of the Revolution were on April 19, 1775, at Lexington and Concord in Massachusetts. The town was alerted before the British arrived. Minutemen stood waiting for them — a shot rang out and the scene became violent.", "We know a few things for sure:", "Gen.Thomas Gage sent Lt. Colonel Smith to lead the British troops to Concord.", "Gage received a tip that colonial soldiers in Concord were gathering arms.", "The British troops were ordered to destroy gunpowder and arrest the colonial rebels John Hancock and Samuel Adams.", "What else were the troops after? While one said arms weren't targeted, another said that guns would've been part of the order to confiscate the armory at Concord.", "A third, University of Missouri history professor John L. Bullion, showed us the written orders. In a letter from Gage to Smith, Gage orders the destruction of guns — and ammunition, flour, tents, pork or beef, carriages and more.", "We should probably take a look at Lord Dunmore. After all, Burlison mentions him in the first half of the tweet.", "Lord Dunmore, also known as John Murray, was the last royal governor of Virginia. As tensions grew, Dunmore called for the removal of gunpowder stored in local magazines.", "Dunmore was then pressured by the hundreds of countrymen that stormed Williamsburg to either return or pay for the lost gunpowder. Dunmore ended up having to pay 330 pounds (or about $56,000 in today’s dollars).", "He became very unpopular and was chased out of his home. Dunmore and his family then had to stay on the British ship Fowley.", "However, Dunmore is probably better known for his later 1775 proclamation. It announced that a revolution was underfoot and offered freedom to enslaved people if they fought for the British.", "WIth politics, money usually becomes an issue at one point. That goes for what leads up to the revolution, too.", "Britain won the French and Indian War, but the fighting wasn’t cheap. The 1764 Currency Act said the colonies couldn’t print their own money, but what caused the biggest uproar was the Stamp Act of the next year. The tax was on all printed paper — including newspapers, legal documents and more.", "That kicked off a building frustration for colonists over taxes without representation in the British Parliament. That’s not all, though — more acts were added that taxed more products. More soldiers occupied colonists’ homes.", "And the British Parliament made clear it could make whatever laws it liked.", "Things got worse when five colonists died in the Boston Massacre.", "Soldiers were convicted of lesser crimes, but not murder. Samuel Adams created committees of correspondence to spread the news about the massacre in 1772.", "The following year, some Sons of Liberty members snuck on a tea ship in Boston Harbor. They dumped the tea overboard to protest a monopoly given to the East India Tea Company. Britain retaliated. However, colonists encouraged boycotts, and New England began preparing for war.", "In 1775, British soldiers attempted to take some ammunition but were turned away. Later, word got out to the British that the growing rebellion might be storing military supplies in Concord.", "One day after the first battles, Lord Dunmore made an order to get rid of gunpowder.", "The rest is (literally) history.", "Burlison tweeted that \"the American Revolution began when they came for the guns.\"", "His tweet was a dramatic simplification of history There were many factors at play that sparked the American Revolution. It was caused by a lack of economic freedom and representation in the government and more.", "That said, arms may have been one of many factors in the invasion of Lexington and Concord.", "We rate this statement as Half True.", "Colonial Williamsburg, \"Lord Dumore, John Murray,\" Accessed Feb. 26, 2020.", "Colonial Williamsburg, \"A summary of the 1765 Stamp Act,\" Accessed Feb. 26, 2020.", "The History Junkie, \"Gunpowder Incident,\" March 26, 2013.", "NPR, \"Virginia’s Governor Bill To Ban Assault Weapons Fails, With Help From His Own Party,\" Feb. 17, 2020", "Emails with Connecticut State University history professor Kevin R. C. Gutzman, Feb. 28, 2020.", "AP, \"AP EXCLUSIVE: Northam to ban guns from Capitol grounds,\" Jan. 14, 2020.", "The Department of State, \"The Patrick Henry Bicentennial Celebration,\" 1963.", "Library of Congress, \"The American Revolution, 1763-1783,\" Accessed Feb. 18, 2020", "Office of the Historian, \"French and Indian War/Seven Years’ War, 1754-63,\" Accessed Feb. 26, 2020.", "University of Indiana, \"American History Documents,\" Accessed Feb. 28, 2020.", "The Encyclopedia of Canada, \"Navigation Laws,\" 1948", "Library of Congress, \"Magna Carta: Muse and Mentor,\" Accessed March 1, 2020.", "Library of Congress, \"Documents from the Continental Congress and the Constitutional Convention, 1774 to 1789.\" Accessed Feb. 16, 2020.", "Email with University of Missouri history professor John L. Bullion, March 4, 2020.", "NRA, \"Virginia Gun Laws,\" March 2, 2016,", "ABC News, \"Gov. Northam-backed gun control bills pass in Virginia,\" Feb. 28, 2020.", "NBC News, \"James Alex Fields, driver in deadly car attack at Charlottesville rally, sentenced to life in prison,\" June 28, 2019.", "VACapitol2020, tweet, Jan. 20, 2020.", "Digital History, \"British General Thomas Gage.\" Accessed March 5, 2020.", "AP, \"Pro-gun rally by thousands in Virginia ends peacefully,\" Jan. 20, 2020.", "Emails with University of North Carolina at Chapel Hill history professor Kathleen Duval, March 5, 2020.", "History, \"Revolutionary War.\" Accessed Feb. 28, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]