["The video was shared in this Facebook post on May 5, 2019.", "It has been viewed more than 460,000 times and shared more than 7,000 times.", "Below is a screenshot of the video:", "The caption states: “Bella Ramsey aka Lady Mormont breaking it down. This is what the afterlife looks like, after all that damn giants milk”.", "Bella Ramsey is a British actress known for her role as Lady Lyanna Mormont in the TV series Game of Thrones.", "Some of the comments on the misleading post showed that some people believed the video was of Ramsey. The image below features four of these comments, with the users' identities redacted:", "WARNING: STRONG LANGUAGE", "The same video has also been shared elsewhere on Facebook with a similar claim, for example here and here.", "The same video was also shared here and here on YouTube with a similar claim.", "The claim is false; the video shows a young Russian dancer called Liza Petrikova.", "A reverse image search on Google for keyframes of the video found the same video posted here on Instagram by an account under the name Liza Petrikova on February 17, 2019:", "Сегодня я судила отборы на битву стилей", "A post shared by  Лиза Петрикова (@b.girl_petaira7498) on Feb 17, 2019 at 4:42am PST", "The Instagram post's Russian-language caption translates to English as: “Today I judged selection rounds for the battle of styles”.", "Below is a screenshot comparison of the video in the misleading post (L) and the video on Petrikova’s Instagram account (R):", "Other posts published on Petrikova’s Instagram account, including here and here, show her participating in various dance competitions in Russia.", "In this photo posted on January 28, 2019, Petrikova posed with comedian Maxim Galkin, who is the host of Russian television show The Best.", "@unrealdance21 @luchshe_vseh_official", "A post shared by  Лиза Петрикова (@b.girl_petaira7498) on Jan 27, 2019 at 8:34pm PST", "Petrikova’s performance on the show can be seen at the 4:20 mark in a video published here on the Channel One Russia website.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]