["About this rating", "The Kharai camel is capable of swimming relatively long distances across the sea.", "This video doesn't show camels \"crossing the sea\"; it shows a group of racing camels training for an upcoming event.", "The camel conjures up images of deserts, scorching hot temperatures, and a dangerous lack of water. So when a video purportedly showing a herd of these humped creatures swimming across a sea surfaced in April 2018, many viewers were surprised:", "Camels Crossing the Sea ? pic.twitter.com/LMuKRnd7FG", "— Nature is Scary (@TheScaryNature) April 21, 2018", "This video is real. However, it doesn't show camels \"crossing\" the sea.", "It first appeared online in February 2017, and shows a specific breed — the Kharai camel — in a body of water near the city of Jalan Bani Bu Ali in Oman (presumably the Gulf of Oman or the Arabian Sea). The Times of Oman reported that the ungulates were brought down to the water for a training session before an upcoming race:", "Hamed Al Junaibi, one of the persons that appeared in the video said, \"We moved the camels from the farm to the sea via a truck and then we took them down on the Al Suwayh beach for swimming and training, to increase their fitness and to prepare them for the camel race. The training continued for two hours.\"", "The camels in this particular video, then, weren't exactly \"crossing the sea.\" However, this swimming camel breed is known to do exactly that. The conservation group Sahjeevan says that the Kharai camel can swim up to three kilometers (a little under two miles) in search of mangroves:", "Kharai is a unique breed of camels in Kutch that can survive in both coastal and dry ecosystems. It grazes on saline trees and shrubs and is tolerant to water with high salinity. Its physical features are different from local camels as it has rounded back, long and thin legs and smaller feet. The most astonishing part, however, is its swimming capability. According to experts, the camel can swim up to three kilometres into the sea in search of mangroves, their primary food.", "The swimming camels live in the Kutch region of Gujarat, India and were recognized as a separate breed of camels by the National Bureau of Animal Genetic Resources (NBAGR) in 2015:", "Kharai camel is found in coastal part of Kachchh region of Gujarat. These camels are well adapted to both dry-land as well as costal ecosystems. They have excellent swimming capacity in sea water and graze mainly on mangrove and other saline species. Kharai camel can thrive on high saline water and tolerate high TDS.", "A video produced by Sahjeevan about the Kharai Camel has more information:", "The outstanding capability of Kharai Camel is that it can swim through sea water, and survive on land as well. It is able to adapt itself in water as well as on land and is therefore called an Eco Tonal breed. It's uniqueness is marked by its capacity to swim distances to be able to feed on mangroves. The distance of the islands from the sea shore ranges from half a kilometer to two kilometers.", "Times of Oman.   \"Video: Camels Go For a Swim in Oman.\"\r\n    5 February 2018.", "Times of India.   \"Kharai Camels to Get Protection as Endangered Species.\"\r\n    19 April 2015.", "Times of India.   \"'Swimming Camels' Get National Recognition.\"\r\n    13 January 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]