["A Facebook post, which we’ve archived here, shares the image along with a caption reading: “Bamenda prison is on fire”.", "A reverse image search of the burning building on TinEye found over 580 references to the picture - the oldest being from 2009, which helped narrow down the search for the original.", "A second reverse image search on Google, sorted by results “before 2009”, finds a 2006 collection of pictures on image stock collection site Dreamstime.", "The image used in the misleading claim and a few more are attributed to a Norwegian based photographer, Harald Tjøstheim.", "A couple of Tjøstheim’s pictures related to the fire are labeled “Tjemsland bygget at Bryne,'' referring to the A. Tjemsland AS built at Bryne -- a novelty and interior design shop in Norway.", "The Tjemsland website and articles online also confirm that a fire took place at its Bryne location in January 2006 -- as seen here and here in Norwegian local reports.", "According to the reports, damages related to the fire and water were estimated at between 20 and 25 million Norwegian kroner (approximately $2.1 - 3 million dollars) to the historical plot, with suspicions the fire may have been started by a couple of teenagers playing with fireworks.", "Tjemsland corner reopened its doors six years after the fire in March 2012.", "A close collaborator of Adolphe Lele Lafrique, Governor of the Northwest Region of Cameroon, called the Bamenda Central Prison fire claims “fake news”.", "“No that is not true, that information of a prison fire is fake news -- there is no fire in the prison,” he said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]