["“See People Standing On #RamSethu in The Middle of Th e Sea ! Absolute engineering marvel & these sickulars call it mythology, how strange!! Thanks to Dr. @Swamy39 to move SC and declaring it as a National Heritage site! Jai Shri Ram !” This message, posted along with a video on Twitter has been shared widely. The video begins with an aerial view of a spit (landform) and goes on to show hundreds of people standing on it. The claim here is that this is the Ram Setu- the iconic bridge of the epic Ramayana.", "The video has also been circulated on Facebook.", "The video with the aformentioned claim has been tweeted by Ravi Ranjan, who is a consultant with Ministry of Home Affairs (MHA) and is followed on the social media platform by Prime Minister Narendra Modi. In another tweet, Mr. Ranjan claimed that he had received this video and the message via WhatsApp. Among those who have retweeted this video include actor and BJP MP Paresh Rawal, and movie producer Priya Gupta.", "Wow ….! https://t.co/nNP1pBqgMq", "— Paresh Rawal (@SirPareshRawal) October 5, 2018", "The video is not of Ram Setu, which lies in the Palk strait between India and Sri Lanka. It is of Ponnani beach in Malappuram district of Kerala. The strip of sand jutting out into the sea where people have gathered, was formed in the aftermath of the devastating floods that ravaged the state in July 2018.", "Abhilash Visha who shot the video has posted on his Facebook account that the video was taken by him on September 15 at Ponnani in Kerala. He has clarified that the video is not of Ram Setu and acknowledged that this false message has been circulating in several states and several languages.", "The News Minute and India Times have reported that the geological formation emerged after the recent floods and has attracted scores of tourists to the beach which has compelled law enforcement authorities to be on alert over safety concerns.", "Videos and photographs are repeatedly taken out of context and shared with false and/or misleading claims on social media, at times to further an agenda. A video of a beach in Kerala was shared as that of Ram Setu, accompanied by potshots at ‘sickulars’ for calling it mythology and given credence by a public figure like Paresh Rawal.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]