["About this rating", "Border Patrol agents in El Paso took more than 700 migrants into custody overnight on 5-6 March 2019, and two of those arrested had sex offender records.", "The vast majority of the migrants were families and unaccompanied juveniles seeking asylum, not sex offenders.", "On 10 March 2019, the self-described Christian blog OneNewsNow.com reported that U.S. Border Patrol agents had apprehended \"700+ illegals, including sex offenders,\" who were \"caught in El Paso overnight.\"", "The OneNewsNow version of the story was aggregated several days after the fact from other sources, including the Associated Press, and employed loaded and dehumanizing language, such as stating that \"llegals are even abandoning toddlers -- or just carelessly leaving them behind -- in their desperate surge to penetrate the border.\" (A single unaccompanied 2-year-old child was found among one of the apprehended groups.)", "This story and others like it were based on a 6 March 2019 press release issued by U.S. Customs and Border Protection (CBP), which reported that the \"overnight\" during which roughly 700 people were apprehended was the one beginning 5 March 2019. Although the most salacious aspect of the story involves the inclusion of two convicted sex offenders among hundreds of migrants arrested, the vast majority of people taken into custody were either unaccompanied juveniles or families seeking asylum from ongoing violence in Central America's Northern Triangle:", "U.S. Border Patrol agents working in El Paso apprehended several large groups between last night and late afternoon Wednesday. These groups, like many others before, are comprised primarily of Central American families and unaccompanied juveniles.", "Agents apprehended a group of 112 illegal aliens at the border wall near downtown just after midnight. At about the same time agents working further east were processing a group of 252 aliens apprehended at the border just west of Bowie High School. Throughout the morning hours several smaller groups also arrived at multiple locations along the border in the El Paso metropolitan area. In just a few hours the total number taken into custody exceeded 500. An unaccompanied 2-year-old child was also found among one of the groups. The U. S. Border Patrol is currently working with international and domestic agencies in order to locate the parent(s).", "While dealing with this influx of illegal aliens Border Patrol Agents also arrested two convicted sex offenders attempting to enter illegally while the agents were preoccupied with the large groups. Both sex offenders were arrested in different groups attempting to enter the United States illegally evading Border Patrol agents. Both subjects had been convicted of their sex offenses and had served time in jail before being deported from the United States.", "To learn more about the incident in question we spoke to supervisory Border Patrol agent in public affairs Joe Romero. Romero, who works the El Paso sector where the arrests took place, told us that as of this writing agents in the El Paso sector were averaging 580 apprehensions daily. Most of the migrants had been turning themselves in voluntarily and then asking for asylum.", "\"The vast majority of the people we're apprehending right now, 90 percent of them are actually turning themselves in -- walking up to the wall we have in the urban area in downtown El Paso and waiting for agents to make contact with them,\" Romero told us. \"At least 90 percent are not trying to evade [the Border Patrol]. Almost all the individuals we apprehend who are coming from the Northern Triangle area [Guatemala, Honduras and El Salvador], if not all, are requesting asylum.\"", "Romero said a major change in the type of foot traffic that Border Patrol encounters in El Paso in the last year or so has been an increased number of large groups of families and children crossing the border. When there are those with the intent to slip by agents, they attempt do so while agents are preoccupied dealing with larger groups. According to the press release, the two with sex offender convictions and a \"self-proclaimed prison gang member\" with a warrant out for his arrest did just that, but were arrested anyway.", "Border Patrol statistics show El Paso experienced a 1,689 percent fiscal year-to-date increase in the apprehension of family units in February 2018 versus the same time period in 2019, along with a 296 percent increase in apprehensions of unaccompanied minors. Although arrests at all Southwest border sectors have been on a general decline for about two decades, dealing with families and children fleeing violence in the Northern Triangle has presented a new challenge to U.S. Border Patrol agents, who have to be taken off the line to deal with the needs of family units (such as transportation for medical care and food), Romero said.", "The OneNewsNow story was shared by a large number of social media accounts pushing the commentary that it proved an emergent need for the construction of a wall along the entire 2,000-mile length of the U.S.-Mexico border, an issue that created a political squabble between President Donald Trump and Democratic lawmakers which resulted in the longest partial shutdown of the federal government in U.S. history:", "U.S. Customs and Border Protection.   \"More Than 700 Taken Into Custody by El Paso Border Patrol Agents Overnight; Two Previously Removed Sex Offenders Also Nabbed During Influx.\"\r\n    6 March 2019.", "Associated Press.   \"Border Patrol: More Than 700 Migrants Detained at El Paso.\"\r\n    6 March 2019.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]