["On February 22, a Delhi Sessions Court granted bail to 22-year-old climate activist Disha Ravi subject to two sureties of Rs 1 lakh each. She had been in judicial custody since February 14 for ‘editing’ a toolkit supporting farmers’ protest. Swedish environmental activist Greta Thunberg was among those who had shared the toolkit and ASG SV Raju, appearing for the Delhi police, argued that the toolkit suggests a ‘foreign conspiracy’ against India and is linked to the violence that took place in Delhi on Republic Day.", "ASG, as reported by Bar & Bench, had said in court just days before Ravi’s release, “A separatist flag was put on Red Fort. Hundreds of policemen were injured.”", "On January 26, some groups among protestors who gathered for the farmers’ tractor rally veered off the course and were met with police lathi-charge and tear gas. Several demonstrators entered the Red Fort and hoisted flags on the iconic monument.", "The claim that the Khalistani flag was hoisted at the Red Fort has been circulating on social media since the violence. At the time, Alt News had debunked two videos used to claim that the protesters removed the Indian national flag and replaced it with the Khalistani flag on Red Fort. You can read our detailed reports here – 1 and 2.", "Soon after, another video of two flags raised below the Indian national flag was shared to further the same claim. The video showed a few protesters on top of the fort hoisting yellow and saffron-coloured flags below the tricolour.", "Quote-tweeting the video posted by Twitter handle @rosy_K01, actress Kangana Ranaut had said, “Chatukaar media who is reporting Khalistan flag wasn’t hoisted is lying. Beware of them”. At the time of writing this article, her tweet garnered close to 5,000 retweets. The original tweet has been marked as manipulated media by Twitter.", "Chatukaar media who is reporting Khalistan flag wasn’t hoisted is lying. Beware of them … https://t.co/KMaHgeY06I", "— Kangana Ranaut (@KanganaTeam) January 27, 2021", "Film director Vivek Agnihotri, often found amplifying misinformation on Twitter, posted the same clip and said, “This is the truth which today all kinds of Rajdeeps and Secular gang will try to whitewash. Pl don’t let that happen. Defeat India’s biggest enemies – #UrbanNaxals”. The tweet gathered close to 3,000 retweets.", "This is the truth which today all kinds of Rajdeeps and Secular gang will try to whitewash. Pl don’t let that happen. Defeat India’s biggest enemies – #UrbanNaxals pic.twitter.com/Hz74AtnnpC", "— Vivek Ranjan Agnihotri (@vivekagnihotri) January 27, 2021", "Alt News looked for high-resolution images of the incident on Getty Images and found a photograph where the text written over the flag is legible.", "YELLOW FLAG", "We have compared the yellow flag hoisted atop the Red Fort with pictures of the same flag carried during the protests. The text inscribed on the flag is ‘ਰਾਜ ਕਰੇਗਾ ਖਾਲਸਾ’ (the Khalsa shall rule).", "According to The Oxford Handbook of Sikh Studies, ‘ਰਾਜ ਖਾਲਸੇ ਕਰੇਗਾ (the Khalsa shall rule)’ is a verse introduced by the tenth Sikh guru Guru Gobind Singh. This is a popular verse commonly inscribed on religious flags of the Sikh community. It is also a part of the Ardas (prayer) recited at Gurudwaras.", "The complete verse says, “Raj karega khalsa aki rahe nu koi; khwar hoi sub milenge, bache saran jo hoi.” (The Khalsa shall rule, no enemy shall exist, frustrated ones will submit and those seeking shelter shall be protected.)", "The verse is used in popular culture. For instance, the text ‘ਰਾਜ ਕਰੇਗਾ ਖਾਲਸਾ’ inscribed on a yellow coloured flag was the profile picture of a Twitter user last active in July 2018. The same flag was posted on Facebook page ‘ਰਾਜ ਕਰੇਗਾ ਖਾਲਸਾ (The Khalsa shall rule)’. The verse has also been featured in popular Punjabi songs by Daler Mehndi and Diljit Dosanjh.", "Akali Dal leader Manjinder Singh Sirsa had shared his views on the verse three years ago – “#RajKaregaKhalsa I will say this thousand times, million times, neither the Supreme Court has banned it nor will it ever be banned.”", "#RajKaregaKhalsa “राज करेगा खालसा” मैं हज़ार बार; लाख बार कहूँगा न तो सुप्रीम कोर्ट ने ये बैन किया है और न ये कभी बैन होगा हम अरदास में बोलते है – राज करेगा खालसा; आकी रहे न कोई जिसका मतलब है सच्चे सुच्चे (खालस) लोग धरती पर राज करें और पापी (आकी) लोगों का ख़ात्मा हो। pic.twitter.com/VsPOqkIxDG", "— Manjinder Singh Sirsa (@mssirsa) June 25, 2018", "On January 31, Kangana Ranaut tweeted an article by right-wing propaganda website OpIndia which alluded that the rectangle shape of the flags deemed them Khalistan flags.", "Chacha ⁦@jack⁩ get hold on your communist minions… Every day exposing you … ha ha https://t.co/lfWHYOLpKw", "— Kangana Ranaut (@KanganaTeam) January 31, 2021", "OpIndia’s article claimed, “As can be seen, there is no consistency in the Khalistan flag, but the Nishan Sahib has always been saffron triangular flag. Whether the yellow rectangle flag without the words “Khalistan” falls under Khalistan flag or the Nishan Sahib, is anybody’s guess.”", "However, Khalistani flags seen around the world can be only identified if they have “Khalistan” inscribed on them. We contacted Amandeep Sandhu, author of ‘Panjab: Journeys Through Fault Lines’, who informed us, “There is no legitimate, universally agreed upon Khalistan flag. Some make it rectangular, some triangular. All they do is write the word Khalistan on the Sikh flag.”", "“Flags are one of the chief icons of any organised set of human beings – teams, unions, or states. Normally, flags are decided by the people who belong to these organisations or their elected or nominated members. Sometimes, they are accepted through conventions such as for a community, and even nations such as Austria, Latvia, Denmark, others,” he explained.", "OpIndia’s claim that Nishan Sahibs are always triangular and saffron doesn’t hold water.", "For instance, the shape and colour of the flag in the digital animation video ‘Nishan Sahib‘ posted below are rectangular and saffron. The part ‘Raj Karega Khalsa’ of Sikh prayers is playing in the background.", "To further ascertain if the flag can be linked with Khalistan, Alt News contacted independent journalist Sandeep Singh. He shared a video from the farmers’ protest where a man holding a yellow coloured flag inscribed with the slogan ‘Raj Karega Khalsa’. Hoshiarpur-resident Sukhwinder Singh refuted the claim that the flag represents the Khalistan flag. “We link this with the Nishan Sahib. If others want to link it with Khalistan they may. We don’t care but this is the symbol of our Khalsa,” he said.", "HISTORICAL CONTEXT", "An old watercolour painting from the 1860s shows a rectangular-shaped Nishan Sahib with a solid light inner section and a darker border along its edges at the Golden Temple in Amritsar. “The shapes of these Nishan Sahibs are more rectangular with an irregular edge. All other Nishan Sahibs including the modern banner have always had a triangular shape with straight edges,” says the website Sikh Museum curated by Sikh historian Sandeep Singh Brar. Therefore historically the Nishan Sahib were rectangle in shape.", "RECTANGLE NISHAN SAHIB POPULAR OUTSIDE INDIA", "We found that these rectangular shaped yellow coloured Nishan Sahib are prominently seen in the United States and Canada. In the month of May this year, Indian cricketer Harbhajan Singh also posted an image of a rectangular Nishan Sahib that was hoisted “beside the US flag for one month to honour the Sikh community towards the pandemic, in the city of Holyoke, USA”.", "Nishan Sahib flags in yellow colour and rectangle shape were raised at Parliament Hill by the Sikh community in Canada to celebrate Sikh Heritage Month. (1, 2, 3, 4, 5).", "Celebrated #SikhHeritageMonth on Parliament Hill yesterday. Proud to join in Sikh flag raising ceremony. #Brampton #CdnPoli #Khalsa pic.twitter.com/FPSnHeWQ2d", "— Sonia Sidhu (@SoniaLiberal) April 4, 2017", "Moreover, a search on Amazon shows that rectangular-shaped Nishan Sahibs are sold in the United Kingdom (1, 2).", "SAFFRON FLAG", "We again compared the flag unfurled on the Red Fort with another saffron flag held by a supporter of the tractor parade.", "A simple Google search reveals that the flag is the Nishan Sahib, readily available in the market. The text inscribed on the flag ‘ਡੇਗ ਤੇਗ ਫਤਿਹ, ਪੰਥ ਦੀ ਜਿੱਤ (Degh tegh fateh, Panth ki jeet)’ is also part of the Ardas, Sikh religious prayer.", "“Degh is the kettle and symbolises the means of feeding the poor. Tegh means the sword and symbolizes the power to protect the weak and the helpless. Fateh means victory. The whole couplet means that grace, power and victory have been obtained (by the Khalsa) from Guru Nanak Dev and Guru Gobind Singh. It is a very apt motto chosen by Banda Singh Bahadur as it summarises some of the cherished ideals of Sikhism,” wrote Dr H.S. Singha in his book ‘Sikh Studies‘.", "Furthermore, ‘Panth ki jeet’ literally means the victory of the community or the sect.", "The complete verse reads, “Jahaa Jahaa Khaalsaa Ji Saahib, Tahaa Tahaa Ruchhiya Riyaait, Deg Teg Fateh, Bira Ki Paij, Panth Ki Jeet, Sree Saahib Ji Sahaai Khaalse Ji Ko Bol Baaley, Bolo Ji Waheguru.”", "Its translation by Australia’s Gold Coast Sikh Council reads, “Wherever respected Khalsa is present, give your protection and grace; may the free kitchen and sword never fail; maintain the honour of your devotees; confer victory upon the Sikh people; may the respected sword always come to our assistance; may the Khalsa always get honours; Utter Waheguru (Wondrous God).”", "A video of Sikh religious flags hoisted at the Red Fort was widely shared on social media to falsely claim that Khalistan flags were raised by protestors of farm bills. Over the past month, Alt News has investigated multiple claims of Khalistani flags being hoisted on the Red Fort. However, none of these claims are true and therefore, there is no basis for ASG SV Raju to suggest the same in a court of law. All claims of Khalistani flags being raised at the Red Fort are false.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]