["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Judges Rebecca Dallet, who appeals to liberals, and Michael Screnock, who appeals to conservatives, participated in their first one-on-one debate about a month ahead of the 2018 election for Wisconsin Supreme Court. (Rick Wood/Milwaukee Journal Sentinel)", "With the Florida school shooting still fresh on many minds, the National Rifle Association became the focus of an attack in the Wisconsin Supreme Court race.", "The attack came from Milwaukee County Circuit Judge Rebecca Dallet, who is backed by liberals, against Sauk County Circuit Judge Michael Screnock,  who is supported by conservatives. It was made during their televised debate in Milwaukee on March 2, 2018, a month before the April 3, 2018 election for a 10-year term on the high court.", "Screnock chafed at criticism Dallet made about activities he engaged in before becoming a judge. Then Dallet replied with criticism of his more recent behavior, saying of Screnock:", "\"I’ll point out some things he’s done during the campaign, like vowed to uphold the platform of the NRA.\"", "Screnock did win the NRA’s endorsement.", "But did he \"vow to uphold\" the NRA’s platform?", "NRA queries candidates", "During the campaign, Screnock hasn’t said whether he believes two major gun rights cases were decided properly. Dallet said she thought the rulings — one by the U.S. Supreme Court, one by the Wisconsin Supreme Court — were made by \"activist\" justices. And while Dallet has backed tighter gun regulations, Screnock has said it isn’t up to courts to determine the best way to curb gun violence.", "The NRA, well known for fighting restrictions on the right to bear arms, describes itself as \"America’s foremost defender of Second Amendment rights.\"", "Before the Feb. 20, 2018 primary election in the Supreme Court race, the group asked Dallet, Screnock and Madison lawyer Tim Burns, who was eliminated in the primary,  to submit a statement \"stating your positions on Second Amendment issues.\"", "The letter said the NRA would use the responses in rating the candidates, and that the ratings would be communicated to NRA members. Only Screnock responded.", "NRA endorses Screnock", "To back Dallet’s attack on Screnock, her campaign cited a mailing the NRA sent to its members before the primary. The mailing, revealed by the liberal advocacy group One Wisconsin Now, urged NRA members to vote for the \"pro-Second Amendment\" Screnock, saying in part:", "\"Michael Screnock will interpret our Constitution the way our founding fathers intended and has vowed to protect your firearms freedom.\"", "So, there’s the word vowed that Dallet used.", "But that’s quoting the NRA and not Screnock himself, and it refers to firearms freedom generally, not any particular agenda.", "Now, to what Screnock actually said.", "Screnock’s response to the NRA letter", "We don’t know, of course, if Screnock had any private contacts with the NRA in connection with the campaign. What is available is his response to the NRA’s request, which Dallet and One Wisconsin Now had been calling on Screnock to release", "Nearly a week after the primary, Screnock released to the Associated Press the email he sent to the NRA in response to its request for his positions on Second Amendment issues.", "Key excerpts:", "I am a Judge, and I have served as an attorney, so I know firsthand the importance of upholding the rule of law, protecting public safety, and respecting the Constitution and the separation of powers. I also know about the dangers of legislating from the bench.\n\nJudges are not legislators, nor are we executives. Our job is to interpret and apply the law, based not on our personal or political beliefs, but by relying on statutes and the Constitution. Simply put, our job is to be arbiters of the law; not policy analysts or political activists. This of course includes the Second Amendment ….", "Having an independent judiciary comprised of justices with an unwavering commitment to upholding the rule of law, to recognizing and respecting the separation of powers, and to interpreting the Constitution as it was intended is critical to preserving and maintaining our democracy and our republic ….\n\nOn a personal note, I am a proud gun owner and enjoy carrying on our passion for the outdoors with my three adult sons.", "So, while volunteering that he is a proud gun owner, Screnock pledged to uphold the Constitution, including the Second Amendment, rather than to be a political activist.", "But he didn’t vow to take a position on policies or laws or cases that might be part of a broader NRA platform.", "In terms of the NRA’s agenda, its most recent calls for action include, while referencing the Florida school shooting, urging members to tell lawmakers to oppose new gun-control proposals, and stating opposition to proposals that would prohibit adults ages 18 to 20 from acquiring rifles and shotguns.", "Our rating", "Dallet says that during the Supreme Court campaign, Screnock \"vowed to uphold the platform of the NRA.\"", "Screnock told the NRA his job is to be an arbiter of the law, including the Second Amendment, and not a political activist. But he hasn’t gone so far as to vow to uphold any particular platform.", "We rate Dallet’s statement Half True.", "Related fact checks", "Paul Ryan: \"People have a constitutional right to have semiautomatic rifles.\" Our rating: Mostly True.", "Ron Johnson: \"Assault rifles already are banned.\" Our rating: Mostly False.", "Tammy Baldwin: 97 percent of gun owners support universal background checks.  Our rating: Our rating: Mostly True.", "Kevin Nicholson: \"There are more guns in this country than there are people.\" Our rating: Half True.", "WISN-TV, video (10:45) of Supreme Court debate, March 2, 2018", "Interview, Rebecca Dallet campaign spokeswoman Gillian Drummond, March 7, 2018", "Interview, Michael Screnock campaign spokesman Sean Lansing, March 8, 2018", "Associated Press, \"SCOWIS candidate Michael Screnock releases email to NRA that resulted in endorsement,\" Feb. 26, 2018", "Snopes, \"Did the NRA Ask Judicial Candidates for 'Position Letters' on Guns?\" Feb. 22, 2018", "One Wisconsin Now, news release, Feb. 19, 2018", "NRA Institute for Legislative Action, news release, Feb. 13, 2018", "Right Wisconsin, \"Screnock’s Entire Email To The Nra: The Left’s Al Capone’s Vault,\" Feb. 28, 2018", "Twitter, Alyssa Milano tweet, Feb. 18, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]