["About this rating", "Mount Susitna, a 4,396-foot mountain in Alaska about 33 miles northwest of Anchorage, is informally known as 'The Sleeping Lady' for its resemblance to the shape of a woman at rest:", "A photograph of The Sleeping Lady said to have been taken from a drone has been circulated via social media, an image showing the mountain to bear a much stronger resemblance to a recumbent woman when seen from overhead:", "This \"drone\" view is not a real photograph of Mount Susitna, however. It's a creation of digital artist Jean-Michel Bihorel, who posted it to his website under the title \"Winter Sleep.\"", "Bihorel verified in a Facebook post that this Sleeping Lady exists only in digital form on his computer, not in the physical world:", "The Alaska.org website offers a summary of the legend behind the 'sleeping lady' name:", "Native stories say that the lady was engaged to a man who went off to protect their village before they wed. On the day her fiancé left, she promised to wait in the exact spot where he bade farewell.", "After many nights, she fell into a deep sleep waiting for him. Word came back to the village that the men were killed. Seeing how peacefully she was sleeping, the villagers couldn't bear to wake her up, so she lay there, asleep and waiting for her love to return.", "However, a 2003 article published in the Anchorage Chronicle asserted that the common backstory behind the mountains's name was of modern origin and did not derive, as often claimed, from native lore:", "Mount Susitna, known as \"Sleeping Lady,\" has long been a jewel in Anchorage's panoramic crown of mountains across Cook Inlet. The historical tale describes the mountain as resembling the profile of a woman asleep, long hair stretched out behind her.", "Everyone knows the story comes from Alaska Native lore, right?", "Wrong, according to Nancy Lesh, a University of Alaska Anchorage librarian.", "Lesh wrote a story about Sleeping Lady in the early 1960s as a senior in high school, and published it in Alaska Northern Lights magazine.", "\"I think I made the story up, although I can't definitely say for sure,\" she said.", "Ann Dixon, who published the children's picture book \"The Sleeping Lady\" in 1964, agreed that the story is not a Native legend. Instead, Dixon said, the tale probably originated with prospectors or homesteaders sometime between 1930 and 1950.", "In Dixon's version, the giant woman fell asleep waiting for her beloved to return from battle, unaware that he had been killed.", "Homer News.   \"Alaska Myths Are Rural Legend.\"     22 May 2003.", "Alaska.org.   \"Mount Susitna.\"     Accessed 9 August 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]