["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Pope Francis resides over a solemn Easter vigil ceremony in St. Peter's Basilica at the Vatican April 15, 2017. (AP)", "Did you hear what Pope Francis said now?", "Multiple Vatican cardinals have declared Pope Francis a false prophet after he made yet another controversial statement, according to an article making the rounds on Facebook.", "\"Pope Francis at Mass: ‘Jesus is Metaphorical, Not Literal,\" says the Nov. 18  headline in Yournewswire.com, a fake news website that says it delivers \"news truth unfiltered\" and highlights conspiracy theories.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news. YourNewsWire.com has made up other stories about famous people, including that Vladimir Putin had said Pope Francis was \"not a man of God.\"", "The article said that the statement made by Pope Francis \"is the latest in a long line of unconventional statements.\" The article includes various other alleged controversial statements by the Pope and stated he has been \"spreading Satanic doctrine.\"", "We searched for information about the alleged statement by Pope Francis and found no proof and only other websites repeating the same story.", "We emailed the contact persons listed on the yournewswire.com website and called the listed phone number, but received no reply. We also attempted to track down a spokesperson for the Holy See and did not hear back.", "While the Yournewswire.com headline is fictional, in real life Pope Francis has made several controversial statements documented by major news outlets.", "\"He has radically transformed the tone of his office, making a number eye-raising gestures and pronouncements that have liberals cheering and conservatives shaking their heads,\" the Washington Post stated in 2015.", "His statements that have drawn debate include the topics of atheism, sexuality, abortion, climate change and divorce. \"If someone is gay and he searches for the Lord and has good will, who am I to judge?\" he said in 2013.", "But in this case, we could find no evidence that he uttered the words in the headline, \"Jesus is Metaphorical, Not Literal.\"  We rate this headline Pants on Fire.", "Yournewswire.com, \"Pope Francis At Mass: ‘Jesus Is Metaphorical, Not Literal,’\" Nov. 18, 2017", "Yournewswire.com, \"Putin: ‘Pope Francis Is Not A Man Of God,’\" Aug. 3, 2017", "Chiefs Planet, \"Pope Francis At Mass: ‘Jesus Is Metaphorical, Not Literal,’\" Nov. 19, 2017", "Washington Post, \"8 of Pope Francis’s most liberal statements,\" Sept. 8, 2015", "CNN, \"The pope said what? Six stunners from Francis,\" June 13, 2013", "NJ.com, \"6 of Pope Francis' most controversial comments,\" September 2015", "PolitiFact, \"PolitiFact's guide to fake news websites and what they peddle,\" April 20, 2017", "PolitiFact, \"Bloggers push fake story that Vladimir Putin said Pope Francis is 'not a man of God,'\" Aug. 8, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]