["About this rating", "Since government-sponsored violence began in Syria in 2011 (and many other countries faced destabilization, crushing poverty, untenable violence, or some combination of the three) waves of immigrants, migrants, and refugees have swept into the European and American continents, crashing against increasing obstacles to safe landings: anti-immigrant sentiment, stronger border controls, and racially-motivated politics.  Rumors and misinformation have been an integral part of anti-refugee campaigns across the world, among them the claim that migrants and refugees are suspiciously young, able-bodied, and male — in other words, like \"soldiers,\" \"terrorists,\" or (as this particular meme says outright) \"invaders.\"", "The photograph seen in this particular meme was taken in Munich in September 2015 and has been used to illustrate the claim that a disproportionately large number of refugees and migrants are young and male.  Claims like these have stirred fears that refugees bring in terrorism, rape, sexual assaults, abuses,  and other societal ills that infest strongly patriarchal societies, fears that have become part of the accepted narrative about refugees.", "However, the statistics on refugees contradict this claim.  According to the United Nations High Commissioner for Refugees, as of 16 March 2016 they had recorded nearly 5 million registered Syrian refugees: 2.1 million of them in Egypt, Iraq, Jordan and Lebanon, another 1.9 million in Turkey, and more than 28,000 in North Africa. Of that group of 5 million refugees, more than half (50.7%) are female:", "It is true that the refugee demographics do skew on the side of youth. Syria is a country with a large population of young people, especially in comparison to greying Europe. The majority of Syrians are between 25 and 54 years old, and only 4.02% of Syria's population is older than 65 as of 2015, compared to the European Union's 18.5%. If refugee and migrant populations follow their originating country's demographics, then we should expect that at least half of Syrian (and other) refugees will be male, and most of them will be young.", "To put the issue of age into perspective, as of 2015 Syria's median age was 23.8, Iraq's was 19.7, and Afghanistan's was 18.4.  By comparison, the median age in the United States was 37.7, in the United Kingdom it was 40.4, and Germany it was 46.5. Children from Syria (and elsewhere) make up at least a third of the refugee population: children who, whether accompanied or alone, are looking for a chance to grow up in a country that is not shredded by violence.", "However, there are more able-bodied young men and fewer children among the refugees regularly showing up at Europe's shores in boats. The reason for this is simple: the journey by sea is relatively short (in some places only 2.5 miles, or 4 kilometers) but fraught with dangers on the water, as well as on land once the refugees arrive. An information leaflet distributed to potential refugees who plan to cross the Aegean Sea details some of those dangers:", "Do not get on board an overloaded or damaged boat.", "Make sure that the wooden or rubber hull is in good condition. No holes, torn or deflated parts! If the boat is in poor condition, your life is at immediate risk!", "We are well aware that relations with smugglers may make these security requirements impossible. But some people have refused to go onboard a boat in poor condition or/and overloaded, since this puts their life at immediate risk.", "On average, a ten metre long boat cannot take more than 10 people on board. This number goes up to 30 people for a 20 metre long boat. An overloaded boat is exposed to the risk of sinking!", "Make sure there is enough fuel for the double length of the planned trip!", "Make sure that there are enough paddles, that they are in good condition, and that the people who hold the paddles have a good experience and are strong.", "Precautions during the trip", "Observe carefully and try to document (by writing it down, for example) everything that happens or that you see during the trip. Any information about places and times can be useful in case of emergency. Take notes, pictures and GPS coordinates if possible. Watch out around you for rocks or other boats that could cause collisions!", "Protect yourself from the cold, and try to keep your clothes as dry as possible.", "Don't move around the boat so as to keep the balance at all times!", "Keep a calm attitude and avoid conflicts at any cost! Help each other and protect each other's lives. In the past years, solidarity amongst the people on board has saved many lives!", "Hold on firmly to the boat. Any abrupt movement or any panic reaction can put yourself at risk as people can easily fall off the boat, and the boat itself can capsize! There have been several cases in which women and children have died as they were trapped in the cabin underdeck. At the same time, sometimes, especially with bad weather, it is also dangerous to be outside. So if you are in the cabin, be alert to what is happening outside and make sure you can easily get out of it.", "Given the risk of drowning and arrest, and others that are not immediately obvious such as rape or assault, many men decide to go ahead alone and send for their families later, once they have established themselves in their new countries.", "The exact image in this particular \"invaders\" meme (\"Where are the women, children, and old people?\") doesn't show a sea crossing, however. It shows a group of people (mostly young men) who have just gotten off a train, and is used to bolster the claim that most refugees are young and male.  The photograph was taken in Munich, Germany, on 12 September 2015, and its caption doesn't specify exactly what country this particular group of migrants traveled from:", "MUNICH, GERMANY — SEPTEMBER 12: Migrants arrive by train at Munich Hauptbahnhof railway station on September 12, 2015 in Munich, Germany. German authorities are expecting 10,000 migrants to arrive on trains today, mostly from Hungary via Austria, on top of the approximately 20,000 that have arrived in the last 48 hours. Germany is distributing the migrants across the country and is struggling to register and house them. Many of the migrants are coming from Syria, Afghanistan and Iraq and are reaching western Europe via the Balkans.", "Another photograph taken at the same scene a few moments later shows even more young men:", "These images appear to support the \"overwhelmingly young and male\" claim that circulates in memes such as these (and is often uncritically repeated by politicians).  However, there's an excellent reason there women and children aren't seen in this crowd: They were all traveling on a separate train which arrived in Munich a day later:", "MUNICH CENTRAL STATION, MUNICH, BAVARIA, GERMANY — 2015/09/13: New arrivers enter the registration point. Even though Germany announced — and has by now — closed down its borders for refugees, asylum seekers keep coming to Munich Central Station. There is vast humanitarian support by the citizens of Munich. (Photo by Michael Trammer/Pacific Press/LightRocket via Getty Images)", "So, to answer the question asked in the meme: The women and children weren't in the photograph because they were on a different train that arrived the next day.  Old people aren't in this picture (or seen in many others) because, statistically speaking, there aren't so many old people in the war-torn and unstable countries that are shedding refugees, and those who do try to make perilous, physically demanding escapes from those countries often do not survive the experience.", "CIA.gov.    \"CIA World Factbook.\"", "UNHCR.org.    \"UNHCR Statistical Online Population Database.\"", "World.ByMap.org.    \"Median Age: The Age for All Countries of the World That Divides a Population Into Two Equal-Sized Groups.\"", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]