["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republicans are wasting no time defining a Georgia Democrat considering a run for the U.S. Senate in 2014.", "Michelle Nunn has never run for political office, so the National Republican Senatorial Committee is eager to tell Georgians all about her.", "Case in point, a June 17 news release from the National Republican Senatorial Committee.", "\"Nunn's extreme record of praising radical liberal groups like the Occupy Movement illustrates just how dangerously out of touch she is with voters in Georgia,\" NRSC spokeswoman Brook Hougesen wrote.", "PolitiFact Georgia wondered whether the NRSC is correct that Nunn praised the Occupy movement.", "The movement began in September 2011 when protesters camped out for months in a park near New York City’s Wall Street to voice their grievances against what they describe as \"the corrosive power of major banks and multinational corporations over the democratic process.\"", "In Atlanta, Mayor Kasim Reed had police remove Occupy sympathizers from a city park after a three-week stay. The Occupy movement is now less demonstrative, with more strategic protests against banks and other businesses for various practices.", "So what does Hougesen have to prove she’s right about Nunn? She pointed to an op-ed that Nunn wrote in The Washington Post a few days before Christmas 2011 titled \"Millennials to business: Social responsibility isn’t optional.\" It contained a few references to the Occupy movement.", "Here’s what we know about Nunn. She is the daughter of former U.S. Sen. Sam Nunn, a Democrat who is respected by many conservatives on national security issues. She is the chief executive officer of the Points of Light Foundation, a nonprofit, nonpartisan volunteer organization inspired by then-President George H.W. Bush. The Atlanta Journal-Constitution reported the foundation brought in $55 million in revenue in 2011 and mobilized 4 million volunteers worldwide for a range of causes last year. Neil Bush, son of the former president, is the board chairman.", "Being in charge of a nonpartisan volunteer organization requires skill in working with people of all political positions. As an elected official once told us \"I have friends on both sides of the issue and I always support my friends.\" One recent Nunn blog post on the Points of Light website had a picture of Republican strategist Karl Rove and Democratic Party organizer Donna Brazile dancing together at a conference.", "So what did Nunn write about it in her op-ed?", "\"The Occupy Wall Street movement is largely fueled by a relatively small set of young people who view the protests as a fight for their future,\" her op-ed began. \"The vast majority, however, are getting up and going to work every day — or wishing they could. These individuals are part of a less dramatic but, perhaps, equally powerful movement of Millennials shaping the future of business. As consumers, employees and entrepreneurs, Millennials are shifting the norms of corporate America’s conduct, ethical imperatives and purpose.\"", "Most of the article was about millennials, people typically born between 1980 and 2000. Nunn’s only other reference to the Occupy movement was at the end of her op-ed.", "\"The values behind Occupy Wall Street are manifesting themselves in the marketplace and companies that are failing to take notice should start,\" she wrote. \"These people-powered movements may not have stopped the markets in their tracks, but they are creating the demand for new forms of corporate behavior and ethical imperatives. The winning brands of the future will be ones that authentically respond.\"", "Hougesen said she was convinced Nunn was praising Occupy Wall Street upon reading the op-ed.", "\"When Michelle Nunn wrote that the ‘values behind Occupy Wall Street are manifesting themselves in the marketplace and companies’ and that protestors are ‘fighting for their future,’ it led us – and many progressives - to believe that she supported the movement. If over the past seventeen months Ms. Nunn has changed her view or beliefs, we would welcome her clarification,\" Hougesen said.", "Nunn referenced Occupy Wall Street in a January 2012 blog post reflecting on a dinner party discussion at her Atlanta home involving Martin Luther King Day.", "\"We broke bread and talked about the bright spots and challenges in our community in terms of race, class and the unfulfilled dimensions of Dr. King's dream. We talked about how Dr. King's nonviolent and creative dissent continues to animate our world - from the Arab Spring to Occupy Wall Street,\" she wrote.", "Nunn did not respond directly to our interview requests. Gordon Giffin, a former aide to her father who has been involved in discussions with the younger Nunn about her political future, contacted us via email. Giffin and a Points of Light spokeswoman said Nunn’s op-ed was aimed at talking about millennials.", "\"Her writings do not endorse the actions of the ‘occupy’ movement but rather point out that there are numerous other examples of how the younger generation is seeking to make a difference that might be ignored by (the) press’’ focus on the ‘occupy’ crowd. Perhaps misrepresentation is the game of the day in DC but we have higher standards in Georgia,\" said Giffin, a former U.S. ambassador to Canada who now is a partner at the influential law firm McKenna Long & Aldridge.", "This was a tough call for us. To sum up, the NRSC claimed that Nunn praised the Occupy movement. Its argument is based on an op-ed she wrote in 2011.", "The op-ed referenced Occupy a couple of times, but Nunn supporters say the intent of the article was to talk about young people and their role in the marketplace. The bulk of the op-ed was about millennials.", "The claim has an element of truth but ignores critical factors that give a different impression. We rate this claim Mostly False.", "The Atlanta Journal-Constitution, \"Newcomer Nunn built service career,\" May 28, 2013.", "The Atlanta Journal-Constitution, \"What a non-political speech tells us about Michelle Nunn,\" June 20, 2013.", "Emails from Brook Hougesen, spokeswoman, National Republican Senatorial Committee, June 18, 2013.", "Email from Stefanie Weiss, spokeswoman, Points of Light, June 22, 2013.", "Email from Gordon Giffin, June 25, 2013.", "Points of Light blog, \"Reflections on MLK Day,\" Jan. 16, 2013.", "Telephone interview with Stefanie Weiss, June 24, 2013.", "The Washington Post, \"Millennials to business: Social responsibility isn’t optional,\" by Michelle Nunn, Dec. 20, 2011.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]