["As the Senate recall elections heat up, the personal lives of candidates are dominating the attack ads.  \n\nTheir criminal convictions and other transgressions are being highlighted -- along with their voting records and stances on the issues. Many of the ads are being aired by outside groups.\n\nPerhaps no television ad is more startling -- and graphic -- than one being aired in Green Bay and Madison by a group called Wisconsin Family Action. It targets state Rep. Fred Clark (D-Baraboo), challenger to state Sen. Luther Olsen (R-Ripon).\n\nThe ad, bearing the theme \"Legislators should lead by example,\" runs through Clark’s checkered driving record -- speeding, previous accidents, driving with a suspended license -- and concludes with a disturbing video of an SUV hitting a bicyclist.\n\nIn the video, an SUV zips into the frame, slamming into a bicyclist who rode into the intersection. As the crash occurs, the narrator intones: \"Fred Clark ran this red light, seriously injuring this bicyclist.\" The audio includes the sound of squealing tires and the shocked voice of a witness on the bus.\n\n(The ad is not available online. A Madison television station did a story about the ad, which includes much of its content that you can see here.)\n\nDid Fred Clark really crash into a bicyclist?\n\nBeyond that, is the video actually from the incident? And who was at fault?\n\nLet’s backpedal.\n\nA Madison police report shows that Clark was involved in car-bike accident on Aug. 18, 2009, near the state Capitol. According to the report:\n\nClark was driving his 2008 Ford Escape north on Hamilton Street about 4:25 p.m. The bicyclist, a 57-year-old Madison man, was heading north on Webster Street. when he was struck by Clark’s SUV. The report said that Clark \"violated the red traffic signal\" before striking the biker who had a green light.\n\n\"I ran a red light,\" Clark told an officer at the scene, the report says. \"I was just not paying attention.\"\n\nThe cyclist was taken to University of Wisconsin Hospital and Clinics with back and lung injuries, which the report called \"incapacitating.\" An officer attempted to speak with the victim at the hospital but said the man was unable to do so because of his injuries.\n\nClark received an $88 ticket for running the red light.\n\nAfter the incident hit the news, his office issued a statement from Clark: \"At this time, my first concern is for the well-being of the cyclist who was injured. What occurred was an accident, and my thoughts are with that person and his family.\"\n\nSo what of the video in the ad?\n\nThe video is real, and it comes from the dashboard camera of a Madison Metro bus that was stopped at the light on Webster Street. The light changes and the bus begins to move into the intersection when Clark’s SUV cuts in front of it and strikes the bike, which approached the intersection alongside the bus.\n\nJulaine Appling, president of Wisconsin Family Actionl, a group that advocates against same sex marriage and \"foundational issues such as marriage, life and liberty\" did not respond to requests for comment about the ad. Likewise, neither Clark nor his campaign was available to discuss the ad.\n\nSo where does that leave us?\n\nA television ad produced by Wisconsin Family Action against recall challenger Clark highlights his checkered driving record. With video, the ad says Clark struck a bicyclist. The video is real and the accident happened as described. We rate the claim True.", "YouTube video of accident\n\nMadison Police Department incident report, Aug. 18, 2009\n\nMadison Police Department report.\n\nMilwaukee Journal Sentinel, \"State representative cited in car-bike crash in Madison,\" Aug. 18, 2009\n\nWKOW-TV, \"Area cyclists react to report of video of car versus bike,\"  Aug. 28, 2009\n\nWKOW-TV, \"Red light runner: SUV/bicycle collision,’ Aug. 28, 2009\n\nWISC-TV \"Reality Check: Ad targets recall challenger’s driving record,\" July 19, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]