["About this rating", "As the gift-giving season drew nearer in late 2020, scammers impersonating online shopping giants Amazon and Apple targeted customers in an attempt to gain access to personal information, like account passwords and credit card numbers.", "Warnings issued by the Federal Trade Commission (FTC) and the Better Business Bureau (BBB) described two versions of the scam.", "In the first, a recorded message claimed to represent Amazon following up on an issue with the recipient’s account, such as a suspicious purchase or a lost package.", "[audio m4a=\"https://www.snopes.com/uploads/2020/12/amazon-account-scam-robocall.m4a\"][/audio]", "In the second version, the recording claimed suspicious activity on the recipient’s Apple iCloud account indicated the account had been \"breached.\"", "[audio mp3=\"https://www.snopes.com/uploads/2020/12/apple-support-scam-robocall.mp3\"][/audio]", "Both recordings offered that the listener can press \"1\" to speak with someone or call the provided phone number.", "“It’s a scam. They’re trying to steal your personal information, like your account password or your credit card number,” wrote the FTC, adding that a person should not engage with the caller and avoid pressing 1 or calling a phone number provided. Most importantly, never give out personal information.", "The BBB also noted that in some cases, the scammers can “spoof” a phone number, falsifying the information transmitted to a person’s caller ID system so as to disguise their identity. This spoofing can make it look like they are calling from a number that they aren’t, such as a neighbor or even official agencies. BBB also issued the following advice:", "If there is an issue with your account, experts recommend calling the company directly using only contact information provided on its official website. Amazon customers can find more information about how to determine whether a communication is coming directly from Amazon by visiting this link, as well as contact the company here. Contact information for Apple iCloud can be found here.", "Any perceived fraud can be reported to officials at ReportFraud.ftc.gov and the BBB Scam Tracker.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]