["“JOE BIDEN CALLS AMERICA AN EMBARRASSMENT,” says text that appears under the video in Facebook posts here, here and here.", "“The only time Biden can say a coherent sentence is when he’s ripping America!” the posts say.", "But it is clear from the video that Biden was not taking aim at America in general.", "\"The America I see values basic human decency, not snatching children from their parents, or turning our back on refugees at our border. Americans know that's not right. The American people understand please, because it makes us embarrassing,” Biden says.", "“The American people know overwhelmingly that that's not right, that's not who we are,” he says.", "He was referring to the Trump administration’s stance on immigration, which included a “zero tolerance” policy launched in 2018 that saw thousands of children separated from their parents at the border before the government backed down amid a torrent of criticism.", "The clip in the Facebook posts shows Biden speaking at the Munich Security Conference in February 2019.", "Other posts making the same misleading claim feature a tweet originally sent just days after Biden’s Munich remarks.", "“Joe Biden just went to Europe telling people that America is “an embarrassment.” No Joe Biden, YOU are the embarrassment. Who else Agrees?” says the tweet, which has been shared as a screenshot on Facebook here and here.", "Biden has moved into the lead in the race for the 2020 Democratic presidential nomination after racking up a series of primary victories in Super Tuesday voting on March 3, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]