["The novel coronavirus that causes the disease COVID-19 is a virus.", "Viruses do not respond to antibiotic treatment; antibiotics work only on bacterial infections.", "COVID-19 is primarily a respiratory illness that in some cases causes pneumonia. Another effect, according to the autopsies in Italy, is lung damage caused by blood clotting. But that doesn’t change the fact that COVID-19 is caused by a virus.", "When it comes to treating COVID-19, the world has it all wrong, a Facebook post claims.", "\"Autopsies prove that COVID-19 is a disseminated intravascular coagulation — pulmonary thrombosis. It is now clear that the whole world has been attacking the so-called coronavirus pandemic wrongly due to a serious pathophysiological diagnosis error,\" the lengthy post begins.", "Autopsies performed by Italian pathologists, the post continues, show that COVID-19 \"is not pneumonia, but it is disseminated intravascular coagulation, or thrombosis, which ought to be fought with antibiotics, antivirals, anti-inflammatories and anticoagulants. If this is true for all cases, that means the whole world is about to resolve this novel pandemic earlier than expected.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We’ve seen the terms so many times, but it doesn’t hurt to review.", "COVID-19 is an abbreviation for coronavirus disease 2019 — a name given by the World Health Organization three months after the disease was discovered in Wuhan, China, in December.", "As the various names suggest, the novel (as in new) coronavirus that causes the disease COVID-19 is a virus named severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2).", "Antibiotics do not work against viruses; they only work on bacterial infections.", "As Texas A&M University-Texarkana virologist Ben Neuman describes it, \"COVID-19 starts out in the lungs like the common-cold coronaviruses, but then causes havoc with the immune system that can lead to long-term lung damage or death.\"", "The technical term cited in the Facebook post — \"disseminated intravascular coagulation\" — is \"a rare but serious condition that causes abnormal blood clotting throughout the body’s blood vessels,\" according to the National Heart, Lung and Blood Institute, a U.S. government agency. \"It is caused by another disease or condition, such as an infection or injury, that makes the body’s normal blood clotting process become overactive.\"", "As the post indicates, Italian pathologists did perform autopsies on people with COVID-19.", "But their study didn’t contradict what COVID-19 is; it merely reported on how the disease can damage lungs.", "The pathologists examined the lung tissues of 38 COVID-19 patients who died in hospitals in northern Italy. They concluded that \"the virus remains in lung tissue for many days, even if in small quantities, possibly being the trigger of the mechanism that leads to and feeds lung damage.\"", "Their findings were posted in a preliminary study April 19. That study has not been peer reviewed, meaning it has not yet been evaluated by experts for formal publication in a medical journal.", "One of the pathologists on the study, Dr. Aurelio Sonzogni of Papa Giovanni XXIII Hospital in Bergamo, confirmed to PolitiFact that the study does not contradict the fact that COVID-19 is a virus that cannot be treated with antibiotics. Rather, his study found that lung damage caused by blood clots is one possible effect of COVID-19. The study has been accepted for publication in The Lancet Infectious Diseases, a London-based medical journal, he said.", "\"Autopsies prove that COVID-19 is\" a blood clot, not pneumonia, \"and ought to be fought with antibiotics,\" a Facebook post claimed,\" and the whole world has been wrong in treating the \"so-called\" pandemic.", "The novel coronavirus that causes the disease COVID-19 is a virus. Viruses do not respond to antibiotic treatment; antibiotics only work on bacterial infections.\n\nCOVID-19 is primarily a respiratory illness that in some cases causes pneumonia. Another effect, according to the autopsies in Italy, is lung damage caused by blood clotting.", "The post is false and ridiculous — Pants on Fire.", "Facebook, post, May 11, 2020", "Email, Dr. Aurelio Sonzogni, Department of Pathology, Papa Giovanni XXIII Hospital, Bergamo, Italy, May 19, 2020", "National Heart, Lung and Blood Institute, \"Disseminated Intravascular Coagulation,\" Oct. 8, 2019", "Poynter Institute, \"We’ve published more than 5,000 fact-checks about the coronavirus. Here are the 5 most popular,\" May 12, 2020", "U.S. Centers for Disease Control and Prevention, \"Coronavirus Disease 2019 Basics,\" May 12, 2020", "World Health Organization, \"Coronavirus,\" accessed May 19, 2020", "Verificado, \"False that COVID-19 is just a thrombosis,\" April 17, 2020", "FullFact.org, \"This post about Covid-19 and blood clotting conditions contains inaccuracies,\" May 7, 2020", "Redacción Médica, \"Coronavirus: conclusiones de las primeras autopsias en muertos con Covid-19,\" April 23, 2020", "Animal Politico, \"No, COVID is not a thrombosis that must be treated with antibiotics,\" April 21, 2020", "MedRxiv.org, \"Pulmonary post-mortem findings in a large series of COVID-19 cases from Northern Italy,\" April 19, 2020", "The Conversation, \"What the coronavirus does to your body that makes it so deadly,\" April 2, 2020", "U.S. Food and Drug Administration, \"Coronavirus Disease 2019 (COVID-19) Frequently Asked Questions,\" May 18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]