["The video was published here on Twitter on July 11, 2020. It has been viewed more than 53,000 times.", "The 12-second video shows a bus filled with water driving through a flooded street. During the video, an announcement in Mandarin can be heard. The words translate to English as: “[We are] about to arrive at Meichuan Road Zhenbei Road, please be prepared to get off the bus”. A passenger is then heard saying: “How can we get off the bus?”", "The post’s simplified Chinese-language caption translates to English as: “Reminder from Shanghai’s bus company: Pay for a bus, enjoy a yacht. A nice trip in Venice with two RMB”.", "Shanghai, a Chinese municipality located in the country’s southeast, experienced heavy rains in July 2020 as reported by Chinese state media The Paper here and Global Times here.", "The video was also shared here and here on Twitter and here and here on Facebook, alongside a similar claim. Taihang Daily and zynews.cn also shared the video on Douyin, the Chinese version of video-sharing app TikTok.", "The video, however, has been shared in a misleading context.", "A keyword search on Weibo found the same video published here on the Weibo account of the Chinese newspaper Shanghai Morning Post, dated August 10, 2019.", "Part of the video’s simplified Chinese language caption translates to English as: “#SuperTyphoon\"Lekima\"Landed# Today, a video was widely shared in WeChat Moments, which shows a bus, with a carriage full of water, running on Zhenbei Road-Meichuan Road, as if the bus is ‘surfing’ in the water.”", "Meichuan Road-Zhenbei Road bus station in Shanghai can be found here on Baidu Maps.", "Below is a screenshot comparison of the video in the misleading post (L) and the 2019 Weibo video (R):", "The video was also published on the Weibo account of Chinese newspaper Jilin Daily here; as well as here on the Weibo account for the Public Security Bureau of China’s Hedong New District in Suining city.", "Typhoon Lekima struck eastern China in the early hours of August 10, 2019, killing at least 44 people, according to this AFP report. In Shanghai alone, more than a quarter of a million people were relocated days beforehand as a precaution.", "The video was also debunked here by Rumor Buster, a fact-checking organisation run by  the Shanghai Municipal Internet Information Office and Chinese newspaper Jiefang Daily.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]