["About this rating", "On 6 November 2017, user Gary Joe Ahrns shared a Facebook Live video purportedly showing piles of wasted food outside a Walmart in Celina, Ohio (also published to YouTube and archived):", "In the video, which has been viewed hundreds of thousands of times, Ahrns laments heaps of discarded foods (such as meat, milk, and butter) and interrogates a manager about whether he can \"have\" the food. At around the two-minute mark, employees respond to his request to salvage some of the food by stating that it is \"all bad,\" presumably indicating that they believe it is unsafe to eat.", "Walmart's Facebook response team issued a series of replies to agitated commenters, attributing the circumstances to the aftermath of a power loss in the area of the store on 5 November 2017:", "Unfortunately, due to a tornado that affected our store in Celina, Ohio on November 5, the food being disposed of was unsafe for consumption after the store lost power for 14 hours. Per internal and health department policies, we followed proper procedures by disposing of the food. -Red", "Limaohio.com also reported widespread power outages following the storm:", "With areas of the city still without power [a day later], damage assessment was ongoing after the EF2 tornado whipped through Celina. A second tornado, also an EF2, was confirmed in the vicinity of St. Anthony in western Mercer County. According to Midwest Electric, the storm caused just more than 1,000 of its customers to lose power, with almost all restored by midnight.", "A state of emergency was declared in an area affecting Celina, Ohio, and local news outlets listed Walmart among businesses heavily affected by power loss and storm damage.", "Walmart also sent us a statement that read as follows:", "Unfortunately, due to a tornado that affected our store in Celina, Ohio on November 5, the food being disposed of was unsafe to eat after the store lost power for 14 hours. Per internal and health department policies, we followed proper procedures by disposing of the food.", "The video shows that Walmart did, indeed, throw away piles of food — but what it left out was that the store was responsibly disposing of spoiled or spoiling food after an hours-long power outage following an uncommonly destructive tornado. The circumstances under which the food came to be discarded were documented extensively in local news, and Walmart's response was well supported by coverage of the early November 2017 weather event in Celina, Ohio.", "Carr, Ada and Sean Breslin.   \"Two Killed As Tornado Outbreak Batters Midwest.\"\r\n    The Weather Channel.   6 November 2017.", "Edwards, Nathan.   \"Celina's Mayor: Crews Are Close to Getting the Lights Back On After Storms, Tornado.\"\r\n    WRGT-TV.   7 November 2017.", "Kelly, Craig.   \"After Tornado, Celina Begins Cleanup, Damage Assessment.\"\r\n    limaohio.com.   7 November 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]