["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Staff in biohazard suits hold a metal stretcher by the in-patient department of Wuhan Medical Treatment Center, where some infected with a novel coronavirus are being treated, in Wuhan, China on Jan. 21, 2020. (AP)", "Once a high percentage of people have been infected with a virus or vaccinated — in other words, herd immunity is achieved — spread of the virus can be stopped or greatly slowed.", "Despite having a population twice that of New York State, California has experienced only a fraction of the number of COVID-19 deaths.", "There’s no evidence herd immunity has limited coronavirus deaths in California, which adopted stay-at-home measures before New York did.", "There is no vaccine to protect against COVID-19.", "So, is it possible a naturally occurring \"herd immunity\" has, in effect, inoculated much of California, keeping the number of the state’s coronavirus deaths a fraction of those in New York?", "That’s the claim of a lengthy Facebook post, titled \"CV-19 Hoax Update.\" It starts with this:", "\"Do you wonder why CA only has 559 CV19 deaths compared to 7,067 deaths in NY? Welp, researchers at Stanford's School of Medicine suspect it's because CA had already developed ‘herd immunity’ to the virus. They're now conducting a study to find this out. Makes sense. … Building ‘herd immunity’ is the only way to get rid of a virus when there is no vaccine.\"", "The post also claims that California is a leading tourist destination for people from China and theorizes that the virus has been \"kicking around\" California \"since October or November.\" It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Herd immunity, also called \"herd protection,\" is a real phenomenon. It’s when the percentage of the population immune to a virus becomes so high that the virus virtually dies off. But experts, pointing to how relatively little testing is being done, say there is no evidence of herd immunity for COVID-19 anywhere, let alone just in California.", "The numbers of COVID-19 deaths cited in the April 10 Facebook post — 559 in California and 7,067 — were accurate. News reports at the time cited those figures from Johns Hopkins University.", "That means New York had more than 12 times as many coronavirus deaths, even though its population is only about one-half that of California.", "Think of herd immunity as being a situation in which so many people — above 50% to perhaps 70% — are immune to a virus that it essentially stops spreading.", "It occurs when enough people in a community become immune through vaccination and/or prior illness, making the spread of the disease from person to person unlikely, the Association for Professionals in Infection Control and Epidemiology says.", "The theory is that once many people develop immunity, the virus will eventually stop spreading to people who haven’t yet caught it.", "It’s not easy to achieve.", "Based on testing, even hard-hit Wuhan, China, where the virus was first detected Dec. 31, 2019, isn’t close to achieving herd immunity, the Wall Street Journal reported on April 16, 2020.", "And in the days after the Facebook post, California Gov. Gavin Newsom talked about herd immunity as an aspiration for his state, not as something that has spared it.", "The Facebook post argues that it makes sense that California would have herd immunity because so many people travel there from China. It alludes to a Stanford University study as evidence.", "That study, which tested for coronavirus antibodies among 3,300 people in Santa Clara County, Calif., on April 3 and 4, 2020, was aimed at determining how many people in the county had unknowingly been infected with the virus, but didn’t become seriously sick.", "Newsom said the project would show \"how far away we are from herd immunity.\"", "The study concluded that the infection is much more widespread than indicated by the number of confirmed cases — an estimated 48,000 to 81,000 people were infected in the county by early April, 50 to 85 times more than the number of confirmed cases. That’s likely due to several factors, including early spread, lack of systematic testing, and asymptomatic or lightly symptomatic cases that were previously undetected, the study said.", "But the study’s findings are not evidence that California has herd immunity, Dr. David Hamer, an expert on infectious diseases and global health and medicine professor at Boston University, told PolitiFact.", "Experts told PolitiFact that, because relatively little COVID-19 testing has been done, there simply is no evidence of herd immunity for COVID-19.", "\"We just don't have the testing data yet to determine who is protected. So, we are still not there in terms of declaring herd immunity,\" said Melissa Brown, professor of microbiology/immunology at Northwestern University.", "Stephen Morse, professor of epidemiology at Columbia University in New York, agreed.", "\"Since almost all of the testing is done only on sick (symptomatic) people, presumably due to limitations in testing capacity, and only a very few counties are testing more widely, we don’t know the level of immunity in either California or New York,\" he said. \"Therefore, we can’t say anything about herd immunity, as we simply don’t know.\"", "While the federal and state governments are building up their testing capabilities, \"it’s not clear how good all these tests are,\" said Hamer. \"And we don’t have a clearly defined test to tell whether a person has had the disease\" and also has antibodies to protect from getting COVID-19 again.", "As a number of news reports have suggested, experts also told us that one explanation for California’s lower death toll is that it adopted stay-at-home orders and other responses before New York did.", "A widely shared post on Facebook claims herd immunity is probably why California has far fewer COVID-19 deaths than New York.", "Experts say that with relatively little testing having been done, there is no evidence to indicate that herd immunity explains the large gap in coronavirus deaths in the two states.", "We rate the claim False.", "Facebook, post, April 10, 2020", "PolitiFact, \"Fact-checking a Miami Beach Commissioner’s statement about coronavirus and first responders,\" March 18, 2020", "PolitiFact, \"We answered your questions on coronavirus seasonality, immunity and transmission,\" March 13, 2020", "Association for Professionals in Infection Control and Epidemiology, \"Herd immunity,\" accessed April 18, 2020", "The Conversation, \"The ‘herd immunity’ route to fighting coronavirus is unethical and potentially dangerous,\" March 17, 2020", "MedRxIV.org, \"COVID-19 Antibody Seroprevalence in Santa Clara County, California,\" April 17, 2020", "Interview, Dr. David Hamer, expert on infectious diseases, global health and medicine professor at Boston University, April 20, 2020", "USA Today, \"Fact check: Herd immunity would not fully stop the spread of coronavirus,\" April 18, 2020", "Wall Street Journal, \"Wuhan Tests Show Coronavirus ‘Herd Immunity’ Is a Long Way Off,\" April 16, 2020", "San Jose Mercury News, \"Gov. Newsom says things will be normal when we have ‘herd immunity.’ Here’s why that’s scary,\" April 17, 2020", "Wall Street Journal, \"How California Has Avoided a Coronavirus Outbreak as Bad as New York’s…So Far,\" April 8, 2020", "San Jose Mercury News, \"Coronavirus: New Stanford research reveals if you’ve been exposed,\" April 5, 2020", "Vox, \"Why New York has 14 times as many coronavirus deaths as California,\" April 13, 2020", "SFGate, \"Coronavirus updates: Bay Area counties report just 3 new deaths Thursday,\" April 9, 2020", "Email, Stephen Morse, Columbia University professor of epidemiology, April 18, 2020", "San Francisco Chronicle, \"When will California have ‘herd immunity’ to the coronavirus? And other answers on COVID-19 immunity,\" April 14, 2020", "Email, Melissa Brown, professor of microbiology/immunology at Northwestern University, April 19, 2020", "Centers for Disease Control and Prevention, \"Geographic Differences in COVID-19 Cases, Deaths, and Incidence — United States, February 12–April 7, 2020,\" April 10, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]