["A meme shared hundreds of times in multiple posts on Facebook and Twitter claims that termites produce 10 times more carbon dioxide than humans in a single year. The claim is false; scientists estimate termites’ carbon emissions are approximately one-tenth of those created by humans.", "The meme was published in this Facebook post on October 22, 2019.", "The meme features several large termites alongside an image of teenage climate change activist Greta Thunberg and a quote from this speech she made at the United Nations on September 23, 2019.", "Text superimposed on the image states: “Termites produce 10 x more CO2 [sic] than MAN in the whole world in a YEAR!”", "Below is a screenshot of the misleading post:", "The meme was also shared on Facebook here, here, here and here, where it has been shared more than 1,300 times; and on Twitter here and here.", "The claim is false; scientists estimate termites produce approximately one-tenth of the carbon emissions produced by humans in a single year.", "Professor Stefan Arndt, from the University of Melbourne’s School of Ecosystem and Forest Sciences, told AFP the misleading claim was in fact “the other way around”.", "“Termites only emit a tenth of the overall emissions humans create every year, in terms of anthropogenic fossil fuel emissions,” Arndt said via email on October 29, 2019.", "This academic study, written by academics in Japan, Malaysia and the UK in 2000, estimated termites emit 3,540 teragrams, or 3.54 Gigatonnes of CO2 in a year.", "Below is a screenshot of the table of these emissions estimates, which appears on page 425 of the study:", "The Global Carbon Project, a US-based environmental research organisation, stated in this 2018 report there were 36.2 Gigatonnes of CO2 emissions from fossil fuels and industry in 2017.", "Below is a screenshot of the report with the section highlighted in red by AFP:", "Arndt noted that termites are “part of the natural carbon cycle, so any CO2 that is emitted by a termite is sequestered again by a plant”.", "“Hence, termites are de facto carbon neutral,” he said. “This would only change if we [were to] get more and more termites, then their CO2 emissions could rise, as plants may not be able to keep up with the sequestration. This is pretty much what happens with human induced CO2 emissions from fossil fuel sources. The CO2 [is] rising so rapidly that plants cannot keep up.", "“In fact, CO2 emissions have risen per decade by about 3.1 Giga tonne of CO2, pretty much what the CO2 emissions from termites are per year. Hence, the human CO2 emissions increase every year by 1/10 of the global termite CO2 emissions.", "“Importantly, termite populations do not seem to increase globally, so we really do not have to worry about them. Unless you live in a wooden house of course, then you better watch out for them.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]