["About this rating", "On 4 April 2018, a web site reported that Grammy Award-winning singer Toni Braxton had passed away at age 50 of as yet undetermined causes:", "American singer Toni Braxton has died after been rushed to hospital on Tuesday night for feeling “unresponsive” at home, family tells the media.", "According to the family’s spokesperson Anita Arthur, the cause of her death is not immediately known as the family awaits an autopsy report.", "Braxton was hospitalized in 2016 due to complications with her lupus which led her to postpone Cleveland show.", "Braxton revealed in 2011 that she was living with lupus, a chronic autoimmune disease that causes inflammation in the sufferer’s internal organs, joints and skin. She also appeared on “The Dr. Oz Show” in 2013 to talk about her diagnosis.", "Her sister Traci Braxton who was kicked out of her upcoming tour “Sex and Cigarettes” solo tour amid family feud, said the singer “showed no sign of illness and never complained of Lupus”.", "The web site reporting this information was highly dubious, as it was labeled with no identifying name other than \"REPORTS\" and hosted under an ersatz domain name intended to mimic that of the CNN news network (breaking-cnn.com):", "Indeed, this news about Braxton's passing was just another celebrity death hoax.  Although the singer has been hospitalized in the past for medical issues related to lupus, no legitimate news organization has reported her death, nor has either of Braxton's official Facebook or Twitter accounts made any mention of her passing.", "That this report of Braxton's death is mere misinformation is not surprising, as the REPORTS site at breaking-cnn.com is a known purveyor a fake news, including previous death hoaxes about singers such as Marilyn Manson and Phil Collins.", "Kreps, Daniel.   \"Toni Braxton Released from Hospital After Lupus Flare-Up.\"\r\n    Rolling Stone.   3 October 2016.", "Sources.   \"Toni Braxton Dies at 50.\"\r\n    4 April 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]