["About this rating", "The long FBI career of former special agent Peter Strzok came to an unceremonious end on 13 August 2018, when he was fired after a review of his conduct related to an exchange of private text messages in which he disparaged Donald Trump.", "Trump, who had inveighed against Strzok via Twitter on previous occasions, hailed the agent's termination in a series of fresh tweets:", "Agent Peter Strzok was just fired from the FBI - finally. The list of bad players in the FBI & DOJ gets longer & longer. Based on the fact that Strzok was in charge of the Witch Hunt, will it be dropped? It is a total Hoax. No Collusion, No Obstruction - I just fight back!", "— Donald J. Trump (@realDonaldTrump) August 13, 2018", "Fired FBI Agent Peter Strzok is a fraud, as is the rigged investigation he started. There was no Collusion or Obstruction with Russia, and everybody, including the Democrats, know it. The only Collusion and Obstruction was by Crooked Hillary, the Democrats and the DNC!", "— Donald J. Trump (@realDonaldTrump) August 14, 2018", "On the day of his firing, a tweet issued from an account opened in Strzok's name using the handle \"@_peterstrzok\" hurled a string of insults back at Trump, calling the president \"an unhinged madman threatening the sovereignty of the United States of America\":", "That post was retweeted a number of times by high-profile users who apparently hadn't noticed that the account wasn't verified and assumed it was legitimate. One of those was CNN politics reporter Chris Cillizza:", "But Cillizza was informed that the account wasn't real and issued a correction an hour or two later:", "It was, in fact, a parody account listing May 2016 as its founding date and offering no clear indication of its counterfeit status apart from containing only a handful of tweets:", "By the next day, however, the account's handle had been changed to the more obvious \"@notpeterstrzok,\" and its profile was edited to read, \"Peter Strzok is former FBI agent and Army veteran. Parody account -- paying tribute to Peter Strzok.\"", "One reason the ersatz account succeeding in fooling people was that its first tweet was a take-off on Peter Strzok's actual Twitter response to being fired.", "This is the fake version:", "Deeply saddened by this decision. It is a decision that produces only one winner - those who seek to harm our country and weaken our democracy. The FBI and the American people deserve better. pic.twitter.com/fe7C49rcGz", "— Peter Strzok (@notpeterstrzok) August 13, 2018", "And this was what the real Peter Strzok tweeted from his verified account earlier that same day:", "Deeply saddened by this decision. It has been an honor to serve my country and work with the fine men and women of the FBI. https://t.co/iET9SbeTrv pic.twitter.com/7VTswzjoxE", "— Peter Strzok (@petestrzok) August 13, 2018", "Associated Press.   \"FBI Fires Peter Strzok in Wake of Anti-Trump Text Messages.\"\r\n    13 August 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]