["About this rating", "On 22 June 2015, the fake news web site World News Daily Report published an article reporting that a gang member in Los Angeles had died after trying to gold plate his genitals:", "An L.A. gang member, Nazario Conchuza Gonzalez, who is part of the infamous Ms-13 gang, also called Mara Salvatrucha, has died of medical complications after attempting to gold plate his own genitals to celebrate his 17th anniversary.", "The 17-year old man who was allegedly a fan of the 2002 American comedy movie Goldmember, which is a loose parody of the James Bond films Goldfinger, had taken the Spanish nickname of “Pelotas de oro”, or golden testicles, before attempting to gold plate his own genitals to his ultimate demise.", "Dr Ian Joseffson of the Los Angeles Community Hospital warns of a growing trend within gang members to attempt the “deadly operation.”", "“I have no idea where this idea comes from but plating one’s own genitals will only ultimately end in serious medical complications or even death, as we have seen in this case”", "While many readers know that the articles published by World News Daily Report are fictitious, the above-quoted story managed to fool others after it was republished on Link Beef, a web site without a clearly displayed disclaimer. World News Daily Report, however, does make it clear in their disclaimer that all their articles are works of fiction:", "WNDR assumes however all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website — even those based on real people — are entirely fictional and any resemblance between them and any persons, living, dead, or undead is purely a miracle.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]