["About this rating", "In July 2016, a failed coup attempt by Turkey's military ended when security forces detained thousands of participants after a bloody night that left at least 240 people dead.", "In the days after, President Recep Tayyip Erdogan closed hundreds of schools, arrested thousands, and declared a three-month state of emergency during which he vowed to root out the \"viruses\" within the military. At the same time, a story emerged that CIA agents were directly involved in Turkey's failed military coup:", "According to the Ministry of Foreign Affairs (MoFA) for the Republic of Turkey, the two captured CIA pilots were not only responsible for shooting down the Russian Sukhoi Su-24m bomber over Syria last year, but also attempted to kill President Erdogan during the failed “coup” attempt a few days ago.", "Whatdoesitmean.com reports:", "The MoD further warned that the Obama regime was planning to kill President Erdogan in a coup and replace him the CIA’s “designated figurehead” Fethullah Gulen—and that Turkey’s MoFA confirmed just hours ago was behind this plot by stating that “the Fethullah Gülen Terrorist Organization is behind this coup attempt”.", "The conspiracy web site WhatDoesItMean.com appears to be the driving force behind this rumor, which publishes many stories that range from mostly true to completely fabricated. In this case, the site purports to have information that two CIA agents, who were behind a foiled plot to kill President Erdogan, were arrested in Turkey.  By a strange coincidence, the site says that these are also the exact two agents who were behind shooting down a Russian bomber over Syria in 2015.", "It's true that news outlets reported from the region that two pilots were arrested following the attempted coup:", "Three senior officials in Ankara said Akin Ozturk, head of the air force until 2015 and a member of High Military Council (YAS), the top body overseeing the armed forces, was one of the masterminds of the plot. He was among thousands of soldiers detained, pictured on Sunday in handcuffs wearing a striped polo shirt at Ankara police headquarters.", "Ozturk was due to be retired this August at a meeting of the YAS, which convenes twice a year. According to his biography, still on the military's website, he was born in 1952.", "The second mastermind was thought to be Muharrem Kose, a former legal adviser to the chief of military staff, the same three Ankara officials said. They described Kose as a follower of Fethullah Gulen, a U.S.-based cleric whose network Erdogan has blamed for carrying out the coup attempt.", "It's further true that the same two men are accused by the Erdogan administration of downing a Russian jet in November 2015:", "Two Turkish pilots who played a role in the downing of a Russian jet in November are in custody over the July 15 failed coup in Turkey, a Turkish official said.", "The downing of the Russian fighter jet on the Syrian border last November sparked an unprecedented diplomatic crisis between Turkey and Russia, which ended last month when the two countries agreed to restore ties.", "\"Two pilots who were part of the operation to down the Russian Su-24 in November 2015 are in custody,\" a Turkish official told AFP late on Monday.", "When asked about the issue by the Turkish media, Justice Minister Bekir Bozdag said there were reports of the pilots being detained but they were \"yet to be confirmed\".", "There's even some speculation that the two pilots have ties to a Muslim cleric originally from Turkey who currently lives in the United States:", "What is the Gulen movement?", "A well-organised community of people - not a political party - named after the US-based Islamic cleric Fethullah Gulen.", "He is regarded by followers as a spiritual leader and sometimes described as Turkey's second most powerful man.", "The imam promotes a tolerant Islam which emphasises altruism, modesty, hard work and education.", "He is also a recluse with a heart condition and diabetes who lives in a country estate in the US state of Pennsylvania.", "However, there's absolutely no evidence listed (including from the site that first published this story) to suggest that the two pilots were agents of the United States government.", "Pamuk, Humeyra and Coskun, Orhan.   \"At Height of Turkish Coup Bid, Rebel Jets Had Erdogan's Plane in Their Sights.\"\r\n    Reuters.    18 July 2016.", "Sariyuce, Isil and Dewan, Angela.   \"Turkey Declares Three-Month State of Emergency.\"\r\n    CNN.   20 July 2016.", "Al Jazeera English.   \"Turkish Pilots Who Downed Russian Jet Detained.\" \r\n    19 July 2016.", "BBC News.   \"Turkey Coup Arrests Hit 6,000 as Erdogan Roots Out 'Virus'.\" \r\n    17 July 2016.", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]