["The claim was shared on January 29, 2020, on this Facebook page belonging to popular Nigerian entertainer and activist Charles Oputa, also known as Charly Boy. His page has more than 100,000 followers.", "The post’s caption reads in part: “Hundreds of Chinese left Nigeria for China to celebrate their annual festival – Lunar New Year – to return next week. At the moment over 300,000 Chinese are already infected with the coronavirus. The Federal Government should take serious precautions and preventive actions before we have an epidemic in Nigeria if some of them return with the Virus.”", "Nigeria is host to tens of thousands of Chinese expatriates. Anticipating returns following China's 15-day annual festival marking the start of the lunar calendar year, the government of the West African country is taking precautions against the fast-spreading coronavirus.", "The post, which has been shared more than 1,500 times, included three unrelated images. Reverse images searches show that they have been circulating on social media since 2003, accompanying stories about that year’s outbreak of Severe Acute Respiratory Syndrome (SARS), for example here.", "A similar claim was published on Facebook here, here and here, while this post claims more than “44,000 Chinese are already infected with coronavirus and 300,000 under watch.”", "As of February 4, 2020, 427 have been killed by a new strain of coronavirus since its emergence in late 2019, as reported by AFP.", "The new virus, temporarily named “2019-nCoV,” is in the “family of viruses that include the common cold, and viruses such as SARS and MERS,” according to the World Health Organization (WHO).", "China’s National Health Commission keeps a record of confirmed cases in a series of updates prepared by its Health Emergency Office on the new coronavirus infection.", "In the most recent update, Chinese health authorities had recorded a total of 20,438 confirmed cases as of February 3, 2020.", "“A confirmed case is a case where the person turns up at a clinic, a clinician takes a sample, and it is confirmed that the virus is present. We have the technology to confirm with a great degree of certainty whether it’s a yes or a no,” Dr Bharat Pankhania, Senior Clinical Lecturer at the University of Exeter Medical School, told AFP. “But there is no way on earth, when you have a widespread infection, that you are able to sample all cases.”", "According to the WHO, current estimates of the incubation period range from two to 11 days.", "“We don’t know the number of total infections; we think there are people who may not present to health care because they have only light symptoms,” Dr Antonia Ho, a Clinical Senior Lecturer and Consultant in Infectious Diseases at the University of Glasgow, told AFP. “There are modelling studies that present high numbers but these are often wildly variable at the start of an outbreak; they are predictions to allow governmental agencies to plan responses. In order to truly identify the number of infections, you would have to do a population study with blood tests to look for antibodies for the novel coronavirus.” She said she expected this to take place several months down the road.", "While no confirmed case has been recorded in Africa, countries in the continent, including Nigeria, are taking steps to combat the spread of the virus whose origin was traced to a wildlife market in the central Chinese city of Wuhan, as AFP reported here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]