["Katie McGinty has been the Democratic nominee for Pennsylvania Senate for all of three days, but the general election campaign between her and incumbent Sen. Pat Toomey has already begun.", "In a press release circulated Thursday, McGinty’s campaign -- running on the \"working families\" platform -- wrote that \"Pat Toomey advocated for eliminating all corporate taxes.\" It cited a 2007 CNBC interview in which Toomey, a Republican, said he was in favor of eliminating the tax burden on corporations.", "Eliminating all taxes didn’t sound like Toomey’s campaign platform. In fact, on his campaign website, Toomey has an entire section of his \"issues\" page dedicated to \"eliminating corporate welfare.\" So we decided to check the claim.", "In 2007, Toomey was a congressman from Allentown and the president of the Club For Growth, a conservative group that advocates for the reduction or elimination of corporate taxes. Toomey appeared on CNBC to discuss tax reform and cutting the corporate tax rate (the top marginal tax rate is 35 percent) which, he says in the interview, would stimulate the economy.", "\"I would disagree with the idea that we want to have a corporate tax burden at all,\" he says in the interview, going on to say: \"All it really does is it creates this insidious opportunity for politicians to play games, to create winners and losers, to have manipulative deductions and loopholes and write-offs. We shouldn’t have any of that. Let’s have a transparent system. Let’s not tax corporations. Let’s allow them to compete most aggressively on the global economy.\"", "When the interviewer skeptically asks Toomey if that type of reform would be possible in today’s political environment, he seems to acknowledge it’s a stretch, saying, \"a rational discussion can only lead to the conclusion that we should have a simpler tax code and rates, at a minimum, much lower. I’d prefer none on corporations. But much lower would be better.\"", "Toomey's campaign pointed out the senator's formally proposed tax plans have included lowering the corporate tax rate -- the highest in the developed world -- in a \"revenue neutral manner by eliminating tax loopholes.\" His budget proposals for fiscal years 2012 and 2013 lowered the corporate tax rate from 35 percent to 25 percent.", "The CNBC interview is one of the only examples of a time when Toomey advocated specifically for the full elimination of corporate income taxes; in front of Congress and in otherwise public appearances, he typically calls for a simple reduction in the tax.", "\"This old clip was simply a discussion about how higher taxes hurts job creation,\" Toomey's spokesman Ted Kwong said.", "His CNBC comments in 2007 don’t exactly jibe with what he wrote in his 2009 book \"The Road to Prosperity: How to Grow Our Economy and Revive the American Dream.\" In the book, Toomey wrote about two other tax systems he’d favor over our current one: A flat tax, which would require businesses pay a 17 percent tax on income (a decrease from the current 35 percent), and a \"fair tax,\" which would totally eliminate corporate and income taxes in favor of a sales tax. Still, he writes, \"my preference lies with the flat tax.\"", "Toomey’s campaign website notes the senator \"supports closing special-interest loopholes and lowering rates for all Americans,\" but doesn’t mention lowering or eliminating taxes on corporations.", "Decreasing or eliminating corporate taxes is a tough sell. A 2014 Gallup poll showed two thirds of Americans think corporations \"pay too little\" in taxes. Despite that, reducing the corporate tax rate has some bipartisan backing. In 2012, President Obama proposed reducing the rate to 28 percent.", "Our ruling", "McGinty’s campaign says Toomey \"advocated for eliminating all corporate taxes.\" While he told CNBC back in 2007 \"Let’s not tax corporations\" and his book mentions it as one of his two favored tax plans, the incumbent Senator seems to know that corporate taxes aren’t going away completely anytime soon. While it's true he’s most recently advocated for a lower tax rate and a simplified system, he did tell CNBC viewers he’d prefer no tax at all. We rate the claim True.", "Book, \"The Road to Prosperity: How to Grow Our Economy and Revive the American Dream.\" Patrick J. Toomey. Accessed via Google Books April 28, 2016.", "Email, Josh Levitt. Katie McGinty for Senate. April 28, 2016.", "Email, Ted Kwong. Toomey for Senate. April 28, 2016.", "News article, \"Obama proposes lowering corporate tax rate to 28 percent.\" Washington Post. Feb. 22, 2012.", "Poll, Gallup. \"As Taxes Rise, Half in U.S. Say Middle-Income Pay Too Much.\" April 14, 2014.", "Press release, \"Pat Toomey Has Left Working Families Behind.\" Katie McGinty for Senate. April 28, 2016.", "Video, \"Cutting the Corporate Tax Rate.\" YouTube. Jul. 21, 2007.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]