["The purported list was published here on a Facebook group with more than 137,000 followers on June 25, 2020. The post has been shared more than 140 times.", "The image in the post features the logo and name of Taiwan’s Ministry of Justice in both Chinese and English at the top.", "The traditional Chinese text in bullet form under the logo translates to English as: “Ministry of Justice imposes the following restrictions on Hong Kong citizens applying to emigrate to Taiwan\n\t\"1. Only accept family reunion applications from people with immediate family in Taiwan \n\t\"2. Only accept applications from professionals\n\t\"3. Only accept significant investors”.", "The Facebook post's caption translates to English as: “Tsai Ing-wen [President of Taiwan] has taken action to close the back door! / You are dead!”", "China imposed a new national security law on Hong Kong on June 30, 2020. Since major pro-democracy protests began in the territory last June, some Hong Kong residents have sought new lives abroad, with many turning to nearby democratic Taiwan, according to this AFP report.", "The image was also shared on Facebook here and on Twitter here alongside a similar claim.", "The claim, however, is misleading. The purported requirements for permanent residency listed in the posts are not a comprehensive list of immigration requirements stipulated by the Taiwanese authorities as of July 2020. There are multiple other pathways for Hong Kong citizens to become either residents or permanent residents of Taiwan, according to guidelines published by the Taiwanese government.", "In response to the misleading posts, a spokesperson for Taiwan’s National Immigration Agency told AFP in an email on June 30: “There’s no such information”.", "A spokesperson for Taiwan's Ministry of Justice also said the posts were \"false\" in an email to AFP on June 29.", "As of July 2020, a Hong Kong or Macau permanent resident can apply for recidency in Taiwan under 16 circumstances, according to Article 16 of these Taiwanese immigration regulations.", "They can be seen in the screenshots below:", "Information for permanent residents of Hong Kong and Macau who wish to apply for residency in Taiwan has also been published here by the Taipei Economic and Cultural Office in Hong Kong. According to the website, the page was last updated on June 9, 2020.", "The list includes other conditions for residency in Taiwan that are not listed in the misleading claim, including people seeking protection for political reasons and those who plan to carry out religious work across the island.", "Requirements for Hong Kong and Macau permanent residents to apply for registered permanent residence are listed here under Article 29. They can also be seen in the screenshot below:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]