["About this rating", "It may not come as a surprise that teens sometimes do outrageous things in front of a camera, like making a goofy face while flipping the middle finger. One such picture of a newly elected municipal official in Maine, however, was used by internet trolls in an attempt to intimidate her prior to the 2019 general election.", "Safiya Khalid, 23, handily won a seat on the Lewiston City Council, making her the youngest person and also the first Somali American to hold that office. Like fellow elected official and fellow milestone-setting Somali American, U.S. Rep. Ilhan Omar, D-Minn., Khalid has been the target of an ongoing campaign of threats and harassment by racist internet trolls.", "Trolls attacked Khalid by posting her home address online and sending her messages stating that she did not belong, among other things. One line of attack was to post a meme containing an image of Khalid from nearly a decade ago, when she was just 15 (as reported by the Associated Press), making a face at a camera while raising her middle finger. The picture was shared with a vaguely ominous message that urged viewers to \"make her famous.\"\n\nThe purported \"audio and video proof\" of Khalid \"harassing another candidate\" mentioned in the meme, meanwhile, is actually a recording of a Democratic political leader in Lewiston confronting Khalid's political opponent. It was not Khalid.", "Because the picture above was taken when Khalid was a child but was intended as a misleading political attack against her as an adult political candidate, we are labeling this claim \"Outdated.\"", "Associated Press. \"Somali Who Was Target of Threats Wins US Municipal Election.\"\r\n  6 November 2019.", "Keefe, Josh. \"Lewiston Democrats Feud Over Recording Candidate Says He Took of Party Chair at His Door.\"\r\n  Bangor Daily News. 2 November 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]