["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "During a speech in which he delivered his 2013-'15 state budget, Gov. Scott Walker said a constituent had sent him a card thanking him for lowering his property taxes.", "Soon it will be December and time for presents -- including your annual property tax bill.", "Oh, the suspense in opening the envelope: Will this year’s bill be lower or higher?", "But wait. On Oct. 24, 2013, Republican Gov. Scott Walker used his weekly radio address to herald a $100 million property tax relief bill he signed into law four days earlier.", "Relief means lower taxes, right?", "After we heard the opening lines of the Democratic response, put out the same day, we weren’t sure what to think.", "\"Last week, the Legislature passed Gov. Walker’s so-called property tax relief bill,\" Ashland state Rep. Janet Bewley said in her address. \"Lost in all the hype is the fact that the governor and Republican-controlled Legislature are still raising your property taxes.\"", "So, is the property tax relief real? Is it somehow superseded by property tax increases? And don’t school districts and other local governments help determine how big your property tax bill is?", "Property tax primer", "We’ll start by reviewing how a property tax bill comes to be.", "Every fall, each local unit of government -- cities, villages, towns, counties, school districts, and technical college districts -- adopts a budget for the following year. They subtract what they expect to receive in revenue, such as state aid, license fees, tuition, etc. The remainder has to come from property taxes, which happens to be the largest source of tax revenue in Wisconsin.", "In total, local governments levy more than 99% of all property taxes; the state claims the last sliver, for forestry programs.", "Nevertheless, state government plays an important role in how much your property tax bill turns out to be.", "First of all, the local governments’ levies get reduced by three state tax credits, including the state lottery credit.", "Second, the state has imposed a variety of caps on how much money local governments can raise or spend. So, even though the locals are the ones levying property taxes, the state puts strict limits on how much they can levy.", "For example, school districts are limited in the amount of money they can raise in total from property taxes and state aid. On the other hand, school districts can exceed their limits if voters approve a referendum. For municipalities and counties, their levy growth, if any, is limited to the amount of property taxes generated by new construction in their communities.", "The new law", "Reining in property taxes has been one of Walker’s priorities as governor. On Oct. 10, 2013, citing growth in state tax revenue, he called a special session of the Legislature to take up property tax relief -- specifically by increasing state aid to school districts.", "So, the approach was not a simple across-the-board tax reduction.", "The property tax relief measure was approved overwhelmingly on bipartisan votes -- 82-12 in the Assembly, with Bewley among the Democrats voting for it, and 28-5 in the Senate. The law raises state aid payments to school districts by $40 million (0.92%) in 2013-’14 and $60 million (1.36%) in 2014-’15.", "But, as we discussed earlier, school districts are under revenue limits. So, while individual levies for school districts will vary, statewide the additional $100 million in state aid to school districts triggers a corresponding $100 million decrease in property taxes.", "State schools Superintendent Tony Evers pointed out that while the new law \"provides property tax relief for some school districts, it does not increase spending for public schools.\"", "Now, to Bewley’s claim that Walker and the GOP-run Legislature are \"still raising your property taxes.\"", "The state budget", "In her radio remarks, Bewley argued that despite the property tax relief, the average person’s property taxes will rise.", "When we asked for evidence, her office cited an October 2013 memo from the nonpartisan Legislative Fiscal Bureau. It takes into account not only the property tax relief, but also the 2013-’15 state budget that Walker signed into law several months earlier.", "In contrast to the property tax relief bill, the state budget was adopted without a single Democratic vote. It passed 55-42 in the Assembly, with three Republicans voting no; then it passed 17-16 in the Senate, with one Republican voting no.", "According to the fiscal bureau, the property tax for a median-valued home -- $151,148 -- was $2,943. Under the biennial state budget, the tax was to drop by $5 in the first year, then increase by $36 in the second. That put the tax bill on the typical home at $2,974 -- a net increase of $31 over the two years.", "But with the property tax relief law, the tax on the typical home is now estimated to go down by $18 in the first year and increase $29 in the second. That would put the tax bill at $2,954 -- a net increase of $11.", "Walker spokesman Tom Evenson agreed with the figures, but noted that property tax increases have been held down under during Walker's first two years in office.", "He cited an August 2013 Wisconsin Taxpayers Alliance report that said total property taxes, not just the portion levied by school districts, rose by 0.2% in 2011-’12 and 0.8% in 2012-’13. That was the first time since at least 1946 that the total levy rose by less than 1% in two consecutive years, the report said.", "Our rating", "Bewley said \"the Legislature passed Gov. Walker’s so-called property tax relief bill,\" but the Republicans \"are still raising your property taxes.\"", "Bewley’s right that under the Republicans’ 2013-’15 state budget, it’s estimated that property tax bills will rise, by an estimated $11 over two years for a typical home. But the increase would have been larger without the property tax relief, and property tax bills are affected by actions taken by local governments, not just the GOP-controlled state government.", "For a statement that is partially accurate but leaves out important details, we give Bewley a Half True.", "If you would like to comment on this item, you can do so on the Journal Sentinel’s web page.", "WisPolitics, Democratic weekly radio address, Oct. 24, 2013", "State Rep. Janet Bewley, news release, Oct. 18, 2013", "Milwaukee Journal Sentinel, \"Scott Walker signs fast-tracked $100 million property tax relief bill,\" Oct. 20, 2013", "Milwaukee Journal Sentinel, \"Assembly OKs budget with income tax cuts, sweeping changes,\" June 19, 2013", "Milwaukee Journal Sentinel, \"Budget passes by one vote as vouchers take center stage,\" June 21, 2013", "Wisconsin Department of Revenue, \"2013 Guide for Property Owners,\" January 2013", "Wisconsin Legislature, Act 46", "Wisconsin Legislative Fiscal Bureau, \"Property Tax Administration,\" January 2013", "Wisconsin Legislative Fiscal Bureau, \"Local Government Expenditure and Revenue Limits,\" January 2013", "Wisconsin Legislative Fiscal Bureau, \"Property Tax Level in Wisconsin,\" January 2013", "Wisconsin Taxpayers Alliance, news release, Aug. 19, 2013", "Wisconsin Department of Revenue, Act 46 fiscal estimate, Oct. 15, 2013", "Wisconsin Department of Public Instruction, Act 46 fiscal estimate, Oct. 15, 2013", "Wisconsin Department of Public Instruction, news release, Oct. 23, 2013", "Interview, Wisconsin Assistant State Superintendent of Public Instruction Brian Pahnke, Oct. 31, 2013", "Email interview, Wisconsin Council on Children and Families’ Wisconsin Budget Project director Jon Peacock, Oct. 31 and Nov. 4, 2013", "Email interview, state Rep. Janet Bewley staff member Joseph Hoey, Oct. 25 and Nov. 4, 2013", "Wisconsin Legislative Fiscal Bureau, memo, Oct. 11, 2013", "Wisconsin Legislative Fiscal Bureau, memo, Oct. 15, 2013", "Wisconsin Taxpayers Alliance, \"Tax cut by school district,\" Oct. 17, 2013", "Interview, Wisconsin Taxpayers Alliance research director Dale Knapp, Nov. 4, 2013", "Email interview, Wisconsin Taxpayers Alliance president Todd Berry, Nov. 4, 2013", "Email interview, Gov. Scott Walker press secretary Tom Evenson, Oct. 29, 2013", "Associated Press, \"Property tax cuts expected in 2014 and 2015,\" Oct. 15, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]