["BJP’s Krishnanagar candidate Kalyan Chaubey, a former Indian football player, tweeted a video of two men assaulting a woman and subsequently hacking another man with a sickle. He claimed that the perpetrators were “TMC goons” and the man who was ruthlessly attacked was “BJP worker Sagar Roy” from West Bengal. Chaubey later deleted his tweet but not before it received nearly 30,000 views in less than two hours.", "Twitter handle @being_humour was among those who quote-tweeted Chaubey’s tweet and later took it down.", "The video was earlier tweeted by the handle Sirf News (@SirfNewsIndia), drawing over 20,000 views. In the 44-second clip, one of the men is holding down a person, while another man comes to attack him with a sickle. A woman, while attempting to stop the man with the weapon, is also beaten and thrown around. The last few seconds of the video shows both the men taking turns to hack the victim. Sirf News taken removed the tweet.", "The video has been also been shared on Facebook.", "Before BJP Bengal leader Kalyan Chaubey deleted his tweet, several users had pointed out in the comments that the video was not from West Bengal but from Bhagalpur, Bihar. Alt News corroborated this information with local media reports. The video depicted an incident that took place on April 16. A father, along with his younger son, hacked his elder son to death with a sickle, reported Prabhat Khabar.", "The report added that the violence erupted over a family dispute. The accused father, Shivnarayan Mandal, told the police that his elder son, Suresh, would often come home inebriated and abuse the family members. On April 16, he came home drunk and began attacking his parents with a sickle, according to the father’s statement. The younger brother, Ashish, snatched the sickle from Suresh’s grasp and attacked him in the defence of his parents.", "Suresh’s wife, however, gave an entirely different statement to the cops. As per the wife, her husband was attacked over a property dispute. Other media outlets – Dainik Bhaskar, Dainik Jagran, Bhagalpur Live – had also reported the incident.", "A couple of minutes after taking down his tweet, BJP leader Chaubey tweeted a news report of poll violence in West Bengal. According to the News18 article shared by Chaubey, a Congress activist was hacked to death outside a booth. Nine others, including a BJP worker Sagar Roy, was among the injured. This incident was in no manner connected to the video uploaded by Chaubey. He tweeted an unrelated news report without clarifying for the earlier clip he claimed depicted ‘Sagar Roy’ being attacked.", "Two women BJP supporters were also roughed up allegedly by the TMC workers in Domkal while one Sagar Roy (BJP worker) was beaten up at North Malda’s Sasan area for raising voice against booth capturing. https://t.co/I23dlr3fiT", "— Chowkidar Kalyan Chaubey (@kalyanchaubey) April 26, 2019", "Recently, another video was falsely shared as a TMC minister pulling out a gun on live TV. West Bengal chief minister Mamata Banerjee was also targeted using a misleading clip posted by BJP Bengal.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]