["A photograph of Navi Mumbai-based self-proclaimed labour leader and activist Vinay Dubey, along with a man and a woman, was posted by one Shiv Yadav on Twitter. Yadav claimed that Dubey’s mother had married a Muslim man (his father) named Mahmood.", "Dubey was arrested along with 10 others including ABP Majha reporter Rahul Kulkarni by the Mumbai police for their alleged role in “rumour-mongering” that led to a mass gathering of migrant workers at Bandra station. He had reportedly made a video which went viral where he asked migrants to assemble at Kurla railway terminus on April 18. While Kulkarni was granted bail by a court in Mumbai, Dubey has been remanded to police custody till April 21.", "“Vinay Dubey’s mother married a Muslim, Vinay Dubey father’s name is Mahmood. He was deliberately named Vinay Dubey so that many Hindu brothers and sisters could be misled to think of him as a Hindu Brahmin. The is an important tactic of Jihadis to damage Hindutva and country,” tweeted Yadav on April 16. While Yadav later clarified that the information shared by him was incorrect, his original tweet was retweeted more than 1,100 times.", "Facebook user Vinubhai Patel posted the photograph with the same narrative. His post has garnered over 19,000 shares so far.", "Many other people on Twitter and Facebook shared the same message with the photo.", "Alt News found that the claim made along with the image is false. With a Google search, we found the personal details submitted by Dubey when he had filed a nomination for the Kalyan Lok Sabha seat in the 2019 general elections. As per MyNeta’s database, Vinay Dubey’s father’s name is Jatashankar Dubey and not Mahmood as claimed on social media.", "Moreover, fact-checking outlet SMHoaxslayer found that the photo which is now viral was posted from Dubey’s Facebook profile in February 2020. The photo is from a CAA protest in Patna, Bihar. It is very likely that the man and the woman are protesters.", "On April 15, Times Now had identified Vinay Dubey as an NCP leader, however, NCP’s national spokesperson Nawab Malik refuted the claim and said that Dubey is not a member of the party.", "This is to make it clear that the man Vinay Dube arrested by @Navimumpolice and later by @MumbaiPolice is not a member of the NCP. Some sections of News Media are calling him an NCP leader, which is false and appears to be a malicious campaign to malign the image of our party.", "— Nawab Malik نواب ملک नवाब मलिक (@nawabmalikncp) April 15, 2020", "It is worthwhile to note here that Vinay Dubey’s father Jatashankar Dubey who is an auto-driver had donated Rs 25,000 to Maharastra’s Chief Minister Relief Fund to help tackle the COVID-19 outbreak in the state. Vinay Dubey had quote-tweeted a tweet by Maharastra’s Home Minister Anil Deshmukh on April 10.", "💪मुझे गर्व है मेरे पिताजी पर💪 मेरे पिताजी ने महाराष्ट्रा सरकार को कोरोना से लडने के लिए अपने जिवन की सेविंग मे से कुछ राशी अनुदान किया !! गृहमंत्री @AnilDeshmukhNCP जी ने खुद मिलकर यह अनुदान स्विकारा !! धन्यवाद @OfficeofUT सहयोग के लिए आभार @MantralayaRoom टिम🙏@AUThackeray https://t.co/RuJctTnNGA", "— Vinay Dubey Mumbai (@The_vinaydubey) April 10, 2020", "In conclusion, an old photograph of Vinay Dubey was shared with the false claim that his father was a Muslim and that he concealed his identity to mislead the Hindu community.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…"]