["By Angelo Fichera", "Posted on July 25, 2018", "Q:  Did Fox News reveal that President Obama rigged the 2016 election with “4 million illegal votes”?", "A: No. That falsehood is based on a pre-election interview with an election lawyer who discussed the possibility of votes being cast on behalf of dead people.", "An old headline that again surfaced on Facebook in recent days revived a false claim about widespread voter fraud in the 2016 presidential election.", "“FOX NEWS JUST CONFIRMED OBAMA RIGGED ELECTION WITH 4 MILLION ILLEGAL VOTES,” reads the July 21 headline on topalertnews.com.", "But the post originated weeks before the 2016 election took place and speculated about the potential for widespread voter fraud in the presidential election. There is no evidence, however, that it actually occurred.", "At the heart of the lingering story is an October 2016 exchange between “Fox & Friends” host Steve Doocy and J. Christian Adams, a former voting section attorney with the U.S. Department of Justice. Doocy asked Adams about cases of fraudulent voting, namely votes he said were cast by deceased individuals still on voter rolls.", "During the interview, Adams said: “Now we have 4 million — 4 million, Steve — ineligible and dead voters on American voter rolls, according to the Pew Charitable Trust. That’s too many, and it’s going to affect the election.”", "While Adams raised the issues of voter eligibility and outdated registrations — and how they could affect the vote tally — his comments didn’t offer any actual evidence that “4 million illegal votes” were cast in the 2016 election (which, again, hadn’t yet occurred at the time of the interview).", "Adams was likely referring to a 2012 study by the Pew Center on the States — “Inaccurate, Costly and Inefficient: Evidence That America’s Voter Registration System Needs an Upgrade” — which found that 1.8 million deceased people were still listed as eligible voters and that 2.75 million people were registered to vote in multiple states.", "However, the study did not find evidence of actual voter fraud due to those issues, as its primary author, David Becker, has previously noted. Rather, it said voter rolls are “susceptible to fraud” and could create “the perception that they lack integrity.”", "Voting experts have told us previously that fraudulent ballots cast in the name of dead registered voters is mostly a myth and extremely rare.", "After winning the election, President Donald Trump repeatedly made unsupported claims of voter fraud — sometimes by misrepresenting what the Pew study said.", "In November 2016, Trump tweeted: “In addition to winning the Electoral College in a landslide, I won the popular vote if you deduct the millions of people who voted illegally.”", "The president went on to establish the short-lived Presidential Advisory Commission on Election Integrity — which was to examine “fraudulent voting,” among other issues. It was dissolved just months after it was created, and there has been no evidence to date of widespread fraud.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "Farley, Robert. “Trump’s Bogus Voter Fraud Claims.” FactCheck.org. 19 Oct 2016.", "Farley, Robert. “More Trump Deception on Voter Fraud.” FactCheck.org. 26 Jan 2017.", "“FOX NEWS JUST CONFIRMED OBAMA RIGGED ELECTION WITH 4 MILLION ILLEGAL VOTES.” Topalertnews.com. 21 Jul 2018.", "“Inaccurate, Costly, and Inefficient: Evidence That America’s Voter Registration System Needs an Upgrade.” The Pew Center on the States. February 2012.", "“Presidential Advisory Commission on Election Integrity.” WhiteHouse.gov. Accessed 24 Jul 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]