["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Fox News commentator Sean Hannity tried to create voter-fraud outrage when he singled out a tweet by Democratic congresswoman Ilhan Omar, expressing shock that she was encouraging non-registered residents to vote.", "But in the tweet, Omar clearly referenced same-day registration, reminding Minnesota residents that state law allows them to register at the polls.", "Fox News commentator Sean Hannity posted a deceptive tweet on Election Day, expressing shock that Democratic U.S. Rep. Ilhan Omar told Minnesota residents they didn’t need to be registered in order to vote.", "\"NOT A JOKE: Ilhan Omar Tells Residents ‘You Don’t Have to be Registered to Vote’ in Minnesota,\" Hannity posted with a link to a story on his website that shares the same headline.", "The article says that Omar \"shocked\" users on social media when she claimed ‘You don’t have to be registered to vote in Minnesota’ because the state has ‘same day registration at the polls.’\"", "The expression of shock and the headline’s inclusions of \"NOT A JOKE\" suggests that what Omar said was wrong, and that it is not legal to vote without prior registration in Minnesota.", "That’s inaccurate.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Omar tweeted a link to iwillvote.com, a Democratic voter registration website, and said that Minnesota residents who aren’t already registered can do so at the polls.", "You don’t 👏🏾 have to 👏🏾 be registered 👏🏾 to go vote👏🏾 in Minnesota 👏🏾 we have 👏🏾 same day 👏🏾 registration 👏🏾 so you 👏🏾 can register 👏🏾 at the polls 👏🏾 https://t.co/iJGlm7Rgih 👏🏾", "Omar clearly referenced same-day registration, not voting without registration. This is backed up by state law, which says that voters who have not previously registered to vote using their current Minnesota address may register at the polling place on Election Day with proper identification.", "Omar responded to Hannity’s tweet, saying \"Where is the lie, we are proud to have same-day registration here in the great state of Minnesota. Access to the ballot box is a priority for us, I know it's a hard concept for republican to understand.\"", "The state allows same-day registration, which is what Omar referenced. Hannity’s claim is False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Twitter, Sean Hannity tweet, Nov. 3, 2020", "Hannity.com, NOT A JOKE: Ilhan Omar Tells Residents ‘You Don’t Have to be Registered to Vote’ in Minnesota, Nov. 3, 2020", "Twitter, Ilhan Omar tweet, Nov. 3, 2020", "Minnesota Secretary of State, Minnesota’s Voter Eligibility and Identification Requirements, Accessed Nov. 3, 2020", "Business Insider, Sean Hannity falsely claimed Ilhan Omar engaged in voter fraud. He didn't realize the state has same-day voter registration., Nov. 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]