["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Martin O'Malley appeared on the Daily Show with Trevor Noah on Oct. 19, 2015.", "In a recent appearance on Comedy Central’s Daily Show, Democratic presidential candidate Martin O’Malley doubled down on prior attacks on Hillary Clinton for being too close to Wall Street.", "While O’Malley charged Clinton with flip-flopping on a variety of issues close to progressives’ hearts, he said she hasn’t cut ties to Wall Street, which is based in New York, a state she used to represent in the Senate. O’Malley said Clinton doesn’t have the \"independence\" to protect Main Street from the excesses of big banks.", "\"There were many things that she changed positions right before the debate… whether it was the Trans-Pacific Partnership or whether it was Keystone,\" O’Malley said on Oct. 19. \"But she couldn't bring herself to say we need to separate commercial banking from the speculative banking, namely reinstating Glass-Steagall, because she can’t.\"", "We decided to take a closer look at O’Malley’s claim that Clinton \"couldn't bring herself to say we need to separate commercial banking and speculative banking, namely reinstating Glass-Steagall.\"", "First, a refresher on the Glass-Steagall Act: It was passed in the wake of the Great Depression to keep commercial banking and investment banking separate, as a way of protecting the broader economy from the downside of speculation. As we noted in a previous fact-check, the law was whittled down over the years, until President Bill Clinton fully repealed it in 1999.", "Since the most recent financial crisis hit, reining in big banks and other financial institutions has been a rallying cry for the progressive wing of the Democratic Party. But is it true that Clinton doesn’t echo that cry?", "For starters, Clinton’s formal Wall Street reform plan doesn’t include reinstating Glass-Steagall or reintroducing its provisions. Based on her recent comments, as cited by both the O’Malley and Clinton camps, that’s because she thinks reinstatement of Glass-Steagall is a red herring. Here are a few examples:", "• July 23 at a campaign event in South Carolina: When asked why her economic policy doesn’t include reinstating Glass-Steagall, Clinton responded, \"This is a much more complicated issue than to point at any one piece of legislation and say if we just pass that, everything would be fine. Our first goal has to be to implement fully and effectively Dodd-Frank,\" referring to the landmark act signed by President Barack Obama that created a consumer protection agency and imposed regulations on financial institutions.", "• Sept. 29 in an interview with actress and writer Lena Dunham: \"Some people say all we have to do is break up the banks. Well, the problem with that is, the banks did their fair share of trouble, but a lot of the problems were not from these traditional banks. They were from what’s called the shadow banking world. ...So I think we’ve got to be more comprehensive.\"", "• Oct. 6 at the first Democratic primary debate: \"Well, my plan is more comprehensive (than reinstating Glass-Steagall). And frankly, it's tougher because of course we have to deal with the problem that the banks are still too big to fail.\"", "• Oct. 8 in a column for Bloomberg: \"One serious approach being advocated is to pass an updated Glass-Steagall Act, separating commercial and investment banking, to reduce the size of the banks and the risk of a taxpayer bailout. I certainly share the goal of never having to bail out the big banks again, but I prefer the path of tackling the most dangerous risks in a different way.\"", "• Oct. 16 at a town hall in Keene, N.H.: \"I fully respect my colleagues who have said let's reinstate Glass-Steagall. And if I thought that alone would prevent the potential next crisis, I'd raise my hand and join, but that's not my assessment. ...Glass-Steagall wouldn't do anything about it, if it were reinstated tomorrow.\"", "In short, Clinton has tip-toed around the issue. She’s expressed skepticism that reimposing Glass-Steagall, or something close to it, would solve the problems stemming from financial regulation. However, she argues that attacking the problem differently — for example, by imposing a \"risk fee\" on the financial institutions with assets over $50 billion, regulations on the \"shadow banking\" sector (i.e. hedge funds) and guidelines for prosecuting financial wrongdoing  — would actually be a more effective response.", "Our ruling", "O’Malley said that Clinton \"couldn't bring herself to say we need to separate commercial banking and speculative banking, namely reinstating Glass-Steagall.\"", "Clinton’s Wall Street reform plan does not say it would reimpose Glass-Steagall, and she’s repeatedly downplayed the idea that it should be revived. However, Clinton argues that her alternative course would be more comprehensive and effective than simply reimposing the old law.", "O’Malley’s claim is accurate but needs additional context, so we rate it Mostly True.", "Daily Show, Martin O'Malley, Oct. 19, 2015", "Email interview with Haley Morris, spokesperson for Martin O’Malley, Oct. 20, 2015", "Email interview with Josh Schwerin, spokesperson for Hillary Clinton, Oct. 20, 2015", "PolitiFact, Bill Clinton: Glass-Steagall repeal had nothing to do with financial crisis, Aug. 19, 2015", "Hillary Clinton, Hillary Clinton: Wall Street Should Work for Main Street, Oct. 8, 2015", "Youtube, \"Clinton Won't Endorse Reinstating Glass Steagall,\" July 23, 2015", "Youtube, \"The Lenny Interview: Hillary Clinton on Occupy Wall St,\" Sept. 29, 2015", "Washington Post, \"The CNN Democratic debate transcript, annotated,\" Oct. 13, 2015", "Bloomberg, \"My Plan to Prevent the Next Crash,\" Oct. 8, 2015", "C-SPAN, \"Hillary Clinton on Glass-Steagall,\" Oct. 16, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]