["About this rating", "On 31 July 2018, the liberal Facebook page The Other 98% shared a meme reporting that a man who followed an African-American driver to his home to call him a racial slur after a traffic incident had his business destroyed as a result of being caught on video doing so:", "The meme was no different than most in that it was a facile representation of a series of news stories about a late July 2018 incident in Columbus, Ohio, involving racism and road rage. Charles Lovett, who is African-American, told reporters Jeffrey Whitman, a white man, followed him on his drive home because Whitman believed Lovett had cut him off near Interstate 71. Lovett took cell phone video that showed Whitman stopped in front of Lovett's driveway, and as the two argued over the incident, Whitman called Lovett the N-word several times.", "But Whitman didn't pursue and harass Lovett in his personal vehicle ... he did so in a company van that had the name of his business (Uriah's Heating, Cooling & Refrigeration) and phone number emblazoned on its side:", "The video resulted in an outpouring of public fury, but we were unable to immediately confirm whether Uriah's Heating, Cooling & Refrigeration has in fact gone out of business. Whitman still has an active business license, according to Ohio state records, but his business has lost its accreditation with the Better Business Bureau as a result of the incident. On 15 August 2018, the Better Business Bureau reported Whitman alerted them that his business had closed.", "The quote attributed to Whitman in the meme was taken from a 29 July 2018 column in the Columbus Dispatch penned by Theodore Decker. Decker said the comment was made in a voice message that Whitman left him:", "“It was an awful mistake and obviously I don’t know how to explain it, and it’s ruined my life and it’s ruined my family’s life,” Whitman says.", "He says this in a voicemail left for me on Thursday, two days after he most definitely didn’t apologize when confronted by a local television reporter.", "Now, in this message, he sounds despondent.", "“I’m out of business, I’m completely out, I’m done, I’ll never work in Columbus again,” he says. “This has completely and thoroughly ruined my life.” The message ends abruptly.", "We tried reaching out to Whitman by telephone and Facebook messenger but received no response from him about the status of his business.", "On 25 July 2018, Whitman issued an apology to Lovett, writing:", "I apologize for my use of the n word towards Charles Lovett on Tuesday, July 24th. I understand that using the n-word was not only hurtful towards Lovett as an individual, but hurtful towards the Black community at large. Using the word was dehumanizing, unacceptable, and inexcusable. My actions reflect an unhealthy mindset I have developed and I need to work to change. I have served the Black community for the last 9 years, installing furnaces and water heaters with pride. My actions that day are not a reflection of my feelings towards the Black community. I also understand that racial tensions in America are higher than before, and I regret my part in contributing to that tension. I realize that words are hollow without action, and because of the hurt I have caused, I hope I have the opportunity to give back to the Black community that I have harmed in a meaningful way.\"", "Lovett, for his part, said he could not accept Whitman's apology because a day earlier in a television interview with local TV station WCMH, Whitman said he had no regrets \"whatsoever\" for what he said because he \"grew up with it and it's not a big deal for me.\"", "The phrase, \"I really don't care do u?\" at the bottom of the meme is a play on a jacket worn by First Lady Melania Trump as she boarded a plane to visit facilities sheltering migrant children who had been taken from their parents under President Trump's \"zero tolerance\" immigration policy.", "Decker, Theodore. \"Racist Words Blow Back on Man, Family and Business.\"\r\n    Columbus Dispatch.   29 July 2018.", "WSYX/WTTE.   \"'You're a Rude N-----:' Contractor Calls Black Man Racist Slur During Confrontation.\"\r\n    24 July 2018.", "Sneed, Rob.   \"Driver Unapologetic After Road Rage Confrontation Filled with Racial Slurs.\"\r\n  WCMH-TV.   24 July 2018.", "This article has been updated to note that a Facebook page bearing the name of Whitman's business is likely not authentic.", "Article updated to note that the business had closed, per the Better Business Bureau.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]