["A Facebook post, which we archived here before it was deleted, was shared 3,600 times and included a string of “horror face” emojis in response to the claim.", "The claim itself appears in news headlines strap at the foot of the image and reads: “No one passes grade 12 exams - 2019.”", "Similar posts have been shared multiple times here and here on Facebook.", "However, a reverse image search of the screenshot using Yandex leads to the original YouTube video and thumbnail of the broadcast as it appeared before the superimposed text was added.", "The original headline strap contained this headline: “Remove trade barriers - Fundanga”. The video from October 25, 2018 was posted on the Zambia National Broadcasting Corporation's YouTube channel.", "A few obvious differences make it clear the static image was doctored:", "The claim fails because when it was posted on January 15, Zambia’s grade 12 results were still outstanding, while grade 7 and grade 9 results were released on December 31, 2019.", "According to 5fm Radio Zambia and the Education Ministry’s public relations officer, the grade 12 results are anticipated early in February.", "“Minister [David Mabumba] indicated in a press briefing we had last week that the results will be out by the first week of February. So those reports are unfounded and must be disregarded by all well-meaning media,” said Annita Nachilima via a WhatsApp message.", "In response to a question from the media at the same January 14 press briefing, the director for the Examination Council of Zambia, Michael Chilala, said the delay was caused by a lack of finances, meaning exam markers could not be paid.", "Money was eventually sourced to allow marking to go ahead.", "“We had a bit of a challenge in terms of financing -- we started marking because the finances were found - we are likely to have the results, latest the first week of February,” said Chilala in an audio recording of the briefing sent to AFP.", "The 2018 pass rate for grade 12 learners was 63.44 percent.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]