["On July 8, Sunita Yadav, LR (Lok Rakshak Dal) constable reprimanded the son of Gujarat Health Minister Kumar Kanani for breaking curfew in Surat, Gujarat. The video of this incident was viral on social media with a lot of praises coming the policewoman’s way. A Twitter handle @yadavsunita143 began posting several tweets in support of Sunita Yadav since July 12. That same day at 4 pm, it wrote, “I thought it appropriate to resign from the job rather than apologise to the son of a minister. Thank you for all your support. (ने एक मंत्री के बेटे से माँफी माँगने के बजाय नौकरी से इस्तीफा देना उचित समझा। आप सभी के समर्थन के लिए शुक्रिया।)” At the time of writing this article, the tweet was liked more than 62,000 times and retweeted more than 16,000 times.", "The number of followers of this account doubled in a few days. It currently has more than 20,000 followers. In the replies of the above tweet, several users have congratulated Sunita Yadav for her work. Reading the comments section, it seems clear that people are believing this handle is the official handle of constable Sunita Yadav.", "The account carried the word ‘parody’ in both its username and bio. This was later changed to only read “sunita Yadav constable Gujarat police”.", "We also found that the username of the account used to be ‘@RealKomalMeena’ which was changed to ‘@RealKomalMahar’ on June 25.", "This slideshow requires JavaScript.", "Later in July, the account again changed its username to ‘@Yadavteju111’.", "It is worth noting that @yadavsunita143 frequently posts follow-back requests by commenting on tweets of politicians, actors and prominent individuals.", "This slideshow requires JavaScript.", "The handle @yadavsunita143 is, therefore, an imposter account of Gujarat police constable Sunita Yadav.", "The handle had tweeted a screenshot of its homepage in October 2019 which reveals its earlier username, @alokyadav521. The bio makes a follow request for @alokyadav58.", "That @alokyadav521 and @alokyadav58 are the same people is proved by the tweets below.", "This slideshow requires JavaScript.", "The handle @yadavsunita143 is therefore run by the same person who runs @alokyadav58. @yadavsunita143 gained followers on Twitter by posting the same tweet on replies to politicians with ‘Yadav’ surname, especially those of Samajwadi Party (SP). A quick scroll of the timelines of @alokyadav58 and @yadavsunita143 shows that they regularly share tweets favouring SP.", "There are several other fake handles running in Sunita Yadav’s name — @sunita_yadav123, @Sunitayadav1143 और @GPsunitayadav. The constable took to Facebook to clarify the same and said that she will inform in case she makes an account on Twitter.", "Sunit yadav नाम से जो एकाउंट ट्विटर पे चल रहा है। वो मेरा नही है। जो ट्वीट मेरे नामसे हो रहे है उसकी जिम्मेदारी मेरी नही है। अगर मेरे कोई एकाउंट होगा तो में जानकारी दूँगी।", "– सुनिता यादव", "Posted by Sunita Yadav on Monday, 13 July 2020", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]