["A Facebook post claiming the anti-parasite drug ivermectin has been “officially recommended” by the National Institutes of Health (NIH) to treat Covid-19 in the US has been shared more than 100 times in South Africa. The claim  is false; the NIH confirmed to AFP Fact Check that there is not yet enough data to “recommend either for or against the use of ivermectin for the treatment of Covid-19” in the US. Furthermore, it is the Food and Drug Administration (FDA) that approves drugs in the US, not the NIH.", "“Ivertmectin (sic) is now OFFICIALLY recommended by the NHI (sic) in the US for treatment of Covid-19,” reads a post published on January 21, 2021 by an account in the name of South African politician Vytjie Mentor. “What is the South African government …  waiting for?”", "As is the case with numerous politicians’ pages in South Africa, the widely-followed Facebook account in Mentor's name has not been verified with a blue tick. Multiple attempts to confirm with Mentor that it indeed belongs to her have gone unanswered. AFP Fact Check has previously debunked claims posted by this account here and here.", "This post includes a link to a report by the Front Line COVID-19 Critical Care Alliance (FLCCC), a non-profit organisation set up by health care specialists who recently claimed the NIH had effectively recommended the drug for Covid-19 patients after they presented it with compelling data.", "Similar posts shared on Facebook here and here in South Africa also claimed that the NIH had “upgraded” its stance on ivermectin, based on assertions made in the same FLCCC article, thereby clearing the way for its use as a Covid-19 therapy in the US.", "However, the claim that the NIH has officially recommended the drug for use against Covid-19 is false.", "Ivermectin is a medication used to treat parasitic infections. The US Food and Drug Administration (FDA) has authorised ivermectin tablets to treat parasitic worms, and creams and lotions for infections, including head lice and rosacea, but not for use in Covid-19 patients.", "As of January 2021, there is still not enough scientific evidence supporting the use of ivermectin in the fight against Covid-19, according to the NIH.", "Although the NIH updated its position on ivermectin in a statement issued on January 14, it ultimately determined that there was “insufficient data to recommend either for or against the use of ivermectin for the treatment of COVID-19”, adding that further guidance on the drug’s efficacy will require “adequately powered, well-designed, and well-conducted clinical trials”.", "To date, said the NIH in its statement, “most of the studies ... had incomplete information and significant methodological limitations”, meaning experts were unable to draw definitive conclusions.", "In its report here, the FLCCC noted that the NIH is neither “for or against” administering ivermectin to Covid-19 patients.", "However, the authors interpreted this as a tacit sign of approval by the NIH because the institute had changed its previous recommendation advising “against” ivermectin to a more neutral stance — despite the fact that the FDA has not approved the drug for use to treat Covid-19.", "“By no longer recommending against ivermectin use, doctors should feel more open in prescribing ivermectin as another therapeutic option for the treatment of COVID-19,” wrote the FLCCC authors. “This may clear its path towards FDA emergency use approval.”", "When contacted by AFP Fact Check, Hillary Hoffman, a spokesperson for the National Institution of Allergy and Infectious Disease (NIAID) – the branch of the NIH charged with publishing information related to Covid-19 – affirmed that the NIH recommends neither for nor against using ivermectin to fight the disease.", "The FDA’s view, on the other hand, remains unchanged; its last update on the issue published here on December 16, 2020, reiterates that ivermectin has not been approved to treat or prevent infections from the novel coronavirus. “Additional testing is needed to determine whether ivermectin might be appropriate to prevent or treat coronavirus or COVID-19,” the organisation said on its Frequently Asked Questions page. The FDA's office of media affairs confirmed with AFP Fact Check on January 27, 2021 that this remained the organisation's stance.", "Meanwhile, South Africa’s health products regulatory authority, which also oversees clinical trials, tweeted on January 27, 2021, that it was open to the use of ivermectin as a treatment for Covid-19 through a “compassionate and controlled” access programme, the guidelines for which would follow in due course.", "SAHPRA will engage with medical professionals to deliver a compassionate and controlled access programme. A guideline will be published shortly", "AFP Fact Check has previously debunked claims calling ivermectin a “miracle drug” capable of curing Covid-19.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]