["“Please forward this video around the Globe what the bjp followers are doing.Just like ISIS,This video should go to all of Asia,America, Africa,Europe,Australia n the UNITED NATIONabout these groups founded n funded by the BJP(ISIT)knownas INDIAN STATE OF INTERNATIONAL TERRORISM.”", "Along with the above message, a video clip has been shared on social media, which shows a violent group clash.", "Please forward this video around the Globe what the bjp followers are doing.Just like ISIS,This video should go to all of Asia,America, Africa,Europe,Australia n the UNITED NATIONabout these groups founded n funded by the BJP(ISIT)knownas INDIAN STATE OF INTERNATIONAL TERRORISM. pic.twitter.com/X6GcVFlCbB", "— Sajjad Ahamd SA (@SajjadAhmadC) September 1, 2019", "The 2:20 minute long video begins with a mob brutally thrashing a man who has fallen to the ground. The mob runs amok, resorting to brutal violence. In another part of the video, a person is seen being thrashed with rods and sticks in front of a gate, as policemen watch from a distance (1:18 minutes). Apart from the above instance, the video has been shared by Facebook users with the same text.", "The social media claim i.e. the men seen indulging in violence are BJP followers, is false. Alt News found several tweets by users in the comments section of the tweet posted above, who stated that the incident occurred in Chennai and pertained to a violent clash at a college.", "On this basis, Alt News searched Google with specific key words, and found videos of this incident posted on YouTube in 2009. One of the videos was a CNN IBN (Now CNN News18) broadcast reporting the same incident shown in the viral video clip. The corresponding visuals can be viewed from 13 seconds onward.", "Caste-based violence had erupted between groups of students at the Dr. Ambedkar Law College in Chennai on November 12, 2008, as police watched from the sidelines, failing to intervene. Four students were critically injured in this violent clash. Several students were arrested and as many as 43 were named accused in the case. The Chennai police commissioner was transferred and an assistant commissioner was suspended.", "According to a Hindustan Times report of the time, referring to the cause of the clash, “Tension had been building up between the two sides after the college celebrated the 101st birthday of freedom fighter Pasumponn Muthuramalinga Thevar almost two weeks ago. Students from ‘Thevar’ community had put up posters which did not prefix “Dr. Ambedkar” to the college name. Dalit students took it as an insult. And, matters came to a head.” The incident was also reported by The Times of India and The New Indian Express. In the most recent development to the case, 21 students who had been sentenced to three-year imprisonment were acquitted of all charges by the Madras High Court.", "A video of a violent student clash which occurred in Chennai more than 10 years back, is being circulated on social media with the false claim that these men are BJP followers.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]