["On April 30, reports emerged that fugitive diamond merchant Nirav Modi will appeal for a third bail application in London on May 8, 2019. This report directly contradicted the news stories that had earlier emanated from a section of the media. On April 26, multiple media outlets had reported that Westminster magistrates’ court had rejected Nirav Modi’s bail plea for the third time. How could Nirav Modi then apply for his third bail plea, when it was already rejected on April 26?", "The contradictory reportage wasn’t limited to one news outlet. Let’s look at what was presented as breaking news on April 26th by numerous news organisations, and what are the facts of the matter.", "At 2:47 PM on April 26, News 18 broke the news on Twitter, “UK Government Refuses to Grant Bail to Nirav Modi, Custody Extended Till May 24th”.", "#Breaking | UK Government Refuses to Grant Bail to Nirav Modi, Custody Extended Till May 24th pic.twitter.com/Ibw8Bcpz4t", "— News18.com (@news18dotcom) April 26, 2019", "Within a minute, ANI reported that the London court has rejected Nirav Modi’s bail and the next date of hearing in the case is May 24.", "Fugitive Businessman Nirav Modi’s bail rejected by London Court, next date of hearing in the case is May 24. (file pic) pic.twitter.com/m3Nv7vQWew", "— ANI (@ANI) April 26, 2019", "This was followed by many media outlets sharing the same narrative, i.e Nirav Modi’s bail plea rejected for a third time. This included Deccan Chronicle, The Asian age, Republic TV, Money Control, CNBC-TV18, TOI, BTVI, News 24 India, ET Now, HTN Tiranga TV, NDTV, The New Indian Express, The Quint, TV9 Bharatvarsh, ET NOW, Hindustan Times, Zee BusinessThe Indian Express, Money Control, Scroll, Business Today, One India and ABP News. The stories were largely sourced to ANI or PTI.", "The official handle of Enforcement Directorate also tweeted, “Today Nirav Modi was produced before the Westminster Court, London through Video Link for bail hearing. His Bail was rejected & judicial custody has been extended by the Court till 24.05.2019.”", "Today Nirav Modi was produced before the Westminster Court, London through Video Link for bail hearing. His Bail was rejected & judicial custody has been extended by the Court till 24.05.2019.", "— ED (@dir_ed) April 26, 2019", "No bail application was ever filed by the legal team of Nirav Modi on April 26. Modi’s remand was extended for another 28 days on that day. We were able to corroborate this with reports by London correspondents for Hindustan Times, India Today, TOI and The Hindu. Naomi Canton, a London correspondent, who reports for The Times of India had pointed out the case of misreporting.", "I was at the Nirav Modi court case this morning. Would like to point out that NiMo did NOT have his bail rejected for the third time. This is incorrect and has been misreported.@AltNews", "— Naomi Canton (@naomi2009) April 26, 2019", "According to a TOI report published on April 30, under the Bail Act of 1976, requested persons in the court cases (in Britain) can only apply for bail twice. Nirav Modi’s legal team had already exhausted the two chances of bail application available at his disposal on March 20 and March 29 respectively. A third bail application can only be made in the court once a change of circumstance is proven. On May 8, Modi is expected to cite new grounds at the hearing before the judge.", "Alt News contacted the UK’s Crown Prosecution Service (CPS) to verify the fact of the matter. In an email response, Yasser Mehmood, the CPS press officer said, “He [Nirav Modi] has had his 2 bail applications in the lower court. He can only make a third application if he can persuade the court that there has been a change in circumstances. He is arguing a change of circumstances based on new evidence. The next hearing will be at 2 pm on 8 May. On 8th May he will have to seek to persuade the Judge that this constitutes a change of circumstances and that he should be permitted to make another bail application.”", "Of the multiple media outlets which reported that Nirav Modi’s bail plea was rejected, Times Now and Mirror Now were the ones which stood out with facts. At 2:54 PM, Times Now reporter in a broadcast said, “He [Nirav Modi] didn’t make a plea for bail, the court didn’t take up the plea for bail”. Ironically, Hindustan Times and India Today accurately reported that no bail plea was moved by Modi while they had earlier tweeted and reported otherwise i.e. the third bail plea was rejected.", "Nirav Modi Bail: Extradition trial begins. @NikunjGargN with the details. pic.twitter.com/HxNWOrTiNs", "— TIMES NOW (@TimesNow) April 26, 2019", "A section of mainstream media, which on April 26 had reported that Nirav Modi’s third bail application was rejected also published reports on April 30 suggesting that Modi will apply for bail a third time. The extension of Nirav Modi’s custodial remand was misreported with a reference to the bail plea, which was never made in the first place.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]