["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Hospital staff wash the emergency entrance of Wuhan Medical Treatment Center, where some infected with a new virus are being treated, in Wuhan, China, on Jan. 22, 2020. (AP)", "There is no evidence that the coronavirus was created in a lab.", "Scientists who have isolated the genetic makeup of the 2019 coronavirus say its likely source is bats.", "Natural News has published health misinformation in the past.", "Editor’s note, May 17, 2021: When this fact-check was first published in February 2020, PolitiFact’s sources included researchers who asserted the SARS-CoV-2 virus could not have been manipulated. That assertion is now more widely disputed. Read our May 2021 report for more on the origins of the virus that causes COVID-19. That dispute notwithstanding, the assertion that \"the coronavirus was engineered by scientists in a lab\" is unsubstantiated and lacks evidence. We continue to rate the claim False.", "As the 2019 coronavirus continues to spread around the world, an anti-vaccine website has concocted a conspiracy theory about its source.", "In a blog post published Feb. 3, Natural News, a website known to promote health misinformation, lays out an \"irrefutable\" conspiracy that the coronavirus is man-made.", "\"The tools for genetic insertion are still present as remnants in the genetic code. Since these unique gene sequences don’t occur by random chance, they’re proof that this virus was engineered by scientists in a lab,\" the story reads.", "The article goes on to say that the World Health Organization and the Centers for Disease Control and Prevention are \"covering up this inconvenient fact in order to protect communist China.\" Natural News does not provide evidence for the claim.", "The story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) It has been shared more than 2,700 times.", "(Screenshot from Natural News)", "PolitiFact has fact-checked several hoaxes and conspiracies about the 2019 coronavirus, which has infected more than 37,000 people globally and killed 812 in China. The outbreak started in the central Chinese city of Wuhan in December and has since spread to 24 countries.", "One of the most popular conspiracies about the coronavirus is that it was created in a lab, possibly as a bioweapon. We’ve previously said those claims are unproven — and the Natural News story has similar shortcomings.", "The website says that \"every virology lab in the world that has run a genomic analysis of the coronavirus now knows that the coronavirus was engineered by human scientists.\" But none of the researchers that has analyzed the virus has come to that conclusion.", "According to the CDC, both the agency and Chinese authorities have isolated the genome of the 2019 coronavirus. Their findings suggest \"a likely single, recent emergence of this virus from an animal reservoir.\"", "We analyzed the eight publications the CDC lists on its landing page about coronavirus. None asserts that the virus was engineered by humans.", "RELATED: PolitiFact’s coronavirus coverage in one place", "One study, which analyzed the genetic sequence of the coronavirus, was published Jan. 30 in the journal The Lancet. It says the 2019 coronavirus is a human betacoronavirus similar to Severe Acute Respiratory Syndrome (SARS) and likely comes from bats.", "\"Although our phylogenetic analysis suggests that bats might be the original host of this virus, an animal sold at the seafood market in Wuhan might represent an intermediate host facilitating the emergence of the virus in humans,\" the study reads.", "Early reports on the virus focused on the fact that many patients were linked to the Wuhan market. That suggested animal-to-person spread, according to the CDC, but later, a growing number of patients reported not having any connection to the market. That suggested the coronavirus was spreading person-to-person.", "Other blogs and social media users have speculated that a lab near Wuhan could be the source of the virus. The Wuhan National Biosafety Laboratory is a maximum-security biolab that deals with some of the world’s most dangerous pathogens, including Ebola and SARS. As of now, however, there is no evidence that the lab is the source of the outbreak.", "The Natural News article is unsupported by evidence. We rate it False.", "The Atlantic, \"The Small, Small World of Facebook’s Anti-vaxxers,\" Feb. 27, 2019", "Centers for Disease Control and Prevention, 2019 Novel Coronavirus: Publications, accessed Feb. 6, 2020", "Centers for Disease Control and Prevention, 2019 Novel Coronavirus (2019-nCoV) Situation Summary, Feb. 5, 2020", "The Lancet, \"Genomic characterisation and epidemiology of 2019 novel coronavirus: implications for virus origins and receptor binding,\" Jan. 30, 2020", "Natural News, \"Irrefutable: The coronavirus was engineered by scientists in a lab using well documented genetic engineering vectors that leave behind a ‘fingerprint,’\" Feb. 3, 2020", "Nature, \"Inside the Chinese lab poised to study world's most dangerous pathogens,\" Feb. 22, 2017", "PolitiFact, \"A reader’s guide to misinformation about the coronavirus,\" Jan. 31, 2020", "PolitiFact, \"Fact-checking hoaxes and conspiracies about the coronavirus,\" Jan. 24, 2020", "Science magazine, \"Mining coronavirus genomes for clues to the outbreak’s origins,\" Jan. 31, 2020", "World Health Organization, Novel Coronavirus(2019-nCoV) Situation Report - 20, Feb. 9, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]