["About this rating", "This article has been updated and its rating has been changed from \"True\" to \"False.\" Following initial publication, Pentagon Press Secretary John Kirby provided us with this statement: \"By prior arrangement, Secretary Austin divested his entire Raytheon portfolio on Jan. 22, 2021, immediately following the Senate vote confirming him as the new Secretary of Defense.” Snopes initially received no comment on a Feb. 24, 2021 inquiry about his divestment from Raytheon, and as such, our initial article relied on a divestment timeline provided by Secretary Austin in filings with the Office of Government Ethics.", "On Feb. 19, 2021, an identically phrased claim went viral on multiple social media accounts, including that of a sitting congressman, after it was posted by a self-described MAGA \"global recruiter\" with the Twitter handle \"@johnnyrwhitsett.\" The claim references an alleged $285 million defense contract awarded to a company that U.S. President Joe Biden's secretary of defense, Lloyd Austin, \"owns over [$1 million] of stock in.\"", "The memes are referring to Austin’s past financial interest in the military contractor Raytheon. While Austin served on the Board of Directors of Raytheon and once held shares in the company given to him through executive compensation, the statement that he was invested in the company during the time he was in office is, according to Pentagon Spokesperson John Kirby, false.", "The specific monetary value in these memes appears to have their origin in a viral Feb. 17 YouTube video that — despite discussing the value “85 million” in the actual clip — was shared by its creator with the higher number on Twitter. That video derived the number $85 million from an announcement by the State Department — which does not award defense contracts — approving a proposed sale of missiles produced by the company Raytheon to the government of Chile.", "Austin's divestment aside, senators have raised concerns over the close relationship between Raytheon and Austin in general. In correspondence with U.S. Sen. Elizabeth Warren, Austin pledged to “extend his recusal from Raytheon Technologies for four years and to not seek a position on the board of a defense contractor or become a lobbyist after his government service.”", "It bears mentioning that Mark Esper, who served as former President Donald Trump’s secretary of defense, served as Raytheon’s vice president of government relations directly before his confirmation. When asked by Warren during his confirmation hearing if he would recuse himself from decisions involving Raytheon, he refused.", "From 2016 to the day of his confirmation as secretary of defense on Jan. 22, 2021, Austin served on the Board of Directors for Raytheon or a company, United Technologies Corp, that would merge with it. Prior to his confirmation, according to documents filed with the Office of Government Ethics, Austin held “vested deferred stock units and vested and unvested restricted stock units” in Raytheon.", "These are special forms of stock-based executive compensation. Deferred stock units are shares inaccessible to the owner until after that person has left the company. Restricted stocks are ownership shares of a company subject to special Securities and Exchange (SEC) restrictions intended, among other things, to prevent premature selling. Both options are often given on a vesting schedule, meaning that the full amount of the stock compensation is not available to that executive (i.e., it remains unvested) until the executive has worked at the company for a certain period of time.", "Austin sold these stocks the day of his confirmation. In his White House financial disclosure form, Austin indicated the value of his vested deferred stocks to be between $500,000 and $1,000,000 and the value of his vested restricted stocks to be between $50,000 and $100,000. Austin, a DOD spokesperson told us, \"will file a Periodic Transaction Report and a Certificate of Ethics Agreement Compliance which will both be publicly available on the OGE website.\"", "Raytheon performs a prodigious amount of work for the Department of Defense. Based on an analysis performed by Snopes, in the first month that Austin served as its secretary, the DOD granted at least $569,756,040 in new contracts or contract modifications to Raytheon or various divisions of Raytheon branches:", "As part of Austin's ethics pledge, he stated that he would \"not participate personally and substantially in any particular matter that to my knowledge has a direct and predictable effect on the financial interests of Raytheon.\" We asked the DOD how this arrangement would work, given the large volume of business conducted with Raytheon. In response, a spokesperson told us:", "Through a formal screening arrangement, the Secretary has directed his staff to identify all matters that involve Raytheon as a party or a representative of a party, as well as any matters that could directly and predictably affect the financial interests of Raytheon. Any such matters involving Raytheon are referred to the Deputy Secretary of Defense or another senior official for action or assignment. A copy of the Screening Arrangement is available in the DoD FOIA Reading Room.", "Because Austin divested entirely from Raytheon prior to any contract being awarded to the company under his leadership, the claim is \"False.\"", "Updated [March 2, 2021]: Changed rating from True to False based on a late-arriving statement from Pentagon Press Secretary John Kirby informing us that Austin divested entirely from Raytheon immediately after the Senate voted to confirm him.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]