["About this rating", "Racial discrepancies in criminal sentencing are a long-standing concern in the United States and a common feature of online debate and social media memes, as we have examined on several occasions.", "In the summer of 2018 another set of cases formed the basis of a viral post published by the left-leaning Facebook page \"The Other 98%.\" The 1 June meme showed a photograph of black teenager Dayonn Davis and details of his conviction and sentencing, side by side with a photograph of Lyle Burgess along with details of his punishment:", "[DAVIS]", "15-year-old honor roll student with no prior record steals sneakers: TRIED AS AN ADULT, GETS 5 YEARS IN PRISON.", "[BURGESS]", "Wealthy 79-year-old white man rapes 5-year-old girl: GETS 90 DAYS HOUSE ARREST.", "THIS IS AMERICA", "Next to the meme, \"The Other 98%\" added \"This is why they kneel,\" a reference to ongoing protests by National Football League players against racial injustice, which involve kneeling or not taking to the field while the the national anthem is played before games:", "In support of the claims contained within the meme, \"The Other 98%\" cited two sources. The first was a June 2018 article published by The Root, which reported that:", "An 18-year-old Columbus, Ga., teen will spend the next five years in prison, plus 10 years on probation, after stealing a pair of Nike sneakers when he was 15. Dayonn Davis took the shoes from the unsuspecting owner who tried to sell them on Facebook. But despite the fact that he has no prior criminal record, Judge Bobby Peters handed down the stiff sentence ...", "The second source was a May 2018 article by the Huffington Post, which reported that:", "A retired California businessman has accepted a controversial plea deal that spares him prison time for sexually assaulting a 5-year-old girl. Lyle Burgess, 79, of Stockton pleaded no contest to unlawful sexual intercourse with a minor on May 23, for which he received 90 days in jail and five years of probation. According to the terms of sentencing, he isn’t required to register as a sex offender and may serve his sentence under house arrest. His home is in an upscale gated community.", "Dayonn Davis", "According to Muscogee County court records, on 29 May 2018 Dayonn Davis was given a 15-year sentence after pleading guilty to robbery by force. The 18-year-old was ordered to serve five years in prison and the remaining 10 years on probation.", "Because he had no prior convictions, Davis was sentenced under the state of Georgia's First Offender Act, meaning that his felony conviction would be removed from his criminal record if he fulfilled all the requirements of his custodial sentence and probation.", "According to the state's case against him, Davis arranged to buy a pair of Nike Air Jordan 'Oreo' shoes from a young man named Carlton Anthony Jr., in Columbus, Georgia, in January 2016, when Davis was 15 years old:", "Prosecutor Sadhana Dailey [said] Davis made contact with the owner after seeing the shoes for sale on Facebook.", "Another male accompanied Davis to the rendezvous, where Davis asked to try on the shoes. Finding they fit, he told the seller, “These shoes is took.”", "Davis’ companion then pulled out a pistol, and everyone ran.", "But Columbus police quickly tracked Davis down and found the stolen shoes in his closet.", "Dailey said Davis initially would not name the second suspect, though eventually he did. The victim, however, could not identify the person Davis named as the gunman when shown a photo lineup.", "Under Georgia's 1994 Juvenile Justice Reform Act, minors charged with one of seven serious felonies are tried as adults. Such was the case with Davis, who was originally charged with armed robbery and possession of a firearm during the commission of a felony.", "Davis claimed not to have known that his accomplice would bring a gun to the robbery, but facing a mandatory minimum prison sentence of 10 years without parole, he entered into an agreement with prosecutors whereby he pleaded guilty to the lesser charge of \"robbery by force\" and instead received a five-year prison sentence with the possibility of parole.", "Even so, the punishment garnered local and national news coverage and was clearly viewed as harsh by some, given that Davis was 15 years old at the time of the offence, had no prior juvenile record, and the items taken in the robbery were of relatively low monetary value.", "Speaking to the National Public Radio affiliate WABE, his attorney Susan Henderson said: \"He really is a good kid that made a really dumb, 15-year-old mistake ... He owns up to the fact that he made a mistake.\"", "However, Muscogee County District Attorney Sadhana Dailey rejected claims that Davis' punishment was excessive. In a statement sent to ABC News affiliate WTVM, Dailey wrote:", "This case was an armed robbery, not a theft. It's not about shoes, it is about the victim. Armed robbery is a crime against the person and is not about the property. The victim was robbed at gunpoint. The property that was taken is not important to the charge. The fact that these robbers were willing to shoot the victim for his shoes shows their callousness for another teen's life and is a danger to anyone who has an item that this defendant or his accomplice wants. The teen victim could have been killed in this armed robbery. As demonstrated in this area's recent trial of triple murders of a family in Upatoi, young people are capable of killing for as little as shoes.", "It's not clear whether Davis was on the honor roll at Kendrick High School, as the Other 98% meme claimed, but Henderson certainly averred in court that he had been receiving A and B grades before his arrest in 2016 (although she said his grades had dropped since then), according to the Ledger-Enquirer.", "As of 28 September 2018, Davis remained incarcerated in the Muscogee County Jail.", "Lyle Burgess", "According to San Joaquin County court records, on 23 May 2018 Lyle Burgess was sentenced to 90 days' detention and five years probation for violating Section 261.5(c) of California's penal code, a statutory rape law which states that \"Any person who engages in an act of unlawful sexual intercourse with a minor who is more than three years younger than the perpetrator is guilty of either a misdemeanor or a felony ...\"", "Burgess, who was 79 years old at the time of his sentencing, had entered a \"no contest\" plea in connection with his violation. He was initially charged with \"continuous sexual abuse of a child,\" a serious felony which carries a sentence of between six and 16 years in state prison, after the parents of a then five-year-old girl accused him of touching her private parts repeatedly between October 2015 and November 2016. That charge was later replaced with four counts of \"lewd acts upon a child\" (Sec. 288a of California's penal code).", "Burgess pleaded not guilty to all four counts, and his attorneys requested that San Joaquin County Superior Court judge Michael Mulvihill dismiss the charges, arguing that not enough evidence established that Burgess had touched the girl with \"the intent of arousing, appealing to, or gratifying the lust, passions, or sexual desires of that person or the child.\"", "Burgess' attorneys also maintained that both the young girl and her mother had been inconsistent in their accounts of the molestation. (The details of the case might be disturbing to some readers, and we have redacted certain names from court records as a precaution against identifying the victim.)", "The prosecution, led by San Joaquin County District Attorney Tori Verber Salazar and Deputy District Attorney Kathleen Murray, urged Mulvihill to reject the motion to dismiss, arguing that no innocent explanation covered Burgess' touching the girl in her private parts and alleging that, when he was confronted by her parents, Burgess had admitted to touching the child and offered to give them money if they did not bring charges against him. In the end, Judge Mulvihill sided with the prosecution and rejected Burgess' motion to dismiss the charges against him.", "The trial was scheduled to begin on 20 April 2018, but two days before that, Burgess entered a plea agreement with the prosecution. Under the deal, the state dropped the four counts of \"lewd acts upon a child\" (which carried a possible sentence of six to 16 years), and Burgess pleaded no contest to \"unlawful sexual intercourse with a minor who is more than three years younger,\" a statutory rape charge which carried a sentence of no more than one year in county jail.", "On 23 May, Judge Ronald Northup  sentenced Burgess to 90 days in county jail but recommended home detention (i.e. \"house arrest,\" as the meme stated). Burgess was given five years of probation with the conditions that he not make any contact with his victim, hand over any firearms he may own, not break any laws, submit himself and his property to searches, and stay away from parks, schools, and \"areas where children frequent.\"", "Burgess was not ordered to register as a sex offender, despite that course of action's being available as one of the possible conditions of his five-year probation.", "Burgess' punishment was greeted with widespread outrage. Ken Meleyco, a lawyer for the victim's family, told Sacramento television station KTXL that:", "A five, six year-old little girl was molested. Normally the sentence is state prison, and then when you're released you have to register as a sex offender ... The girl is not doing good. She's showing all the symptoms of somebody who's been molested. She's in counselling, she's going to be in counselling all her life.", "﻿", "In response to the criticism, San Joaquin County issued a press release explaining that Burgess' sentence was the result of a negotiated settlement worked out with all parties involved (including the victim's family), taking into account the mitigating factors that the child victim was not \"sexually penetrated\" and the perpetrator was elderly and in frail health:", "The People of the State of California reached a negotiated settlement/alternative resolution in this case. Based upon on assessment of the strengths and weaknesses of the evidence presented in the case, along with a review of the case facts and testimonies presented at the preliminary hearing, Defendant Burgess was offered a felony sex related charge, Penal Code § 261.5, and accepted with a plea. This charge was agreed upon by all parties, including the parents of the child victim.", "Summary of Case Facts:", "Burgess was arrested on Nov. 23, 2016 and subsequently charged with four counts of Penal Code § 288(a), lewd acts upon a child. After the preliminary hearing and a review of the investigation, the charge was later amended to a violation of Penal Code § 261.5(c), unlawful sexual intercourse with a minor, of which he was ultimately convicted.", "A preliminary hearing was held on November 1, 2017. Both the victim and her mother testified. At the preliminary hearing, there were no allegations that the child had been sexually penetrated by any means. (A transcript of the preliminary hearing has been available to the public since November of 2017).", "After discussions with the defense, and consultation with the family of the victim, Burgess agreed to enter a plea. Based on that representation, the charge would be amended to Penal Code § 261.5(c), despite no sexual penetration having occurred.", "This decision was based on assessment of the strengths and weaknesses of the evidence in this case and the testimony at the preliminary hearing. On April 18, Burgess plead no contest to Penal Code § 261.5(c).", "On May 23, 2018, Burgess was sentenced to 90 days in the county jail, with the opportunity to apply for home detention. This sentence was initiated by the San Joaquin County Court, on the basis of the defendant's age and health condition. Burgess was placed on five years of probation.", "The evidence presented required the judicious use of prosecutorial discretion to achieve the best outcome under the circumstances. The San Joaquin County District Attorney's office remains committed to pursuing justice on behalf of the people of the State of California.", "Conclusion", "On the whole, the factual claims contained in the Other 98% meme were accurate but left out certain salient details. Dayonn Davis was 15 years old and reportedly a good student at the time of his offense, which was indeed his first. However, he did not merely \"steal sneakers\"; he engaged in an armed robbery in which an accomplice helped him steal shoes from another teenager at gunpoint.", "Davis was tried as an adult -- Georgia law requires that course of action for any minor charged with armed robber -- and he was indeed sentenced to five years in prison. But the meme left out the fact that his sentence, although it appeared harsh to many observers, was the result of a plea agreement with prosecutors and was lower than the 10-year minimum sentence he could have faced if he had been convicted of armed robbery (as opposed to robbery by force).", "The meme's presentation of Lyle Burgess' conviction was more complete. Burgess was indeed 79 years old at the time of his sentencing, and he was convicted under a statutory rape law for molesting a five-year-old girl. The maximum sentence available to the judge in Burgess' case was 12 months in county jail, but he instead gave Burgess five years' probation and 90 days detention, recommending that Burgess serve his sentence under house arrest and not be required to register as a sex offender.", "But the notion that these two cases demonstrate disparities in sentencing due to race (or any other factor) is extremely problematic because they were so disparate and involved so many different variables other than race.  One case took place in Georgia, the other in California.  One case involved a 15-year-old high schooler as a defendant, the other a 79-year-old man in declining health.  One case involved the use of a weapon, the other did not.  One case was about an armed robbery, the other about sexual molestation.  Moreover, the sentences in both cases were primarily established through negotiated plea deals and not merely the fiat of judges.", "Edwards, Breanna.   \"Georgia Teen with No Prior Record Sentenced to 5 Years in Prison for Stealing a Pair of Sneakers When He Was 15.\"\r\n    The Root.   1 June 2018.", "Lohr, David.   \"Outrage After Man Gets 90 Days for Sexual Assault of 5-Year-Old Girl.\"\r\n    The Huffington Post.   31 May 2018.", "Chitwood, Tim.   \"Columbus Teen Who Had No Record Is Going to Prison -- Over a Pair of Sneakers.\"\r\n    The Columbus Ledger-Enquirer.   31 May 2018.", "Chapman, Isley.   \"Dayonn Davis Stole a Pair of Nikes. He's Going to Prison for 5 Years. Why?\"\r\n    Juvenile Justice Information Exchange.   15 June 2018.", "Kauffman, Johnny.   \"How a Georgia Teen Got 5 Years in Prison for Stealing a Pair of Shoes.\"\r\n    WABE.   4 June 2018.", "Morgan, Chandler.   \"Officials Say There's More to Story of Columbus 18-Year-Old Sentenced to Prison on Armed Robbery Charges Involving Sneaker.\"\r\n    WTVM.   1 June 2018.", "Superior Court of California, County of San Joaquin.   \"The People of the State of California v. Lyle Burgess -- Conditions of Probation.\"\r\n    23 May 2018.", "Superior Court of California, County of San Joaquin.   \"The People of the State of California v. Lyle Burgess -- Complaint.\"\r\n    23 November 2016.", "Superior Court of California, County of San Joaquin.   \"The People of the State of California v. Lyle Burgess -- Information.\"\r\n    6 November 2017.", "Superior Court of California, County of San Joaquin.   \"The People of the State of California v. Lyle Burgess -- Points and Authorities Supporting Defendant's Motion to Dismiss Information.\"\r\n    24 January 2018.", "Superior Court of California, County of San Joaquin.   \"The People of the State of California v. Lyle Burgess -- People's Response to Defendant's Motion to Set Aside Information.\"\r\n    5 February 2018.", "California Legislature.   \"Penal Code, Title 9, Chapter 1, Section 261.5 -- Rape, Abduction, Carnal Abuse of Children, and Seduction.\"\r\n    Accessed 28 September 2018.", "California Legislature.   \"Penal Code, Title 9, Chapter 5, Section 288.5 -- Bigamy, Incest and the Crime Against Nature.\"\r\n    Accessed 28 September 2018.", "Edwards, Ashley Alese.   \"This Man Got Only 90 Days House Arrest for Molesting a 5-Year-Old Girl in California.\"\r\n    Refinery29.com.   30 May 2018.", "Shaddox, Rowena.   \"Stockton Businessman Pleads No Contest to Statutory Rape of Child, Sentenced to Just 90 Days of House Arrest.\"\r\n    KTXL.   24 May 2018.", "San Joaquin County District Attorney's Office.   \"Press Release -- People v. Lyle Burgess.\"\r\n    25 May 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]