["“With a 5G phone!you don't need to move around with your Phone, You just keep it at home. But a MicroChip will be implanted under your skin! (sic)” reads a Facebook post shared more than 6,000 times since it was published on May 19, 2020.", "It claims that “people like Bill Gates” plan to secretly inject microchips during vaccination, allowing 5G mobile phone owners to make calls, transfer money and travel internationally without passports. It warns the microchips can “read your mind” and could be used to control people.", "“Tomorrow a leader would rise up and say nobody should buy and sale until you have that MicroChip (666) clearly that's what the Bible warned us, 2000 years ago (sic),” the text reads.", "AFP Fact Check found the text in various Facebook posts shared more than 12,000 times in total since April. We’ve archived some of them here and here.", "Contacted by AFP Fact Check, Mischa Dohler, Chair Professor of Wireless Communications at King’s College London, said that a microchip under the skin could not be used to operate a 5G mobile phone.", "“Microchips and 5G have nothing in common. It’s like comparing apples and a car,” he told AFP Fact Check in a phone interview. “Microchips do exist and they’re currently used in Nordic countries, for instance, where you can have a chip implemented (under the skin) and go and pay with that chip in a bar.”", "Human microchip firms have sprung up from Sweden and Denmark to the US in recent years, offering chips that are injected into the hand between the thumb and index finger to subsequently unlock doors and buy snacks with the wave of a hand. Other firms are developing chips to store medical data.", "Dohler dismissed claims that microchips implanted in the human arm could allow smartphone users to make and receive calls without having their phone in hand.", "“I'm not saying this will never be possible but, currently, this is scientific rubbish,” he said. “To communicate, you need to generate soundwaves, so you'd need to have that microchip very close to your ear or implanted very close to the brain.”", "Microchips work with RFID (radio frequency identification), which allows products to be scanned for information, similar to barcodes at the supermarket.", "Luyun Jiang, technology analyst at IDTechEx, a market research company, said that this type of technology can only deal with “very limited data” and cannot be used to make and receive phone calls.", "“5G needs quite a lot of power and hardware,” she told AFP Fact Check by phone. “A microchip under the skin just like that is not going to do anything. You’d need to implant a whole smartphone under your skin!”", "The Facebook posts also claim that COVID-19 is a “man made disease” introduced in 2012.", "“Over 50% of this evil people who created this CORONA VIRUS lived in America, but God brought in Donald Trump to retard their plans greatly that was why they had to move to China an ungodly nation to launch it (sic),” the posts read.", "AFP Fact Check has previously debunked claims that the COVID-19 outbreak was man-made or even deliberately created. Speaking to us in May, scientists explained that it would be too complicated to create a virus.", "“Even if the most brilliant scientist wanted to create a virus, it would be infinitely too complex because you’d have to create something entirely new,” said Etienne Simon-Lorière, virologist at the Institut Pasteur in Paris.", "However, the current coronavirus contains a similar genetic data to a bat coronavirus previously found in China, said Marie-Paule Kieny, head of research at France’s Inserm public health research organisation.", "There is currently no vaccine for COVID-19. More than 100 candidate vaccines are in development around the world, with 10 being tested on humans.", "AFP Fact Check has previously reported on various conspiracy theories around the pandemic, including rumours that 5G technology caused the outbreak or that billionaire philanthropist Bill Gates plans to use vaccination to reduce the global population.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]