["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Joe Biden signs his first executive order in the Oval Office of the White House on Jan. 20, 2021, in Washington. (AP)", "The average price of gas is about 34 cents per gallon higher since Biden took office.", "Experts say Biden’s orders on the Keystone pipeline and oil and gas leasing might affect future gas prices, but have no effect on current prices.", "Grocery store prices are 3.5% higher than they were one year ago and have risen less than 1% in 2021.", "Are President Joe Biden’s executive orders so powerful that, in the less than two months he’s held office, they have spiked the price of gasoline by 50 cents and the price of food by 10%?", "That’s the claim of a post widely shared by musician Ted Nugent and others on Facebook.", "It says: \"When executive orders cause gas to go up 50 cents a gallon and food costs to increase 10%, you just taxed the middle class.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Biden began issuing executive orders on Jan. 20, the day of his inauguration. The claim we’re checking was posted March 7. Let’s see what’s happened in between.", "Since bottoming out at $1.87 a gallon in late April 2020, gas prices have mostly been going up. The bulk of the increase came under President Donald Trump, with prices continuing to rise under Biden.", "Nationally, the average price of a gallon of gas was $2.46 on Jan. 18, the final weekly tally before Biden took office. It rose to $2.80 on March 1, the latest weekly tally before the Facebook post, according to the U.S. Energy Administration. That’s an increase of 34 cents under Biden.", "The prices were similar at GasBuddy.com: $2.41 on Jan. 19 and $2.77 on March 7 — an increase of 36 cents.", "Some critics have said that Biden’s cancellation of the Keystone XL pipeline with one executive order would quickly result in higher gasoline prices. But we previously found that, for several reasons, that’s not the case. For starters, the pipeline wasn’t operating yet, so canceling it didn’t change the balance of supply and demand.", "In the same executive order, Biden placed a moratorium on oil and gas leasing in the Arctic National Wildlife Refuge in Alaska. But Patrick De Haan, head of petroleum analysis for GasBuddy.com, said that action has not affected current gas prices either, because current oil supplies are not affected. The order could, however, have an impact on gas prices in a few years, he said.", "In general, a president has limited control over the weekly and monthly shifts in gasoline prices. Gas prices depend mostly on global supply and demand.", "The OPEC oil cartel and Russia have made voluntary production cuts, which has the effect of raising prices. A greater impact has been made on prices by demand, as a result of the slow but steady economic recovery from the coronavirus pandemic.", "We find no evidence that food prices have risen 10%.", "The price of \"food at home\" (purchased from grocery stores or other food stores) rose 0.3% in February 2021 after dropping 0.1% in January, according to the latest figures from the federal government’s Consumer Price Index, released March 10. The price was 3.5% higher in February 2021 than it was over the previous 12 months.", "It’s not clear what Biden executive orders the post is suggesting could have affected food prices. An executive order signed Jan. 22 asked the Department of Agriculture to consider expanding and extending federal nutrition assistance programs.", "\"It's hard to see which orders would have had any impact on food prices,\" said economics and law professor Alan Auerbach, director of the Center for Tax Policy and Public Finance at the University of California, Berkeley.", "A Facebook post claims that Biden executive orders caused price increases of 50 cents per gallon in gas and 10% in food in the less than two months since he took office.", "The average price of gas is about 34 cents per gallon higher since Biden took office, not 50 cents. Experts say Biden’s orders on the Keystone pipeline and oil and gas leasing might affect future gas prices, but have no effect on current prices.", "Grocery store prices are 3.5% higher than they were one year ago and have risen less than 1% in 2021. That’s far short of 10%.", "We rate the post False.", "Facebook, post, March 7, 2020", "PolitiFact, \"Are gas prices going up? And is it Joe Biden’s fault?\", March 2, 2021", "U.S. Energy Administration, weekly U.S. gas prices, accessed March 8, 2021", "GasBuddy.com, \"3 Month Average Retail Price Chart,\" accessed March 9, 2021", "NBC News, \"The price of food and gas is creeping higher — and will stay that way for a while,\" March 1, 2021", "Interview, Patrick De Haan, head of petroleum analysis for GasBuddy.com, March 9, 2021", "AFP Fact Check, \"Gas prices up on renewed crude oil demand, not US policy,\" Feb. 19, 2021", "U.S. Bureau of Labor Statistics, news release, March 10, 2021", "Email, economics and law professor Alan Auerbach, director of the Center for Tax Policy and Public Finance at the University of California, Berkeley, March, 9, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]