["A Facebook post that claims a Chicago police officer shot a teenager \"53 times\" for sneaking into a gym is a malicious distortion of what actually happened.", "In reality, the police officer helped the teen buy a gym membership.", "The Facebook post, which displays a photograph of the officer and his full name, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The real story originated in August 2017, according to the Chicago Tribune, when a teen around 15 years old was warned that if he continued to sneak onto the basketball court of the XSport Fitness facility in Skokie, Ill., just north of Chicago, the police would be called. The gym’s staff eventually alerted the Skokie Police Department after the boy attempted to get in again.", "Valenti responded, and when he found out the teen had a membership that expired after his mother couldn’t afford it anymore, \"he offered to pay $150 out of his own pocket, asking fitness center workers how much membership time that would buy for the boy,\" the Tribune reported.", "It covered up to about four months, but after the gym’s corporate office found out about the situation, they said the $150 would go toward a two-year membership, instead, with the gym picking up the rest of the cost.", "The false Facebook post includes Valenti’s full name and photo and appears to be the same photo published by the Tribune. In the post’s caption, it’s obvious the original text was erased and the part that says he \"shot him 53 times\" was inserted, as the text size and style doesn’t visually match up with the rest of the sentence.", "We rate this Pants on Fire!", "Facebook post, Sept. 13, 2019", "ABC News, Illinois police officer buys teen a gym membership after catching him trespassing, Oct. 24, 2017", "Fox News, Chicago cop gives teen who snuck into gym unexpected surprise, Oct. 18, 2017", "Chicago Tribune, A Skokie cop could have arrested a teen who kept sneaking into a gym. Instead, he bought him a membership, Oct. 18, 2017", "Chicago Tribune, Teen thanks Skokie cop who paid for gym membership: 'It changes how I view police', Oct. 24, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]