["An anti-abortion group soliciting contributions to bolster its presence on Texas college campuses drew our attention by associating University of Texas students with legalizing child murder.", "A Dec. 5, 2014, \"Murder: urgent\" email blast from Jim Graham, executive director of Texas Right to Life, opened: \"I received word that students at the University of Texas in Austin signed a petition seeking the legal right to abort newborn babies up to five-years-old. You read that correctly. You and I call it murder and infanticide. As ridiculous as this petition sounds, I do not take it lightly, and I know you don't either.\"", "For real?", "Video basis of claim", "To our request for detail, a group spokeswoman, Melissa Conway, emailed us a link to a video posted on YouTube by InfoWars.com, the reporting project shepherded by conspiracy theorist Alex Jones.", "In the video, a sports-jacketed man in shades seemingly draws UT students to sign just such a petition.", "An unsigned version appears on screen, stating: \"Please support the Post-Birth Abortion Act of 2014. This is to emphasize that the moral status of the newborn baby is comparable with that of a fetus … rather than that of a child. Therefore, we claim that killing a newborn could be ethically permissible in all the circumstances where abortion would be. This post-birth abortion can take place until a newborn is self aware or reaches 5 years old. This act is supported by numerous scientists and medical doctors as a safe and effective way to preserve the quality of life.\"", "The man shown collecting the signatures, Joe Biggs of InfoWars.com, says on camera he’s \"here at the University of Texas in Austin,\" then says there’s a trend going around U.S. college campuses of talking up post-birth abortions. \"It’s all the new rage,\" he says.", "The video flashes part of a student-written story posted online Oct. 29, 2014, headlined \"Trending: More college students support post-birth abortion,\" quoting an activist saying support for infanticide or child killings had been noted from students at Purdue, the University of Minnesota and the University of Central Florida. (On Oct. 30, 2014, the debunkists at Snopes.com acted on the same story, finding False the idea that a \"growing number of college students support ‘post-birth abortions,’ extending to children as old as four or five.\")", "In the video, Biggs says a lot of college students around the country \"agree with killing babies up to the age of four or five. So I came out here today to find out whether or not UT agrees with post-birth abortions.\"", "All told, the video shows Biggs talking to 16 students about the petition; 12 sign, it appears, three decline and it’s unclear what one man decides. By our sights, not everyone is paying attention. At least two students act while wearing headphones, two sign while talking on phones and another signs while holding a plate of food in her other hand.", "\"The more the merrier,\" Biggs says to one student, \"the more we can help empower women.\"", "He tells another the proposal is to \"give women the right to have abortions.\" If an abortion is botched, Biggs says, and the baby is born, \"it gives the mother the opportunity to continue on with it,\" meaning the abortion.", "A woman refusing to sign tells Biggs: \"I’m not doing that. That’s freaking ridiculous.\"", "Petitioner: About 30 students approached", "To our inquiry, Biggs said by phone he collected the signatures on the campus at midday Oct. 29. Biggs said he showed the petition to about 30 students -- meaning around 17 declined to sign, he agreed.", "\"Some people walked by me\" and said \"this is crazy, you’re out of your mind,\" Biggs said.", "Student comments", "At our request, Biggs emailed us a page listing 13 names and signatures, enabling us to identify the purported signers and try to reach them. We heard back by email from three students who confirmed signing the petition, each one expressing surprise at what she or he had endorsed:", "--Danielle Bainter said she signed the petition in a rush to class after the presenter misrepresented its purpose. \"Had I fully understood the actual position the organizer was advancing, there is absolutely no way that I ever would have signed his petition. To be clear, I unequivocally do not support\" such an act, she wrote. \"To me, the stated purpose is so horrifying and revolting that I find it difficult to imagine that such a petition or related act could be advanced for anything more than a political stunt.\" She said she wouldn’t make the mistake again.", "--Milla Lubis said she signed the petition after \"the man petitioning led me to believe it was about keeping a women's health clinic open. After reading what was printed on the petition I realized this was not the case but I felt obligated to sign,\" Lubis said, \"because I had already been handed the petition.\" Lubis, saying she doesn’t support post-birth killings, said \"it's misleading to have someone stand in the middle of campus asking women if they believe in women's rights.\"", "--Joseph Ellerd said he \"was given different information about the petition’s platform at the time by a guy on the sidewalk. It wasn't the same info you're giving me.\" Asked his opinion, Eller said that if \"the child's already born, then aborting the child is kind of wrong. So I'm not in favor of the petition if it means a mother can abort a child any time before the age of five.\"", "By phone, Stephanie Forsberg said she signed the petition and does support the concept, for \"complicated\" reasons.", "Our ruling", "The group said UT students \"signed a petition seeking the legal right to abort newborn babies up to five-years-old.\"", "Some university students signed the petition, but others did not. Some of those who did sign later said they did not support the concept advocated by the petition. Further, Texas Right to Life's email struck us as implying that students on the campus were hustling up support for legalizing infanticide and child killings. In reality, a visitor briefly collected signatures one day, almost like attempting a trick.", "So, this statement is partially accurate but lacks important context. That makes it Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Story, \"The Old College Sigh,\" Snopes.com, posted online Oct. 30, 2014", "Telephone interview, Joe Biggs, reporter, InfoWars.com, Austin, Dec. 8, 2014", "Excerpted copy of signed petition for Post-Birth Abortion Act of 2014 (received by email from Biggs, Dec. 8, 2014)", "Telephone interview, Stephanie Forsberg, Austin, Dec. 8, 2014", "Emails, University of Texas students who confirmed signing the \"post-birth abortion\" petition, Dec. 8-9, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]