["Is the Congress party contesting the lowest number of seats in its entire history, for the 2019 Lok Sabha election? Apparently so, according to Prime Minister Narendra Modi.", "PM Modi recently gave an interview to the English news channel India Today. In conversation with senior anchor Anjana Om Kashyap, Modi, speaking about the prospects of the BJP and Congress in the Lok Sabha election, asserted that the media has, either deliberately or otherwise, failed to report that the number of seats that the INC will be battling for is the lowest in its entire political history. The video of the interview is posted below. The relevant portion is from 1:03:45 minutes.", "PM Modi says, “…teesri baat jo media miss kar raha hai. Ab woh unki madad karne ke liye miss kar raha hai ya imaandari se miss kar raha hai, main aarop nahi laga raha hoon. 2014 ka chunav, uske nateeje, Congress ka uske poore jeevan kaal ka sab se kam seaten jeet ne ka record. 2014. Aur 2019, unke poore jeevan kaal mein sabse kam seaten ladne ka record. Ye do cheezein desh ke saamne baar baar aani chahiye.”", "Translation: “…the third thing which the media is missing. Now whether they are missing it to help them or otherwise, I am not accusing. 2014 election, its result; Congress got the record of the lowest number of seats in its entire history. 2014. And in 2019, they have the record of contesting the lowest number of seats in their entire political history. These two things should come to the fore in front of the nation.", "PM Modi made two assertions:", "1. Congress shrunk to its lowest ever tally in 2014", "2. Congress is contesting the lowest number of seats in the history of general elections", "The first claim i.e. Congress in 2014 made history by winning the lowest number of seats ever, is correct. The party’s tally of 44 seats was its worst ever performance in a general election.", "As for the second claim, PM Modi was countered via social media by Congress leader Ahmed Patel, who tweeted that “Congress is not contesting its lowest ever seats”, and called the Prime Minister “ill-informed”.", "It is troubling that PM is so ill-informed & this has reflected on his governance", "But I will clarify two things", "1)Congress is not contesting its lowest ever seats,hence media is not highlighting his false claims", "2)In 2004 we contested even lesser seats & still formed govt pic.twitter.com/rljC7GArmA", "— Ahmed Patel (@ahmedpatel) May 1, 2019", "To get to the bottom of this claim and counter-claim by PM Modi and the Congress party, Alt News firstly looked up the candidate list of the INC, available on the website of the party. It may be noted that 543 members are elected to the Lower House. For the 2019 Lok Sabha election, the Congress party will be contesting from 424 seats.", "Is this figure of 424 the lowest ever in the history of the Congress party, as claimed by PM Modi? Alt News checked the total number of candidates put up by the INC in the previous general elections of 2014, 2009 and 2004. The statistical reports for successive Lok Sabha elections are available on the website of the Election Commission of India.", "In 2014, the total number of Congress candidates was 464. For 2009, the party had put up 440 candidates across the country. For the year 2004, the Indian National Congress contested the Lok Sabha election on 417 seats. This is less than the number of seats the party is contesting in the current election, which is 424.", "The total number of seats contested by the Indian National Congress over seven general elections from 1996 to 2019 have been presented in tabular format below, for reference.", "As is evident from the above table, the 2019 general election is not the election where the INC has contested the lowest seats. The party had contested seven less seats i.e. 417 in 2004, compared to 424 in 2019. It is the lowest figure among the last six general elections. Interestingly, 2004 was the year when Congress pipped the Vajpayee-led NDA coalition, disproving all pre-poll predictions.", "Suffice to say that PM Narendra Modi’s second assertion is factually incorrect. It is worthwhile to note that the Prime Minister was not countered over this falsehood by the anchor in this much hyped, “unforgettable and unique” interview.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]