["About this rating", "On 19 February 2016, Texas' Travis County Democratic party confirmed that President Barack Obama would attend a March 2016 political fundraiser at Austin's South by Southwest (SXSW) conference:", "President Obama will be in Austin on Friday, March 11 for a fundraiser -- the same day SXSW kicks off. According the Travis County Democratic Party, the fundraiser will take place at the Austin Music Hall.", "\"I was thrilled to find out President Obama was coming back to Austin. He always encourages us always challenges us to work hard and to serve others so it's going to be great to see him come back to Austin,\" says Vincent Harding, chair of the Travis County Democratic Party.", "On 29 February 2016, the Houston Chronicle reported that Obama planned to attend a \"party fundraiser\" (political, not festive) at SXSW, the interactive media and film conference:", "Officials with the Democratic National Committee said Obama will attend a party fundraiser at the Austin Music Hall on March 11, the first day of the music, film and interactive conference that attracts tens of thousands of people from around the world to Texas' capital city.", "On 5 March 2016, President Obama's weekly address centered upon his planned appearance at SXSW. In the brief speech, Obama explained an initiative to incorporate technology into key government functions, and his objective in attending the event, specifically describing \"asking everyone from all walks of life working inside and outside of government to help make this democracy even stronger\":", "An 8 March 2016 article on social media web site Mashable focused on the President attending the event, and why he planned to be there:", "It will also, for the first time ever, host a sitting U.S. President. The announcement that Barack Obama would take the SXSWi stage on Friday has, naturally, drawn the spotlight away from virtually all other convention activity and, perhaps rightly so, elevated governance and policy making as a key element of the event. (In total SXSW is actually a 10-day-long extravaganza comprising Interactive, Film (which overlaps with interactive and runs until March 19) Music (which runs from the 15th through March 20).", "The President was later named as a participant in a keynote appearance at SXSW, in addition to the commitments announced earlier.", "On 7 March 2016, news broke that former First Lady Nancy Reagan had died of congestive heart failure in Los Angeles at the age of 94. The confluence of events led to headlines suggesting that President Obama was opting out of Reagan's funeral in order to \"party\" at an \"entertainment event.\"", "However, the New York Post reported on 8 March 2016 that sitting presidents rarely attend the funerals of former first ladies:", "First Lady Michelle Obama will attend the funeral to represent the president and also be one of the SXSW keynote speakers Wednesday.", "In recent decades, presidents have not attended the funerals of former first ladies.", "When First Lady Betty Ford died in 2011, Rosalynn Carter, Michelle Obama, Hillary Clinton and Nancy Reagan all attended. Ex-President George W. Bush went because wife Laura had other travel plans. But Obama and former President Bill Clinton did not attend the funeral.", "In fact, the last sitting president to attend the funeral of a former first lady was John F. Kennedy, who paid his respects in person upon the death of Eleanor Roosevelt in 1962.", "President Obamas released an official joint statement mourning Mrs. Reagan, praising the guidance she provided and her commitment to husband Ronald Reagan:", "Nancy Reagan once wrote that nothing could prepare you for living in the White House. She was right, of course. But we had a head start, because we were fortunate to benefit from her proud example, and her warm and generous advice.", "Our former First Lady redefined the role in her time here. Later, in her long goodbye with President Reagan, she became a voice on behalf of millions of families going through the depleting, aching reality of Alzheimer’s, and took on a new role, as advocate, on behalf of treatments that hold the potential and the promise to improve and save lives.", "We offer our sincere condolences to their children, Patti, Ron, and Michael, and to their grandchildren. And we remain grateful for Nancy Reagan's life, thankful for her guidance, and prayerful that she and her beloved husband are together again.", "While it's true President Obama was slated to appear at SXSW during Nancy Reagan's funeral, it appeared that many confused the political use of the word \"party\" with its recreational application. The President's appearance was planned well in advance, and was the subject of a weekly address aired before Reagan's death. Michelle Obama was scheduled to attend Nancy Reagan's funeral as a White House representative, and sitting presidents rarely attend the funerals of former First Ladies.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]