["The photo was published here on Facebook on January 22, 2020. It has since been shared more than 6,400 times.", "Below is a screenshot of the misleading post:", "The post’s Thai-language caption translates to English in part as:", "“Praise the bravery of Mr. Theerachatr Nimma, the security guard of a department store who sacrificed himself by shutting the automatic doors, which resulted in him being shot dead by the robber. But his bravery was not for nothing as the police were able to obtain the suspect's sweat which turned out to be DNA evidence for the police to confirm the suspect's identity. #thisisThailand”.", "The post is referring to an armed robbery and triple homicide that occurred at a gold store in Lopburi, Thailand on January 9, 2020. The suspect was arrested on January 22, 2020, as reported here by the Bangkok Post, an English-language newspaper in Thailand.", "Similar claims were shared on Facebook here, here, here, here and here, and on Twitter here, here, here, here, here and here.", "The claim is misleading; Thai police refuted that they had obtained any DNA evidence from the suspect’s sweat.", "“We did not obtain the gunman’s DNA from his sweat, I would like to reiterate this so we don’t have to mention it again. We don't have the suspect's sweat as evidence,\" said Police Lt Gen Suwat Jangyodsuk, Chief of Provincial Police Region 1, at a press conference at the Royal Thai Police headquarters in Bangkok on January 23, 2020.", "Local media also reported here and here that police identified the suspect thanks to tips from local residents and by verifying the gun and silencer used in the attack.", "The photo used in the misleading post does show the late security guard.", "AFP confirmed that the black and white image was made by one of the victim's friends, who originally posted the photo on Facebook here in a condolence post. The friend told AFP via Facebook on January 29, 2020 that he took the photo from the victim's Facebook account here.", "PPTV, Thailand’s digital TV channel, also published a photo of the security guard here on January 13, 2020. The report shows a framed picture of a man who corresponds with the man seen in the misleading posts.", "Below is a comparison of the man in the misleading posts (L) and in the PPTV report (R):", "The report’s Thai-language headline translates to English as: “The family of the security guard chief at Robinson Shopping Mall worries about his 3 young children after he was shot dead during the gold store robbery”.​", "The photo also corresponds with photos from the victim's funeral posted on Facebook here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]