["About this rating", "On 10 April 2020, the website bustatroll.org published an article positing that U.S. House Speaker Nancy Pelosi had promised to resign if President Donald Trump were re-elected in 2020:", "Pelosi Promises to Resign if Trump is Re-Elected", "Nancy Pelosi knows she is doomed. Between the multiple investigations against her, her falling poll numbers, and the inevitability of Trump winning another four years, the walls are closing in. She knows her only choice is to run while she still can.", "In a speech today, Pelosi said the following:", "“I am here today to make an important announcement. If Donald Trump wins in November, I will immediately resign my position as Speaker of the House and as Congresswoman. I will no longer be an effective leader if Trump is there to block my agenda. The only choice I have is to step aside.", "I have done all I can to block his work, but my constituents are starting to turn on me and back Trump. I am no longer what the people want. They want Trump, and if they chose him in November, I will step aside and support the will of the people.”", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows: \"Everything on this website is fiction. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical.'", "Although this article may have originated as an attempt at satire, it has since been reproduced as straight news by multiple websites with no labeling or other indicator that the piece was intended to be humorous or satirical in nature.", "For background, here is why we sometimes write about satire/humor.", "Helmet, Harry.   \"Pelosi Promises to Resign If Trump Is Re-Elected.\"\r\n    bustatroll.org.   10 April 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]