["The claim was shared here on Facebook on February 8, 2021.", "\"Without [Covid-19] vaccines, 60% of our people have antibodies. Only South Koreans,\" reads the Korean-language claim.", "Additional text highlighted in red refers to a South Korean scientific study published in January 2021. It reads: \"The research found that six out of ten people who had never contracted Covid-19 have pre-existing stereotypic neutralising antibodies from Covid-19.\"", "The same screenshot has been shared on Facebook here, here and here with a similar claim.", "The claim is misleading.", "The claim surfaced online shortly after South Korea's Seoul National University published new research here on January 27, 2021 about Covid-19 antibodies. It found evidence that coronavirus antibodies exist in healthy people, as well as patients suffering from Covid-19.", "The researchers said their findings were evidence that Covid-19 antibodies exist in the human body and may provide immunity against the viral infection.", "In response to the misleading posts, Chung Junho, a professor at Seoul National University College of Medicine and one of the co-authors of the paper, told AFP that the study's participants were not solely from South Korea.", "“The study is based on data collected from the United States and South Korea,” Chung said by email on February 9, 2021.", "There was no information in the paper to support the misleading claim that antibodies against Covid-19 were only found in South Korean people.", "Separately, the Korea Biomedical Review published an article about the study that made no reference to where the participants originated from.", "Globally, there have been several other studies into the development of Covid-19 antibodies that used patients from various countries, including the UK, as AFP reported here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]