["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Eric Greitens announced his recommended budget for fiscal year 2018 at a preschool for students with special needs in Nixa, Mo., instead of at the Capitol in Jefferson City. By speaking at a preschool, the new Republican governor said he was highlighting his commitment to public elementary and secondary education.", "Greitens described the difficult challenge he encountered making cuts to balance Missouri's \"broken budget.\" The budget was broken, he said, by decreased tax revenues paid by special interests and by rising health care costs due to the Affordable Care Act. He promised K-12 classrooms would be protected from budget cuts.", "After the speech, Greitens took questions from the press. One reporter asked for clarification about elementary and secondary education funding and higher education funding.", "Greitens said: \"K-12 education is getting more money this year than they did last year. And just to be specific, I’ll give you the exact numbers. Last year it was $5,914,000,000. This year is $5,951,000,000. We’re actually increasing spending for K-12 education. There will be more money from gaming funds, federal funds and state funds into K-12 education. It is a total increase of 4.1 percent.\"", "We wanted to check into this claim, especially because cuts Greitens proposed to school transportation would cause some schools to dip into other accounts to transport kids to and from school.", "Education department numbers", "Right off the bat, Greitens is correct in saying that the Missouri Department of Elementary and Secondary Education would receive more total funding than in FY 2017 under his proposed FY 2018 budget. And the budgeted numbers he cited also check out.", "According to the governor's FY 2018 budget, last year the department received a total of $5,914,605,606 to fund public schools and other programs. This year Greitens recommends appropriating $5,950,859,927.", "But the governor said this was a 4.1 percent increase. The $36.3 million increase was actually an increase of 0.613 percent — just a little off.", "PolitiFact tried to get in contact with Greitens to understand where he came up with his 4.1 percent figure. His office referred us to the Department of Revenue, and his press secretary has not responded to our calls and emails.", "Throughout the speech, Greitens reiterated he was was increasing funds to K-12 education, but according to records available in the Office of Administration, he’s not increasing funds as much as previous years.", "Since unveiling his budget proposal, Greitens recommended that $11 million of $52 million received from a tobacco legal settlement be put toward K-12 school bus transportation. That increases the total amount for the department to $5.96 billion, or an 0.8 percent increase over the previous year.", "School transportation allocation", "Even with this additional money, Greitens’ proposal would still underfund school districts’ requests for reimbursement in transportation spending.", "To fully fund all of the school district's transportation requests, the department would need to dole out $280 million, said Roger Dorson, deputy commissioner of financial and administrative services for the Department of Elementary and Secondary Education. The extra $11 million puts the total for transportation up to $80 million.", "School administrators were quick to point out when Greitens first unveiled his budget that school transportation funding decreased 34 percent from the previous year — or $36 million. To make up for this, administrators said they’d have to take money from classrooms or make changes to their local busing policy. By law, districts must transport students who live more than 3.5 miles from school, and the state will reimburse up to 75 percent of the total cost for the district.", "Additionally, the governor’s budget won’t fully fund the Foundation Formula by nearly $45 million. The formula determines how state money will be allocated to each district to ensure that every student, no matter where he or she lives, receives an adequate education. When the formula isn’t fully funded, schools must find other sources of money — or make cuts — to meet their financial needs, said Shari LaPage, the the chief budget officer of the Department of Elementary and Secondary Education.", "Greitens is giving $3.2 million more to the formula than the previous fiscal year, yet the amount still isn’t enough to allocate the amount of money to each school as required by law. Since 2014, the Foundation Formula hasn’t been fully funded.", "Our ruling", "Greitens said, \"K-12 education is getting more money this year than they did last year. ... It is a total increase of 4.1 percent.\"", "Greitens is right that his proposal for FY 2018 would allocate more money to the Department of Elementary and Secondary Education, but he is overstates the size of the increase. Even after including the money from the tobacco legal settlement, the increase would still be less than 1 percent. And the funding for core K-12 education falls short of the state’s own benchmark formula.", "We rate this claim Mostly False.", "Gov. Eric Greitens Budget Speech. Springfield News-Leader. 2 February 2017.", "Fiscal Year 2018 Executive Budget. Missouri Office of Administration Department of Budget and Planning. 2 February 2017.", "Gov. Eric Greitens Office. Phone Message. March 10, 2017.", "Fiscal Year 2017 Executive Budget. Missouri Office of Administration Department of Budget and Planning. 20 January 2016.", "Fiscal Year 2016 Executive Budget. Missouri Office of Administration Department of Budget and Planning. 21 January 2015.", "Fiscal Year 2015 Executive Budget. Missouri Office of Administration Department of Budget and Planning. 21 January 2014.", "Fiscal Year 2014 Executive Budget. Missouri Office of Administration Department of Budget and Planning. 21 January 2013.", "Gov. Eric Greitens Facebook Post. 23 February 2017.", "Roger Dorsen. Phone Interview. 9 March 2017.", "Shari LaPage. Phone Interview. 3 & 6 March 2017.", "Roger Dorsen, Shari LaPage & Sarah Potter. Phone Interview. 2 March 2017.", "Missouri schools: Busing cut proposal will hurt classrooms. St. Louis Post-Dispatch. 8 February 2017.", "Frequently Asked Questions: School Transportation. Missouri Department of Elementary and Secondary Education. Accessed", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]