["About this rating", "A warning about a consumer finding mold inside a container of Capri Sun fruit drink was posted to Facebook in February 2013 and echoed similar confirmed incidents consumers had experienced with Capri Sun products in the previous years:", "WARNING TO ALL PARENTS: my friend Jennifer gave her son a caprisun Saturday and he told her it tasted funny. She took a sip and said it tasted like straight alcohol. Cut it open and it was nothing but mold inside. Evidently, this happens a lot. They say the lack of preservatives leaves them susceptible to fermentation. I will never let Delo drink another.", "In July 2012, for example, two families in Virginia Beach, Virginia, reported containers of Capri Sun drink that did not taste right and showed evidence of mold formation:", "Two Virginia Beach families [said] they recently purchased did not taste right and had even grown mold.", "Jaquan Harbison told his aunt something wasn't right with his Capri Sun.", "\"It tasted nasty,\" Harbison said.", "\"It really tasted like champagne,\" [his aunt Shaneka] Bellomy said.", "Two days earlier, a Virginia Beach mom [took] a picture of what she said she found when she pulled the straw out of her son's Capri Sun.", "[We] contacted Kraft Foods, and Senior Manager of Corporate Affairs Bridget MacConnell.", "\"Our experience has shown that because the product has no preservatives, which is a positive for most moms, if air does get into the pouch even through the smallest hole, fermentation can begin and mold can grow,\" MacConnell said.", "A small warning on the side of the box reads: \"Capri Sun contains no preservatives. Do not drink if pouch is leaking, damaged, or swollen as fermentation can occur.\"", "Bellomy said she never noticed the warning and she and her nephew did not notice the package was swollen.", "[We] found what appeared to be a small hole in the side of the pouch where air could have entered the pouch. There was no mold when Bellomy poured the Capri Sun out, but there appeared to be some type of residue on the inside of the pouch.", "Kraft Foods said the mold that can grow inside of the drink is similar to common bread mold.", "\"Generally speaking we believe it's not harmful,\" MacConnell said. \"It might make you sick to your stomach and if it did, I would suggest that you speak with your family health care provider.\"", "A nurse at Virginia Poison Center confirmed the mold could give you a stomach ache but would not be poisonous or toxic if ingested.", "And in February 2012, a Pennsylvania woman maintained she found a glob of mold inside her daughter's Capri Sun drink:", "Ashley Parks, who lives in Havertown, says a black substance was clogging the straw of a Capri Sun fruit punch her daughter, Emma, was drinking. When she cut open the pouch, she saw a glob of something.", "“Very gross looking, and then if you turn it, you can see little black particles,” explained Ashley.", "Stephanie asked Emma, “what did you think when you saw it?”", "Emma replied, “Ew, it was gross.”", "The 8-year-old says it didn't taste funny, and it didn't make her sick.", "Ashley got online and quickly found a litany of complaints about mold in Capri Sun drinks.", "“I’m concerned about my daughter's health, about kids drinking this and if they're at risk,” said Ashley.", "Ashley says she found out online there can be undetectable holes that allow air inside the pouch. And on the Capri Sun box, there’s a warning that says if the pouch is damaged, fermentation can occur. But there’s no way to know if this is inside until you take a sip.", "Further, in January 2012, a North Carolina boy found a slimy object his mother believed to be a worm inside a Capri Sun container:", "A 10-year-old Mooresville boy made a disturbing discovery in his Capri Sun juice pack.", "\"He went to go take a sip of the drink and he started choking,\" said Christina Stewart. \"So he pulled the worm out of his mouth and he was like, 'Oh mommy, this is nasty.'\"", "Stewart said she called Kraft Foods, the parent company of Capri Sun.", "\"She was like, 'Well, I'll just give you your money back, like it wasn't a big deal,\" said Stewart.", "Stewart took her son to the doctor, showed him the juice pack, and the slimy substance she was convinced was a worm.  She said the doctor also thought it was a worm, and he sent it to a lab to be tested to know for sure.", "Kraft Foods, the parent company of the Capri Sun brand, stated the \"worm\" was likely a mold formation, a phenomenon sometimes found in packages of Capri Sun that have been accidentally breached, as the product is made without preservatives:", "Without seeing the material, we can only surmise, but we believe what she's identified as a worm may actually be mold. Since our Capri Sun products are made without preservatives — a fact many moms like — if there's even a small hole in a pouch and air gets into it, mold similar to common bread mold can form. This is why we advise on the side of the box to discard any leaking pouches.", "Kraft later confirmed and reiterated this information on its web site's Capri Sun FAQ:", "The recent case of a \"worm\" found inside a Capri Sun pouch was, in fact, mold (the consumer actually returned to our page to confirm this). While this is not a common occurrence, it does happen from time to time because the product is preservative free. That's why we recommend discarding leaking or damaged packages and have included a statement on our cartons for consumers.", "Mold that forms on food and beverages is usually a common mold. It's generally much like common bread mold, though it may look different depending on where it forms. And yes, it can be ugly, gross and totally unappealing.", "It would be great if foods stayed fresh forever. But the basic laws of science and nature dictate that most foods eventually spoil and get moldy.", "Philadelphia television station KYW reported that despite its appearance, the type of mold found in damaged Capri Sun products probably would not cause harm if accidentally ingested:", "We talked to experts from the Poison Control Center at Children’s Hospital of Philadelphia about ingesting mold. They say it may be unappetizing and upsetting to the stomach, but it’s usually not medically dangerous.", "Maynard, Holly.   \"Mooresville Boy Finds Worm in CapriSun Drink.\"\r\n    WSOC-TV [Charlotte, NC].   24 January 2012.", "Stahl, Stephanie.   \"Capri Sun Mold Warning from Local Mom.\"\r\n    KYW-TV [Philadelphia].   9 February 2012.", "Woodrow, Melanie.   \"Families Voice Capri Sun Complaints.\"\r\n    WAVY-TV [Portsmouth, VA].   6 July 2012.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]