["About this rating", "With two exceptions, since 1840, U.S. Presidents who have been elected in years ending in zero have been killed or have died of natural causes while in office. And one exception literally came within an inch of death.", "It's hard to know what to make of such a sequence, but folks have certainly tried over the years. Such a string of presidential mortality is deemed too improbable to have occurred naturally, giving rise to rumors about a fatal Indian death curse among those unwilling to recognize that chaos sometimes takes the form of coincidence. Randomness is disquieting; Indian curses are, in comparison, the lesser of the evils because they at least support the illusion that there is order in our universe. In this odd way, belief in predestined fatalities is comforting.", "1840 ... William Henry Harrison1860 ... Abraham Lincoln1880 ... James A. Garfield1900 ... William McKinley1920 ... Warren G. Harding1940 ... Franklin D. Roosevelt1960 ... John F. Kennedy", "William Henry Harrison, who was elected in 1840, died of pneumonia at the age of 68, exactly one month after his inauguration.", "Abraham Lincoln, first elected in 1860, was assassinated by John Wilkes Booth just after embarking on his second term in office in 1865.", "James A. Garfield won the 1880 election. He was shot in the back in a Washington railroad station waiting room in July 1881 and died of his wounds in September 1881.", "William McKinley was re-elected in 1900. In September 1901, after giving a speech at an exposition in Buffalo, he was shot while shaking hands with well-wishers. McKinley died of his wounds a little more than a week later.", "Warren G. Harding, elected in 1920, expired of a stroke or heart attack in 1923. It was long rumored his wife had poisoned him.", "Franklin D. Roosevelt, re-elected in 1940 for a third term, suffered a massive cerebral hemorrhage and died just after having started an unprecedented fourth term in 1945.", "John F. Kennedy was elected in 1960 and assassinated by Lee Harvey Oswald in 1963.", "Ronald Reagan was elected in 1980 but managed to cheat the Grim Reaper by a matter of an inch, the distance by which would-be assassin John Hinckley's bullet missed his heart in 1981.", "Maybe Reagan also broke the \"every 20 years\" death curse. Or maybe it's just sleeping.", "George W. Bush, the president elected in the supposed \"curse\" year of 2000, finished out two terms in good health.", "Joe Biden, who was elected in 2020 and became the oldest person to assume the office thus far (at the age of 78), was still alive and well as of this update (August 2022).", "Those who look to make sense of eerie coincidences have come up with an explanation to account for this string of deaths: an ancient Indian death curse, supposedly administered by Tecumseh himself after suffering defeat at the hands in William Henry Harrison at the Battle of Tippecanoe in 1811. (Tecumseh died in the 1813 Battle of the Thames, again fighting troops led by Harrison.) According to lore, the famed Indian chief cursed the Great White Fathers. No explanation is given for why the chief's curse would only affect one presidency in five, but one cannot, after all, expect the fanciful to cover everything.", "Another version attributes the curse to Tenskwatawa (also known as \"The Prophet\"), a Shawnee medicine man who was half-brother to Tecumseh. The hex was supposedly his revenge for the death of his half-sibling.", "\"Harrison will die I tell you,\" the Prophet reportedly said. \"And after him, every Great Chief chosen every 20 years thereafter will die. And when each one dies, let everyone remember the death of my people.\"", "Stirring words indeed, but there's no reason to suppose they were actually uttered. No record of either Tecumseh or Tenskwatawa laying a whammy on American presidents has yet surfaced — it's all undocumented folktale at this point and is as likely just someone's imaginative backstory to the inexplicable as it is anything else.", "Folks have been taking note of this string of presidential deaths for quite some time — it's not a new snippet of spooky information recently dropped into the lap of the American people. A Ripley's Believe It or Not book published in 1934 noted the coincidental twenty-year pattern of presidential deaths between 1840 and 1920, with question marks in place of a name for the upcoming 1940 entry indicating the presumption of a continuing pattern. The pattern did, of course, hold true again when Franklin Roosevelt, who had been re-elected in 1940, filled in that blank by dying in office in 1945.", "As to what to make of the \"curse,\" it's interesting to note that since 1840, only one President other than those supposedly felled by this ill-wishing has died in office: Zachary Taylor, who was elected in 1848 and died in 1850 of a stomach ailment. (Taylor's body was exhumed in 1991 to investigate a theory that he had been poisoned with arsenic, but the results were negative.) Also interesting is the notion that the curse is a prescient one, as two presidents who won elections in years ending in '0' — Lincoln and Roosevelt — did not die until after beginning subsequent terms in office. Apparently the death curse foresaw re-election for both of them.", "The key to all this presidential demising possibly lies more within the realm of the stars than the rumored words of a dead Indian chief. Or at least so the astrologers would have us believe. According to Mark Dodich, an astrologer who has attempted to analyze the Curse of Tecumseh, the reason behind this force is one of \"cosmic coincidence,\" not Native American hexing. Dodich claims the curse's effects overlap with the alignment of Jupiter and Saturn, whose orbits have lined up every twenty years.", "One of the two 20-year pattern's failures — President Ronald Reagan — is explained by the sign the alignment of these two planets occurred under. Alignments under the earth signs (Taurus, Capricorn, and Virgo) have led to dead presidents; but Reagan's term occurred under an air sign, accounting for his survival.", "According to Dodich, year 2000's Jupiter-Saturn twinning once again occurred under the earth sign of Taurus, a phenomenon he says won't happen again for another 600 years. It thus marks the end of a deadly cycle; but if Dodich was right about this curse thing, it would have to sound the death knell for another president first.", "Lippman Jr., Theo.   \"Do Candidates Recall Zero-Year Curse?\"\r\n    The Baltimore Sun.   18 August 1999   (p. E1).", "Ripley, Robert.   Ripley's Big Book Believe It Or Not!\r\n    New York: Simon and Schuster, 1934   (p. 296).", "Roberts, Josie.   \"U. Virginia Scholars Debate Validity of Curse of Tecumseh.\"\r\n    [Univ. of Virginia] Cavalier Daily.   30 August 2000.", "Stricherz, Vince.   \"End of a Presidential Tradition.\"\r\n    The Seattle Times.   20 January 1989   (p. A7).", "Update [Aug. 31, 2022]: Updated to acknowledge the election of President Joe Biden in 2020.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]