["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In 2014, Harper’s Bazaar profiled Lynn Forester de Rothschild, who runs a private investment firm with her husband, Sir Evelyn de Rothschild. The article features a photo gallery showing Lady de Rothschild at her \"storied English estate.\" Among the photos is one showing her standing in front of a fireplace with a painting by George Stubbs above the hearth called \"Five Brood Mares at the Duke of Cumberland’s Stud Farm.\"", "The oil painting shows five horses. Not a demon chowing down on children. But a doctored image being shared on social media shows otherwise.", "\"Evil mega mass murderer Lynn Rothschild and her eating babies decor,\" reads the description above the photo. \"How conscious are you? What is a few trillion dollars of currency and devil eating baby art to you?\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "As AFP recently reported, the art in the doctored photo shows Satan chewing on some of \"the souls of the wicked,\" an element of an early 15th century Italian painting called \"The Last Judgment.\"", "The wealthy, Jewish Rothschild family has long been the subject of anti-Semitic conspiracy theories. Forbes, for example, reported in March that conspiracy theorists in Iraq are peddling the idea that the Rothschilds are behind the coronavirus pandemic. In certain corners of the internet, Lynn Forester de Rothschild has been named in connection with the unfounded belief that powerful people across the globe are involved in a child sex trafficking operation. But there is no evidence to support that theory, and this photo of her is obviously a hoax.", "We rate it Pants on Fire.", "Tweet, Feb. 11, 2019", "Harper’s Bazaar, Portrait of a lady: Lynn Forester de Rothschild, May 12, 2014", "Harper’s Bazaar, At home with Lady de Rothschild, May 12, 2014", "AFP Fact Check, The original photo shows socialite Lynn Forester de Rothschild standing in front of a different painting, July 20, 2020", "The Art Story, Fra Angelico artworks, visited July 20, 2020", "The Washington Post, The Rothschilds, a pamphlet by ‘Satan’ and anti-Semitic conspiracy theories tied to a battle 200 years ago, April 20, 2018", "Forbes, The corona crisis: The Rothschilds? Bill Gates? The search for a scapegoat has begun, March 23, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]