["By Robert Farley, Eugene Kiely and D'Angelo Gore", "Posted on August 11, 2016", "Two days after Donald Trump gave a major speech on economics in Detroit, Hillary Clinton came to Michigan to offer a rebuttal. We found that Clinton stretched the facts on a few points.", "Clinton cited analyses by the macroeconomic firm Moody’s Analytics of the entirety of the campaign proposals by Trump and Clinton, which concluded Clinton’s plans would be better for jobs. But she puts some spin on those reports.", "Clinton, Aug. 11: And according to an independent analysis by a former economic adviser to Senator John McCain, if you add up all of Trump’s ideas from cutting taxes for the wealthy and corporations to starting a trade war with China, to deporting millions of hardworking immigrants, the result would be a loss of 3.1 million jobs. Now, by contrast, the same analyst found that with our plan, the economy would create more than 10 million new jobs.", "Moody’s Analytics concluded that if Clinton were able to fully implement the plans she has outlined in her campaign, the economy would add 10.4 million jobs during Clinton’s presidency. But that’s just 3.2 million more than it projects would be added under current law.", "Moody’s Analytics: During her presidency, the economy would create 10.4 million jobs, 3.2 million more than under current law.", "Moreover, Moody’s Analytics doesn’t expect Clinton would likely be able to pass all of her proposals through a divided Congress. “Given the current political discord” Moody’s expects Congress would put up “substantial roadblocks” to Clinton’s policy proposals, and under its “most-likely scenario,” a Clinton presidency would result in employment going just “a bit higher” than it otherwise would — putting the U.S. on a path to create 1.5 million more jobs over 10 years than is expected under current law.", "Clinton accurately described the dire economic projection Moody’s forecast if Trump were able to implement all of his proposed policies at face value. If his policies were fully implemented, Moody’s predicts the economy would suffer an extended recession beginning in early 2018. The policies would also result in 3.4 million job losses over the course of Trump’s presidency. (Given that Moody’s forecast the economy would add 6 million jobs under current law, that’s a swing of more than 9 million jobs).", "The jobs projection under the “most-likely scenario” under Trump — again assuming Congress would balk at many of his proposals — is not as dire. According to this scenario, “Employment barely budges in the first two years, and over his four years as president just over 2.8 million jobs are created. This is about half as many jobs as would be created if there were no changes to current economic policy.”", "https://www.sharethefacts.co/share/f2a19c41-3ca4-4f8c-9b20-31766d7e8062", "Clinton derided Trump’s announcement on Aug. 8 that he would allow people to deduct the cost of child care from their taxes. The way it is designed, Clinton argued, it would be a boon to the wealthy and of little to no value to “hard-working families.”", "Clinton: Now [Trump] says he wants to exclude child care payments from taxation. His plan was panned from the left, the right, the center because transparently is designed for rich people like him. He would give wealthy families 30 or 40 cents on the dollar for their nannies, and little to nothing for millions of hard-working families trying to afford child care, so that they could get to work and keep the job.", "Trump offered few details about his plan when he announced it during a speech on economics in Detroit on Aug. 8, saying only, “My plan will also help reduce the cost of child care by allowing parents to fully deduct the average cost of child care spending from their taxes.”", "Based on that brief description, many economists did criticize the plan for providing little to no benefit for low-income workers. That’s because while married joint filers in the top tax bracket pay 39.6 percent on income over $466,950 in 2016, nearly half of the country’s workers pay no federal tax at all. Currently, 44 percent pay no federal income tax, according to the Tax Policy Center.", "Under Trump’s plan, the top rate would be cut to 33 percent. So without any further detail than Trump provided, those in the top tax bracket could write off up to 33 percent of their child care cost — provided they spent the average cost for child care in the state. Those in lower tax brackets would realize a lower percentage deduction. And low-income people who already pay no federal income tax would see no benefit from the deduction at all.", "However, Trump’s campaign has provided a few more details about the plan (and promised more to come). For one, the campaign website says the plan would be structured so that “low-income taxpayers [would be] able to take deduction against payroll tax.”", "In a statement provided to the New York Times, the Trump campaign stated the plan would provide “credit to stay-at-home caregivers” and that “to provide benefits to lower-income taxpayers who may not benefit from the deduction, the plan also allows parents to exclude childcare expenses from half of their payroll taxes — increasing their paycheck income each week.”", "Currently employees pay 7.65 percent of their pay toward Social Security and Medicare payroll taxes. Companies match that with an equal amount. If low-income workers are able to deduct the cost of child care from their share of payroll taxes, that would benefit low-income workers who pay no federal income tax (but do pay payroll taxes).", "As for the wealthy, Trump aides told the Associated Press there would be an income limit for eligibility. No details were provided about the cutoff, but presumably it would exclude from the tax deduction “rich people like [Trump],” as Clinton put it. Also, Clinton said the plan would allow wealthy families to write off “30 or 40 cents on the dollar for their nannies.” Trump said the deduction would be capped at the average cost of child care in a state for the age of the child. If the cost of a nanny were to exceed the average cost of child care in that state, then the household would not be able to write off the full cost of the nanny.", "Still, too many details are missing to provide an accurate analysis of how the plan would affect taxpayers at various income levels, said Bob Williams of the Tax Policy Center.", "For example, Williams said, will people be able to deduct the average cost of child care in the state even if they pay less than that for child care? Would families with a stay-at-home parent also be able to write off the average cost of child care in that state?", "Said Williams: “The real problem is that we don’t know the details of his plan.”", "https://www.sharethefacts.co/share/f7b381ba-ea16-4dca-9055-a23280b26bf7", "Clinton said that “millions” of “undocumented” workers in the U.S. are paying $12 billion a year into the Social Security program. That’s not exactly accurate. Half of that money is paid by the employers of people working in the U.S. illegally.", "Clinton: And protecting and expanding Social Security doesn’t just help older Americans retire with dignity. It helps to ease burdens on families and communities. And I also believe the same thing about comprehensive immigration reform. We already have millions of people working in the economy and paying $12 billion a year to Social Security even though they are undocumented.", "In an actuarial note from April 2013, the Social Security Administration estimated that, for 2010, “the excess of tax revenue paid to the [Social Security] Trust Funds over benefits paid from these funds based on earnings of unauthorized workers is about $12 billion.”", "SSA estimated that out of the 10.8 million unauthorized immigrants living in the U.S. in 2009, about 3.1 million of them worked and paid payroll taxes on an average of $34,000 in earnings in 2010. Workers and employers each pay a Social Security tax rate of 6.2 percent. Therefore, “we estimate $13 billion in payroll taxes from unauthorized immigrant workers and their employers in 2010,” the administration wrote.", "SSA pegged the overall contribution at $12 billion after it subtracted $1 billion in benefits paid to the “relatively small portion” of unauthorized workers eligible to receive them.", "https://www.sharethefacts.co/share/3b1365e8-fa24-4694-be14-f4fc5b9fb0f5", "Clinton said the U.S. has the “most … productive workforce in the world, bar none.” U.S. workers are productive, but the U.S. ranks third behind Luxembourg and Norway by the standard measure for worker productivity.", "The Bureau of Labor Statistics says, “GDP [gross domestic product] per hour worked is a general measure of labor productivity for the entire economy.”", "By that measure, the U.S. ranked third behind Luxembourg and Norway, as of 2014, among more than three dozen countries, according to the Organisation for Economic Co-operation and Development. The measure was $62.40 per hour worked in the U.S., while it was $79.30 in Luxembourg and $78.90 in Norway.", "BLS came to a similar conclusion in a 2012 report called “International Comparisons of GDP per Capita and per Hour, 1960-2011.” That report said the U.S. ranked third among 20 countries at $60.59 per hour worked in 2011. It trailed only Norway ($81.47) and Ireland ($66.74). BLS has since discontinued that statistical series.", "The World Bank uses a different measure: GDP per employed person. By that measure, the World Bank ranked the U.S. 11th in 2014 among dozens of countries and territories. Using international dollars, which the World Bank says has “the same purchasing power over GDP” as a U.S. dollar in the United States, the World Bank ranked the Chinese peninsula of Macao, or Macau, as first at int’l $231,317, followed by Luxembourg at int’l $201,748.", "The U.S. (int’l $109,314) also trailed several oil-rich countries, such as Qatar (int’l $173,967), Kuwait (int’l $158,302), and Saudi Arabia (int’l $143,968), according to the World Bank, as well as Norway (int’l $124,555) and others.", "The Clinton campaign did not respond when we asked for the data to back up Clinton’s claim.", "https://www.sharethefacts.co/share/b43c9fa0-6853-48ac-a175-1ab3dfd16672", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]