["By Lori Robertson", "Posted on October 1, 2019", "In recent days, President Donald Trump has suggested that Rep. Adam Schiff, the chairman of the House intelligence committee, should be arrested for “treason” and charged with “lying to Congress” for mischaracterizing Trump’s July 25 phone call with Ukrainian President Volodymyr Zelensky.", "Trump claims Schiff’s opening remarks at a recent House intelligence committee hearing on the whistleblower complaint against him were “illegally made up.” Schiff said his retelling of Trump’s phone call with Zelensky was partly “in parody.”", "We’ll leave it for readers to judge whether it was immediately clear that Schiff was purposefully giving his own dramatic representation that didn’t completely square with the facts. But here’s what we found about the statements the politicians have made about each other:", "Trump’s comments refer to Schiff’s statement preceding the Sept. 26 testimony of Acting Director of National Intelligence Joseph Maguire. The day before, the White House had released a memo of Trump’s July 25 phone call with Ukrainian President Zelensky, a call that is highlighted in an Aug. 12 whistleblower complaint against the president. The memo shows Trump asked Zelensky to investigate Biden and Biden’s son, Hunter.", "In the Sept. 26 House hearing, Schiff gave his own spin on the memo, saying this was “the essence of what the president communicates” in his call with Zelensky “in not so many words.”", "Later in the same hearing, Schiff said the summary “was meant to be at least part in parody.”", "Here’s Schiff’s summary:", "Schiff, Sept. 26: It reads like a classic organized crime shakedown. Shorn of its rambling character and in not so many words, this is the essence of what the president communicates. We’ve been very good to your country, very good. No other country has done as much as we have. But you know what? I don’t see much reciprocity here. I hear what you want. I have a favor I want from you though. And I’m going to say this only seven times so you better listen good. I want you to make up dirt on my political opponent, understand. Lots of it. On this and on that. I’m going to put you in touch with people, not just any people, I am going to put you in touch with the attorney general of the United States, my Attorney General Bill Barr. He’s got the whole weight of the American law enforcement behind him. And I’m going to put you in touch with Rudy. You’re going to love him. Trust me. You know what I’m asking. And so I’m only going to say this a few more times. In a few more ways. And by the way, don’t call me again. I’ll call you when you’ve done what I asked.", "This is in sum and character what the president was trying to communicate with the president of Ukraine. It would be funny if it wasn’t such a graphic betrayal of the president’s oath of office. But as it does represent a real betrayal, there’s nothing the president says here that is in America’s interest after all.", "It’s possible some viewers didn’t pick up on Schiff’s cue that he was giving his interpretation of the “essence” of the call. But it was clear to Republican Rep. Mike Turner.", "Later in the hearing, Turner said Schiff was “just making it up” and the American people were smart enough to know that. “While the chairman was speaking I actually had someone text me, ‘Is he just making this up?’ And yes, he was. Because sometimes fiction is better than the actual words or the text. But luckily the American public are smart, and they have the transcript. They’ve read the conversation; they know when someone’s just making it up.”", "Schiff responded: “My summary of the president’s call was meant to be at least part in parody. The fact that’s not clear is a separate problem in and of itself. Of course, the president never said if you don’t understand me, I’m going to say it seven more times. My point is that’s the message that the Ukraine president was receiving in not so many words.”", "In remarks at the White House on Sept. 30, Trump said Schiff “actually took words and made it up.” And that’s correct. Schiff didn’t give Trump’s exact words — which aren’t available. Nor does Schiff give the exact words in the memo, which stipulates that it represents the “notes and recollections” of staff “assigned to listen and memorialize the conversation.”", "Trump continued: “The reason is, when he saw my call to the president of Ukraine, it was so good that he couldn’t quote from it because it — there was nothing done wrong. It was perfect.” But Schiff could have quoted from it and conveyed some — but not all — of the same information that he included in his crime-novel version.", "The president said in a tweet that Schiff’s comments “bore NO relationship to what I said on the call.” That’s incorrect. There are some parts of the chairman’s comments that are similar to the memo of the phone call and other parts that aren’t at all.", "For instance, Schiff claims Trump told Zelensky, “We’ve been very good to your country, very good. No other country has done as much as we have. But you know what? I don’t see much reciprocity here. I hear what you want. I have a favor I want from you though.”", "That bears a relationship to the White House-released memo. According to the memo, Trump said: “I will say that we do a lot for Ukraine. We spend a lot of effort and a lot of time. Much more than the European countries are doing and they should be helping you more than they are. … [T]he United States has been very very good to Ukraine. I wouldn’t say that it’s reciprocal necessarily because things are happening that are not good but the United States has been very very good to Ukraine.”", "After Zelensky responded, saying, “Yes you are absolutely right,” that he had spoken to German and French leaders about doing more on “sanctions” against Russia and that Ukraine was “almost ready to buy more Javelins from the United States for defense purposes,” Trump asked for “a favor.”", "“I would like you to do us a favor though because our country has been through a lot and Ukraine knows a lot about it,” Trump said, according to the memo, asking that Zelensky look into CrowdStrike, the cybersecurity firm hired by the DNC after its computer network was hacked. (That’s a reference to a conspiracy theory that former homeland security adviser Tom Bossert said he explained to the president had been “completely debunked.”)", "During the call, Trump also asked Zelensky to look into former Vice President Biden, a leading candidate for the Democratic presidential nomination, and his son, Hunter. “The other thing, [t]here’s a lot of talk about Biden’s son, that Biden stopped the prosecution and a lot of people want to find out about that so whatever you can do with the Attorney General would be great,” the memo says. (We’ve looked into it, and there’s no evidence that “Biden stopped the prosecution.” See “Trump Twists Facts on Biden and Ukraine” for more.)", "The memo also shows that Trump told Zelensky he’d have his personal attorney, Rudy Giuliani, and Attorney General William Barr call Zelensky — though not in the words Schiff used. “Mr. Giuliani is a highly respected man. He was the mayor of New York City, a great mayor, and I would like him to call you. I will ask him to call you along with the Attorney General,” Trump said, according to the memo.", "But Schiff’s parody was outright false, as even Schiff partly acknowledged, in saying: “And I’m going to say this only seven times so you better listen good. I want you to make up dirt on my political opponent, understand. Lots of it. On this and on that.”", "The memo doesn’t show Trump saying anything about “seven times,” nor does the president ask Zelensky to “make up dirt” on Biden.", "The Wall Street Journal reported on Sept. 21, citing anonymous sources, that Trump had urged Zelensky “about eight times to work with Rudy Giuliani on a probe that could hamper Mr. Trump’s potential 2020 opponent.” But the “eight times” detail hasn’t been corroborated.", "Schiff has reiterated his claim that Trump had asked Zelensky to “make up” information. On CNN on Sept. 25, he said: “Why isn’t it enough that the president has admitted to pressuring a foreign nation to dig up or manufacture dirt on his opponent?” And on ABC’s “This Week” on Sept. 29, Schiff referred to the president “coercing Ukraine to dig up dirt on his opponent or manufacture it.”", "We asked Schiff’s office how he could claim that Trump had asked Zelensky to “make up” or “manufacture” dirt on Biden. That’s not in the memo of the call, which only says Trump asked Zelensky to “find out what happened” and “get to the bottom of” CrowdStrike and “the server” and told the Ukrainian president that “a lot of people want to find out about [the Bidens] so whatever you can do with the Attorney General would be great.”", "Patrick Boland, a spokesman for Schiff, told us: “The Ukrainian government has already completed an investigation into this matter,” referring to the Bidens, “which resulted in no charges or allegations of wrongdoing. And as a result, any further investigation undertaken under pressure from the president and his agent would be to tarnish and manufacture dirt on a political opponent.”", "That’s Schiff’s interpretation.", "Trump also hasn’t “admitted” to “pressuring” Zelensky, as Schiff said on CNN.", "Schiff’s dramatic parody doesn’t reflect the memo of the call when he said, “By the way, don’t call me again. I’ll call you when you’ve done what I asked.” Trump doesn’t say anything like that, according to the memo. Instead, the memo shows Trump telling Zelensky: “Whenever you would like to come to the White House, feel free to call. Give us a date and we’ll work that out. I look forward to seeing you.”", "We’d recommend readers take a look at the full White House memo, rather than the political theater surrounding it.", "Trump tweeted on Sept. 29 that Schiff should be “questioned at the highest level for Fraud & Treason” and charged Schiff with “lying to Congress.” The president posed the treason issue as a question on Sept. 30, tweeting, “Arrest for Treason?” Social media posts have echoed Trump’s claims.", "But “treason,” defined by the Constitution, is giving “aid and comfort” to “enemies” of the United States, or “levying war” against the U.S. It’s “the only crime expressly defined by the Constitution,” write Paul T. Crane, with the Department of Justice’s Criminal Division, and Deborah Pearlstein, a professor at Yeshiva University Cardozo Law School, for the National Constitution Center. The framers included the treason clause, they note, “not so much to underscore the seriousness of such a betrayal, but to guard against the historic use of treason prosecutions by repressive governments to silence otherwise legitimate political opposition.”", "The Constitution requires an “overt act.” It reads: “No Person shall be convicted of Treason unless on the Testimony of two Witnesses to the same overt Act, or on Confession in open Court.” Crane and Pearlstein explain: “The ‘overt act’ requirement was designed both to limit the kind of substantive behavior treason could punish — only conduct, not mere expression — and to ensure that the conduct itself demonstrated a defendant’s intention to betray the United States.”", "Trump again tweeted about Schiff on Oct. 1, asking why Schiff wasn’t “being brought up on charges for fraudulently making up a statement and reading it to Congress,” in other words, perjury charges.", "As we’ve written before, perjury requires intent to deceive. Federal law says a person commits perjury when he or she is under oath and “willfully subscribes as true any material matter which he does not believe to be true.”", "Schiff didn’t portray his summary of the call as true. He said at the beginning of his remarks, “Shorn of its rambling character and in not so many words, this is the essence of what the president communicates.” And at the end, he added, “This is in sum and character what the president was trying to communicate with the president of Ukraine.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]