["The video was published on YouTube here on July 21, 2020. It was viewed more than 10,000 times before it was removed.", "The eight-minute 23-second video features Philippine President Rodrigo Duterte speaking at a press conference. The Tagalog-language caption of the video states: \"GOOD NEWS! PRESIDENT DUTERTE CONFIRMED THERE IS ALREADY A VACCINE FOR COVID-19!\"", "Identical videos were also shared here and here on Facebook alongside a similar claim about Duterte’s purported COVID-19 vaccine announcement.", "The claim is false; in the video, Duterte urged people to wear a mask and follow social distancing rules because a COVID-19 vaccine was not yet available.", "The video in the misleading post was taken from this Philippine government video broadcast on July 21, 2020. The footage shows Duterte meeting with several officials and providing an update about the country’s COVID-19 response.", "A closer examination of the video in the misleading post and the original video found no comments from Duterte about a newly-developed COVID-19 vaccine.", "At the three-minute 48-second mark of the video in the misleading post, Duterte’s Tagalog-language remarks translate to English as: \"Actually what I promised you before if there'd be -- what -- this vaccine. There is, in final trials.\"", "At the five-minute one-second mark, he says: \"So just wait a little more. For our plans, put it something like towards the end of the year. But if there is a thing that develops which is really good for you, I will be first -- I will take out loans.\"", "At the five-minute 30-second mark, he states: \"In the meantime, there's nothing. Not in America, Europe, not one for them or two, three. Social distancing, don't yell, don't stay too close to other people. Mask, America, Russia, all, China, mask, this is very important.\"", "This official transcript and this report by state-run Philippine News Agency also do not contain references to Duterte making the purported announcement.", "As of July 27, 2020, the World Health Organization maintains: “WHO is coordinating efforts to develop vaccines and medicines to prevent and treat COVID-19 and will continue to provide updated information as soon research results become available.”", "More than 150 researchers worldwide were in the process of developing and testing a vaccine for the novel coronavirus, AFP reported here on July 22.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]