["About this rating", "Biden's comments in spring 2021 implied that he would take a different stance when his administration completed its rollout of proposed changes to the country's asylum-seeking process.", "In spring 2021, leaders of U.S. President Joe Biden's administration scrambled for solutions to an increase of migrants at the U.S.-Mexico border. Meanwhile, rumors circulated about the new president's message to those people.", "Specifically, social media posts, like the one displayed below, claimed Biden urged migrants to avoid making the trip to southern border crossings altogether.", "The claim was true at face value, though it lacked necessary context to fully comprehend why Biden made the statement.", "During an interview with ABC News' George Stephanopoulos that broadcast on March 16, the president indeed said \"don't come\" to migrants considering the trip due to the bottleneck of people currently waiting at border patrol facilities (in part because the COVID-19 pandemic) and the new administration's proposed plans to reform the asylum-seeking process.", "Before we analyze that media appearance, let this be clear: The numbers of both unaccompanied children and families seeking asylum and waiting for court hearings at the southern border in spring 2021, under Biden, were lower than they were at various points during the Trump administration, according to The Associated Press. U.S. Customs and Border Protection (CBP) data, compiled by The Washington Post, found an annual seasonal bump of migrants at the border during cooler months.", "Now, let's focus on Biden's comments during the ABC interview.", "According to a transcript and video recording of the media appearance, the latter of which we obtained via ABC's website, the president said border officials were indeed instructed to send adult migrants back to their home countries -- denying them access to the U.S. -- and attempting to connect unaccompanied children with social services.", "Simultaneously, he said his administration was trying to establish a new system for people to register for asylum, though he did not provide specifics or an exact timeline for when those changes would take effect. (Homeland Security Secretary Alejandro Mayorkas elaborated on the efforts in an interview with NPR about one month earlier, saying nongovernmental organizations were preparing to identify applicants for asylum based on the severity of their situations and then allow them to register for the status via \"electronic portals.\")", "Then, Stephanopoulos and Biden had the following exchange:", "Stephanopoulos: It’s going to take some time though to get those policies in place again. Do you have to say quite clearly, 'Don’t come'?", "Biden: Yes. I can say quite clearly, \"Don’t come.\" What we’re in the process of getting set up, and it’s not going to take a whole long time, is to be able to apply for asylum in place. So don’t leave your town or city or community. We’re going to make sure we have facilities in those cities and towns run by [Department of Homeland Security] and also access with HHS, the Health and Human Services, to say you can apply for asylum from where you are right now. Make your case. We’ll have people there to determine whether or not you are able to meet the requirement you qualify for asylum. That’s the best way to do this.", "In other words, while Biden indeed cautioned people against making the trip to border crossings in March 2021, his comments implied that he would take a different stance in the future when his administration completed its rollout of changes to the country's asylum-seeking process.", "Days after that interview, the U.S. Embassy to Haiti used its official Twitter account to highlight several of Biden's quotes during the ABC interview -- such as, \"I can say quite clearly, don't come over\" -- in both English and Haitian Creole.", "Considering that evidence, specifically the video interview of Biden with Stephanopoulos, we rate this claim \"True.\"", "It was not the first -- nor the last -- instance of a member of the Biden administration or the president himself cautioning migrants against making the trip to U.S.-Mexico border crossings.", "During his Feb. 12 interview with NPR, for example, Mayorkas said of people attempting to flee Honduras, Guatemala, or neighboring countries: \"It's a very, very important cautionary note that they should not travel to the border.\"", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]