["About this rating", "Among the social media content commonly re-shared after the February 2018 Parkland school shooting in Florida was a meme about the 1996 Dunblane primary school massacre in Scotland, and the lack of school shootings after implementation of a handgun ban:", "The basic facts related in the meme — that the tragedy was soon followed by the passage of restrictive handgun laws, and that no school shootings have occurred in the UK since — are true.", "On March 13, 1996, sixteen children and a teacher were murdered during what is now known as the Dunblane Massacre in which Thomas Hamilton, armed with handguns (which were legal there at that time), entered the Dunblane Primary School and began randomly shooting at students and school personnel before placing one of the guns in his mouth and killing himself.", "Prior gun control legislation in the UK had been influenced by an August 1987 massacre in Hungerford, during which 16 people were killed. After that incident, Parliament passed the Firearms (Amendment) Act of 1988, which banned the ownership of semi-automatic and pump-action rifles, weapons that fire explosive ammunition, short shotguns with magazines, and elevated pump-action and self-loading rifles.", "After the Dunblane school shooting, Lord Cullen led the inquiry into the massacre that produced one of the Cullen Reports, which culminated in a successful campaign to outlaw the purchase and possession of handguns (firearms that had been excluded from the legislation passed after Hungerford) via the Firearms (Amendment) Act 1997.", "By January 2000, 162,198 handguns had been surrendered to the government in a large-scale buyback program.", "Although legislative action following the Dunblane massacre coincided with the last school shooting in the United Kingdom, it did not spell a complete end to mass shootings in that country. On 2 June 2010, 52-year-old Derrick Bird shot and killed twelve people and injured eleven more during an hours-long shooting spree in Cumbria before killing himself.", "Sources", "“Cumbria Shootings: Timeline of Derrick Bird’s Rampage.” BBC News, 25 Mar. 2011. www.bbc.com, https://www.bbc.com/news/10259982.", "“Dunblane Massacre.” Wikipedia, 26 May 2022. Wikipedia, https://en.wikipedia.org/w/index.php?title=Dunblane_massacre&oldid=1089975265.", "“Mass Shootings and Gun Control.” BBC News, 2 June 2010. www.bbc.com, https://www.bbc.com/news/10216955.", "“Parkland Archives.” Snopes.Com, https://www.snopes.com/tag/parkland/. Accessed 26 May 2022.", "“The Cullen Reports.” Wikipedia, 6 Nov. 2021. Wikipedia, https://en.wikipedia.org/w/index.php?title=The_Cullen_Reports&oldid=1053901714.", "The Firearms (Amendment) (No. 2) Act 1997 (Commencement) Order 1997. https://www.legislation.gov.uk/uksi/1997/3114/contents/made. Accessed 26 May 2022.", "“The Life and Death of Thomas Watt Hamilton.” The Independent, 17 Mar. 1996, https://www.independent.co.uk/news/uk/home-news/the-life-and-death-of-thomas-watt-hamilton-1672323.html.", "Cohen, Nick.   \"The Life and Death of Thomas Watt Hamilton.\"\r\n    The Independent.   17 March 1996.", "Legislation.gov.uk.   \"The Firearms (Amendment) (No. 2) Act 1997 (Commencement) Order 1997.\"\r\n    Accessed 16 February 2018.", "Parliament.uk.   \"The Firearms (Amendment) Acts 1997.\"\r\n    Accessed 16 February 2018.", "BBC News.   \"Mass Shootings and Gun Control.\"\r\n    2 June 2010.", "BBC News.   \"Cumbria Shootings: Timeline of Derrick Bird's Rampage.\"\r\n    25 March 2011.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]