["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In the six months since a gunman killed his mother, six educators and 20 children in Newtown, Conn., gun control legislation has ground to a halt in Congress. In the face of political opposition, mainly from Republicans but also from some Democrats, the White House has readied a more limited approach in a package of executive orders aimed at reducing gun violence.", "Vice President Joe Biden outlined those measures in a press conference Tuesday, emphasizing that President Barack Obama will still press for a new law. In making the case, Biden said, \"Since Newtown, more people have died at the end of a gun than we have lost in Afghanistan. Pretty astounding. Pretty astounding. And Iraq, as a matter of fact. Over 5,000. That's no way to run a country.\"", "Obama repeated Biden’s stat in a tweet. Readers asked us if the number was right, so we decided to take a look at his numbers.", "The White House press office told us that Biden was speaking about American casualties since the start of the war in Afghanistan. That number is 2,106, according a fact sheet updated daily by the U.S. Defense Department. Another tally, maintained by the Associated Press, shows nearly the same figure.", "Firearm deaths are more difficult to count. Biden relied on a database assembled by Slate, an online magazine. The numbers there come from average people who send links of newspaper stories about gun deaths in their communities; we found no duplicate entries. This approach is likely to undercount deaths, and it still shows some 5,176 fatalities in the six months since Newtown.", "The numbers back up Biden’s claim. In a span of half a year, there were more than 5,000 gun fatalities in the United States. In a dozen years, fewer than half that number of Americans died in the war in Afghanistan. Biden also referred to Iraq. Deaths there reached 4,422, according to the Pentagon. That’s higher, but still less than fatalities due to firearms in America since mid December, 2012.", "We should note that Slate’s statistics don’t distinguish among suicides, homicides, accidents and law enforcement actions.", "Also, Biden's comparison doesn't take into account that the deaths occurred in populations of very different size.", "When Biden said \"that’s no way to run a country\", that would take in the entire U.S. population. We calculated the death rates implicit in his claim. When you do the math for the 5,176 gun deaths and the population base is over 316 million, the rate turns out to be .016 per 1,000.", "To make the same calculation for American service fatalities in Afghanistan, we contacted the Defense Department to determine the number of people at risk. The total number of soldiers deployed in that country for Operation Enduring Freedom is a bit over 823,000. The death rate comes out to 2.56 per 1,000. That’s nearly 150 times bigger than the death rate by guns in the United States since Newtown.", "A similar calculation for Operation Iraqi Freedom yielded a rate of 3.97 deaths per 1,000.", "To get a longer term view of firearm fatalities in America, we went to a database run by the Centers for Disease Control. There we learned that between 2001 and 2010, the rate was .103 per 1,000. That’s higher than the rate since Newtown but still 25 times smaller than for the Afghanistan war.", "Lastly, it’s important to note that one expects deaths in a war zone. The gun deaths in the United States represent deaths during peacetime.", "Biden said America has lost more people to guns since Newtown than it has in the war in Afghanistan. He is correct that more than twice as many people died in the past six months as did in 12 years of fighting. We rate his statement True.", "Barack Obama Twitter feed, Biden on gun deaths, June 18, 2013", "ABC News, Biden gun control speech, June 18, 2013", "U.S. Defense Department, Casualty count, June 19, 2013", "PolitiFact Georgia, Congressman uses wrong words on gun claim, February 20, 2013", "Slate, How many people have been killed by guns since Newtown?", "U.S. Census, Population Clock", "Email interview with Nate Christensen, Defense Department Press Office, June 19, 2013", "Centers for Disease Control, National Electronic Injury Surveillance System -- Fatal Injury Reports, 2010", "RAND, Army Deployments to OIF and OEF, 2010", "National Academies Press, Returning home from Iraq and Afghanistan, 2010", "Many Eyes, Number of OIF/OEF by state, 2010", "Iraq Body Count", "The Guardian, Afghanistan civilian casualties, April 12, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]