["On June 24, The Hindu reported, “Pune district reported more than 192 new COVID-19 cases, the highest surge till now over a 12-hour span, taking the district’s case tally to 17,043.” In the backdrop of this, a 30-second video is being shared where a man lying on the roadside is put inside an ambulance by medical workers dressed in protective suits. “Corona patients have started appearing in public places on the streets of Pune,” reads the accompanying claim.", "Several Twitter users have posted (1, 2) the video.", "Corona patients have started appearing in public places on the streets of Pune 😢 The situation is dire, kindly please take care of yourself and your family Stay safe …🙏🏻#corona #pune pic.twitter.com/Qr7UWBEyW5", "— Naser (@Naser23111034) June 23, 2020", "Alt News has received several requests to fact-check this on WhatsApp (+917600011160) and on our official Android application.", "Alt News performed a keyword search and found that Pune Mirror had uploaded the video. As per their report, Pune Municipal Corporation (PMC) health officials conducted a mock drill at the Deccan Corner to calculate the response time of authorities in case of a COVID related emergency.", "#PMC health officials conducted a mock drill at Deccan Corner to know the response time of concern authorities in case a COVID related emergency arises#coronavirus #coronavirusinindia #CoronaOutbreak pic.twitter.com/D4XQe6HEpX", "— Pune Mirror (@ThePuneMirror) June 23, 2020", "Mayor of Pune Murlidhar Mohol also tweeted the video and clarified the same. He wrote in Marathi, “A mock drill was conducted in Pune today, against the backdrop of corona infection in the Deccan area. This mock drill is done to check the alertness of all the systems. But this video is being spread in a different sense in social media. Please take note!”", "पुण्यात आज डेक्कन परिसरात कोरोना संसर्गाच्या पार्श्वभूमीवर मॉक ड्रिल करण्यात आले होते. सर्व यंत्रणांची सतर्कता तपासण्यासाठी हे मॉक ड्रिल करण्यात येत असते. मात्र या व्हिडीओचा वापर करुन वेगळ्या अर्थाने समाजमाध्यमांमध्ये पसरवला जात आहे. कृपया आपण सर्वांनी याची नोंद घ्यावी ! pic.twitter.com/EPHYBR5Bv6", "— Murlidhar Mohol (@mohol_murlidhar) June 23, 2020", "Thus, a video of a mock drill conducted by PMC authorities was falsely shared as an actual coronavirus patient being attended. Earlier, mock drill videos from Bhagalpur Central Jail and Hajipur Jail in Bihar were shared with similar false claims. Another mock drill video conducted by Punjab police was circulating as a genuine COVID-19 case.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]