["A video where individuals sporting BJP sashes can be seen beaten up by a crowd is widely circulating on social media. The accompanying caption reads, “acche din for #BJP in northeast India. During the door to door campaign in the favour of #CAA_NRC_NPR how the people welcoming BJP leaders.”", "acche din for #BJP in northeast India. During the door to door campaign in the favour of #CAA_NRC_NPR how the people welcoming BJP leaders pic.twitter.com/vlwcothyX3", "— shaik sharif (@sharifhyd525) January 19, 2020", "The video has been shared by several users on Facebook.", "Alt News has received multiple verification requests for the video on its official mobile application.", "Alt News had debunked the same video last year when it was viral with the claim that the group of people thrashing BJP members were “Rohingyas and Bangladeshi refugees”.", "This incident had taken place in 2017 in Darjeeling, West Bengal. BJP WB president Dilip Ghosh was allegedly chased and heckled by supporters of Gorkha Territorial Administration’s chairman Binay Tamang. Ghosh was in Darjeeling on October 5, 2017, right after a 104-day strike for a separate Gorkhaland was withdrawn by the Gorkha Janmukti Morcha. The incident was reported by several media outlets, including ABP News. This clip below was broadcast by the channel in October 2017 when the incident had occurred.", "A three-year-old video from West Bengal is thus being shared with the false claim that BJP leaders were thrashed in the northeast during a door-to-door campaign for the Citizenship Amendment Act (CAA) and the National Register of Citizens (NRC).", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]