["About this rating", "On 20 April 2017, CNN posted audio of Attorney General Jeff Sessions saying on a radio show that he was \"amazed\" that a Hawaiian judge on the Ninth Circuit was able to block a revised executive order issued by President Donald Trump:", "We are confident that the President will prevail on appeal and particularly in the Supreme Court, if not the Ninth Circuit. So this is a huge matter. I really am amazed that a judge sitting on an island in the Pacific can issue an order that stops the President of the United States from what appears to be clearly his statutory and Constitutional power.", "The fact that the attorney general referred to a state in the union dismissively as an \"island in the Pacifc\" (Hawaii) prompted some Americans to question whether he really had said it. Sessions did make the comment during the 18 April 2017 airing of the Mark Levin Show, from which CNN posted an abridged version of Session's comment which can be heard here:", "(The full version of Levin's 18 April 2017 show can be heard on his web site, with Session's comments regarding the \"island in the Pacific\" otherwise known as the state of Hawaii just after the 1 hour-5 minute mark.)", "Levin and Sessions were discussing the fact that U.S. District Court Judge Derrick Watson had issued a 43-page ruling on 15 March 2017 blocking a revised executive order that sought to ban entry into the United States of travelers from six majority Muslim countries: Iran, Libya, Somalia, Sudan, Syria and Yemen. In his ruling, Judge Watson stated that the order unfairly targeted Muslims and cited President Trump's words in which he referred to a \"Muslim ban\" as evidence of that intent.", "Sessions' comment was cited by critics as yet another example of the Trump administration's trying to delegitimize the power of the judicial branch, one of the \"checks and balances\" put in place by the nation's framers to avoid overreach by any one branch of government. Angry that his travel ban had been blocked the first time in February 2017, the president took to Twitter to write, \"The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!”", "As a candidate, Trump had also said a judge of Mexican heritage wasn't fit to oversee a lawsuit against him because if elected, Trump had plans to build a border wall. “I have a Mexican judge,\" Trump had said. \"He’s of Mexican heritage. He should have recused himself, not only for that, for other things.”", "Kaczynski, Andrew. \"AG Sessions Says He's 'Amazed' a Judge 'On an Island in the Pacific' Can Block Trump's Immigration Order.\"\r\n  CNN. 20 April 2017.", "CNN. \"Hawaii's Trump Travel Ban Ruling.\"\r\n  15 March 2017.", "Blake, Aaron. \"Jeff Sessions Doesn’t Think a Judge in Hawaii — a.k.a. ‘an Island in the Pacific’ — Should Overrule Trump.\"\r\n  The Washington Post. 20 April 2017.", "Rappeport, Alan. \"That Judge Attacked by Donald Trump? He’s Faced a Lot Worse.\"\r\n  The New York Times. 3 June 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]