["The image was published here by a Facebook page with more than 900 followers.", "Text in traditional Chinese characters and English language superimposed on the image says: “Hong Kong protesters intentionally hit by a taxi” and “Female victim’s legs severely damaged, chance of paralysis”.", "Below is a screenshot of the misleading Facebook post:", "A caption in traditional Chinese language characters alongside the Facebook post translates to English as: “The driver looks severely injured, but it’s just skin injury, while the girl was...Come on, we don’t need a visual look anymore, but real hurt, to treat people the same way as we are treated. Next time should be smart, 12345 kicks off, have you played basketball before? Three people box out on the left side, the other two cut in. Easy but serious injury can be made by many ways, for example cutting off the artery with sharp tools, stepping on the throat with feet, sealing one’s nose with glue paper for 30 seconds, then punching and kicking without letting one breathe and so on. Make sure that the person will never recover, leaving some permanent damage!!!", "“(There are protesters who said the girl is not injured as severely as what the picture shows, but please remember, the injured protesters over these months, while today this driver is only slightly hurt, and let the world know the hardline protesters acted so gently to those hurting them, in which this is so contradictory!)”", "The post references an incident at a pro-democracy protest in Sham Shui Po on October 6, 2019, in which a taxi driver drove his vehicle into protesters.", "Hospital authorities said three people were taken to hospital in a serious condition after the crash. Here is an AFP report about the protests on October 6.", "The photo was also shared on Facebook here, here, here and here with a similar claim. The image was also shared here on Instagram and here on Hong Kong forum LIHKG with a similar claim.", "But the image is being shared in a misleading context; it has circulated online since at least 2017 as a stock X-ray image.", "A reverse image search on Google found it was published in this January 11, 2017, post on Pikabu, a Russian-language news and discussion website, by user VinylDJ.", "The post’s Russian-language headline translates to English as: “Unusual and scary x-rays”.", "Below is a screenshot comparison of the misleading picture (L) and the image from Pikabu (R):", "The image also appeared here on Pinterest.", "The only comment on the post states: “Radcom Case #1 Anterior View. Fractured at: Lateral Surface, Anterior Border, Interosseus Surface (and Oblique Line?).”", "Below is a screenshot of the image on Pinterest:", "The image also appeared here on a website called Buy Xrays Online.", "Below is a screenshot of the image:", "On October 7, 2019, a spokesperson for Hong Kong’s Hospital Authority told AFP by phone that of the 30 people, aged 13-92, admitted to hospital after the protests on October 6, three were in a serious condition, 16 were stable and others were discharged or condition was unknown.", "The condition of the pedestrians involved in the Sham Shui Po crash was “unknown”. The taxi driver’s condition was “stable” as of late October 7, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]