["The image was published here on Facebook on August 16, 2020.", "The post’s Hindi caption translates to English as: “After cursing him (Nehru) for six years, now you (Modi) are bowing in respect of the same person. Now understand that their ideology and thinking are so much better than yours.”", "The image was also shared on Facebook here and here and on Twitter here and here.", "The claim is false.", "A reverse image search on Google found that the image has been doctored. The original photo shows Modi bowing to a statue of Mahatma Gandhi, and was published on Modi’s official Twitter account here on August 8, 2020.", "The tweet reads: “Sharing some glimpses from the newly inaugurated Rashtriya Swachhata Kendra.”", "Rashtriya Swachhata Kendra is a memorial centre dedicated to Mahatma Gandhi in Delhi, India’s national capital.", "Sharing some glimpses from the newly inaugurated Rashtriya Swachhata Kendra. pic.twitter.com/bhGF3saejr", "Below is a screenshot comparison of the photo in misleading post (L) and the photo in Modi's tweet (R):", "Video of Modi’s visit to Rashtriya Swachhata Kendra was also published on the prime minister’s official YouTube channel here on August 8, 2020. Modi’s bow before the Gandhi statue can be seen at its 25-second mark.", "A reverse image search found that the photo of the Nehru statue that was used in the doctored image was published here in 2010 by stock photography agency Alamy.", "The statue of Nehru, India’s first prime minister, is located in the west Indian city of Barshi.", "The photo’s caption reads: “Statue of late jawaharlal nehru, Barshi, Solapur, Maharashtra.”", "Below is a screenshot comparison of the statue in misleading Facebook post (L) and the Alamy photo (R) with Alamy’s watermarks visible on Nehru’s arms:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]