["Amidst the controversy on whether or not United Arab Emirates had extended Rs 700 crore to flood-hit Kerala, The Telegraph reported that the Facebook page of UAE President, His Highness Sheikh Khalifa bin Zayed Al Nahyan has featured a news report under the headline “UAE Pledges Rs-700-crore Kerala relief and rehabilitation”.", "The article went on to state that “sources familiar with the UAE said that it would be inconceivable that the official site of the President would post a canard and continue to keep it there for days. Some sources went to the extent of describing the post as “a virtual endorsement”. So, is there truth behind the claim that an official site of the President of UAE has shared a news report about the Rs. 700 crore aid?", "It may be noted that this Facebook post copy-pasted the article published by The News Minute, which reported on this alleged offer after a press conference by Kerala CM Pinarayi Vijayan.", "UAE Pledges rs-700 crore kerala relief and rehabilitation", "Coming as a major relief for Kerala, which is struggling to…", "Posted by Khalifa bin Zayed Al Nahyan on Tuesday, August 21, 2018", "The news item led to expected speculation about the aid offer. “Would the President of the United Arab Emirates, Sheikh Khalifa, reproduce a news report of the Rs 700 crore aid his country wanted to give Kerala on his Facebook page if such an offer hadn’t been made in the first place?” No, he wouldn’t and he didn’t. That is because the President of the United Arab Emirates is not on Facebook.", "Would the President of the United Arab Emirates, Sheikh Khalifa, reproduce a news report of the Rs 700 crore aid his country wanted to give Kerala on his #Facebook page if such an offer hadn’t been made in the first place? #KeralaFloodRelief @ttindia @pmoindia @MEAIndia pic.twitter.com/0drcsKSV3R", "— churumuri (@churumuri) August 25, 2018", "Even a cursory glance at the Sheikh Khalifa bin Zayed Al Nahyan page that posted the news report would reveal that this is not an official page of the President of the United Arab Emirates. The number of followers and the absence of the verified blue tick on the page point to the fact that this cannot be the official page of a Head of State. The page information states that it is managed by one Christopher Butler who works at a finance company in Istanbul. The page posts news reports in English mainly related to Sheikh Khalifa and the UAE.", "Many leaders of the UAE government are active on social media. These include Sheikh Mohammad bin Rashid Al Maktoum, Vice-President and Prime Minister of the UAE and Ruler of Dubai who has 9.35 million followers on Twitter and 3.8 million followers on Facebook. Sheikh Mohammed bin Zayed Al-Nahyan, the Crown Prince of Abu Dhabi and Deputy Supreme Commander of the UAE’s Armed Forces is also active on Twitter with close to 2 million followers.", "With the exception of occasional tweets, both them post exclusively in Arabic. This is basic check that The Telegraph should have done before suggesting that a page with less than 6000 followers belongs to the President of United Arab Emirates.", "The Telegraph ought to have been extra careful when commenting on a news item as contentious as the Rs 700 crore aid to Kerala on the basis of an unverified social media account. Surprisingly, the news report made it to the front page of the paper without the most basic of fact checks. The so-called “sources” of the publication seem uninformed to confirm that a post by an unverified page with less than 6000 followers could be “a virtual endorsement” of the aid. The “sources familiar with the UAE” also did not spot that an “official” page that posts content exclusively in English simply cannot be the official page of the President of the United Arab Emirates.", "Donate Now", "Follow @free_thinker", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]