["About this rating", "Rap artist T.I., also known by his full name as Clifford Joseph Harris, Jr., received widespread backlash for an interview in which he claimed to take his daughter to be examined by a gynecologist annually to check whether she remains a virgin.", "T.I. made the comments during a podcast interview on Nov. 5, 2019, which has since been taken down. The comments drew harsh criticism prompting podcast hosts Nazanin Mandi and Nadia Moham, of the show \"Ladies Like Us,\" to apologize. Mandi and Moham posted on the social platform Instagram that they regretted their reaction to T.I.'s statements but said that they were caught off guard by them.", "A post shared by Ladies Like Us Podcast (@theladieslikeuspodcast) on Nov 7, 2019 at 7:37am PST", "T.I. has remained silent. Our email to his record label with questions about his comments went unanswered, and he has made no statements to the news media or on social media. His daughter, 18-year-old model Deyjah Harris, has also avoided commenting directly on the matter.", "During the podcast episode in question, T.I. stated, \"This is what we do: Right after the birthday, we celebrate. And usually like the day after the party, she’s enjoying her gifts, I put a sticky note on the door: 'Gyno. Tomorrow. 9:30,'\" according to the Los Angeles Times:", "The Atlanta rapper, who also goes by the nickname Tip, went on to explain that the physician — “maintaining a high level of professionalism” — always tells him that his daughter has to sign away her privacy before results can be shared, and always tells him that a hymen can be broken in many ways that do not involve sex.", "“I say, ‘Look, doc, she don’t ride no horses, she don’t ride no bike, she don’t play no sports. Man, just check the hymen please and give me back my results expeditiously,’” he said, referring to “results” that legally belong to his daughter.", "The comments were quickly and broadly condemned, while gynecologist Jennifer Gunter took the opportunity to write a 12-tweet, mini-lecture that points out the hymen isn't an indicator of virginity:", "The hymen means nothing physically and hymen exams are medically not a thing and are unnecessary. And support a disgusting patriarchal trope. 11/12 pic.twitter.com/D1EjoqZeiB", "— Jennifer Gunter (@DrJenGunter) November 6, 2019", "In 2018, three United Nations agencies, the World Health Organization, UN Human Rights, and UN Women called for a ban on such so-called virginity tests, calling them harmful and medically meaningless:", "These examinations are not only a violation of women’s and girls’ human rights, but in cases of rape can cause additional pain and mimic the original act of sexual violence, leading to re-experience, re-traumatization and re-victimization. Many women suffer from adverse short- and long-term physical, psychological and social consequences of this practice. This includes anxiety, depression and post-traumatic stress. In extreme cases, women or girls may attempt suicide or be killed in the name of “honour”.", "Performing this medically unnecessary and harmful test violates several human rights and ethical standards including the fundamental principle in medicine to ‘do no harm’. WHO recommends that this test should not be performed under any circumstances.", "D'Zurilla, Christie. \"Podcasters Are Sorry, But T.I. Is Mum After Talking About Daughter’s Hymen Checks.\"\r\n  Los Angeles Times. 7 November 2019.", "World Health Organization. \"United Nations Agencies Call for Ban on Virginity Testing.\"\r\n  17 October 2018.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]