["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Lake Turkana Wind Power Project in Kenya. (USAID)", "President Donald Trump’s budget outline is just the starting point for debate, but the cuts he’s seeking in foreign aid are among the deepest for any government activity. Under his plan, overall spending for the State Department and the U.S. Agency for International Development (USAID) would fall by about 28 percent.", "Congress controls the purse strings, of course, and in the Senate, David Perdue, R- Ga., likes at least one foreign assistance program.", "\"USAID put $8 billion up and attracted more than $45 billion in a public-private partnership called Power Africa,\" Perdue told NBC News on March 1 (before the budget outline was released).", "Perdue cited Power Africa as an example of how well the public-private approach could work to finance infrastructure in America.", "Power Africa is the signature development project of President Barack Obama. Unveiled in 2013, the goal is to double access to power in sub-Saharan Africa by 2030. With America playing the role of cheerleader and financier, Obama hoped to leverage money from private firms and other governments to build new power plants, transmission lines and small solar power generators to reach millions of people.", "Perdue used the example of Power Africa to buttress the value of public-private partnerships in the context of funding infrastructure construction in America. Our focus is simply on whether Power Africa racked up the numbers that he offered.", "It sort of did, and it sort of didn’t. The difference lies in the gap between money promised versus money committed to specific projects.", "Perdue’s office pointed to the exit memo of Obama’s USAID administrator Gayle Smith. She wrote, \"The United States’ initial $7 billion commitment has mobilized more than $54 billion in commitments from the public and private sectors, including more than $40 billion in commitments from private sector partners.\"", "So give or take a few billion, Perdue’s statement was in line with Smith’s summary. Both the U.S. and the private sector amounts were less than he said, but in the ballpark.", "The real question is, what is a \"commitment?\"", "Todd Moss, a senior fellow at the Center for Global Development in Washington who specializes in Africa and energy development, told us a commitment is a fairly open-ended term.", "\"A commitment is a pledge from the United States that they will spend money in a certain area,\" Moss said. \"It doesn't mean the money will be appropriated, and even if it is appropriated, that will be spent.\"", "And the same holds true on the other side.", "\"These are funds private companies say they will invest, but they might not,\" Moss said. \"These are high-risk commercial ventures. I would be shocked if everything that gets talked about happens. The fact that they are trying to do new things in difficult places is the whole point of the program.\"", "Setting \"commitments\" aside, a more demanding measure looks at the actual dollars the United States has tied up in projects that are moving forward.", "The USAID press office provided harder numbers. The total the United States has spent, loaned or guaranteed so far is about $2.8 billion. That money helped get $14 billion worth of projects underway.", "How does that compare to Perdue’s figures? He said $8 billion leveraged $45 billion, or a ratio of about 1 to 5.6. The current ratio ($2.8 billion to $14 billion) is about 1 to 5. Not quite as good but fairly close.", "These numbers only reveal so much.", "The American role can vary a lot, Moss said. In some cases, a bit of technical guidance is the linch pin. In others, multi-million dollar loans and loan guarantees are key. The influence of the United States across all projects can be tough to generalize.", "To take just one example, construction of a $900 million 450 MW plant in Nigeria got underway in early 2016 with backing from \"20 international banks and equity funders.\" A $58 million loan from the U.S. Overseas Private Investment Corporation was part of the package.", "(It’s worth noting that most loans are repaid, so over time, American taxpayers get that money back.)", "Moss said Power Africa can’t take full credit for every power plant but he does think it can take some.", "\"When you look at the number of actors who have jumped in, and are now working on energy deals, that would be a heck of a coincidence,\" Moss said. \"They (USAID) deserve credit for motivating a lot of investment in the energy sector.\"", "Our ruling", "Perdue said the USAID Power Africa program put $8 billion up and attracted more than $45 billion in outside money. Perdue’s figures represent commitments, not hard money spent. USAID reported $7 billion committed and $54 billion promised from all other sources, with over $40 billion of that coming from the private sector.", "Actual expenditures are at about the same ratio, however, and experts generally say the Power Africa program is creating investment in Africa’s energy sector.", "We rate this claim Mostly True.", "NBC News, Meet the Press Daily, March 1, 2017", "Center for Global Development, Grading Power Africa, Oct. 26, 2016", "USAID, Cabinet exit memo, 2017", "USAID, Power Africa: Annual report 2016, September 2016", "Millennium Challenge Corporation, MCC and Power Africa, accessed March 16, 2017", "Overseas Private Investment Corporation, OPIC data, Sept. 30, 2016", "Aldwych International, Azura-Edo Independent Power Project reaches financial close and enters construction, Jan. 15, 2016", "Interview, Todd Moss, T senior fellow, Center for Global Development, March 16, 2017", "Interview, Caroline Vanvick, press secretary, Sen. David Perdue, March 15, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]