["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Rep. Gina Hinojosa, D-Austin, speaks at a press conference outside of the Texas Capitol on Sept. 4, 2019 (James Gregg/Austin American-Statesman)", "Democrats in Texas are urging Gov. Greg Abbott to call a special legislative session to tackle gun violence in the wake of two mass shootings in the state that left 29 people dead.", "Lawmakers pushing for the session held a news conference outside of the Texas Capitol in early September, including state Rep. Gina Hinojosa, D-Austin, who made an eye-catching claim about eligibility requirements for gun licenses in the state.", "\"You can have an active warrant for your arrest for murder and legally pass a background check system in the state of Texas,\" Hinojosa said.", "Hinojosa’s staff said her claim is true, since the U.S. Department of Justice adopted a new interpretation for \"fugitive from justice,\" meaning the classification only refers to people wanted by law enforcement who have crossed state lines.", "A similar statement was repeated by Democratic state lawmakers during a hearing at the state Capitol on gun legislation at the end of September.", "The claim needs more context. In certain cases, someone with an active arrest warrant for murder could legally pass a background check and buy a gun in Texas, but it depends on where and how the warrant was issued.", "Before we dive into this fact-check, let’s explore the process for running a background check on a prospective gun-purchaser in Texas.", "Federal law requires licensed-gun dealers to run background checks on prospective buyers who do not have a license to carry. (A license is required to carry a handgun in public but is not required to purchase a gun.) Private sellers do not have to conduct background checks before making a sale.", "A person without a license to carry who is buying a gun in Texas from a licensed dealer must undergo a background check by first providing a photo ID and completing a form produced by the Bureau of Alcohol, Tobacco, Firearms and Explosives to determine whether the individual falls into any category of person prohibited from purchasing a firearm.", "Federal and Texas laws state that a person cannot purchase or possess a firearm if the person has been convicted of a felony or certain misdemeanors related to domestic assault and the person's release from confinement or supervision occurred within the previous five years.", "Certain people with a history of mental illness also are barred from purchasing a gun, as is anyone who is considered a \"fugitive from justice\" — a category we’ll explore more in-depth later.", "Texas is not a \"point of contact\" state, which means the FBI runs background checks for prospective purchasers in the state. Once a request has been submitted by a dealer, the FBI has three business days to complete the check. After that period, the sale can go forward — even if the FBI has not completed its review.", "The FBI could later issue a \"delayed denial\" if the agency completes the check after the three-day window and discovers that a sale was completed for an individual who should have been barred from buying a gun.", "At that point, the case is referred to the Bureau of Alcohol, Tobacco, Firearms and Explosives, which is responsible for recovering the firearm.", "Chelsea O’Hara, chief of staff to Hinojosa, said the Democrat’s statement is true under the new federal interpretation of fugitive from justice, a classification that forbids someone from purchasing a firearm.", "Before the shift, a person with an active arrest warrant for murder would have fit the definition, but the new interpretation changes things.", "O’Hara pointed to a news story about the change and provided a copy of a letter distributed by the FBI’s National Instant Criminal Background Check System (NICS) division outlining the claim. She also shared a copy of the ATF form prospective purchasers are required to complete. The form includes the updated definition.", "The FBI and ATF had disagreed on who is considered a fugitive from justice since at least 2008, according to a 2016 audit from the Office of the Inspector General at the Department of Justice.", "Under the FBI’s original definition, any individual with an outstanding arrest warrant would be unable to buy a gun. But the ATF considered a fugitive from justice only a person who has an outstanding arrest warrant and then leaves the state where the warrant was issued.", "In 2017, the Department of Justice sided with the ATF, prompting the FBI to purge the names of tens of thousands of people wanted by law enforcement agencies from its background check database, according to The Washington Post.", "A handful of states prevent anyone with an arrest warrant from purchasing a firearm, but Texas is not one of them.", "The FBI’s original definition for fugitive from justice would have included individuals with active warrants for their arrest for murder and other charges, thereby preventing them from buying a gun.", "But under the new definition, the existence of an arrest warrant on its own is no longer enough to deny the sale or transfer of a firearm to an individual, according to a statement provided by the National Instant Criminal Background Check System division at the FBI.", "In other words, the fugitive from justice statute would not necessarily stop a person with an active arrest warrant for murder issued in Texas from passing a background check to purchase a gun in the state.", "But such a person might be stopped by a different portion of the law.", "In addition to preventing fugitives from justice or people recently convicted of felonies or certain misdemeanors involving domestic violence from purchasing guns, the law also bars gun purchases for people with active arrest warrants that have \"been issued pursuant to an indictment for a crime punishable by imprisonment for a term exceeding one year,\" according to ATF spokeswoman Carolyn Gwathmey. This would include murder charges.", "Generally, an arrest warrant can be issued at the discretion of a judge or by way of a grand jury indictment, depending on the circumstances of a case. In murder cases, it is more common for a warrant to be issued by a judge than from a grand jury, to get a suspect off the street and into custody as soon as possible.", "Jennifer Szimanski, a public affairs officer at the Combined Law Enforcement Associations of Texas and a former detective at the Austin Police Department, said the investigating team might pursue an arrest warrant from a judge if they have \"very strong evidence of a crime being committed and the case appears ironclad.\"", "She said investigators might pursue an indictment from a grand jury if \"the evidence is not as strong and mostly circumstantial\" but investigators are confident they’ve identified the right suspect.", "\"So your basic question, can someone wanted for murder roll into a gun store in Texas and buy a gun? The answer is yes — if that person’s warrant was issued just by a judge and doesn’t involve an indictment, and if there is no evidence readily available to the FBI or ATF that (the person) somehow sought to avoid that warrant,\" said David Chipman, a senior policy advisor at the Giffords Law Center and a former special agent at ATF.", "The idea behind the policy is that an individual would not lose their ability to access firearms until they have been convicted of a crime, according to John Donohue, a law professor at Stanford University.", "\"It’s certainly true that if there is more (in a person’s history) than just an arrest warrant, you may be curtailed,\" he said. \"But on its face, the statement says if you’re in Texas buying a gun with a warrant for arrest as a Texas resident, you’re probably fine. To me, that seems absolutely ludicrous. But it is the law.\"", "Hinojosa said, \"You can have an active warrant for your arrest for murder and legally pass a background check system in the state of Texas.\"", "Hinojosa’s claim needs more context. It’s true that certain people with active arrest warrants for murder could legally pass a background check in Texas and purchase a gun — but only if the warrant was issued prior to an indictment and if it originated in Texas.", "If an arrest warrant for murder was the result of an indictment or was issued in another state, the person could not pass a background check.", "We rate this claim Mostly True.", "MOSTLY TRUE — The statement is accurate but needs clarification or additional information.", "Email interview with Chelsea O'Hara, chief of staff for Gina Hinojosa, Sept. 5, 2019", "Washington Post, Tens of thousands with outstanding warrants purged from background check database for gun purchases, Nov. 22, 2017", "Letter from the Federal Bureau of Investigation regarding \"persons who are fugitives from justice, Feb. 15, 2017", "Texas Government Code, Sec. 411.172", "Texas Penal Code, Chapter 1; Chapter 19", "Cornell Law School’s Legal Information Institute, 18 U.S. Code § 922.Unlawful acts", "Federal Bureau of Investigation, 2018 NICS Operations Report, accessed Sept. 9, 2019", "Federal Bureau of Investigation, About NICS, accessed Sept. 9, 2019", "Email interview with Holly Morris, spokesperson for the FBI’s Criminal Justice Information Services Division, Sept. 11, 2019", "Office of the Inspector General at the U.S. Department of Justice, Audit of the Handling of Firearms Purchase Denials Through the National Instant Criminal Background Check System, Sept. 2016", "The Trace, Gun Background Check Change Could Put Weapons in Fugitives’ Hands, March 13, 2017", "The Trace, Murder Suspect Who Sought Gun Shows Risk of New Rule for Fugitives and Background Checks, Dec. 11, 2017", "Atlanta Journal-Constitution, Trump Administration change allows some facing arrest to buy guns, Oct. 10, 2017", "Email Interview with ATF spokesperson Carolyn Gwathmey, Sept. 19, 2019", "Phone interview with David Chipman, policy advisor at Giffords and former ATF agent in Texas, Sept. 19, 2019", "Phone interview with John Donohue, Law professor at Stanford University, Sept. 19, 2019", "Phone interview with Kevin Lawrence, executive director of the Texas Municipal Police Association, Sept. 19, 2019", "Email interview with Jennifer Szimanski, public affairs officer at the Combined Law Enforcement Associations of Texas, Sept. 20, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]