["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A group of women help harvest maize in Lupembelwasenga, Tanzania. (Tara Clerkin/Clinton Foundation)", "While the details are vague, foreign aid is on the chopping block in President Donald Trump’s pending budget. Non-military assistance accounts for less than 1 percent of federal spending and defenders of aid would like to argue that it actually pays dividends to America.", "Shenggen Fan, the head of the International Food Policy Research Institute, a widely respected organization, said his group had a study showing very specific paybacks tied to aid.", "\"If we help the countries developing to invest in agriculture research, every $1 invested will bring $4 (in) trade with the countries and the United States,\" Fan said Feb. 2 at a meeting in Washington. \"So if you're investing in foreign aid, you’re generating employment back in the U.S. It helps economic growth here in this country.\"", "Fan’s office said he was referring to a 1996 article that described a sort of domino effect. Agricultural research leads to higher production, which in turn delivers economic growth and the extra income generates demand for more imports.", "\"When the flow of additional imports over time is taken into account, the $1 investment in agricultural research generates $4.39 of additional imports,\" the article said.", "That seems to back up Fan’s point, but it terms of what it means for sales by American companies, he pushed the findings a little too far. The article specifically noted that there’s no guarantee \"that a particular donor country captures the gains from the increase in exports.\"", "Put another way, an investment of $1 might spur $4 in trade, but there’s no guarantee the original investor will be the one to benefit. Fan posted an item later that dialed back on the trade gains, writing that they would help \"economies like the United States or Germany.\"", "In addition, that study is 20 years old, and we could find no other study that reached the same conclusion.", "Fan’s office cited a 2006 analysis from the Australian Centre for International Agricultural Research. The center wanted to gauge the economic impact of the work it funded. It did find that research boosted trade, but for a number of reasons, that result didn’t do much to bolster Fan’s case.", "In the first case, the Australians defined trade gains broadly to include increased sales by Aussie firms to developed countries such as Japan. On top of that, they didn’t find a 4-to-1 payback on trade. When we crunched their numbers, it was more like 1-to-1.", "The authors also warned that their dollar amounts were based on projected rather than actual benefits. \"It is possible that these benefits never actually emerged or that the benefits that did emerge were considerably greater,\" they wrote.", "We asked a number of researchers if they knew of any study that linked foreign aid for agricultural research to greater exports for American firms. Not one could think of such work.", "\"We are not aware of other quantitative estimates of a relationship between investment in agriculture in foreign countries and trade,\" Cheryl Christensen of the USDA’s Economic Research Service told us.", "The consensus that emerged was that the domino effect Fan had in mind might take place in some countries, but no analysis had pulled all the pieces together.", "\"I believe that our foreign aid to agriculture is effective and can boost agricultural production and rural income in developing countries,\" Phillip Abbott, professor of agricultural economics at Purdue University, told us. \"As countries grow, they may well  -- many do -- need more food than they can produce themselves, and this leads to greater imports, including agriculture imports from U.S. agriculture. Turning this into a causal chain with a fixed multiplier, as claimed by Fan, is a stretch.\"", "Robert Paarlberg at Harvard University’s Kennedy School said plenty of research ties aid to greater productivity and rising incomes.", "\"But it starts to become difficult when you look for links back to foreign aid, especially agricultural development aid,\" Paarlberg said. \"There the links remain plausible, at least in countries capable of using aid well, but they become too remote to estimate with any confidence.\"", "Our ruling", "Fan said every dollar of foreign aid for agricultural research \"will bring $4 in trade with the countries and the United States ... generating employment back in the U.S.\" A 1996 article supports most of that assertion except for the part about all the trade being with the United States. However, that article is 20 years old and we could find no other study that mirrored its findings.", "The leading agricultural researchers we reached told us that in some countries, that general result might come about, but it varies from place to place and it is difficult to show the connection to foreign aid in the agricultural research sector.", "So Fan went too far on three points: the 4-to-1 payback, the amount of trade with the United States and the idea that this general rule applies to most countries when it is actually less predictable.", "We rate this claim Mostly False.", "Food Tank, How to Cultivate Food Security, Feb. 2, 2017", "World Hunger, Foreign Assistance to Agriculture: A Win-Win Proposition, Fall 1996", "Medium, Aid to end hunger is a win-win investment, Feb. 13, 2017", "U.S. Department of Agriculture, Income Growth in Developing Countries Can Increase U.S. Agricultural Exports, March 14, 2011", "Australian Centre for International Agricultural Research, Benefits to Australia from ACIAR-funded research, September 2006", "University of Georgia, The Impact of Agricultural Aid on Agricultural Sector Growth, February 2008", "University of Nottingham Centre for Research in Economic Development and International Trade, New Evidence on the Impact of Foreign Aid on Economic Growth, accessed Feb. 27, 2017", "Email interview, Julian Alston, professor, Department of Agricultural and Resource Economics, University of California Davis, Feb. 28, 2017", "Email interview, C. Parr Rosson, professor of agricultural economics, Texas A&M University, Feb. 28, 2017", "Email interview, Adugna Lemi, PhD, department Chair and associate professor of economics, University of Massachusetts Boston", "Email interview, Phillip Abbott,  Professor, Department of Agricultural Economics, Purdue University, Feb. 27, 2017", "Email interview, Cheryl Christensen, Chief, Food Security and Development Branch, Economic Research Service, U.S. Department of Agriculture, March 1, 2017", "Email interview, Robert Paarlberg, adjunct professor in global food policy, Kennedy School, Harvard University, Feb. 28, 2017", "Interview, Drew Sample, head of media, International Food Policy Research Institute, Feb. 27, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]