["Twitter user ‘Raji Hindustani’ shared two photographs and claimed that Chennai police inspector Akilan was attacked by three Muslim youths in Chennai’s Tiruvallikeni. The user added that the youths were abusing women under the influence of cannabis when the cop apprehended them. Shefali Vaidya quote-tweeted this tweet drawing over 2,300 retweets. She also drew parallels with the recent Bengaluru riots where an alleged defamatory post against Muhammed, the Prophet of Islam, had sparked communal violence.", "Raji Hindustani’s tweet was also picked up on Facebook.", "A reverse image search took us to a Facebook post by Tamil Nadu police where the same photographs were shared. The post was made in 2017. Tamil Nadu police wrote that policeman Akilan was attacked with a knife at Marina beach and one person was caught for the crime.", "சமூக விரோதிகாிகளின் ஊடுருவல் அதிகமாகும் தமிழகம்.", "மெரினாவில் குடிபோதையில் சுற்றி திரிந்த மூன்று சமூக விரோதிகளால்…", "Posted by Tamilnadu Police on Sunday, 20 August 2017", "A subsequent keyword search led us to a report published in The Times of India on April 22, 2017, which said that “a constable from the armed reserve force was patrolling the beach when he noticed two youngsters consuming liquor opposite to the slum clearance board apartments.” He was attacked when he asked the two men to leave the area. Hari Ram of Anna Nagar was taken into custody while the other man fled the scene. Police booked Hari Ram under charges of attempt to murder and remanded him in judicial custody.", "Marina police station sub-Inspector Ramesh Babu told India Today that the name of the other accused was Dinesh.", "A three-year-old incident of a cop attacked by two men at Chennai’s Marina beach was revived on social media with false claims. The men were apprehended for consuming alcohol in the area at night and not for “abusing women” under the influence of cannabis. Furthermore, neither hailed from the Muslim community.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]