["About this rating", "In August 2019, Jeffrey Epstein, the billionaire money manager who stood accused of sexually abusing dozens of underage girls, died in a Manhattan federal jail while awaiting trial. Epstein's death, reported as a suicide, drove a whole new wave of conspiracy theories about the man who allegedly recruited numerous young girls for sexual abuse at his homes in New York and Palm Beach.", "Many of those conspiracy theories focused on Little St. James, a 72-acre private island Epstein owned in the U.S. Virgin Islands that had supposedly been dubbed \"Pedophile Island\" and \"Orgy Island\" by locals. In particular, one theory spread via social media held that \"bones of children have been found on Epstein's island\" and questioned \"why isn't this headlines on every major network?\":", "As is usually the case, the answer to the question of why this seemingly momentous piece of information hasn't been reported by reputable news organizations is because it isn't true.", "This rumor appears to have originated with an article published a few days after Epstein's death by WhatDoesItMean.com, a notorious purveyor of conspiracy-based junk news:", "FBI Divers Recover Human Bones in Waters Off Epstein “Orgy Island” as “Deep State” Meltdown Accelerates", "A beyond shocking highly classified “Of Special Importance” new Foreign Intelligence Service (SVR) report circulating in the Kremlin today noting that the American prison system has sunk to third world status -- as even Mexico provided video of drug lord El Chapo’s prison escape — states the fury and humiliation over the death of child sex slaver Jeffrey Epstein seething through a US Department of Justice (DoJ) responsible for his staying alive to stand trial, has now been met by an “appalled and angry” US Attorney General William Barr — who yesterday vowed “no one complicit in Epstein’s crimes will escape punishment”— crimes which now may include murder after an elite team of FBI investigators and divers invaded Epstein’s “Orgy Island” fortress in the Caribbean yesterday — whose most stunning discovery are believed to be human bones of young children found in the waters below Epstein’s satanic temple.", "According to the portions of this highly classified report we’re permitted to reveal, in mid-July the FBI requested a temporary export permit from the Foreign Ministry for an advanced underground radar system — a request granted under standard permit protocols stating that such goods and technology exported must always be controlled by a Russian entity — and in this case was a SVR expert technologist able to operate the world’s most advanced underground radar system used exclusively by the Russian military which can recognize ferrous metal and non-ferrous metals at depths up to 5 meters called the Deep-Earth Metal Detector MG-1 — who after being directed by the FBI to probe the exterior grounds of Epstein’s satanic temple, saw this advanced underground radar system detecting an approximate 1 meter (about 3 feet) tubular metal pipe extending from the base of this satanic temple and disappearing into the waters below it — after which FBI divers began bringing up from these waters what appeared to be small human bones and skulls this SVR expert technologist likened to those one would see coming from the graves of young children.", "As RationalWiki notes, WhatDoesItMean.com articles are attributed to \"Sorcha Faal,\" whose shtick is presenting shocking and secret information unreported by any legitimate news outlets, which \"Sorcha Faal\" has supposedly obtained from Russian government and intelligence sources:", "Sorcha Faal is the alleged author of an ongoing series of \"reports\" published at WhatDoesItMean.com, whose work is of such quality that even other conspiracy nutters don't think much of it.", "Each report resembles a news story in its style, but usually includes a sensational headline barely related to reality (e.g. \"American Rebel Forces Attack Gas Pipelines, Explode Trains As US Civil War Nears\"[8]) and quotes authoritative high-level Russian sources (such as the Russian Federal Security Service in the same article) to support its most outrageous claims. Except for the stuff attributed to unverifiable sources, the reports don't contain much original material. They are usually based on various news items from the mainstream media and/or whatever the clogosphere is currently hyperventilating about, with each item shoehorned into the conspiracy narrative the report is trying to establish. The author also has the habit of adding unnecessary links to the websites of the various Russian institutions they mention.", "The FBI had reportedly raided Epstein's estate on Little St. James just before the salacious WhatDoesItMean.com article was published, but agents did not disclose finding any human bones (adult or otherwise) on or around the island:", "FBI agents — accompanied by Customs personnel, local police and New York City officers, according to a Virgin Islands source — fanned out in golf carts across Epstein’s estate on Little St. James Island. They scooped up evidence just two days after Epstein was found dead in his jail cell of an apparent suicide while in federal custody in Manhattan.", "Epstein, 66, was found dead in his cell at the Metropolitan Correctional Center in New York City, one day after a federal court unsealed nearly 2,000 pages of Epstein-related documents that offered sordid details of the alleged trafficking of girls by the financier and his ex-girlfriend and purported madam, Ghislaine Maxwell.", "The documents alleged a conspiracy that took place over a number of years in the early- to mid-2000s, with Epstein’s island — and his waterfront estate in Palm Beach — as frequent backdrops.", "In one record, a butler described an interaction he’d had with a 15-year-old au pair who came to the United States from Sweden. The butler, who like the au pair worked for two of Epstein’s close friends, said she had been taken to the private island and ordered to have sex with Epstein and others. In his sworn statement, the butler said that the girl, distraught and sobbing, told him that Epstein and Maxwell had physically threatened her and taken her passport to keep her on the island.", "In other sworn testimony, Virginia Roberts Giuffre, one of Epstein’s victims, said that Epstein once held a dinner for Bill Clinton on the island. The former president, who has acknowledged traveling multiple times on Epstein’s private jet, has denied ever being on Little St. James.", "The false WhatDoesItMean.com report about the discovery of children's bones around Epstein's private island was then amplified by the usual methods, through social media posts and videos that repeated its false claims without informing viewers about the source and unreliability of those claims:", "Children's bones were found under water by FBI divers next to Epstein's Pedo island.#PedoGate, #PizzaGate & #PedoWood are real. People need to wake the F up! These are children we are talking about! F a political party!\nhttps://t.co/O3u4qbGJ22", "— ♰??? A Anon ⭐⭐⭐ (@AAnon_QsArmy) August 15, 2019", "Faal, Sorcha.   \"FBI Divers Recover Human Bones in Waters Off Epstein 'Orgy Island' as 'Deep State' Meltdown Accelerates.\"\r\n    WhatDoesItMean.com.   13 August 2019.\r\n\r\nBy: Sorcha Faal,", "Chang, Daniel.   \"FBI Raids Jeffrey Epstein’s ‘Pedophile Island’ Estate as Investigation Continues.\"\r\n    Miami Herald.   12 August 2019.", "Levin, Jonathan et al.   \"Mystery Surrounds Jeffrey Epstein’s Private Island in the Caribbean.\"\r\n    Los Angeles Times.   12 July 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]