["A viral online story claims that Democratic U.S. Rep. Alexandria Ocasio-Cortez said Christianity should be ignored as \"superstitious nonsense.\"", "The article, by website newsservis.com, has been viewed more than 216,000 users on Facebook since it was posted on Jan. 9.", "It’s also completely made-up.", "The article was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The article starts off by saying Democrats are well known \"for being anti-Christianity,\" and claims Ocsio-Cortez recently said this about the religion:", "\"That religion is all very superstitious. They believe in all this nonsense. They believe in things that they don’t understand, so they suffer. Superstition ain’t the way…\"", "The entire account is fabricated. It has been lifted from the website, \"Taters Gonna Tate,\" a self-described satire site. Unlike the newsservis.com page, that website includes a disclaimer that says everything on it is \"fiction.\"", "According to the Pew Research Center, Ocasio-Cortez identifies as Catholic and has talked about her faith in the past.", "We rate this claim Pants on Fire!", "Newsservis.com, AOC says Christianity should be ignored as \"superstitious nonsense\", Jan. 9, 2020", "TatersGonnaTate, AOC Says Christianity Should Be Ignored As \"Superstitious Nonsense\", Accessed Jan. 2, 2020", "American Magazine, Alexandria Ocasio-Cortez on her Catholic faith and the urgency of criminal justice reform, June 27, 2018", "Pew Research Center, Religious affiliation of members of 116th Congress, Accessed", "Snopes, https://www.snopes.com/fact-check/aoc-christianity-superstitious/", "Hoax-Alert, Fake News: AOC Did NOT Say Christianity Should Be Ignored As \"Superstitious Nonsense\", Jan. 10, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]