["About this rating", "In late 2019, we received multiple inquiries from readers about reports that Rick Wiles, a controversial right-wing pastor, had launched a virulently anti-Semitic attack on leading congressional Democrats, claiming that impeachment proceedings against U.S. President Donald Trump amounted to a \"Jew coup.\"", "Such reports were published by the Times of Israel, and the websites BoingBoing.net and RightWingWatch.org, among others.", "Those articles were accurate. On Nov. 22, Wiles dedicated an entire 97-minute episode on his online channel TruNews to what the episode billed as \"Jew Coup: Seditious Jews Orchestrating Trump Impeachment Lynching.\"", "Wiles has repeatedly indulged and promoted anti-Semitic conspiracy theories and tropes on his channel, as documented by the Anti-Defamation League. The president's son, Donald Trump Jr., drew criticism in March for agreeing to be interviewed by TruNews, despite its record of promoting conspiracy theories and inflammatory misinformation, and the channel has been given access to White House press conferences, and been allowed to put questions to President Trump.", "In his Nov. 22 episode, Wiles continued that pattern of anti-Semitic attacks on perceived opponents of Trump, hitting on virtually every age-old myth and trope about Jewish people and targeting named, individual members of Congress, deploying false, outrageous, and at times downright bizarre slurs against them.", "The episode was removed by YouTube for violating its rules on hate speech, but as of Nov. 27, the video remained on the TruNews website and Facebook page, and was still available through iTunes as an audio-only podcast. This fact check contains, by necessity, virulently anti-Semitic language that some readers might find offensive.", "Towards the beginning of the episode, Wiles set out his thesis statement:", "\"The 'Impeach Trump' movement is a Jew coup, plain and simple. The men and women who are the driving forces to remove Donald J. Trump from the White House are Jews. America is in the throes of a political coup led by Jews. President Trump is surrounded by a rabid pack of seditious, treacherous Jews who are intent on overthrowing the votes of millions of Christians who elected him in 2016.\"", "At several points, Wiles used language that suggested civil war was inevitable in the United States, as a result of the fictional \"Jew coup,\" and in one instance appeared to encourage a violent \"backlash\" against a non-existent Jewish plan to \"kill millions of Christians.\"", "In one instance, his co-host Doc Burkhart parsed a campaign ad by U.S. Rep. Elaine Luria, D-Va., suggesting that a reference in the ad to \"all enemies, foreign and domestic\" (from the congressional oath of office) meant she was accusing Trump of being such a domestic enemy. Wiles shot back \"I consider these Jews to be domestic enemies! These are seditious, treacherous Jews who are undermining the president of the United States and pushing this country to civil war.\"", "He later mused: \"This country could be in civil war at Christmas time. Members of the U.S. military are going to have to take a stand, just like they did in the 1860s with the Civil War ... People are going to be forced, possibly by this Christmas, to take a stand, because of this Jew coup in the United States. We have weeks to stop it.\"", "Towards the end of the broadcast, Wiles urged his viewers: \"There is going to be a backlash. If there isn't a backlash, the country is over, you have been taken over by a Jewish cabal, a Bolshevik revolution ... Get it through your head! They're coming for you! There will be a purge, that's the next thing that happens when Jews take over a country — they kill millions of Christians!\"", "Wiles labeled Rep. Adam Schiff, D-Calif., a \"lying, Jewish congressman,\" adding: \"That's the way the Jews work. They are deceivers, they plot, they lie, they do whatever they have to do to accomplish their political agenda.\"", "Wiles parroted Trump's epithet of choice for the influential chair of the House intelligence committee, calling him \"Shifty Schiff\" and launching a bizarre, personal attack on him:", "\"His eyes — he freaks me out, Doc, there's something wrong with that man. Seriously, mentally there's something mentally wrong with that man ... He looks demon-possessed. Honestly, Adam Schiff looks like a mental psycho. He creeps me out.\"", "Wiles then deployed yet another age-old calumny against Jewish people, implying that Schiff's true loyalties did not lie with the United States: \"And he's chairman of the House intelligence committee? Oh boy, I wonder how much intelligence is flowing to Israel.\"", "The Florida-based pastor labeled Gordon Sondland, U.S. ambassador to the European Union and a key witness in impeachment hearings, a \"treacherous, lying, deceiving Jewish operative.\" On more than one occasion, Wiles likened Jews to animals and carriers of disease — a notorious, anti-Semitic rhetorical device that was used most damagingly during the rise to power of the Nazis in 1930s Germany.", "He said the list of participants and witnesses involved in the Ukrainian controversy, which has been a key focus of impeachment hearings so far, was \"infested with Jews\" (Congress is investigating whether Trump asked Ukraine to investigate his political rival Joe Biden and family in exchange for military aid). Wiles also claimed that a group of \"treacherous, seditious Jews\" were \"surrounding the president like a pack of wolves.\" He described Lt. Col. Alexander Vindman, another key witness in the impeachment hearings and a Purple Heart recipient, as a \"treacherous snake.\"", "The depths of anti-Semitism to which the program sank was perhaps best summed up in a moment when Burkhart referred to the \"Protocols of the Elders of Zion,\" an early 20th century fabricated document that purported to be a record of a Jewish conspiracy for global domination, but was later definitively shown to be a hoax.", "\"Protocols\" is a quintessential example of deliberately inflammatory, anti-Semitic disinformation, and was widely deployed by the Nazis as propaganda in order to vindicate the annihilation of the Jewish people. Burkhart mused: \"Some say it's fake, I believe there's a lot of truth to it.\" Wiles added: \"Whoever wrote it back in the 1800s, they accurately predicted what was going to happen in the world.\"", "The Times of Israel.  \"Founder of Far-Right Platform Rages Against 'Jew Coup.'\"\r\n  27 November 2019.", "Doctorow, Cory.  \"Christian TV Pastor Rick Wiles: Impeachment is a 'Jew Coup.'\"\r\n  BoingBoing.net.  26 November 2019.", "Mantyla, Kyle.  \"'Jew Coup': Impeachment Effort Prompts Another Anti-Semitic Tirade From Rick Wiles.\"\r\n  RightWingWatch.org.  25 November 2019.", "The Anti-Defamation League.  \"TruNews and Rick Wiles: 'End Times' Anti-Semitism and Anti-Zionism.\"\r\n  22 November 2019.", "McKay, Tom.  \"Trump Takes Question From TruNews, a Website That Believes in Satanic Deep State Cannibals.\"\r\n  Gizmodo.  26 September 2019.", "Thebault, Reis.  \"News Outlet That Covered 'Lizard People' and Called Obama a Demon Just Interviewed Trump Jr.\"\r\n  The Washington Post.  29 March 2019.", "The United States Holocaust Memorial Museum.  \"Protocols of the Elders of Zion.\"\r\n  Accessed 27 November 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]