["About this rating", "Four Muslim customers asked the owners of a rural craft shopping centre to provide them with space to pray.", "The men demanded they be provided with a prayer room, requiring police to respond to quell a near-riot.", "On 30 January 2016, Facebook user Paul Thomas published the above-reproduced photograph along with text reporting that four Muslim men had demanded that a \"rural retail craft centre on a Lancashire country estate\" provide them with a prayer room and provoked a near-riot that was averted only when their brusque demand was satisfied:", "I have a shop in a rural retail craft centre on a Lancashire country estate where there are 60 small retail shops and a tearoom. Today 4 Muslim men came in and demanded that the centre provide them with a prayer room, when one clearly wasn't available they started to get aggressive and when they were asked to leave by the management they started making threats and kicking spouting their right. They put the fear of God into customers, many of whom are elderly, it was a truly awful and experience. They called the police and the police turned up on mass, it looked like a riot, it was awful! But to ad insult to the situation the police cleared a space upstairs to allow them to pray — wtf!!! What is happening to our Christian way of life, I'm in total disbelief, it was horrendous!", "Something will need to remain British!!!", "Thomas likely wasn't the author of the account or a first-hand witness to the event described, but his posting of it was one of the first of many iterations of this account (all of which circulated with the same copied and pasted text, suggesting all the posters were shop owners recently bombarded by angry and devout Muslim prayer room-seekers). The earliest appearance of the report we were able to locate appeared on 30 January 2016, but it lacked several specifics with respect to location, time, author, and verification of the image attached to the account described in the text.", "A reader who asked about the claim after spotting it on Facebook provided us with the location where the attached photograph was taken and information about the craft centre's response:", "I managed to find the place where the photograph was taken, which is called Heskins Farmers Market & Craft Centre, located in Chorley, Lancashire, not, as the text suggests, in Ecclestone.", "We also contacted the centre and received the following reply;", "\"Hi, yes we have seen it thank you and have reported it to facebook as being untrue. Thanks for your message.\"", "The Heskin Farmers Market & Craft Centre's Facebook page also fielded other inquiries from the public about the report and said the reports were \"incorrect\":", "When we contacted the Heskin Farmers Market & Craft Centre via Facebook ourselves, we initially received a brief reply from the page's operator who asserted the claim was \"a complete false statement\" and pledged to us with provide additional information during business hours.", "On 10 February 2015, the business replied to our query via e-mail and directed us to a 1 February 2016 Facebook post on their page addressing the rumor. In that post, Heskin Farmers Market & Craft Center confirmed that the men in question had requested (not demanded) a space to pray, that the craft centre had accommodated their request out of a sense of goodwill (while indicating that such accommodation was a one-time deal), that no one involved was bothered, threatened, or otherwise harassed, and a few police incidentally arrived on the scene to help sort things out (not to quell a near-riot):", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]