["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "Republican House Minority Leader Kevin McCarthy visited former U.S. President Donald Trump on Jan. 29, 2021, at Trump's Palm Beach, Florida, residence and resort Mar-a-Lago, reportedly to mend fences after laying blame on Trump for inciting an attack on the U.S. Capitol on Jan. 6, 2021. Although the meeting was described as \"good and cordial,\" as far as we know, no one said, \"You complete me.\"", "But somehow that famous scene from the 1996 Tom Cruise romance \"Jerry Maguire\" ended up spliced into MSNBC coverage of the meeting. It happened during the news and politics show \"The 11th Hour with Brian Williams\" on Jan. 28, 2021, when Williams informed his guests, writer and podcast host Baratunde Thurston and political analyst Bill Kristol, that he was going to show \"exclusive video\" from the meeting between McCarthy and Trump.", "Instead, he cut to video of the scene in \"Jerry Maguire\" when Tom Cruise's eponymously-named character tearfully tells Renee Zellweger's character, \"You complete me.\"", "https://youtu.be/wz73dkoEE2U", "The video is real — the \"Jerry Maguire\" clip really was played during Williams' show. We don't know how far up the chain the joke went, though. Williams seemed to react as though he was surprised by it, stating that \"someone is going to be, of course, in big trouble.\"", "We emailed MSNBC asking whether the clip was inserted as a joke, by accident, or whether anyone was, as Williams stated, in trouble, but didn't get a response in time for publication.", "Thurston responded with a statement the day after the segment aired saying he was \"as shocked as Brian's viewers are at the pitch perfect, understated, savage satire\" of the clip being used to \"capture the unflinching, fatuous, and now-deadly loyalty most Republican alleged leaders have demonstrated in choosing Trump over America.\"", "The former president was widely criticized by both Democrats and some Republicans after a violent mob attacked the Capitol on Jan. 6, because the mob was acting on Trump's months-long disinformation campaign falsely claiming the November 2020 election was stolen. At a rally preceding the riot, he told the crowd to march to the Capitol. They did, and five people, including a police officer, died in the ensuing violence.", "But as time has gone by, despite what appeared to be at least somewhat bipartisan outrage in the hours and days immediately following the attack, Republicans like McCarthy have walked back their initial statements about holding Trump accountable.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]