["About this rating", "Homonyms are words that are spelled or sound alike but have different meanings. The word \"bow,\" for example, can mean the front of a ship, a wooden stick, to bend at the waist, or a tied ribbon. This linguistic oddity can also cross language barriers. These bilingual homophones, or \"false friends,\" include the words \"aloud\" (which means \"ancient\" in Dutch), \"gift\" (which means \"poison\" in German), and \"fart\" (which means \"speed\" in Swedish).", "In August 2019, we were alerted to another purported false friend: The word \"maga,\" which American audiences likely know as the acronym for U.S. President Donald Trump's slogan \"Make America Great Again,\" means \"easily fooled idiot\" in Nigerian Pidgin.", "Author Kurt Eichenwald was one of the first to bring mainstream attention to this translation in May 2018:", "Most amazing thing I have learned today.", "MAGA - you know, like Make America Great Again - is in Nigerian parlance a word that means easily fooled idiot.", "So, hey there all you MAGA folks - Nigeria knew what you were long before the rest of us did.", "— Kurt Eichenwald (@kurteichenwald) March 1, 2018", "English is the official language of Nigeria. However, pidgin, a grammatically simplified version of a language, is commonly used throughout the country. Nigerian Pidgin, a mixture of English and creole, can also vary slightly depending on the region. As such, it's difficult to pin down a specific definition for the word \"maga.\"", "For instance, Naija Lingo, an online Nigerian Pidgin English dictionary, provided a different definition for the word maga. According to Naija Lingo, this word means \"really messed up\" and lists \"loser\" as a synonym. The example sentence for maga is \"my guy na so you maga since you lose your job big fool.\"", "Kọ́lá Túbọ̀sún, a Nigerian linguist who won the Premio Ostana \"Special Prize\" for Mother Tongue Literature, a prize given to individuals who advocate for indigenous languages, explored the history of the slang term \"maga\" for an article published on Medium in 2017. Túbọ̀sún explained that the word \"múgùn,\" which means \"fool\" in Yorùbá, another common language in Nigeria, was eventually shortened to \"maga\" in Nigerian Pidgin in the early 2000s:", "In Yorùbá, a language spoken by about 30 million people mostly in Nigeria but elsewhere around the world, the word múgùn has quite a mischievous connotation. It means “fool”, but when broken down to component morphemes [mú-gùn], it means something like “(someone) to ride about, like an ass”.", "It is one of those words hard to successfully translate without using too many words. But if someone successfully convinces me to part with $50 with the promise of getting $100 in an hour, and then disappears, I’ve become his múgùn. He rolled me over.", "In Nigerian pidgin, the word eventually came to be written as mugu, but with the same meaning: A fool. An idiot. Someone easily duped. A victim of a transparent or elaborate con.", "Sometimes in the early 2000s, at the height of the internet scam generation, when jobless young people used their talents and the newfound efficiency of the internet to trick and dupe people from around the world for thousands of dollars, the word came back into currency, but under another different mutation. Because múgùn was language-specific and mugu was already commonplace enough to be detected when used to describe the victim of one’s mean manipulation, another one had to be coined.", "That word was maga.", "According to Túbọ̀sún, maga doesn't mean much as a stand-alone word, but it is a commonly used expression to describe a specific type of victim: \"an online fool who has parted with his/her money and/or emotions for the promise of millions or the promise of a relationship with a prince across the ocean.\"", "The word \"maga\" has also made it into Nigerian pop culture. Musician Kelly Hansome released a song in 2008 called \"Maga Don Pay,\" loosely translated to \"the maga has paid up,\" which, according to Nigerian author Chris Ngwodo, was an \"ode to Nigeria’s notorious 419 fraudsters; an unabashed psalm of adoration for their nefarious exploits.\"", "In 2010, the Microsoft Internet Safety, Security and Privacy Initiative for Nigeria produced a music video that also used the word maga. That song, \"Maga No Need Pay,\" aimed to raise awareness about cybercrime. In a press release for the song, Microsoft defined the word \"maga\" as \"victim\" (emphasis ours):", "This week, a new pop song hits the airwaves in West Africa with a highly unusual message: Don’t be seduced by cybercrime.", "Cybercrime is a global issue, but perhaps no form of cybercrime has been more associated with a region than the advance fee fraud collectively known as “Nigeria” or “419” scams (419 is the section of the Nigerian Criminal Code dealing with fraud). Through schemes such as fake lotteries, bogus inheritances, romantic relationships, investment opportunities or – infamously – requests for assistance from “officials,” scammers promise an elusive fortune in exchange for advance payments ...", "... MISSPIN Ambassador Ohimai Godwin Amaize is working to shift cultural perceptions of scammers and their victims through the B.L.I.N.G. project, which unites some of Nigeria’s most influential musicians around the problem of cybercrime. Their song, “Maga No Need Pay,” challenges young Nigerians to resist the temptation of “yahoo-yahoo” and avoid creating more maga, or victims. The song, an Afro Hip-Hop and R&B fusion, is intended to help inspire both national and international audiences.", "So, in Nigerian Pidgin, the word \"maga\" refers to a person who falls victim to an online scam.", "This fact is often brought up in a way to mock Trump and his supporters. However, it should be noted that this comparison is a bit unfair. In the United States, the word \"MAGA\" is typically written out in all-capital letters as it is actually an acronym, not a stand-alone word, for the phrase \"Make America Great Again.\" And, as far as we can tell, the acronym M.A.G.A. does not translate to \"easily fooled idiot\" in Nigerian.", "Meisner, Jeff.   \"'Maga No Need Pay': Nigeria Gets Creative to Fight Cyber Scams.\"\r\n    Microsoft News Center.   3 February 2010.", "Ngwodo, Chris.   \"MUGU DON PAY! The Gospel According to Kelly Handsome.\"\r\n    Revolution by Other Means.   18 June 2009.", "Túbọ̀sún, Kọ́lá.   \"MAGA America? Oh Well. LOL.\"\r\n    Medium.   11 January 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]