["About this rating", "The 2008 photograph shows Biden with Robert Byrd, a West Virginia senator who was during the 1940s a member and organizer for the Ku Klux Klan.", "However, Byrd was never \"Grand Wizard\" of the Ku Klux Klan, and he later renounced his past white supremacist views and said his membership of the KKK was the \"biggest mistake\" he had ever made, years before he was photographed campaigning with Biden.", "In late June 2019, on the eve of the first set of Democratic presidential primary debates, social media users shared a meme that claimed to show 2020 candidate and former Vice President Joe Biden holding hands in solidarity with the head of the Ku Klux Klan.", "\"Biden with Grand wizard of KKK. So who again is playing you, lying to you, using you for the votes, Creators of the KKK, opposed civil right [sic] of blacks. Yup thats [sic] the Democratic party.\"", "The meme appears to be a screenshot of a June 26 tweet posted by @UnclePhilly, which itself might have been a slight modification of @borderfox116's tweet earlier in the same day, which may, in turn, have been a twist on a tweet posted that morning by @PROCITY_INTL.", "Biden with Grand wizard Of KKK. So who again is playing you, lying to you, using you for the votes, Creators of the KKK, opposed civil right of blacks. Yup that's the Democratic Party. pic.twitter.com/i5N4AN9Vb8", "— UnclePhilly (@unclephilly) June 26, 2019", "We received several inquiries from readers regarding the accuracy of the claim that the meme showed Biden with the \"Grand Wizard of the KKK.\" Queries especially arose in the aftermath of the June 27 Democratic primary debate in Miami, Florida, during which U.S. Sen. Kamala Harris (D-Calif.) criticized Biden's record of legislative cooperation with two prominent segregationists, James Eastland and Herman Talmadge, while Biden was a senator for Delaware in the 1970s.", "The picture in question was taken by Associated Press photographer Bob Bird, in Charleston, West Virginia, on Oct. 24, 2008. It shows Biden, then running mate to Democratic presidential candidate Barack Obama, present at a campaign rally with U.S. Sen. Jay Rockefeller (D-W.Va) and West Virginia's Democrat Gov. Joe Manchin. Biden is holding the hand of U.S. Sen. Robert Byrd (D-W.Va).", "The meme contains an important grain of truth, in that Byrd was indeed an active member and organizer for the KKK during the 1940s. However, he never held the position of \"Grand Wizard\" in the organization. By the time Biden appeared by his side at the 2008 rally, Byrd had long since renounced his past white supremacist views, and he publicly apologized for his membership of the KKK, which he described more than once as the \"biggest mistake\" he had ever made.", "When Byrd died in June 2010, as the longest-serving U.S. senator in history, he left behind a complicated legacy. He joined the KKK in the early 1940s and was still a supporter as late as 1946, although he later said he was only a member for around a year. When his Klan activities became a serious threat to Byrd's 1952 campaign for the U.S. House of Representatives, he downplayed his involvement in a radio interview, saying:", "\"Being only 24 at the time, I joined the order because it offered excitement and because it was strongly opposed to communism. After about a year, I became disinterested, quit paying my dues and dropped my membership in the organization. During the nine years that have followed, I have never been interested in the Klan ...\"", "Later in the 1952 campaign, however, this was revealed to be untrue when Byrd's Republican opponents published a letter he had written in 1946 — three years after he claimed to have dropped all interest in the KKK — to Samuel Green, the Georgia-based \"Imperial Wizard\" of the organization. In the letter (which can be read in its original handwritten form here), Byrd wrote:", "\"The Klan is needed today as never before and I am anxious to see its rebirth here in West Virginia ... It is necessary that the order be promoted immediately and in every state of the Union. Will you please inform me as to the possibilities of rebuilding the Klan in the realm of West Virginia.\"", "In the letter, Byrd referred to himself as a former \"Kleagle\" (KKK organizer and recruiter) in Raleigh County, West Virginia, and surrounding areas.", "He survived the ensuing controversy, gained election to the U.S. House of Representatives, and in 1958 won election to the U.S. Senate, where he served for more than 51 years until his death in 2010, holding the position of Senate majority leader during two spells in the late 1970s and late 1980s.", "However, Byrd's white supremacist past continued to crop up from time to time in the intervening decades. In 1988, when Byrd was Senate majority leader for the second time, the author Graham Smith brought to the surface even more troubling words written by Byrd.", "As part of his research for a historical book about the experiences of black American soldiers in Britain during World War II, Smith discovered that Byrd had in 1945 written the following words in a letter he sent to then-Mississippi Sen. Theodore Bilbo, himself a white supremacist and Klansman:", "\"I am loyal to my country and know but reverence to her flag, but I shall never submit to fight beneath that banner with a Negro by my side. Rather I should die a thousand times, and see Old Glory trampled in the dirt, never to rise again, than to see this beloved land of ours become degraded by race mongrels, a throw back to the blackest specimen from the wilds.\"", "In 1988, a spokesperson for Byrd told the Los Angeles Times the senator had \"no recollection\" of writing the letter, and \"deplored\" its language.", "By the time Biden was pictured campaigning alongside Byrd in 2008, the West Virginia senator had for years renounced his past racist pronouncements, and repeatedly expressed regret and embarrassment about his involvement with the KKK. In a 1993 interview with CNN, for example, Byrd said:", "\"... It's easy to state what has been my biggest mistake. The greatest mistake I ever made was joining the Ku Klux Klan. And I've said that many times. But one cannot erase what he has done. He can only change his ways and his thoughts. That was an albatross around my neck that I will always wear. You will read it in my obituary that I was a member of the Ku Klux Klan.\"", "Speaking to the same network in 2006, Byrd said again: \"I've never hesitated to say that was the greatest mistake of my life. It will always be there. And it will be in my obituary.\"", "In his 2005 memoir \"Child of the Appalachian Coalfields,\" Byrd wrote at length about what he called the \"extraordinarily foolish mistake\" of joining the KKK:", "It had been a foolish mistake to ever associate myself with the Klan. I became caught up with the idea of being part of an organization to which so many \"leading\" persons belonged. I wanted to display my skills in organizing and recruiting members, and I was delighted with the encouragement and praise I received for my efforts. I had succumbed to some of the positive messages which the Klan put forth, such as patriotism, preserving and protecting the American way of life, and resisting communism. I had also been influenced by the talk I had heard from boarders and my mom and dad's house, which reflected the typical southern viewpoint of the time. Blacks were generally distrusted by many whites, and I suspect they were subliminally feared. And although I was especially attracted to the Klan's pro-American, anti-communist message, I definitely reflected the fears and prejudices I had heard throughout my boyhood.", "Looking back on the experience now, it puzzles me. I had good experiences with nearly all of the blacks I had known as a young man. I had been to their homes to sell produce and found most of the black families I knew to be kindly, law-abiding and God-fearing. Yet, I felt this distrust and suspicion of blacks in general, which was common to the times and place. As far as Catholics, Jews and foreign-born people were concerned, I felt no bias against them. Yet, I embraced an organization which promulgated messages of antipathy toward these groups, without ever stopping to examine the full meaning and impact of the ugly prejudice behind the positive, pro-American veneer.", "... My only explanation for the entire episode is that I was sorely afflicted with tunnel vision — a jejeune and immature outlook — seeing only what I wanted to see because I thought the Klan could provide an outlet for my talents and ambitions. It has emerged throughout my life to haunt and embarrass me and has taught me in a very graphic way what one major mistake can do to one's life, career and reputation. Paradoxically, it was that same extraordinarily foolish mistake which led me into politics in the first place.", "At his funeral in July 2010, Byrd was eulogized by former President Bill Clinton, as well as Biden himself and then-President Obama. Obama alluded to Byrd's past involvement in white supremacist activities:", "\"Of course, Robert Byrd was a deeply religious man, a Christian. And so he understood that our lives are marked by sins as well as virtues, failures as well as successes, weakness as well as strength. We know there are things he said and things he did that he came to regret. I remember talking about that the first time I visited with him. He said 'There are things I regretted in my youth. You may know that.' And I said 'None of us are absent some regrets, Senator. That's why we enjoy and seek the grace of God.' And as I reflect on the full sweep of his 92 years, it seems to me that his life bent towards justice. Like the Constitution he tucked in his pocket, like our nation itself, Robert Byrd possessed that quintessential American quality, and that is a capacity to change, a capacity to learn, a capacity to listen, a capacity to be made more perfect.\"", ". ﻿", "Pianin, Eric.   \"A Senator's Shame -- Byrd, In His New Book, Again Confronts Early Ties to KKK.\"     The Washington Post.   19 June 2005.", "Anderson, Jack.   \"Senate Whip Bob Byrd: From Poverty to Power.\"     Parade.   24 April 1971.", "The Raleigh Register.   \"Byrd Denies New Ku Klux Charges; Calls it 'Smear Campaign' by GOP.\"     10 October 1952.", "Dean, Paul.   \"Fighting Racism with a Segregated Army.\"     Los Angeles Times.   13 March 1988.", "Noah, Timothy.   \"What About Byrd?\"     Slate.   18 December 2002.", "CNN.   \"Transcript -- 'American Morning,' 12 June 2006.\"     12 June 2006.", "Byrd, Robert C.   Child of the Appalachian Coalfields.     West Virginia University Press, 2005.   ISBN 1933202009.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]