["A purported graphic of News18 show ‘Aar Par’ is circulating on social media. The text on the graphic credits PM Modi for the death of Islamic State (IS) chief Abu Bakr Al Baghdadi. It says that Baghdadi was taken down by US president Donald Trump after pressure from the Indian prime minister – “मोदी के दबाव के चलते ट्रंप ने किया बगदादी को ढेर.”", "President Trump declared Baghdadi dead on October 27 after the US intelligence cornered the ISIS leader in a raid where he killed himself detonating a suicide vest.", "सिर्फ वही लोग Rt करे जिन्हे लगता है @AMISHDEVGAN भDवा ए दलाल है pic.twitter.com/Jw85BWW61R", "— ZOYA (@ziddi_zoya_) October 28, 2019", "Among the several individuals who shared it was Congress UP leader Sachin Chaudhary who later took it down.", "The graphic is not genuine but a work of photoshop. A comparison of several past graphics of ‘Aar Par’ with the one floating online makes this evident due to a mismatch in the font.", "Furthermore, journalist Amish Devgan, anchor of the show ‘Aar Par’, quote-tweeted Chaudhary’s tweet and called-out the misinformation.", "यह तस्वीर फ़र्ज़ी है आप बड़ी पार्टी के नेता हैं गाली देने से पहले ज्ञान बढ़ाये । https://t.co/fPMrziq3DZ", "— Amish Devgan (@AMISHDEVGAN) October 28, 2019", "It is also noteworthy that the raid to take down Baghdadi was carried over the weekend and no episode of ‘Aar Par’ was aired during this time. The latest show aired on October 28 on an unrelated topic. The misinformation was earlier debunked by Boomlive.", "A photoshopped News18 graphic was shared to claim that anchor Amish Devgan aired a show crediting PM Modi for ‘pressuring’ American president Donald Trump to take down ISIS leader Abu Bakr Al Baghdadi.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]