["About this rating", "A video purportedly showing strange clouds forming over Israel was widely shared on social media in the wake of Donald Trump's U.S. presidential election victory in November 2016. Some users shared the video, which also featured \"mysterious trumpets,\" along with the claim that it showed the beginning of the apocalypse, while others claimed that it was a sign from God that Trump would heal relations with Israel:", "In the book of Revelation of the Bible, trumpet sounds bring wrath in the world.", "Nostradamus predicted the victory of Donald Trump in 2016 election. He also allegedly predicted that he is the \"anti-Christ\" who will trigger the world war 3.", "To the unbelievers.. look at what happened in Israel staight after Donald J. Trump was elected Presidency of the United States of America.. Donald J. Trump is the chosen one from God.. don't ever doubt the Lord your God! Get ready for our Lord Jesus Christ the time is NEAR!!!", "It will come about also in that day that a great trumpet will be blown, and those who were perishing in the land of Assyria and who were scattered in the land of Egypt will come and worship the LORD in the holy mountain at Jerusalem (Isaiah 27:13).", "Jesus will reign as king over Israel as well as all the nations of the world (Isaiah 2:4; 42:1).", "I had a dream before the passing of my father August this year.. I dreamt of Donald J Trump smiling at me.. then I asked God what is the relevance of this.. and God assured me that Trump is the annointed and chosen one by Him to lead his country.. whether you believe me or not is not my concern but all I know God is wanting me to share this!!\nThere are many skeptical people in the world we live in but I have a strong faith in God, I may not be perfect but throughout my journey through my ups and downs, God has always been there for me and has never abondoned me.. you all need to pray for one another even for the enemies and pray for Donald J Trump to lead his country as this is part of God's divine plan...", "The above-displayed video is not connected to Donald Trump or to the 2016 U.S. presidential election. It has been circulating online since at least 1 October 2016 (more than a month before Donald Trump was elected President of the United States), and it does not depict a real event.", "Many early versions of this footage claimed that it showed a \"mysterious\" or \"religious\" event, and those postings also included a link back to the original video, which was made by Ronen Barany (which has since been deleted). It should be noted that Barany is a graphic artist whose YouTube channel is filled with videos showcasing special effects:", "The \"mysterious trumpets\" in this video are also most likely fake. In 2015, snopes.com investigated a rumor that people around the world were hearing \"strange apocalyptic sounds.\" The noise in the above-displayed video is similar to the one featured in those videos.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]