["By Jessica McDonald", "Posted on October 30, 2020", "At recent campaign rallies, President Donald Trump has made the misleading boast that the U.S. is in “great shape” because 97% of emergency room visits were for something other than COVID-19. But the number is not as impressive as it sounds. Trump could have boasted of similar percentages — 93% to 96% — during the worst periods of the pandemic.", "With Election Day a week away, the president continued his efforts to paint an overly rosy picture of the coronavirus pandemic in two Oct. 27 campaign rallies.", "In each, Trump repeated the false notion that the U.S. is “rounding the corner” or “rounding the turn” on the pandemic and debuted a new statistic to ostensibly support his position.", "“Thanks to our relentless efforts, 97% of all current emergency rooms visits are for something other than the virus,” the president said before a crowd in West Salem, Wisconsin. “You don’t hear these numbers from the fake news. Think of that, 97%.”", "He touted the statistic again — almost verbatim — a few hours later in a campaign rally in Omaha, Nebraska, adding, “Think of that, 97%. We’re in great shape.”", "The next day, in Arizona, the president used the same lines again.", "Trump’s statistic is correct, but it’s not the meaningful indicator he presents it as. Even during the pandemic’s harrowing days in April, the percentage of ER visits due to a COVID-like illness never went higher than 7%. And the number, while lower now, has been on the rise.", "Moreover, public health experts do not think that the U.S. is in “great shape” — and a bevy of metrics show that the pandemic is worsening.", "The Trump campaign did not respond to our inquiry asking for the source of the 97% number, but it likely comes from the Centers for Disease Control and Prevention. According to the agency’s data tracker, which has data up to Oct. 26, around 3% of ER visits in the past week or so were due to a COVID-like illness.", "While that may sound low, it represents an uptick from two months ago, when the figure hovered around 2%.", "The estimate comes from one of the CDC’s surveillance systems, the National Syndromic Surveillance Project, which in an effort to track potential COVID-19 visits, monitors emergency department visits for COVID-19-like illness in a subset of hospitals in 47 states.", "COVID-like illness is defined as a person having a fever and cough or shortness of breath or a coronavirus diagnosis code. Visits that meet the symptom criteria but mention influenza are not counted in the tally.", "As the CDC explains elsewhere, the surveillance system is “currently being affected by changes in health care seeking behavior, including increased use of telemedicine and increased social distancing,” which changes the number of people visiting the ER.", "The ER visit data also appear in a weekly surveillance report from the CDC known as COVIDView. According to the most recently available report, which covers the week ending on Oct. 24, 3% of ER visits were for a COVID-like illness.", "A graph covering the pandemic period shows that the percentage of such visits each week peaked at 6.8% in April before declining and then hitting another peak of 4.2% in July. That means that even during the worst periods of the pandemic thus far, Trump would have been able to tout that 93% to 96% of ER visits were not related to COVID-19.", "The weekly report notes that the percentage of ER visits due to potential COVID-19 cases “has been increasing since mid-September.”", "The rest of the report strikes a cautionary tone. “Nationally, surveillance indicators tracking levels of SARS-CoV-2 virus circulation and associated illnesses have been increasing since September,” the report concluded, referring to the virus that causes COVID-19, adding that COVID-19 hospitalizations and deaths for the most recent weeks “may increase as more data are received.”", "In selectively highlighting a figure that sounds impressive, Trump misleads about the reality of the pandemic in the U.S., which by all indications is getting worse, not better.", "A set of Oct. 25 coronavirus task force reports obtained by the Center for Public Integrity, for example, found that a whopping 32 states are in the “red zone” for COVID-19 cases — more than in any other publicly available report to date.", "And according to the COVID Tracking Project, the seven-day average of new daily cases in the U.S. topped 76,000 on Oct. 29, blowing past the previous rolling average record of around 66,500 cases per day in July. The number of people currently hospitalized for COVID-19 is also climbing, and daily deaths are now up from fewer than 700 earlier in October to around 800.", "An analysis from Johns Hopkins University also shows that over the past week, almost all states have shown an increase in reported COVID-19 cases.", "As he has before, Trump has recently claimed, including in an Oct. 30 tweet, that the reason why cases are up is because of testing.", "More Testing equals more Cases. We have best testing. Deaths WAY DOWN. Hospitals have great additional capacity! Doing much better than Europe. Therapeutics working!", "— Donald J. Trump (@realDonaldTrump) October 30, 2020", "There is more testing now than earlier in the pandemic, but as a COVID Tracking Project blog post on Oct. 27 explains, expanded testing does not explain all or even most of the observed surge in cases.", "“Since October 1, the seven-day average for new cases has risen 61 percent, while tests are only up 14 percent in the same period,” the post reads. “Meanwhile, the number of patients currently hospitalized with COVID-19 has risen 40 percent in October thus far.”", "Indeed, the uptick in hospitalizations and deaths also demonstrates that the surge in cases is not simply an artifact of testing.", "Members of the Trump administration have said as much, including Adm. Brett Giroir, the coronavirus task force member in charge of testing. “We do believe and the data show that the cases are going up. It’s not just a function of testing,” he said in an Oct. 28 interview on NBC’s “Today” show. “Yes, we’re getting more cases identified, but the cases are actually going up. And we know that, too, because hospitalizations are going up.”", "The number of daily deaths is much lower than the more than 2,000 people lost per day in April, but as we’ve noted before, deaths lag cases.", "Some locales, such as El Paso, Texas, are reporting that hospitals are beginning to run out of space, with some setting up field hospitals or sending patients to less burdened facilities, including those out of state. Utah is drawing up plans to ration medical care, contrary to Trump’s claim that all is fine with hospitals and they “have great additional capacity!”", "We’ve previously explained when Trump made the same baseless claim that the U.S. is “rounding the corner” on the pandemic that public health officials and experts do not agree with that assessment. Those opinions have not changed.", "Dr. Tom Inglesby, the director of the Center for Health Security of the Johns Hopkins Bloomberg School of Public Health, for example, said in a Twitter thread that there “is a new real and serious surge in severe COVID” and called for leaders to take more steps to ensure that members of the public take more precautions to quell the outbreaks.", "And in an Oct. 28 interview with the Journal of the American Medical Association, National Institute of Allergy and Infectious Diseases Director Dr. Anthony Fauci repeated his concerns for the future.", "“We’re not in a good place,” he said of the current situation, pointing to the high number of daily cases. “We should have been way down in baseline and daily cases. And we’re not.”", "“We’re going into a precarious situation where much of what we’re going to be doing is going to be indoors as opposed to outdoors,” Fauci added, referring to the upcoming months of colder weather for much of the nation. “And wherever you go in the country — you call up, you talk to your friends in the trenches — they’re telling you that they’re seeing cases going up virtually at all ages, all groups, at the same time. That’s not good. And then the third thing you superimpose upon that, as we go into the holiday season, where naturally the tradition and the customs are for gatherings and traveling. Again, all a bad recipe for a tough time ahead.”", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]