["Recently, a black and white photo of a young Narendra Modi with another man has been going viral on social media. The man has his arm around the PM in the image. Users are claiming that the person seen here is anti-corruption activist Anna Hazare. A Facebook page named ‘Save the Kisan’ posted this picture with the claim. (Archive link)", "Posted by ਕਿਸਾਨ ਨੂੰ ਬਚਾਓ Save The Kisan on Sunday, December 27, 2020", "Facebook user Ravindra Ravi Sen also shared the photo and accompanying claim. (Archive link)", "बहुत पुराना याराना लगता है। शोके फिल्म का यह डायलाग आज सार्थक हो गया है। वास्तव में कांग्रेस सरकार के विरुद्ध जबरदस्त आन्दोलन करने वाले अब खामोश क्यों हैं यह बात अब सिध्द हो गयी है।", "Posted by रविन्द्र रवि सैन on Friday, December 25, 2020", "Another Facebook page called ‘Akaal Media’ posted it with a Punjabi caption. (Archive link)", "ਇਸ ਬਾਰੇ ਤੁਹਾਡਾ ਕੀ ਖਿਆਲ ਹੈ ਕੀ ਇਹ ਵੀ Editing ਹੈ …..???", "Posted by Akaal Media on Sunday, December 27, 2020", "This picture is viral on Facebook. Alt News also received a few requests to fact-check it on our WhatsApp number (+917600011160).", "This slideshow requires JavaScript.", "We performed a simple reverse image search and found this picture in a report by The Economic Times dated September 22, 2017. The article identifies the individual seen with Narendra Modi is Lakshmanrao Inamdar, popularly known as Vakil Saheb.", "Inamdar was one of the founding members of the RSS in Gujarat. He played an important role in the formative stages of Modi’s life. Inamdar had known the Prime Minister since they were kids.", "This picture was also shared in a 2014 India Today report which says that Narendra Modi wrote a book on the RSS leader’s life, who passed away in 1984.", "Therefore, the individual standing next to Prime Minister Narendra Modi is not Anna Hazare, but his guide Laxmanrao Inamdar aka Vakil Saheb. Some other old pictures related to the prime minister have been shared with false claims recently.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]