["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Bill Clinton addresses the DNC in Philadelphia on July 26, 2016.", "In detailing their much-scrutinized marriage and love story at the Democratic National Convention, former President Bill Clinton also took care to list his wife’s numerous legislative and foreign policy achievements.", "Among them: \"She put climate change at the center of our foreign policy. She negotiated the first agreement ever — ever — where China and India officially committed to reduce their emissions.\"", "While Bill Clinton’s claim is largely accurate, he’s offering a rosy spin on the Copenhagen Accord of 2009, which was at the time and continues to be widely panned.", "Hillary Clinton did play a key -- but not solo -- role in the talks with China and India, and it was the first time the two countries made emissions reduction pledges in an international agreement.", "But unlike the Kyoto Protocol of 1997 or Paris Agreement of 2015, the accord wasn’t actually an official agreement. It wasn’t \"adopted\" by signatories, but merely \"taken note of\" (in other words, they formally recognized the accord’s existence).", "Furthermore, the \"agreement\" was non-binding and the countries set their own voluntary targets, leading some environmentalists and experts to cast it aside as essentially meaningless.", "Let’s dive in.", "Before Copenhagen, China and India had both signed and ratified the Kyoto Protocol, which the United States backed out of. But because they were developing countries, they were not required to curb their carbon emissions.", "In 2007, in response to overtaking the United States as the world’s biggest carbon emitter, China released its first national climate change program and said it would reduce its energy consumption by 20 percent by 2010 and \"consequently reduce CO2 emissions.\"", "Similarly, India released a national action plan on climate change in 2008, in which it didn’t commit to reducing emissions but laid out steps that would.", "But it wasn’t until Copenhagen that the two countries finally committed to reducing carbon emissions.", "In this sense, the accord \"played a major role in breaking\" the \"firewall\" between developed countries and developing countries when it came to climate action responsibility, according to  David Ciplet, an environmental studies professor at the University of Colorado Boulder who wrote Power in a Warming World: The New Global Politics of Climate Change and the Remaking of Environmental Inequality.", "\"However, whether the Copenhagen Accord was a positive development overall is definitely controversial,\" Ciplet told PolitiFact.", "Nonetheless, like her husband, Hillary Clinton often touts the accord as one of her major climate change accomplishments, referring to it as a \"key diplomatic breakthrough\" on her campaign website and recounting how she and Obama were \"hunting down the Chinese\" to get them to the table.", "She devotes a significant chunk of a chapter in her 2014 memoir, Hard Choices, to the talks. She notes the role of Todd Stern, a key negotiator, as well as her and Obama’s famous tag-team chase to find the Chinese Prime Minister Wen Jiaobao during the talks.", "\"In a makeshift conference room whose glass walls had been covered by drapes for privacy against prying eyes, we found Wen wedged around a long table with Indian Prime Minister Manmohan Singh, Brazilian President Luiz Inacio Lula da Silva, and South African President Jacob Zuma. Jaws dropped when they saw us. 'Are you ready?' said President Obama, flashing a big grin,\" Clinton writes. \"Now the real negotiations could begin. It was a moment that was at least a year in the making.\"", "But according to news reports, world leaders, environmental activists and experts, the \"real negotiations\" didn’t actually lead to anything with teeth. China and India did end up agreeing to reduce their emissions and set their own targets, but emphasized the pledge was not legally binding.", "This basically changed the international approach to climate action from Kyoto Protocol, which had a compliance mechanism, to \"a voluntary approach where countries are free to determine unilaterally what forms of action they would like to commit to,\" said Ciplet.", "\"Many, including myself, saw this as a much weaker mitigation framework than a robust second commitment period to the Kyoto Protocol,\" he said, adding that even after the Paris Agreement, \"we are still not on track\" in mitigating climate change.", "Our ruling", "Bill Clinton said Hillary Clinton \"negotiated the first agreement — ever — where China and India officially committed to reduce their emissions.\"", "Clinton was at the table at the Copenhagen Accord, though she wasn’t the only U.S. official present. And while it was the first time China and India made pledges in an international agreement, their pledges were not legally binding.", "Many, if not most, environmentalists and experts say the agreement was a wash at best and a failure at worst.", "We rate Clinton’s claim Half True.", "https://www.sharethefacts.co/share/3d55f16e-04cd-47ac-8e55-fc8fe373c7b6", "CQ search", "Nexis search", "InsideClimate News, \"Conference of Parties 'Takes Note Of' Copenhagen Accord,\" Dec. 19, 2009", "New York Times, \"A Grudging Accord in Climate Talks,\" Dec. 20, 2009", "Der Spiegel, \"The Copenhagen Protocol: How China and India Sabotaged the UN Climate Summit,\" May 10, 2010", "Reuters, \"INSTANT VIEW: Reaction to Copenhagen,\" Dec. 18, 2009", "Greenpeace, \"Greenpeace statement on the Copenhagen outcome,\" accessed July 26, 2016", "The Guardian, \"Hillary Clinton's green path to the White House: will she be 'careful' on climate?,\" April 20, 2015", "Email interview with David Ciplet, environmental studies professor at the University of Colorado, Boulder, July 27, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]