["By Lori Robertson", "Posted on April 18, 2018", "On April 12 and 13, President Donald Trump’s approval rating, according to the Rasmussen Reports, was 50 percent. At the same point in Barack Obama’s presidency, Obama’s approval rating per Rasmussen was 48 percent and 49 percent. But Trump inaccurately described his poll number as “much higher than President Obama at the same point.”", "The margin of error for the latest Rasmussen daily tracking poll is plus or minus 2.5 percent, which means Trump’s approval rating could fall somewhere between 47.5 percent and 52.5 percent.", "Trump tweeted on April 15 that he had “just hit 50% in the Rasmussen Poll.”", "Just hit 50% in the Rasmussen Poll, much higher than President Obama at same point. With all of the phony stories and Fake News, it’s hard to believe! Thank you America, we are doing Great Things.", "— Donald J. Trump (@realDonaldTrump) April 15, 2018", "Trump actually has hit 50 percent, and higher, several times in the Rasmussen poll. Trump started with 56 percent of likely voters approving of his performance according to Rasmussen on Jan. 20, 2017, when he was inaugurated, and hit a high point of 59 percent six days later.", "Obama started his time in office on Jan. 20, 2009, with a 67 percent approval according to Rasmussen.", "Here’s how the two presidents’ approval numbers compare, according to just this one poll.", "The latest Rasmussen figures show Trump at 49 percent on April 17 and Obama at 45 percent at the same point in his presidency.", "Trump frequently cites Rasmussen, which Newsweek has called the president’s “favorite poll.” But Trump is cherry-picking.", "Among 88 polls released this year, Rasmussen has the highest approval rating for Trump, according to Real Clear Politics. Three other recent polls have Trump’s latest approval as low as 39 percent: Gallup, NBC News/Wall Street Journal and Reuters/Ipsos. All three polls were taken this month.", "If we look at Real Clear Politics’ average of polling data, Trump’s latest approval rating is 42.1 percent, a bit below the average of 44.3 percent on Jan. 27, 2017, a week after he took the oath of office.", "Obama, meanwhile, had an average approval of 63.3 percent on Jan. 27, 2009, and an average of 47.7 percent on April 17, 2010, according to RCP.", "FiveThirtyEight provides a weighted average of presidential approval polls and compares Trump’s figures with those of past presidents, going back to Harry S. Truman.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]