["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "House Speaker Nancy Pelosi of Calif., speaks during a news conference on Capitol Hill in Washington, June 4, 2020. (AP/Susan Walsh)", "\"Dreamers\" are immigrants here illegally who were brought to the United States when they were children.", "Lawmakers say there’s bipartisan support for legislation to protect these immigrants from deportation, but for nearly 20 years Congress has failed to agree on a bill.", "Around 80% of Americans support letting the immigrants stay, but support for granting them a path to citizenship is weaker among Republicans.", "House Speaker Nancy Pelosi claimed that President Donald Trump is standing in the way of legislation that would benefit young immigrants here illegally, even though most Republicans, Democrats and independents are for it.", "In a June 23 Telemundo interview, Pelosi criticized Trump for saying his administration would try again to revoke Deferred Action for Childhood Arrivals, or DACA, an Obama-era program that prevents deportation of immigrants who were brought illegally to the United States when they were children.", "She went on to cite support for this group of immigrants, commonly called \"Dreamers,\" because of stalled proposals in Congress called the DREAM Act that would protect them from deportation.", "\"Eighty percent of the American people support our Dreamers,\" Pelosi said. \"Over 70% think they should have a path to citizenship, and that's Democrats, Republicans, independents, everybody.\"", "In 2017, Pelosi made a similar claim about broad public support for these immigrants, which we rated True. We decided to fact-check her latest claim to see if her argument still holds.", "For this fact check, we interpreted Pelosi’s claims of support levels as referring to each of the three groups of voters. By this measure, Pelosi’s claim is mostly accurate, but needs clarification. While large majorities overall support letting the immigrants stay and apply for citizenship, support among Republicans runs much lower. On the citizenship question, GOP support is not over 70% in the polls we looked at, including the one Pelosi referred us to.", "RELATED: Republicans and Democrats claim to support Dreamers. So why can’t they pass a law?", "For nearly 20 years, Democrats and Republicans in Congress have crafted versions of legislation that would offer the immigrants a path to U.S. citizenship. No bill has passed both chambers of Congress, as neither party has been willing to concede on other immigration priorities. Opponents of the bills say they reward people for breaking the law and encourage illegal immigration.", "The Obama administration’s DACA program allowed these immigrants to apply periodically for permission to stay and work in the U.S. without fear of deportation.", "The U.S. Supreme Court on June 18 ruled against a Trump administration effort to rescind DACA, saying the administration did not follow proper procedures to end the program. Democrats cheered the ruling and renewed their call for a legislative solution.", "A national survey cited by Pelosi’s office and other polls from the Pew Research Center and CBS News support Pelosi’s claim of widespread support for letting the immigrants stay.", "Pelosi’s office pointed to a Politico/Morning Consult national poll in mid-June, in which 61% of respondents said \"Dreamers\" should be allowed to stay and become citizens if they meet certain requirements; 17% said they should be allowed to stay and become legal permanent residents, but not citizens. So 78% support letting \"Dreamers\" stay.", "A June 4-10 survey from Pew Research Center showed similarly high support for \"Dreamers,\" finding that 74% of Americans favor a law that would provide them permanent legal status.", "A CBS News poll done May 29-June 2 found that 85% of respondents favored letting \"Dreamers\" stay, if they meet certain requirements.", "Another poll, commissioned by America’s Voice, FWD.us, and the Immigration Hub and done by Global Strategy Group May 27-June 3, found 72% of registered voters in 12 battleground states supported offering citizenship to \"Dreamers\" who met certain conditions.", "Pelosi claimed that over 70% of Democrats, Republicans and independents say \"Dreamers\" should have a path to citizenship. But Pelosi’s claim requires some clarification regarding Republican support.", "Pelosi’s office referred us to a 2019 nationwide survey of 800 likely November 2020 general election voters. According to that survey, from Global Strategy Group, support for making \"Dreamers\" eligible for citizenship, if they meet certain criteria, was 90% among Democrats, 71% among independents and 64% among Republicans.", "More recent polling shows similar variations by party affiliation: the May 27-June 3 poll by Global Strategy Group found that support for citizenship for \"Dreamers\" was 88% among Democrats, 69% among independents and 57% among Republicans.", "Pew’s early June poll found that 91% of Democrats and Democratic-leaning independents favor granting legal status to \"Dreamers,\" while half of Republicans and Republican leaners (54%) said the same. (Pew didn’t specifically ask about citizenship, yet granting legal status, such as a green card, can lead to naturalized citizenship.)", "Politico/Morning Consult’s June poll also showed that over 70% of Democrats supported allowing \"Dreamers\" to become citizens, but that support was below 70% among independents and Republicans.", "The CBS poll did not ask specifically about citizenship or legal status; it broadly asked respondents whether they favored allowing \"Dreamers\" to stay: 95% of Democrats were in favor, compared with 84% of independents and 73% of Republicans.", "Pelosi said, \"80% of the American people support our Dreamers. Over 70% think they should have a path to citizenship, and that's Democrats, Republicans, independents.\"", "Pelosi’s claim of overall support for \"Dreamers\" is sound, but her claim weakens when she groups Republicans among the over 70% who support giving them a path to citizenship. Several polls show that support from Republicans for citizenship for \"Dreamers\" is not as high.", "Pelosi’s statement is accurate but needs clarification or additional information. We rate it Mostly True.", "Nancy Pelosi, Telemundo interview, June 23, 2020", "Email interview, Speaker Pelosi press office, June 24, 2020", "Politico, Poll: Trump voters want to protect Dreamers, June 17, 2020", "PolitiFact California, Do three-quarters of Americans support the DREAM Act? Nancy Pelosi says so, Sept. 19, 2017", "PolitiFact, Republicans and Democrats claim to support Dreamers. So why can’t they pass a law?, June 25, 2020", "POLITICO/Morning Consult, National Tracking Poll #200671June 12-14, 2020, National Tracking Poll", "Global Strategy Group, May 29, 2019 information on May 20-22, 2019 poll", "Global Strategy Group, May 27-June 3, 2020 poll", "Theimmigrationhub.org, New Battleground Poll: Relentless Efforts to Deport Dreamers Jeopardizes Vote for President Trump, June 19, 2020", "CBSNews.com, Americans weigh in on issues before the Supreme Court - CBS News poll, June 8, 2020", "Pewresearch.org, Americans broadly support legal status for immigrants brought to the U.S. illegally as children, June 17, 2020", "U.S. Supreme Court ruling on DACA case, June 18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]