["By Angelo Fichera", "Posted on October 10, 2018", "Q: Did Sen. Cory Booker say he’s “sick and tired of the Constitution … manipulating everything we do”?", "A: No. That viral quote was lifted from a satirical story.", "The satirical Christian website the Babylon Bee poked fun at Senate Democrats in a June story about lawmakers’ supposed resistance to something they felt possessed undue influence over conservative judges: the Constitution.", "“Still reeling from Trump’s previous Supreme Court nominee, Neil Gorsuch, Democrats plan to scrutinize any new nominee to ensure that he or she isn’t yet another crony of something called ‘The Constitution,’ Senate Democrats announced Friday,” begins the tongue-in-cheek article, published days before President Donald Trump nominated Brett Kavanaugh to the Supreme Court.", "But some on social media have used the content to blur the lines between fact and fiction. Specifically, a viral meme shared on Facebook in recent days targets Democratic Sen. Cory Booker of New Jersey by using an illogical quote from the story.", "“We’re sick and tired of the Constitution sitting in the National Archives, manipulating everything we do,” the meme reads, attributing the quote to Booker. For additional effect, the meme adds a photo of a talking Booker and CNN’s logo.", "But Booker, considered a potential presidential candidate in 2020, didn’t say that. The quote comes from the Babylon Bee’s fictional account.", "The meme was published on multiple Facebook pages, with each post earning thousands of shares — and scores of comments of condemnation.", "“Democrats HATE Our U.S. Constitution,” is how a page called “Republican Patriotic Party” started an Oct. 4 post about the meme. “No Mr. Booker, The Constitution is there to Govern what Our Elected Officials Do, and You have Sworn to Uphold and Protect it! Traitorous Maggot!”", "That post, which garnered more than 7,000 shares, attracted the attention of users who called Booker a “criminal and a hypocrite” — and called for him to step down.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“Senate Democrats Demand Supreme Court Nominee Not Be Unduly Influenced By U.S. Constitution.” The Babylon Bee. 9 Oct 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]