["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Incarcerated people are eligible for stimulus checks under broad criteria outlined in the latest COVID-19 relief package.", "This was also true of relief bills passed last year under the Trump administration", "Another round of stimulus payments is hitting the bank accounts of eligible Wisconsinites — but some state lawmakers have strong opinions about who should be able to receive them.", "State Sen. Julian Bradley, R-Franklin, and state Rep. Joe Sanfelippo, R-New Berlin, introduced legislation that would require money sent to Wisconsin prisoners under the latest COVID-19 relief package to be spent on any restitution they owe. Bradley made his argument for the bill in a March 15, 2021 report from the Associated Press.", "\"President Biden's irresponsible stimulus package sends stimulus checks to imprisoned murderers, rapists, and child molesters,\" he said.", "This issue has been discussed often amid the debate over how to respond to the COVID-19 crisis — and even factored into packages passed under former President Donald Trump.", "Let’s break it down.", "Are prisoners eligible?", "Our friends at PolitiFact National dug into this question after U.S. Sen. Tom Cotton, R-Arkansas, said Democrats \"voted to give stimulus checks to criminals in prison.\" They rated the claim Mostly True.", "While Bradley described some crimes in detail for dramatic effect, the crux of his claim is the same as Cotton’s.", "Before the Senate passed the relief package, Democrats rejected an amendment from Cotton and Republican U.S. Sen. Bill Cassidy of Louisiana that would have barred stimulus checks from going to prisoners. U.S. Sen. Dick Durbin, D-Ill., argued this would harm the Black and brown families of prisoners already disproportionately affected by mass incarceration.", "And without that amendment, the bill that was passed said incarcerated people were eligible for stimulus checks as long as they’re a citizen or legal U.S. resident and either filed a tax return or requested a payment from the Internal Revenue Service. The IRS further notes that inmates can’t be denied relief if they meet those criteria.", "That said, this isn’t new.", "Prisoners were eligible for checks through similarly broad requirements in the CARES Act and a supplemental package passed in 2020 with Republican support under the Trump administration. The IRS attempted to block that group from receiving payments under the CARES Act, but a federal court ultimately rejected that effort.", "So, Republicans like Bradley who want to pin the blame solely on President Joe Biden and other Democrats are a bit off the mark.", "In an interview, Bradley said the latest stimulus checks are going to \"imprisoned murderers, rapists, and child molesters.\"", "Prisoners can, in fact, receive payments under the latest COVID-19 package — something that’s been true since the federal government started providing pandemic relief.", "Implying that this is the work of Democrats, as Bradley did, leaves out the fact the same was true of packages passed under Trump.", "We rate his claim Mostly True.", "Associated Press, GOP bill mandates prisoners' stimulus go to restitution, March 15, 2021.", "PolitiFact, Yes, Democrats voted to send stimulus checks to prisoners, as Republicans did last year, March 9, 2021.", "Internal Revenue Service, Questions and Answers about the First Economic Impact Payment — Topic A: Eligibility, accessed March 22, 2021.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]