["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The congressman challenging two-term U.S. Sen. John Cornyn in the 2014 Republican primary says Cornyn is vulnerable from the right.", "In a Dec. 10, 2013, blog post on his campaign website, Steve Stockman of Friendswood specified: \"In every poll liberal John Cornyn always loses to any conservative the voters have heard about.\"", "Calling Cornyn liberal is questionable, though we see that as Stockman’s opinion and not something that we could put to the Texas Truth-O-Meter. Suffice to say that Cornyn came out as the Senate’s second-least liberal and second-most conservative member in a February 2013 vote analysis by National Journal magazine.", "We turned instead to whether every poll shows Cornyn losing re-election to \"any conservative the voters have heard about.\"", "Voter polls", "Unfortunately, we failed to hear back from Stockman as we weighed the results of three fall 2013 voter polls testing Cornyn for re-election against particular possible Republican foes.", "An October 2013 poll by the University of Texas and Texas Tribune showed Cornyn leading at 39 percent against two little-known opponents, Dwayne Stovall and Erick Wyatt. Forty-eight percent of respondents had no opinion.", "On Nov. 14, 2013, UT government lecturer Jim Henson, one of the pollsters, wrote for the Tribune that this was \"by no means a forceful showing for an incumbent senator in a state as red as Texas, and has further fueled whispers of a primary challenge.\" Elaborating by email, Henson told us Cornyn saw his voter favorability ratings among Texas conservatives drop through the summer, \"which helped fuel further talk of a challenge from the right.\"", "Neither Stovall or Wyatt was widely known when the poll was taken, Henson said.", "Per Stockmn’s focus on Republicans Texans had \"heard about,\" Henson offered: \"I think it would roughly be fair to say that anyone who has previously run statewide or nationally, or has in some other way been the subject of media exposure, could be referred to as someone people have ‘heard about.’\"", "Two polls to go.", "In early November 2013, a survey taken by North Carolina-based Public Policy Polling indicated Cornyn was not the favorite of 388 past Republican primary voters, who by 49 percent to 33 percent indicated they would prefer a more conservative nominee.", "That poll also showed Cornyn ahead in hypothetical one-on-one faceoffs with two party figures and trailing another hypothetical challenger. According to a Nov. 6, 2013, press release on the results, Cornyn ran ahead of Biblical historian David Barton, former vice chairman of the Republican Party of Texas, by 51 percent to 18 percent, and led U.S. Rep. Louie Gohmert, R-Tyler, by 40 percent to 31 percent.", "The poll also asked about a hypothetical matchup between Cornyn and Gov. Rick Perry. The result: Perry drew 46 percent to Cornyn’s 35 percent. (Perry, of course, is not challenging Cornyn and has, in fact, endorsed him.)", "By email, PPP spokesman Tom Jensen noted that 38 percent of the polled voters had an opinion of Gohmert. Jensen said the firm did not poll on Barton’s name recognition, \"but it doubtless would have been lower.\"", "Jensen wrote: \"My bar of whether voters have heard about a candidate would be whether they have 50% name recognition,\" meaning half or more of the voters recognize the candidate’s name. \"Perry was the only one we tested who fit that bill. So Stockman’s statement might be true at some level but it’s not particularly compelling since there really just wasn’t much polling out there testing Cornyn against anyone who voters are very familiar with.\"", "Next, Jensen pointed us to an Oct. 26, 2013, poll by Human Events and Florida-based Gravis Marketing indicating that a generic \"Tea Party\" candidate, unnamed, would lead Cornyn among Republicans by 46 percent to 33 percent, according to a Gravis Marketing summary. The poll involved 563 Republicans, the firm said, and had a margin of error of plus or minus 3 percentage points.", "According to the summary, Cornyn led several hypothetical one-on-one races--including versus Stockman. The summary says Cornyn led Gohmert in its polls by 45 percent to 20 percent and ran ahead of Stockman, 41 percent to 15 percent.", "But Cornyn trailed in a one-on-one matchup with U.S. Rep. Ron Paul, who has run for president several times, 44 percent to 34 percent, the summary states.", "We wondered about a seeming conflict in the Gravis results: Cornyn outpacing Rafael Cruz, whose son, Ted, is the junior senator from Texas, by 39 percent to 33 percent, in their hypothetical one-on-one matchup yet in a later poll result, the elder Cruz leading Cornyn, Paul and Stockman in a hypothetical four-way primary.", "The latter question was: \"If the Republican primary were held today, would you vote for Cornyn, Cruz, Paul or Stockman?\" The results: Cruz, 41 percent, Cornyn at 25 percent, Paul at 18 percent and Stockman at 3 percent.", "By telephone, the president of Gravis Marketing, Doug Kaplan, told us he suspects some poll respondents answering the four-way question thought they were considering a Ted Cruz candidacy against Cornyn rather than a race involving his father, with the erroneous effect being a boost to the elder Cruz’s poll standing. \"I’m not confident with the way we worded that question,\" Kaplan said.", "Cornyn’s objection", "To our inquiry, Cornyn’s Senate campaign disputed Stockman’s website statement.", "By email, Cornyn spokesman Drew Brandewie pointed out that no one leading Cornyn  in the three polls was shown as attracting more than half the vote--in other words, winning the nomination outright.", "On another front, Brandewie maintained that Texas Republicans have \"heard about\" the two candidates bested by Cornyn in the UT/Tribune poll as well as Barton, Gohmert and the elder Cruz, each of whom did not lead Cornyn in the polled one-on-one matchups.", "Our ruling", "Stockman said: \"In every poll,\" John Cornyn \"always loses to any conservative the voters have heard about.\"", "In Stockman's favor, recent polling suggests Cornyn trailing Perry and Paul, two well-known Republicans, in hypothetical one-on-one matches.", "But polls also have shown Cornyn running ahead of Barton, Gohmert and Stockman. These Texans are almost certainly less known than Paul and Perry, both of whom ran for president. Yet Gohmert and Stockman are members of Congress and Barton has long been a grass-roots leader. We think it reasonable to consider each one a conservative that \"voters have heard about,\" which makes Stockman’s statement False.", "FALSE – The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Emails, Jim Henson, director, Texas Politics Project, University of Texas, Dec. 12, 2013", "Press release, \"Cornyn at risk with Republicans next year,\" Public Policy Polling, Nov. 6, 2013", "Emails, Tom Jensen, director, Public Policy Polling, Dec. 11-12, 2013", "Poll results summary, \"What Are Republicans Thinking In Texas?,\" Gravis Marketing,", "Telephone interview, Doug Kaplan, president, Gravis Marketing, Winter Springs, Florida, Dec. 11, 2013", "Emails, Drew Brandewie, communications director, John Cornyn campaign, Dec. 12, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]