["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Oct. 11, 2012, file photo, Hunter Biden waits for the start of the vice presidential debate where his father, Vice President Joe Biden appeared, at Centre College in Danville, Ky. (AP)", "Two weeks until Election Day, social media is rife with attacks on Joe Biden’s son Hunter Biden.", "A New York Post story about a recovered computer hard drive led to attacks about the Biden son’s business dealings. Facebook and cable news have gone further to suggest new and unsupported theories about what’s on the hard drive.", "One text post says, \"Hunter Biden had 25,000 pics of him torturing and raping children under age 10 in China on his laptop!\"", "Claims like this were amplified by websites like Natural News and InfoWars. Facebook has long banned the sites for posting anti-vaccine misinformation and hate speech, but we found one InfoWars video on Facebook with more than 173,000 views. It claims Trump \"has footage of Hunter Biden raping and torturing little girls.\"", "These posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Similar posts have been shared tens of thousands of times, according to CrowdTangle, a social media insights tool.", "We can’t say for certain what is or isn’t on a hard drive. But there is no evidence to support allegations that it contains thousands of images of Hunter Biden abusing children in China.", "(Screenshot from Facebook)", "The unproven claim has roots on a fringe internet forum that’s a known source of online disinformation, 4chan.", "On Oct. 15, Chanel Rion, the chief White House correspondent for One America News Network — a pro-Trump cable TV network — tweeted that she had seen the contents of the hard drive at the center of the New York Post story.", "\"Drugs, underage obsessions, power deals,\" she said in the post. \"Druggie Hunter makes Anthony Weiner's down under selfie addiction look normal.\"", "The tweet, which was shared more than 53,000 times, then made its way to 4chan, where users anonymously speculated that it meant the FBI was investigating Hunter Biden. One user posing as Rion affirmed that speculation, saying the hard drive contained child pornography.", "The real Rion tweeted Oct. 16 that she did not write the posts.", "\"For the record: I do not post on chat forums,\" she wrote. \"I understand there are hoaxers posing as me.\"", "But it was too late. Social media users dedicated to QAnon, a baseless conspiracy theory that claims Trump is secretly fighting a cabal of Satan-worshipping, cannibalistic, left-leaning pedophiles, took the 4chan posts as evidence that the FBI was investigating Hunter Biden for potentially possessing child pornography.", "By Sunday, the conspiracy theory had made its way to Fox News. \"Sunday Morning Futures\" host Maria Bartiromo noted that a name written on the back of a federal subpoena included in the Post’s story appears to belong to Joshua Wilson, an FBI agent who has worked on child pornography cases.", "\"Connect the dots: If an FBI agent is working on child pornography issues for five years, why is he subpoenaing the laptop of Hunter Biden? Is there a connection here?\" Bartiromo asked Sen. Ron Johnson, R-Wis.", "Johnson did not give a direct answer. \"Well, I think you just made the connection,\" he said. \"Again, this is what the FBI, I think, has to come clean about.\"", "Later that day, a tweet from Wayne Allyn Root, a conservative radio host who has pushed false claims about former President Barack Obama’s birthplace and the identity of the 2017 Las Vegas shooter, claimed to have breaking news.", "\"My sources-as high up as it gets- watched videos on Hunter’s laptops TODAY. Just told me point blank...no rumor...they saw Hunter raping & torturing little Chinese children,\" he tweeted.", "When asked in an email for evidence to support his claims aside from anonymous sources, Root did not provide any.", "There’s a lot we still don’t know about the hard drive at the center of the New York Post coverage.", "The story about Joe Biden and a Ukraine meeting relies on information from a computer hard drive that the tabloid said it received from Trump’s personal lawyer, former New York Mayor Rudy Giuliani. The computer was supposedly left unclaimed at a Delaware computer shop, the owner of which called the FBI and a Giuliani associate after noticing a sticker for the Beau Biden Foundation on the laptop. The emails cited in the Post’s article, which we are not able to verify, do not establish that a meeting between the elder Biden and a Ukrainian businessman ever occurred.", "Nowhere in the Post’s story is Hunter Biden linked to child pornography. We reached out to the FBI for more information, but it declined to comment due to its practice of \"neither confirming nor denying the existence of an investigation.\"", "RELATED: Looking at claims about Hunter Biden, and the Senate GOP report that helped fuel them", "Remember these points as you see claims about the laptop and stories around it.", "It's unclear if the name on the back of the subpoena actually belongs to Joshua Wilson, or if there’s more than one FBI agent who goes by that name. It’s also unconfirmed if the subpoena in the Post’s story was for the laptop.", "Federal investigators are looking into whether emails found on the laptop could be linked to a foreign intelligence operation to discredit Joe Biden. (More than 50 former intelligence officials told Politico they appear to be. Director of National Intelligence John Ratcliffe says they’re not.)", "Staffers at the Post expressed concerns about the story’s credibility before it was published. Fox News passed on the story until the emails could be properly vetted.", "The owner of the computer repair shop told reporters that, while he couldn’t confirm it was Hunter Biden who dropped off the laptop because he is \"legally blind,\" he also said he didn't see child pornography on the computer.", "No other news organizations have seen or corroborated the data supposedly on the laptop's hard drive.", "We reached out to the Biden campaign for a comment, but we haven’t heard back.", "Several Facebook posts claim \"Hunter Biden had 25,000 pics of him torturing and raping children under age 10 in China on his laptop.\"", "There is no evidence to support that.", "The allegation originated on an anonymous internet forum that’s a known source of online disinformation, and conspiracy websites that reported the claims relied on anonymous sources to back them up. The New York Post’s story about Hunter Biden’s laptop is unconfirmed — but it also does not mention child pornography. The owner of the computer repair shop where the laptop came from told reporters he didn’t see child pornography on it.", "Without information to support the allegations, we rate the posts False.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Business Insider, \"The New York Post inadvertently revealed the original source of its dubious Hunter Biden story,\" Oct. 14, 2020", "CrowdTangle, accessed Oct. 19, 2020", "The Daily Beast, \"Facebook Removes Conspiracy Site Natural News,\" Jan. 20, 2020", "Email from the FBI, Oct. 20, 2020", "Email from Wayne Allyn Root, Oct. 19, 2020", "Facebook post, Oct. 18, 2020", "Facebook video, Oct. 17, 2020", "InfoWars, \"Did Hunter Biden’s Laptop Contain Child Porn?\" Oct. 15, 2020", "Mediaite, \"EXCLUSIVE: Fox News Passed on Hunter Biden Laptop Story Over Credibility Concerns,\" Oct. 19, 2020", "Natural News, \"EXCLUSIVE: Chinese whistleblower reveals Hunter Biden ‘sex tapes’ contain video of Joe Biden’s son sexually ABUSING multiple under-age Chinese teens,\" Oct. 17, 2020", "NBC News, \"Feds examining whether alleged Hunter Biden emails are linked to a foreign intel operation,\" Oct. 15, 2020", "NBC News, \"Ratcliffe says no proof foreign actors tied to 'Biden' laptop, but officials say FBI is probing,\" Oct. 19, 2020", "Newsweek, \"From 'Child Porn on Hunter Biden's Laptop' to QAnon, Conspiracy Theories Pollute 2020 Election's Final Weeks,\" Oct. 19, 2020", "New York Post, \"Smoking-gun email reveals how Hunter Biden introduced Ukrainian businessman to VP dad,\" Oct. 14, 2020", "The New York Times, \"Facebook Bars Alex Jones, Louis Farrakhan and Others From Its Services,\" May 2, 2019", "The New York Times, \"New York Post Published Hunter Biden Report Amid Newsroom Doubts,\" Oct. 18, 2020", "The New York Times, \"One America News, the Network That Spreads Conspiracies to the West Wing,\" June 9, 2020", "Politico, \"Hunter Biden story is Russian disinfo, dozens of former intel officials say,\" Oct. 19, 2020", "PolitiFact, \"A look behind the NY Post headline about Joe Biden and a Ukraine meeting,\" Oct. 15, 2020", "PolitiFact, \"Hoaxes, fake news about the Las Vegas massacre,\" Oct. 2, 2017", "PolitiFact, \"What is QAnon, the baseless conspiracy spilling into US politics?\" Aug. 27, 2020", "Storyful, \"From Fringe to Mainstream: Tracking the Pathways of Misinformation on Social Media,\" Nov. 5, 2018", "Tweet from Aaron Rupar, Oct. 18, 2020", "Tweet from Chanel Rion, Oct. 15, 2020", "Tweet from Chanel Rion, Oct. 16, 2020", "Tweet from Wayne Allen Root, Oct. 18, 2020", "U.S. Senate Committee on Homeland Security and Governmental Affairs, \"Johnson, Grassley Release Report on Conflicts-of-Interest Investigation,\" Sept. 23, 2020", "Vice News, \"QAnon Is Running the Pizzagate Playbook With Hunter Biden,\" Oct. 19, 2020", "4chan thread, Oct. 15, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]