["For more than a decade, social media users have claimed that House Speaker Nancy Pelosi travels to her home state of California every weekend on a 200-seat Boeing 757.", "That claim has now resurfaced in a Feb. 21 Facebook post with over 2,000 shares that reads, \"Speaker Pelosi flys (sic) home to CA every week. She leaves on Friday & returns on Monday.\"", "The post goes on to claim that the Gulfstream assigned to her had to stop and refuel so she now uses a 200-seat Boeing 757.", "\"The fuel cost for this trip is $120,000 per RT. That is $5,760,000 annually not including crew $,\" the post reads.", "One user shared a similar version of the claim in a Feb. 26 post that features an image of a large plane that reads, \"See this plane. It's not Air Force One. This is QUEEN NANCY PELOSI'S JET.\"", "USA TODAY was unable to reach the users for comment.", "Fact check: False claim declares there are ID requirements to enter Washington", "The claim that Pelosi travels to California every weekend on an expensive Boeing 757 have been circulating on the internet since at least 2008, when it was first debunked by FactCheck.org.", "The plane Pelosi used most often for travel between Washington and San Francisco on business was the C-20B, a 12-seater based on the Gulfstream III. For any other trip, she flew commercial.", "Eric Sharman, deputy chief of public affairs at Andrews Air Force Base, and Pelosi's spokesman at the time both confirmed to FactCheck.org in 2008 that Pelosi used a C-32, a military version of a Boeing 757, one time when no other planes were available. The C-32 is able to make a nonstop flight across the country and includes 45 seats, not 200.", "Also known as Air Force Two, the C-32 is primarily used by the first lady, members of the Cabinet and Congress, according to an Air Force fact sheet.", "In 2007, then-House sergeant at arms Bill Livingood clarified that it was , and not Pelosi, who had requested a large plane for the House speaker because of security reasons.", "Livingood's statement was in response to accusations that followed reporting by The Washington Times that Pelosi had asked for a larger and more expensive plane than the one used by her predecessor, former House Speaker Dennis Hastert, CNN reported.", "Fact check: No deadline is in place for delivering State of the Union", "Drew Hammill, deputy chief of staff and spokesman for Pelosi, told PolitiFact in 2020 that Pelosi had access to a 12-seat Gulfstream from 2007 to 2011, during her first stint as speaker; after that she began routinely flying commercial.", "Hamill also recently confirmed to USA TODAY that claims that the House speaker travels on a 200-seat Boeing aircraft are false and have been for 13 years.", "In July 2019, CNN national affairs correspondent Jeff Zeleny posted a photo on Twitter of Pelosi on a crowded Delta flight.", "\"For those wondering, she's in coach,\" he added.", "Fact check:Fake Nancy Pelosi quote on Trump impeachment trial acquittal", "The claim that House Speaker Nancy Pelosi travels to California weekly on a 200-seat Boeing airplane is FALSE, based on our research. Pelosi's spokesman confirmed that this claim is false. The House speaker was also photographed flying commercial in 2019. She once flew on a military version of a Boeing 757 with 45 seats when no other planes were available due to security reasons.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]