["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Standing next to the other Texan seeking the Republican presidential nomination, U.S. Rep. Ron Paul of Lake Jackson suggested during a Sept. 7, 2011, debate that Gov. Rick Perry had flip-flopped on health care.", "\"You know, the governor of Texas criticized the governor of Massachusetts for Romneycare, but he wrote a really fancy letter supporting Hillarycare,\" Paul said, referring to two well-known health care overhaul plans that were debated about a dozen years apart.", "\"Romneycare\" is a term that critics use to refer to a 2006 Massachusetts health care law signed by then-Gov. Mitt Romney, who is also currently seeking the Republican presidential nomination. Many Republicans have criticized the law as a government intrusion into the health care system, including through its mandate that residents obtain health coverage. As PolitiFact has noted in previous fact-checks, the Massachusetts law is similar to the act that President Barack Obama signed into law in 2010.", "For this article, we’re reviewing only whether Perry wrote in support of what critics call \"Hillarycare.\" We’re not judging that label.", "Days after entering office in January 1993, President Bill Clinton created a task force to write health care overhaul legislation to bring costs under control and extend coverage to the nation’s uninsured. He selected his wife, Hillary, to lead it.", "In September 1993, President Clinton outlined his plan in a speech to Congress, and two months later, legislation was formally introduced by Senate Majority Leader George Mitchell of Maine. According to a 1994 analysis from the Kaiser Family Foundation, Clinton’s proposal for universal coverage built on an employer-based health insurance system, requiring individuals to have coverage and employers to provide coverage for their workers and contribute to their premiums. The plan also would have created \"health-purchasing alliances\" in which private insurers and providers would compete for business from people and businesses.", "A September 1993 New York Times news article reported that Americans \"would be guaranteed a generous basic package of coverage, negotiated separately in each state by alliances of consumers with insurance companies and medical groups.\"", "During the Sept. 7 debate, Perry did not dispute that he had written a letter to the first lady in 1993 when he was the Texas agriculture commissioner. \"We were hoping that she would be able to come up with something that would not leave (out) the agriculture men and women — because I was the agriculture commissioner at that particular point in time,\" Perry said. \"We had no idea it was going to be the monstrosity that's known as Hillarycare.\"", "Perry’s letter — dated April 6, 1993, and posted online Aug. 30, 2011, by the conservative website Daily Caller — was sent on Texas Department of Agriculture stationery. It opens with Perry saying that he thinks Clinton's \"efforts in trying to reform the nation's health care system are most commendable.\" He continues: \"I would like to request that the task force give particular consideration to the needs of the nation's farmers, ranchers, agriculture workers, and other members of rural communities. Rural populations have a high proportion of uninsured people, rising health care costs, and often experience lack of services.\"", "Perry then details some of the health care delivery problems in rural areas of Texas, including hospital closures and shortages of providers \"within a safe driving distance.\" The letter continues: \"I have made economic development for rural Texans a high priority in my Administration. Leadership, education, infrastructure systems, and health care facilities can do much towards aiding a rural community to prosper.\"", "In closing, the letter revisits its opening, stating that Perry thinks Clinton's efforts are \"worthy\" and asking that she \"remember this constituency as the task force progresses.\"", "The letter was last brandished against Perry in 2005 when U.S. Sen. Kay Bailey Hutchison was considering challenging him in the 2006 Republican gubernatorial primary. In a March 2005 news article, though, the Houston Chronicle described Perry’s letter as falling \"far short of actually being an endorsement\" of the Clinton health care plan. However, the story said, the letter was penned at a time when some commentators were already describing Clinton's idea for a \"government-sponsored HMOs and health care cooperatives as 'socialism.' \"", "The Chronicle article quotes Perry's 2006 campaign manager, Luis Saenz, as saying that when the letter was written, \"I don't know that anybody knew what the final efforts were going to be.\"", "In an Aug. 30, 2011, radio interview with Sean Hannity, who also has a Fox News Channel program, Perry said he wrote the letter because he didn't want the Clinton administration \"to overlook a very important constituency.\" Perry said he had no idea that the \"end product\" would be \"this monstrosity of a bill.\"", "Fair enough?", "Not so fast, said Gary Howard, a spokesman for the Paul campaign, who told us in an email that key aspects of the Clinton health care plan were already known before Perry signed the letter to the first lady. He pointed to a news article published in the Los Angeles Times the day before the date of Perry's letter.", "The April 5, 1993, article says that although many key details of the reform plan remained unsettled, \"the broad outlines\" were emerging. The story included specifics, including that the plan would likely create new \"government-certified regional health insurance purchasing cooperatives\" and impose a requirement that employers provide insurance to their workers.", "We checked to see what Austin American-Statesman readers were learning about the work of the health care task force around the same time. In the second half of March and first week of April 1993, the newspaper published at least 10 news and opinion articles related to the task force or its work, including reports on possible reform ideas and reactions to them.", "On April 3, 1993, the Statesman published a Los Angeles Times story on its front page noting that the Clinton plan was expected to lead to universal health coverage and a guaranteed set of health benefits for all Americans. The article quoted Ira Magaziner, a leader of the Clinton task force, as saying that care would be delivered under a \"managed competition system,\" with residents of a geographic area choosing among several health plans that meet government standards.", "The story also says the Clinton proposal would require businesses to provide health coverage for their employees. Workers could either choose their company's plan or select one offered by \"local buying organizations,\" which the employer would pay for, according to the article. The next day, the Statesman published another Times article; it details three mechanisms that the task force was reportedly considering to impose price controls on health care services.", "Our ruling", "It's correct that Perry sent a letter to Hillary Clinton commending her efforts as the head of the president’s health care task force at a time when the president’s general goals and some possible specifics of the plan had been reported. Yet Perry's letter, dispatched more than five months before the plan was finalized, is clearly a request that the task force consider the interests of rural Americans.", "We rate the statement as Mostly False.", "Republican presidential debate at Reagan library, video, Sept. 7, 2011", "Reagan Library presidential debate, video, Ron Paul's answers, Sept. 7, 2011, go to 3:00 mark", "PolitiFact National, \"Pawlenty says Obamacare is patterned after Romneycare,\" Aug. 12, 2011", "Government Printing Office, public papers of President William J. Clinton, \"Remarks and an exchange with reporters on health care reform,\" Jan. 25, 1993", "New York Times, \"Clinton asks backing for sweeping change in the health system,\" Sept. 23, 1993", "Los Angeles Times, \"Health care reform package formally introduced,\" Nov. 21, 1993", "Kaiser Family Foundation, \"Health reform legislation: A comparison of House and Senate Majority Leadership Bills,\" August 1994", "Kaiser Family Foundation, \"National health insurance: A brief history of reform efforts in the U.S.,\" March 2009", "Daily Caller, \"Rick Perry’s camp defends 1993 Hillarycare praise,\" Aug. 30, 2011", "Rick Perry letter to Hillary Clinton, from Daily Caller", "Houston Chronicle, \"Perry letter commending Hillary Clinton found,\" March 29, 2005", "Sean Hannity radio show, interview with Gov. Rick Perry, Aug. 30, 2011, via Houston Chronicle Perry Presidential blog", "Email (excerpt) by Gary Howard, spokesman, Ron Paul presidential campaign, Sept. 9, 2011", "Los Angeles Times, \"Shape of new health plan is emerging,\" April 5, 1993", "Los Angeles Times, \"Health plan said to let users pick own doctors,\" published in Austin American-Statesman on April 3, 1993", "Los Angeles Times, \"Prescription: Price controls?\" published in Austin American-Statesman, April 4, 1993", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]