["By Angelo Fichera", "Posted on June 17, 2020 | Updated on June 29, 2021", "A Facebook post is spreading the false claim that former President Barack Obama gave $3.8 million to a lab in Wuhan, China. The money referenced was actually provided to a U.S. research group. Only $600,000 went to the lab as part of a U.S.-approved collaboration.", "A post circulating on Facebook is spreading a debunked falsehood about U.S. funding that went to a lab in Wuhan, China — the city where the outbreak of the novel coronavirus began — as well as a false claim about the origins of the virus.", "“President Trump just announced that the ‘biological’ lab in Wuhan where the COVID-19 virus was created was ‘funded’ by President Barak Hussein Obama in 2015 to the tune of $3,800,000 American dollars,” the post reads. It further claims, falsely, that “this fact directly links Obama to all 150,000 deaths around the world!”", "The post, a text image, was uploaded as early as April but is continuing to spread.", "First of all, the suggestion that the virus was “created” is a baseless conspiracy theory that we first wrote about in February. We’ve continued to debunk similar claims.", "The post’s main claim about U.S. funding is one that we’ve also previously addressed.", "The $3.8 million figure refers actually to a $3.4 million grant that the National Institutes of Health awarded to a U.S.-based group, EcoHealth Alliance. That group was studying the risk of future emergence of coronaviruses from bats and first received the grant in 2014.", "Of that amount, EcoHealth gave $600,000 to the Wuhan Institute of Virology — a collaborator on the project that was pre-approved by NIH and the State Department — Robert Kessler, EcoHealth’s spokesperson, previously told us.", "The grant was renewed in 2019 for another five years, Kessler said — and EcoHealth received $292,161 that year (part of the total $3.4 million it received). NIH terminated the grant in April.", "President Donald Trump has also previously floated an unsupported claim that the amount received by the Wuhan lab was even higher — $7.5 million — and that he “ended it.” But as we explained before, the grant that was discontinued was EcoHealth’s and the portion that went to the lab was $600,000.", "A Fox News story in April also made reference to another $3.4 million NIH grant — regarding a behavioral study — and suggested that some of the funding may have gone to the Wuhan lab. (The story noted, however, that it was “not clear exactly how much U.S. funding went directly to the Wuhan Institute of Virology because it worked in collaboration with other institutions on the projects funded by the American grants.”)", "But the recipient of that other grant, which was renewed this year — Cold Spring Harbor Laboratory in New York — told us that wasn’t the case.", "“[B]ased on CSHL’s records for its NIH R01 award MH101214, there is nothing to indicate that any money from this grant was provided to the Wuhan Institute of Virology,” Dagnia Zeidlickis, the lab’s vice president of communications, told us in an email.", "Update, May 21, 2021: The exact origin of the coronavirus remains unknown. On May 14 the journal Science published a letter from 18 scientists calling for “more investigation” to determine how the pandemic began. “Theories of accidental release from a lab and zoonotic spillover both remain viable,” they wrote. “Knowing how COVID-19 emerged is critical for informing global strategies to mitigate the risk of future outbreaks.”", "Update, June 29, 2021: Please see our June 25 story “The Facts – and Gaps – on the Origin of the Coronavirus” for a detailed examination of the debate over the origin of the pandemic.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Fichera, Angelo, et. al. “The Falsehoods of the ‘Plandemic’ Video.” FactCheck.org. 8 May 2020.", "Kessler, Robert. Spokesman, EcoHealth Alliance. Email to FactCheck.org. 8 May 2020.", "McDonald, Jessica. “Baseless Conspiracy Theories Claim New Coronavirus Was Bioengineered.” FactCheck.org. 7 Feb 2020.", "“Regarding NIH Termination of Coronavirus Research Funding.” Press release, EcoHealth Alliance. 28 Apr 2020.", "Robertson, Lori. “Trump Spreads Distorted Claim on Wuhan Lab Funding.” FactCheck.org. 15 May 2020.", "U.S. National Institutes of Health. “Project Information | 2R01AI110964-06.” Research Portfolio Online Reporting Tools. Accessed 15 Jun 2020.", "U.S. National Institutes of Health. “Project Information | 2R01MH101214-06.” Research Portfolio Online Reporting Tools. Accessed 15 Jun 2020.", "Zeidlickis, Dagnia. Vice president of communications, Cold Spring Harbor Laboratory. Email to FactCheck.org. 16 Jun 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]