["In a July 9 report which we’ve archived here, Exclusive103.com -- a website with a history of sharing false information -- claims that Busola Dakolo said she was paid by two churches to accuse Fatoyinbo, the senior pastor of the Commonwealth of Zion Assembly (COZA), of rape.", "The report has been shared nearly 2,000 times on Facebook, according to social media analysis tool CrowdTangle.", "The headline reads: “I was paid by two churches to accuse Biodun Fatoyinbo of rape, he didn’t rape me – Busola Dakolo breaks down in tears and apologized”.", "The body of the report does not actually provide any further information to support the attention-grabbing claim made in the headline. It contains just two paragraphs of text -- both of them linking to a September 2018 CNN article about a completely separate case, that of the sexual assault allegations against US Supreme Court nominee Brett Kavanaugh. The second paragraph actually uses quotes from Kavanaugh’s accuser Christine Blasey Ford as if they were words from Dakolo.", "Dakolo made the explosive allegation against Fatoyinbo in this interview in June 2019, alleging that the pastor had raped her two decades earlier. Following her testimony, at least one other woman has come forward accusing the pastor of rape. Fatoyinbo has since stepped aside from the pulpit -- and has denied all allegations levelled against him by Dakolo.", "Some sections of social media in Nigeria have criticised her for speaking up. Many others have expressed support, however, and there have been protests against Fatoyinbo at COZA churches in Lagos and Abuja.", "The Exclusive103.com report is not the only unsubstantiated claim that has appeared online since Dakolo’s accusation against the pastor went viral.", "Other reports and Facebook posts, some of which we’ve archived here, here, here, say that Timi Dakolo had previously said his wife was a virgin when they got married in 2012 -- undermining the claim that she had been raped as a teenager.", "Some of the posts say Timi Dakolo made these comments in an interview with Hip TV.", "While the singer has often appeared on the TV station over the years -- including this interview where he talked about his wife -- we were unable to find any Hip TV video where he made the supposed comments about her virginity.", "Posts criticising the Dakolos have also claimed that they got married in a COZA church.", "The Dakolos appeared at a press conference in Lagos on July 20, where Timi Dakolo dismissed the various claims circulating about the couple as “distractions” from the seriousness of his wife’s rape allegation.", "Busola Dakolo did not speak at the press conference. Her husband said he was not giving her the microphone because he did not want people to see her cry.", "Timi Dakolo, however, rejected as false the idea that his wife had apologised to the pastor or admitted she was paid to make the accusation.", "“I even saw one that they said my wife collected money and paid two other people to come and talk, and that she is saying sorry,” he said of the rumours, describing them as “distractions”.", "In fact, the couple have filed a petition to the police over the case, although Dakolo said the force had not yet acted upon it.", "The singer complained on social media of “institutionalized intimidation” following the appearance of armed police at the family home over the weekend. The police say they were merely delivering an invitation letter for the couple to speak to them.", "It’s unclear in what capacity the Dakolos were invited to speak to police, although this series of tweets confirmed that the case is the subject of an ongoing police investigation.", "The invitation is sequel to an on-going police investigation touching on the wider and highly publicized case involving Bisola Dakolo, Pastor Biodun Fatoyinbo and others.", "As for reports that Timi Dakolo had discussed his wife’s virginity in a TV interview, the singer said he had never made any such comments, and he challenged journalists to unearth the footage if it really existed.", "“Let us look at it, what will I and the reporter be talking about that we will be discussing me and my wife’s sexuality? What will I be discussing in an interview that it will get to ‘my wife is a virgin’. It is not possible; there is no time, I can never.”", "And as for the suggestion that the couple married in a COZA church, he said: “I have never been to COZA in my life.”", "The couple have begun a campaign against sexual abuse in the church since Busola Dakolo went public with her allegations.", "Aisha Buhari, wife of President Muhammadu Buhari, has also called on the inspector general of police to get justice for rape survivors in the country.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]