["About this rating", "A meme posted to the Facebook page of the conservative organization Turning Point USA purports to show homelessness in \"San Francisco, [House Speaker] Nancy Pelosi's district.\"\n\nHowever, the picture above was not taken in San Francisco. It's a Reuters image taken at a homeless encampment in San Jose, California, which is about 55 miles southeast of San Francisco. Pelosi does not represent San Jose (the city lies in the district of another Democratic congresswoman, U.S. Rep. Zoe Lofgren).", "Although the meme was originally posted on March 27, 2018, it continued to circulate as of this writing. According to the Reuters caption, the photograph was taken on Dec. 4, 2014, just before authorities dismantled the encampment.", "According to The Mercury News, the encampment, which was once home to roughly 300 homeless people, has since been transformed into a nature reserve.", "That's not to say that California, specifically the Bay Area and San Francisco, doesn't have a severe housing problem. As the cost of housing soars, so does homelessness. But the meme not only gives a false location for the image, it depicts a site that no longer exists. We therefore rate this claim \"Miscaptioned.\"", "This is hardly the first inaccurate Turning Point USA meme to go viral on Facebook. In May 2019, for example, the organization posted a photograph of people searching for items to recycle in Indonesia and claimed falsely that it showed Venezuelans eating trash.", "Emmons, Mark. \"San Jose’s ‘Jungle’: Former Homeless Encampment Returns to Nature.\"\r\n  The Mercury News. 9 July 2015.", "Sulek, Julia Prodis. \"San Jose: Sweep of Homeless Encampment Monday to Draw Protests.\"\r\n  The Mercury News. 4 February 2018.", "KQED. \"Homelessness More Complex Since San Jose Shut Down 'the Jungle.'\"\r\n  29 June 2016.", "Creskes, Benjamin. \"San Francisco Homeless Count Goes From Bad to Worse, Jumping 30% From 2017.\"\r\n  The Los Angeles Times. 9 July 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]