["President Donald Trump. David J. Phillip / Associated Press", "A website claiming President Donald Trump ended welfare for immigrants ignores critical facts as much as Trump did when he announced this was his intention.", "\"BREAKING: Trump Just Ended Welfare For One HUGE Group For 5 Years! – Let The Riots ERUPT!\" said the headline of a March 29 post on americatb.com.", "In a nearly 1,000-word post, americatb.com recaps Trump’s desire for limits on federal benefits for immigrants, for a merit-based immigration system and for an end to \"chain migration.\"", "The story itself isn’t as affirmative as its headline, claiming Trump is \"about to\" ban immigrants from federal benefits.", "\"President Trump is about to end the longstanding abuse of the American welfare system and ban migrants from getting free money and handouts for five years,\" the americatb.com post said. \"The immigration rules will prohibit migrants from coming to the country and taking advantage of free American welfare money right away. It will slow down, or stop, chain migration while protecting American workers and potentially saving taxpayers money.\"", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat online hoaxes. Americatb.com doesn’t indicate who’s behind the website or what its mission is, and it doesn’t list contact information.", "Trump in June 2017 did say he wanted new immigration rules that would bar new immigrants from public benefits for a period of at least five years. But as we pointed out back then, there’s already a federal law that does that.", "The Personal Responsibility and Work Opportunity Reconciliation Act of 1996 said immigrants who entered the United States on or after Aug. 22, 1996, would not be eligible for federal \"means-tested\" public benefits for five years, starting on the date of their entry into the United States with a status meeting the definition of \"qualified alien,\" which includes lawful permanent residents.", "The law did outline several exemptions and said certain groups were not subject to the five-year restriction, including refugees and asylees, military veterans and active-duty military members, along with their spouses and unmarried dependent children.", "The americatb.com post accurately cited remarks Trump made in an August 2017 weekly address: \"Just this week, we announced a historic immigration bill to create a merit-based Green Card system that ends the abuse of our welfare system, stops chain migration, and protects our workers and our economy. As an example, you cannot get welfare for five years when you come into our country.\"", "Trump’s weekly address alluded to the Reforming American Immigration for a Strong Economy (RAISE) Act introduced by Sens. Tom Cotton, R-Ark., and David Perdue, R-Ga. Their bill does include a provision to prevent immigrants admitted under their proposed skills-based points system from receiving federal means-tested public benefits for five years.", "But as fellow fact-checkers at Factcheck.org have noted, while the RAISE Act tightens eligibility requirements, many would still remain eligible.", "The RAISE Act’s provision also only applies to those admitted under the skills-based system, which as Cotton has said, currently represents a small fraction of immigrants legally admitted per year. (The RAISE Act also seeks to limit family-based immigration.)", "Americatb.com’s post mixes in opinions and hypotheticals (\"Let’s say one million immigrants each get $30,000 worth of welfare benefits per year. That’s $30,000,000,000 of free welfare money sucked out of the American budget for people who put NOTHING back into our society, culture, or anything at all\")  but no evidence to back it’s claim that Trump \"just ended welfare\" for immigrants.", "We rate americatb.com’s claim False.", "Americatb.com, BREAKING: Trump Just Ended Welfare For One HUGE Group For 5 Years! – Let The Riots ERUPT!, March 29, 2018", "PolitiFact, Trump says 'time has come' for law restricting federal assistance to immigrants. It already exists, June 27, 2017", "WhiteHouse.gov, President Donald J. Trump’s Weekly Address, Aug. 4, 2017", "Factcheck.org, Trump Overstates Impact of Immigration Bill, Aug. 3, 2017", "PolitiFact, Arkansas senator says of 1 million green cards issued, few are employment-based, Feb. 14, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]