["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A still from Putnam's attack ad, which accuses DeSantis of supporting a 23 percent increase in sales taxes.", "With just a month left before the Florida primaries, Republican candidate for governor Adam Putnam accused rival Ron DeSantis of backing a massive tax increase that would hurt Florida’s economy.", "Set to suspenseful bluegrass music, the ad from Putnam’s Florida Grown political committee warns that a DeSantis-backed sales tax hike of 23% would touch everything from the market to the beach.", "\"What would a 23% sales tax do to Florida’s economy? If Congressman DeSantis had his way, everything would cost 23% more — groceries, gas, home purchases,\" the ad says. \"Congressman DeSantis sponsored legislation to increase sales taxes by 23%, hurting families, destroying jobs, devastating tourism.\"", "DeSantis did support a bill that proposed introducing a 23% federal sales tax, but the ad fails to mention an essential component of the plan: all other federal taxes, including income tax, would be eliminated.", "The ad shows a copy of HR 25, a bill known as the Fair Tax Act. A version of the bill has been introduced in Congress 10 times since 1999, earning support from prominent Republicans Mike Pence and Mike Huckabee.", "In 2013, 2015 and 2017, DeSantis, representing Florida’s 6th District, co-sponsored the bill.", "The idea behind the Fair Tax Act is to introduce a 23% federal sales tax that would replace other federal taxes. The bill eliminates income, estate, payroll and gift taxes, as well as the Internal Revenue Service itself.", "The tax’s supporters argue that even though purchasing items would be more expensive, consumers would be able to keep more of their income, and therefore have enough purchasing power to maintain the same lifestyle. Businesses would also save money, which would ideally lead to lower prices and more jobs.", "Libertarian radio host Neal Boortz, who co-wrote \"The FairTax Book,\" responded to Putnam's ad with a tweet: \"If you are having trouble understanding the FairTax, perhaps you ought to comment me. I wrote the book.\" He followed up, \"The Adam Putnam campaign is LYING THROUGH ITS TEETH … and they know it.\"", "Critics of the bill say that this would be a regressive tax plan, where poor and middle-class families pay more than wealthy households. The sales tax would apply to every purchase, even essentials like food and shelter, which comprise a larger portion of a low-income earner’s budget.", "There’s a lot of debate about the best-case and doomsday scenarios that could happen were the Fair Tax to become a reality.", "The bill might, for example, have a major impact on vacation destinations like Florida, which leans on tourism and its state sales tax. According to Jon Hamilton, finance professor at the University of Florida, higher sales prices would incentivize foreign tourists to visit cheaper destinations instead, like Cuba or the Bahamas.", "Steve Hayes, Americans for Fair Taxation president, says that the Fair Tax might actually cause prices to drop; because businesses would no longer have to pay payroll taxes, they could afford to cut prices overall.", "Because the ad is so skimpy on details, viewers could guess that DeSantis will push for the changes of the Fair Tax Act to be applied at a state level. Florida’s sales tax is 6%.", "DeSantis has not pushed for this as a candidate for governor. The plan does not appear in DeSantis’s campaign materials. Spokesman David Vasquez said, \"The Fair Tax plan is a federal proposal. He’s running on low taxes and limited regulation in Florida.\"", "The ad said, \"Congressman DeSantis sponsored legislation to increase sales taxes by 23%.\"", "The ad distorts what DeSantis sponsored in a few ways. It leaves out that the same plan would have eliminated almost all other federal taxes.  And by mentioning only \"sales taxes\" in the context of Florida’s economy, the ad creates a misleading impression that DeSantis wants the state’s 6% sales tax to surge by that amount.", "The statement contains an element of truth but ignores critical facts, leaving voters with the wrong impression. We rate this claim Mostly False.", "Florida Grown, \"23% More,\" July 24, 2018", "PolitiFact, \"Blanche Lincoln Ad highlights 23% sales tax in \"Fair Tax\" supported by John Boozman,\" Oct. 15, 2010", "PolitiFact Ohio,  \"AFSCME accuses Republican Jim Renacci of supporting a 23% national sales tax,\" Aug. 19, 2010", "PolitiFact Georgia, \"Fair Tax claim ignores contradictory economic models,\" May 18, 2015", "PolitiFact, \"Magic wands don’t exist,\" Jan. 23, 2008", "PolitiFact, \"Adding up the Fair Tax,\" Jan. 23, 2008", "Forbes, \"The Trouble with the FairTax,\" May 27, 2015", "Text of the Fair Tax Act of 2013", "Text of the Fair Tax Act of 2015", "Text of the Fair Tax Act of 2017", "Text of the Fair Tax Act of 2007", "Text of the Fair Tax Act of 1999", "Florida Politics, \"Adam Putnam, Ron DeSantis camps spar over federal ‘Fair Tax’ bill,\" July 25, 2018", "Wall Street Journal, \"FairTax: Flawed tax,\" Aug. 25, 2007", "Tampa Bay Times, \"Adam Putnam’s PAC runs negative ad accusing \"D.C. DeSantis\" of proposing 23% sales tax,\" July 26, 2018", "Tax Policy Center, \"What is the difference between a tax-exclusive and tax-inclusive sales tax rate?\"", "Orlando Sentinel, \"New Adam Putnam ad hits Ron DeSantis on national sales tax proposal,\" July 24, 2018", "Avalara TaxRates, \"Florida sales tax basics\"", "Email interview with David Vasquez, DeSantis campaign spokesperson", "Interview with Kurt Wenner, vice president of research at Florida TaxWatch", "Email interview with Steve Hayes, president of Americans for Fair Taxation", "Interview with Jon Hamilton, University of Florida finance professor", "Neal Boortz, tweet, July 26, 2018", "Neal Boortz, tweet, July 26, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]