["About this rating", "In late May 2020, Liberty University President Jerry Falwell Jr. tweeted a message criticizing a COVID-19 mask mandate issued by Virginia Governor Ralph Northam, saying he (Falwell) was \"adamantly opposed\" to it until he \"decided to design [his] own.\" He attached a picture of a mask bearing a photo from Northam's 1984 medical school yearbook that featured two men, one in blackface and one in a Ku Klux Klan robe. Falwell also called Northam, a Democrat, by the name \"Governor Blackface.\"", "Falwell, who leads the evangelical Christian university and is a supporter of U.S. President Donald Trump, later deleted the tweet after an outcry from faith leaders and Liberty University's Black alumni. In a letter condemning what they referred to as Falwell's \"incendiary rhetoric,\" the 35 alumni signatories wrote:", "While your tweet may have been in-jest about Virginia’s Governor, it made light of our nation’s painful history of slavery and racism. It is what we’re called to reject as followers of Christ -- “Let there be no filthiness nor foolish talk nor crude joking, which are out of place...” (Ephesians 5:4, ESV). The reckless nature of this tweet is a microcosm of the past several years of divisive rhetoric that does not display the kind of Christian witness that the Gospel demands of us, nor does it represent the Christlike leadership that Liberty University deserves. It has brought further disgrace to Jesus Christ and Liberty University.", "According to The Associated Press, Falwell said he had tweeted in support of Liberty students, including minorities, who would be affected by tuition assistance cuts proposed by Northam. Falwell added that his involvement in politics was in the spirit of Jesus Christ, \"who was not silent about the establishment political folks of his era.\"", "He also posted under the now-deleted tweet about Northam:", "\"Just so folks outside Virginia unfamiliar with the pic on the mask understand: it is from the personal page of the medical school yearbook of @GovernorVA. Just a way to shine a spotlight on the fact that Democrats are and always have been the real racists in this country,\" Falwell wrote.", "An inquiry into the photograph itself, which surfaced in February 2019, could not conclusively determine who the individuals in it were. Even so, the scandal nearly led to the governor's resignation. Northam initially apologized for the photograph, then denied it was his. He admitted later that he did wear blackface to another party that year.", "On June 8, responding to pressure from the Black alumni who criticized the Falwell's use of the photo and said they would stop encouraging people to attend, donate to, or speak at the university, Falwell apologized and said he had deleted the offending tweet:", "Falwell did tweet a picture with content considered racist, allegedly involving Virginia's governor. While Falwell claimed he shared the photo in order to showcase the behavior of racist Democrats and to support campus minorities, the content of the image is widely considered to be racially insensitive. We therefore rate this claim as \"True.\"", "BBC News.   \"Ralph Northam: Inquiry into Racist Photo Inconclusive.\"\r\n   22 May 2019.", "Rankin, Sarah, and Schor, Elana.   \"Black Liberty U. Alums Rebuke Falwell After Blackface Tweet.\"\r\n   The Associated Press.   1 June 2020.", "Rankin, Sarah, and Schor, Elana.   \"Jerry Falwell Jr. Apologizes for Tweet That Included Racist Photo After Black Alumni Denounce Him.\"\r\n   The Associated Press.   9 June 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]