["About this rating", "Amidst the COVID-19 coronavirus disease pandemic in March 2020, the Purcellville, Virginia, police department announced via Facebook that it was investigating an incident \"at a local grocery store involving juveniles reportedly coughing on produce, while filming themselves and posting it on social media.\"", "Although news reports stated that the store \"removed the tainted items and has reportedly taken appropriate health safety measures to protect the public,\" the Purcellville Police Department's post prompted wider concern because it declared that the \"coughing on produce\" incident \"appears to be a disturbing trend on social media across the country\":", "However, we haven't yet turned up any reports (verified or otherwise) of youngsters deliberately coughing on foodstuffs in stores (or other similar activities), other than this single suspected occurrence in Virginia.", "Moreover, news reports about the purported incident indicated that police had not actually turned up video of this particular alleged occurrence, either taken by the suspected perpetrators themselves or captured on store security cameras:", "Juveniles in Loudoun County reportedly filmed themselves coughing on grocery store produce and then posted the videos to social media, police say.", "Deputy Chief Dave Dailey [said] the group was seen taking videos by another patron but had not yet been able to locate the video in question on social media.", "Dailey said that the grocery store surveillance was not able to capture the incident, but showed the teens in the store.", "The Purcellville Police Department soon afterwards issued a statement in which they acknowledged that \"no actual customers or produce were spit or coughed on directly\":", "On March 19, 2020 the Purcellville Police Department notified the public of an incident which occurred on March 18th at a local grocery store involving juveniles reportedly coughing on produce, while filming themselves and posting it on social media.   After a thorough investigation, the Purcellville Police Department identified the juveniles involved, notified their parents, and subsequently interviewed the subjects.  The two juveniles questioned admitted to their involvement, and it was determined that there was no criminal intent.  The investigation concluded the teenagers were getting close to other patrons and coughing into their own sleeves, while filming it on their phones.  After viewing the video footage, officers determined no actual customers or produce were spit or coughed on directly, but we appreciate the store’s swift action in reporting the incident to police and removing any items in question to ensure the health of store patrons and employees.  Due to the age of the minors involved, no names or video footage will be released.", "We asked the Purcellville Police Department for additional information on the subject but had not received a response at publication time.", "Henney, Elliot.   \"POLICE: Northern Va. Teens Cough on Grocery Store Produce, Upload Videos on Social Media.\"\r\n    WJLA-TV.   20 March 2020.", "Asperin, Alexa Mae.   \"Police Investigating ‘Disturbing Trend’ of Teens Coughing on Produce.\"\r\n    KRON-TV.   20 March 2020.", "Updated rating to \"False\" to reflect latest statement from law enforcement.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]