["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "It’s never too early on social media to stir up interest about the next presidential election in 2020 -- especially if the buzz features a potential candidate who’s a bona fide celebrity.", "On Aug. 9, Rearfront.com -- a viral-content website that describes itself as a \"powerhouse of generating awesomeness\" -- posted an item headlined about former pro wrestler and popular actor Dwayne Johnson, sometimes known as \"the Rock.\"", "It said: \"Dwayne ‘The Rock’ Has Officially Filed For The 2020 Presidential Campaign And Twitter Is Already Going Crazy.\"", "Facebook users flagged the story as being potentially fabricated, as part of the social media site’s efforts to fight fake news. The post had attracted 16,700 views through Aug. 11. So we decided to take a closer look.", "As it turns out, the headline and some of the text in the article offered a garbled account of what had actually happened.", "Johnson, reportedly an independent, has indeed flirted with making a presidential run in 2020, though it remains to be seen how serious his is about a bid. In May, when he hosted the season finale of NBC’s Saturday Night Live, Johnson joined with fellow actor Tom Hanks under a large banner reading \"Johnson Hanks 2020\" as confetti flooded the stage.", "Johnson talked about the growing buzz about a candidacy with GQ writer Caity Weaver in June 2017.", "Weaver wrote: \"Johnson doesn't hesitate when I ask him whether he honestly might one day give up his life as the highest-paid movie star on earth — which is unquestionably easier, more fun, and more lucrative than being president of the United States — in order to run for office. 'I think that it's a real possibility,’ he says solemnly.\"", "Then someone took it seriously and filed papers with the Federal Election Commission -- but contrary to the Rearfront.com article, it wasn’t Johnson.", "On July 9, Kenton Tilford of Wheeling, W. Va., filed paperwork to formally establish \"Run The Rock 2020.\" It is what’s known as a draft committee -- an organization created \"solely to draft an individual or to encourage him or her to become a candidate for federal office,\" according to the Federal Election Commission.", "The paperwork says that the committee supports \"only one candidate … Dwayne Douglas Johnson.\"", "Where the Rearfront.com item gets it wrong is when it says that Johnson himself has \"officially filed\" as a 2020 presidential candidate.", "That is flatly wrong.", "The paperwork itself clarifies Run the Rock 2020 \"is NOT an Authorized Committee,\" meaning that it was not established by the candidate being supported.", "The Run the Rock 2020 website offers T-shirts for $20.20 to fund its grassroots effort.", "Tilford confirmed to PolitiFact that the Rearfront.com post \"is indeed incorrect.\"", "\"I have not been in touch with Mr. Johnson or his representatives,\" Tilford told PolitiFact. \"I'm simply a private citizen who formed a draft committee to rally like-minded people around the goal of encouraging him to run. As far as I know, Mr. Johnson and his representatives have not commented on the matter. We filed paperwork with the FEC because we hope to raise money and develop a real presence to show him the energy on the ground for his candidacy.\"", "That explanation squares with what Tilford had earlier told several other news outlets that he has not talked to Johnson himself.", "According to his LinkedIn page, Tilford graduated from Knox College in 2012 and has worked on campaigns in New Jersey and Louisiana. He was also a field organizer for Barack Obama’s 2012 presidential campaign in Clayton County, Iowa.", "We did not hear back from two representatives of Johnson’s camp.", "As for the headline’s message that The Rock is locked in for 2020, we rate that statement False.", "Rearfront.com, \"\"Dwayne 'The Rock' (Johnson) Has Officially Filed For The 2020 Presidential Campaign,\" Aug. 9, 2017", "Rearfront.com, About Us page, accessed Aug. 11, 2017", "Dwayne Johnson, Saturday Night Live monologue, May 20, 2017", "GQ, \"Dwayne Johnson for President!\" June 2017", "Federal Election Commission, paperwork to create Run the Rock 2020, July 9, 2017", "Federal Election Commission, \"Naming a nonconnected PAC,\" accessed Aug. 11, 2017", "Run the Rock 2020 website", "Kenton Tilford, LinkedIn page, accessed Aug. 11, 2017", "The Sun, \"Rock the House,\" July 10, 2017", "CNN, \"West Virginia resident creates 'Run The Rock 2020' campaign committee,\" July 10, 2017", "New York Post, \"Inside the campaign that wants The Rock to be president,\" July 13, 2017", "CBS News, \"Committee files to draft Dwayne Johnson for president,\" July 12, 2017", "Email interview with Kenton Tilford, founder of Run the Rock 2020, Aug. 11, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]