["The claim was published on Facebook here on October 9, 2020.", "The post reads in part: “The suicide rate in Victoria, Australia for the month of September 2020 is the same suicide rate for the whole of 2019", "“Melbourne has the most controlling Covid lockdown rules in the world", "“Before covid 56 humans tragically took their own lives every week in Australia. Now it’s averaging 125 per week in Victoria ALONE”.", "On July 7, 2020, five million Melbourne residents were ordered back into lockdown after coronavirus cases surged in Australia's second-biggest city, AFP reported here. On September 6, the lockdown was extended for two weeks despite a drop in cases. On September 28, the overnight curfew was lifted in the city and certain restrictions were eased.", "The claim was also posted on Facebook here.", "The claim, however, is false.", "The Coroners Court of Victoria, a government agency responsible for investigating and recording deaths, reported here there were 49 suicides in Victoria during the month of September 2020.", "In 2019, 534 suicides were recorded across the state up to September 30, according to government figures.", "Below is a screenshot of the agency’s report with relevant data circled in red by AFP:", "\"All suspected suicides are required to be reported to the Court for investigation,” according to the Coroner’s Court of Victoria media release on the data here.", "The agency’s website states: “Newly reported deaths are reviewed daily and recorded in the Court’s Victorian Suicide Register (VSR), the state’s most accurate real-time database on suicides and the source for the Court’s data reporting.”", "The misleading Facebook posts also claimed: \"Before covid 56 humans tragically took their own lives every week in Australia.\"", "There were 3,046 deaths by suicide in Australia in 2018, based on preliminary data from the Australian Bureau of Statistics (ABS) for 2018. On average, this equates to 58.58 deaths per week according to the data. As of October 14, 2020, the national suicide figures for 2019 were not available.", "However research conducted in 2019 by KPMG on behalf of Suicide Australia warned that suicide rates in Australia had been steadily rising in the last decade, UK newspaper The Guardian reported here on September 9, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]