["A message viral on Facebook, Twitter and WhatsApp alike claims that a new ‘smart’ debit card-esque passport will soon be launched in India. “The New Smart Passport Concept of future is here. The elegant All-In-One Identity solution for every Indian Citizen very soon. There won’t be any stamp. It will be like debit/credit card. Swipe it and move out,” reads the message.", "The New Smart Passport Concept of future is here. The elegant All-In-One Identity solution for every Indian Citizen…", "Posted by Harish K Nair on Sunday, 17 March 2019", "Alt News also received queries on WhatsApp regarding the authenticity of the smart passport.", "Alt News uploaded the image on Google and searched it with the keyword – ‘passport’. The first link that turned up was an article published in Medium titled – “The Passport — Concept.”", "The article was penned by an engineer and designer, Siddhant Gupta, who created a concept design for a passport card that resembles a pocket-sized ATM card. “I tried to design the very passport, after wondering just too much. What if, our Passport was a card and not a booklet, which would sit easily inside our wallet and we are not worried if the pages will eventually run out,” wrote Gupta.", "He used his own name and photograph on the design, which is now being circulated on social media as a new soon-to-be-launched smart passport.", "Viral messages such as these can be easily debunked with a simple reverse image search. One can conversely search for articles in the media that might have reported the news. A lack of reportage is sufficient hint that the message is most likely false.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]