["The image was included in this video published on Facebook on September 1, 2020.", "It purports to show a submarine with the numbers “99999-7” printed on its side.", "The post’s Thai-language caption translates to English as: “\"This is where the [winning] lottery number came from. The previous winning numbers were found on the Prime Minister’s car, and this time it’s on a submarine. The draw is clearly a scam.”", "The winning numbers for the first prize in Thailand's National Lottery were announced on September 1, 2020 as 999997.", "In June 2015, the same lottery made headlines after the last three digits of the winning numbers matched the licence plate numbers on Thai Prime Minister Prayut Chan-o-cha's vehicle.", "The image was also shared here, here, here, here, and here on Facebook alongside a similar claim.", "The claim, however, is false.", "A reverse image search on Google found the same image published here on the website of the Hong Kong-based newspaper Asia Times, on February 21, 2019.", "The report is headlined “Singapore launches next-gen submarine in Germany”.", "The report reads in part: “The Singapore Navy launched its first customized submarine, known as Invincible, in Germany this week in a ceremony attended by naval officials from both sides...The Invincible is the first of four customized submarines designed for operations in Singapore’s shallow and busy tropical waters.”", "Below is a screenshot comparison of the photo in the misleading Facebook post (L), and the photo in the Asia Times report (R):", "Singapore's acquisition of the German-made submarines was also reported by Singapore-based newspaper The Straits Times here and Channel News Asia here in 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]