["About this rating", "Donald Trump said during an October 2015 appearance on Meet the Press that if polls indicated he wasn't going to win the Republican presidential nomination, he would drop out of the race.", "Donald Trump did not recently say on Meet the Press that he would drop out of the presidential race if polls showed him losing to Hillary Clinton.", "Amid much speculation in early August 2016 about the possibility that beleaguered GOP nominee Donald Trump might drop out of the presidential race (and what would happen if he did), the image displayed above hit Facebook.   That image inaccurately implied that Donald Trump had recently proclaimed during an appearance on the Meet the Press public affairs program that he would \"drop out of the race before November\" if \"it's apparent in the polls that I'm going to lose to Hillary [Clinton].\"", "Actually, the referenced Meet the Press interview with Trump had taken place nine months earlier (on 4 October 2015), just four months after the business magnate announced his candidacy, well before any primary elections had been held, and long before either major party had selected a nominee.  Trump's response to a question by interviewer Chuck Todd about dropping out of the campaign and going back to running his businesses if polls showed him losing specifically referred to the long race for the Republican nomination that still lay ahead, not to the general election that was still more than a year off:", "CHUCK TODD: You said something the other day that caught me off-guard. You said you're not a masochist. And if you start falling in the poll you'll go back to your business. What does that mean? Are you not in this for the long haul?", "DONALD TRUMP: If I was dropping in the polls where I saw that I wasn't gonna win, why would I continue?  I believe in polls. How many elections do you see where the polls were wrong? Not that many. Okay. You see 'em, but not that many. If I were doing poorly, if I saw myself going down, if you would stop calling me 'cause you no longer have any interest in Trump because \"he has no chance,\" I'd go back to my business. I have no problem with that.", "In his most recent Meet the Press appearance, which took place on 24 July 2016 (just after the Republican National Convention had officially nominated him as the party's presidential candidate), Trump sounded nothing like a candidate pondering dropping out of the race:", "CHUCK TODD: One of the phrases you used, \"I alone can fix it.\" And to some people, that sounded almost too strong — mannish for them. Do you understand that criticism and what do you make of it?", "DONALD TRUMP: I'll tell you, part of it was I'm comparing myself to Hillary. And we know Hillary, and we look at her record. Her record has been a disaster. And I am running against Hillary. It's not like I'm running against the rest of the world. I know people that are very, very capable that could do a very good job, but they could never get elected.", "I can tell you right now. I can give you ten names of people that would do an extraordinary job, but there's no way they could ever get elected. They wouldn't know where to begin. It wouldn't be for them. But for governing, they would be good. I'm running and, you know, against one person.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]