["About this rating", "For several years, a black-and-white photograph purporting to show a man holding an enormous grasshopper has been widely shared on social media:", "Moreover, if the image were real, the grasshopper would cast a shadow on the man's pants and on the ground, in the same direction as the man's shadow.", "An uncropped version of the photograph shows that it was copyrighted in 1937 to Coles Studio:", "Grasshopper shot near Miles City Mont. C. 1937 Coles Studio Glassgow Mont", "The use of the copyright and the fact that other variations of this image were attached to various locales (such as North Dakota), indicate that this image may have originally circulated as a postcard. In fact, giant grasshoppers were a recurring theme in exaggerated postcards from the early 20th century. Here's an image created by photographer Frank D. \"Pop\" Conard featuring a similarly large (and unreal) grasshoppers:", "The Kansas Historical Society explains:", "When a swarm of grasshoppers descended on Garden City in 1935, Frank D. \"Pop\" Conard had a vision. The photographer made a montage of giant insects with humans and sold the postcards like \"hotcakes.\" \"The idea,\" Conard said, \"came to me after a flight of grasshoppers swarmed into Garden City attracted by the lights, and it was impossible to fill an automobile gasoline tank at filling stations that night. I went home to sleep, but awoke at 3:00 a.m. and all I could think about was grasshoppers. By morning I had the idea of having fun with the grasshoppers, and took my pictures and superimposed the hoppers with humans. I didn't do it for adverse impressions of Kansas, but as an exaggerated joke.\" A master retoucher, Conard continued to print \"hopper whoppers\" until his retirement in 1963. Grasshoppers were enlarged to battle a man, fit on the bed of a pickup, and hold up a train.", "The picture postcard presented the possibility to inventive photographers to extend the traditional tall-tale to the photographic plate, and what is more, to devise entirely new forms that were possible only through photography. It brought into being visual effects that tall-tale tellers through the centuries had seen only in their fertile imaginations.", "\"They say pictures don't lie,\" explained Conard, \"but from the sale of these postcards-the fastest selling novelty cards on the market it seems that Kansas people like a little funny, untruth.\"", "Although Conard was the giant grasshopper guru of the 1930s, he did not create the postcard featuring the hunter holding a three-foot grasshopper. However, we found two other examples of the work of Coles Studio:", "Instagram user Blake Nass shared an interesting, although unverified, story about the photograph in 2015. Nass claimed to be the grandson of the man in the photograph, Joseph Nass, and said that the picture was taken after an unsuccessful hunt:", "I'd be happy to pass along the story. @benshap is pretty close. Grandpa Nass was out shooting prairie dogs/gophers near miles city. Along came a truck loaded with a photographer traveling cross country and asked Mr. Nass to \"hold out his left hand like so and his right hand and rifle just the same\". A few exposures were taken and the photographer (presuming to be associated with Cole studio) said \"thanks, appreciate your time!\" and kept driving along. Grandpa Nass was a little unsure of what had taken place but carried on. A few months later the \"doctored\" photo appeared in some tabloid literature. Postcards primarily that poked fun at country types. At one time the media gave the photo a run with the story involving an Australian being the one posing with a trophy \"hopper\". An original photo held within the family coming soon!!", "At least part of Nass's story is verifiable. In September 1937, the Tomah Moniror-Herald published a story claiming that giant grasshoppers were terrorizing a local farmer's land. Leland Gregory recounted the story of the hoax in his book Stupid History: Tales of Stupidity, Strangeness, and Mythconceptions Through the Ages:", "On September 9, 1937, the front-page headliner of the Tomah Monitor Herald warned people: \"Giant Grasshoppers Invade Butts Orchard East of City.\" The article explained that grasshoppers had eaten special plant food used on an apple orchard belonging to farmer A.L. Butts and had quickly grown to three feet in length. Accompanying the article were photographs of shotgun-toting hunters tracking down the mutant insects as well as a picture of Farmer Butts holding up a dead grasshopper like a prize fish. The citizens of the town became jumpy and nearly hysterical at the thought of enormous grasshoppers bouncing through the town, destroying their crops, frightening the livestock, and generally wreaking havoc. The article, of course, was a hoax, and the Monitor-Hearld publisher, B.J. Fuller, along with Farmer Butts (yes, there was an actual Farmer Butts,) confessed to making the townsfolk the butt of their elaborate, and pesky, joke.", "The image showing a man holding a three-foot long grasshopper is not real. This picture was created as a prank in the 1930s and continues to fool viewers today.", "The Telegraph.   \"World's biggest insect is so huge it eats carrots.\"     1 December 2011.", "Kansas Historical Society.   \"Exaggerated Postcards.\"     December 2004.", "Gregory, Leland.   \"Stupid History: Tales of Stupidity, Strangeness, and Mythconceptions Through the Ages.\"     Andrews McMeel Publishing   15 July 2009.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]