["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "After Iran launched missiles at two United States military bases in Iraq, false images and videos were shared widely on Facebook. And some of them were posted by verified accounts with large followings.", "One user’s Jan. 7 post includes three photos of what appear to be missiles and explosions that took place at night. The photos were originally shared by a Facebook page called Kollege Kidd, which is verified and has more than 1 million followers.", "\"Iran just started war world 3,\" the user wrote in their caption.", "The images were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) They have been shared thousands of times.", "(Screenshot from Facebook)", "Like other visuals shared on social media after Iran’s strike, these photos were posted out of context. All of them depict old missile strikes, according to reverse image searches.", "The top photo, originally published by the European Pressphoto Agency, shows a June 18, 2017, attack by Iran against the Islamic State in Syria.", "The bottom-left photo was published by the Agence France-Presse and depicts the impact of a Nov. 15, 2019, Israeli missile strike in the Gaza Strip.", "The bottom-right photo shows a July 22, 2014, fire in the Gaza Strip impact after an Israeli missile strike. Its source is the Associated Press.", "Below is footage that Iran has released from its Jan. 7 strike in Iraq. There were no reported casualties.", "The Facebook posts are inaccurate. We rate them False.", "Al Jazeera, \"Iran fires missiles at ISIL positions in eastern Syria,\" June 18, 2017", "BBC, \"Israel-Gaza ceasefire strained by rockets and air strikes,\" Nov. 15, 2019", "Facebook post, Jan. 7, 2020", "Facebook post, Jan. 7, 2020", "HuffPost, \"This Is What Iftar In Gaza Looks Like As Ramadan Violence Continues,\" July 27, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]