["About this rating", "On 15 August 2016, the web site Real News Right Now published an article reporting that police in Scranton, Pennsylvania opened fire on a department store mannequin because the object failed to \"comply\" with orders:", "Officers arrived on the scene to find what they believed was a muscular African-American man standing idly behind a dumpster. “The individual in question was dressed in a tan hoodie-style sweatshirt and appeared to be naked from the waist down,” Major Howard Colvin told the Scranton Times.", "A Macy’s employee who agreed to speak to FOX 25 News on condition of anonymity confirmed that the dark grey semi-flexible mannequin had been thrown out Saturday night due to a faulty display stand.", "“Our officers attempted to communicate with the suspect in an effort to resolve the matter peacefully ... When the suspect failed to comply with the officers demands, they responded with appropriate force given the perceived nature of the threat,” Colvin told reporters. It wasn’t until after Scranton police had fired over sixty-five rounds into the mannequin’s back, legs, and upper torso, that they discovered their suspect was made of wire and fiberglass rather than flesh and bone.", "The article's closing line hinted at its satirical take on the issue of police shootings:", "In an effort to prevent future mishaps, Scranton authorities are asking local businesses to take extra care to properly disassemble mannequins and other human-like statues prior to disposal.", "The article (like all other content hosted on the site) is not representative of real events, but Real News Right Now does not include a disclaimer identifying it as a fake news web site. Its \"About\" page claims author R. Hobbus J.D. has received awards such as the \"Oscar Mayer Award for Journalistic Excellence\" and the \"Stephen Glass Distinction in Journalistic Integrity.\"", "Previous articles from Real News Right Now include reports that President Obama was stripping Texas of statehood (and banning possession of Confederate flags), Pope Francis was planning to change the Ten Commandments, the wreckage of Malaysia Airlines Flight 370 was found in a warehouse owned by CNN, and that the Obama administration allocated Navajo land for hundreds of thousands of refugees.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]