["About this rating", "In 2018, two dates important to Christians -- Ash Wednesday and Easter -- will fall on widely-celebrated secular holidays, prompting at least one meme-creator to declare it \"a weird year:\"", "In 2018, Easter Sunday lands on April 1, which is also famously known as April Fools Day, when people play pranks on relatives, friends, co-workers, and the world at large. Ash Wednesday therefore falls on February 14, which is also observed as Valentine's Day (or Saint Valentine's Day), originally a Christian feast day honoring one or more early saints and now a secular occasion for lovers to express their affection for each other (particularly by exchanging greeting cards).", "Easter, the most important holiday on the Christian calendar, commemorates the resurrection of Jesus from the dead after his crucifixion by the Romans, as described in the New Testament. Easter is preceded by an approximately six-week period (46 days) of fasting, prayer, and penance referred to as Lent, which begins on Ash Wednesday (during which ashes are ceremonially applied to the foreheads of Christians to \"signify an inner repentance.\")", "The date of Easter varies from year to year, generally falling on the Sunday following the Paschal Full Moon (i.e., the first full moon of Spring in the northern hemisphere, or the first full moon occurring after the date of the vernal equinox). The earliest calendar date on which Easter can fall is March 22, and the latest date is April 25. Since Ash Wednesday is observed 46 days before Easter, it can fall as early as February 4 or as late as March 10.", "This confluence of religious and secular days hasn't occurred since 1956, but we won't have to wait another 62 years to experience it again: Easter Sunday will next fall on April 1st in 2029, and then again in 2040.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]