["About this rating", "Illegal immigration remained a top issue for U.S. President Donald Trump and continued to divide Americans in mid-2019, all the more so after Trump told several Democratic members of Congress of immigrant parentage, all but one of them born in the United States, they should \"go back and help fix the totally broken and crime infested places from which they came.\"", "Silent throughout the recriminatory back-and-forth that ensued was First Lady Melania Trump, who herself was the child of foreign-born parents, and who only attained citizenship after marrying Donald Trump in 2005. Her mother and father, both natives of Slovenia, followed her in applying for and receiving citizenship in 2018.", "Those basic facts formed the basis of an article published in July 2019 by the website Taters Gonna Tate, which is part of a network of sites and social media accounts that distribute online content under the brand America's Last Line of Defense (LLOD). Entitled \"AOC Starts ‘Chain Migration’ Proceedings Against Melania Trump,\" the article proceeds from the premise that U.S. Rep. Alexandria Ocasio-Cortez (AOC), one of the members of Congress singled out by Trump, wants to use one of Trump's own immigration bugaboos, so-called \"chain migration,\" to deport the first lady and her parents:", "Alexandria Ocasio-Cortez has sworn to now begin delivering on the promise that got her elected – to have First Lady Melania Trump’s parents deported through Trump’s own laws against chain migration, adding that the subject of exiling Melania herself and offspring, Barron, would wait until “After Oompah-Loompah leaves the White House because it’s bad optics right now.”", "AOC claims that President Trump’s own legal adjustment on the subject of chain migration should nullify the legal status of Oedipus and Jezebel Beelzebub, Melania’s parents. She suggests that the only reason the two were granted citizenship was because of the status Melania received after her now celebrated Green Card wedding to our president. This is simply not true.", "For context, \"chain migration\" is a term used to describe immigration procedures that allow adult U.S. citizens to obtain citizenship for foreign-born adult relatives. Reportedly, the first lady's parents secured their citizenship through just such a procedure — though we needn't belabor the point, because everything else in the story is fictional (Melania Trump's parents aren't named \"Oedipus and Jezebel Beelzebub,\" for example).", "Like the rest of the entities comprising LLOD, Taters Gonna Tate mimics a news format but publishes only fabricated content calculated to generate controversy and attract social media likes and shares. Despite displaying little redeeming value in the way of entertainment or social commentary, the network labels this content \"satire.\"", "Correal, Annie and Cochrane, Emily.   \"Melania Trump’s Parents Become U.S. Citizens, Using ‘Chain Migration’ Trump Hates.\"\r\n   The New York Times.   9 August 2018.", "Associated Press.   \"Trump's Tweets Against Congress Members Called Racist.\"\r\n   15 July 2019.", "Taters Gonna Tate.  \"AOC Starts ‘Chain Migration’ Proceedings Against Melania Trump.\"\r\n   17 July 2019.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]