["About this rating", "On 16 December 2015 the Facebook page \"Go Left Forever\" published the above-reproduced meme holding that in 2015, toddlers were responsible for the deaths of more Americans than \"foreign terrorists.\" The claim appeared widely in various forms of media, and its primary source being a 14 October 2015 Washington Post \"Wonkblog\" article that culled statistics from a manual search of news reports.", "A little kid finds a gun, fires it, and hurts or kills himself or someone else. These cases rarely bubble up to the national level except when someone, like a parent, ends up dead ... But cases like this happen a lot more frequently than you might think. After spending a few hours sifting through news reports, I've found at least 43 instances this year of somebody being shot by a toddler 3 or younger. In 31 of those 43 cases, a toddler found a gun and shot himself or herself.", "As noted on the graph, the paper manually located instances in which a toddler (defined by the author as \"[three] or younger\") killed someone, a task complicated by the lack of centralized records of shootings involving toddlers. The author stated that the victims (including toddlers themselves) used in compiling the numbers were shot or killed, though that information was clearly broken down visually in the graph excerpted above. By the Washington Post's count, as of mid-October 2015 fifteen people had died at the hands of a toddler with a gun, and at least 28 more were injured (including other toddlers).", "One potentially mutable variable involves the definition of \"toddler.\" As with our earlier article regarding the claim that more preschoolers  were shot and killed than police officers, the definition of the term \"toddlers\" is not universal, although it is generally accepted to encompass children between the ages of one and three.", "On 29 November 2015, the Huffington Post published a follow-up article that possibly introduced more information (an additional nine toddler-involved shootings occurred by their count, bringing the total from 43 to 52 as of  that date). Huffington Post also introduced the contrast of terrorism victims to toddler victims:", "When that article was published on Oct 14th, there had only been 43 toddler shooting incidents. Since then, there have been 9 more, with an average of one toddler involved shooting a week<. Yet, in this year's only shooting involving Islamic terrorists in Chattanooga, Tennessee, five people died, with two additional people being injured.", "That second article complicated the data. Who had been counted by Washington Post, and who had been counted by Huffington Post? Would a similar manual search of records lead to double-counting?", "We searched news reports from 14 October 2015 forward, finding several \"toddler-involved shootings\" with a variety of outcomes.  Young children in Acworth and Jackson, Georgia found guns and shot themselves after the publication of the Washington Postpiece (neither survived); a boy in Rock Hill, South Carolina shot his grandmother but did not kill her; two-year-old Abigail Newman was shot in the neck and killed in North Carolina in late October; and a three-year-old was shot and killed by his six-year-old brother in Chicago.", "Another data complication showed up in the Huffington Post's presentation. Their article emphasized a parallel with terrorism-related deaths and compared toddler-involved shootings with the July 2015 Chattanooga mass shooting that killed six (including the gunman). The deceased suspect in that mass shooting was in fact an American citizen (born in Kuwait) so whether an individual who was by all accounts a U.S. citizen counts as an \"Islamic terrorist\" is a factor of some debate that affects the compilation of data.", "Huffington Post described the Chattanooga shooting as \"the only\" incident involving \"Islamic terrorists\" in the United States in 2015. At the time, that description was partly true: Suspect Muhammad Youssef Abdulazeez was American but also a Muslim, and he was believed to be the sole shooter (not one of more \"terrorists.\") As our earlier article indicated, law enforcement agents considered the incident under investigation and incomplete as of mid-November 2015:", "On 13 November 2015, the Associated Press reported that investigators remained circumspect about Abdulazeez's motive:", "\"We're still trying to make sure we understand Abdulazeez, his motivations and associations, in a really good way,\" FBI Director James Comey told reporters during a visit to Nashville's FBI field office on Friday.", "Comey said he understands the public interest in the shooting, but he did not know whether there would ever be a public report on it.", "\"Sometimes the way we investigate requires us to keep information secret. That's a good thing. We don't want to smear people,\" he said.", "Thus, by November 2015 the relative body counts of foreign terrorists to toddlers were by all accounts murky and dependent on individual definitions of several terms. On 2 December 2015, a mass shooting in San Bernardino left 14 civilians and two attackers dead. By the time the meme reproduced at the top of this page was published on 15 December 2015, the shooting was still considered an active investigation and details remained fluid.", "Initially, investigators adamantly asserted the motives for the shooting were unclear. Federal law enforcement agents took over the investigation within a few days, and at that point mentions of \"self-radicalization\" and \"ISIS sympathizing\" officially entered media reports.", "By 16 December 2015, some of those initial reports were walked back: The Blaze reported that there was no evidence the shooters were involved in a \"terror cell.\"  Wikipedia, which has served as a compendium of multiple reports, classified the incident as \"terrorism, mass shooting, [and] workplace shooting.\"", "What's more, on 16 December 2015 The Hill reported that initial claims one of the shooters publicly supported \"jihad\" on Facebook had been inaccurate:", "The FBI said that suspected San Bernardino, Calif., shooters Syed Farook and Tashfeen Malik did not express their support for jihad publicly on social media, potentially undercutting efforts to ramp up surveillance of foreign travelers’ online presences.", "FBI Director James Comey told reporters that there was “no evidence of a posting on social media by either of them\" to reflect that they had been radicalized.", "The communications instead were “direct, private messages,” the FBI head said during a news conference in New York.", "“I’ve seen some reporting on that and that’s a garble.”", "FBI Director James B. Comey said at the time that although the investigation had shown that Farook and Malik were radicalized and possibly inspired by foreign terrorist organizations, there was no indication that the couple were directed by such a group or part of a broader cell or network.", "Like Abdulazeez, Malik and Farook were Muslims. But also like Abdulazeez, Farook was American, born in Chicago. Malik was Pakistani and lived in Saudi Arabia before marrying Farook, but lived in the United States as a permanent resident.", "On 17 December 2015, we contacted Christopher Ingraham, the Washington Post journalist whose article inadvertently sparked all the comparison memes. Ingraham confirmed that he continued compiling information on toddler-involved shootings after publishing his October 2015 article and provided us with updated data.", "Noting that \"in most cases, the toddlers are killing or injuring themselves,\" Ingraham counted 58 total toddler-involved shootings in 2015 as of 17 December of that year. In 19 instances toddlers shot and killed themselves, and in two others toddlers shot and killed other individuals.  That brought the total of toddler-involved shooting deaths in the United States in 2015 to 21.", "By contrast, if we counted both the Chattanooga shootings and San Bernardino as instances of Islamic terrorism, that would mean 19 Americans were killed in instances of suspected, reported, or potential Islamic terrorism in 2015. Counting American victims of the November 2015 Paris attacks brought that number up to 20.", "Even using the broadest leeway in counting U.S. victims of \"Islamic terrorism\" leads to the same mathematical conclusion: More Americans were shot and killed by toddlers in 2015 than were killed by Islamic terrorists.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]