["On February 17, scores of Twitter and Facebook users claimed that Bengaluru-based activist Disha Ravi hid her Christian identity and her full name is Disha Ravi ‘Joseph’. Disha was arrested by Delhi Police on February 14 for allegedly editing a toolkit on Google docs related to farmers’ protest which was also shared by Swedish climate activist Greta Thunberg.", "Twitter user @SaffronSunanda wrote, “Her full name is Disha Ravi Joseph. That’s the tweet”. This tweet has gained over 4,000 retweets and 13,000 likes as of this writing.", "The Pioneer’s editor Pramod Kumar Singh and Asianet News CEO Abhinav Khare also tweeted the viral claim.", "This slideshow requires JavaScript.", "BJP members Geetha Kothapalli and Prajwal Busta followed suit.", "This slideshow requires JavaScript.", "Indian Film & Television Directors’ Association Ashoke Pandit and Supreme Court advocate Prashant Patel Umrao made the same claim. Umrao wrote, “Disha Ravi Joseph is a Syrian Christian from Kerala. Members of this community always at the forefront of Breaking India movements!”", "The text of Umrao’s now-deleted tweet has been copy-pasted by several Twitter and Facebook users. Alt News has documented misinformation shared by Umrao and Pandit on multiple occasions. Readers should note that Umrao recently falsely claimed that Nikita Jacob, who is also an accused in Greta Thunberg toolkit case, met Delhi Chief Minister Arvind Kejriwal.", "Twitter account of the Indu Makkal Katchi, a Tamil-Nadu based right-wing Hindu political party, also tweeted that Disha is Christian. This tweet gained over 500 retweets. Likewise, Facebook page ‘NoConversion‘ made the same claim. This page has over three lakh followers.", "Anonymous Twitter account @SouleFacts, which is followed by PM Narendra Modi, wrote, “Fraud activist… Rice Bag Disha Ravi JOSEPH. Does the name ring a bell? They are always part of Break India Gang.” Similarly, several Twitter users followed by Prime Minister Narendra Modi claimed Disha Ravi hails from the Christian community.", "We spoke with multiple individuals who know Disha personally. They refuted the claim that she is Christian. This claim surfaced after it was reported that Disha is an alumnus of Mount Carmel College, Bengaluru.", "The false claim was earlier fact-checked by The News Minute (TNM) which stated that her full name is Disha Annappa Ravi. Prasanna R, a lawyer and close friend of Disha’s family, told TNM, “Her mother’s name is Manjula Nanjaiah, father is Ravi. They are from Tiptur in Tumkur district of Karnataka.” He added, “Disha’s religious identity does not matter here. How is it relevant if she is Christian or Hindu? She is a nature lover and had friends from all over. She has not followed any religion though she was brought up in a Lingayat household. It is unfortunate that we have to debunk this cooked up religious identity that is being used to spread hatred further.”", "No, her name is not Disha Ravi ‘Joseph’: Friends debunk lies about arrested activist https://t.co/787wtNYGWn", "— The News Minute (@thenewsminute) February 17, 2021", "Sahana Das, professor at Mount Carmel College (MCC), told Alt News, “We have a database of over 10,000 students. While it is not impossible to find documents that establish Disha’s religious affiliation, MCC doesn’t want to encourage practices that overlook the achievements of passionate individuals and identifies them solely based on religion.”", "Despite being pointed out that Disha does not hail from the Christian community, BJP member Kothapalli wrote, “Lol What’s her father Ravi’s full name? He is Ravi Joseph smartly you told full names of Disha & her mother but hid the father’s full name…”", "TNM reporter Prajwal Bhat tweeted that her father’s name is Ravi Annappa.", "Her father name is Ravi Annappa btw", "— Prajwal (@prajwalmanipal) February 17, 2021", "Journalist Pramod Kumar Singh later tweeted a correction without taking down his tweet carrying the false claim.", "To conclude, several prominent right-wing social media accounts falsely claimed that activist Disha Ravi is Christain. Even as the false claim is debunked, it is worthy to mention that Disha’s religious affiliation has no bearing on her case and this is just another attempt to malign a minority community. Since her arrest, Alt News has debunked multiple false claims targeting Disha Ravi.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]