["The misleading video was included in this Facebook post published on March 12, 2019.", "Below is a screenshot of the misleading post:", "The Hindi language caption translates to English as: “The crowd is chanting Modi at a Congress rally”.", "The man seen speaking into a microphone on the stage is Alpesh Thakor, a member of the legislative assembly from western Indian state of Gujarat. This is his official Facebook page.", "In the 41-second clip, Thakor can be heard telling the crowd to shout “Rahul Gandhi Zindabad” which translates to English as “Long Live Rahul Gandhi”.", "Rahul Gandhi is the president of the Indian National Congress party. This is his official Twitter page.", "In the misleading video, the crowd responds to Thakor’s request with chants of “Modi, Modi”.", "The misleading clip has been edited from a longer video of a rally in Gujarat’s capital Gandhinagar, which was filmed on October 23, 2017.", "The original video was published here on the YouTube page of the Gujarat Congress.", "The same video was also live streamed on the Gujarat Congress Twitter account here on October 23, 2017.", "The Gujarat Pradesh Congress Committee is a unit of the Indian National Congress for the state of Gujarat. This is its official website.", "Multiple media reports about the Gandhinagar rally, including this report from Mumbai based news site DNA from October 23, 2017, show similar scenes to those seen in the Gujarat Congress video.", "Below is a screenshot of the DNA article, which includes a photo of the rally in Gandhinagar:", "This video published on a Gujarati news YouTube channel on October 23, 2017 also shows the rally.", "AFP compared the misleading video with the original Gujarat Congress.", "Below is a screenshot comparison of the misleading video (l) and the Gujarat Congress video (r):", "The misleading video is of lower quality than the Gujarat Congress video.", "The misleading video also contains a black rectangular bar at the bottom of the screen in place of the blue banner seen in the Gujarat Congress video.", "The footage in the misleading video matches exactly with three sections of the longer Gujarat Congress video.", "The first part of the misleading clip, from zero to five seconds, can be seen in the Gujarat Congress video at the 33 minute four seconds mark.", "Here is a screenshot comparison of the misleading video (l) and the Gujarat Congress video (r).", "The next section of the misleading clip, from six seconds to 16 seconds, can be seen in the Gujarat Congress video at the 33 minutes 34 seconds mark.", "In the misleading clip, the crowd shouts “Modi, Modi” at the seven seconds mark, after Alpesh Thakor shouts “Rahul Gandhi”.", "In the corresponding section in the Gujarat Congress video, the crowd’s response to Thakor can be heard as “Rahul Gandhi Zindabad” which translates to English as “Long Live Rahul Gandhi”.", "The misleading clip then cuts to a black screen at the 17 second mark:", "The video then resumes to show Thakor speaking again. From the 18 seconds mark to 41 seconds in the misleading clip, the footage then corresponds with the Gujarat Congress video from the 12 minutes 09 seconds mark.", "Below is a screenshot comparison of the crowd in the misleading clip (l) and the Gujarat Congress video:", "In the misleading clip at this point, the crowd can be heard shouting “Modi, Modi”, but in the 2017 Gujarat Congress video, the crowd remains silent.", "In the misleading video, Thakor then continues to speak until the end of the clip, while the crowd continues their Modi chant. But in the Gujarat Congress video, the crowd remains silent.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]