["About this rating", "Congresswoman Alexandria Ocasio-Cortez (D-NY) became a favorite target of conservative trolls after winning election to the U.S. House of Representatives in November 2018. The freshman lawmaker was subjected to a number of false rumors, most of which focused on her inexperience (at age 29 she was the youngest woman ever elected to Congress), her financial status (she was a bartender before running for election), or, inexplicably, her dance moves.", "On 16 January 2019, a day after Ocasio-Cortez announced that she would be joining the House Financial Services Committee, Facebook user Donn Johnson posted a message alleging that Ocasio-Cortez was an ill fit for this position and claimed, without evidence, that she had had two checking accounts closed, that she had been the subject of two \"sheriff evictions,\" and that her credit score was a lowly 430:", "A credit score of 430 puts a consumer in the \"very poor\" range of credit worthiness:", "Although this message was posted without any evidence to support its claims, many viewers accepted its unverified information as fact and spread it around Facebook. The rumor was also picked up by an army of Twitter trolls who continued to parrot the claim as if it were based on some sort of credible reporting:", "Repeating this claim over and over again, however, did not make it true.", "We encountered several dozen accounts spreading this rumor, yet not a single one pointed to any sort of news report, interview, financial record, witness statements, or anything else even slightly resembling evidence. In addition to a lack of evidence, it should be noted that it is highly unlikely that Johnson, a security officer living in Florida, would have access to information regarding Ocasio-Cortez's credit score, as this information cannot be obtained by a third party without written consent under the Fair Credit Reporting Act.", "Johnson claimed that Ocasio-Cortez had been evicted from her home twice with the help of a sheriff's office. We did a background check on the congresswoman and found no mention of such an incident, no court cases tied to her living arrangements, and no irregularities  in her housing history.", "She was a rising political star in 2018. As such, a number of news outlets published profiles about her that detailed Ocasio-Cortez's upbringing, her education, and her political motivations. We examined several of these stories and also found no mention of her alleged \"sheriff evictions,\" closed bank accounts, or low credit score.", "Fox News, for instance, published an article headlined \"Who is Alexandria Ocasio-Cortez? 5 things to know about the New York congresswoman.\" That article briefly went into Ocasio-Cortez's financial history and stated that, rather than facing evictions and account closures, she worked multiple jobs to help support her family after the death of her father:", "She grew up in the Bronx and helped support her family after the death of her dad.", "Born in the Bronx, Ocasio-Cortez was raised by a mother from Puerto Rico and a father who was a small business owner. After her father passed away from cancer in 2008, Ocasio-Cortez worked two jobs in the restaurant industry to help her family make ends meet.", "After returning to the Bronx after college, Ocasio-Cortez pushed for greater childhood education and literacy, according to The New York Times. She also started a publishing company that produced books portraying the Bronx in a positive manner, The New York Daily News reported in 2012.", "Her upbringing also helped her foray into politics, she told Elite Daily.", "“Politics were talked about at the table every single day,” she said. “It’s the culture. In Puerto Rico, you talk about politics all the time, even when people disagree.”", "In general, we found nothing indicating financial irresponsibility in Ocasio-Cortez's background, whose April 2018 Financial Disclosure Report detailed a modest amount of assets and income, but also no liabilities other than a federal student loan. We also note that low credit scores potentially attach not only to persons who have poor credit histories (i.e., numerous late or unpaid debts), but to those persons who simply have not built up their scores through means such as taking out credit-building loans and using credit cards.", "Chappell, Bill.   \"Who Is Alexandria Ocasio-Cortez?\"\r\n    NPR.   27 June 2018.", "Hess, Abigail.   \"29-Year-Old Alexandria Ocasio-Cortez Makes History as the Youngest Woman Ever Elected to Congress.\"\r\n    CNBC.   7 November January 2018.", "Hess, Abigail.   \"Alexandria Ocasio-Cortez Is the Youngest Woman Ever Elected to Congress -- She Still Can’t Afford an Apartment in D.C..\"\r\n    CNBC.   8 November January 2018.", "Leonhardt, Megan.   \"Alexandria Ocasio-Cortez, The Youngest Woman Ever Elected To Congress, Is Down to Less Than $7,000 in Savings.\"\r\n    CNBC.   16 November 2018.", "Meyer, David.   \"Wall Street, Brace Yourself: Alexandria Ocasio-Cortez Is Joining House Financial Services Committee.\"\r\n    Fortune.   16 January 2019.", "Schallhorn, Kaitlyn.   \"Who is Alexandria Ocasio-Cortez? 5 Things to Know About the New York Congresswoman.\"\r\n    Fox News.   8 January 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]