["With less than a month until President-elect Joe Biden's inauguration, conservative social media pages are still claiming something is amiss with his electoral victory.", "A meme shared on Facebook by the page Millennial Conservative claims that the election must have been fraudulent because Biden received the highest ever popular vote total while winning the lowest number of counties when compared to President Donald Trump and former President Barack Obama.", "The meme claims that Obama won 69 million votes and 873 counties and Trump won 74 million votes and 2,497 counties, while Biden won 81 million votes and just 477 counties.", "The candidates' names, the number of votes and the number of counties they won are overlaid on images that appear to be events held by each. Both Obama's and Trump's images depict significant attendance at apparent campaign events, while Biden's images show small groups of supporters.", "The Facebook page Millennial Conservative did not respond to USA TODAY's request for comment. The meme was also posted to Twitter by Eric Trump, one of the president's children. Charlie Kirk, president of conservative group Turning Point USA, tweeted the same claim without the images attached.", "More:Fact check: What's true and what's false about the 2020 election", "While the meme's numbers are mostly right, its interpretation of them is wrong.", "Biden won 81 million votes and 509 counties in the Nov. 3 election, while Trump won 74 million votes and 2,547 counties, according to data aggregated by think tank the Brookings Institute. Obama won 69 million votes and 873 counties in 2008.", "But that doesn't mean the election was fraudulent. According to a 2017 U.S. Census Bureau report, more than half of the country's population lives in less than 5% percent of counties — just 143 heavily populated counties. Less than half the population is spread out across the other 2,999 counties, the report says.", "Fact check:Biden won the most total votes – and the fewest total counties – of any president-elect", "That same report says that the five largest U.S. counties are Los Angeles County in California, Cook County in Illinois, Harris County in Texas, Maricopa County in Arizona and San Diego County in California. Biden won all five of those counties.", "The images that accompany the meme's text also fail to take into account the global pandemic occurring throughout much of 2020 and how that affected both candidates' campaigns.", "The Biden-Harris campaign largely practiced social distancing, trading extravagant rallies for small, masked outdoor events. A number of the pictures used in the meme were taken at those campaign events.", "\"Every place I go I’ve got to set an example,\" Biden said Sept. 10. \"That’s why, everywhere I go, I wear this mask, and, everywhere I go, I keep my social distance.\"", "Fact check:Biden campaign events portrayed as small lack context of COVID-19 guidelines", "Trump continued to hold rallies and other large events throughout the duration of his campaign, despite experts' warnings that the events could contribute to the spread of COVID-19. The president mocked Biden's smaller events.", "\"You know why he puts the circles? Because he wants to be like correct with COVID, but it's not really — because they can't get anybody to fill up a room,\" he said.", "And, when Obama was running for president in 2008, there was no pandemic impacting campaign events and operations.", "Fact check:Biden got record number of popular votes despite small campaign events", "Despite claims by Trump and his supporters, there is no evidence the election was rife with fraud.", "Biden won the election, garnering the most popular and electoral votes. The lawsuits filed by the president and his allies were dismissed across the country, including by the Supreme Court. USA TODAY debunked a number of election falsehoods, which can be found here.", "Fact check:Trump lost the 2020 presidential election", "While the meme's numbers are mostly true — Biden did win significantly fewer counties than both Obama in 2008 and Trump in 2020 — that doesn't mean the Nov. 3 election was tainted by fraud. People vote, not places, and Biden won the most populous counties in the country, according to a Census Bureau report. It's also disingenuous to suggest Biden's small campaign events indicated a lack of support, given the ongoing viral pandemic. We rate the claim MISSING CONTEXT because without this additional information, the meme may be misleading.", "Contributing: Camille Caldera, Devon Link, Adrienne Dunn", "Thank you for supporting our journalism. Youcan subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]