["About this rating", "London's Mayor Sadiq Khan \"announced that Transport for London would no longer run ads which could cause body confidence issues, particularly among young people.\"", "Khan did not \"ban\" all \"sexy images\" because they were offensive to Muslims.", "Whether the changes would affect anything but weight loss advertisements.", "On 14 June 2016, unreliable web site Gateway Pundit published an article suggesting that London Mayor Sadiq Khan — who is Muslim — \"banned\" provocative advertisements because they offended Islam:", "What a complete shock!\nLondon’s new Muslim mayor plans to ban sexy women in advertisements in London’s public transport system.", "Allahu Akbar!", "The Gateway Pundit referenced earlier reporting from Daily Caller:", "Sadiq Khan, London’s first Muslim mayor, announced Monday that “body shaming” advertisements will no longer be allowed in London’s public transport ... Recently, advertisements featuring bikini-clad models in the British city of Birmingham were spray painted over. Birmingham has a high Muslim population.", "On 13 June 2016, Khan tweeted:", "No one's confidence or body image should be undermined by ads on our transport system. I've strengthened @TfL policy https://t.co/AJ7qYDQW0T", "— Mayor of London (@MayorofLondon) June 13, 2016", "On 13 June 2016, the Evening Standard published an article with further information about Khan's policy. According to the piece, only a small fraction of advertisements in London would be affected by the policy change:", "Adverts which put Londoners under pressure over body image are to be banned from the Tube and bus network.", "Sadiq Khan announced that Transport for London would no longer run ads which could cause body confidence issues, particularly among young people.", "The Mayor, a father of two teenage daughters, warned the ads could “demean” women and encourage them to conform to unrealistic or unhealthy body shapes.", "TfL’s new advertising policy, which does not include all images of people in their underwear or swimming gear, is only expected to affect a handful of the 12,000 adverts a year which run across the network, including at bus shelters and on-street sites.", "Khan was quoted on the reasons he opted to enact the new policy:", "As the father of two teenage girls, I am extremely concerned about this kind of advertising which can demean people, particularly women, and make them ashamed of their bodies. It is high time it came to an end ... Nobody should feel pressurised, while they travel on the Tube or bus, into unrealistic expectations surrounding their bodies and I want to send a clear message to the advertising industry about this.", "As for the mayor's motivations, the outlet reported that public outcry (not Khan's religion) was a major cause for the action:", "It means controversial adverts like Protein World’s “Are you beach body ready?” poster, which provoked a huge backlash when it appeared last year, would no longer be allowed.", "The weight-loss ad, which featured a bikini-clad model, sparked a protest in Hyde Park as well as a petition on Change.org with more than 70,000 signatures, although it was not banned by the Advertising Standards Authority ... The change comes a result of passenger feedback, rather than public consultation, but City Hall denied it was nannying Londoners.", "As the Evening Standard reported, the change came in part as a result of massive public outcry over one specific ad. A Change.org petition gathered more than 70,000 signatures, and its grievances were unrelated to Islam:", "Protein World is directly targeting individuals, aiming to make them feel physically inferior to the unrealistic* body image of the bronzed model, in order to sell their product.", "*for the majority of people to 'achieve': everyone has an individual body shape", "Perhaps not everyone's priority is having a 'beach body' (by the way, what is that?), and making somebody feel guilty for not prioritising it by questioning their personal choices is a step too far. A body's function is far more intricate and important than looking 'beach ready', so in fact it is Protein World who have confused their priorities, if anyone.", "The question I would like to pose to whoever gave this advert the go-ahead would be: what is 'Beach Body Ready'? And who would not be?", "Khan didn't specify how standards for advertisements on public transit would be strengthened, but no credible reporting indicated that all \"sexy\" or revealing advertisements would be banned across London. The ban will solely affect \"body shaming\" content, not bikinis or scantily-clad women.", "Crerar, Pippa.   \"Sadiq Khan: There Will Be No More 'Body Shaming' Adverts On The Tube.\"\r\n    Evening Standard.   13 June 2016.", "Pfeiffer, Alex.   \"London’s Muslim Mayor Bans Sexy Women In Advertisements.\"\r\n    Daily Caller.   13 June 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]