["The Indian air force has reportedly struck Jaish camps in the Pakistani town of Balakot on February 26. A video doing rounds on social media is being shared with the claim that it depicts the airstrike.", "Proud of our #IndianAirForce. Salutes to the brave soldier of IAF🇮🇳 #IndiaStrikesBack🚩 🚩🚩🚩🚩🚩 pic.twitter.com/ctN9GmiPfT", "— Ayansh Sah (@AyanshSah) February 26, 2019", "Hindi media outlet Khabar Uttarakhand posted the video as an “exclusive”.", "ABP journalist Vikas Bhadauria also circulated the clip. However, he shared it with the a Hindi caption that said – “something like this must have happened (translated).”", "कुछ ऐसा हुआ होगा। #IndiaStrikesBack #IndianAirForce #Balakot #surgicalstrike2 pic.twitter.com/nrrCE1Z5t6", "— Vikas Bhadauria ABP (@vikasbha) February 26, 2019", "The clip is viral on both Twitter and Facebook. Apart from FB page Narendra Modi fans from Karunadu (embedded below), the clip has also been shared by other right-wing pages – Yogi Adityanath Fans and Mission Modi 2019.", "ಅಟ್ಯಾಕ್ ಅಂದ್ರೆ ಇದು…..", "Posted by Narendra Modi fans from Karunadu on Monday, 25 February 2019", "At first glance, the video did not seem genuine and resembled a clip of a video game. The faint English commentary in the background raised initial doubts. Alt News searched gaming videos on YouTube with different keywords and landed on a 2015 clip of a video game ‘Arma 2’. The part of the video which is viral on social media starts at about 20 seconds in the original clip.", "Since the Indian air force’s retaliation in the early hours of February 26 for the Pulwama terror attack, another unrelated and old video was shared as IAF’s airstrike on Jaish camps.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]