["About this rating", "On 15 June 2016, the entertainment web site Political Garbage Chute published a satirical article reporting that a woman performed her own abortion with a \"U-Abort It™\" attachment for her AR-15 assault rifle:", "“Once I found out that I had more rights to a firearm than I did to control my own biological bodily functions,” Ms. Sampson told us, “I knew exactly what I had to do. So I went down to Liberty Gun and Ammo and bought myself a Bushmaster AR-15. I was going to end this pregnancy one way or another.”", "Given that the AR-15 is a high-powered rifle, Sampson knew it would take some modification to use in her own abortion. Luckily for Jane, Bushmaster has a special line of U-Abort It™ rifle accessories that can be added to the AR-15, allowing it to be used with surgical precision.", "This article is a work of fiction by the entertainment web site Political Garbage Chute. While the web site does not have a readily available disclaimer, the \"about us\" section on its Facebook page states that the web site is intended as satire:", "Devoted to political satire, humor and commentary. Rated \"Most Trustworthless and Ackurate Web-Sight\" by Snopes.", "(We didn't rate it that way.)", "While the quoted article was originally published on the entertainment web site Political Garbage Chute, many readers didn't encounter this story until it was republished on Huffington Post. This confused some readers, as Huffington Post is not generally known to publish satire and humor.", "However, the article was posted in the web site's entertainment section, and was preceded by a note directing readers to Political Garbage Chute for more satire and fake news.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]