["A video in which a man is seen speaking into a microphone in Arabic has been shared in the aftermath of the Taliban’s takeover of Afghanistan. In the video, some women in burqas can be seen chained together. “Open sale of women in Afghanistan,” is the claim circulating with the clip.", "Chairperson of Congress grievance cell Archana Dalmia shared the video. She later took it down.", "Several others have shared the video.", "वक़्त बदलते देर नहीं लगती।जो लोग बोल रहे थे कि हिन्दुओ की बहन,बेटी और बहु 2-2 दीनार बेची थी।अब उन लोगो की खुद की उसी बाज़ार मे आज बिक रही हैं और वो खुद बेच रहे है उसी बाज़ार मे—– pic.twitter.com/1j9TI3R6Vo", "— सौरभ श्रीवास्तव 🚩हिंदी🚩 हिंदू 🚩हिन्दुस्थान (@Sourabh3507) August 16, 2021", "The video was shared close to 1,000 times on the Facebook group We support Pushpendra Kulshrestha, the iron man of new India.", "Alt News has received multiple requests to fact-check the video on our WhatsApp helpline number (76000 11160).", "This slideshow requires JavaScript.", "The viral video was also shared in 2019 with the claim that ISIS terrorists were selling Yezidi, Kurdish and Christian women. These claims are no longer accessible but the viral message was as follows: “We have Yezidi women, we have Kurdish women, and we have Christians. get what your right hand possesses, come get your Mulk-al-yamin (slave). Get yourself a sex slave. Our brave fighters, our brave Islamic State fighters have gone into these areas and killed their murtadin (infidel) scum. So you can have their women today. Takbir, Takbir, Takbir (Allah is great)…”", "An image of a man holding a chain tied on women’s wrists has been shared with a similar claim of a recent incident in Afghanistan. BJP supporter Shefali Vaidya tweeted the picture on August 18.", "A Spanish Twitter user shared the picture too. It drew over 32,000 likes and more than 5,600 retweets.", "Video", "To find out more about the video, Alt News used specific keywords and came across an article by BBC News dated October 20, 2014. The article was titled, ‘The mock Islamic State slave auction in London’, and contained a 16-second clip of the same video which has been posted on Twitter.", "The video was shot at Leicester Square in London. The article states, “The savvy social media campaign against Islamic State by Kurdish activists continues – with a video of a mock “Islamic State sex slave market” in the heart of London watched more than quarter of a million times on YouTube.", "The video shows the group’s supposed ringleader bellowing into a microphone. Behind him stand a group of women – all of them actors – fully covered and chained together. “We have four women for you here today,” the man announces, “and we are here to sell them courtesy of the Islamic State.”", "The stunt was organised by Compassion 4 Kurdistan, a group of Kurdish diaspora trying to raise awareness of IS’s alleged actions in Iraq. It has was viewed more than 250,000 times on YouTube which is no longer available. On the same night, the group performed the scene outside Downing Street and the Houses of Parliament as well.", "Photo", "The image shared by Shefali Vaidya shows a street play by Kurdish activists. Below is the same image shared in 2014.", "Bienvenue au marché aux esclaves de l’Etat Islamique. Welcome to the slave market of ISIS.", "Posted by Messe traditionnelle on Wednesday, 15 October 2014", "Other pictures of the play were also posted seven years ago.", "#ISIS sex slave market in #London – Kurdish activists stage demo https://t.co/EIr7fmC6fu Photo via @Tajourian pic.twitter.com/bGel1Y3IJ0", "— Sara Firth (@Sara__Firth) October 16, 2014", "We found a video of the play uploaded in March 2016 by Kurdish filmmaker Ali Murad.", "ISIS Sex Slave Market in London (Protest)", "Since its inception The Islamic State has been capturing all the consider infidels and selling them in make shift sex markets all across Syria and Iraq. Their brutality is so overwhelmingly shocking that most testimonies only result in broken down tears. I and political activists have set one very such makeshift camp, the horrors of ISIS and their crimes against humanity was put on public display all across London. Members of the public were shocked most were speechless as we live in a civilized society. Yet the barbarity of these camps remain, please share and like to all so that our cause can be spread across the world.", "Main Performer Karam Kurda Haz Babataher Arwin Baniard Camera: Anil Elbistani Ari Murad Hoshmand Jaff Actress: Zeynep Polat, Berfin Erdogan, Silan Akgul, Elif Ozkan. Special Thanks to: Arman Banirad and Hana Abid", "Posted by Ari Murad on Tuesday, 1 March 2016", "A comparison of the man from the above video and the one in the image shows that he is the same person.", "Abduction and enslavement of women under ISIS is no secret and was in fact admitted by the organisation itself. According to CNN, ISIS in its English language publication Dabiq, in an article titled, ‘The revival of slavery before the Hour’ had justified the enslavement of ‘infidel’ women, citing Islamic law. The same was reported by The New York Times. Several reports have documented the horror stories of women abducted by ISIS fighters and forced to be slaves. This was also confirmed by the United Nations in a report of 2014, adding that Yazidis were targeted the most.", "It is noteworthy that Afghani women have complained of harassment and torture under the Taliban as well.", "In conclusion, it may be noted that the video posted on Twitter is a mock video of an ISIS sex slave auction, which was performed by a Kurdish group in London in 2014 in protest against ISIS.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]