["Self-employed mothers take on the burden of childcare and fathers don’t get financial support or bonding time with their child as they aren’t eligible for shared parental leave.", "Self-employed mothers can exchange their maternity allowance for shared parental leave and pay for their partner, if he is employed—but they have to give up the maternity allowance. Self-employed fathers aren’t eligible for any time off or pay after having a child.", "Self-employed people aren’t eligible for shared parental leave.", "Correct.", "“Self-employed people are not eligible for shared parental leave. This places the burden of childcare on the mum, denying fathers financial support and bonding time with the child.”", "Tracy Brabin MP, 1 November 2017", "Ms Brabin is fundamentally correct.", "The rules around the pay and leave parents can qualify for when having a child are complicated.", "Self-employed mothers might qualify for maternity allowance, worth up to £140.98 a week, and using this can take time off to care for their child if they are able and want to. They can also exchange this for shared parental leave and pay for their partner, if he is employed and eligible. But they have to give up their maternity allowance to do so.", "Self-employed fathers aren’t eligible for any shared parental leave or pay.", "Honesty in public debate matters", "You can help us take action – and get our regular free email", "I’m in", "Eligible women are entitled to up to 52 weeks of maternity leave when they have a baby—this can start before the baby is born. Eligible men can get one or two weeks of paternity leave after the baby is born.", "Women who are eligible can choose to trade in their maternity leave for shared parental leave. If they’re both eligible the couple then have up to 52 weeks of leave, minus any weeks of maternity leave have already been taken. This can then be split between them and their partner as they see fit—so one partner might take half the time, and the other take the rest.", "The idea behind the regulations is to allow parents to share more time with their child early on, let fathers spend more time with their child and “to create more equity in the workplace and reduce the gender penalty resulting from women taking long periods of time out of the workplace on maternity leave”.", "Eligible parents can get statutory maternity pay or paternity pay. Women are paid this for 39 weeks—six weeks at 90% of their usual weekly earnings and 33 weeks at 90% or around £140.98 a week whichever is lower. Men are also paid a 90% rate or £140.98 a week for the length of their paternity leave.", "Eligible mothers can swap their maternity pay for shared parental pay. Like shared parental leave this can be split between both parents.", "Self-employed men and women aren’t eligible for paternity, maternity or shared parental leave or pay as only people with an employer can get those.", "Self-employed women can be eligible for maternity allowance, a substitute payment, set at £140.98 a week for 39 weeks. Using this they may be able to take time off to care for their child.", "Employed women may get maternity leave but can’t transfer any shared parental leave or pay to their partner if the man is self-employed. If a man is employed and his self-employed partner qualifies for maternity allowance then he could qualify for shared maternity pay and leave—although his partner would have to stop receiving the maternity allowance and wouldn’t qualify for the shared parental leave.", "In these circumstances Ms Brabin says “This places the burden of childcare on the mum, denying fathers financial support and bonding time with the child.”", "Around 33% of all self-employed people were women as of June to August 2017. Women represent the majority of part-time, self-employed workers (59%) and 22% of all full-time self-employed workers over the same time period.", "There are around 4.9 million self-employed workers in the UK and the majority work full-time.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]