["About this rating", "We received multiple inquiries from readers about the veracity of news reports in late 2019 that claimed U.S. President Donald Trump had signed into law a piece of legislation that made animal cruelty a felony at the federal level.", "For example, on Nov. 26 CNN published an article with the headline \"Trump Signs Animal Cruelty Act Into Law,\" which reported that:", "President Donald Trump signed a bill that makes animal cruelty a federal felony on Monday, saying the measure would help us be \"more responsible and humane stewards of our planet.\"", "The PACT Act -- which stands for Preventing Animal Cruelty and Torture -- was signed by the President at the White House, where he said he was \"pleased\" to approve the legislation. The bipartisan act, which passed the Senate earlier this month, expands a previous law passed in 2010 ...", "Federal law had previously only prohibited animal fighting and only criminalized animal cruelty if the wrongdoers create and sell videos depicting the act. Under the PACT Act, a person can be prosecuted for crushing, burning, drowning, suffocating or impaling animals or sexually exploiting them. Those convicted would face federal felony charges, fines and up to seven years in prison. Right now, all 50 states have laws on their books against animal cruelty at the state level.", "With Trump's approval, federal authorities can go after the wrongdoers because they will have federal jurisdiction and will not be bound by state laws. They can also prosecute criminals if the cruelty occurs on federal property.", "Similar articles were published by ABC News and CBS News, whose headlines read \"President Trump Signs Animal Cruelty Bill Into Law, Making it a Federal Felony,\" and \"Trump Signs Bill Making Animal Cruelty a Federal Felony,\" respectively.", "Those reports were accurate, although the ABC and CBS News headlines lacked specificity and might have misled readers into understanding that the introduction of the new law represented the first time animal cruelty of any kind had been made a federal crime.", "On Nov. 25, 2019, Trump signed into law the PACT Act, which enumerated and banned several acts of cruelty towards animals. That signing ceremony can be watched here.", "The legislation (which can be read in its final, enrolled form here) was first introduced in January by U.S. Rep. Ted Deutch, D-Fla., and received widespread bipartisan support in both houses of Congress. The House of Representatives passed the bill by voice vote, on Oct. 22, and the Senate passed the bill by unanimous consent (without the need for any vote) on Nov. 5.", "A 2010 act, the Animal Crush Video Act, banned the distribution of videos and images showing several particularly egregious forms of animal cruelty, abuse, and torture that form part of the so-called \"crush\" fetish. The 2019 legislation expands the provisions of the 2010 act and introduces a prohibition on the underlying acts of cruelty themselves, as well as the distribution of related videos. An individual found guilty under the PACT Act could face a prison sentence of up to seven years.", "The 2019 law includes exemptions for acts (and depictions of acts) related to veterinary and farming practices, as well as hunting, fishing, research and killing animals for food.", "The PACT Act did not represent the first time that animal cruelty of any kind was made a federal crime. For example, attending or participating in dogfights has been a federal crime since 2003, and the Animal Welfare Act of 1966, along with its amendments over the past half-century, has prohibited neglect and mistreatment of animals kept and transported for commercial reasons and for scientific research.", "Cole, Devan and Allie Malloy.  \"Trump Signs Animal Cruelty Act Into Law.\"\r\n  CNN.  26 November 2019.", "Zarrell, Matt.  \"President Trump Signs Animal Cruelty Bill Into Law, Making it a Federal Felony.\"\r\n  ABC News.  25 November 2019.", "O'Kane, Caitlin.  \"Trump Signs Bill Making Animal Cruelty a Federal Felony.\"\r\n  CBS News.  25 November 2019.", "U.S. House of Representatives.  \"H.R. 724 -- the Preventing Animal Cruelty and Torture Act.\"\r\n  25 November 2019.", "U.S. House of Representatives.  \"H.R. 5566 -- the Animal Crush Video Prohibition Act of 2010.\"\r\n  9 December 2010.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]