["Chuck Todd, host of NBC's \"Meet the Press,\" on March 7, 2021. (Screenshot)", "• The founders never wrote into the Constitution a filibuster of the type that has since been practiced by the Senate.", "• Their contemporaneous writings suggest views that ranged from ambivalent to negative about the value of delaying tactics in general. However, the founders were aware that some of the provisions they included in the Constitution could be used by a determined minority to delay legislative business, even if that was not was not the founders’ reason for including them.", "With the Democrats’ razor-thin majority in the Senate, and the intense partisan polarization embodied by the chamber’s strict party-line vote on President Joe Biden’s $1.9 trillion relief bill, there’s been a lot of discussion recently about the filibuster — a tool a minority can use to stall a bill unless 60 senators vote to take up the measure.", "Much of the attention has been focused on Sen. Joe Manchin, D-W.Va. Manchin is generally considered the most conservative Democratic senator in the 50-50 Senate, which gives him significant leverage over his party. If Manchin — who represents a state that backed President Donald Trump in November by a 39-point margin — joins with Republicans on a given bill or amendment, he torpedoes any Democratic hope of passage.", "Manchin also plays a pivotal role on how the Senate operates, because he has long been a backer of the filibuster. This has irked other Democrats, who see little hope of winning Republican support in today’s polarized environment, making it hard for Democrats to secure the 10 Republican votes needed to break a filibuster and pass new laws.", "Help shape our fact-checking! Take PolitiFact’s reader survey now >>", "One way for Democrats to ease this conundrum would be to eliminate the filibuster — but that would require at least 50 votes, and Manchin has long said he’s opposed that path, as have a few other Democratic senators, including Kyrsten Sinema of Arizona.", "After the Senate’s narrow passage of the relief bill on March 6, Manchin was asked repeatedly about the future of the filibuster during a round of interviews on the Sunday political talk shows.", "On NBC’s \"Meet the Press,\" host Chuck Todd asked Manchin what he thought about carving out election-related bills to move forward with 50 votes rather than 60.", "Manchin sounded skeptical, although he did say he’d consider a change that required a minority to actually talk a bill to death on the floor, something that is not required today.", "\"Can you imagine not having to sit down, where there's no reason for you to sit down with your colleagues on both sides and have their input?\" Manchin said. \"The Senate is the most unique body of government in the world. It's deliberate. It's basically designed, Chuck, to make sure the minority has input. That's exactly our Founding Fathers.\"", "Todd pushed back on the mention of the founders. \"Well, Senator, the filibuster was never an idea of the Founding Fathers,\" he said. \"That is a Senate rule that was created by senators later, in fairness. It's not a Founding Father idea.\"", "We wondered whether Todd was right that \"the filibuster was never an idea of the founding fathers.\"", "Todd is basically correct, though in discussing the issue with experts, we found a few nuances to point out. (Todd did not respond to an inquiry for this article.)", "There is a legend of uncertain veracity that says George Washington and Thomas Jefferson came to agree that the Senate should serve as a \"saucer\" to the House’s \"tea cup\" — a vessel for cooling the hottest passions emanating from the House.", "Whether the specifics of the tale hold up, the Senate has long been considered the slower, more cautious half of Congress.", "The filibuster was never \"established\" by a specific act; it emerged organically. Some analysts suggest that it began during the first decade of the 1800s, when senators mistakenly deleted a rule empowering a majority to cut off debate, though others disagree.", "In any case, the Constitution delegates internal rule-setting to the Senate itself, and for much of its history, the chamber did not implement a mechanism to maneuver around a member determined enough to block action by mounting a filibuster.", "It took until 1917, when the Senate voted to empower a supermajority of 67 to cut off a filibuster and move on to other business, using a motion known as \"cloture.\" Then, in 1975, the Senate voted to lower the supermajority to its current number, 60.", "Those 60 votes have become a significant hurdle in a chamber that has not often had one party win that many seats — and especially in recent years, as the two parties have become more polarized and more willing to filibuster, even on matters that had previously been treated as routine.", "Something we know for sure is that the filibuster does not appear in the Constitution.", "The Constitution does include two tools that can be used by a minority to delay action — refusing to vote, and repeatedly calling for roll call votes, wrote Gregory Koger, a University of Miami political scientist, in his 2010 study, \"Filibustering: A Political History of Obstruction in the House and Senate.\"", "Some founders, such as George Mason, acknowledged \"inconveniences\" caused by the blocking actions of a minority but also believed that the fear of such blockages could have an energizing effect on the legislative process, according to contemporaneous notes cited by Koger.", "Other founders, including James Madison, more strongly opposed a minority being able to block the will of the majority.", "Madison wrote in Federalist Paper 58 that a determined minority could \"screen themselves from equitable sacrifices\" or \"in particular emergencies, to extort unreasonable indulgences,\" possibly leading to the \"ruin of popular governments.\"", "Ultimately, the founders took something of a middle path in the Constitution. They required a majority quorum to do legislative business, which Koger sees as a \"balance between the delegates’ fear of mischief by small numbers of legislators and their concern that a high threshold would paralyze Congress at critical moments.\"", "And the founders decided that one-fifth of those present could request a roll call vote. While this was another potential delaying tool for minorities, it represented a middle ground between allowing just one member to request a vote and not recording votes at all, Koger wrote.", "The founders may have felt that \"an occasional episode\" of delay \"might do more good than harm, but the Federalist Papers suggest that they did not intend obstruction to systematically impede majority action on most classes of legislation,\" Koger wrote.", "Todd said, \"The filibuster was never an idea of the Founding Fathers.\"", "The founders never wrote into the Constitution a filibuster, and contemporaneous writings suggest that the founders’ views ranged from ambivalent to negative about the value of delaying tactics in general.", "The founders were aware that some of the provisions they included in the Constitution could be used by a determined minority to delay legislative business, even if that was not was not the founders’ reason for including them. In any case, the filibuster used in the Senate today was not among the provisions included.", "We rate the statement True.", "NBC News, \"Meet the Press\" transcript, March 7, 2021", "Constitution, Article I", "The Federalist Papers: No. 58", "U.S. Senate Historical Office, \"Filibuster and Cloture\"", "Gregory Koger, \"Is Filibustering Constitutional?\" Aug. 20, 2009", "Gregory Koger, \"Filibustering: A Political History of Obstruction in the House and Senate,\" 2010", "PolitiFact, \"The history of the filibuster as 'Jim Crow relic,'\" Aug. 4, 2020", "PolitiFact, \"6 questions answered about ‘the nuclear option,’ the filibuster, and Supreme Court nominations,\" Feb. 3, 2017", "Email interview with Gregory Koger, University of Miami political scientist, March 8, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]