["Pumpjacks draw oil out of the ground in a field near Lovington, N.M. (AP Photo/Charlie Riedel)", "The pandemic caused job losses in the energy sector, but that took place before Biden took office.", "No study backs up the 1 million figure. An industry study projected job losses that large, but for the economy as whole, not just energy jobs.", "The industry study assumed all new oil and gas development on federal property would stop. The Biden policy affects only new leasing.", "House Republican Leader Kevin McCarthy took to Fox News to highlight the damage purportedly wrought by Democrats since President Joe Biden took office. He summarized his comments in a tweet.", "\"Democrats have accomplished a lot in just 2 months,\" McCarthy tweeted March 14. \"Higher gas prices. Biden's border crisis. 1 Million energy jobs destroyed.\"", "Democrats have accomplished a lot in just 2 months:❌ Higher gas prices❌ Biden's border crisis❌ 1 Million energy jobs destroyedAnd they’re just getting started. pic.twitter.com/8gUGmL0QFL", "The press of unaccompanied minors and families at the Mexico border is real. Gas prices have gone up, though most of the increase took place under President Donald Trump, and is driven by an improving economy and global oil markets, rather than Washington policy.", "McCarthy’s statement about 1 million energy jobs, which he also made in the Fox News interview, is way off.", "We reached out to McCarthy’s office for an explanation and did not hear back. The 1 million figure in his claim number aligns with a forecast from the American Petroleum Institute, a group that represents the oil and gas industry, but McCarthy misrepresented what the number means.", "In September, the American Petroleum Institute wrote that under a total ban on oil and gas leasing, \"nearly one million jobs would be lost by 2022.\"", "Here’s why that doesn’t back up McCarthy’s claim:", "The study assumed all new leasing and new drilling on existing leases for oil and gas on federally controlled land and waters would stop completely. The Biden administration fulfilled its campaign promise to put new leasing on hold, but production on current leases continues uninterrupted. Plus, there are over 7,000 approved drilling permits that oil and gas companies have yet to use.", "The study estimated total job losses, not energy job losses. The underlying model forecast a decline in the national economy, and translated that into an overall decline in employment. McCarthy spoke of 1 million energy jobs.", "It is a projection, and as the underlying study itself noted, projections \"are not predictions of what will happen, but rather modeled projections of what may happen.\" McCarthy’s statement holds Democrats responsible for hypothetical results as if they’ve actually taken place.", "Philip Jordan with BW Research tracks jobs in the energy sector for the National Association of State Energy Officials. Jobs in the oil, gas and coal industries have declined due to the pandemic downturn, Jordan said, but that was about 120,000 jobs, and took place before Biden took office.", "Jordan said that McCarthy’s number is implausible on its face.", "\"The total of fossil fuel industries combined have about 1.6 million jobs,\" Jordan said. \"A million energy jobs lost? I think the math is impossible.\"", "McCarthy said in the past two months, Democrats led by Biden have \"destroyed 1 million energy jobs.\"", "The 1 million figure matches a number from an American Petroleum Institute report, but that report assumed all new oil and gas development on federal property would cease, while the Biden policy affects only new leasing. And the projected job losses were across the entire economy — not solely in energy.", "McCarthy spoke as if the jobs were actually lost in the past two months, but the figure came from a projection, which might never come to pass.", "We rate this claim Pants on Fire.", "Kevin McCarthy, tweet, March 14, 2021", "E2, Clean Energy Unemployment Claims in COVID-19 Aftermath, Jan. 15, 2021", "Minority Leader Kevin McCarthy, Leader McCarthy Visits San Antonio, Texas to Promote American Energy, Feb. 11, 2021", "American Petroleum Institute, New Analysis Shows Ban On Leasing And Development On Federal Lands And Waters Would Threaten U.S. Energy Security, American Jobs And Environmental Progress, Sept. 9, 2020", "American Petroleum Institute, The consequences of a Leasing and Development Ban on Federal Lands and Waters, September 2020", "Bureau of Labor Statistics, Oil and gas extraction, accessed March 17, 2021", "National Association of State Energy Officials and Energy Futures Initiative, U.S. Energy and employment report 2020, accessed March 17, 2021", "PolitiFact, Texas congressman overstates job losses tied to ban on new drilling leases, Jan. 29, 2021", "PolitiFact, Are gas prices going up? And is it Joe Biden’s fault?, March 2, 2021", "Interview, Philip Jordan, vice president, BW Research, March 17, 2021", "Email exchange, press office, American Petroleum Institute, March 17, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]