["By Robert Farley and Eugene Kiely", "Posted on October 31, 2017", "A day after the FBI announced that George Papadopoulos, a foreign policy adviser to Donald Trump’s campaign, had pleaded guilty to making false statements to the FBI, the president tweeted: “Few people knew the young, low level volunteer named George, who has already proven to be a liar.”", "In a press briefing on Oct. 30, White House Press Secretary Sarah Huckabee Sanders was similarly dismissive, calling Papadopoulos’ role in the campaign “extremely limited.” Ten times, Sanders noted that Papadopoulos was a volunteer on the campaign, and that he served on an advisory council that only met once.", "Asked about his activities, Sanders said she could not “speak on behalf of the thousands of people that may have volunteered on the campaign.”", "Those descriptions might conjure images of someone whose role amounted to little more than putting up lawn signs and licking envelopes, but there was more to Papadopoulos’ position than that.", "Court documents released on Oct. 30 indicate that Papadopoulos, as a foreign policy adviser, was in communications with senior members of the Trump campaign. The documents did not name the campaign officials, identifying them only as “the High-Ranking Campaign Official,” “the Senior Policy Advisor,” and “the Campaign Supervisor.”", "He also met with Trump at least once in a foreign policy meeting, as evidenced by a picture of Trump meeting with his “national security team” on March 31, 2016, that was posted to Trump’s own Instagram account. Papadopoulos is pictured (third from the left) sitting at the table for that meeting.", "Meeting with my national security team in #WashingtonDC. #Trump2016", "A post shared by  President Donald J. Trump (@realdonaldtrump) on Mar 31, 2016 at 7:09pm PDT", "When he met with the Washington Post editorial board on March 21, 2016, Trump named Papadopoulos as one of only a few members of the campaign’s foreign policy team. “George Papadopoulos. He’s an oil and energy consultant. Excellent guy,” Trump said.", "It’s true that Papadopoulos was a volunteer for the campaign. But that doesn’t always indicate a diminished role. As CNN notes: “According to previous reporting, [campaign manager Paul] Manafort, [deputy campaign manager Rick] Gates, Trump son-in-law Jared Kushner and senior strategist Steve Bannon were all unpaid ‘volunteers’ while doing extensive, high-level work for the campaign.”", "Papadopoulos wasn’t that kind of volunteer, either. But he had contacts with Trump’s senior campaign aides, court documents show.", "Who is George Papadopoulos?", "He started the 2016 campaign as a foreign policy adviser to Ben Carson, one of Trump’s vanquished rivals for the Republican presidential nomination. The Carson campaign named Papadopoulos to its foreign policy team in December 2015, describing him as an energy consultant who had worked as an analyst and researcher at the conservative Hudson Institute in Washington, D.C.", "According to his LinkedIn page, Papadopoulos earned a bachelor’s degree in political science and government from DePaul University in 2009, and a master’s degree from University College London in 2010.", "Shortly after Carson dropped out of the race in early March, Papadopoulos became a Trump campaign adviser. He first came into contact with a Russian intermediary on March 14, 2016, while traveling in Italy, according to the Justice Department. In a chance meeting, Papadopoulos met a professor who he “understood to have substantial connections to Russian government officials,” the department said.", "The professor, whose name has been withheld by the Justice Department, took an interest in Papadopoulos because of his role in the Trump campaign. He would soon introduce Papadopoulos to two others: a “Female Russian National,” who Papadopoulos believed had “connections to Russian government officials,” and “an individual in Moscow … who told defendant Papadopoulos he had connections to the Russian Ministry of Foreign Affairs,” the Justice Department said.", "Joseph Mifsud, an academic at the University of Stirling in Scotland, has since confirmed to the Telegraph that he is the “professor” named in the court documents, though he contests Papadopoulos’ account.", "What contacts did Papadopoulos have with Russians and the Trump campaign?", "In announcing the guilty plea, the Department of Justice released a “Statement of the Offense” that lays out some — not all — of Papadopoulos’ work on behalf of the campaign and the contacts he had with “the Russians” and Trump campaign officials.", "The statement does not “constitute all of the facts known to the parties concerning the charged offense,” but rather provides “selected events” to demonstrate that “sufficient facts exist” for the defendant’s guilty plea, the Justice Department said. Both sides “stipulate and agree” that the facts contained in the statement “are true and accurate.”", "In the statement, Papadopoulos was identified as having contacts with senior members of the Trump campaign on at least a dozen occasions from March through August of 2016 — including the March 31, 2016, national security meeting. At that meeting, Papadopoulos “introduced himself to the group” as someone who “had connections that could help arrange a meeting between then-candidate Trump and President Putin,” according to the Justice Department statement.", "Seven days earlier, Papadopoulos met with two Russian intermediaries in London and discussed the possibility of arranging a meeting between Trump and Putin. After his March 24, 2016, meeting in London, Papadopoulos sent an email to “the Campaign Supervisor and several members of Campaign’s foreign policy team,” explaining that his Russian contacts wanted “to arrange a meeting between us and the Russian leadership to discuss U.S.-Russia ties under President Trump.”", "“The Campaign Supervisor responded that he would ‘work it through the campaign,’ but that no commitments should be made at that point,” the Justice Department statement says. “The Campaign Supervisor added: ‘Great Work.’ ”", "The Department of Justice did not name any of the campaign aides referenced in its statement. However, the Washington Post has since reported that an attorney for Sam Clovis confirmed that “the Campaign Supervisor” in court documents refers to Clovis, who served as Trump’s national campaign co-chairman.", "Here are some of the other contacts that Papadopoulos had with senior campaign officials about Russia during this time, according to the Justice Department statement:", "April 2016 –– Papadopoulos “sent multiple emails to other members of the Campaign’s foreign policy team regarding his contacts with ‘the Russians’ and his ‘outreach to Russia.'”", "April 25, 2016 — Papadopoulos sent an email to “a senior policy adviser for the Campaign” that said: “The Russian government has an open invitation by Putin for Mr. Trump to meet him when he is ready.”", "April 26, 2016 — During a meeting in London, “the professor” told Papadopoulos “that he had just returned from a trip to Moscow where he had met with high-level Russian government officials” who told him that the Russian government had “dirt” on Clinton “in the form of ‘thousands of emails,’” the Justice Department said. Following the meeting, Papadopoulos “continued to correspond with Campaign officials” and his Russian contacts “in an effort to arrange a meeting between the Campaign and the Russian government.”", "April 27, 2016 — Papadopoulos emailed “a high-ranking official of the campaign” to discuss “Russia’s interest in hosting Mr. Trump … when the time is right.” According to the Post, “Emails previously described to The Post indicate that the ‘high-ranking campaign official'” described in court documents is Corey Lewandowski, who at the time was Trump’s campaign manager.", "May 4, 2016 —  Papadopoulos received an email from his contact at the Russian Ministry of Foreign Affairs that said: “I have just talked to my colleagues from the MFA. The[y] are open for cooperation.” Papadopoulos forwarded that email to the “high-ranking campaign official” who since has been identified by the Post as Lewandowski.", "May 5, 2016 — Papadopoulos also forwarded that email to “the Campaign Supervisor,” who we now know is Clovis, after the two had a phone conservation. The subject of the email read, “Russia updates.”", "May 14, 2016 — Papadopoulos emailed the “high-ranking campaign official” with a message that “the Russian government ha[s] also relayed to me that they are interested in hosting Mr. Trump.”", "May 21, 2016 — Papadopoulos emailed “another high-ranking Campaign official” with the subject line, “Request from Russia to meet Mr. Trump.” The Post has since identified Paul Manafort as “another high-ranking campaign official.” At the time, Manafort was Trump’s campaign convention manager. The Post reported earlier this year that Manafort forwarded Papadopoulos’ email to his deputy, Rick Gates, with a note saying: “We need someone to communicate that DT is not doing these trips.” Gates said he would ask the campaign’s correspondence coordinator — “the person responding to all mail of non-importance” — to respond, rather than a senior campaign aide, the Post said.", "June 1, 2016 — Papadopoulos emailed the “high-ranking campaign official” about Russia, but he was told to contact “the Campaign Supervisor because ‘[h]e is running point.” Papadopoulos emailed “the Campaign Supervisor” — Clovis — with the subject line, “Re: Messages from Russia.” Papadopoulos wanted to know if Trump was interested in visiting Russia.", "June 19, 2016 — Papadopoulos emailed the “high-ranking campaign official” with the subject line, “New Message from Russia.” He offered to travel to Russia to meet with Russian government officials, if Trump was not interested or unable to visit Russia.", "Aug. 15, 2016 — “The Campaign Supervisor” told Papadopoulos “that ‘I would encourage you’ and another foreign policy advisor to the Campaign to ‘make the trip, if it is feasible.'” The Justice Department said the trip proposed by Papadopoulos did not take place.", "The department’s statement did not provide any specific information about Papadopoulos’ campaign contacts beyond Aug. 15, 2016. But, as we mentioned, the Justice Department statement is a partial account of Papadopoulos’ contacts with the Russians and the Trump campaign.", "What we do know is that during this time — from late March to mid-August — Papadopoulos was in regular contact with senior Trump campaign officials and attended a national security meeting with Trump. We will let readers decide if this constitutes a “low-level volunteer.”", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]