["After the rare sighting of twin elephant calves in Sri Lanka in July 2020, misleading claims and old photographs have circulated on Facebook. Some posts falsely claim the Sri Lankan pair were the first twin baby elephants born in South Asia. Other posts share images of elephants in South Africa, misrepresenting them as recent photos of the new baby elephants.", "The elephant twins were spotted in Sri Lanka’s Minneriya national park in July 2020 and were named Bathiya and Baghya by conservationists.", "This September 6, 2020 post on Facebook claimed that they were the first ever twin baby elephants in South Asia. The post was shared more than 3,700 times.", "The post’s Sinhala caption translates to English as: “South Asia's first twin baby elephant birth. From Minneriya National Park. Bathiya and Baghya”.", "The claim also circulated on Facebook here, here, here and here.", "But the claim is false, according to experts.", "“The births in Minneriya is not the first time that twin calves were born in South Asia. Twin births have been recorded in Nepal and India,” Pubudu Weerarathne, a wildlife activist and a member of the Sri Lanka Young Zoologists’ Association, told AFP by phone on September 8, 2020.", "Pubudu added, however, that the birth of twin elephant calves is a “very rare occurrence and the chances of it being recorded or sighted is even rarer.”", "Jayantha Jayawardena, a veteran conservationist and member of the IUCN Asian Elephant Specialist Group, also refuted the claim.", "“Although there are no known records of twin elephant calf births in the wild, there have been several accounts of twin elephant calves who have been bred in captivity,” Jayawardena told AFP by phone on September 8.", "Twin elephant births in South Asia have been reported in the region, for example in India here in 2017 and here in 1971.", "Nepal recorded the birth of twin elephant calves in 2008, according to the Asian Elephant Specialist Group, an India-based global conservation group.", "Other misleading Facebook posts featured a set of images of two baby elephants alongside claims that they are the twins spotted recently in Sri Lanka.", "The posts can be seen here, here, here, here, here and here.", "The images, however, have been shared in a misleading context.", "A reverse image search found that the photos in fact show elephants in the Kruger National Park in South Africa in 2019. The photos were published here on the website of Dutch photographer Inez-Allin Widow.", "Below is a screenshot comparison of the images from the misleading post (L) and the photographer’s webpage (R):", "The photographs were also published with attribution to Inez-Allin Widow in the Daily Mail here in January 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]