["About this rating", "Phyllis Schlafly, an ardent conservative political activist who came to prominence as an anti-communist crusader in the 1950s, then spent the rest of her life championing the supremacy of traditional values over progressive causes like feminism and gay rights, died on 5 September 2016 at the age of 92.", "One of her most noteworthy accomplishments was leading a movement — primarily via her \"family values\" interest group Eagle Forum — to defeat passage of the Equal Rights Amendment (ERA) in the 1970s. The proposed constitutional amendment, which would have banned all gender-based discrimination in federal and state law, fell short of the number of states needed for ratification by three, in large part due to Schlafly's efforts. She is also given credit for helping build the constituency that ushered in the conservative \"Reagan revolution\" of the 1980s.", "Predictably, news of Schlafly's death was met by a cacophonous mixture of tributes and slurs on social media, including an irony-laden \"prophetic\" quote attributed to her which, for many people to whom Schlafly's views were anathema, summed up their feelings about her passing:", "Phyllis Schlafly said \"We'll have a woman President over my dead body.\" God accepts the deal. https://t.co/5lDfLA23Qq", "— Randi Rhodes (@RandiRhodes) September 6, 2016", "Try as we might, however, we cannot find evidence that Schlafly ever said such a thing. For that matter, we can't find a single instance prior to the day she died in which she was even quoted as saying such a thing. In point of fact, Schlafly openly endorsed a female presidential candidate — Michele Bachmann — in December 2011:", "If I were an Iowa voter, I would be making plans right now to cast my vote for Michele Bachmann for President on January 3. I hope you will take advantage of this golden opportunity to support a candidate we can all be proud of.", "Schlafly did utter a great many controversial remarks in her lifetime, but \"There will be a woman president over my dead body\" wasn't one of them. It's a fabricated quote.", "Jacobs, Jennifer.  \"Conservative Activist Phyllis Schlafly Endorses Michele Bachmann.\"\r\n   Des Moines Register.  4 December 2011.", "Martin, Douglas.  \"Phyllis Schlafly, 'First Lady' of a Political March to the Right, Dies at 92.\"\r\n   The New York Times.  6 September 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]