["About this rating", "On 21 August 2017, the conservative non-profit organization Turning Point USA (TPUSA) posted a meme juxtaposing a 42-year-old quote by then-former California Governor Ronald Reagan with a 2016 photograph of anti-fascist protesters in Dover, England, intended to create the impression that \"antifa\" demonstrators represented fascism coming to the the United States in just the way that Reagan had predicted decades earlier:", "That quote was taken from a December 1975 interview of Reagan conducted by Mike Wallace for the 60 Minutes news magazine television program:", "We've found no record of anyone, other than Reagan himself, having made the \"profound\" statement that \"If fascism ever comes to America, it will come in the name of liberalism.\" Most likely the future President was recalling a variant of a maxim (commonly misattributed to author Sinclair Lewis) holding that \"When fascism comes to America, it will be wrapped in the flag and carrying a cross.\"", "TPUSA shared the Reagan meme on their official Facebook feed at a time when anti-fascist activists, or \"antifa,\" had garnered both notoriety and heightened media scrutiny following violent incidents at white supremacist rallies in Berkeley, California, and Charlottesvile, Virginia (in April and August 2017, respectively). After white supremacists (who have adopted the moniker \"alt-right\") were widely condemned for an outbreak of deadly violence at a protest in Charlottesville, some conservatives responded by claiming \"antifa\" protesters deserved equal condemnation.", "The bottom image in the TPUSA meme (which has been shared thousands of times) wasn't taken in the United States, despite the implication created by its inclusion here. The photograph was taken in Dover, England, on 30 January 2016 by Press Association photographer Gareth Fuller and depicts anti-fascists who clashed with nationalists during an anti-immigration rally in the Kent County town.", "The connection between \"liberals\" and the \"antifas\" suggested by this meme isn't quite so apt, as most \"antifa\" activists are anarchists and/or subscribe to political philosophies that are much further left on the political spectrum than those of mainstream \"liberals.\" Likewise, although the Reagan quote sought to draw a connection between liberalism and fascism, the latter is generally considered to be a form of extreme right-wing ideology.", "!function(r,u,m,b,l,e){r._Rumble=b,r[b]||(r[b]=function(){(r[b]._=r[b]._||[]).push(arguments);if(r[b]._.length==1){l=u.createElement(m),e=u.getElementsByTagName(m)[0],l.async=1,l.src=\"https://rumble.com/embedJS/ucxbq\"+(arguments[1].video?'.'+arguments[1].video:'')+\"/?url=\"+encodeURIComponent(location.href)+\"&args=\"+encodeURIComponent(JSON.stringify([].slice.apply(arguments))),e.parentNode.insertBefore(l,e)}})}(window, document, \"script\", \"Rumble\");", "Rumble(\"play\", {\"video\": \"v3t27p\",\"div\": \"rumble_v3t27p\",\"autoplay\":2});", "ITV.   \"Far-Right and Anti-Fascist Groups Clash at Protests in Dover.\"\r\n    30 January 2016.", "Penny, Daniel.   \"An Intimate History of Antifa.\"\r\n    The New Yorker.   22 August 2017.", "Beinart, Peter.   \"The Rise of the Violent Left.\"\r\n    The Atlantic.   September 2017 issue.", "KentOnline.com.   \"Dover Riots of January 30, 2016 — Police Hunt for Far Right and Anti-Fascist Thugs Goes On.\"\r\n    30 January 2017.", "Sepulvado, John, and Bert Johnson.   \"Californian Who Helped Lead Charlottesville Protests Used Berkeley as a Test Run.\"\r\n    KQED-TV.   14 August 2017.", "McCreesh, Shawn.   \"Antifa and the 'Alt-Left': Everything You Need to Know.\"\r\n    Rolling Stone.   18 August 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]