["About this rating", "In late 2017 and early 2018, the #MeToo movement on social media—prompted by a series of sexual harassment and sexual assault scandals involving high-profile men—brought consent and sexual misconduct to the forefront of public debate.", "In this climate, Facebook posts in January 2018 falsely described proposed changes to the law around rape and sexual assault in Sweden.", "On 15 January 2018, the survivalist Facebook page Survive Our Collapse wrote:", "If you live in Sweden & want to bang you must now sign a sexual consent form first. The law will go into effect July 1st 2018.", "The page—which frequently posts anti-Muslim, xenophobic and anti-liberal content—also posted a link to a December 2017 Associated Press article that appeared in The Guardian, along with a photograph of the purported \"sex consent card.\"", "The card reads:", "SEX CONSENT CARD", "I am having voluntary sex. \nI am not drunk or high. \nI am over 18. \nI am STD Free.", "Date: ________\nMale sign: ________\nFemale sign: ________", "Men, keep this in your wallet with a condom. With this card, do not accept an Article 15. Only give this card to your lawyer. Do not confess to the MPs or your boss. Demand a lawyer.", "A day earlier, the right-wing, pro-gun rights Facebook page Right News posted the same message with the same Guardian article, but without the photograph of the \"consent card.\"", "And on 17 January, Jonathan Babine posted a screenshot of the Survive Our Collapse post to another Facebook group, garnering 15,000 shares within a week.", "The claim that Sweden is about to mandate sexual consent forms is false and a misrepresentation of a real proposal currently being debated in Sweden. The photograph of the \"sex consent card\" posted by Survive Our Collapse is a hoax and is not in any way connected to the Swedish proposal.", "In December 2017, the Swedish government introduced a bill that would mean prosecutors charging someone with sexual assault or rape need only demonstrate the absence of explicit consent in advance of sexual contact, according to a Ministry of Justice statement.", "The Government proposes that the requirement of consent be the basis of the new legislation; to convict a perpetrator of rape it will no longer be required to establish that violence or threats were used, or that the victim’s particularly vulnerable situation was exploited.", "Currently, Swedish law requires that prosecutors prove the involvement of physical coercion or threats of violence, in order to advance a conviction. The proposed law, which the government said would be enacted by July 2018, changes that.", "In a correction to their original story, the Associated Press clarified that the bill would not shift the burden of proof to an individual accused of sexual assault to provide evidence of explicit consent. Rather, prosecutors would have to provide evidence that no explicit consent was given.", "Furthermore, Sweden's Embassy in Germany took the step of publicly debunking German news reports claiming that the proposed changes would require written consent of the kind claimed in Survive Our Collapse's Facebook post. In a statement, the Embassy wrote:", "The presumption of innocence continues to apply, of course. Contrary to many media reports, it is not necessary to obtain written consent.", "In one sense, the proposed law would lower the bar for evidence required to get a sexual assault conviction, because prosecutors would no longer have to prove the involvement of physical force or threats of violence. However, it could also be difficult for prosecutors to prove the absence of explicit, prior consent.", "On 23 January 2018, Sweden's Legislative Council recommended against introducing the proposed changes, according to a Swedish Bar Association press release.", "The Lagrådet—a government agency composed of senior judges that gives non-binding recommendations on proposed legislation—said the consent law would allow for too much subjectivity on the part of judges, and therefore did not provide the \"predictability\" required of a new law.", "Swedish governments often heed the advice of the legislative council, but the consent proposal is part of a raft of measures to toughen penalties for sexual assault and rape, and has been a long-standing policy goal for the coalition government of Social Democratic Prime Minister Stefan Löfven. The fate of the proposal remained undetermined, as of 26 January 2018.", "The photograph included in Survive Our Collapse's post is a hoax. The earliest example we could find was in a February 2015 post on the \"Gorgeous Active Duty Females - U.S.\" Facebook page.", "The card was probably intended as a distasteful joke in response to a long-running sexual assault scandal within the United States military.", "The phrase \"do not accept an Article 15\" is a reference to Article 15 of the Uniform Code of Military Justice, which allows an armed services member accused of a relatively minor offense to request a hearing overseen by their commanding officer (a practice known as \"non-judicial punishment\") rather than more serious alternatives such as a court-martial.", "The phrase \"do not confess to the MPs\" is a reference to \"military police\" (MP) officers.", "Olsen, Jan M.   \"Sweden Moves to Require Explicit Consent for Sex.\"\r\n    Associated Press.   21 December 2017.", "Ministry of Justice (Sweden.)   \"Consent -- The Basic Requirement of New Sexual Offences Legislation.\"\r\n    Government Offices of Sweden.   December 2017.", "Legal Information Institute.   \"U.S. Code Title 10, Subtitle A, Part II, Chapter 47 (Uniform Code of Military Justice), Subchapter III, Section 815 -- Article 15, Commanding Officer's Non-judicial Punishment.\"\r\n    Cornell Law School.   23 December 2016.", "Sveriges Advokatsamfund (Swedish Bar Association).   \"Lagrådet Avstyrker Förslaget om Samtyckeslag.\"\r\n    24 January 2018.", "Embassy of Sweden in Germany.   \"Regierung Präsentiert Reform des Sexualstrafrechts.\"\r\n    20 December 2017.", "The Local.   \"Sweden Proposes Tougher Laws on Sexual Offences.\"\r\n    5 October 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]