["About this rating", "A lawsuit filed in February 2021 against the fast-food chain Panda Express and a coaching academy carries disturbing allegations about the company’s treatment of some of its California employees. A woman alleged that in 2019 during a “self-improvement” seminar she was encouraged to attend, she was forced to strip down to her underwear, open up about her vulnerabilities, and more, alongside other employees of the chain.", "The seminar, which was conducted by Alive Seminars and Coaching Academy, a separate entity from Panda Express, was allegedly bizarre, psychologically abusive, and “more and more resembled a cult initiation ritual as time went on,” according to the lawsuit. The lawsuit detailed complaints including sexual battery, a hostile work environment, failure to prevent harassment, intentional infliction of emotional distress, and more.", "A headline on Oddee, a website for \"weird\" news stories, incorrectly stated, \"Panda Express Charged for Bizarre Sexual “Cult-Like” Teambuilding Seminar.\" Since this is a civil case filed by an individual and not a criminal charge filed by a prosecuting government body, Panda Express has not been “charged,” but rather accused of being responsible in the above complaints.", "Moreover, none of these accusations have yet been proven or adjudicated in a court of law.", "We learned that on Feb. 12, 2021, the lawsuit had been remanded to the Los Angeles Superior Court. The plaintiff, who worked at Panda Express as a cashier (among other roles) until July 2019, claimed that she was told by the company that in order to maximize her opportunities for promotion, she should attend Alive Seminars' “self-improvement” sessions.", "The lawsuit claimed that Panda Express has a “close association” with Alive Seminars, even paying for employees to attend their training, though the plaintiff was forced to spend several hundred dollars out of pocket for the seminar. The disturbing allegations included:", "From the beginning, the Panda-sponsored Alive seminar attended by [the plaintiff] was bizarre and quickly devolved into psychological abuse. At the start, the attendees were told to sit down and not talk, and were left in eerie isolation for a full hour before a man stormed in, yelling in Spanish and berating the attendees for sitting there and doing nothing when that is exactly what they had been instructed to do. The man, an Alive Seminars employee, loudly proclaimed that the attendees are “nothing” and “don’t matter,” rounding on some people to berate them individually, spittle flying. The overall effect was that of a particularly nasty drill sergeant yelling into [the plaintiff's] face.", "It became apparent almost immediately that the goal of the seminar staff was to isolate and intimidate [the plaintiff] and the other attendees. The attendees were prohibited from using their cell phones; there was no clock in the room; the doors and windows were all covered with black cloth. The atmosphere resembled less a self-improvement seminar than a site for off the-books interrogation of terrorist suspects.", "One allegation was that the plaintiff was made to strip down to her underwear and hug another attendee while in a state of undress, actions that constituted sexual battery, according to the lawsuit:", "On Saturday, July 13, 2019, Plaintiff showed up to find a new “exercise” wherein she was forced to strip down to her underwear under the guise of “trust-building.” Plaintiff – stripped almost naked in front of strangers and co-workers – was extremely uncomfortable but pressed on because she knew it was her only chance at a promotion. Plaintiff felt extremely uncomfortable at the situation but compelled to continue because her prospects for advancement at Panda Express depended on completion of the seminar.", "Meanwhile, Alive Seminars staff were openly ogling the women in their state of undress, smiling, and laughing.", "The exercise culminated when Plaintiff, along with other participants, had to take turns standing up to yell about their inner struggles until everyone else in the group “believed” them. The last male participant had some difficulty “convincing” the others and as a result, broke down in tears. Plaintiff was told to stand up and go to the middle of the room with the male participant, where they were forced to “hug it out” wearing nothing but their underwear. Plaintiff was humiliated but did as she was told.", "The seminar more and more resembled a cult initiation ritual as time went on. Alive Seminars staff proceeded to dim the lights. Plaintiff and the other attendees were instructed to stand up and close their eyes, pretending that a light from above would come down and take all the “negative energy” out of them, then pretend that a hole opened up in the ground and swallowed the “negative energy.” While this was happening, one of the Alive Seminars staff had a cell phone with the light on, recording Plaintiff in her state of undress.", "Panda Express told The Washington Post that it is investigating the matter and denied having ownership ties to Alive Seminars. In a statement, the company said:", "Alive Seminars and Coaching Academy is a third-party organization in which Panda has no ownership interest and over which it exercises no control. While we always encourage personal growth and development, Panda Restaurant Group has not and does not mandate that any associate participate in Alive Seminars and Coaching Academy nor is it a requirement to earn promotions [...] We do not condone the kind of behavior (the plaintiff) has alleged took place at Alive Seminars and Coaching Academy, and we would not intentionally allow it to occur within or on behalf of our organization.", "Alive Seminars told The Orange County Register that its trainings were presented with respect and dignity.", "Given that a lawsuit has been filed against Panda Express and Alive Seminars accusing both of being responsible for a number of complaints including sexual battery, but none of these accusations have yet been adjudicated in court, we rate this claim \"Unproven.\"", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]