["More than a dozen Facebook posts have published the claim, which begins: “In our laboratory, we found trace amount of the virus on the skin of fruits and vegetables after 12 hrs. of being touched by another customer who was infected (sic).”", "Some of the posts have been archived here and here.", "The claim says that staff at the private Umhlanga Hospital in South Africa’s KwaZulu-Natal province have been warned to avoid salads, or to wait for two days before eating fresh fruit and vegetables. The other suggestion is to disinfect produce with boiling water.", "The worst offenders are said to be berries, cucumbers, apples and tomatoes \"because some people eat the skin\".", "“This would explain why the virus is spreading faster in the West than Asia. Most Asians do not eat salad, and very few eat the skin of any fruit,” the claim continues.", "The entire statement is attributed to a certain “Dr Sanjay Lundlal”.", "The claim was brought to AFP’s attention via our dedicated tip-off line on WhatsApp messaging service.", "In an email to AFP, Netcare rejected the claim about uMhlanga Hospital as “absolutely untrue and fake news”.", "“There is no Dr Sanjay at the hospital, the hospital does not have a laboratory where such tests are done and the hospital general manager confirmed that there was no such notice to staff,”  Netcare communications manager Marietjie Shelly said.", "Shelly condemned the spread of false information.", "“People who start such fake news cause unnecessary anxiety among the public and waste all of our time trying to set the record straight. Please ask your readers not to forward it on if they receive it.”", "Netcare’s denial also appeared in the comments section of one of the posts responsible for publishing the claim.", "A study reported by AFP found that the novel coronavirus can survive for various lengths of time on some surfaces.", "However, medical experts and health organisations here, here and here said there is no evidence of food or food packaging being associated with transmission of COVID-19.", "The World Health Organization says there is not yet a vaccine or specific treatment for COVID-19.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]