["By Saranac Hale Spencer", "Posted on April 24, 2019", "A meme posted on a popular progressive Facebook page leaves out several words and important context in a quote from White House adviser Stephen Miller.", "A meme shared on a progressive Facebook page that frequently posts content critical of the Trump administration misquotes White House adviser Stephen Miller.", "The meme features two pictures. One shows Miller next to a quote that says: “The powers of the president will not be questioned.”", "The other shows President Theodore Roosevelt next to a quote that says: “To announce that there must be no criticism of the president, or that we are to stand by the president, right or wrong, is not only unpatriotic and servile, but is morally treasonable to the American people.”", "The problem with the Miller quote is that it’s incomplete and out of context.", "In an appearance on CBS’ “Face the Nation” on Feb. 12, 2017, Miller answered questions about President Donald Trump’s original executive order banning people from seven predominately Muslim countries from entering the United States. Several states challenged the ban and a federal judge blocked its enforcement just days after it was issued.", "That’s the background for Miller’s statement one week later, when he said this:", "Miller, Feb. 12, 2017: Well, I think that it’s been an important reminder to all Americans that we have a judiciary that has taken far too much power and become in many cases a supreme branch of government. One unelected judge in Seattle cannot remake laws for the entire country. I mean this is just crazy, John, the idea that you have a judge in Seattle say that a foreign national living in Libya has an effective right to enter the United States is — is — is beyond anything we’ve ever seen before.", "The end result of this, though, is that our opponents, the media and the whole world will soon see as we begin to take further actions, that the powers of the president to protect our country are very substantial and will not be questioned.", "The only words used in the meme are the ones shown in bold above. The way they are presented in the meme makes it sound like he made a more sweeping statement about presidential power than he did, particularly when paired with the Roosevelt quote.", "That Roosevelt quote got attention when Jeff Flake, a former U.S. senator from Arizona, used it in a 2017 speech announcing that he would not seek reelection. The speech was critical of Trump and the political climate.", "Shortly after Flake’s speech, a Time magazine article pointed out that Roosevelt wrote those words during a time when he was often critical of the sitting president, Woodrow Wilson.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Flores, Reena. “Trump adviser: Administration will send a signal ‘very soon’ to N.K.” CBS News. 12 Feb 2017.", "Trump, Donald. Executive Order Protecting the Nation from Foreign Terrorist Entry into the United States. 27 Jan 2017.", "Jackson, Brooks, et al. “Facts on Trump’s Immigration Order.” FactCheck.org. 1 Feb 2017.", "Flake, Jeff. Speech announcing he would not seek reelection. C-SPAN. 24 Oct 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]