["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Houses surrounded by flood waters are seen in the aftermath of Hurricane Delta Saturday Oct. 10, 2020, in Welsh, La. (AP)", "The number of U.S. landfalling hurricanes each year has not increased since a century ago, a NOAA scientist said.", "Experts say we should not expect future hurricanes to follow the same pattern.", "Researchers say it’s likely that global warming will cause future hurricanes to be more intense.", "As Hurricane Delta headed for the Gulf Coast, Vice President Mike Pence downplayed a connection between climate change and natural disasters striking the country, from wildfires to hurricanes.", "Susan Page, who moderated the Oct. 7 vice presidential debate, asked Pence if he believed, \"as the scientific community has concluded, that man-made climate change has made wildfires bigger, hotter, and more deadly and have made hurricanes wetter, slower and more damaging?\"", "Pence started his response by saying, somewhat inaccurately, what the Democratic presidential ticket would mean for fracking and the Green New Deal.", "\"With regard to hurricanes, the National Oceanic Administration tells us that actually, as difficult as they are, there are no more hurricanes today than there were 100 years ago,\" he said.", "RELATED: Fact-checking the VP debate, Kamala Harris vs. Mike Pence", "That comment might sound surprising given the busy 2020 hurricane season. Hurricane Delta was Louisiana’s fourth hurricane or tropical storm of the year. And for only the second time in history, forecasters in 2020 used up all 21 of the year’s Atlantic storm names and had to resort to Greek letters.", "On the numerical comparison, Pence has a point. Hurricanes that reach U.S. land are happening about as often as they did 100 years ago.", "But that isn’t all the National Oceanic and Atmospheric Administration and other scientists have to say about hurricanes and climate change.", "Focusing only on the number of storms obscures warnings from NOAA and other scientists about the effect of climate change on future storms.", "\"If we are thinking about what to expect in the coming century, it’s not just a matter of extrapolating what we saw in the past century,\" said Gabriel Vecchi, a former NOAA scientist who is now a Princeton University professor.", "Scientists are more concerned about the intensity of future storms.", "Phil Klotzbach, a scientist at Colorado State University, said scientists are continuing to disentangle questions about climate change and hurricanes. But it’s clear that skyrocketing population growth along the coast means storms today are more costly and destructive than 100 years ago, and sea level rise means more dangerous flooding from storm surge.", "Pence didn’t specify whether he was referring to hurricanes that made landfall around the world, or just in the U.S. (The Trump campaign did not respond to our request for clarification.) The most reliable data is for U.S. landfalling hurricanes, so we’ll start there.", "Jeff Masters, meteorologist for Yale Climate Connections, said it is true that the number of U.S. mainland landfalling Atlantic hurricanes has not changed appreciably in the past 100 years. There was one year about a century ago, in 1916, when nine tropical storms or hurricanes hit the mainland U.S. With Hurricane Delta, 10 have hit the U.S. this year.", "\"We are cruising through names at a record pace, but largely thanks to a lot of weak and/or short-lived ones,\" said Brian McNoldy, a University of Miami hurricane researcher. \"This is in stark contrast to the 2005 season, which also went into the Greek alphabet for the first time but produced many long-lived and very intense hurricanes.\"", "This year’s busy season doesn’t necessarily mean we should expect more storms.", "\"Computer modeling results of Atlantic hurricanes are inconclusive on whether or not climate change will cause an increase or decrease in the number of Atlantic hurricanes in a future warmer climate, with some models showing a decrease, and some showing an increase,\" Masters said. \"But what theory and modeling do agree upon is that we will see the strongest hurricanes get stronger. Observations suggest that we are already seeing that occur.\"", "Masters pointed to a June 2020 research article by scientists at NOAA and the University of Wisconsin-Madison that looked at global storms from 1979 to 2017. The number of major hurricanes — Category 3 or stronger — increased globally by 15% in the later half of that period.", "Major hurricanes are significantly more damaging than a Category 1 or 2 storm.", "A September NOAA research analysis concluded that future hurricanes will be more intense with higher rainfall rates as a result of global warming. NOAA has said that rising sea levels, another effect of climate change, will increase the threat of storm-surge flooding during hurricanes.", "RELATED: Can a nuclear bomb stop a hurricane? No, it’s a myth that has persisted for decades", "Pence said that NOAA said \"there are no more hurricanes today than there were 100 years ago.\"", "The data from NOAA show there’s no major difference between the number of storms today and a century ago. But his statistic doesn’t mean a lot on its own. What matters more is the intensity of hurricanes, and how climate change and sea level rise will affect future intensity.", "We rate this claim Half True.", "Factba.se, Vice president debate transcript, Oct. 7, 2020", "NOAA, Global Warming and Hurricanes: An Overview of Current Research Results, Sept. 23, 2020", "NOAA, Could climate change make Atlantic hurricanes worse? May 29, 2019", "NOAA, Historical Changes in Atlantic Hurricane and Tropical Storms, 2016", "NOAA, State of the Science FACT SHEET, May 27, 2020", "American Meteorological Association, Continental U.S. Hurricane Landfall Frequency and Associated Damage: Observations and Future Risks, July 23, 2018", "CNN, Interview with Gabriel Vecchi, Sept. 4, 2019Climate scientist: Climate crisis contributes Nature, Aerosol alteration of Atlantic storms, June 23, 2013", "Factcheck.org, FactChecking the Vice Presidential Debate, Oct. 8, 2020", "FORBES, This Era Of Deadly Hurricanes Was Supposed To Be Temporary. Now It’s Getting Worse, Oct. 7, 2020", "Miami Herald, Miami-Dade is one storm away from a housing catastrophe. Nearly 1M people are at risk, Oct. 9, 2020PolitiFact, 7 questions about the Green New Deal, Feb. 12, 2019", "PolitiFact, Trump misses the mark with claim that Green New Deal proposal wants to ban cows, Sept. 28, 2020", "PolitiFact, How much do we know about climate change and hurricanes? Sept. 12, 2017", "Telephone interview, Gabriel Vecchi, professor of geosciences at Princeton Environmental Institute, Oct. 8, 2020", "Email interview, Brain McNoldy, senior research associate at the University of Miami's Rosenstiel School of Marine and Atmospheric Science, Oct. 8, 2020", "Email interview, Tom Knutson, research meteorologist at NOAA, Oct. 8, 2020", "Email interview, Harold R. Wanless, Professor,Department of Geography and Regional Studies, University of Miami, Oct. 8, 2020", "Email interview, Suzana Camargo, Columbia University research professor, Oct. 8, 2020", "Email interview, Kevin E. Trenberth, distinguished scholar National Center for for Atmospheric Research, Oct. 8, 2020", "Email interview, Phil Klotzbach, Research Scientist in the Department of Atmospheric Science at Colorado State University, Oct.. 9, 2020", "Email interview, Jeff Masters, Meteorologist for Yale Climate Connections, Oct. 9, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]