["“The USPS is not in debt. The USPS is not losing money.” These two statements, along with other assertions about the agency, were shared in various posts entitled “Facts You Should Know” or “USPS Fun Facts.” This post was shared 147,000 times since 2013, while these two from 2018 have more than 100,000 shares combined.", "The memes resurfaced in April 2020 as a bill in the House of Representatives proposed to forgive the agency’s debt as part of a stimulus package aimed at mitigating the economic fallout associated with the COVID-19 pandemic.", "They gained traction again in August 2020 when Postmaster General Louis DeJoy, a Trump campaign megadonor, was called to testify before Congress over concerns he was working to undermine mail delivery.", "However the posts misrepresented the financial health of the USPS in 2013, 2018, and 2020.", "The Postal Service’s 2019 annual financial report shows that the agency had a net loss of $8.8 billion that fiscal year, bringing total liabilities to more than $97 billion.", "“The prefunding requirement in the 2006 law is a major reason for our financial situation,” USPS spokesman David Partenheimer told AFP by email in reference to a bill that forces the institution to set aside money for its employees’ pensions before they are due.", "Partenheimer also blamed “an outdated business model that needs to be addressed through legislative and regulatory reform.”", "“But with COVID-19 our financial situation has gotten even worse,” he added, pointing out that USPS’s most profitable revenue stream, First-Class Mail, is hurt by businesses’ grinding to a halt because of the pandemic.", "The novel coronavirus will increase the agency’s debt by $22 billion over the next 18 months, Postmaster General Megan Brennan said in an April 10 statement.", "“The USPS costs taxpayers exactly $0. The USPS has always been self-sustaining,” the posts claim. The Postal Service is currently self-supporting, due to its special status as an independent federal agency overseen but not funded by Congress.", "However, the mail service was funded by tax dollars until the 1970s, when the Postal Reorganization Act was passed under President Richard Nixon, turning the Post Office Department into USPS, an independent agency run more like a corporation.", "According to Partenheimer, USPS currently employs 97,000 military veterans, making it “one of the largest employers of veterans in the country.”", "The US mail employs 630,000 people overall.", "It is true that the Postal Service is constitutionally guaranteed. As the ninth state ratified the Constitution in 1788, Congress was granted the power “to establish Post Offices and post Roads.”", "The bailout signed on March 25 did not include debt forgiveness but instead provided a $10 billion loan for the Postal Service. The funds are currently awaiting approval from the US Treasury Department.", "Following the Postmaster General’s April 10 statement on USPS’s dwindling finances, social media users have urged their peers to save the institution by buying sheets of stamps.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]