["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President-elect Joe Biden arrives, with his wife Jill Biden, and members of his family to be sworn in as 46th president of the United States during the 59th Presidential Inauguration at the U.S. Capitol in Washington, Wednesday, Jan. 20, 2021. (AP)", "The latest financial disclosure form for Biden and his wife, Jill, show no direct investments in foreign energy or oil.", "Other Biden family members have had ties to foreign energy companies, but those family members are not required to file disclosures that would reveal their investments.", "After President Joe Biden paused certain oil and gas operations and killed a cross-country oil pipeline, an image emerged on Facebook making this attack:", "\"I’m confused how the Biden family is so heavily invested in energy and oil in OTHER countries, yet they want to end it in OUR country.\"", "The widely shared post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The latest financial disclosure form for Joe Biden and first lady Jill Biden indicate no investments in foreign energy or oil, despite False claims on social media that suggest otherwise. But no such disclosure requirements apply to the Bidens’ adult children or to Joe Biden’s brother, James, who has been accused of trying to his brother’s political connections to help his business ventures.", "In short, aside from what the president and first lady have disclosed, there isn’t publicly available information on what Biden family members have in their investments.", "During his first eight days in office, Biden issued three executive orders affecting oil and energy.", "He paused the permitting of oil and natural gas operations in northeastern Alaska. And he paused leases for drilling on all federal land — effectively banning new fracking there for as long as the policy lasts. His moves leave current fracking, a process used to extract oil and gas from the ground, untouched.", "Biden also revoked the permit for the construction of the Keystone XL pipeline, which would have carried a heavy crude oil mixture from Western Canada to Steele City, Neb., where it was to connect with another leg stretching to Gulf Coast refineries.", "We rated as Mostly True a 2019 claim by Biden that he \"entered as one of the poorest men in Congress, left one of the poorest men in government, in Congress and as vice president\" in January 2017. But after leaving the vice presidency, he and Jill Biden wrote books, and he did high-paying speaking engagements. The couple’s annual income, which had hovered around $400,000 for seven consecutive years, reached $11 million in 2017, $4.58 million in 2018 and $985,000 in 2019, according to their tax returns.", "In August 2019, Forbes estimated the Bidens’ net worth at $9 million, which included two Delaware homes valued at $4 million combined, cash and investments worth another $4 million or so, and a federal pension worth more than $1 million.", "But in all of that, there is not direct evidence of foreign investments in energy or oil.", "Biden filed a federal financial disclosure form required of presidential candidates in May 2020. It said Joe Biden held between $15,001 and $50,000 each in what is listed as a \"U.S. brokerage account — cash,\" and in the TIAA-CREF Lifecycle Index 2010 Fund, which is a mutual fund.", "A mutual fund is a company that pools money from many investors and invests the money in securities such as stocks, bonds and short-term debt; they typically invest in a range of companies and industries.", "The form says Jill Biden had several whole life insurance policies and a number of investment funds. She held between $15,001 and $50,000 in the BNY Mellon IP Technology Growth; and between $1,001 and $15,000 each in Invesco VI Health Care, Guggenheim VIF High Yield, Guggenheim VIF Styleplus Mid Growth, Guggenheim VIF Small Cap Value, Guggenheim VIF All Cap Value, Guggenheim VIF S-Mid Cap Value, Janus Henderson VIT Enterprise, Janus Henderson VIT Research. All of those are mutual funds.", "She also had between $1,001 and $15,000 each in a utilities fund, MFS VIT Utilities, which includes electric, natural gas and telephone service providers; and in a bond fund, Western Asset Variable Global High Yield. A bond fund is a company that invests primarily in bonds. When you buy a bond, you are lending to the issuer, which may be a government, municipality, or corporation.", "Biden’s other family members include his son, Hunter Biden; his daughter, Ashley Biden; and one of his siblings, James Biden. Ashley Biden’s name has not surfaced in news stories that raise questions about Biden family investments.", "Hunter Biden, a lawyer and former lobbyist, held a directorship with a Ukrainian natural gas company called Burisma Holdings, beginning in the spring of 2014, when his father was vice president. A September 2020 report by Republican staff of the Senate Finance and Homeland Security committees alleged that he was paid millions of dollars over the next several years.", "George Mesires, a lawyer for Hunter Biden, told PolitiFact in 2019 that the younger Biden was an unpaid board member of Bohai Harvest RST, or BHR, a private equity company, until October 2017; at that point, he took a 10% financial stake in the firm. According to a 2019 Wall Street Journal report, the firm was 80%-controlled by Chinese entities. Mesires later released a statement on Oct. 13, 2019, saying that Hunter Biden would be resigning from the BHR board, without receiving any return on his investment or shareholder distributions. In 2014, BHR had invested about $1 billion in a subsidiary of a China-controlled oil and gas company. And in April 2017, BHR paid $1.2 billion for a stake in a Democratic Republic of Congo-based mining company.", "In December 2020, Hunter Biden said the U.S. attorney in Delaware is investigating his taxes. The details remain unknown, but several national newspapers, citing unnamed sources, reported that the matter focused on Hunter Biden and his associates, not his father or anyone in the president-elect’s circle. A separate investigation is underway by the U.S. attorney’s office in Manhattan, N.Y. According to the Wall Street Journal, Hunter Biden’s investments caught investigators’ attention as part of a broader probe into international financial transactions. That investigation includes money laundering. President Biden was not specifically targeted, the report says.", "An investigative article by Politico Magazine published in August 2019 examined whether Hunter and James Biden tried to make money off of Joe Biden’s political connections. There is no indication that Hunter and James Biden ever succeeded in bringing new foreign money into Paradigm Global Advisors, a hedge fund they purchased in 2006, the article said.", "As reported by the New York Times in late 2020, records produced by Tony Bobulinski, a former business associate of Hunter and James Biden show that in 2017, Hunter Biden and James Biden were involved in negotiations about a joint venture with a Chinese energy and finance company called CEFC China Energy. The deal ultimately fell apart.", "Individuals generally are not required to disclose their investment holdings to the U.S. Securities and Exchange Commission. Individuals who are insiders — such as officers, directors, and those that hold more than 10% of any class of a company’s securities — must report purchases, sales and holdings of their company’s securities. There are also disclosure requirements for individuals who own 5% or more of a company’s shares. None of the Bidens (Joe, Jill, Hunter, Ashley or James) have filed any of those, according to a search of SEC records.", "An image widely shared on Facebook said: \"The Biden family is so heavily invested in oil and energy in other countries.\"", "The latest financial disclosure filed by President Biden and the first lady show no direct investments in foreign oil or energy. Other family members are not required to file such disclosures and so the extent of their personal investments is not known.", "Joe Biden’s son Hunter and his brother James have past financial ties to foreign energy interests.", "The statement is unsupported. It contains an element of truth but ignores critical facts that would give a different impression. We rate the post Mostly False.", "Facebook post, Feb. 2, 2021", "PolitiFact, \"No, the Bidens didn’t invest their family fortune in Ukranian oil and gas,\" Jan. 28, 2021", "The White House, \"Joe Biden,\" accessed Feb. 8, 2021", "PolitiFact, \"Who is Joe Biden? A bio of the Democratic presidential candidate,\" June 11, 2019", "PolitiFact, \"Fact-checking claims about Hunter Biden, Joe Biden, and China,\" Oct. 19, 2020", "PolitiFact, \"Biden fracking policy still doesn’t amount to full ban,\" Jan. 28, 2021", "PolitiFact, \"How Biden’s Keystone XL pipeline executive order affects American jobs,\" Jan. 21, 2021", "PolitiFact, \"The Hunter Biden investigations: An update,\" Dec. 15, 2020", "U.S. Securities and Exchange Commission, EDGAR Company and Person Lookup, accessed Feb. 9, 2021", "U.S. Securities and Exchange Commission, \"Insider Transactions and Forms 3, 4, and 5,\" accessed Feb. 9, 2021", "USA Today, \"Fact check: Biden temporarily banned new oil and gas leasing on public lands,\" Jan. 30, 2021", "Email, Center for Responsive Politics researcher Alex Baumgart, Feb. 9, 2021", "Politico Magazine, \"Biden Inc.,\" Aug. 2, 2019", "U.S. Office of Government Ethics, Joe Biden 2020 disclosure form", "Bloomberg, \"Biden reports sharply reduced income amid presidential bid,\" May 15, 2020", "Email, U.S. Securities and Exchange Commission spokesperson Ryan White, Feb. 9, 2021", "Investor.gov, \"Bonds,\" accessed Feb. 9 2021", "New York Post, \"How five members of Joe Biden’s family got rich through his connections,\" Jan. 18, 2020", "New York Times, \"Questions and Answers About the Bidens and a Deal in China,\" published Oct. 25, 2020, updated Nov. 9, 2020", "Investor.gov, \"Bond Funds and Income Funds,\" accessed Feb. 9 2021", "Investor.gov, \"Mutual Funds,\" accessed Feb. 9 2021", "U.S. Senate Committee on Homeland Security and Governmental Affairs, \"Hunter Biden, Burisma, and Corruption: The Impact on U.S. Government Policy and Related Concerns,\" Sept. 23, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]