["About this rating", "In September 2018, many social media users joined in calling for a boycott against Nike after the sports apparel company featured controversial former NFL quarterback Colin Kaepernick in a new commercial. As images and videos purportedly showing these protesters burning Nike apparel started to circulate on the internet, a message suggesting that these individuals also get rid of their Chevrolet vehicles -- because Nike ostensibly owned that automobile manufacturer -- went viral on Facebook:", "This simply isn't true: Nike does not own Chevrolet.", "Nike is one of the largest apparel businesses in the world, and over the years they have acquired a number of related companies, such as Converse and Hurley. However, Nike does not own any car companies, let alone Chevrolet.  Chevrolet has been a division of the American automobile manufacturer General Motors for about a century now.", "The claim that Nike owns Chevrolet was made up out of whole cloth in order to \"troll\" the individuals who were boycotting Nike over their sponsorship deal with Colin Kaepernick. A similar jape was circulated around the same time which claimed that Ford USA had \"followed Nike's lead\" and hired Kaepernick to star in their new ad campaign, but that rumor was also merely a joke aimed at mocking contemporary protests against Nike.", "Forbes.   \"The World's 25 Biggest Apparel Companies in 2017.\"\r\n    Retrieved 12 September 2018.", "Bennett, Alexis.   \"Bet You Didn't Know That Nike Owns All of These Brands.\"\r\n    InStyle.   5 September 2018.", "Abad-Santos, Alex.   \"Why the Social Media Boycott Over Colin Kaepernick is a Win for Nike.\"\r\n    Vox.   6 September 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]