["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Whoopi Goldberg, a co-host on \"The View,\" has been targeted by fake news sites for her outspoken opposition of President Donald Trump. (Getty Images file photo)", "A fake news post that said Whoopi Goldberg was arrested for running an illegal puppy mill originated on a website known for its prolific fabrications.", "The headline on an Aug. 14, 2017, post on WeekendPoliticalNews.com read, \"Whoopi Goldberg humiliated, handcuffed and dragged out of the TV studio.\" Facebook users flagged the post as being potentially made up, as part of the social media site’s efforts to combat fake news.", "The post said The View co-host \"has been running an illegal puppy mill out of three of her properties, selling dogs with high risk of C-Sections that most vets say should stop being bred because of their heavily diluted gene codes.\"", "The diatribe said she face 15 years in prison and $1 million in fines for inbreeding pugs, French bulldogs, Shar Peis and Shih Tzus for almost 25 years.", "Goldberg has been in the news for her pets before. She adopted a kitten tossed from a New York bridge in 2011, and adopted a blind and deaf puppy featured on The View in 2015. But she hasn’t been arrested for any sort of animal abuse.", "The story isn’t true. It was originally posted June 17 on TheLastLineOfDefense.org, a website run by a self-described liberal troll who posts absurd articles in an attempt to fool conservatives.", "The website said in its footer note that \"everything on this site is a satirical work of fiction.\" A disclaimer on its About Us page added that \"we present fiction as fact and our sources don’t actually exist.\"", "Goldberg has been a target of the site before. TheLastLineOfDefense.org has said Goldberg has been charged by the Secret Service, hired by Fox News Channel and faced the ire of President Donald Trump’s administration. And that’s just since March.", "This is another fake charge leveled by a website that makes up all its content, which is reshared online with no indication of its origins.", "We rate this claim Pants On Fire!", "WeekendPoliticalNews.com, \"Whoopi Goldberg Humiliated, Handcuffed And Dragged Out Of The TV Studio,\" Aug. 14, 2017", "TheLastLineOfDefense.org, \"Whoopi Goldberg Humiliated, Handcuffed And Dragged Out Of The TV Studio,\" June 17, 2017", "CBSNews.com, \"Whoopi Goldberg adopts kitten thrown from car on NYC bridge,\" Aug. 25, 2011", "Facebook, Whoopi Goldberg post, Sept. 8, 2015", "PunditFact, \"If you're fooled by fake news, this man probably wrote it,\" May 31, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]