["Sen. John McCain revived a claim against Barack Obama that Obama voted to raise taxes on people making $42,000 a year.", "“He voted twice for a budget resolution that increases the taxes on individuals making $42,000 a year,” McCain said in the presidential debate Oct. 15, 2008, at Hofstra University.", "This time, McCain correctly noted the tax votes came on budget resolutions. But we’ve reviewed this charge before and found that McCain was stretching the truth. He does again this time, though not as badly.", "Obama voted in March 2008 and June 2008 for budget resolutions. They are blueprints for the federal budget. The resolutions set targets for the committees that write legislation on taxes and spending. The resolutions, approved on mostly party-line votes, expressed support for rolling back tax cuts enacted under President Bush for people making $42,000 a year and higher.", "So the McCain campaign is correct that Obama voted for the measures, which expressed approval for tax increases.", "But it’s inaccurate to suggest that votes on nonbinding budget resolutions, which don’t have the force of law and don’t include precise details on taxes or spending, are the same as votes on legislation that actually increases taxes. The resolutions would not change the tax code.", "Moreover, Obama as a candidate has proposed tax increases for couples earning $250,000 or more a year, or singles earning $200,000 or more.", "We rated previous versions of McCain’s charge as Barely True. Although McCain added context to his charge, it doesn’t change the fact that the votes were never expected to raise taxes. So we rate the latest version of McCain’s statement Half True.", "U.S. Senate,\n\nVote on budget resolution\n\n, March 14, 2008", "U.S. Senate,\n\nVote on budget resolution\n\n, June 4, 2008", "The Tax Policy Center,\n\nAn Updated Analysis of the 2008 Presidential Candidates' Tax Plans\n\n, July 23, 2008", "JohnMcCain.com,\n\nThe correct answer is $500 billion", "CQ Today, “Democrats Set Their Sights on Reversing the Budget Resolution Curse,” by David Clarke and Liriel Higa, March 28, 2008", "Committee for a Responsible Federal Budget,\n\nAnalysis of fiscal 2009 budget resolutions\n\n, April 8, 2008", "Senate fiscal 2009 budget resolution\n\n, enter \"S Con Res 70\" in \"Search Bill Text\" field", "Congressional Budget Office,\n\nThe Long-Term Budget Outlook\n\n, December 2007", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]