["About this rating", "On 15 April 2017, North Korea paraded its military arsenal down the streets of Pyongyang to mark the 105th anniversary of the birth of the country's founding president, Kim Il-Sung. A video report from BBC's John Sudworth captured several of the weapons displayed during the parade:", "Something appeared amiss with some of the North Korean arsenal to curious online viewers, many of whom circulated stills from the BBC video along with the claim that North Korea's missiles were fake:", "As the parade was under way, many people watching coverage took to social media to say some missiles were wobbling in the wind and at least one appeared to be bent.", "Internet commentators weren't the only ones to question the authenticity of North Korea's weapons. Lee Il-Woo, a senior analyst at the private Korea Defence Network, said: \"I suspect they all might be mock-ups aimed to impress the outside world.\"", "Although the North Korean missiles captured in these still images may have appeared visually odd in some respects, this alone is not enough to definitively declare that the country's missiles are fake. Security experts have also cautioned against dismissing North Korea's arsenal as an illusory one. For example, Euan Graham, the director of the international security program at the Lowy Institute for International Policy, said that North Korea may have paraded empty canisters to limit the risk in case of an airstrike:", "\"Particularly in terms of the canisters in the parade, they are essentially the wrapper in which the missile may or may not be contained, and it doesn't mean that they haven't developed it,\" he said.", "\"It is just kind of operational good sense for North Koreans to parade an empty canister. They achieve nothing by filling it with a missile, especially if they are worried about air strikes — it just creates an extra level of complication and risk.", "\"It may be a bluff or it may be that the missiles are stored separately — the point is it creates the doubt and uncertainty that defence planners will have to take into account.\"", "Of course, there is another possibility: North Korea's missiles are real.", "The claim that North Korea's missiles are fake is largely based on the surface observation of what appears to be an oddly shaped weapon. However, this \"strange\" nose cone can also be seen on real S-200 missiles:", "O'Brien, Simon.   \"North Korea's 'Fake' Missiles Should Not Lull World Into False Sense of Security, Defence Experts Say.\"\r\n    ABC Nws (Australia).   17 April 2017.", "BBC News.   \"North Korea 'Ready for Nuclear Attack' Amid Show of Force.\"\r\n    15 April 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]