["Ever since Republican presidential candidate Donald Trump criticized the war record of Vietnam veteran Sen. John McCain on July 20, the treatment of veterans has been a major point of political discussion.", "President Barack Obama got into the fray in his July 21  interview with Jon Stewart on the Comedy Central program The Daily Show, during an unaired, exclusively online portion of the interview.", "Stewart questioned Obama on the state of veteran health care, citing, among other things, the VA’s long wait times. Obama defended the government agency, claiming the VA is structurally better than when he entered office, though it remains underfunded and its employees overworked.", "Later in the interview, he further defended his record when it comes to serving veterans. \"Let’s take something like homelessness among veterans. So we’ve cut that by a third,\" Obama said.", "That one-third number struck us. Does Obama have the facts to back it up?", "One independent agency dedicated to fighting homelessness thinks so. On the \"Veterans\" page of the National Alliance to End Homelessness’ website, it reads, \"In 2009, the Obama Administration committed to ending veteran homelessness in the U.S. by the end of 2015. Since 2010, there has been a 33 percent decrease in the number of homeless veterans.\"", "Nan Roman, the CEO and president of the Alliance, said the 33 percent decrease is backed by the yearly \"point in time,\" called PIT, count of homeless veterans.", "Every year, the U.S. Department of Housing and Urban Development (HUD) releases a detailed report about the state of homelessness in the United States to Congress, called the Annual Homeless Assessment Report. The 2014 report reported 49,933 homeless veterans according to the point in time count, a 32.57 percent decrease from the 2009 count of 74,050.", "The 2015 numbers are not yet available, but Roman said she expects further decreases.", "National \"point in time\" counts were first conducted in 2009, during the peak of the recession, so it is possible that the decline in homelessness among veterans has been symptomatic of the larger national economic recovery. But the count has been largely consistent since then.", "But what is a \"point in time\" count, and what do other metrics say about veteran homelessness?", "According to Dennis Culhane, a professor who studies homelessness at the University of Pennsylvania, the PIT count is conducted around the same time every year by individual cities. The number is supposed to reflect the total number of homeless people, \"sheltered\" and \"unsheltered,\" on a given night in a given city. Cities must do a count if they are to receive HUD funding.", "The \"sheltered\" count is easy. When homeless people stay in temporary, government-sponsored housing, they have to register with city officials. It’s the \"unsheltered\" population, the people living on the street, who pose a counting challenge", "According to Culhane, not every city counts the same way. Some literally count by hand the number of homeless people living on the street. Some estimate based on how likely it is to find a homeless person in a given area of a city. And some even change their counting methodology from year to year, forcing revised estimates that can change the national number.", "Despite some inevitable discrepancies, Roman said the PIT numbers are consistent.", "\"They may be imperfect, but they’re imperfect in the same way every single year,\" Roman said.", "Further complicating things, it can be difficult to ascertain whether certain unsheltered homeless people are veterans. Sometimes, those who have served do not identify as such, or, on the flip side, people exaggerate their service.", "The PIT count also isn’t the only statistic for counting the homeless veteran population. Brian Sullivan, the supervisory public affairs specialist at HUD, pointed us to both the PIT number and the one-year estimate of sheltered veterans, a different metric. That number isn’t limited by the small time frame of the PIT count. It uses an entire year’s worth of data.", "The one-year estimate of sheltered veterans does not support the 33 percent number Obama offered. According to the most recent data, there were just 6.5 percent fewer homeless veterans from 2009 to 2013.", "But Roman and Culhane say the PIT number is preferred over the one-year estimate because the PIT takes into account both sheltered and unsheltered veterans.", "\"I would use the PIT count. Annual data would be strong, if they included all veterans (i.e., unsheltered as well as sheltered),\" Roman wrote in an email. \"Over one-third of the homeless veteran population is unsheltered on a given night. That is a large percentage of the population to ignore.\"", "Culhane said the biggest drop in the homeless veteran population has been among the unsheltered, so ignoring that slice of the population would be counterintuitive.", "The only reason to be skeptical of the Annual Homeless Assessment Report numbers, Roman said, would be because they are pretty much the only numbers available.", "\"It’s the administration reporting on the administration’s data, and we don’t have any verification of it,\" Roman said.", "Culhane, who helps with the count as the director of research for the VA’s National Center for Homelessness Among Veterans, said there were multiple reasons to believe the numbers.", "For one, he pointed out, individual communities conduct the counts.", "For another, Obama and Congress together have thrown a lot of money at this problem in recent years.", "\"In 2009, the federal budget for veteran homelessness was $400 million and that paid for a transitional housing program that was basically a fancy shelter,\" he said. \"Now the budget is $1.5 billion.\"", "Roman agreed. \"There’s a lot of work going on in communities to find every veteran, and there’s a lot of money being spent to get them into housing,\" she said. She pointed to the Supportive Services for Veterans Families and HUD-VA Supportive Housing programs, which have both cut down significantly on the cost of housing for homeless veterans.", "Our ruling", "Obama said, \"Let’s take something like homelessness among veterans. So we’ve cut that by a third.\" According to the most recent, best available data, he’s right. During his tenure, homelessness among veterans has decreased 32.57 percent. However, that number is based on estimates that have an element of uncertainty. Also, funding to end homelessness among veterans has received bipartisan support in Congress. Still, Obama’s point is largely accurate, and we rate his statement Mostly True.", "PolitiFact, \"After ‘not a war hero’ remark, Donald Trump says John McCain has ‘done nothing’ for veterans,\" July 21, 2015", "The Daily Show with Jon Stewart, \"Exclusive - Barack Obama Extended Interview,\" July 21, 2015", "Washington Post, \"One year after VA scandal, the number of veterans waiting for care is up 50 percent,\" June 23, 2015", "National Alliance to End Homelessness, \"Veterans,\" No date.", "Interview with Nan Roman, President and CEO, National Alliance to End Homelessness, July 24, 2015", "Email exchange with Nan Roman, President and CEO, National Alliance to End Homelessness, July 24-27, 2015", "Interview with Dennis Culhane, Professor and Dana and Andrew Stone Chair in Social Policy at the University of Pennsylvania, July 24, 2015", "Interview with Brian Sullivan, supervisory public affairs specialist, U.S. Department of Housing and Urban Development, July 24, 2015", "The 2014 Annual Homeless Assessment Report (AHAR) to Congress, Part 1: Point-in-Time Estimates of Homelessness, Page 40, October 2014", "The 2013 Annual Homeless Assessment Report (AHAR) to Congress, Part 2: Estimates of Homelessness in the United States, Page 5-11, July 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]