["Democrat Gavin Newsom claimed his GOP opponent in the race for governor, John Cox, \"parroted\" President Trump on separating immigrant families.", "In his run for California governor, Democratic Lt. Gov. Gavin Newsom has repeatedly tried to tie his Republican opponent John Cox to President Trump’s most hardline immigration policies.", "Newsom did just that in a recent TV interview. He claimed Cox, a San Diego businessman who Trump has endorsed, has \"parroted\" Trump on the president’s controversial family separation policy for those who illegally cross the border.", "Newsom made the assertion immediately after discussing Cox’s policies, implying that his Republican rival fully supports separating immigrant families.", "\"Even by relatively moderate positions in the Republican party in California, he’s on the extreme of those positions,\" Newsom told ABC7 in Los Angeles on Aug. 17, 2018. \"He can’t run away from Trump. He parroted, parroted Trump—almost verbatim—on the children’s separation issues at the border.\"", "Newsom makes his claim in the ABC7 TV interview above.", "We fact-checked the last portion of Newsom’s statement.", "Our research", "It’s not clear which specific words Newsom believes Cox has \"parroted.\" That’s because Trump has made many claims about the child separation policy, some of which blame Democrats in Congress for forcing the crisis. Thousands of children were taken from their parents and sent to detention centers this spring after their families crossed the border.", "Though Trump eventually ended the policy, hundreds of children remain separated.", "Trump has also claimed the problem could be solved if people \"Don't come to our country illegally. Come like other people do. Come legally.\"", "Still, the implication in Newsom’s statement is straigtforward: That Cox and Trump share the same words and viewpoints on the policy.", "Cox says he's opposed", "There’s one big problem: Cox clearly stated his opposition to separating families at a June press conference at the state Capitol.", "The conference and proceeding rally was organized in support of repealing the state’s gas tax increase, one of Cox’s top causes.", "\"I'm against separating parents and children, I'm a father. I have four daughters. That's a congressional problem,\" Cox told reporters. \"I hope we get a congressional solution very soon.", "He later added: \"I’m about solutions. … I hope Congress solves that problem, as well, and I’ll work with it.\"", "Asked the same month on KGO Radio about the policy, Cox said: \"I would certainly add my voice to try and keep parents and children together.\"", "Cox was again asked whether he supports separating children from families in an August TV interview on Bloomberg Politics.", "He did not offer an explicit answer, but said: \"I support getting a solution.\"", "None of the responses show Cox favors the policy.", "To support Newsom’s claim, his spokesman Nathan Click pointed to a June Sacramento Bee article that covered Cox’s comments at the June press conference.", "The article begins this way:", "Republican gubernatorial candidate John Cox on Monday backed President Donald Trump's stance on separating immigrant parents from their children at the border, saying, \"that's a congressional problem.\"", "Cox is quoted later in the article saying he’s \"against\" separating families.", "In an email, Cox’s spokesman Matt Shupe wrote that Newsom’s statement is \"100 percent FALSE.\"", "Who’s to blame?", "Setting aside the key context that Cox has opposed the policy, we examined whether Cox’s words in any other way \"parrot\" Trump’s, as Newsom stated.", "We found Cox and Trump both say that Congress must solve family separations.", "But even on this point, there’s a degree of difference.", "Trump has focused his blame mostly on Democrats in Congress, while Cox hasn’t been that specific.", "On May 26, Trump tweeted:", "Then, on June 16, Trump tweeted:", "PolitiFact and other news organizations have debunked Trump’s false claim that Democrats or others in Congress passed a law that forced the family separations. They have noted the Trump administration is responsible for its own policy.", "\"There is no such law,\" PolitiFact National wrote in a recent fact check. \"The Homeland Security Department’s longstanding policy is to separate children from their custodians when they are referred for criminal prosecution. Trump’s administration has decided to prosecute all illegal crossings. Families were rarely prosecuted under previous administrations.\"", "Our ruling", "Democrat Gavin Newsom recently claimed his GOP opponent for governor John Cox \"parroted\" President Trump on the issue of family separations at the border.", "His statement, made right after a discussion of Cox’s policies, wrongly implies Cox supports separating immigrant families. Cox has repeatedly stated he opposes the policy.", "Cox and Trump have both said Congress should solve the issue, offering one parallel between the two. But even on this point, they’re not in lock-step. Trump has falsely blamed Democrats in Congress for forcing the separations, while Cox hasn’t made that specific charge.", "If anything, Cox has \"parroted\" one of Trump’s talking points about who should solve the problem. But he hasn’t backed Trump’s policy.", "Newsom’s statement contains an element of truth but ignores critical facts that would give a different impression.", "We rate it Mostly False.", "MOSTLY FALSE – The statement contains some element of truth but ignores critical facts that would give a different impression.", "Gavin Newsom, ABC7 interview, Aug. 17, 2018", "Nathan Click, spokesman, Gavin Newsom for Governor, email exchange Sept. 10, 2018", "Matt Shupe, spokesman, John Cox for Governor, email exchange Sept. 11, 2018", "San Francisco Chronicle, John Cox says he opposes family separations at border, echoes Trump's call for congressional action, June 19, 2018", "Sacramento Bee, Separating immigrant children from parents ‘congressional problem,’ John Cox says, June 18, 2018", "KGO Radio, GOP Gubernatorial Candidate John Cox on separating families and the gas tax repeal, June 20, 2018", "Bloomberg Politics, Republican Candidate talks California Governor’s Race, Aug. 3, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]