["This January 8, 2020, post featuring an image of a school uniform voucher issued for the 2020 academic year by the Sri Lankan Education Ministry.", "It has been shared more than 1,200 times.", "Below is a screenshot of the misleading Facebook post:", "The post's Sinhala-language caption translates to English as: “Half of the school uniform voucher has also been dealt with…”", "The Sinhala-language text in the image reads: “Our salute to the herd of sixty nine who got the voucher of 1000 reduced to a 525. Are you comfortable now...”", "The “herd of sixty nine” refers to the 6.9 million votes that were cast for the winning candidate Gotabaya Rajapaksa in the presidential election in November 2019. Here is an AFP report about the election.", "The photo was also shared on Facebook here, here and here, alongside a similar claim.", "The claim is false; Sri Lankan Education Minister Dullas Alahapperuma said the claim that the values of school uniform vouchers have been reduced “is a complete fabrication”. Another ministry official said the values of the vouchers have not changed in 2020.", "In a media briefing on January 13, 2020, Alahapperuma dismissed the claim that the value of school uniform vouchers had been slashed from Rs. 1,000 to Rs. 525. His comments can be viewed here in a video on the YouTube channel for The Independent Television Network, Sri Lanka’s state TV station, from the 13:32 to 14:32 mark.", "Speaking in Sinhala language, the minister says: “There is a major campaign carried out with a claim that the values of school uniform vouchers given to children have been slashed. This is a complete fabrication.”", "Sanjeewa Karaliyadda -- spokesman of  the Minister of Education, Sports and Youth Affairs -- told AFP via phone on January 17, 2020, that there had not been any reduction of school uniform voucher values in 2020.", "“A total of Rs. 1,500 million was allocated to issue school uniform vouchers this year and the vouchers were issued under different value categories depending on the grades, uniform needs as well as for the student monks. Rs. 525 is the value of the voucher issued to boys studying from grades 1 to 5 and the value was set in 2019 under the previous government. The same value has been continued this year for all vouchers,” Kayaliyadda told AFP during the phone conversation.", "The Education Ministry also sent AFP a chart listing the school uniform voucher values from 2016 to 2020.", "Below is a screenshot of the Sinhala-language chart:", "Below is the translation of the chart in English:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]