["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On Nov. 13, 2020, a few days after news outlets called the results of the 2020 election and projected that Joe Biden and running mate Kamala Harris would become the next president and vice president of the United States, a photograph supposedly showing the vice president-elect with talk show host Montel Williams started to circulate on social media:", "These are genuine images of Harris and Williams.", "These photographs were taken in May 2001 at the Eighth Annual Race to Erase Multiple Sclerosis at the Century Plaza Hotel in Century City, California. These photographs are both available via Getty Images. The uncropped versions also feature Williams' daughter Ashley:", "Talk Show Host Montel Williams, daughter Ashley Williams and Kamala Harris attending Eighth Annual Race to Erase Multiple Sclerosis on May 18, 2001 at the Century Plaza Hotel in Century City, California. (Photo by Ron Galella, Ltd./Ron Galella Collection via Getty Images)", "These images have popped up on the internet before. In August 2019, Williams took to Twitter to note that he and Harris briefly dated about 20 years ago. Williams also questioned whether the media would be reporting on Harris' dating history if she were a man.", "Williams wrote:", "Kamala Harris and I briefly dated about 20 years ago when we were both single. So what? I have great respect for Sen. Harris. I have to wonder if the same stories about her dating history would have been written if she were a male candidate?", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]