["By Angelo Fichera", "Posted on May 19, 2020", "A viral claim on Facebook erroneously tells users that “you will test positive” for COVID-19 if “you’ve gotten flu shots during the past ten years.” Vaccine and infectious disease experts told us that’s false, and the Food and Drug Administration says this hasn’t been observed in any authorized tests.", "Social media users are spreading a baseless claim that the flu vaccine will lead to a false-positive test result for COVID-19.", "“If you had a flu shot you will get likely get a false positive on a covid19 test,” a Facebook post claims. Other posts assert: “If you’ve gotten flu shots during the past ten years, you will test positive for the Wuhan strain of the Covid-19 flu.”", "That’s false, according to experts in vaccines and infectious diseases — and the federal agency that authorizes such tests.", "First of all, the reference to the “Covid-19 flu” is incorrect. COVID-19 is the disease caused by the novel coronavirus, and coronaviruses are distinct from influenza viruses.", "Flu shots are made using inactivated (not infectious) flu viruses or with a single gene from a flu virus in order to produce an immune response, according to the Centers for Disease Control and Prevention. Nasal spray flu vaccine is made with weakened flu viruses. It takes about two weeks after someone is vaccinated for the body to develop antibodies, which help protect against the flu.", "Dr. Paul A. Offit, director of the Vaccine Education Center at Children’s Hospital of Philadelphia, told us in a phone interview that the “PCR tests” — or polymerase chain reaction tests — used to identify active COVID-19 infections look for “genetic fragments that are unique to this coronavirus.”", "Offit said there’s no cross-reaction between influenza and the novel coronavirus known as SARS-CoV-2, meaning traces of influenza wouldn’t result in a positive result for COVID-19.", "Likewise, Offit said, antibody tests — or serological tests, which look for antibodies in the blood to determine past infections — “use proteins from this SARS-CoV-2, which do not cross-react with proteins from influenza.”", "“They’re structurally unique,” he said.", "A spokesperson for the Food and Drug Administration further told us that all FDA-authorized tests for COVID-19 are specifically checked for cross-reactivity with influenza virus or influenza antibodies and that, to date, there has been no such cross-reactivity observed for any of the tests. That check on tests diagnosing SARS-CoV-2 is important given overlapping symptoms between the two illnesses, the spokesperson added.", "Offit emphasized that flu vaccines do not contain coronaviruses, as we’ve previously explained. That misconception about flu vaccines may contribute to the erroneous notion that the flu shot leads to false positive COVID-19 results. (There’s also no evidence that the flu shot increases risk of COVID-19, as the CDC notes and as we’ve previously reported.)", "Most flu vaccines are manufactured using chicken eggs, but about 10% in the U.S. are cell-culture vaccines — which use Madin-Darby Canine Kidney, or MDCK, cells. Offit said those cells are “free from any virus.”", "Many of the posts advancing the false claim attribute it to Rashid Buttar, an osteopathic doctor who has spread conspiracy theories online. Buttar has been previously reprimanded (including last year) by the North Carolina Medical Board. In 2010, he accepted a reprimand and agreed to provide patients with a consent form disclosing that the “treatment and therapies that are to be provided by Dr. Buttar have not been proven effective by traditional research studies or conventional clinical trials.”", "Buttar made remarks about the false positives, similar to the Facebook claims, in a video that has appeared across social media platforms since April.", "“All the way back to 1984, all the way up to now, 2018, there are multiple studies that show that if you’ve had the flu shot — especially the trivalent flu shot — false positives on COVID-19 testing,” Buttar claims. Later, he adds: “The studies clearly show that if you’ve had a flu shot, you’re going to test positive for COVID-19.”", "But the novel coronavirus wasn’t discovered until late 2019, so there couldn’t have been studies between 1984 and 2018 that looked at false positive test results for the virus that causes COVID-19.", "The fact-checking website Health Feedback previously debunked the same claim when it was being circulated with references to a 2012 study in the peer-reviewed journal Clinical Infectious Diseases. The study compared the incidence of non-influenza respiratory viruses in children who had received the trivalent flu vaccine — which protects against three different flu viruses — with those who hadn’t received the vaccine.", "The study looked at four types of coronavirus that cause the common cold — not SARS-CoV-2. And, of 69 trivalent flu vaccine recipients, only one tested positive for a coronavirus — which Health Feedback notes is “insufficient to draw any causal association between the flu shot and coronavirus detection.”", "Dr. Lee Riley, professor and chair of the Division of Infectious Disease and Vaccinology at the University of California, Berkeley School of Public Health, told us in an email that “[f]lu vaccines will not cause false positive tests in people infected with SARS-CoV2. The influenza virus is very different from coronaviruses.”", "“If the influenza vaccine produced antibodies against SARS-CoV2, we would not be seeing so many severe cases of Covid19,” he said. “Are these people claiming that the flu vaccine also protects against Covid19?” (It doesn’t.)", "And Stephen S. Morse, an epidemiology professor at the Columbia University Medical Center, said he also was aware of no evidence to support the claim that flu shots would cause false positive results for COVID-19.", "“The fact that there were individuals who tested negative for the coronavirus suggests that this can’t be true, as a number of them must have had flu shots, certainly within the past ten years,” he said in an email.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Consent Order – Rashid Ali Buttar, D.O.” North Carolina Medical Board. 26 Mar 2010.", "“Key Facts About Seasonal Flu Vaccine.” U.S. Centers for Disease Control and Prevention. 28 Apr 2020.", "Landon, Emily. “COVID-19: What we know so far about the 2019 novel coronavirus.” University of Chicago Medical Center. 8 May 2020.", "McDonald, Jessica. “The Facts on Coronavirus Testing.” FactCheck.org. 10 Mar 2020.", "“Misconceptions about Seasonal Flu and Flu Vaccines.” U.S. Centers for Disease Control and Prevention. 25 Sep 2019.", "Morse, Stephen S. Professor of epidemiology, Columbia University Medical Center. Email to FactCheck.org. 15 May 2020.", "Offit, Paul A. Director, Vaccine Education Center, Children’s Hospital of Philadelphia. Phone interview with FactCheck.org. 18 May 2020.", "Riley, Lee. Professor and chair of the Division of Infectious Disease and Vaccinology at the University of California, Berkeley School of Public Health. Email to FactCheck.org. 18 May 2020.", "Teoh, Flora. “Claim that flu shot causes false positive results on COVID-19 tests is unsupported and misleading.” Health Feedback. 10 Apr 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]