["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In November 2020, as U.S. President Donald Trump's campaign team filed lawsuits alleging voter fraud to contest the results of the 2020 election — many of which were quickly dismissed — the president's supporters circulated their own unsubstantiated rumors on social media. One such rumor involved a picture they claimed showed Dallas Jones (some versions labeled Jones as President-elect Joe Biden's campaign director, and others as just a staffer) being arrested for voter fraud:", "The man pictured here is not Biden's campaign director, a Biden staffer, or a man named Dallas Jones. This is actually a photograph of actor Cuba Gooding Jr. after he was arrested in June 2019 for allegedly groping a woman at a New York City bar.", "A video of Gooding's arrest from The Associated Press can be viewed below:", "Gooding has plead not guilty to this and to several additional charges related to sexual assault. As of this writing, the case is still ongoing.", "While the viral photo does not show Biden's campaign director, a staffer, or a man named Dallas Jones being arrested for voter fraud, this claim wasn't completely conjured out of thin air.", "In September 2020, conservative activist Dr. Steve Hotze, as well as other Republican officials, filed a petition with the Texas Supreme Court in an attempt to halt early voting. That petition included accusations from two private investigators that local Democrats, including Dallas Jones, the Texas political director for Biden’s campaign, had engaged in ballot harvesting. We took a deeper look into these claims in this article, and found that the allegations were not supported by much evidence.", "Harris County Clerk Christopher Hollins said: \"I have no knowledge of any alleged scheme, and Hotze’s filing presents no evidence. The claims are irresponsible and unfounded.\"", "You can read more about the allegations against Jones here. For the purposes of this article, it bears repeating that Jones has not been arrested for voter fraud.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]