["The notice has been shared over 16,000 times since it was published here on Facebook on March 25, 2020.", "Part of the Urdu advisory translates to English as: “Important Announcement / If any of your child or member of the family tests positive for coronavirus, then they will be taken away by the staff of the health department. They will keep the patient in solitary and isolated from everyone. There will be no permission at all to meet the patient. Also you will not be able to take care of them.", "“If they get well, they will come back home, otherwise you will not be able to see them ever again. The health department will not allow you to hold a funeral and burial. You will only be informed that a member of your family has died and they will bury his body themselves. Please think.”", "The note carries the Pakistan Red Cresent logo, and credits the “Health Department (Government of Pakistan)” as the source.", "Below is a screenshot of the misleading Facebook post:", "The purported advisory has also been shared on Facebook here, here, here, here and here.", "However, these claims are false.", "The Pakistan Red Crescent Society took to Facebook on March 26 to refute the notice, saying the organisation has “no link to such misinformation”.", "“A few posts wrongly attributed to the Pakistan Red Crescent Society are circulating on social media. It is clarified that the PRCS has no link with such misinformation, nor are these in line with our mandate. The case is being forwarded to FIA [Federal Investigation Agency] Cybercrime Wing for necessary legal action,” the post reads.", "Below is a screenshot of the Pakistan Red Crescent’s post:", "Pakistan's health officials also have not barred families from holding funerals or burying relatives who have died of COVID-19.", "The country’s National Institute of Health has issued “safe and dignified” burial guidelines, which include wearing gloves and using disinfectants.", "COVID-19 has killed at least 58 people and infected 4,075 others in Pakistan as of April 8, according to official government records.", "Below is a screenshot of the COVID-19 case toll on the Pakistan goverment website:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]