["A photograph of Ravish Kumar has been shared on social media to mock the journalist by claiming he is heading for “biryani” during farmers’ protest. The dish has again become a topic of conversation after The Times of India’s Delhi bureau uploaded a video of farmers being served rice during protests, which the outlet claimed was biryani. The tweet below by @Bittu_Tufani received over 1,400 retweets.", "Some users have also alluded that Kumar is a biased journalist as flags of the Communist Party of India can be seen in the background.", "निष्पक्ष पत्रकारिता के महामहिम एक पार्टी के बैनर तले बिरयानी के लिए पदयात्रा करते नजर आए..क्या मोदी राज में एक निष्पक्ष पत्रकार को बिरयानी के लिए अब ये सब करना पड़ेगा..घोर निंदनिय 😷 pic.twitter.com/6OMBr15oOR", "— सचिन नाईक ( TPN ) (@reaal_sachin) December 1, 2020", "Several others have shared the picture.", "Twitter account @liberal_slayerr had shared the image in August when it garnered over 3,400 retweets.", "Arnab Goswami is biased towards BJP. pic.twitter.com/oTyJ9psp8y", "— Liberal Slayerr (@liberal_slayerr) August 3, 2020", "A person in the background can be seen sporting a shirt which has a sticker that says ‘AIKS’ which stands for All India Kisan Sabha, affiliated to the Communist Party of India.", "A keyword search led us to an NDTV broadcast from November 29, 2018 when farmers’ had held a protest and Ravish Kumar was among the journalists covering the movement. He can be seen wearing the same clothes in the video.", "The image currently viral was also shared in 2018.", "NDTV Ravish Kumar Covering Kisan Rally !!!! @ravishndtv pic.twitter.com/Pa25Mr5TFq", "— Shilpa Bodkhe (@BodkheShilpa) November 30, 2018", "Farmers’ groups from across the country held protests against government policies in November 2018. “Despite PM Modi’s recent statements that he had taken initiatives to solve farmers’ distress, the issues remain. For this betrayal, farmers will give Modi government and the BJP a befitting reply in 2019 election,” Ashok Dhawale, AIKS president, said at a press conference.", "Over two lakh farmers had assembled for the protests demanding a “special session of parliament dedicated to discussion around the agrarian distress” apart from “increased minimum support prices (MSP) and a one-time unconditional loan waiver”, reported The Wire.", "Therefore, a photograph of Ravish Kumar covering farmers’ protest two years ago has been revived to mock the journalist.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]