["A video showing a stadium full of people cheering and celebrating is being shared on social media. A fan account of Naeem Bokhari, a Pakistani television personality and lawyer, posted the video with the message “USA right now @ImranKhanPTI #PMIKInUSA”. The video had over 2,000 retweets and 8,000 likes at the time of writing this article. It has attracted nearly 3 lakh views.", "USA right now 😍😍😍😍@ImranKhanPTI #PMIKInUSA pic.twitter.com/xGswlK67i2", "— Naeem Bokhari🇵🇰 (@IM_Bukhari1) July 21, 2019", "This video has been tweeted by many other users as well. It is noteworthy that Pakistani Prime Minister Imran Khan is currently on a 3-day trip to the US.", "A close look at the video shows key elements that indicate that it has nothing to do with Imran Khan.", "1. Face paint – several people in the video have painted their faces which is typical of a sporting event. The prominent colours visible in the video are white, red and green.", "2. Flags – same as the colours of the face paint, several people in the video can be spotted waving red, green and white coloured flags. If one notices carefully, the red is in the middle in the shape of a crescent.", "The flag of Algeria has the above-mentioned colours and a red coloured crescent and a star in the middle. This hinted that the sporting event might be related to a tournament of which Algeria was a part.", "Using these clues, Alt News performed a keyword search on Google. We found out that Algeria had a football game against Senegal on July 20, 2019. It was the final game in the Africa Cup of Nations, a biennial international men’s football championship. We found a Twitter account that posted the same video with the message – “This is how Algerian fans celebrated their African Cup of Nations win last night. The final was played in Cairo, Egypt. This stadium is in Algiers, Algeria. Incredible”. The tweet credited Maher Mezahi, an Algerian journalist who covers football in North Africa, for the video. By looking at the journalist’s Twitter account, we found the video that he uploaded with the caption – “This is how Algerian supporters watched the match at Stade 5 Juillet today.”", "This is how Algerian supporters watched the match at Stade 5 Juillet today. pic.twitter.com/rGWJPq5fIg", "— Maher Mezahi (@MezahiMaher) July 20, 2019", "The video being shared on social media is unrelated to Pakistani PM Imran Khan’s recent visit to the US. It shows celebrations by Algerian supporters after their country won the African Cup of Nations against Senegal on July 20, 2019. Algerian supporters watched the match held in Cairo, Egypt from Stade du 5 Juillet Stadium in Algeria.", "During his US trip, Imran Khan reportedly addressed a crowd of overseas Pakistanis in Washington DC. Up to 30,000 people had gathered for the event, a video of which was shared by Pakistan Tehreek-e-Insaf’s official Twitter handle. This further proves that the viral video is unrelated to Khan’s visit.", "The moment when PM Imran Khan arrived. A magical reception for a people’s leader. The countdown, the arrival, the echoes of the crowd. This is the stuff of dreams. The dreams of Naya Pakistan.", "#PMIKJalsaInUSA pic.twitter.com/qsaX8U3wxB", "— PTI (@PTIofficial) July 21, 2019", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]