["The posts, which can be seen here and here, contains a screenshot and a video that they claims show men who have been arrested over the March 2019 killing and mutilation of a 16-year-old girl in the southern city of Lapu-Lapu.", "Below is a screenshot of one of the posts:", "The misleading posts' headline, when translated to English, says: “3 suspects who killed the 16-year old rape victim in Lapu-Lapu city who was also skinned have been arrested”.", "The killing of girl has attracted widespread media attention in the Philippines, for example here, with President Rodrigo Duterte expressing anger over the incident.", "A reverse image search traced the photo of the three men used in the misleading posts back to this YouTube video about the arrest of six young Filipino men in 2018 over claims they had smoked marijuana.", "The image used in the misleading post appears at 5:52 in the video. It is a screengrab which has been flipped from the original.", "AFP did a fact-check post on the young men in the marijuana case.", "Using search engine aggregator IntelTechniques, AFP traced the pixelated image in the misleading post to similar pictures of the murdered girl that have appeared in the Philippine media, for example here.", "Below is a screengrab of the photo of the victim that appeared in Philippine media:", "GRAPHIC IMAGE", "Show", "Hide", "The photo in Philippine media and the misleading post both show a person lying on their left side, with the right arm crossed over the chest in a grassy area.", "The misleading post also contains a video.", "Below is a screengrab:", "Clicking on the video leads to a Philippine news programme report which was uploaded to YouTube on July 14, 2018.", "The news report is about the July 2018 arrest of three suspects over a rape case in the the central province on Bulacan.", "The police city director for Lapu-Lapu told AFP that they had not arrested any suspects over the March 2019 murder and skinning case.", "“No, we have not done any arrests yet. We are still pursuing them, hunting them down,” Police Senior Superintendent Limuel Obon said in a phone interview on March 13, 2019.", "The post has been shared over 200 times.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]