["About this rating", "'I took an arrow in the knee,' says the prospective groom.  Or does he?", "Pondering the reasons behind many of our familiar traditions whose original purposes have been long since lost in the mists of time is a favorite pastime of many. The subjects of marriage and weddings are a common target of such ruminations, as they're associated with many centuries-old rituals that are arcane to modern audiences.", "One such example is a popular meme that seemingly explains why marriage engagements traditionally begin with the one initiating the proposal's offering up a ring from a kneeling position:", "On this subject, however, the 'I took an arrow in the knee' meme is just a bit of humor. One searches in vain to find any references in Norse languages or mythology that links the phrase 'took an arrow in the knee' to the concept of marriage, or that ties any form of injury to the tradition of getting down upon bended knee to propose to a prospective spouse.", "The phrase \"I took an arrow in the knee\" is actually of fairly recent vintage, a line popularized by the role-playing video game The Elder Scrolls V: Skyrim, as noted by the Know Your Meme web site:", "In The Elder Scrolls V: Skyrim, the town guard non-player characters (NPCs) have several stock lines they will repeat when the player walks near them, including a bewildered statement about “curved swords”, a patronizing statement about “sweetroll” theft, and the melancholy reminiscing of the past “I used to be an adventurer like you, then I took an arrow in the knee.”", "The repetition of this stock line throughout the game led the players to reference it in gaming forums and imageboards.", "Indeed, here is the \"I took an arrow in the knee\" line as it is uttered multiple times in The Elder Scrolls V: Skyrim", "https://youtu.be/vncIBREXCwU\n\nWhere did the tradition of getting down upon one's knee to propose marriage come from, then? No definitive historical explanation exists, but as many sources have posited, the practice is likely related to customs involving kneeling as a demonstrative act of both supplication and respect, two aspects that a spouse-to-be would likely do well to exhibit to a potential mate:", "During the Middle Ages, chivalry was not yet dead and formal courtship was the medieval version of modern-day dating. Kneeling was also the protocol for many ceremonial rituals and rites of passage, including those of the romantic kind. Medieval artwork and literature shows knights genuflecting before their feudal lord as a sign of honor and respect, or kneeling in front of a noblewoman to express their eternal servitude and admiration in a show of “courtly love.”", "But medieval rituals aren’t the only possible explanation; religion may play a role as well. Many faiths, like Christianity and Islam, have their worshippers kneel in prayer to express their devoted service and everlasting respect for their God.", "Today, kneeling has connotations of complete submission, giving yourself to the mercy of the other person who has the power to do whatever the heck they like. So when we propose in this way, we’re showing that we truly trust our partner, and that we’re completely committed to intertwining our life with theirs.", "It’s also a respectful thing, which is nice, and shows that we’re willing to break down our walls (as kneeling is placing yourself in a vulnerable position with all power to the person standing) and be truly intimate.", "In short, offering a ring upon bended knee to propose marriage is a symbolic manner of expressing a fervent desire for a positive response, and of demonstrating that your beloved is deserving of your honor, respect, and love -- not because of an old arrow injury.", "Lewis, Ashley.   \"This Is Why You Get Down on One Knee to Propose.\"\r\n    Reader's Digest.   20 February 2017.", "Scott, Ellen.   \"Why Do We Get Down on One Knee When We Propose?\"\r\n    Metro.   20 March 2016.", "Know Your Meme.   \"I Took an Arrow in the Knee.\"\r\n    Accessed 7 May 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]