["About this rating", "A photograph supposedly showing a group of women wearing shirts bearing the phrase \"I'm a Racist Bitch\" was widely circulated on social media in September 2019. Many of the people sharing this image did so with the claim that these women were supporting U.S. President Donald Trump and they were \"proud\" to be racists:", "Proud Racist Bitches", "Don't oversleep on any election day. The POTUS has normalized racism, and racists are out of the closet. Know your enemy! #VoteBlue2020", "This is not a genuine photograph of a group of women wearing \"I'm a Racist Bitch\" T-shirts but a digitally altered image. The original photograph featured the slogan \"I'm a Trump Girl.\"", "This photograph was taken during a Trump rally in Greenville, North Carolina. Gerri McDaniel, the director of Trump's campaign efforts in South Carolina, shared it on Twitter.", "Women for Trump were on the move in Greenville, NC at the Trump Rally. So much support it was hard to not be excited.#WomanforTrump @realDonaldTrump @parscale @dbongino @seanhannity @thehill @IvankaTrump pic.twitter.com/rpsebv60Ad", "— Gerri McDaniel (@GeekGirl2u) July 18, 2019", "A second photograph featuring these same women in the same \"I'm a Trump Girl\" shirts at the Trump rally in Greenville is available via Alamy.", "This doctored image was likely created to promote a genuine product. We've come across several other \"fake shirt\" photos that featured real products available for sale. Typically, these fake shirts are photoshopped onto celebrities such as Aaron Rodgers or Bill Murray. In this case, a photograph of a group of Trump-supporting women wearing \"I'm a Trump Girl\" shirts was doctored in an apparent attempt to promote an \"I'm a Racist Bitch\" shirt that was genuinely available on the website Teespring:", "As of this writing, it seems that this shirt is no longer available for sale on Teespring.", "Myrtle Beach Online.   \"Local Woman Named Co-Director of Trump’s S.C. Campaign.\"\r\n    26 August 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]