["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A major catalyst in the run up to the deadly clashes in Charlottesville, Va., was the city’s decision to remove a statue of Confederate Gen. Robert E. Lee.", "As the nation reeled from the violence, some political analysts sought to place Confederate symbolism in a broader historical context to help explain the turmoil around the Aug. 11-12 weekend.", "\"The idea of putting up (Confederate) monuments actually didn’t happen right after the Civil War. It happened during the 1960s,\" MSNBC analyst Joy Reid said on NBC’s Meet The Press, Aug. 13, 2017.", "Reid went on to say that Confederate symbols were political statements aimed at African Americans.", "American history features two periods when Confederate symbolism spiked: around the turn of the 20th century and the civil rights movement of the 1950s and '60s. As a group, most Confederate statues went up in the earlier period.", "A sharp uptick in the construction of Confederate monuments took place from the late 1890s up to about 1920. That’s according to a Southern Poverty Law Center study that took a nationwide inventory of the more than 1,500 Confederate symbols in public spaces.", "This chart from the study shows the increased pace of construction around the turn of the 20th century, with blue dots signifying monuments on courthouse grounds, red dots indicating other sites (including monuments) and green dots representing schools.", "Several cross-currents explain the explosion of Confederate symbolism in this period.", "This was an era of generational change during which Civil War veterans, dying of old age, were venerated by their children and grandchildren, experts told us.", "\"Organizations like the United Daughters of the Confederacy and the Sons of Confederate Veterans came into being,\" said Charles S. Bullock, III, a professor of public and international affairs at the University of Georgia. \"Civil War veterans were honored in parades. There is a Confederate Memorial Day which pre-dates the National Memorial Day.\"", "But as a victorious North fixed its gaze on a prosperous future, the American South was mired in poverty that would persist for generations. The monuments were a way to look back to an idealized past.", "\"Tributes to the Confederacy — placing statues, naming streets and other public facilities — were part of the Lost Cause ideology that focused on an idyllic era of stately mansions, beautiful women and gallant Confederate officers,\" Bullock said.", "But the monuments also implicitly symbolized slavery and white violence, the experts said.", "\"On the surface, they were memorials to the Confederacy and their heroes,\" said Karen L. Cox, a professor of history at the University of North Carolina-Charlotte. \"Yet, they were also built during a period of racial violence and strong beliefs about Anglo-Saxon (i.e. white) supremacy.\"", "\"The fact that they were placed on the grounds of county and state courthouses was intentional,\" she added. \"The message: white men are in charge.\"", "The period between 1890-World War I saw whites reassert control over the South by enforcing Jim Crow laws, taking control of southern governments and systematically disenfranchising and disempowering African Americans, said Jonathan Leib, a professor of geography and chair of the department of political science and geography at Old Dominion University.", "Racial segregation also got a major endorsement at the federal level during this era. In 1896, the U.S. Supreme Court handed down its landmark decision in Plessy vs. Ferguson which upheld the constitutionality of state laws that racially segregated public facilities that were \"separate but equal.\" (Nearly 60 years passed before the Court would declare such segregation \"inherently unequal.\")", "\"This was also a moment when the nation itself began to repair the wounds of the late war by agreeing on the inferiority of African Americans,\" said Khalil Gibran Muhammad, a professor of history, race and public policy at Harvard Kennedy School. \"Racial segregation became the law and custom of the nation at precisely the moment when many of these monuments were built.\"", "Another monument born roughly of this era, a statue of Robert E. Lee installed in Charlottesville in 1924, now figures as a present-day flashpoint.", "The second period when Confederate symbols exploded was the civil rights era.", "But it was the Confederate flag — not monuments — that gained prominence during this time, as Reid later clarified in an email to PolitiFact and in a Aug. 15 appearance on MSNBC.", "The flag became a symbol of opposition to desegregation.", "\"It was the choice to fly Confederate flags, more so than the building of new statues, on government property that became a popular show of resistance during the civil rights era,\" Muhammad said. He added the decision to fly the flag was a clear sign of protest against the federal government’s growing enforcement of civil rights.", "It was during this era when the Ku Klux Klan came to embrace the Confederate flag, notes the Southern Poverty Law Center.", "Reid said, \"the idea of putting up (Confederate) monuments actually didn’t happen right after the Civil War. It happened during the 1960s.\" She added that Confederate symbols were political statements aimed at African Americans.", "Reid's comment that Confederate symbols are political statements aimed at African Americans is backed up by history, say experts.", "But she is wrong that Confederate monuments were built during the civil rights era. Roughly 75 percent were erected before then, according to a comprehensive study of Confederate symbolism. It was during the civil rights era that the Confederate flag gained prominence, which she later clarified.", "We rate her statement Mostly False.", "NBC’s Meet the Press, transcript, Aug. 14, 2017", "Southern Poverty Law Center, \"Whose Heritage? Public Symbols of the Confederacy,\" April 21, 2016", "Smithsonian Magazine, \"A Controversial Museum Tries to Revive the Myth of the Confederacy’s ‘Lost Cause,’ \" Oct. 26, 2016", "PolitiFact, \"Confederate flag wasn't flown at South Carolina statehouse until 1961, pundit claims,\" June 22, 2015", "Email interview with Khalil Gibran Muhammad, professor of history, race and public policy at Harvard Kennedy School, Aug. 14, 2017", "Email interview with Jonathan Leib, professor of geography and chair of the department of political science and geography at Old Dominion University, Aug. 14, 2017", "Email interview with Karen L. Cox, a professor of history at the University of North Carolina-Charlotte, Aug. 14, 2017", "Email interview with Euan Hague, professor and chair of Department of Geography at DePaul University, Aug. 14, 2017", "Email interview with Charles S. Bullock, III, a professor public and international affairs at the University of Georgia, Aug. 14, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]