["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In March 2021, just days after the U.S. Food and Drug Administration approved the use of a single-dose immunization developed by Johnson & Johnson to curb the COVID-19 outbreak, Catholic leaders and evangelicals cautioned followers against accepting the new vaccine because of its alleged ingredients.", "According to a March 2 statement by leaders of the U.S. Conference of Catholic Bishops, for example, the J&J vaccine was \"developed, tested and is produced with abortion-derived cell lines,\" raising ethical concerns for church followers who do not believe in or want to support abortions.", "Another advisory by the Archdiocese of New Orleans called the immunization \"morally compromised.\"", "The underlying claim, however, was a misrepresentation of facts. The vaccine formula does not contain aborted fetal tissue. Rather, virologists created J&J's vaccine — and many other immunizations to fight viral outbreaks — in part by growing a modified virus in cells originally derived from embryonic tissue from an abortion performed decades ago. However, that human cell line is physically and chemically separate from ingredients that end up in the final vaccine product.", "\"There are no fetal cells used in any vaccine production process,\" Dr. Michael Head, of the University of Southampton, told BBC.", "We explain more about the vaccine production process and final product, sourcing scientific journals and infectious disease experts, below.", "All COVID-19 vaccines — no matter the sponsor (Pfizer, Moderna, J&J, etc.) — attempt to train people's immune systems into producing antibodies that can fight the SARS-CoV-2 virus if necessary.", "How the different vaccines achieve that goal, however, varies. For example, J&J's competitors, Pfizer-BioNTech and Moderna, use mRNA technology.", "In J&J's case, the vaccine takes the form of what's called a viral vector to attack one specific part of SARS-CoV-2. Similarly, the AstraZeneca COVID-19 immunization (which the FDA has not approved, as of this writing) uses the same type of technology, Dr. Amesh Adalja, an infectious disease scholar at Johns Hopkins who works on pandemic policy, told Snopes.", "\"Once a person gets the shot, their cells receive the 'directions' from the vector, telling them how to create copies of the spike protein,\" the medical institution explains of the J&J formula on its website. \"As the spike proteins accumulate in the body, the immune system is alerted to their presence and creates antibodies and an immune reaction to fight them.\"", "In J&J's own words, according to an email from a spokesperson for the company to Snopes:", "Our COVID-19 vaccine is made using a harmless cold-like virus into which we insert a piece of the coronavirus spike protein. It teaches the immune system to recognize the COVID virus and protect against infection.", "Our vaccine contains no fetal tissue whatsoever.", "It is true, however, that in order to create the materials of the genetically-modified vector, otherwise known as the adenovirus, scientists in labs used the descendent of a single cell from an aborted fetus that is decades old.", "Like we reported in late 2020 (while investigating the same question for AstraZeneca vaccine), in order to engineer these type of immunizations mass production, the lines of human embryotic cells serve as miniature \"factories\" where the adenoviruses multiply quickly, as explained by Science Magazine.", "The adenovirus eventually grow and multiply until the embryonic cells burst. After that, scientists remove what's left of the human cell material through a rigorous purification process.", "“What happens is they grow the virus through those [human] cells. They then harvest the virus, filter all of that material. What you get in your vaccine is actually the virus that's been engineered,” Adalja told Charlotte's NBC-affiliate news station.", "So, in short, the human cell lines do not end up in the final J&J vaccine product but rather serve as incubators to create biological material to fight the virus that causes COVID-19 symptoms.", "\"This cell line enables us to rapidly manufacture hundreds of millions of single-shot COVID vaccines that can be transferred and stored without the need for deep freezing,\" J&J told Snopes.", "Furthermore, it was erroneous to think virologists took the above-referenced embryonic cells — which scientists call PER.C6 in J&J's process — directly from aborted fetal tissue, or that J&J relied on a steady supply of aborted fetuses to make its shots.", "Instead, PER.C6 cells are the multi-generational offspring of a colony of a fetal cell line that originated with one 18-week old fetus aborted in 1985 and serve various purposes in biology research.", "\"[It’s] important to realize that fetal cell lines have been used (and will continue to be used)  in many biotechnological applications,\" Adalja wrote in an email to Snopes.", "For those reasons, we rate this claim \"False.\"", "While testing COVID-19 vaccine formulas, J&J's competitors, Pfizer-BioNTech and Moderna, also made use of human fetal cells. The Catholic church, however, considered their process less morally egregious than J&J's, according to the statement by the U.S. bishops. It read:", "[It] is morally acceptable to receive Covid-19 vaccines that have used cell lines from aborted fetuses in their research and production process.’[1] However, if one can choose among equally safe and effective COVID-19 vaccines, the vaccine with the least connection to abortion-derived cell lines should be chosen. Therefore, if one has the ability to choose a vaccine, Pfizer or Moderna’s vaccines should be chosen over Johnson & Johnson’s.", "In other words, the bishops recirculated the Vatican's message — people have the moral duty to protect their own health and should get vaccinated to prevent the spread of COVID-19 — and, as a result, people should not hesitate to accept Johnson & Johnson shots if they're the only type of immunization offered to them.", "One day after the statement, NPR reported a leader of a Catholic hospital in the Maryland suburbs said providers were indeed distributing 500 doses of the J&J vaccine, regardless of the fetal cell debate.", "\"Cell lines are not a primary concern when you have the greater issue of saving lives,\" Rev. Kirtley Yearwood said.", "In reality, Americans who are eligible for vaccinations generally have no choice of which vaccine they receive. Federal, state, and local health authorities decide how, and where, to distribute the shots. As of this writing, the U.S. federal government was preparing to purchase 100 million doses of the J&J as part of its effort to provide COVID-19 vaccinations to all Americans who want them by May.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]