["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Barack Obama spoke from the White House after the Supreme Court delivered its ruling that upheld his signature health care law.", "After the Supreme Court upheld the health care bill he’d signed into law, President Barack Obama applauded the decision in a speech at the White House. In that speech, Obama responded to critics, including Mitt Romney, who say the law could force many Americans off their health care plans.\n\n\"If you're one of the more than 250 million Americans who already have health insurance, you will keep your health insurance,\" Obama said. \"This law will only make it more secure and more affordable.\"\n\nThis is a variation on a line Obama has used before, and which we have rated in the past.\n\nFor instance, at a town hall meeting in New Hampshire on Aug. 11, 2009, Obama said, \"If you like your health care plan, you can keep your health care plan.\" We found that overly optimistic given the bill’s details at the time, so we rated it Half True.", "Later, Obama spoke more specifically. In a speech to a joint session of Congress in September 2009, Obama said, \"If you are among the hundreds of millions of Americans who already have health insurance through your job, or Medicare, or Medicaid, or the VA, nothing in this plan will require you or your employer to change the coverage or the doctor you have.\" We concluded that nothing in Obama’s proposal proactively forced such changes, and the bills clearly intended to leave much of the current health care system in place. So we rated the claim True.", "The claim Obama made after the Supreme Court decision on June 28, 2012, was a broader statement, and as a result, it’s less accurate.\n\nFirst, a March 2012 study by the Congressional Budget Office, the nonpartisan number-crunching arm of Congress, projected that 3 million to 5 million fewer non-elderly people would obtain coverage through their employer each year from 2019 through 2022 than would have been the case before the law was passed. Including those with individually purchased policies enlarges that decline by an additional 1 million to 3 million Americans.\n\nCBO’s estimate is broadly in line with a number of other independent estimates. A study by the Urban Institute projected a decline of about 500,000 people. The Lewin Group predicted a decline of about 3 million people. The Centers for Medicare and Medicaid Services actuary pegged the number at about 1 million fewer people. And the RAND Corp. projected that about 4 million more individuals would be covered by employment-based coverage by 2016.\n\nWhy are these changes occurring? Some will be made voluntarily by Americans seeking better health care options outside of their employer’s plan, but we think it’s reasonable for Obama to ignore these changes in his calculation.\n\nOther switches will be involuntary. As we have previously noted, many Americans already lose their current health plan for reasons that have nothing to do with the new law. Your employer may change insurance carriers, for instance, or your insurance carrier may unilaterally modify the terms of your plan.\n   \nHow common is this? The Medical Expenditure Panel Survey, sponsored by the U.S. Department of Health and Human Services, found that in 2007, just over 14 percent of the entire U.S. population \"switched\" health insurance. However, this underestimates the rate of switching, because the study included people of all ages (including those covered by Medicare, who rarely switch) and because it doesn’t count a switch from one plan to the other within the same insurance company.\n\nThe latter scenario is common. Mercer, a private consulting firm, found that in each of the years from 2005 to 2008, roughly a quarter of companies said they made changes to their plans that would result in employees paying a greater share of the cost. In 2009 and 2010, it rose to one-third.\n\nThe number becomes substantial if you add up the workers who lose coverage entirely; who change jobs (voluntarily or involuntarily); who work for companies that change insurance carriers or adjust plan terms significantly; or whose employer’s insurance carrier is merged or bought out. And knowing that many workers every year are already required to change plans provides a different impression than what Obama is suggesting.\n\nOur ruling\n\nObama has a reasonable point: His health care law does take pains to allow Americans to keep their health plan if they want to remain on it. But Obama suggests that keeping the insurance you like is guaranteed.", "In reality, Americans are not simply able to keep their insurance through thick and thin. Even before the law has taken effect, the rate of forced plan-switching among policyholders every year is substantial, and the CBO figures suggest that the law could increase that rate, at least modestly, even if Americans on balance benefit from the law’s provisions. We rate Obama’s claim Half True.", "White House, remarks by the president on the Supreme Court ruling on the Affordable Care Act, June 28, 2012\n\nPolitiFact, \"Barack Obama promises you can keep your health insurance, but there's no guarantee,\" Aug. 11, 2009\n\nPolitiFact, \"Health insurance stays in place under reform proposals,\" Sept. 9, 2009\n\nMitt Romney, remarks after Supreme Court decision on the Obama health care law, June 28, 2012\n   \nCongressional Budget Office, \"CBO and JCT’s Estimates of the Effects of the Affordable Care Act on the Number of People Obtaining Employment-Based Health Insurance,\" March 2012\n   \nCenter for Medicare and Medicaid Services Office of the Actuary, \"Estimated Financial Effects of the Patient Protection and Affordable Care Act, as Amended,\" April 22, 2010\n       \nUrban Institute, \"America Under the Affordable Care Act,\" December 2010\n       \nRAND, \"The Effect of the Affordable Care Act on Enrollment and Premiums, With and Without the Individual Mandate,\" 2012\n       \nLewin Group, \"Patient Protection and Affordable Care Act (PPACA): Long Term Costs for Governments, Employers, Families and Providers,\" June 8, 2010\n   \nU.S. Census Bureau Survey of Income and Program Participation, \"Dynamics of Economic Well-Being: Health Insurance 1996-1999,\" August 2003\n       \nBureau of Labor Statistics, \"Job Openings and Labor Turnover Survey\" (main search page), accessed Feb. 2, 2011\n       \nPolitiFact, \"Reince Priebus says health care law could mean 'as many as 20 million Americans could lose their employer-based insurance,'\" March 23, 2012\n   \nPolitiFact, \"Rep. Blake Farenthold says health care law will force 70 percent of workers to lose their current plan,\" Feb. 2, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]