["The post was published here on Facebook on April 26, 2019. It has been shared more than 60,000 times.", "The post's Thai-language caption translates to English in part: “A Taiwanese senior doctor has passed on this method of helping patients with hemorrhagic stroke.", "“The method to conduct first aid (release the blood). If you have a hypodermic syringe, that would be best. If you don’t have it you can use the sewing needles to all the fingers’ of the patient to let the blood out. A few minutes later, the patient will be recovered.", "“If the patient has a crooked mouth, pinch the patient’s ears and inject needles into ear lobes to let the blood out, and then the patient will be recovered… Wait until the patient is recovered, and then you can send his/her to the doctor.”", "A hemorrhagic stroke is a condition that results from a ruptured blood vessel in the brain which can cause “lasting brain damage, long-term disability, or even death”, according to the US Centers for Disease Control and Prevention.", "A similar claim was also shared here, here and here on Facebook.", "The claim is false.", "Dr. Adichan Chuajinda, a specialist doctor at Thailand’s Phra Nangklao Hospital’s Department of Internal Medicine said the claim was “absolutely false”.", "During a phone conversation with AFP on May 26, 2020, he said: “It is absolutely false. Just because you have symptoms such as crooked mouth, and the weakening of muscles doesn’t mean you have a hemorrhagic stroke. The best thing to do is to send the patient to the hospital immediately and the doctor will need to conduct an X-ray test to diagnose the symptoms and treat the patients accordingly.”", "Thai Health Promotion Foundation, an autonomous government agency that promotes healthy living also published this report on February 26, 2018 which advises against pricking a hemorrhagic stroke patient with needles.", "It reads, in part: “Warning signs of hemorrhagic stroke including weakening of legs, inability to walk and talk, severe headache. If you find a close person with similar symptoms, please take him/her to the hospital as soon as possible. Don’t use needles to inject the patient’s body because it could cause death.”", "AFP Fact Check debunked a similar false claim about treating stroke victims with needles here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]