["About this rating", "English is often tabbed as a notoriously difficult language to learn, in part because it's rife with irregularities in spelling and pronunciation, thanks to centuries of English speakers' assimilating words from other languages.", "It doesn't help that in written English notable differences in spelling exist between the United States and the United Kingdom. For example, the British write centre, while Americans write center. The British write flavour, while Americans write flavor. The British write defence, while Americans write defense, and so on.", "According to the Oxford Dictionaries website, this variation is mainly because British English has tended to retain the original spelling of words borrowed from other languages, while American English favors simplified spellings reflecting the way the words are actually pronounced.", "A Facebook meme first shared in October 2018 purported to explain more precisely why this divergence between British English and American English took place, essentially boiling the issue down to commerce:", "The claim that Americans simplified the spellings of words because newspapers charged by the letter for advertising also turned up on Twitter:", "TIL American newspaper ads charged by the letter, so a lot of people would eliminate unnecessary letters like the second L in “cancelled” or the U in “colour”. Some of these spelling changes were used so often that they stuck, and now Americans just spell some words differently.", "— BOOramasa (@Muramasa_SSB) October 6, 2018", "Before addressing this notion that American spelling conventions were dictated by the cost of advertising, we need to clarify a point about canceled vs. cancelled. Although canceled is listed as the preferred spelling of the past tense of cancel (and canceling the preferred spelling of its present participle) in American dictionaries, cancelled and cancelling are nonetheless recognized as legitimate variants. In such cases the preferred spelling is usually deemed the \"correct\" spelling (in school classrooms, publishing style guides, and spellchecking software, for example), but that standard is not an absolute. This touches on a higher truth about spelling and language in general, namely that \"correctness\" is in no small part a matter of convention.", "As to the central question of why certain British and American spelling conventions are different, the proposed answer under consideration -- that Americans adopted simplified spellings as a matter of \"frugality,\" as it were -- rests on the ostensibly factual claim that newspapers at one time charged advertisers by the letter. We have found zero evidence to support that claim.", "What we found, on the contrary, is that newspapers in early America typically charged advertisers according to the amount of space the copy took up. This was true from the very earliest days of the press in colonial America, according to an 1897 retrospective in the trade magazine Printers' Ink:", "No newspaper and no advertising existed in America until 1704, with the exception of a single number, immediately suppressed by the authorities of Massachusetts. In that year John Campbell, of Boston, began the Boston News-Letter, and with it American advertising. The only specimen of this new art of publicity in the first number is Mr. Campbell's own notice to the public that he has begun issuing a newspaper, and that advertisements will be \"inserted at a reasonable rate, from twelve pence to five shillings, and not to exceed.\"", "By the early 1800s, says Margaret A. Blanshard's History of the Mass Media in the United States (2013), newspapers had begun pricing their advertising space based on the number of lines an ad contained. One example cited is the New York Sun, launched by Benjamin Day in 1833:", "Advertising in the Sun cost $30 a year for a \"square\" of 10 lines a day. This equaled one cent a line. Day wrote most of the copy, which in most cases consisted of 10 lines or less. The advertisements were similar to those in other newspapers, except for their size. Day realized the importance of the want ad, which had been used by advertisers in England. He solicited these small advertisements from businesses and readers and placed them under the heading \"Wants.\" Each entry, two or three lines in length, cost 50 cents.", "By the turn of the twentieth century, Blanshard's book says, it was standard practice to charge by the line or by the word for any text-based, non-display advertising. We found no reference in that or any other source to publishers' charging by the letter.", "For the real story behind the differences in American and British spellings, we turn to a brief essay by SUNY Stony Brook professor Elyse Graham (who is currently authoring a history of the English language in New York City):", "Have you ever wondered why Americans use the spellings honor, neighbor, valor, while the British use honour, neighbour, valour? Has a computer spellchecker or human copy-editor ever stopped your wingèd prose as it travelled (traveled) up through the clouds of Parnassus and subjected it to a tedious extra round of labour (labor), changing cheque to check, theatre to theater, and gaol to jail (or the other way around)?", "You can lay the blame for this offence (offense) on Noah Webster, an American lexicologist of the 18th and 19th centuries who wrote and published the first American dictionary. Webster advocated far-reaching reforms in written American English, saying: \"Let us then seize the present moment, and establish a national language, as well as a national government.\" Not all of his dreams for American English took hold, but enough of them did to make the first rip in a tradition that eventually tore apart -- to become, in the quip of George Bernard Shaw, \"two nations divided by a common language.\"", "Webster published his first dictionary, titled A Dictionary of the English Language Compiled for the Use of Common Schools, in the U.S., in 1806. In the years leading up to this work, Webster had been publishing books and treatises that argued Americans should \"simplify\" their spelling by matching letters more closely with phonemes: for example, by removing silent letters, removing double letters, and replacing the soft \"c\" with an \"s.\" Webster reasoned that simplifying spelling would ease schooling for young people, discourage variant dialects among their elders, allow foreigners to acquire the language more easily, and give American printers a boost in the marketplace, since every British text would have to be reprinted for American readers.", "Not all of Webster's ideas for spelling reform took hold -- indeed, he rejected some of those ideas himself (such as substituting hed for head, frend for friend, and speek for speak, etc.) -- but his efforts to simplify the written language, promulgated by the dictionaries he himself published, had a deep, long-lasting impact that is still felt today.", "Algeo, John [ed.].   The Cambridge History of the English Language.\r\n    Cambridge: Cambridge University Press, 2001.   ISBN 9780521264792.", "Blanchard, Margaret A. [ed.].   History of the Mass Media in the United States: An Encyclopedia.\r\n    Abingdon: Routledge, 2013.   ISBN 9781135917425.", "Graham, Elyse.   \"Noah Webster, American Identity, And the Simplified Spelling Movement.\"\r\n    Oxford Dictionaries.   7 May 2018.", "Harbeck, James.   \"How the English Language Became Such a Mess.\"\r\n    BBC News.   8 June 2015.", "Logan, Conrad T.   \"Noah Webster's Influence on American Spelling.\"\r\n    The Elementary English Review.   January 1937.", "Ad Age.   \"Classified Advertising.\"\r\n    15 September 2003.", "Oxford Dictionaries.   \"British and American Spelling.\"\r\n    Accessed 18 October 2018.", "Printers' Ink.   \"Early American Advertising.\"\r\n    1897.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]