["A piece of ‘breaking’ news that was published by several media outlets on August 31 informed that the Kerala police booked 30 students (Times Now reported 25 students) of Silver Arts College, Kozhikode, for allegedly waving the Pakistani flag during the college election campaign. Times Now anchor, after stating that the BJP protested against the incident, questioned a channel correspondent, “Yes, Vivek, could you give us details about what really happened because we can see the visuals of a massive Pakistani flag being raised.” The correspondent’s answer was a reiteration of the anchor’s claim.", "#Breaking | 25 students booked in Kerala for waving Pakistani flags in their college as a part of election campaign.", "Details by TIMES NOW’s Vivek Karandalam. pic.twitter.com/1kwcMEKiEy", "— TIMES NOW (@TimesNow) August 31, 2019", "Times of India, Deccan Chronicle, MyNation, OpIndia and Dainik Jagran were other media outlets that carried similar reports claiming that the Muslim Student Front (MSF) raised the purported flag of Pakistan inside the college campus. It is noteworthy that the word “allegedly” found no mention in the title of any of these stories. A few used the word inside the articles.", "The alleged incident was also picked by Pakistani media. Many citizens of the nation shared Times Now’s broadcast of the alleged event, including Major General Asif Ghafoor.", "Beginning of the end_iA. TIME NOW: 🇵🇰#کشمیر_بنے_گا_پاکستان#PakistanZindabad https://t.co/IYuiiJiMbM", "— Asif Ghafoor (@peaceforchange) August 31, 2019", "One of the firsts to tweet about the alleged incident before it was widely picked up on social media was ABP News journalist Pinky Rajpurohit.", "The police reportedly booked 30 students belonging to the MSF, a student body associated with the United Democratic Front, under Sections 143 (unlawful assembly), 147 (rioting), 153 (intent to cause riot) and 149 (offence committed under unlawful assembly) of the IPC. The before-mentioned media outlets reported the police action without a basic fact-checking which reveals that the flag raised by the students was not the Pakistani flag but the flag of MSF.", "A Malayam portal azhimukham.com quoted MSF State Secretary Nishad K Salim as stating that the students had a minimum budget for campaigning for the polls set to be held on September 5. They got the flag stitched by a tailor who did not know the exact green-white ratio to be used. The MSF first hoisted the large flag with a mast which later broke, added Salim.", "A different video of the event shows the flag with the mast intact. This video was uploaded by Facebook user Abdul Jaleel Ct who wrote, “This video will show the truth”.", "എം എസ് എഫ് പേരാമ്പ്ര പാക്കിസ്ഥാന്‍ പതാക ഈ വീഡിയോ പറയും എന്തായിരുന്നു സത്യം എന്നത്. സംഘി, കമ്മി കള്ളഹിമാറുകള്‍ എന്ത് കിട്ടിയാലും സമുദായത്തിനെതിരെ, സമുദായത്തിലെ സംഘടനകള്‍ക്കെതിരെ തിരിയാന്‍ ഒരേ സമയം നന്നായി ഊര്‍ജ്ജം ചിലവാക്കുന്നുണ്ട്. കരുതിയിരിക്കുക ഈ ചിദ്ര ശക്തികളെ. അത് പോലെത്തന്നെ സ്വന്തം വിദ്ധ്യാര്‍ഥികള്‍ക്ക് തങ്ങളുടെ കൊടിയുടെ രാഷ്ട്രീയം എന്താണ് എന്നെങ്കിലും പഠിപ്പിച്ച് കൊടുക്കുക. നേതൃത്വം അതിനു തയ്യാറാവുക. ഇല്ലെങ്കില്‍ ഇതൊക്കെ സംഭവിക്കും. ഒരു തലമുറയുടെ ഊര്‍ജ്ജം, അവരുടെ വിദ്യാഭ്യാസം കോടതി മുറികളില്‍ തളച്ചിടാന്‍ അനുവദിക്കരുത്, ശക്തമായി സംഘടിക്കുക. എം എസ് എഫ് പേരാമ്പ്ര പാക്കിസ്ഥാന്ി കൊടുത്താലോ, കാവി ലഡ്ഡു കൊടുത്താലോ, മിഠായി കൊടുത്താലോ തീരുന്നതല്ല അവരുടെ പരമത വിദ്വേഷം എന്ന് ഇനിയെങ്കിലും ” സമുദായ പാര്‍ട്ടി” പ്രവര്‍ത്തകരും നേതാക്കളും മനസ്സിലാക്കുക. തിരിച്ചറിവ് നേടുക എന്നുള്ള അറിവെങ്കിലും നേടാന്‍ ഇനിയും എന്താണ് നിങ്ങള്‍ക്ക് തടസ്സം?", "Posted by Abdul Jaleel Ct on Saturday, 31 August 2019", "Alt News found another video of the event uploaded on Twitter. Both these videos establish that the flag raised in Silver Arts and Science College was not Pakistan’s flag. The difference between the Pakistani flag and the MSF flag is distinct.", "A juxtaposition of the Pakistani flag and the MSF flag puts the distinction in perspective.", "In the video viral on social media, the students can be seen holding the flag from all four corners in a horizontal position as the mast is absent. When we turn the flag upside-down, it looks the same as the one in the collage above – with the white at the bottom and the crescent moon on the top left corner.", "A controversy was created as the MSF flag raised in the college did not have the perfect green-white ratio which should’ve been half and half. Speaking to Alt News, MSF General Secretary Navas informed, “The news is incorrect. It isn’t the Pakistani flag which has white on the left. In the MSF flag, the white is at the bottom. If you see a photo of the upright flag, you can clearly see that the white is at the bottom. Moreover, in the MSF flag the crescent moon is on the left corner. A problem arose because we didn’t ourselves make the flag because of its large size. The tailor who made it didn’t know that the green-white ratio should’ve been 1:1 and he made a flag with a 3:1 ratio.”", "This wasn’t the first time that an imperfect flag was waved by students. Images of the flag raised in Silver Arts College, Perambra in 2016 also show an imperfect colour ratio.", "Furthermore, while the official flag has an ‘MSF’ imprint on the bottom right, the student body has used flags without the imprint in past events as well.", "കൊട്ടിക്കലാശം @ Silver College perambra Msf Silver Msf Silver", "Posted by Sidique Ul on Saturday, 1 September 2018", "While an investigation is underway, there’s little doubt that the flag raised was not the Pakistani flag but the flag of Muslim Student Front (MSF). Media outlets failed to highlight this fact in their report thus, giving credence to false claims. This wasn’t an isolated incident when the flag of a Muslim body was mistaken to be that of Pakistan. The same misconception often arises in case of IUML flags and Islamic flags.", "[This article was updated on September 3, 2019, to include the video where students raised the flag without the ‘MSF’ imprint in a past event. Furthermore, India Today and ANI were erroneously included in the article. The same has been corrected.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]