["About this rating", "According to law enforcement sources, evidence gathered so far does not indicate the suspect's religious or political views played a role in his alleged crimes, and as of this writing no motive has been established.", "On March 22, 2021, a 21-year-old man allegedly walked into a King Soopers supermarket in Boulder, Colorado, with a semi-automatic rifle and a pistol and killed 10 people. As investigators sought evidence to determine what, exactly, drove the suspected gunman, Ahmad Al Aliwi Alissa, to go on the killing rampage, rumors about his background and prior affiliations circulated widely online.", "Specifically, social media posts, like the one displayed below, alleged he identified as Muslim and disagreed with former U.S. President Donald Trump. (See here for facts about Alissa's birth country and when he emigrated to the U.S.)", "Before we investigate the legitimacy of those assertions regarding Trump and Islam, let this be clear: There was not enough evidence as of this writing to explain why Alissa, who lives in the Denver suburb of Arvada, allegedly opened fire at the crowded supermarket in Boulder. Two anonymous law enforcement sources told journalists there was nothing to indicate his political or religious ideologies played a role in his alleged actions.", "For example, court documents provided to Snopes by the Boulder County District Attorney’s office that detail how and, under what circumstances, authorities took Alissa into custody make no mention of him expressing his personal beliefs during or after the shooting.", "That said, it was true that at least three people who knew Alissa, including his brother, confirmed with journalists that he believed in Islam, and archived screenshots of the suspected killer's Facebook activity obtained by Snopes showed he referred to himself as a member of the Muslim community.", "For example, after speaking to Ali Aliwi Alissa, the suspect's 34-year-old brother, CNN reported:", "\"The brother told CNN on Tuesday that in high school bullies made fun of Alissa's name and for being Muslim and that may have contributed to him becoming 'anti-social.'\"", "He attended Arvada West High School from 2015 until he graduated in 2018, and he was on the wrestling team his junior and senior years, reported The Denver Post. Two people who identified as his former wrestling teammates -- Dayton Marvel and Angel Hernandez -- spoke to the news outlet after the mass shooting, saying:", "Hernandez said Alissa frequently appeared to be paranoid about perceived slights against him, and Marvel said Alissa was often concerned about being targeted because of his Muslim faith.", "'He would talk about him being Muslim and how if anybody tried anything, he would file a hate crime and say they were making it up,' Marvel said.", "Another man named Damien Cruz who claimed to be a friend of the suspect also told journalists Alissa complained about islamophobia and people's prejudices against him because of his Syrian background and name. \"He talked about how Muslims were all treated poorly,\" Cruz said.", "Additionally, Alissa repeatedly expressed pro-Islam sentiments or promoted aspects of the faith online, according to our analysis of archived screenshots of his Facebook page that the social media platform permanently deleted after his arrest.", "On March 31, 2019, for example, he listed virtues such as decency and forgiveness, with the caption: \"What Islam is really about.\"", "Also, around the same time, Alissa authored a Facebook post from denouncing the actions of a white supremacist who shot and killed 51 people at two Christchurch mosques in New Zealand.", "“The Muslims at the #christchurch mosque were not the victims of a single shooter. They were the victims of the entire Islamophobia industry that vilified them,\" that post read.", "Months later, in July 2019, he expressed fears that someone was targeting his phone because of his religious beliefs. “Yeah if these racist islamophobic people would stop hacking my phone and let me have a normal life I probably could,” he wrote.", "As far as Alissa's political leanings, it was true that he criticized specific actions of Trump and his far-right supporters, though nothing on the Facebook page or in news stories after the supermarket shooting explicitly outlined his overall perception of the former president.", "On Nov. 8, 2016, days after Trump's presidential victory over Democratic candidate Hillary Clinton, the suspected shooter authored the below-displayed Facebook post that said he would \"remain optimistic\" with Trump in the White House.", "Additionally, at least one Facebook post (displayed below) bluntly criticized the former president's approach to immigration.", "\"[Trump] could do whatever he wants and his base would still support him regardless of what he says or does,\" another post by Alissa read.", "Like Snopes, the SITE Intelligence Group, which monitors online extremism, analyzed an archived version of Alissa's Facebook profile after the supermarket shooting. It found no evidence of him expressing \"any radical or extremist views\" on the platform.", "“We still don’t know what his motive was, or if he had one at all. But what I can say is that based on what I’ve seen of his social media presence, he didn’t even remotely suggest having radical Islamist leanings, or really radical leanings of any kind,” said Rita Katz, executive director of SITE, according to The Washington Post.", "In sum, we rate this claim \"true.\" The suspected gunman considered himself Muslim and criticized Trump and/or his supporters online.", "As of this writing, Alissa had just made his first court appearance, where he didn’t speak other than to say “yes” to a question from the judge, according to The Associated Press. Prosecutors advised him of the 10 charges of first-degree murder he faces.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]