["By Angelo Fichera", "Posted on July 13, 2018", "Q: Were the victims of a New Jersey home explosion tied to an investigation into the Clinton Foundation?", "A: No. A viral conspiracy theory is spreading that claim without any evidence. Investigators told us they “found no evidence of foul play” and that the deaths were ruled “accidental.”", "A tragic home explosion in New Jersey that left a husband and wife dead has become the subject of the latest viral conspiracy theory centered on Hillary and Bill Clinton, a political duo that has become a staple of disturbing tall tales.", "The most recent conspiracy theory claims that one of the victims in the explosion, Carole Paladino, a retired school nurse, was “due to testify against Hillary Clinton” as part of an FBI probe involving the Clinton Foundation and a pharmaceutical company that donated to the nonprofit organization.", "Within a day of the July 7 explosion in the small town of Newfield, the elaborate story began spreading online. It appeared on the website whatdoesitmean.com under the byline “Sorcha Faal, and as reported to her Western Subscribers” — a known purveyor of false news. The story has appeared on other websites and the conspiracy theory has circulated Facebook.", "Whatdoesitmean.com, and other sites that picked up its story, claimed that Paladino was a “US federal government witness who was due to testify this coming week before a grand jury in the expanding FBI probe into Hillary Clinton and her Clinton Foundation,” citing a “Foreign Intelligence Service (SVR) report circulating in the Kremlin.”", "Others, like puppetstringnews.com, spread the false claim about Paladino, citing a tweet that included a screenshot of a quote from an unidentified user in a public forum website who quoted from the story.", "The story said Paladino’s testimony would have focused on a “notorious American-based pharmaceutical company who gave money to the Clinton Foundation in a bid to cover up their drug price gouging crimes.” It referenced a 2016 New York Post article about the pharmaceutical company, Mylan, and its donations to the Clinton Foundation. At the time, Mylan had come under scrutiny for dramatically increasing the price of EpiPen, a life-saving medication used to treat allergic reactions.", "But what the sites propagating the conspiracy theory fail to mention is that Hillary Clinton, then the Democratic presidential nominee, publicly rebuked the company over its price gouging.", "“Over the last several years, Mylan Pharmaceuticals has increased the price of EpiPens by more than 400%. They’re now charging up to $600 for a two-EpiPen set that must be replaced every 12-18 months. This both increases out-of-pocket costs for families and first responders, and contributes to higher premiums for all Americans and their employers,” Clinton said in an August 2016 statement.", "“That’s outrageous — and it’s just the latest troubling example of a company taking advantage of its consumers,” the statement continued, with Clinton saying it’s “wrong when drug companies put profits ahead of patients, raising prices without justifying the value behind them.”", "The Clinton Foundation website indicates Mylan has donated between $100,001 and $250,000. While that relationship is made to appear nefarious, Mylan has made contributions to other charitable groups. A 2017 report by the company said that its charitable foundation had “made grants totaling more than $10 million to more than 100 nonprofit organizations” over the previous 16 years.", "The company’s political action committee also routinely contributes to those involved in politics. In 2016, and again this year, the company’s PAC gave to both Democrats and Republicans running for Congress. In 2016, it gave twice as much to Republican candidates than Democratic candidates.", "The insinuation that the explosion may not have been an accident also doesn’t comport with what local authorities have said.", "The Gloucester County Prosecutor’s Office “has found no evidence of foul play,” it said in a press released provided to FactCheck.org by spokesman Bernie Weisenfeld. The manner of death for both was ruled “accidental.”", "The Gloucester County Fire Marshal’s Office found that the explosion was sparked by gas, though the origin is undetermined, county spokeswoman Debra Sellitto told us. There were “multiple ignition sources,” she said in an email, and the investigation remains open.", "Some neighbors told The Philadelphia Inquirer that the couple had recently installed a new stove, though it’s unclear if that was the cause.", "Those who knew Carole Paladino, 72, and her husband, John, 73, told us that they had no knowledge of them being involved in a case against the Clintons.", "“I knew John personally and he never mentioned anything about this supposed conspiracy,” Newfield Mayor Donald Sullivan told FactCheck.org in an email. Sullivan knew John from their work together at the DeMarco-Luisi Funeral Home in Vineland, and the mayor had recently appointed him to the town’s Planning Board.", "And Judith Woop, who served as executive director of the New Jersey State School Nurses Association from 2013 until last month, said she knew Carole for years through their work for the professional group. Carole had volunteered as editor of the group’s newsletter at one point and also served as its standards and practices chair. The association is nonpartisan, Woop noted.", "“We were involved in EpiPen legislation but just from the administration standpoint of giving EpiPen, delegating it,” Woop said of the nurses’ group. “I can’t see her involved in any pharmaceutical” investigation.", "In fact, Carole had participated in the creation of a 2008 New Jersey Department of Education document outlining training protocols for the emergency administration of epinephrine (the generic name of the medicine). But Woop said Carole, like other certified nurses in the association, likely offered her expertise and assistance to the state on other nursing-relating matters.", "“She was a most ethical, professional, generous, giving” nurse, Woop said. Of the conspiracy theory, she added: “For people to spread stuff like that, it’s horrific.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "Halper, Daniel. “Company that price gouged EpiPen is Clinton Foundation donor.” New York Post. 25 Aug 2016.", "“Hillary Clinton Statement on EpiPen Pricing.” The American Presidency Project. presidency.ucsb.edu. 24 Aug 2016.", "Melamed, Samantha, et al. “Two dead in New Jersey house explosion: ‘It was a huge ball of fire.’” The Philadelphia Inquirer. 7 Jul 2018.", "Sellitto, Debra. Spokeswoman, Gloucester County. Emails sent to FactCheck.org. 10-12 Jun 2018.", "Weisenfeld, Bernie. Spokesman, Gloucester County Prosecutor’s Office. Emails sent to FactCheck.org. 10-13 Jun 2018.", "Woop, Judith. Former executive director, New Jersey State School Nurses Association. Phone interview with FactCheck.org. 11 Jun 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]