["About this rating", "Some service dogs are specially trained to seek help if their owner is suffering from a debilitating medical emergency and requires help.", "Not all service dogs acquire this type of training.", "Some service dogs are specially trained to seek out help if their owner is suffering from a debilitating medical emergency and are in need of assistance, according to a claim made on social media that Snopes readers asked our team to verify.", "We rate this claim as mostly true. While some service dogs may go through special training that teaches them to seek help if their owner is experiencing a medical emergency, not all service dogs will have been taught such discipline.", "The “Service Dog PSA” was originally shared on the social media platform Tumblr by user lumpatronics on June 12, 2018, by a user who identified as Tessa Connaughton. The woman described falling down, and her dog going off to seek help. Although the fall was “awful but ultimately harmless,” the original poster went on to say that she had epilepsy, and that her service dog was trained to find help if she was having a seizure.", "“If a service dog without a person approaches you, it means the person is down and in need of help,” she wrote.", "The post subsequently went viral in June 2018 and was reported by several media outlets. It later became a Twitter moment when user @lissalet reshared the Tumblr PSA. (However, the original Twitter post has since been deleted, according to Twitter.) In a segment that aired on the Today Show at the time, a dog trainer said that a service dog will typically nudge a person’s legs to get their attention and if you see a dog in a vest without a person, “follow them.”", "Service dogs are protected under the Americans with Disabilities Act (ADA), which is administered by the U.S. Department of Justice (DOJ). The DOJ defines a service dog as one that has been “trained to take a specific action when needed to assist the person with a disability.” This includes a dog that is trained to detect the onset of a seizure and then help the person remain safe during the seizure for an owner with epilepsy.", "But it is important to note that not all service dogs have been trained to find help when needed.", "According to the American Kennel Club (AKC), that skill is found in a handful of specially trained service dogs, including those known as “seizure response” dogs trained to perform various behaviors in response to both epileptic and non-epileptic seizures. assist people who suffer from epileptic and non-epileptic seizures.", "Seizure response dogs are trained to bark and alert when their owner is experiencing a seizure. These animals may also lie next to their owners during a seizure to prevent injury while others may stand nearby to break a fall and prevent injury. Such dogs can also be trained to press alarm buttons or devices that call for help, and open and close doors, and find someone to help.", "It is important to note that seizure response dogs are not the same as seizure alert dogs, which some people claim can predict when a seizure is coming. Paws with a Cause, a nonprofit organization that trains and provides seizure alert dogs, noted that this behavior may develop between a dog and a human as their relationship bonds, but it is not consistent or scientifically proven — though there is some evidence that dogs with particular personality traits may be more likely to alert someone when a seizure may occur.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]