["Election conspiracy theories abounded in the weeks after the 2020 election. Allegations of widespread voter fraud often used out-of-context images and unrelated documents to support false narratives.", "A “smoking gun” video from a Georgia polling site purports to show poll workers fabricating and counting additional ballots after Republican poll observers had left for the night.", "The conservative group Restoration PAC posted a copy of the video online and received several thousand interactions. USA TODAY reached out to the group for comment.", "The video was widely shared across social media. Footage of the supposed conspiracy was also featured during a segment of Fox News’ “Hannity.” The legal team for President Donald Trump also included the footage in court filings claiming election fraud in the Peach State.", "While some might find the actions of the workers at first confusing, the practice of storing ballots on-site is not unusual for poll workers, especially as ballots are being continuously tabulated over long hours. Election officials in the state have found no wrongdoing.", "Fact check:Statistical analysis supporting pro-Trump Supreme Court case is 'ludicrous'", "The viral surveillance footage was recorded at Atlanta’s State Farm Arena, which was used as a polling site last month. In the video, taken in the days after the Nov. 3 presidential election, site workers, reporters and poll watchers can be seen leaving as others begin packing ballots into containers, which were inaccurately dubbed suitcases.", "The video of the activities of the poll workers is not doctored or significantly altered. Insinuations that workers were packing away these ballots for nefarious purposes, however, are incorrect.", "In reality, the workers were not placing the ballots in suitcases, but their proper storage containers. They were doing this because they thought their work was done for the day, and they could leave.", "“What you saw – the secret suitcase with magic ballots – were actually ballots that had been packed into those absentee ballot carriers by the workers in the plain view of the monitors and the press,” Georgia Election System Implementation Manager Gabriel Sterling said, according to the Augusta Chronicle.", "“They were under the misbegotten impression that they were getting to go home,” he continued. “They had been there all day long. They were tired and they thought they could go home.”", "Learning the Fulton workers were planning to leave, Georgia Secretary of State Brad Raffensperger made certain they did not.", "Related claims that the ballots were somehow violated or made otherwise invalid in the process are unfounded. The actions on video are part of the routine ballot opening process.", "Fact check:Woman in Indiana charged with modifying absentee ballot applications, not mail-in ballots", "More:Trump voter fraud claims impact Georgia run-offs", "“We’ve had our investigators watch all, many, several hours of it yesterday and what essentially happened is, and we knew about part of this on election night itself, around 10:15-10:20, there's two groups of people in this room that are working,\" Sterling said during a Newsmax interview. \"There are cutters, the people who are opening the envelopes, and there's the ones who are scanning.”", "At such a late hour, the \"cutters\" had already finished opening the ballots, leaving only the scanning process to be conducted. This meant that less workers were needed on site for the remaining ballots.", "In the wake of claims about the footage, Georgia election officials and local media monitored hours of footage from the arena to determine if there had been any wrongdoing. Neither party found cases of fraud from the incident.", "Central to claims of fraud is the insinuation that poll watchers, especially Republicans, were not allowed to watch the processing of ballots. This is not true; poll watchers were able to enter and monitor the facility at any hour.", "The fact that some left after a late point is not reflective of a coordinated effort to stop them from observing the ballot counting process.", "Fact check:Biden won the most total votes – and the fewest total counties – of any president-elect", "Fact check:Trump lost the 2020 presidential election", "The insinuation that election officials also sought to thwart Republican poll watchers during an alleged fraud conspiracy also ignores that the Georgia secretary of state and his subordinates are all Republicans. Richard Barron, the Fulton County election head, is a nonpartisan official.", "Crucially, the entirety of the night and morning's events at the polling site are on tape for election officials to review. No wrongdoing has been found. Additionally, no ballots were removed from the site. All other polling equipment was also accounted for after a review.", "Nothing during the period in question deviates significantly from what one would expect during routine counting.", "Fact check: A 37-vote change in Georgia was the result of human error, not vote-flipping", "The viral video footage of poll workers moving ballots into containers is authentic. That said, when taken out of context the video footage may inaccurately suggest wrongdoing. Officials later conducted a complete review of how the election transpired and found that the site’s poll workers did not engage in any wrongdoing. A mandated audit of the election results as well as a recount requested by the Trump campaign also found no wrongdoing.", "The secretary of state and members of his staff have denounced accusations of election fraud as misinformation. We rate this claim MISSING CONTEXT because, without additional context the video clip could be misleading.", "Contributing: Susan McCord, Augusta Chronicle", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]