["About this rating", "On 16 March 2016, Ed Trice wrote a long post on LinkedIn describing his purported battle to have his daughter's standardized math test results changed, as well as the results of all similar tests in the U.S. changed, after her supposedly \"correct\" answer to the question \"What's the largest number you can represent with 3 digits?\" marked wrong:", "This post is about my fight against \"Standardized Testing\" in math, and what later became \"Common Core.\" It goes back to 2008 when my daughter was in grade school. I got a call to come to the principal's office. I was surprised, as this was a real first. Like all fathers I suppose, we tend to think of our little girls as angelic and saintlike. In my case, this was the absolute truth.", "<!--\nRight at the outset the details of this narrative are sketchy, because Trice reports that this educational showdown occurred in 2008 but still laid blame on the Common Core curriculum. The Council of Chief State School Officers (CCSSO) and the National Governors Association Center for Best Practices (NGA Center), however, didn't develop the standards until 2009.\n-->", "\"Your daughter was being disruptive in class.\"", "It was like an arrow through my heart. I looked over at her. There were tear-streaked marks all down her face. She looked down at her shoes when I shot a glance over at her. And she started sobbing again. The principal continued his monotone diatribe, while I walked over to kneel besides my daughter and hug her.", "\"Really, Mr. Trice, that's not appropriate ...\"", "\"Your daughter tried to correct her math teacher. The teacher explained why she was wrong, and she insisted that she was correct.\"", "I laughed.", "I knew she was right and the teacher was wrong. I couldn't wait to hear this one.", "The first few paragraphs of Trice's story serve to set up the confrontation: Not really between Ed Trice and his daughter's teacher, but between the reader and Common Core system. Trice immediately paints the school's principal as the story's villain, a feckless man who censured Trice's \"disruptive\" daughter for daring to challenge the answer to a test question and chastised her father for attempting to comfort her with a hug.", "\"What was the question?\" I asked as the principal was about to interject a rebuke to my outburst.", "The teacher was also present, and he spoke up. \"The question was, what was the largest number that can be represented with 3 digits. I said it was 999, your daughter disagreed.\"", "I remember thinking \"Uh-oh. What the heck was she thinking?\"", "That's when she spoke up, anger in her voice, \"Oh yeah? Tell me what 9 raised to the 9th power raised to the 9th power is then??\"", "Holy crap! She was right! Technically, the problem is not asking for the largest 3-digit number, which is exactly where my mind went upon hearing the question. The question is asking you to represent a number using 3 digits, so exponentiation cannot be ruled out.", "I looked over at her and smiled and said \"Way to go! You're 100% correct!\" And I gave her a high-five. She smiled. Then cried some tears of joys as she laughed. She knew I had her back.", "The question of whether Ed Trice's daughter was \"100% correct\" as described in this account is far from a settled one. One could argue that exponentiation is a form of multiplication and therefore uses operators as well as digits (even if the former are only implied), leaving the door open for all sorts of answers that would produce even larger numbers, such as 9!^9!^9!. As well, one might contend that the question specified the use of digits, but a value expressed as an exponential employs numbers rather than digits.", "In fact, this very question (i.e., about the largest number that can be represented with three digits) has been posted to math forums since at least 2002, including versions that present it (just as Trice did) as a scenario involving a student's challenging his teacher, making it highly unlikely Trice just happened to experience the very same event, in the very same setting, several years later.", "Regardless of what the correct answer might be, Trice claims that he argued with administrators and managed to get them to change his daughter's score on the standardized test, as well as the scores of every other student in the country who took the same test:", "\"Mr. Trice, the only way I can give your daughter credit for that one answer,\" (and he really put emphasis on one) \"is to go to the national board of education and have everyone who took this test have their answers marked incorrect.\"", "Amazingly, he thought that would make me want to back down.", "\"OK. Do it.\"", "The three of them were mid-stance, not yet fully risen from their seats, and they froze.", "\"Beg pardon?\" asked the superintendent.", "\"I said, do it. As in, make it happen. As in, execute that course of action.\"", "They sat back down. The next hour involved them trying to persuade me against it. Finally, they started the concessions. My daughter would be given a score of 100 instead of 99, but the others would not be penalized. After all, this was two months later, etc. etc. etc.", "\"No. I gave you that option already and it was declined. I want every exam in the country marked incorrect that has 999 as the correct answer.\"", "It took an attorney and another 3 months, but I got the result. My daughter scored the only 100 on the exam that year for her grade, not just in her class, but in the country.", "I didn't care what it cost. I didn't care how much effort it took. I didn't care that an entire federal department was given tens of thousands of hours of work in addition to the demands placed on it.", "I cared that an individual who had the ability to shape my daughter's future mind made her cry when she was right and he was wrong and he knew it. This could have been handled so much better by the overlords.", "Again, this account is highly suspect, because national standardized tests are typically graded at central facilities operated by the companies that produce the tests; it isn't within the purview of an individual local school teacher or official to change the score assigned to any student. And if this account were true and Ed Trice really forced \"an entire federal department\" to devote \"tens of thousands of hours of work\" to fixing a single standardized test question (even though private companies, not the federal government, typically produce such tests), that's a story that should have made the news. Yet we couldn't find a single article mentioning Ed Trice's battle with standardized testing prior to his 16 March 2016 LinkedIn post.", "Several of the inconsistencies we've detailed here (e.g., that the story has nothing to do with the Common Core curriculum, that the answer to the question under dispute is debatable, that no extant news articles mention any such legal battle) have been pointed out on Trice's LinkedIn page, but he has steadfastly maintained that his story is 100% accurate. Of course, he has also steadfastly declined to provide any proof:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]