["The photos were published here in a Facebook post on November 21. It has been shared more than 10,000 times.", "The post includes four photos: one of a partially collapsed green house, one of a structure that has collapsed and slid into a river, and two close-up photos of cracked and damaged structures.", "Below is a screenshot of the misleading post:", "The post’s Thai-language caption translates to English as: “The effect of people who live around Xayaburi dam in Laos. The epicentre of the 5.9 magnitude quake. This morning (November 21, 2019) at 6.50 AM”.", "AFP reported here that a 5.7 magnitude earthquake hit northwestern Laos on Thursday, November 21. Another 6.1 magnitude earthquake struck the same area just hours later, shaking buildings as far away as Bangkok and Hanoi.", "The photos were also published here on Facebook with a similar claim.", "The claim is misleading; two photos in the post were published online in August in reports about damage caused by landslides Huaphan, a province in northeastern Laos, in August 2019.", "A reverse image search on Google found that the first photo of the collapsed green house was published here by InsideLaos, a Laos-based community news site, in its August 5 report on the landslides in Huaphan.", "Below is a screenshot of the photo in the misleading Facebook post (L) and the photo in the InsideLaos report (R):", "Part of the Laos-language report translates to English as: \"[The storm] has caused severe flooding and landslides in several villages in Huaphan and Luang Prabang provinces. At least 11 people have been confirmed missing.”", "The landslides in Huaphan were also reported on here by the Vientiane Times, an English language Laos-based news site. The article’s first paragraph reads: “Heavy rain has affected the area since August 3 and seven people are still missing after a landslide.”", "Another reverse image search for the misleading post’s second photo found this high-quality YouTube video that was published on August 16, 2019.", "The video’s caption reads: “In Laos, the house on the banks of the lake has become horrendous.”", "Below is a screenshot of the YouTube video:", "Reverse image searches for the other two photos in the misleading post found the images in media reports about the November 21 earthquakes.", "Both images appear in this report published by M2F, a Thai-language tabloid on November 21, 2019.", "Below are screenshot comparisons from the article (L) and the images in the Facebook post (R):", "The two images were also published in several other articles about the earthquake; for instance here in a report by Chinese state media outlet CCTV on November 21; and here in a report by Bangkok-based newspaper The Nation on November 21.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]