["A video of a woman gagged, tied and hacked to death with an axe has been widely shared on social media with the claim that she was a victim of ‘love Jihad’. Akash RSS shared the clip with the following message, “See the condition of Hindu girls after they fall for the trap of love Jihad. These girls leave their religion and parents for peaceful boys who do this to them after satisfying their lust.” The word ‘peaceful’ is a derogatory term used for members of the Muslim community. Alt News is not providing any links to the video due to its graphic nature.", "[Translated from: लव जिहाद मे फसने के बाद हिन्दू लड़की की क्या स्थिति होती है वो इस वीडियो मे देखे, जिस शांतिदूत युवक के लिए अपना धर्म छोड़ देती है ये लड़किया अपना सब माता पिता को धोका दे देती है वो शांतिदूत लड़का हवस पूरी हो जाने पर लड़की का ये हाल कर देता है?]", "Akash RSS is ‘Akash Soni’. In a 2017 report, Alt News had investigated that he was the man behind a popular fake news website Coverage Times. Another report published in June 2018 revealed that he was one of the individuals running misinformation and propaganda Facebook page ‘BJP All India’. Soni was also found to be behind the targetted harassment of journalist Ravish Kumar through a WhatsApp group.", "The video is viral on Facebook with the ‘love Jihad’ claim.", "The video was earlier viral with the message, “Humanity is dead. This is barbaric, sad, and shocking. Is he an executioner? I request nation’s police officers punish him in a similar way. (इंसानियत मर चुकी है, हैवानियत है बहुत दु:खद आश्चर्य है, ये जल्लाद हैं क्या ? मै देश के समस्त पुलिस प्रशासन से अनुरोध करता हूँ की इसको ऐसे ही सजा दी जाये !!)” The user tagged Uttar Pradesh and Delhi police in his tweet.", "Similarly, several Facebook users shared the video suggesting it’s from India.", "Alt News broke the video into multiple keyframes using InVid and after several reverse-image search attempts, we were led to the website Gore Brazil.", "While the website did not provide any details about the video, we took the hint that it could be from Brazil.", "Alt News performed a keyword search in Portuguese—‘mulher morta com machado’—which translates to ‘woman killed with axe’. We performed this search on Facebook as Google did not throw up results matching the description of the video.", "The first result on Facebook leads to a post on the page ‘Feminicídio – Parem de nos matar’ which publishes cases of femicide in Brazil. The post said that Thalia Torres de Souza (23) was hacked to death with an axe in Granja Portugal, Fortaleza.", "MULHER FOI MORTA COM MACHADADAS NA CABEÇA", "Thalia Torres de Souza, aos 23 anos de idade, foi morta de uma forma cruel…", "Posted by Feminicídio – Parem de nos matar on Tuesday, 1 September 2020", "A subsequent keyword using the woman’s name led us to several other Facebook posts in Portuguese. ‘Aracati Polícia 24hs’ uploaded a picture of the woman where she can be seen in the same clothes as the viral video. This post is from August 30.", "#Jovem é morta com golpes de picareta na cabeça em Fortaleza.", "Uma jovem identificada como Thalia Torres de Souza de 23…", "Posted by Aracati Polícia 24hs on Saturday, 29 August 2020", "Thus a gruesome video from Brazil is circulating with the false claim that a woman was hacked to death in India after falling for the trap of ‘love Jihad’. Alt News has debunked several such gory videos from Brazil that are misrepresented in India.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]