["About this rating", "The Friends of Bernie Sanders political action committee sold \"Chairman Sanders\" sweatshirts and T-shirts featuring a photograph of the senator at Inauguration Day, promising \"100% of proceeds\" would go to various Vermont charities. The charities in question appeared to endorse the authenticity of those commitments.", "It's not clear to what extent Sanders was personally involved in creating or planning the fundraising initiative, although he did endorse it in a TV interview.", "In January 2021, readers asked Snopes to examine reports that U.S. Sen. Bernie Sanders of Vermont had harnessed a flurry of memes in order to raise funds for charities in Vermont.", "Sanders was photographed wearing mittens and a relatively unglamorous winter coat at the Jan. 20 swearing-in of President Joe Biden and Vice President Kamala Harris, which gave rise to dozens of memes that digitally added the former Democratic presidential primary candidate into various scenes from history and the movies.", "On Jan. 22, Twitter user @BigGado_ wrote that:", "\"Bernie Sanders threw his meme on a sweatshirt. Charged $45 for it. Sold out immediately in all sizes. Then donated 100% of the proceeds to Meals on Wheels Vermont.\"", "That formula of words was also used in a meme that was shared widely online, in particular on Facebook:", "Those claims were largely accurate, although it wasn't clear to what extent Sanders himself was personally involved in conceiving of or orchestrating the fundraising campaign, nor the amount of money received by the charities in question.", "After the emergence of the \"Chairman Sanders\" memes, the pro-Sanders political action committee Friends of Bernie Sanders began selling sweatshirts and T-shirts featuring a superimposed photograph of the senator sitting with his legs crossed, wearing mittens and a face mask.", "The item's listing, on BernieSanders.com, stipulated that \"100% of proceeds go toward Meals on Wheels Vermont.\"", "That commitment appears to have been met. Tracey Shamberger, a spokesperson for Age Well, the largest of Vermont's five Meals on Wheels providers, told Snopes the organization had received around 150 direct donations, in addition to the proceeds from the sweatshirt sales. Shamberger said she did not have exact amounts available to her, in part because the figure was frequently increasing.", "Speaking to CNN's Dana Bash on Jan. 24, Sanders himself said he expected the entire campaign to raise \"a couple of million dollars\" for the charities. Snopes asked Sanders' spokesperson and the PAC for details on the amounts raised for various charities so far, but we did not receive a response in time for publication.", "The Friends of Bernie Sanders PAC was also selling \"Chairman Sanders\" T-shirts, whose listings stated that \"100% of proceeds will go to charities in Vermont, including Feeding Chittenden, Chill Foundation, and Vermont community action centers.\"", "Both Feeding Chittenden and the Chill Foundation posted about the apparel campaign on social media, indicating they were endorsing its authenticity. We asked Sanders' spokesperson and the PAC whether or to what extent the senator himself had conceived of the fundraising initiative, as well as requesting the latest figures for items sold and money raised, and a full list of the beneficiaries. We did not receive a response to those questions in time for publication.", "Since it's not clear whether or to what extent Sanders himself was involved in creating or planning the campaign, as opposed to simply endorsing an initiative by his PAC, this element of the claim remains undetermined. As a result, we are issuing a rating of \"Mostly True.\" If clarifying information becomes available, we will update this fact check accordingly.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]