["About this rating", "A woman received several painful stings after she ate a squid's sperm bag in 2011.", "This woman was not impregnated by a squid, nor did she spit out baby squids.", "A series of misleading and exaggerated headlines over the span of several years turned a story about a woman's painful dining experience into a rumor about getting pregnant from a squid — via mouth.", "This turned into a battle of headlines as the facts . For example, an article published by The Sun in 2012 read: \"Woman 'pregnant' with 12 baby squid.\" Not to be outdone, the Mirror reported that the South Korean woman had become \"pregnant by squid\" and warned readers that they should \"be careful when putting seafood in your mouth\" because \"you could end up spitting out babies.\"", "Stories about the squeam-inducing squid encounter have been published by a wide range of outlets over the years. Most recently, this story was featured on an episode of Weird Wild World from the Facebook page \"Nameless.tv\":", "Some truth underlies these stories, but associated headlines (as well as some of the details) are severely misleading or wholly inaccurate and have led some readers to believe that a woman was \"impregnated\" by a squid via her mouth.", "The most misleading aspect of this rumor comes down to the words \"pregnant\" or \"impregnate.\" Although these words were frequently employed by outlets presumably hoping to generate clicks on their stories, they are inaccurate. The episode of Weird Wild World was actually referring to a case report originally published in Pathology International in September 2011:", "We present a case of stinging in the oral cavity caused by ingestion of the sperm bags of a squid. The patient experienced severe pain in her oral cavity immediately after eating raw squid. When she was examined at our hospital, we found that several small whitish spindle‐shaped stings were stuck to the mucous membrane of the hard palate. A biopsy was performed, and the whitish stings were removed as well. We also performed a histological examination of the remaining part of the raw squid brought by the patient. The biopsy showed that the sperm bags of the squid had thrust into the squamous epithelium of the patient. The remaining part of the raw squid consisted of the testis and the sperm bags. After removal of all stings, the pain reduced, and the wound healed in due course. Larva migrans and anisakiasis are infections known to be caused by consumption of raw seafood. Although the condition reported here is relatively rare, doctors should also keep this condition in mind for patients reporting pain after eating raw seafood.", "This woman, who was identified as a 63-year-old Korean woman in a subsequent report in the Journal of Parasitology, ate a sperm bag while ingesting a piece of raw squid. As Science 2.0 -- one of the first web sites to pick up on this story when it first went viral in June 2012 -- noted in their report about these rumors, there is a big difference between \"inseminate\" and \"impregnate\":\\", "On Thursday I reported that a woman's mouth had been inseminated by a squid she was eating. To be specific, squid spermatophores (packages of sperm) implanted themselves into her mucus membranes, and had to be removed by a doctor.", "Several sources have now erroneously reported that a woman was impregnated by a squid she was eating, and found baby squid in her mouth. Truth is strange — but this is fiction. \"Impregnate\" (in reproduction, not manufacturing) means that successful fertilization has already taken place: sperm met with egg and an embryo is developing. That did not happen. There was no impregnation, no pregnancy, and no baby squid.", "Exaggerated reports went one step further, claiming that the unfortunate woman had \"squid babies\" removed from where they had become embedded in her mouth: \"A 63-year-old woman has become 'pregnant' with 12 baby squid after eating calamari.\"", "This is another severe exaggeration. Doctors removed squid spermatophores, a capsule containing the squid sperm, from this woman's mouth. For a number of scientific reasons (a human woman's mouth is not the same as a female squid egg), these sperms never developed into baby squids.", "Although the story is bizarre, it is not without precedent. Several similar cases have been documented in various medical journals. A 2012 report in Zoomorphology examines these cases and explains that spermatophore attachment is autonomous (meaning it can occur without the aid of male or female squid) making the consumption of raw male squid a potentially hazardous dining experience:", "Male squid produce intricate spermatophores that, when transferred to the female, undergo the spermatophoric reaction, a complex process of evagination that leads to the attachment of the spermatangium, that is, the everted spermatophore containing the sperm mass. While this process is still not completely understood, the medical literature includes several reports of “oral stinging” (i.e., punctured wounds in the human oral cavity) following consumption of raw male squid, which contains undischarged spermatophores able to inflict such wounds.", "Moreover, spermatophore attachment is confirmed to be autonomous (i.e., performed by the spermatophore itself) in another squid species (possibly a loliginid), and the results strongly indicate that the attachment mechanism is not dependent upon a specialized epithelium, nor a mate’s specific chemical stimulus. From the pathological point of view, the best prophylactic measure at present is the removal of the internal organs of the raw squid prior to its consumption.", "Medical journals have documented several instances of people being stung by spermatophores after ingesting raw squid, but these reports, specifically an instance from 2011, were grossly misrepresented with clickbait headlines.", "Park, Gab-Man.   \"Penetration of the Oral Mucosa by Parasite-Like Sperm Bags of Squid: A Case Report in a Korean Woman.\"\r\n    Journal of Parasitology.   1 September 2011.", "Shiraki, Yukihiro.   \"Stinging in the Oral Cavity Caused by Ingestion of the Sperm Bags of a Squid: A Case Report.\"\r\n    Pathology International.   1 September 2011.", "Millar, Paul.   \"Woman Becomes 'Pregnant' in Mouth with Baby Squid.\"\r\n    Digital Spy.   15 June 2012.", "The Mirror.   \"Is Something Fishy Going On...? South Korea Woman 'Becomes Pregnant by SQUID.'\"\r\n    15 June 2012.", "Haydon, Harry.   \"Woman 'Pregnant' with 12 Baby Squid.\"\r\n    The Sun.   15 June 2012.", "Staaf, Danna.   \"How Exactly Could a Squid 'Inseminate' Your Mouth?\"\r\n    Gizmodo.   26 June 2012.", "Staaf, Danna.   \"How Exactly Could a Squid 'Inseminate' Your Mouth?\"\r\n    Gizmodo.   26 June 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]