["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A recycled fake news account says that Miss Universe Guyana was busted in London for smuggling cocaine in bags of coffee.", "\"Miss Universe Guyana 2017 arrested at London Heathrow airport with 2kg of cocaine,\" states the Nov. 15 headline on States-news.com.", "Facebook users flagged the post as being fabricated, as part of the social network’s efforts to combat fake news. This article about Rafieya Husain, the Miss Universe Guyana 2017, is bogus and recycles previous similar phony stories about other beauty queens.", "We found similar fake articles on the same website about Miss Figi and Miss United Continents and on other websites about Miss Namibia and Miss Universe Malta. None of the accounts are accurate.", "One of the beauty queens, Miss Universe contestant Martha Fenech, told the Times of Malta that such a report can be harmful.", "\"People who know me immediately laughed it off, but several other contacted me to know if I'm okay,\" she said. \"Other 'girls' apparently were only happy to share the fake news item. This is a very serious accusation. It taints my name, it taints Malta's name.\"", "We searched Nexis for credible news accounts about Miss Universe and the Heathrow airport and cocaine and found an example of a real life pageant queen busted for cocaine -- but more than 30 years ago.", "Heather Michelle Ross, who represented Bermuda in a Miss World contest, pleaded guilty in 1983 to smuggling cocaine the previous year. A customs officer told the court that about 2.2 pounds of cocaine was found concealed in her suitcase after she arrived at Heathrow airport. We found the information in articles by United Press International and the Miami Herald.", "We found no contact information on the states-news.com website.", "We were unsuccessful at reaching Husain, but a spokeswoman for the Miss Universe organization told PolitiFact, \"This is a fake news site.\"", "A headline states that \"Miss Universe Guyana 2017 arrested at London Heathrow airport with 2kg of cocaine.\" We found no evidence that she was busted for cocaine. We rate this headline Pants on Fire.", "States-News.com, \"Miss Universe Guyana 2017 arrested at London Heathrow airport with 2kg of cocaine,\" Nov. 15, 2017", "States-News.com, \"Miss Figi 2017 arrested at London Heathrow airport with 2kg of cocaine,\" September 2017", "States-News.com, \"Breaking news: Miss United Continents arrested at JFK with 5 kg of cocaine,\" Accessed Dec. 5, 2017", "Global News, \"Miss Namibia 2016 arrested at London Heathrow airport with 2kg of cocaine,\" Accessed Dec. 5, 2017", "Times of Malta, \"Miss Universe Malta did NOT try to smuggle drugs into UK,\" March 10, 2017", "Malta Today, \"Maltese beauty queen denies 'fake' report of Heathrow airport arrest,\" March 10, 2017", "Miss Universe, Miss Universe Guyana 2017", "International The News, \"Metro publisher denies link to fake news that defamed Hadiqa Kiani,\" March 4, 2017", "The Express Tribune, Hadiqa Kiani to sue Metro Company of UK for defamation, March 4, 2017", "U.S. Customs and Border Protection, Acting Executive Assistant Commissioner Robert E. Perez, Operations Support, Accessed Dec. 5, 2017", "United Press International, \"Miss World beauty busted for drugs,\" (Accessed in Nexis) Nov. 27, 2982", "Miami Herald, \"Miss Bermuda draws 3-year smuggling term,\" (Accessed in Nexis) Jan. 14, 1983", "Interview, Jackie Shahinian, Miss Universe spokeswoman, Dec. 5, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]