["With the election just days away, Democratic nominee Joe Biden’s adversaries continue to push false narratives about his finances to try to raise doubt around \"Middle Class Joe's\" trustworthiness.", "“Bidens 4 3.7.5 million-dollar homes on a 200k a year salary,” reads a meme posted to Facebook Oct. 20.", "The meme shows four of Biden’s current, temporary and previous homes, most of which cost less than $3 million. But Biden has not made a senator’s salary for more than a decade, and hasn't been vice president since 2017.", "More:Fact check: Joe Biden's childhood apartment later became Section 8 housing", "Town & Country Magazine displayed the same four aerial photos in a Sept. 29 article about Biden’s real estate ventures. The meme shows his vacation home in Rehoboth Beach, Delaware; former DuPont mansion in Wilmington, Delaware; rental home in McLean, Virginia; and main residence near Wilmington.", "USA TODAY has previously debunked severalclaims that Biden’s purported unexplainable and suspicious fortunes.", "Neither the Facebook user that posted the meme nor Biden's campaign has responded to USA TODAY's request for comment.", "In June 2017, Biden and his wife bought the six-bedroom, 5.5-bath, 4,786-square-foot home in the North Shores neighborhood of Rehoboth Beach. The couple paid $2.7 million for the home.", "“Throughout our careers, Jill and I have dreamed of being able to buy a place at the beach at home where we can bring the whole family. We feel very lucky that we're now able to make that happen and are looking forward to spending time with our family in the place that matters most to us in the world,” Biden wrote in a statement that year.", "The couple purchased the vacation home after the former vice president left office, the same year their income jumped nearly $10 million from speaking fees and book deals.", "Zillow estimates the home is now worth more than $1.9 million.", "Biden bought the five-bedroom, 2.5-bath former DuPont mansion at 6 Montchan Drive, Wilmington, Delaware, in 1974. He nicknamed the home “The Station” and used it as campaign headquarters during his 1988 election run.", "He bought the 10,012-square-foot home in disrepair for $185,000. He spent two decades renovating and living in it before selling it for $1.2 million in February 1996. Redfin estimates the home is now worth $1,654, 478.", "More:Fact check: Biden leveraged $1B in aid to Ukraine to oust corrupt prosecutor, not to help his son", "After selling The Station, Biden, then married to Jill Biden, bought 4 acres of land in suburban Wilmington for $350,000. He built a home on the secluded lakefront property in Greenville, an affluent neighborhood.", "Zillow estimates the Biden’s nearly 7,000-square-foot home may be worth nearly $2.9 million.", "After leaving office, Biden began renting a large Georgian-style home in McLean, Virginia, not far from D.C. The Washington Post reports former Secretary of State Alexander Haig, who served under President Ronald Reagan, once owned the home in the upscale neighborhood.", "Zillow estimates renting the five-bedroom, nine-bathroom, 11,943-square-foot home costs $19,795 per month. According to Zillow, the home is worth nearly $5 million. The Bidens never owned it.", "More:Fact check: In 1973, Biden said 'the two-party system' was 'good for the negro'", "As of February, the Biden’s were no longer renting the McLean home.", "We rate the claim that Joe Biden owns four homes worth $3-7.5 million FALSE because it is not supported by our research. Biden owns two homes, a main residence in Wilmington, Delaware, worth $2.9 million and a vacation home in Rehoboth Beach, Delaware, estimated to be worth $1.9 million. The other two homes pictured in the viral meme were previously sold or rented by Biden. Neither Biden home is worth the amount claimed.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]