["Ivanka Trump has focused her policy energies on parental leave. (Michael Vadon/Wikimedia Commons)", "A headline on PoliticsDepot.com falsely claimed Jared Kushner and Ivanka Trump had been fired from the White House and eliminated from President Donald Trump’s will.", "\"Kushner And Wife Ivanka Trump Were Tossed Out Of The White House — And Donald Is Cutting Them Out Of His Will!\" the headline reads.", "The story was flagged by Facebook users as being potentially fabricated, as part of the social media website’s efforts to combat online hoaxes.", "But the story that accompanied the flashy headline neither repeated nor provided evidence to back up the claims.", "Trump’s eldest daughter and her husband, who enjoy an elevated status in the White House as both family members and advisers, indeed faced increased public scrutiny in the past week, but have not been kicked out of the West Wing.", "The story correctly summarized news reports describing Kushner’s downgraded security designation, from top secret to secret clearance, following White House Chief of Staff John Kelly’s decision to overhaul the security clearance process.", "It also rehashed anonymously sourced news reports of internal White House turmoil regarding Kelly’s frustration with Ivanka’s White House tenure. The most recent source of tension was her attendance at the Olympic closing ceremony in South Korea.", "While some editorial pages have suggested the couple should resign from their White House posts, no reputable news sources have announced their departure, let alone firing.", "And the contents of Trump’s will -- and whether the couple has somehow been eliminated from it -- have not been reported by any credible sources, either.", "The headline is a hoax tagged to an unrelated aggregated story to drive page views.", "We rate this statement Pants on Fire!", "PoliticsDepot.com, Kushner And Wife Ivanka Trump Were Tossed Out Of The White House — And Donald Is Cutting Them Out Of His Will!, Feb. 28, 2018", "Politico, Kushner loses access to top-secret intelligence, Feb. 27, 2018", "New York Times, Trump’s Chaos Theory for the Oval Office Is Taking Its Toll, March 1, 2018", "CNN, Ivanka Trump's South Korea trip fuels White House tension, Feb. 26, 2018", "The Wall Street Journal, The White House Family Business, Feb. 28, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]