["About this rating", "A photograph purportedly showing a 110-pound squirrel shot by a hunter in North Texas was shared on Facebook in October 2018:", "Although this photograph may appear to show a rodent of an unusual size, it does not picture a 110-pound squirrel. This image is another example of forced perspective, an optical illusion which can obscure the true size of an object, making it appear much smaller or larger than it really is:", "Forced perspective is an optical illusion where an object may appear smaller or larger, or nearer or further away, than it actually is. This is done by controlling the distance and vantage point of the camera.", "When something is further away it will appear smaller than it actually is, but if you are careful with positioning and depth of field you can create the illusion that all the objects in a scene occupy the same space. So you can have something far from the camera, that is larger than an object in the foreground, appear to actually be much smaller.", "One well-known example of forced perspective can be found in Italy, where tourists regularly pretend as if they are holding up the Leaning Tower of Pisa. Here are some other visual examples of forced perspective:", "In the case of the 110-pound squirrel, the hunter is actually kneeling several feet behind the log. This makes the squirrel appear unusually large since it is deceptively much closer to the camera lens than the hunter is.", "Instagram user Wyatt Brewer, who originally posted this photograph back in November 2016, confirmed in the comments section that he was sitting several feet behind the squirrel when this photograph was taken:", "Forced perspective has been used in the creation of a number of other online hoaxes. This photography trick can also be seen in rumors about giant frogs, rodents, and turtles.", "Nicholls, Will.   \"The Science Behind Forced Perspective.\"     PetaPixel.   23 October 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]