["About this rating", "In the midst of a September 2017 controversy over a protest movement among professional football players to \"take a knee\" or stay in their locker rooms during pre-game renditions of the U.S. national anthem, social media rumors and news content suggested that satellite television company DIRECTV was offering refunds of NFL Sunday Ticket subscriptions to disgruntled customers:", "Good news, @DIRECTV customers! They've just announced they're refunding money to ppl offended by TV programs. Hit them up for details.", "— Amy Bradley-Hole (@amybhole) September 27, 2017", "Direct TV will allow you to CANCEL your NFL Sunday package, and REFUND U if it's because of protest! pic.twitter.com/DaXHQIxpax", "— Deplorable Lori Nor (@LoriNor85730053) September 26, 2017", "The Wall Street Journal (WSJ) published a far-from-definitive report about the rumor, stating that \"at least some\" customers could cancel their subscriptions by citing dissatisfaction with the protests, although DIRECTV's policy did normally allow for such cancellations:", "DirecTV is letting at least some customers cancel subscriptions to its Sunday Ticket package of NFL games and obtain refunds if they cite players’ national anthem protests as the reason, customer service representatives said.", "Sunday Ticket’s regular policy doesn’t allow refunds once the season is under way. But the representatives said they are making exceptions this season — which began in September — in response to the protests, in which players kneel or link arms during the national anthem.", "Spokesmen for DirecTV-parent AT&T Inc. and the National Football League declined to comment.", "Nonetheless, the WSJ's reporting indicated information about DIRECTV's purportedly making exceptions to their cancellation policy was inconsistent:", "DirecTV service representatives contacted by The Wall Street Journal had different understandings of the policy. One said refunds to those concerned about the anthem protests were only offered to subscribers with certain offers or plans. One representative said full refunds were available for those who complained about anthem protests. Another said such people could only get prorated refunds for the remainder of the season. Yet other representatives said the policy hadn’t changed and that no refunds were allowed for any reason.", "However, DirecTV subscribers contacted by The Wall Street Journal showed the satellite broadcaster was offering at least some refunds.", "Other news reports on the subject frequently cited the WSJ (and not DIRECTV) as a source, and none of them referenced any official \"announcement\" from the satellite TV provider:", "DirecTV is offering unprecedented refunds for fans who want to cancel their NFL Sunday Ticket package, if they inform the company that they are doing so due to the recent protests during the national anthem, a source confirmed.", "Once the season starts, fans usually cannot cancel their subscriptions, but AT&T, which owns DirecTV, decided to change the policy due to the sensitivity of the issue. The price of the package, which allows fans to get out-of-market games, is about $280.", "An AT&T spokesperson declined to confirm the cancellation policy and said the company would have no numbers to share.", "Some versions of the rumor stated that DIRECTV had \"announced\" an NFL subscription refund policy specifically linked to the protests. But comments posted to DIRECTV's Facebook wall by customers appeared to fall into two camps — some subscribers merely repeated the rumor, while others reported they had been unable to obtain refunds:", "Some customer tweets suggested that subscribers had been able to negotiate NFL package cancellations with DIRECTV individually, not as part of a policy enacted by the TV provider:", "There are roughly 2 million @directv Sunday Ticket subscribers. At roughly $350 cost, it only takes 3k customers to cost company $1 million.", "— Clay Travis (@ClayTravis) September 27, 2017", "Cancelled my @DIRECTV NFL ticket this morning. Got a $188.00 credit", "— Paul (@PaulcTynan) September 26, 2017", "FYI-Just got a full refund from #DirectTV for #SundayTicket. I told them I didn't agree with the Anthem protests and it was cancelled no ?'s", "— His Goddess (@Domestic_Venus) September 26, 2017", "DIRECTV is letting us cancel NFL pkg. had to threaten to go with cable. Took half hour of arguing with them. They are getting lots of calls.", "— MB Taurus (@HeirloomCore) September 25, 2017", "Some subscribers reported terminating their DIRECTV service entirely after being unable to obtain NFL Sunday Ticket refunds, while others said that DIRECTV had changed their policy to make NFL cancellations even more difficult:", "\"NoRefund from #DirectTV so I cancelled \" Not Paying to watch Kneelers Disrespect Our Flag & Country. #WednesdayThoughts #WednesdayWisdom pic.twitter.com/Wtl3Ugo66M", "— TresDeplorable (@TresDeplorable) September 27, 2017", "#DirectTV NFL Sunday ticket changed policy yesterday - cannot cancel services without being charged...how convenient#BoycottNFL", "— Eye Spy (@dj_dwjohns1) September 25, 2017", "@DIRECTV can I be let out of my contract because I disagree with your recent Sunday ticket refund change?", "— John Brody (@dayizzokid) September 27, 2017", "We contacted DIRECTV via Facebook and Twitter in an attempt to obtain clarification of their purported NFL cancellation policy, but we were unable to reach anyone in their media relations department. We also could not locate any responses from DIRECTV to offended subscribers in which the company definitively stated they had put any such policy in place.", "Flint, Joe et al.   \"DirecTV Allows Some NFL Refunds After Anthem Controversy.\"\r\n    The Wall Street Journal.   26 September 2017.", "Moritz, Scott.   \"AT&T’s DirecTV Is Giving Refunds on NFL Packages Due to Protests.\"\r\n    Bloomberg.   26 September 2017.", "Rovell, Darren.   \"Source: Fans Upset by Protests Can Get Sunday Ticket Refunds.\"\r\n    ESPN.   26 September 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]