["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Scott Walker says college tuition has risen at four times the rate of inflation. Is he right? (Mike De Sisti photo)", "Gov. Scott Walker has put caps on tuition increases, even amid budget cuts, saying he wants to be sure there is \"affordable\" tuition for the University of Wisconsin System.", "He caught our attention May 16, 2016 when he said, on conservative talker Charlie Sykes radio show on WTMJ-AM, that rising tuition costs are far from unique.", "\"This is not just picking on the University of Wisconsin System,\" Walker said. \"This is a nationwide trend. Since ‘78, I think, tuition nationwide has gone up something like four times the rate of inflation.\"", "We have checked many claims about the cost of college tuition.", "In 2014, for instance, PolitiFact National examined this claim: \"In 1978, a student who worked a minimum-wage summer job could afford to pay a year’s full tuition at the 4-year public university of their choice.\"", "Based on national averages, a person could pay in-state tuition at most public universities with their summer earnings, but not for any school, such as one out of state. The claim was rated Mostly True.", "We decided to check out Walker’s claim, too.", "Behind the numbers", "When asked for backup, Walker’s team sent us to a Chart of the Day published by Bloomberg in 2012. The article said college tuition since 1978 has increased four times faster than inflation, but didn’t cite a source for the statistic.", "We turned to the National Center for Education Statistics, the primary federal entity for collecting and analyzing education data. The center, part of the U.S. Department of Education, provided data on undergraduate tuition going back to 1978. The numbers come from its annual surveys of colleges.", "In 1978, tuition and required fees at all institutions averaged $1,073. By 2014, it increased more than 1,000 percent, topping $11,000. That’s a big jump in cost.", "But Walker’s claim compared the increasing price of tuition to inflation.", "The Consumer Price Index is one measure of inflation, or how over time the value of money decreases. The CPI measures the change in cost over time for a representative basket of goods, such as food, housing, transportation and education.", "From 1978 to 2014, the index increased about 246 percent. So, clearly, the rate of increase for tuition has surpassed inflation. And the percent increase in tuition is more than four times the increase in inflation, as Walker claimed.", "Since Walker talked in the context of Wisconsin’s public four-year college system, we took a look at tuition prices for those schools. Tuition at those institutions shot up from around $600 to more than $8,000 by 2014. That’s more than a 1,000 percent increase.", "What about the total cost of an education?", "Tuition is just a portion of the cost of a college degree and the costs for room and board have increased much slower than tuition. If tuition is combined with room and board, the price increase is about three times inflation since 1978, according to the same education and inflation data.", "Some experts say the out-of-pocket costs for tuition should be examined, rather than the published rates. Typically, few students pay the full amount, since many also get scholarships, grants and other financial aid.", "The College Board reports data on the net tuition paid by students, but that data doesn’t begin until the 1990s.", "Sandy Baum, a senior fellow at the Urban Institute and co-author of the Board’s Trends in College Pricing and Trends in Student Aid reports, said the growth of actual prices is smaller than published prices, though still substantial.", "For example, from 1990 until 2014, net tuition paid by in-state students at public four-year schools across the country doubled. In contrast, published tuition prices more than tripled during the same time period.", "Our rating", "Walker said since 1978, college \"tuition nationwide has gone up something like four times the rate of inflation.\"", "Average tuition prices from the National Center for Education Statistics and inflation rates from the Bureau of Labor Statistics back up his point.", "We rate the claim True.", "Bloomberg, Cost of college degree in US soars 12 fold: Chart of the day, Aug. 15, 2012.", "National Center for Education Statistics, Average undergraduate tuition and fees and room and board rates charged for full-time students in degree-granting postsecondary institutions, by level and control of institution: 1963-64 through 2013-14.", "Bureau of Labor Statistics, CPI detailed report, April 2016.", "College Board, Average net price over time for full-time students by sector, 2016.", "WTMJ Radio, Charlie Sykes show, May 16, 2016.", "PolitiFact National, Could a minimum-wage earner in 1978 earn enough in a summer to pay a full year’s tuition?, August 8, 2014.", "PolitiFact national, 5 fact-checks about the high cost of college tuition, Sept. 1, 2014.", "Bureau of Labor Statistics, Consumer Price Index -- College tuition and fees, June 1, 2016.", "Email exchange with Tom Evenson, deputy communications director for Gov. Scott Walker, May 2016.", "Email exchange with Tom Snyder, director of annual reports and information, National Center for Education Statistics, May 2016.", "Email exchange with Richard Vedder, professor emeritus of economics, Ohio University, May 2016.", "Phone interview with Sandy Baum, senior fellow in the income and benefits policy center, Urban Institute, June 1, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]