["This is the version of the photograph from Ferguson, Mo., that went viral...", "In the wake of several high-profile confrontations between white police officers and unarmed African-Americans recently, social media has become a major source of accusations, arguments -- and hoaxes.", "Recently, a reader sent us a photo that has been circulating on social media, showing an African-American protester standing in front of a fire station and holding up a hand-lettered sign that reads, \"No mother should have to fear for her son's life every time he robs a store.\"", "The sign is an obvious reference to the death of Michael Brown, the black teenager who was shot and killed in Ferguson, Mo., in August 2014. Brown’s death became a focus for both peaceful protests and rioting in Ferguson, and it attracted attention around the nation and the world. On Nov. 25, a grand jury decided not to indict, setting off a new wave of demonstrations.", "The phrase \"every time he robs a store\" refers to surveillance footage showing Brown earlier that day robbing a store of cigarillos and assaulting a store employee. Supporters of Darren Wilson, the police officer who shot Brown, have said the robbery is an important piece of context in explaining Wilson’s shooting of Brown.", "Still, the PolitiFact reader asked us whether the photo was real or manufactured, so we decided to take a look.", "The version we received is cropped to focus on the African-American man holding the sign, with a partial view of a woman standing to his left. Other versions, such as one analyzed by Snopes.com, include a fuller view of the woman, holding a sign that says, \"Shame on Ferguson Police,\" as well as another man, an African-American, holding a sign that says, \"We the People.\"", "The starkly divergent messages of the three signs provide a clue that something is amiss. And indeed, something is amiss.", "In the original photograph -- published on the Riverfront Times’ news blog on Oct. 1 -- the sign read, \"No mother should have to fear for her son's life every time he leaves home\" (emphasis added). It also includes the hashtags #blacklivesmatter and #stayhuman.", "But words on the sign were doctored by a user of the social media site Imgur. Initially, the user posted this statement with the retouched photograph: \"The black community has every reason to be angry with the police, and the brutality they inflict. But making a martyr out of the kid that robbed a store and attacked a police officer is just mind boggling. Micheal (sic) Brown is one of the worst things to happen to race relations in a long time.\"", "At some point after the doctored version of the image began circulating, the user acknowledged that he had changed the picture: \"Edit: Yes, I shopped this. It captured mine, and many others, frustration with this whole situation.\"", "Our ruling", "A photograph that went viral purports to show a protester in Ferguson, holding a sign that said, \"No mother should have to fear for her son's life every time he robs a store.\" However, the photo was manipulated by a social media user, who later acknowledged the alteration. The change in wording turns the sign’s message completely on its head, so we rate the claim Pants On Fire.", "Chain email provided by a PolitiFact reader", "Riverfront Times, \"Arrested in Ferguson: What It's Like to Go to Jail While Protesters Negotiate Your Release,\" Oct. 1, 2014", "Imgur, user page for Bdawgid, accessed Dec. 4, 2014", "Snopes.com, \"Doth Protest?,\" Dec. 2, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]