["About this rating", "In November 2016, fake news web sites began circulating a claim that an African billionaire by the name of Femi Adenugame was offering $1 million to any Americans who chose to leave the U.S. due to Donald Trump's electoral victory:", "Concerns about Donald Trump becoming president has prompted a South African billionaire to invest his fortune in helping African-Americans leave the United States to avoid further discrimination and inequality. With the recent media coverage exposing police brutality and racially motivated crimes against African-Americans, Femi Adenugame, has decided to put his fortune to what he believes is good use. He has created the “Back To Africa” movement in efforts to assist African-Americans in returning to their “motherland” and starting a fresh life. According to reports, Femi Adenugame has invested over $500 Million into the project. Adenugame owns 5 commercial 747 jets and a fleet of cruise ships which he plans to use to transport those who are interested in “returning” to Africa from the United States.", "The story originated with the Empire Herald, a fake news web site whose other headlines include \"Woman Arrested for Exhuming Susan B. Anthony’s Remains to Take Selfie.\" The story was also shared by News10Live, another fake news site that masquerades as the online arm of a local television news outlet.", "The image used by the Empire Herald to depict billionaire \"Femi Adenugame\" is in fact a photograph of military general Ibrahim Babangida, who was the Nigerian president between 1985 and 1993.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]