["About this rating", "On 25 October 2018, the blog for the right-wing legal activist organization Judicial Watch reported that they had \"obtained exclusive information and photos from Guatemalan authorities revealing that they have recovered seven unaccompanied minors from human smugglers working inside the caravan.\"", "However the report, which included a blurred image of several children in what appeared to be a dirty bathroom, contained no specifics by which we could independently verify it. We reached out to Guatemalan police and are awaiting an answer, and we also sent Judicial Watch a list of detailed questions about the source of their information. The latter organization's president, Tom Fitton, didn't answer our questions, claiming their source was \"confidential.\"", "The caravan in question originated in Honduras on 12 October 2018, when thousands of migrants banded together for safety and began the journey on foot toward the U.S.-Mexico border. Since its inception, the caravan has been the source of a number of hoaxes, conspiracy theories and continuous fear mongering in the lead-up to consequential midterm elections that could tip the political balance of power in the United States.", "Judicial Watch thus far has been the only source of information on this subject  we've located. The information, they claimed, was given to them by unidentified Guatemalan authorities:", "Judicial Watch has obtained exclusive information and photos from Guatemalan authorities revealing that they have recovered seven unaccompanied minors from human smugglers working inside the caravan. The children have been taken into custody and they are being provided with food, water and medical attention, according to a high-level Guatemalan government official. The smugglers have been arrested and the broader investigation into criminal activity in the caravan is ongoing.", "A Judicial Watch team, headed by Director of Investigations Chris Farrell, spent several days on the Guatemala-Honduras border covering the illegal alien caravan, which originated in the northern Honduran city of San Pedro Sula. The team filed a number of exclusive reports and videos and met with Guatemalan President Jimmy Morales and other top government officials.", "The story was accompanied by an image of what appeared to be children in a dirty, trash-strewn bathroom:", "Using several search engines, we were unable to locate any other source for that image.", "Judicial Watch previously published a misleading report that suggested 100 ISIS terrorists were among the caravan travelers by combining two unrelated news items under one alarming headline reading \"100 ISIS Terrorists Caught in Guatemala as Central American Caravan Heads to U.S.”", "Although it was true the Guatemalan government had arrested and deported 100 people with links to the terrorist organization, this event was unrelated to, and occurred before, the caravan crossed into Guatemala. The organization previously falsely reported that an ISIS attack was imminent on the border.", "Farrell, the head of the Judicial Watch \"team\" that was responsible for the report, was banned by Fox News for making false allegations on air that billionaire philanthropist George Soros was funding the migrant caravan. Soros, who is Jewish, is the frequent target of anti-Semitic conspiracy theories and received, along with several prominent Democrats and CNN, a pipe bomb device in his mailbox in late October 2018.", "Robert Bowers was arrested on suspicion of murdering 11 Jewish synagogue members in Pittsburgh just days after the bombs were delivered and has been charged with various hate crimes. Before the shooting, Bowers posted messages on social media referencing conspiracy theories about Jewish people funding the caravan.", "Oxfam.   \"Oxfam Helping People in Migrant Caravan Stranded in Guatemala with Humanitarian Aid.\"\r\n    24 October 2018.", "Relman, Eliza.   \"A Variety of Conspiracy Theories and Misleading Claims Have Sprung Up Around the Migrant Caravan in Mexico.\"\r\n    Business Insider.   25 October 2018.", "Brunner, Rob.   \"We Tried to Ask DC Council Candidate Michael Bekesha About a Judicial Watch Leader’s Apparent Anti-Semitic Comments and It Didn’t Go So Well.\"\r\n   Washingtonian.   29 October 2018.", "Fuster, Jeremy.   \"Fox News Bans Guest for Making False Accusations Against Democrat Donor George Soros.\"\r\n    The Wrap.   28 October 2018.", "Dan Evon is a former writer for Snopes.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]