["A supporter holds up a sign as Democratic presidential candidate former Vice President Joe Biden speaks during a campaign event at Riverside High School in Durham, N.C., on Oct. 18, 2020. (AP)", "“Three red banners” has nothing to do with the Biden campaign. The phrase is a socialist slogan that was used in China during the late 1950s.", "The Biden campaign logo was inspired by red stripes on the American flag.", "For months, President Donald Trump and his allies have falsely accused Democratic presidential candidate Joe Biden of being a socialist. They’ve also attacked Biden for his son’s ties to China.", "Some Facebook users say they can prove Biden’s affinity for China — look no further than his campaign logo, they say.", "\"Ever wonder why the E in the Biden poster is 3 red stripes. It has a meaning,\" says an Oct. 20 post. \"Click the Wikipedia link below to see. Coincidence? I don’t think so!\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) We found hundreds of similar posts using CrowdTangle, a social media insights tool — several of which point back to an Oct. 20 post on Gab, a right-wing social media platform.", "We took the bait and researched \"three red banners.\" It has nothing to do with the Biden campaign.", "The phrase is an ideological slogan that was used in China during the late 1950s. The \"three red banners\" referred to three aspects of Chinese socialism: the Great Leap Forward, the General Line and the People’s Commune.", "\"The purpose of the slogan ‘Three Red Banners’ was to help make China a strong and prosperous country in the shortest possible period by building ‘socialism with Chinese characteristics,’ that is, by avoiding certain limitations built into other nations’ experiments with communist/socialist models,\" wrote X.L. Woo in \"Two Republics in China: How Imperial China Became the PRC.\"", "Facebook users say the three red stripes that make up the \"E\" in Biden’s name in his campaign logo refer to this decades-old Chinese socialist slogan, which Woo wrote \"ended in failure.\" Biden’s campaign says otherwise.", "\"The three red lines were inspired by the American flag, the red stripes on the American flag,\" a Biden campaign spokesperson told PolitiFact.", "The rest of the Biden campaign’s logo is blue and white, alluding to the other colors of the flag. We could find no other evidence that the three red stripes are intended to pay homage to China.", "The post makes an inaccurate and ridiculous claim. We rate it Pants on Fire!", "CrowdTangle, accessed Oct. 21, 2020", "Encyclopedia Britannica, China, accessed Oct. 21, 2020", "Facebook post, Oct. 20, 2020", "Interview with a Biden campaign spokesperson, Oct. 21, 2020", "PolitiFact, \"Fact-checking claims about Hunter Biden, Joe Biden, and China,\" Oct. 19, 2020", "PolitiFact, \"Trump’s false claim that Biden is a socialist,\" Oct. 15, 2020", "\"Two Republics in China: How Imperial China Became the PRC,\" X.L. Woo, Aug. 1, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]