["By Caitlin Quinn", "Posted on October 22, 2020", "Facebook posts falsely claim that at his Oct. 15 town hall event, former Vice President Joe Biden said he grew up in Section 8 housing. Biden actually said he lived in a building which “became Section 8 housing much later.”", "Democratic presidential nominee Joe Biden often refers to his working-class upbringing in Scranton, Pennsylvania, and Claymont, Delaware. However, Biden’s most recent comments about his childhood have been misquoted in a number of Facebook posts.", "These viral memes falsely claim that at the televised town hall in Philadelphia on Oct. 15, Biden said he grew up in Section 8 housing. One such Facebook post, which has been shared nearly 4,000 times, claims: “Biden said today, He lived in Section 8 housing as a little boy…Section 8 didn’t begin until 1974…”", "But that’s not what he said.", "It is true that Section 8 housing did not exist in the 1940s, when Biden was a child. The program was created by the U.S. Department of Housing and Urban Development and authorized by Congress in 1974. It gives private landlords a rental subsidy to rent apartments and homes to qualified low-income tenants.", "The transcript of the town hall meeting shows that Biden did not say he grew up in Section 8 housing — but that the building he once lived in later became Section 8 housing.", "Biden, Oct. 15: Look, this is the way every other, how do most, like my dad, he lost his job up in Scranton and it took him three years to be able — he moved down to Delaware to Claymont (inaudible), a little steel town. And sent us home to our grandpop to live with him. We finally got back, we lived in apartments. Became Section 8 housing much later, it wasn’t — it was just normal apartments. But it took him five years to be able to buy a home.", "Clearly, the social media posts misquote what Biden said at the town hall meeting.", "Biden often tells this story about his childhood. A day after the ABC News town hall, Biden repeated it during a campaign speech in Michigan. “We got an apartment we lived in, and ended up being Section 8 housing years later, but it was decent,” Biden said. “We were happy.”", "And, before he clinched his party’s nomination, Biden said this at a Feb. 17 town hall in Nevada: “We moved down to a little steel town called Claymont, Delaware. It took three years, but my dad finally got us a house and we lived in what is now Section 8 housing, was Section 8 housing. There wasn’t any Section 8 then.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "“Joe Biden” Britannica.com. Accessed. 21 Oct 2020.", "Joe Biden Reno, Nevada Town Hall Campaign Transcript — February 17, 2020. Rev.com. 17 Feb 2020.", "Joe Biden Southfield, MI Speech on Health Care. Rev.com. 16 Oct 2020.", "Kapur, Sahil. “‘Scranton versus Park Avenue’: Biden leans into economic populist pitch” NBC. 23 Sep 2020.", "“Read the full transcript of Joe Biden’s ABC News town hall” ABC. 15 Oct 2020.", "“Section 8 Program Background Information.” HUD.gov. Accessed 21 Oct 2020.", "“What is Section 8?” Homeforward.org. Accessed 21 Oct 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]