["West Virginia Gov. Jim Justice prepares for a debate with Democratic challenger Ben Salango in Morgantown, W.Va., on Oct. 13. 2020. (AP)", "• The most recent data available, from 2018, shows that 7.98% of West Virginians are veterans, ranking it seventh among the 50 states.", "West Virginia Gov. Jim Justice recently told his Facebook followers that taking care of the state's veterans will remain near the top of his agenda if he’s reelected.", "Justice, who faces Democrat Ben Salango in his quest for a second term, wrote in the Sept. 14 post, \"West Virginia has one of the greatest percentages of veterans of any state, and I am absolutely committed to supporting them. In the next four years, it will remain a top priority for me as Governor to take care of our Veterans.\"", "West Virginia has one of the greatest percentages of veterans of any state, and I am absolutely committed to supporting...", "The question of how large West Virginia’s veteran population is has at times been tricky for politicians in the state to navigate.", "In 2018, PolitiFact West Virginia fact-checked a statement by Sen. Joe Manchin, D-W.Va., that West Virginia has \"more veterans per capita\" than any state. We rated that False, because 2016 data showed that West Virginia’s per capita veteran population ranked only 14th among the states.", "Justice’s reference to \"one of the greatest percentages\" leaves him a bit more wiggle room. We looked for the most recent data available to see if his phrasing was accurate. (His office did not respond to inquiries for this article.)", "We looked at data published by the Department of Veterans Affairs on the number of veterans in each state in 2018. We then used 2018 population estimates from the U.S. Census Bureau to determine how big a share veterans constituted in each state.", "Here are the top 10 states for veterans as a percentage of population for 2018:", "1. Alaska: 9.96%", "2. Montana: 8.70%", "3. Virginia: 8.69%", "4. Maine: 8.61%", "5. Wyoming: 8.54%", "6. Hawaii: 8.32%", "7. West Virginia: 7.98%", "8. South Carolina: 7.97%", "9. Oklahoma: 7.76%", "10. Alabama: 7.64%", "We believe that ranking seventh out of 50 states qualifies as having one of the largest percentages of veterans in the country.", "Justice said, \"West Virginia has one of the greatest percentages of veterans in any state.\"", "Justice phrased his statement carefully — and accurately. The most recent data available, from 2018, shows that 7.98% of West Virginians are veterans, ranking it seventh among the 50 states.", "We rate the statement True.", "Jim Justice, Facebook post, Sept. 14, 2020", "Department of Veterans Affairs’ National Center for Veterans Analysis and Statistics, veteran population index page, accessed Oct. 14, 2020", "U.S. Census Bureau, \"Annual Estimates of the Resident Population for the United States, Regions, States, and Puerto Rico: April 1, 2010 to July 1, 2019,\" accessed Oct. 14, 2020", "PolitiFact West Virginia, \"Joe Manchin wrong that W.Va. is first in nation in veterans,\" Oct. 11, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]