["By Saranac Hale Spencer", "Posted on August 3, 2018", "Q: Is California forcing “schools to show kids ‘gay sex'”?", "A: No. California law requires the state’s history curriculum to include “the role and contributions of” LGBT people.", "Is it true the governor wants gay pornography taught in schools?", "With the new school year around the corner, a bogus claim about California’s inclusion of lesbian, gay, bisexual and transgender figures in the state’s history curriculum is making the rounds on Facebook.", "Readers began asking us about the issue after pictures of California Gov. Jerry Brown started showing up on Facebook with the text: “SODOM AND GOMORRAH: CALIFORNIA GOV. JERRY BROWN TO FORCE SCHOOLS TO SHOW KIDS ‘GAY SEX’ AS PART OF INCLUSIVE LGBT CURRICULUM.”", "It’s not true.", "The claim started out on the notoriously unreliable website YourNewsWire, which posted this story in December 2017: “California Gov. Jerry Brown To Force Schools To Show Kids ‘Gay Sex.’” Since then, it has been shared on 20 different Facebook pages and reached a social media audience of 2.8 million in total, according to data from Crowd Tangle.", "A month after it first went up, that story was copied and used with the headline that’s now making the rounds on Facebook.", "Although that version of the story doesn’t appear to have been shared widely, the photo and headline that were taken from it have been shared more than 32,000 times since being posted on Facebook on July 9.", "The problem is, it’s spreading misinformation loosely related to something that is true.", "It is true that California amended its education law in 2011 to require the inclusion of “the role and contributions of” lesbian, gay, bisexual and transgender Americans in the study of history for primary school students. The law had previously required the inclusion of contributions of “both men and women, Native Americans, African Americans” and other ethnic groups “to the economic, political, and social development of California and the United States of America.”", "The amended law took effect in 2012, but the new textbooks that reflect the curriculum change will be used for the first time in the 2018 school year — the new books were approved by the state’s board of education in November 2017.", "The books will include “a more complete picture of the accomplishments and challenges faced by LGBT individuals in American history and culture, such as astronaut Sally Ride and comedian Ellen DeGeneres,” according to a press release from California’s superintendent of public instruction, Tom Torlakson.", "School districts aren’t required to use the books, according to the release. They may choose to use other materials as long as they comply with the law.", "And nowhere in the law does it mandate “the use of gay pornography in elementary schools in order to teach children about LGBT sex,” as the YourNewsWire story claims. That’s purely made up.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "Adl-Tabatabai, Sean. “California Gov. Jerry Brown To Force Schools To Show Kids ‘Gay Sex.’” Yournewswire.com. 28 Dec 2017.", "California Legislature. Education Code — 51204.5. As amended, 2011. Accessed 1 Aug 2018.", "California State Board of Education. Minutes for the Nov. 8-9, 2017 meeting. Discussion is on page 19.", "Torlakson, Tom. California State Superintendent of Public Instruction. “State Board Approves Instructional Materials that Give K–8 Students a Deeper, Broader Understanding of History and Social Sciences.” 9 Nov 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]