["Recently, several accounts on Twitter posted a video of a policeman pinning down a young boy. It was shared with the text, “An Israeli policeman strangles a Palestinian child to death Saturday during the demonstration of the US embassy in Jerusalem. Despite numerous attempts to download this video on Youtube, it has been systematically removed. Please make this video viral.”", "On December 3, Twitter user @wasim_dr was among those who shared the video. It was retweeted over 200 times.", "An Israeli policeman strangles a Palestinian child to death Saturday during the demonstration in front of the US embassy in Jerusalem. The innocent boy even read Kalima e shahadat before dying. Please make this video viral so that it reaches all the media. 💔😭 pic.twitter.com/VRNOXxgrCS", "— Wasim Bariوسیم باری (@wasim_dr) December 3, 2019", "The same video was viral on Twitter with identical narrative in 2017.", "An Israeli police man strangles a palestinian Child to death on saturday during the protest of the US embassy move to Jerusalem. Not bein shown anywhere. Why stand and record are you not human?! Is this real is this what we have come to? #retweet #Israel #palestine #murder pic.twitter.com/CweFcwi9dZ", "— Faheem (@Faslam_aslam) December 17, 2017", "Alt News performed a reverse image search of a screenshot from the video and found an April 20, 2015 report by Aftenposten, a Norway-based newspaper. According to the report, security guards in Malmö, Sweden, used violent measures to control a minor boy who tried to sneak inside a train. Aftenposten cited a report from April 20, 2015, in Sydsvenskan, a daily newspaper published in Scania, Sweden.", "We further did a keyword search on Google – “Sweden police attack boy train” – and found a February 2015 report in The Local, a European news publisher. The article included the video by Sydsvenskan.", "The Local reported, “The guard, employed by security company Svensk Bevakningstjänst (at Malmö central station), had detained the (nine-year-old) boy and his 12-year-old friend after they were thrown off a train for travelling without a ticket.”", "In November 2015, a report by The Observers (France 24) stated, “The boys had run away from a care home and several witnesses said that they were not able to speak Swedish.”", "An article in The Straits Times identified the boy as Moroccan and reported, “The security guard has been suspended pending a police investigation into the incident…”", "“After the incident, the boy was returned to a care home where he had been placed after arriving in Sweden, but within a few hours ran away with a 12-year-old boy, described in the media as being his half brother, from a car taking them to local Migration Board offices. He was found by police in neighbouring Denmark on Friday, in the midst of a national outcry over racism among security staff and police,” added the report.", "The report by Sydsvenskan stated that the guards were not legally prosecuted for their violent intervention against two young minor boys at the Malmö central.", "Therefore, the social media claim that an Israeli policeman strangled a Palestinian child to death is false. The video is of a 2015 incident in Malmö, Sweden where a security guard at the Malmö central station attacked a nine-year-old after he boarded a train without a ticket.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]