["On August 23, Facebook page Pyara Uttarkhand posted a video where three people are being thrashed by a mob. The video was shared with the narrative that child kidnappers were caught by locals in Himachal Pradesh’s Chail Chowk area. It has been shared more than 1,400 times and viewed close to 50,000 times. “Be cautious, warning: you all take special care of your children.”, warned the message.", "सावधान रहें चेतावनी : आप सभी अपने बच्चे का विशेष ध्यान रखें चैलचौक हिमांचल में बच्चा गिरोह समझकर औरतो के भेष में घूम रहे व्यक्तियों को पकड़ा, जनता ने किया पुलिस के हवाले ।", "Posted by प्यारा उत्तराखंड on Friday, 23 August 2019", "The same page has posted the same video with the identical next on a few more Facebook groups.", "Alt News found that the video depicts an incident where two men and a woman, allegedly impersonating as transgenders, were beaten by a mob over false accusations of being child-lifters. The incident took place in Gohar town of Mandi district, Himachal Pradesh. According to a News 18 report, they were roaming in the town since the last three days with the said get-up and collecting donations (chanda) from people. Locals got suspicious of the trio and started questioning them. The report stated that these people were giving tortuous answers to locals’ queries which caused the crowd to get even more suspicious and eventually beat them up. All the three group members including a husband and wife duo are residents of Punjab.", "However, in a local news report posted below, one of the group members can be heard saying in Punjabi that they were not impersonating as transgenders but it’s their family business of roaming on the streets while enacting different roles and entertaining people.", "Alt News contacted Mandi district police. SP Gurdev Chand Sharma said, “They were beaten up due to some misunderstanding. These people [trio] were drunk. It was identified that they are resident of Rupnagar [a district in Punjab]. A rumour was spread that these are child-kidnappers.” When asked whether an FIR was lodged against the mob or the people accused of child-lifting, he said, “They have been released. No FIR was lodged from either side.”", "In conclusion, a video where people, allegedly impersonating as transgenders, were falsely accused of child-kidnapping and beaten was shared on social media to further push rampant child-lifting rumours.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]