["By D'Angelo Gore and Eugene Kiely", "Posted on June 25, 2019 | Updated on June 26, 2019", "President Donald Trump falsely suggested that California admitted that “a million votes” were cast as part of “much illegal voting” in that state during the 2016 presidential election.", "The president made those remarks — and several claims that we have written about before — in an interview that aired on NBC’s “Meet the Press” on June 23.", "When host Chuck Todd asked Trump about losing the popular vote to Hillary Clinton, Trump said, “There were a lot of votes cast that I don’t believe” were legal, and he singled out California.", "Trump, “Meet the Press,” June 23: Take a look at Judicial Watch, take a look at their settlement where California admitted to a million votes. They admitted to a million votes.", "Todd: A million votes of what?", "Trump: Take a look at judicial —", "Todd: What are you talking about?", "Trump: Judicial Watch made a settlement. There was, there was much —", "Todd: About what?", "Trump: — there was much illegal voting.", "California did not admit that 1 million illegal votes were cast.", "In the settlement, announced in January, California and Los Angeles County election officials agreed to start the process of removing the names of inactive voters from that county’s registration rolls.", "The agreement stemmed from a 2017 lawsuit in which Judicial Watch, a conservative watchdog group, argued that California and Los Angeles County were not meeting the National Voter Registration Act’s requirements to cancel inactive registrations.", "Judicial Watch said “there were approximately 1,565,000 registrations on Los Angeles County’s inactive file of registered voters,” and that the registrations mostly belong to individuals who have moved out of the county or state or had passed away.", "Per the settlement, the county will send notices to people it determines to be inactive, and if they do not respond, or do not vote in the next two federal general elections, their names will be removed from voter rolls. California agreed to notify its other counties to do the same.", "But the settlement did not say that there was any fraudulent voting.", "“No matter how much he repeats them, Trump’s lies about voter fraud are patently untrue,” California Secretary of State Alex Padilla said in a statement to FactCheck.org. “Specifically, the settlement with Judicial Watch, Los Angeles County, and the Secretary of State contains absolutely no admission to or evidence of ‘illegal votes.’ The President’s claims are untrue and yet another distortion aimed at undermining confidence in our elections.”", "Los Angeles County Clerk Dean Logan’s office also told us there was no such admission.", "“We have simply agreed to comply with the NVRA as interpreted by the Supreme Court and nothing in the agreement will jeopardize even one eligible Los Angeles County voter,” Logan’s office said in an email. “The agreement is about voter registration record keeping and interpretation of federal law, not about votes cast in any election.”", "Judicial Watch did not respond to our request for comment.", "Trump, as we’ve written, has repeatedly claimed without evidence that widespread voter fraud caused him to lose the popular vote to Clinton by nearly 3 million votes.", "Update, June 26: A spokesman for the Los Angeles County Registrar-Recorder/County Clerk’s Office confirmed that 1.51 million notices have been sent to inactive voters.", "The president also repeated several claims that we have previously debunked. Here are some of them:", "Zero Tolerance: In defending his administration’s policy that had caused families to be separated at the border, Trump said, “You know, under President Obama you had separation. I was the one that ended it.” That’s misleading.", "As we have written, there were some separations under previous administrations, but the Trump administration’s “zero tolerance” policy referred all illegal border crossers for criminal prosecution and, therefore, separated much larger numbers of parents from their children.", "“Historically, these separations were rare and occurred because of circumstances such as the parent’s medical emergency or a determination that the parent was a threat to the child’s safety,” the Office of the Inspector General for the Department of Health and Human Services said in a January 2019 report.", "But that changed, the report goes on to say, after the “zero tolerance” policy was put into effect in April 2018. “As a result, DHS separated large numbers of alien families, with adults being held in Federal detention while their children were transferred to the care of the Office of Refugee Resettlement (ORR) within the Department of Health and Human Services (HHS),” the IG report said.", "As we’ve written before, Trump “stopped” his own policy — not Obama’s.", "Iraq War: Trump repeated his unsubstantiated claim that he was against the war in Iraq before it started in March 2003. “I was against going into Iraq for years and years. And before it ever happened I was against going into Iraq,” he told Chuck Todd.", "As we have written, there is no evidence that we could find, however, that he spoke against the war before it started, although we did find he expressed early concerns about the cost and direction of the war a few months after it started.", "Iran Nuclear Agreement: In his criticism of the Iran nuclear deal, the president once again misleadingly said that Obama “gave them $150 billion.”", "As we have written previously, the agreement, known as the Joint Comprehensive Plan of Action, included China, France, Germany, Russia, the United Kingdom, the United States and the European Union. It lifted some sanctions, including a freeze on Iran’s assets that were held largely in foreign banks. It wasn’t a unilateral decision by the United States, nor was it U.S. money.", "Also, the $150 billion figure used by Trump is a high-end estimate of the total that was freed up after some sanctions were lifted. But, as we have written, the U.S. Treasury Department has estimated that figure at about $50 billion in “usable liquid assets,” according to 2015 testimony from Adam Szubin, acting under secretary of treasury for terrorism and financial intelligence.", "U.S. Economy: Trump misrepresented the state of the U.S. economy that he inherited in January 2017, claiming that “when I took over, this country, the economy was ready to collapse.” Actually, Trump inherited an economy experiencing steady if uneven growth. (See our Jan. 20, 2017, item, “What President Trump Inherits.”)", "In the interview, Trump mentioned three economic measures — gross domestic product, jobs and consumer confidence. Real GDP had been trending up under Trump, growing at an annual rate of 3.2 percent during the first quarter of this year, after going up 2.9 percent in 2018 and 2.2 percent in 2017. However, the Federal Reserve Bank of Atlanta’s “GDPNow” forecast projects that the second-quarter growth rate will fall to 2.0 percent. It’s worth noting, too, that the U.S. has had positive growth every year since 2010, reaching a high under Obama of 2.9 percent in 2015.", "As for employment, the economy had added nearly 2.5 million jobs in the 12 months before Trump took office, measuring from January 2016 to January 2017. Under Obama, the economy gained jobs for 76 straight months, starting in October 2010 – a record at the time that has since been extended for another 28 months under Trump.", "Consumer confidence in the economy increased under both Obama and Trump. The University of Michigan’s Surveys of Consumers reported that its Index of Consumer Sentiment was at 57.6 in October 2008, prior to Obama’s election, and eight years later it was at 87.2 in October 2016, prior to Trump’s election. The current level, as of May, is 100.", "WikiLeaks: When asked why he used emails and documents stolen by Russia and released by WikiLeaks during the 2016 campaign, Trump responded by saying, “[H]ow would I even know that?”", "But Trump repeatedly cited the stolen material at his rallies, even after the Department of Homeland Security and Office of the Director of National Intelligence issued a joint statement on Oct. 7, 2016, saying that the U.S. intelligence community is “confident” that hacks into the email systems of the Democratic Party and its officials were directed by “Russia’s senior-most officials.”", "As we have written, Trump dismissed U.S. intelligence reports that Russia was behind the hacks at the final two debates on Oct. 9, 2016, and Oct. 19, 2016. In the last debate, Trump said “our country has no idea” who was behind the hacks.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]