["About this rating", "First introduced in Congress in 2001 and last revisited in 2017, the so-called DREAM Act (which stands for the Development, Relief, and Education for Alien Minors Act) was aimed at providing a path to permanent residency in the United States for children of undocumented immigrants. Every attempt to pass the legislation has failed to date, as politicians continue to kick the can down the road to the next administration.", "However, in June 2012, the DREAM Act begat DACA (Deferred Action for Childhood Arrivals), an executive action signed by President Obama that allowed qualified undocumented minors to apply for work permits and protection from deportation. To be eligible, applicants had to be under the age of 31, must have arrived in the U.S. before turning 16, lived in the country continuously since 2007, be enrolled in school or possess the equivalent of a high school diploma, and never been convicted of a serious crime.", "By the time the Trump administration rescinded the program in September 2017 (on the spurious grounds that it was an abuse of executive power), an estimated 800,000 people — most of them under the age of 25 — had applied for DACA protection. In honor of the ill-fated DREAM Act, and to reflect that they have a dream of someday becoming citizens, they have come to be known as \"Dreamers.\"", "With DACA gone, the Dreamers' future once again rests with Congress. Members of both parties have vowed to pass legislation granting them protections comparable to DACA's, an idea supported by the majority of the American people. Even President Trump backs the effort, having suggested to the New York Times that Dreamers be given a path to citizenship:", "Over a period of 10 to 12 years, somebody does a great job, they work hard, that gives incentive to do a great job. Whatever they're doing, if they do a great job, I think it's a nice thing to have the incentive of, after a period of years, being able to become a citizen.", "A vocal minority opposes that idea, however, and some of its detractors have taken to social media to spread anti-Dreamer (and other anti-immigrant) propaganda. One example making the rounds on Facebook consists of a list of so-called \"fun facts\" intended to persuade readers that Dreamers are bad people and any government efforts to help them amount to a \"scam\":", "These two groups differ not only in size, but also in attributes such as how well educated their members are and how many have criminal records. This is because DACA imposed strict requirements in those areas.", "For purposes of this fact check, we're defining \"Dreamers\" as those who actually enrolled in the DACA program between 2012 and 2017. We've chosen this route for two reasons: one, it has been, to date, the working definition used by major news and polling organizations such as the New York Times, Associated Press, and the Pew Research Center; and two, in the single instance where we determined that the \"Dreamers fun facts\" meme reported a statistic accurately (the military participation of Dreamers), it pertained (and only makes sense if it pertains) to the group of actual DACA enrollees, not the larger DACA-eligible group. (Barring a change in regulations, non-DACA undocumented immigrants cannot enlist in the military.)", "CLAIM: \"792,000 Dreamers (88 percent) are over 25 years old.\"", "STATUS: False.", "Only about 280,000 (35 percent) of the 800,000 Dreamers who were active DACA recipients as of September 2017 were over 25 years old. None are older than 36 because of the age-of-entry requirements imposed by DACA. The average age of Dreamers is 24.  [Source: Pew Research Center]", "CLAIM: \"900 Dreamers (less than 1 percent) serve in our military.\"", "STATUS: True.", "Generally speaking, undocumented immigrants aren't allowed to join the U.S. military, so this statistic can only apply to DACA enrollees, who were granted special permission to enlist in 2014.", "As of September 2017, there were close to 900 Dreamers serving in the military thanks to that program, according to the Pentagon. That is less than .1 percent of all DACA recipients. For comparison, according to a USA Today report .4 percent of the general population currently serves in the military. [Sources: USA Today; Pew Research Center]", "CLAIM: \"743,000 Dreamers (83 percent) do not have a college degree.\"", "STATUS: False.", "In a 2017 survey of approximately 3,000 Dreamers, the portion of those aged 25 or older who said they hold a four-year college degree (or higher) was close to 35 percent. That means 65 percent (approximately 520,000) do not yet have a college degree. Comparing that to the larger U.S. population, 2015 census figures say that roughly 32 percent of Americans 25 or older have a least a four-year college degree (meaning 68 percent do not). [Sources: T. Wong DACA Survey; U.S. Census Bureau]", "CLAIM: \"189,000 Dreamers dropped out of high school early (That is roughly 21 percent).\"", "STATUS: False.", "The only statistic we were able to find comparable to this applied not to Dreamers, but to the larger population of potentially DACA-eligible immigrants. According to a 2014 study, roughly 20 percent of those aged 19 or older had not completed high school or the equivalent (as compared to a 5.9 percent high school dropout rate for the entire U.S. population).", "We found no such statistic for DACA enrollees, who in any case would have been required under government guidelines to be \"currently in school, have graduated or obtained a certificate of completion from high school, have obtained a general education development (GED) certificate, or are an honorably discharged veteran of the Coast Guard or Armed Forces of the United States.\"  [Sources: Migration Policy Institute; U.S. Citizenship and Immigration Services; National Center for Education Statistics]", "CLAIM: \"9,000 Dreamers (1 percent) are incarcerated.\"", "STATUS: False", "We were unable to find any sources documenting the claim that 9,000 Dreamers are (or were) incarcerated.", "It may be that the 1 percent figure was loosely derived from a Cato Institute policy brief which said that the incarceration rate among the 1.1 to 1.9 million immigrants who were otherwise DACA-eligible in 2015 was .98 percent. (What's most interesting about that figure is that it's actually a lower incarceration rate than that of the native-born population, according to the Cato Institute).", "The closest comparable statistic we found for actual DACA enrollees came from an accounting by USCIS of the number of those whose \"deferred action\" status was terminated between 2012 and 2017 due to criminal convictions or arrests: 2,030 (or approximately .25 percent of the entire Dreamer population).  [Sources: Cato Institute; U.S. Citizenship and Immigration Services]", "CLAIM: \"657,000 Dreamers (73 percent) receive some form of welfare.\"", "STATUS: False.", "By law, undocumented immigrants (including DACA recipients) are not eligible for means-tested welfare benefits such as cash assistance, food stamps, or Medicaid. Under a provision of DACA, enrollees who reached retirement age after having worked and paid taxes in the United States for at least 10 years could have qualified for Social Security and Medicare benefits. [Source: National Immigration Law Center]", "It is important in policymaking matters to carefully weigh the facts and how populations will be affected. One can only hope that those same legislators do not govern by meme.", "Bier, David.  \"Five Myths About DACA.\"\r\n  The Washington Post.  7 September 2017.", "Broder, Tanya, Moussavian, Avideh, and Blazer Jonathan.  \"Overview of Immigrant Eligibility for Federal Programs.\"\r\n  National Immigration Law Center.  December 2015.", "Chishti, Muzaffar and Bolter, Jessica.  \"Trump Administration Rescinds DACA, Fueling Renewed Push in Congress and the Courts to Protect Dreamers.\"\r\n  Migration Policy Institute.  15 September 2017.", "Dickerson, Caitlin.  \"What Is DACA? Who Are the Dreamers? Here Are the Basics.\"\r\n  The New York Times.  23 January 2018.", "Gonzalez, Roberto, et al.  \"Taking Giant Leaps Forward.\"\r\n  Center for American Progress.  22 June 2017.", "Greenwood, Max.  \"Poll: Nearly 9 in 10 Want DACA Recipients to Stay in U.S.\"\r\n  The Hill.  18 January 2018.", "Haberman, Maggie, Rogers, Katie, and Shear, Michael.  \"Trump Says He Is Open to a Path to Citizenship for 'Dreamers.'\"\r\n  The New York Times.  24 January 2018.", "Horton, Alex.  \"The Military Looked to 'Dreamers' to Use Their Vital Skills. Now the U.S. Might Deport Them.\"\r\n  The Washington Post.  7 September 2017.", "Kessler, Glenn.  \"The Debate Over DACA: A Guide to the Numbers Used by Politicians.\"\r\n  The Washington Post.  23 January 2018.", "Korte, Gregory, Gomez, Alan, and Johnson, Kevin.  \"Trump Administration Struggles With Fate of 900 Dreamers Serving in the Military.\"\r\n  USA Today.  7 September 2017.", "Krogstad, Jens Manuel.  \"DACA Has Shielded Nearly 790,000 Young Unauthorized Immigrants From Deportation.\"\r\n  Pew Research Center.  1 September 2017.", "Landgrave, Michelangelo and Nowraster, Alex.  \"The Dreamer Incarceration Rate.\"\r\n  Cato Institute.  30 August 2017.", "Lopez, Gustavo and Krogstad, Jens Manuel.  \"Key Facts About Unauthorized Immigrants Enrolled in DACA.\"\r\n  Pew Research Center.  25 September 2017.", "McHugh, Margie.  \"Diploma, Please: Promoting Educational Attainment for DACA- and Potential DREAM Act-Eligible Youth.\"\r\n  Migration Policy Institute.  September 2014.", "Ryan, Camille L. and Bauman, Kurt.  \"Educational Attainment in the United States: 2015.\"\r\n  U.S. Census Bureau.  March 2016.", "Siskin, Alison.  \"Noncitizen Eligibility for Federal Public Assistance: An Overview.\"\r\n  Congressional Research Service.  12 December 2016.", "Wong, Tom K.  \"New Study of DACA Beneficiaries Shows Positive Economic and Educational Outcomes.\"\r\n  Center for American Progress.  18 October 2016.", "Wong, Tom K., et al.  \"DACA Recipients' Economic and Educational Gains Continue to Grow.\"\r\n  Center for American Progress.  28 August 2017.", "Zong, Jie, et al.  \"A Profile of Current DACA Recipients by Education, Industry, and Occupation.\"\r\n  Migration Policy Institute.  November 2017.", "National Center for Education Statistics.  \"Dropout Rates.\"\r\n  Accessed 25 January 2018.", "National Immigration Law Center.  \"DACA and DAPA Access to Federal Health and Economic Support Programs.\"\r\n  30 January 2015.", "United States Citizenship and Immigration Services.  \"DACA Terminations Related to Criminal and Gang Activity by Fiscal Year.\"\r\n  2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]