["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In May 2020, social media users began sharing an image purportedly showing a receipt from a restaurant that displayed a \"COVID-19 surcharge\" tacked on to the total:", "The receipt appeared to have originated with the Kiko Japanese Steakhouse & Sushi Lounge in West Plains, Missouri. And according to a report from Springfield, Missouri, television station KYTV, some restaurants in that area -- including Kiko Japanese Steakhouse -- had begun adding 5% COVID-19 surcharges to their bills to help offset increased food costs resulting from the COVID-19 coronavirus disease pandemic:", "Take a look at your food receipts - you may see a new COVID-19 surcharge added to your total. In West Plains, several restaurants are adding a surcharge fee to help absorb costs.", "\"It's not a tax. It's basically just a small percentage to cover all of our extra expenses,\" Bootleggers BBQ owner Brian Staack explained.", "Ozark Cafe, KiKo Japanese Steakhouse and Bootleggers BBQ all are now adding a 5 percent COVID-19 surcharge.", "Their food suppliers don't have the supply of meat and proteins and prices are climbing across the board.", "\"Everyday there's something else that they can't get or the prices have gone up exorbitantly,\" Ozark Cafe co-owner Heather Hughes told KY3.", "\"Our fillet prices, our rib eyes, most of our customer steak and even our shrimp now is becoming double in price. Plus, our chicken,\" Kiko manager Sarah Sherwood exclaimed.", "Additionally, Kiko Japanese Steakhouse was prompted by the reported harassment of their employees to explain the reasons behind the surcharge in a Facebook post:", "Recently our employees been getting harassed due to some peoples miss-use the actual picture of our receipt from our actual customer that being going around on social media, even trending on twitter due to the surcharge title!", "Please understand we are not doing this to take advantage of you guys! We are doing this hoping we can adjust the surcharge weekly rather than just raise all of our prices on our menu due to increase prices from our supplier on meat,poultry,seafood & produce. Almost all of us here getting our supply through the same supplier. So why are we the one that being harassed??!! Stop calling names to my employees!! They are just working there, go ask the meat packer not us!! We are just buying it from them!! Because somewhere high up the food supply meat chain is broken & causing this prices going up!!", "Kiko also stated that they were revoking the surcharge due to the negative reaction toward it spawned by social media:", "Therefore we will take the surcharge off from our system & we are truly apologize, we have to raise all of our prices!! We are even making a lots of good promo deal so you guys still can enjoy our meal with a low cost but due to prices going up & low margin we have to raise our prices.", "According to KYTV, all the restaurant owners in West Plains who implemented such surcharges declared that they were temporary and would be removed once food prices dropped.", "Deere, Michael.   \"Several West Plains, Mo. Restaurants Begin Adding 5 Percent COVID-19 Surcharge to Bills.\"\r\n    KYTV.   8 May 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]