["About this rating", "CFLs contain mercury, a potentially dangerous substance that escapes from broken CFLs into the immediate surroundings, and therefore the breakage of a CFL bulb should be handled by carefully removing the broken bulb and its contents from a home.", "The amount of mercury contained in one CFL bulb poses a grave danger to a home’s inhabitants, and the mercury dispersed by one broken CFL bulb needs to be dealt with only by an environmental clean-up crew.", "Compact Fluorescent Lamps (CFLs), whose use is estimated to result in a $47 savings in energy costs over the life of each bulb versus incandescents, have had their critics. They take longer to switch on. Regular CFLs won't work with dimmer switches. They can interfere with radios, cordless phones, and remote controls.", "They also contain mercury, a fact that causes no small amount of concern in light of how dangerous that substance is. Yet the amount housed in each bulb is very small, about 4 or 5 milligrams, which in volume is about the size of the period at the end of a sentence. (By comparison, old-style mercury thermometers contain about 500 milligrams of mercury, an amount equal to the mercury found in 125 CFL bulbs.)  And, provided the bulbs aren't broken open, none of that leaches into the home.", "Like batteries, used CFLs need to be disposed at a toxic waste depot rather than tossed out with the ordinary household trash. Because mercury is cumulative, this poisonous element would add up if all the spent bulbs went into a landfill. Instead, the mercury in dead bulbs is reclaimed at such depots and recycled.", "As to the potential for harm posed by mercury escaping from broken bulbs, says the King County Hazardous Waste Program: \"Crushing and breaking fluorescent lamps release mercury vapor and mercury-containing phosphor powder. These can be difficult to contain.\" Yet the recommended clean-up process does not involve calling in a HazMat team. Says the EPA in its advisory about dealing with broken CFLs:", "Before Clean-up: Ventilate the Room", "Have people and pets leave the room, and don't let anyone walk through the breakage area on their way out.\nOpen a window and leave the room for 15 minutes or more. \nShut off the central forced-air heating/air conditioning system, if you have one.", "Clean-Up Steps for Hard Surfaces", "Carefully scoop up glass fragments and powder using stiff paper or cardboard and place them in a glass jar with metal lid (such as a canning jar) or in a sealed plastic bag. \nUse sticky tape, such as duct tape, to pick up any remaining small glass fragments and powder. \nWipe the area clean with damp paper towels or disposable wet wipes and place them in the glass jar or plastic bag. \nDo not use a vacuum or broom to clean up the broken bulb on hard surfaces.", "Clean-up Steps for Carpeting or Rug", "Carefully pick up glass fragments and place them in a glass jar with metal lid (such as a canning jar) or in a sealed plastic bag. \nUse sticky tape, such as duct tape, to pick up any remaining small glass fragments and powder. \nIf vacuuming is needed after all visible materials are removed, vacuum the area where the bulb was broken. \nRemove the vacuum bag (or empty and wipe the canister), and put the bag or vacuum debris in a sealed plastic bag.", "Disposal of Clean-up Materials", "Immediately place all cleanup materials outside the building in a trash container or outdoor protected area for the next normal trash. \nWash your hands after disposing of the jars or plastic bags containing clean-up materials. \nCheck with your local or state government about disposal requirements in your specific area. Some states prohibit such trash disposal and require that broken and unbroken mercury-containing bulbs be taken to a local recycling center.", "Future Cleaning of Carpeting or Rug: Ventilate the Room During and After Vacuuming", "The next several times you vacuum, shut off the central forced-air heating/air conditioning system and open a window prior to vacuuming. \nKeep the central heating/air conditioning system shut off and the window open for at least 15 minutes after vacuuming is completed.", "Maine's Department of Environmental Protection concurs, even though they affix additional steps and cautions to the process:", "What if I accidentally break a fluorescent bulb in my home?", "The most important thing to remember is to never use a vacuum. A standard vacuum will spread mercury containing dust throughout the area as well as contaminating the vacuum. What you should do is:\n\n Ventilate the area.", "If possible, reduce the temperature.", "Wear appropriate personal protective equipment, such as gloves, safety glasses, coveralls or old clothing, and a dust mask to keep bulb dust and glass from being inhaled.", "Carefully remove the larger pieces and place them in a secure closed container.", "Next, begin collecting the smaller pieces and dust. There are several ways to do this. You can use a disposable broom and dustpan, two stiff pieces of paper or one of the many commercial mercury spill kits available.", "Put all material into an airtight plastic bag. Pat the area with the sticky side of duct, packing or masking tape. Wipe the area with a damp cloth.", "Put all waste and materials used to clean up the bulb in a secure closed container and label it \"Universal Waste - broken lamp\".", "Take the container for recycling as universal wastes. To determine where your town has made arrangements for recycling of this type of waste, call your town office or check out the Maine Department of Environmental Protection (DEP) website at  https://www.maine.gov/dep/rwm/hazardouswaste/lamp_disposal.htm Remember, the next time you replace a bulb, be sure to put a drop cloth on the floor so that any accidental breakage can be easily cleaned up.", "The advice proffered by Maine's DEP is interesting, in light of the story about the unfortunate householder whose broken bulb supposedly cost her more than $2,000 in clean-up fees. Brandy Bridges lives in Prospect, Maine, and it was Maine's DEP that sent an expert to her home to test for mercury contamination, then recommended she have a local environmental cleanup firm tackle the problem.", "The account detailing her experience began reaching us in April 2007 in the form of the World Net Daily article quoted above. It was subsequently repeated in an article published both by Fox News and the Financial Post. All of these accounts drew their information from a 12 April 2007 article printed in the Ellsworth American, a newspaper published in Ellsworth, Maine.", "According to the Portland (Maine) Press Herald, what actually happened after Ms. Bridges dropped a CFL bulb on the floor of her home is as follows:", "Bridges knew when the bulb shattered that the mercury inside had spilled onto the carpet and needed to be cleaned up carefully. She resisted the urge to vacuum, made some calls and got in touch with the state Department of Environmental Protection. So far, so good.", "The DEP, which didn't have a lot of experience with shattered compact fluorescent bulbs, told Bridges one option was to call a hazardous materials cleanup contractor, something officials now agree was serious overkill.", "She made the call and almost hit the floor herself. The contractor said the cleanup could cost $2,000, Bridges said.", "Because she didn't have two grand to hand over, Bridges sealed up the bedroom with plastic and tape. She also talked to a local newspaper to warn people to think twice about buying the bulbs.", "DEP officials, meanwhile, tried to assure her there really was no need to spend any money or seal up the room. But she wasn't about to trust the same government that had urged her to buy the bulb and, in her view, was changing its story about how dangerous it was to her daughter.", "The DEP eventually did help her clean it up. They [later] removed part of the carpet, though officials say that was only necessary because the mercury sat for two months.", "Whatever occurred in the Bridges home (the Maine DEP has since posted its account of the incident), Maine's DEP is not now recommending householders need bring in an environmental clean-up crews to deal with broken CFL bulbs, even if it is advocating the use of sticky tape, disposable dustpans, and sealed plastic bags.", "CFLs need to be handled with far more consideration than do conventional incandescent bulbs, if only because cleaning up a broken energy-saving bulb is a more involved process. Consumers should therefore exercise caution regarding where and how they install CFLs in their homes; they should be careful to not break these bulbs as they install and remove them and avoid putting them in lamps likely to be sent crashing to the floor by someone knocking them from a side table or tripping over electrical cords.", "CFLs save consumers money in the long run, as these bulbs draw far less power (resulting in lower electric bills), and they last longer (so they don't need to be replaced nearly as often). But they also work to save the environment by lessening greenhouse gases. If every American home replaced just one standard incandescent light bulb with a long-lasting CFL, the resultant energy savings would eliminate greenhouse gases equal to the emissions of 800,000 cars, according to the U.S. Energy Star program.", "Australia has committed to a mandatory phase-out of incandescents by 2010. Ontario has moved to ban conventional incandescent bulbs and other inefficient lighting technologies by 2012. (While homeowners and businesses in that province won't be penalized for continuing to use the older bulbs, it will become illegal for retailers to sell them.)", "Carpenter, Mackenzie. “Flicker of Change.” Pittsburgh Post-Gazette. 4 April 2007.", "Farah, Joseph. “Consumers in Dark Over Risks of New Light Bulbs.” WorldNetDaily. 16 April 2007.", "Gosling, Nick. “Fluorescent Bulb Break Creates Costly Hassle.” The Ellsworth American. 12 April 2007.", "Hamilton, Tyler. “Future Is Dim for Light Bulb.” The Toronto Star. 19 April 2007.", "Richardson, John. “Broken Bulb Saga Keeps Going.” Portland Press Herald. 16 June 2007.", "Spears, Tom. “How to Dispose of Fluorescent Lightbulbs.” Ottawa Citizen. 22 April 2007.", "Watson, Tom. “Now You’re Out of Excuses — Time to Switch to CFL Bulbs.” The Seattle Times. 3 March 2007.", "Wolinsky, Howard. “A Look at the Dark Side; Mercury Makes These Bulbs Work.” Chicago Sun Times. 22 April 2007.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]