["This image was published in this Facebook post on October 30, 2019, and it has also been published here, here and here on Facebook and here on Twitter alongside the same misleading claim.", "Translated, the Hindi-language caption reads: “Another Hindu heart emperor who became a monk in Kedarnath has today become an Arab. Every day is a new drama and a new character.”", "Below is a screenshot of the post:", "Kedarnath is located in north India and its temple is considered sacred in the Hindu religion.", "Modi visited the temple in May 2019 to pray while dressed as a monk, as reported here.", "The claim is false; the image has been doctored to add the traditional keffiyeh headdress.", "Modi visited Saudi Arabia on October 29, 2019. His tour of the country was reported by AFP.", "The original photograph used in the manipulated image is one of four photos published on Twitter by Modi’s office on the day of his arrival.", "The Prime Minister landed in Saudi Arabia a short while ago. pic.twitter.com/l6WSNbsh7U", "Below is a screenshot image of the doctored image in the Facebook post (L) and the original photo published on Twitter (R):", "A video of Modi landing in Saudi was posted on Twitter here by Modi’s official Twitter account.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]