["The photo was published in a Facebook post on August 26, 2019. It was shared more than 180 times before it was removed. The post showed a photo of an infant girl alongside a caption claiming that she died after being given the polio vaccine in the northwestern Pakistani town of Swabi.", "The Urdu-language caption translates to English as: “Swabi: Sad news. Swabi: In Salim Khan village, a one-year-old baby girl died due to polio drops: sources.”", "“Swabi in Salim Khan village, a one-year-old baby girl Uroosha’s condition deteriorated after she was administered polio (vaccine) drops and she died after 15 minutes. Sources.”", "“Swabi. District Health Officer Dr Niaz said that the cause of death will be known after a postmortem report.”", "Below is a screenshot of the misleading Facebook post:", "The claim is false. The official autopsy report stated the girl pictured in the post died after choking on a peanut.", "Uroosha's father Hidayat Ullah, a 26-year-old labourer told AFP by phone on September 20, 2019 that it was her photo in the Facebook post.", "\"Yes this is my daughter's photo and I gave it to media people who contacted me after the death of my daughter,\" Ullah said.", "Local police official Liaquat Ali also told AFP by phone on September 20, 2019 that the photo shows Ullah's daughter Uroosha.", "\"The father claimed that his daughter died because of polio vaccination, but the autopsy report found that she choked on a peanut,\" Ali told AFP.", "The Pakistani Prime Minister’s Focal Person for Polio, Babar Atta, described the misleading post that Uroosha died after she was given polio drops as “fake news” in this tweet.", "Absolute Fake, we have just received the autopsy report of the innocent child, unfortunate death occured due to choking from dry peanut.\n\n\t\tTherefore, we have reported you and 13 more FaceBook / Twitter Pages / Profiles for blocking. #SayNoToPropaganda https://t.co/G8USrSXclz", "Babar Atta forwarded a scanned copy of the postmortem report for the child to AFP.", "Under the section \"remarks by a medical office\", the post mortem document states: \"In my opinion, the deceased died due to asphyxia due to choaking at the level of trachea due to peanut.\"", "Below is a screenshot of a page from the postmortem report:", "The hospital autopsy report also shows the same name and age -- Uroosha, one year old -- of the deceased child as in the Facebook post:", "Polio vaccination campaigns have been fiercely resisted in Pakistan for years, as this AFP article explains.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]