["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A link circulating on Facebook that offers its visitors a free dozen donuts from Dunkin’ Donuts is a scam. (Sorry if you were hoping for a free sugar rush.)", "\"Dunkin' Donuts is providing a free Ḍozen Doughnut Box to everyone! to celebrate 68th Anniversary!\" a website Dunkin USA announces, encouraging its readers to partake in a short survey in exchange for the donuts.", "We were curious about whether we could truly take this opportunity to get some free donuts from Dunkin’, so we took the survey to see what would happen.", "The survey asks its participants three questions. The first is whether the participant has ever visited Dunkin’, the second about why the participant prefers Dunkin’, and the third and final question asks whether the survey-taker is satisfied by Dunkin’s services.", "After we completed the survey, the website asked us to share the page on Facebook, comment \"Thanks for my coupon,\" and click \"Like.\" We followed all these instructions, but were not presented with a coupon for the donuts.", "The link resembles past offers that have also turned out to be scams.", "\"We only have 332 Boxes remaining so hurry up!\" the Dunkin’ offer claims. A previous scam targeting Delta also featured similar language as well as the number 332: \"Congratulations! You have been selected to take part in our short survey to get 2 Free Delta Airline Tickets! We only have 332 Tickets remaining so hurry up!\" the website Delta-Flying.info stated.", "In addition, links supposedly offering their visitors coupons for free Dunkin’ Donuts in celebration of the company’s 67th anniversary have surfaced in the past. Snopes debunked a previous version of the scam that was widely circulated in December 2017. Michelle King, a spokeswoman for Dunkin’ Brands Group Inc., told the website Retailmenot.com that the offer is not affiliated with Dunkin’ Donuts.", "If that isn’t enough, the survey is rife with grammatical and spelling errors.", "The survey asks, \"Have you ever visited at Dunkin’ Donuts?\" when it would be grammatically correct to ask \"Have you ever visited Dunkin’ Donuts?\"", "In addition, the answer selections available for the survey’s question \"You prefer Dunkin’ Donuts because of?\" are \"It’s Cheapness,\" \"It’s Environment,\" and \"Don’t Know,\" even though it would be correct to use \"Its\" rather than \"It’s.\"", "What’s more, while the survey touts a \"free Dozen Doughnut Box,\" Dunkin’ Donuts doesn’t use that spelling of the sweet treat.", "It’s unlikely that an official Dunkin’ Donuts offer would contain so many errors. We reached out to Dunkin’ Donuts but did not hear back.", "A website’s claim that visitors will receive a coupon for a free dozen of donuts in exchange for completing a survey is too good to be true.", "We rate this claim Pants on Fire!", "http://dunkin-usa.org/?ZCoc7yi, Accessed June 28, 2018", "Money, \"Beware of This Dunkin' Donuts Coupon Floating Around Offering Free Doughnuts,\" February 21, 2018", "PolitiFact, \"Delta targeted in online free airline ticket scam,\" March 14, 2018", "Snopes, \"Dunkin’ ‘Free Box of Donuts’ Coupon Scam,\" December 7, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]