["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The too-close-to-call race between Republican incumbent Nathan Deal and Democratic challenger Jason Carter has the Republican Governors Association plunking down more money in Georgia.", "The RGA has already spent $1.6 million on Georgia’s governor’s race and is upping its investment with a new ad that started airing Tuesday in most parts of the state.", "The association has previously taken to the airwaves in Georgia to attack Carter, a state senator from Atlanta, as a \"liberal trial lawyer\" and a champion of expanding Medicaid as part of Obamacare.", "The new 30-second challenges one of Carter’s biggest campaign promises -- his vow to improve education funding.", "\"Jason Carter promises to invest more in education. But Carter actually opposed more funding for education in the Senate,\" the ad states.", "That’s a frequent claim out of the Deal campaign. It’s also very similar to a claim that PolitiFact has examined previously and deems worthy of a second look -- given that education is one of the hottest topics in the race and one of taxpayers’ biggest investment. (This year alone, the cost of K-12 education is $7.9 billion, or 43.4 percent of the state’s $18.3 billion budget.)", "The ad from the Republican Governors Association specifically takes aim at Carter’s vote in the most recent General Assembly session on the 2015 state budget (though the RGA gives a wrong citation in the ad for HB 744, the 2015 appropriations bill).", "Out of 56 state senators, Carter was one of only four who voted \"No\" on the budget,\" state records show.", "The budget included austerity cuts to education, totaling $747 million. But they were the smallest cuts since 2009 and, as such, were viewed by leaders in education as largely positive.", "This past spring, when Deal signed the 2015 budget into law, Carter explained his opposition was rooted in a belief that having a separate education budget would restore all, not just some, of the previous cuts.", "\"Budgets reflect values, and this budget shows that Gov. Deal does not value our students, teachers and classrooms,\" Carter said in a statement in April.", "Carter has since expanded on his idea of a separate education budget, including a questionable funding stream from tax cheats to boost spending.", "Republicans argued that Deal increased education funding every year, a claim PolitiFact found overstated his record.", "On the campaign trail, Carter has repeatedly attacked Deal for underfunding education. Most of his public statements as a state senator focused on education and called for more money, both on the K-12 and college levels.", "\"To say he does not support more funding is completely erroneous,\" Carter spokesman Bryan Thomas said. \"It’s precisely the opposite. He does not want our schools to continue to be shortchanged.\"", "Republicans, however, have suggested that Carter’s vote against the 2015 budget was strictly political posturing.", "They point out that he voted in favor of Deal’s three prior state budgets, all of which had larger education austerity cuts. (Georgia’s 180 school systems collectively were underfunded more than $1.1 billion in 2012, $1.1 billion in 2013 and nearly $1.1 billion in 2014, according to allotment sheets from the Georgia Department of Education.)", "Austerity cuts reflect the difference in what school systems qualify for and actually receive from the state under the education funding formula, the Quality Basic Education Act of 1985.", "Carter has voiced concerns about the state’s commitment to public education during his short Senate career. His criticism, specifically of Deal on education, has sharpened in recent months, with his campaign manager at one point calling Deal Georgia’s worst education governor. (See PolitiFact’s Pants On Fire ruling of that claim.)", "Around the nation, there are 36 governor’s races this fall and about a third of them  -- including the one between Deal and Carter -- are considered competitive, said Larry Sabato, director of the University of Virginia Center for Politics.", "\"Deal is one of five incumbent Republicans who is in some degree of difficulty,\" Sabato said. \"Deal is a slight favorite, but Carter has kept it close.\"", "In summary, the RGA ad claims that Carter \"actually opposed more funding for education.\" It would be accurate to say Carter voted against the current state budget that expanded money for schools.", "Carter has called for more education funding for nearly all of his short political career. But when it came down to votes in the state Senate, he voted with Gov. Deal on three budgets that contained austerity cuts and against the governor on a budget that had the smallest austerity cuts in years.", "The GOP was careful in wording its latest ad to say Carter opposed more funding for education \"in the Senate.\" That statement needs that context but is largely on target.", "We rate the claim Mostly True.", "Republican Governors Association ad, \"Anytime soon,\" Sept. 23, 2014", "Georgia General Assembly 2015 Appropriations House Bill 744", "The Atlanta Journal-Constitution Get Schooled blog, Feb. 28, 2013", "The Atlanta Journal-Constitution Political Insider blog, Sept. 23, 2014", "The Atlanta Journal-Constitution Political Insider blog, June 10, 2014", "Peach Pundit, \"Governor Deal Signs State Budget, Jason Carter Complains,\" April 28, 2014", "State Senator Jason Carter YouTube channel, Georgia's Inaction on Education, Feb. 28, 2013", "Interview with Bryan Thomas, spokesman for Democratic candidate for governor Jason Carter, Sept. 23, 2014", "Interview with Larry Sabato, director of the University of Virginia Center for Politics, Sept. 23, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]