["About this rating", "Following a growing number of consumer complaints, PepsiCo and Coca-Cola pledged to remove brominated vegetable oil (BVO) from soft drinks in 2013 and 2014, and by mid-2020 it was no longer listed as an ingredient of Mountain Dew.", "However, studies have not proved that the levels of BVO previously found in sodas such as Mountain Dew had adverse health effects on humans.", "Brominated vegetable oil, or BVO, has long been used as a food additive in the soft drink industry, primarily to help keep citrus-flavor oils suspended in beverages and prevent them from floating to the top of the fluid. BVO, which is vegetable oil bonded with atoms of the element bromine, was at one point commonly found in Mountain Dew and other popular citrus-flavored soft drinks such as Squirt, Fresca, Sunkist Peach, and Fanta Orange, and also in sports drinks such as Powerade.", "In recent years viral online pieces have described BVO as a \"toxic chemical\" and urged consumers to avoid products such as Mountain Dew soda that contained it:", "Are you a Mountain Dew addict? Then know what you're drinking! BVO is a toxic chemical that is banned in many countries because it competes with iodine for receptor sites in the body, which can lead to hypothyroidism, autoimmune disease, and cancer. The main ingredient, bromine, is a poisonous, corrosive chemical, linked to major organ system damage, birth defects, growth problems, schizophrenia, and hearing loss.\"There's flame retardant in your Mountain Dew. That soda with the lime-green hue (and other citrus-flavored bubbly pops) won't keep your insides fireproof, but it does contain brominated vegetable oil, a patented flame retardant for plastics that has been banned in foods throughout Europe and in Japan.", "Brominated vegetable oil, or BVO, which acts as an emulsifier in citrus-flavored soda drinks, is found in about 10 percent of sodas sold in the U.S.", "\"After a few extreme soda binges — not too far from what many gamers regularly consume — a few patients have needed medical attention for skin lesions, memory loss and nerve disorders, all symptoms of overexposure to bromine,\" according to a recent article in Environmental News.", "In a March 2018 Facebook post shared by more than 200,000 users, a woman reported being told by her doctor that the BVO in Mountain Dew causes nerve damage and possibly blindness, and that her headaches and blurred vision could have been caused by drinking large amounts of the beverage:", "Apart from a follow-up post saying subsequent tests showed that \"something\" was causing \"pressure on her vision,\" the Facebook user reported nothing further about her condition or medical diagnosis. (We attempted to contact her for comment but received no reply.)", "The status of BVO differs in various parts of the world: It is allowed as a food additive in Latin American and North American countries (including the U.S. and Canada), but not in Japan or European Union countries. The U.S. Food and Drug Administration (FDA) originally classified BVO as a \"generally recognized as safe\" (GRAS) food additive in 1958, but that classification was withdrawn in the 1970s after studies linked the consumption of brominated oil with heart disease in rats. BVO was subsequently reclassified as an \"interim food additive\" (pending the outcome of additional studies), with the use of BVO in food products limited to a concentration of 15 ppm:", "Based on data from early studies, the FDA yanked brominated vegetable oil from its Generally Recognized as Safe (GRAS) list for flavor additives in 1970, said Douglas Karas, a spokesman for the FDA. BVO bounced back after studies from an industry group from 1971 to 1974 demonstrated a level of safety.The Flavor Extract Manufacturers' Association petitioned the FDA to get BVO back in fruit-flavored beverages, this time as a stabilizer, which is its role today. After evaluating the petition and other data, the FDA in 1977 approved the interim use of BVO at 15 ppm in fruit-flavored beverages, pending the outcome of additional studies.", "\"This decision was based on the highest No Observed Effect Levels from the existing safety studies and the estimated daily intake,\" Karas said. \"Although there were doses that showed adverse effects in the animal studies, there also were lower doses in which there were no adverse effects observed.\"", "As a condition of interim approval, the industry group submitted additional safety studies to the FDA.", "\"The findings from these studies supported the safety of BVO in beverages at a level of 15 ppm in fruit-flavored beverages,\" Karas said. \"Its use as a flame retardant does not preclude its use as a food ingredient so long as the food use is safe.\"", "More than 30 years later, brominated vegetable oil's approval status is still listed as interim. Changing the status would be costly and \"is not a public health priority for the agency at this time,\" Karas said.", "(Soft drinks that contain BVO now typically contain about half the concentration allowed by law.)", "Some scientists in recent years have called for a re-examination of BVO's safety as a food additive using newer technologies that were not available when the issue was last assessed by the FDA:", "Now some scientists have a renewed interest in this little-known ingredient, found in 10 percent of sodas in the United States.After a few extreme soda binges — not too far from what many gamers regularly consume — a few patients have needed medical attention for skin lesions, memory loss and nerve disorders, all symptoms of overexposure to bromine. Other studies suggest that BVO could be building up in human tissues, just like other brominated compounds such as flame retardants. In mouse studies, big doses caused reproductive and behavioral problems.", "Reports from an industry group helped the U.S. Food and Drug Administration establish in 1977 what it considers a safe limit for BVO in sodas. But some scientists say that limit is based on data that is thin and several decades old, and they insist that the chemical deserves a fresh look.", "\"Compounds like these that are in widespread use probably should be reexamined periodically with newer technologies to ensure that there aren't effects that would have been missed by prior methods,\" said Charles Vorhees, a toxicologist at Cincinnati Children's Hospital Medical Center, who studied BVO's neurological effects in the early 1980s. \"I think BVO is the kind of compound that probably warrants some reexamination.\"", "Michael Jacobson, executive director of the Center for Science in the Public Interest, was involved with the petition to remove BVO from the \"safe\" list in 1970. He said it's time for the FDA to make a decision, one way or the other.", "\"Is it harmful at the amounts consumed? Probably not,\" Jacobson said. \"But it would be nice if the FDA did a thorough review of the literature and finalized an approval or a ban.\"", "A few medical cases involving patients who suffered deleterious effects due to excessive bromine levels in their systems have been attributed to consumption of soft drinks containing BVO:", "In 1997, doctors were stumped by the case of a man who came to the emergency room with headaches, fatigue, and a loss of muscle coordination and memory. He continued to get worse over time, and eventually he lost the ability to walk. A blood test found sky-high levels of bromide. The source? The man had been drinking between 2 and 4 liters of soda containing brominated vegetable oil every day. He needed dialysis but eventually recovered.In 2003, doctors treated a man who developed swollen hands with oozing sores. They diagnosed a rare case of the skin condition bromoderma after blood tests revealed his bromine was about twice normal limits. The man admitted drinking about 8 liters of Ruby Red Squirt, which contains BVO, each day.", "However, those cases involved subjects who drank what would generally be considered an excessive amount of soda on a regular basis (i.e., between two to eight liters daily). So far, no studies have conclusively documented serious health concerns in human beings caused by the consumption of moderate amounts of beverages containing BVO at the concentrations typically used in such products.", "Whatever health risks may or may not be associated with the consumption of BVO, warnings about its presence in popular sodas such as Mountain Dew became largely outdated. In January 2013 PepsiCo (while acknowledging that they \"don't find a health and safety risk with BVO\") announced that in response to consumer concerns they would discontinue the use of BVO in their Gatorade line of drinks. The company stated at the time they \"had no plans to remove [BVO] from Mountain Dew and Diet Mountain Dew,\" but in May 2014 they reversed course, stating that they were working to remove BVO from all their drinks, including Mountain Dew, Fanta and Powerade.", "Beverage giant Coca-Cola joined ranks with that announcement:", "Coca-Cola and PepsiCo said they're working to remove a controversial ingredient from all their drinks, including Mountain Dew, Fanta and Powerade.Coca-Cola and PepsiCo have stood by the safety of the ingredient, which is used to distribute flavors more evenly in fruit-flavored drinks. But their decisions reflect the pressure companies are facing as people pay closer attention to ingredient labels and try to stick to diets they feel are natural. Several major food makers have recently changed their recipes to remove chemicals or dyes that people find objectionable.", "While food companies stress that the ingredients meet regulatory requirements, their decisions reflect how marketing a product as \"natural\" has become priority and a competitive advantage.", "Coca-Cola also said that it's removing the ingredient from all its drinks to be consistent in the ingredients it uses around the world. In addition to Powerade, Coca-Cola uses BVO in some flavors of Fanta, Fresca and several citrus-flavored fountain drinks. The company said BVO should be phased out in the U.S. by the end of the year.", "Coca-Cola said it would instead use sucrose acetate isobutyrate, which it noted has been used in drinks for more than 14 years, and glycerol ester of rosin, which it said is commonly found in chewing gum and drinks.", "PepsiCo did not provide a timeline for the removal of BVO from all soft drinks in their May 2014 announcement. As of Jan.16, 2019, BVO was still a listed ingredient in Mountain Dew on the beverage's PepsiCo web site nutrition page and on the product packaging itself:", "However, as of June 29, 2020, Mountain Dew's listed ingredients no longer included BVO, as shown below:", "Eng, Monica.   \"Gatorade to Drop BVO After Consumer Complaints.\"\r\n    Chicago Tribune.   26 January 2013.", "Goodman, Brenda.   \"Brominated Vegetable Oil Q&A.\"\r\n    WebMD.   30 January 2013.", "Israel, Brett.   \"Brominated Battle: Soda Chemical Has Cloudy Health History.\"\r\n    Scientific America.   12 December 2011.", "Strom, Stephanie.   \"PepsiCo Will Halt Use of Additive in Gatorade.\"\r\n    The New York Times.   25 January 2013.", "Associated Press.   \"Substance in Vegetable Oil Linked to Heart Ills in Rats.\"\r\n    The [Newburgh] Evening News.   24 January 1970.", "Associated Press.   \"Coke, Pepsi Dropping Controversial 'BVO' from All Drinks.\"\r\n    USA Today.   5 May 2014.", "PepsiCo.   \"The Facts About Your Favorite Beverages: Mountain Dew.\"\r\n    Accessed 27 April 2017.", "Update [16 January 2019]: Added viral Facebook post from March 2018 and verified that brominated vegetable oil is still listed as an ingredient in Mountain Dew.", "Update [2 July 2020]: Added updated Mountain Dew ingredients listing from June 2020 showing it no longer contained BVO.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]