["About this rating", "On 21 July 2018, a video purportedly showing a 2000-year-old carving of a man riding bicycle found inside of an ancient temple in India was posted to Facebook by Mohan Praveen, the host of the \"Phenomenal Travel Videos\" YouTube show.", "Praveen argued in a longer version of this video posted to his YouTube channel that this extraordinary finding was puzzling because the modern bicycle wasn't invented until the 19th century, but the temple in which a carving of a bicycle was found, the Panchavarnaswamy Temple, was built over 2,000 years ago.", "Is this bicycle carving, as Praveen hypothesized in a tweet, evidence of an \"advanced ancient technology?\"", "Praveen claimed that historians were attempting to discredit this miraculous finding by arguing that this \"ancient\" temple was actually constructed only a hundred years ago. After an unnecessarily long explanation of what the carving depicts (a man on a bike), Praveen asserted that the temple undeniably dates to at least the 7th century, long before the development of the modern bicycle:", "How was this carved in this ancient temple which is about 2,000 years old?", "Some have argued that this temple was entirely built just a hundred years ago. Since this is not an ancient temple, all these carvings are new and sculptors carved what they saw. There were bikes hundred years ago so it was easy for sculptors to carve this. Are experts right about this? Is it possible that this is a new temple built in the last century? No, because this temple is mentioned in the 7th century text called Tevaram.", "The experts that we've encountered, however, haven't argued that this \"temple was entirely built just a hundred years ago.\" Rather, they've argued that specific portions of this 2,000-year-old temple were renovated about a hundred years ago, and that a sculptor working on those relatively modern renovations added the carving of a by-now-common bicycle at that time.", "In 2015, long before this carving was presented as an \"unexplained\" marking on an ancient temple in a variety of clickbait articles, Dr. R. Kalaikovan provided a much more logical explanation for it to The Hindu:", "\"After the prayer, while taking a look around, I came across the carving of a bicycle on a pillar behind the Amman temple,\" says Dr. Kalaikovan. \"It was so funny and intriguing to see the picture of a cycle in an ancient temple. But neither the officials nor the scholar who wrote its history, were able to explain how it came there. I started researching this fact.\"", "Through multiple forays into the history of the bicycle (which was invented in Germany in 1800s), and the Chola-era Woraiyur temple, he theorised that the vehicle was possibly a novelty in Tiruchi of the 1920s, when the temple had been renovated. \"Perhaps the sculptor had seen someone on a cycle, was impressed by it and had recorded it forever on stone,\" says Dr. Kalaikovan.", "This isn't the first time that the \"discovery\" of a depiction of a modern object on the walls of an ancient structure has served as fodder for a conspiracy theory. Photographs showing a carving of an astronaut on the wall of a 12th century Spanish cathedral have been circulating for years along with theories about the \"unexplained\" phenomena. However, as was the case with this bicycle carving, the \"ancient astronaut\" was added to the cathedral during a renovation conducted in the 1990s. A carving of an \"ancient alien cellphone\" was similarly found to be the work of a modern artist.", "Nianar, Nahla.   \"Bringing the Past to the Present.\"\r\n    The Hindu.   12 June 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]