["About this rating", "In July 2017, a frequently circulated photograph purportedly showing boxer Muhammad Ali with a very young Michael Jackson appeared once again:", "This is a real photograph, in that it is not digitally manpulated, but it does not show Muhammad Ali with a very young Michael Jackson. The picture was taken at Ali's training camp in Pennsylvania and shows the legendary fighter with Tiger Smalls, a young boxer who achieved some notoriety for another photograph showing him \"punching\" the champion:", "Priest \"Tiger\" Smalls is noteworthy for a picture he took with Muhammad Ali that appeared in a national magazine in the mid-1970s. Smalls had been invited to Ali's famed training camp at Deer Lake, Pa. Only a toddler at the time, Smalls boasted to Ali that he would become heavyweight champion of the world. But genetics allowed Smalls to grow only into a lightweight. And he has been able to win a couple regional titles of the WBO at featherweight. Those titles were the WBO North American Boxing Organization and the WBO Inter-Continental. Smalls has also won a world title of the lightly-regarded Universal Boxing Association.", "As a standout amateur, Smalls, also known as the Pride of The Wild, had a reported record of 92-11. Gifted with speed of hands and feet, and better than average power, Smalls is reported to have won several amateur titles in the Junior Olympics, Silver Gloves, Diamond Gloves, Golden Gloves and the AAU. He also won several military titles, while serving in the U.S. Navy.", "Although these particular photographs don't show it, the King of Pop did meet the Louisville Lip on more than one occasion:", "Gaetan, Manuel.   \"The Brilliant Mind of Muhammad Ali.\"\r\n    The State.   9 June 2016.", "Pasick, Adam.   \"The Time Muhammad Ali Showed a Pirouetting Michael Jackson How to 'Float Like a Butterfly.\"\r\n   Quartz.   4 June 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]