["About this rating", "On 13 February 2017, Fox News published a story appearing to report that \"Happy Days\" actor Scott Baio announced he would boycott retail chain Nordstrom because he was unhappy with its decision to drop the clothing line of President Donald Trump's daughter, Ivanka:", "Actor Scott Baio, a known President Donald Trump supporter, said on Twitter that he is dropping Nordstrom after the department store dropped ties with Ivanka Trump.", "Though the retailer cited declining sales, the move coincided with calls for a boycott against stores that carry any products related to the Trump family.", "In the tweet, Baio included a photo of his store statement, showing he had spent more than $30,000 this past year at Nordstrom.", "Dear @Nordstrom NEVER AGAIN! @IvankaTrump @realDonaldTrump @DonaldJTrumpJr @EricTrump @MrsScottBaio pic.twitter.com/yPcwr6y4qS", "— Scott Baio (@ScottBaio) February 11, 2017", "The tweet prompted comedians to pile on the actor (best known for playing Chachi):", "That sucks for Nordstrom now they have to find another cashier?. https://t.co/i3fVOvTPfH", "— Trevor Noah (@Trevornoah) February 13, 2017", "Sources say that Scott Baio has chosen to support Ivanka Trump by shopping at the Kohl's he works at part time.", "— A Diabetic Comic (@ChelcieRice) February 13, 2017", "Unhappy with being the butt of South African comedian and \"Daily Show\" host Trevor Noah's joke, Baio responded, \"When you, @Trevornoah learn what it means to be an American then you'll have a say. Until then enjoy our $ and shut your pie-hole!\"", "The flap prompted Huffington Post blogger David Fagin to write a satirical post reporting that the mall chain best known for selling clothing and cosmetics was going under, thanks entirely to Baio's boycott:", "Retailers who think they can do whatever they want with their brands, and not have to answer to washed-up teenage heartthrobs, better think again.", "Within minutes of former child star, Scott Baio, announcing that both he, and his wife, would no longer shop at Nordstrom, due to what they believe is a politically motivated boycott of his fantasy wife, Ivanka Trump, the nation’s top retailer announced plans to file for Chapter 11 protection...", "A loss of such magnitude shook the stock market as well, as the Dow dropped nearly 400 points, sending Wall Street reeling, after what is now hashtagging as #BaioWatch. Tomorrow’s front page of The Retail Times reads simply, “Charles is in charge of Nordstrom.”", "This many store closings will obviously mean the loss of thousands of jobs, but many soon-to-be former Nordstrom employees say they aren’t worried. “I’m a cosmetologist by trade,” said Joyce Stewart, a sixty-eight year-old Nordstrom veteran of twenty-one years, “but I’ve always dreamt of working with my hands, sixteen/seventeen hours a day in a heavy-lifting, menial labor type of job. I see this as a sign to finally do what I love, and that means helping to build a wall around Mexico.”", "While some apparently thought the post was straight news, it was clearly labeled \"satire\" at the top. A spokeswoman for Nordstrom confirmed to us that the retailer is not filing for bankruptcy.", "Fox News. \"Scott Baio Says He's Dropping Nordstrom After Store Drops Ivanka Trump.\"\r\n13 February 2017.", "Fagin, David. \"In Wake of Scott Baio Boycott, Nordstrom Files For Chapter 11.\"\r\nHuffington Post. 13 February 2017.", "Stedman, Alex. \"Scott Baio Endorses Donald Trump: ‘We Need Somebody to Relentlessly Attack Hillary.'\"\r\nVariety. 20 March 2016.", "Tu, Janet I. \"Retailers’ Bad News Clips Nordstrom Stock.\"\r\nThe Seattle Times. 5 January 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]