["About this rating", "Since early 2017, the Internet has been littered with “warnings” about the dangers of eating bananas and eggs together (or serially):", "It is unclear what “net” is in danger of being killed by this combination of food, but the claim presented here appears to have its origins in a dubious chain message spread via the mobile chat app WhatsApp. The earliest reference to the claim we could find was an 18 January 2017 Facebook post by a Nigerian based internet comedy channel. The claim appears to have first gone viral in India a month later, with the first round of debunkings occurring from Indian sources around 20 February 2017.", "The use of “sweet banana” could imply a specific cultivar of banana known as a sugar banana or a “lady finger” banana, but this would not change the nature of the claim appreciably. Though the nutritional composition of bananas varies significantly between different cultivars, they nevertheless contain largely the same suite of chemicals. That means the claim rests on the assertion that mixing bananas and eggs is dangerous, despite the fact that those two ingredients are consumed together all over the world.", "It is unlikely, for example, that a large restaurant chain such as Denny’s would so enthusiastically promote their “salted caramel banana cream pancake breakfast” (which contains both eggs and bananas) if the risk of death were real. Similarly, the risks of Starbucks' banana bread, which is made with eggs and bananas, would likely discourage the coffee chain from prominently featuring the product in their pastry section if it were going to kill the company's customers.", "We have uncovered no evidence the story referenced in the warning of a young man's dropping dead on the spot after consuming a banana and an egg is real, and we understand no mechanism by which a person’s death could be triggered by the consumption of a benign egg and banana combination, absent a severe allergy to either food.", "Ayupp.   “Man Dies after Consuming Egg and Sweet Banana – Fake.”\r\n    20 February 2017.", "Bangalore Mirror.   “Fake News Buster: Man Dies After Eating Egg and Sweet Banana.”\r\n    25 February 2017.", "Pareek, Sunil.   Nutritional and Biochemical Composition of Banana (Musa spp.) Cultivars.”\r\n    Nutritional Composition of Fruit Cultivars.   2016.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]