["A July 26, 2018, Facebook post was shared 16,000 times and provoked more than 1,000 reactions and comments. The caption alleged that the strange incident occurred in Western Kenya.", "\"BREAKING NEWS. A pig in Kakamega has delivered a baby boy. Total shame to our men,\" the caption read.", "The images were also presented in this video on YouTube with more than 59,000 views.", "A reverse image search showed the pictures were of silicone sculptures created by Maganuco.", "She posted the sculptures on her Instagram account on July 26, 2018, with the caption: \"Baby hibrid pig single piece sculptures.\"", "Maganuco reposted the images on Facebook last year and wrote that it appeared that Facebook had hidden a first post she had made with the images.", "This is not the first time pictures of Maganuco’s sculptures have been used to mislead people on social media. Last year in India, a picture of one of her sculptures was used with a claim that people who disobeyed the Koran would turn into the strange creature portrayed in the artistic work.", "Maganuco describes herself as a \"hyper-realism silicon sculptor\" who \"likes creepy things and Hybrid Creatures” and sells the sculptures online.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]