["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Studies show COVID-19 is caused by the SARS-CoV-2 virus, not bacteria.", "The Italian Ministry of Health still identifies the disease as caused by a virus", "WHO never “outlawed” autopsies of patients with COVID-19", "In late May, Italy began reporting its lowest number of new COVID-19 cases since February. This could be the outcome of a nationwide lockdown that lasted months, but one Facebook post is attributing it to a larger medical conspiracy.", "A Facebook post from May 26, 2020, claims that \"Italy has allegedly discovered covid is not a virus, but a bacterium. It clots the blood and reduces the oxygen saturation from dispersing throughout the body.\" It goes on to explain that the Italian Ministry of Health \"went against the World Health Organization's ‘law’ that no bodies receive autopsies,\" leading to its discovery of the bacterium.", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Let’s break down the three main claims:", "\"Italy has allegedly discovered covid is not a virus, but a bacterium. \"", "This is wrong.", "COVID-19 is a disease caused by the virus known as severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2).", "Bacteria and viruses can create similar symptoms and spread through human-to-human contact, but they are different biologically.", "Bacteria can replicate without a host cell, but viruses require some kind of host to replicate, explained Emily Bruce, a faculty scientist at the University of Vermont’s Larner College of Medicine. Bacteria can replicate themselves because they have developed DNA and are considered a living organism, while viruses usually contain RNA.", "A late February study analyzing samples from nine new COVID-19 patients found that the disease possessed a \"single strand, positive-sense RNA genome,\" which is a characteristic of coronaviruses and not bacteria. Its genetic makeup was similar to two bat-derived severe acute respiratory syndromes. It was distantly related to SARS-CoV and MERS-CoV, which are both coronaviruses that have caused large outbreaks before.", "This established the cause of COVID-19 as a virus, as a bacterium would not genetically match with these other coronaviruses.", "Italy’s Ministry of Health still identifies the cause of COVID-19 as a coronavirus on its FAQ page.", "\"It clots the blood and reduces the oxygen saturation from dispersing throughout the body.\"", "There is some evidence of blood-clotting problems from COVID-19, but they’re most likely caused by lung complications.", "Studies from the Netherlands and France have found a connection between severe COVID-19 and blood clots. The French study found that 23 out of 100 patients with a severe case of COVID-19 had blood clots in their pulmonary artery, which carries blood from the heart to the lungs to be oxygenated.", "Richard Watanabe, professor at the University of Southern California’s Keck School of Medicine at, agreed that there is new evidence that COVID-19 can cause blood clots and other blood complications. This could be attributed to how \"people infected with COVID-19 develop pneumonia, which impedes breathing and oxygen saturation.\" Watanabe said that there needs to be more research on COVID-19 and clots and embolisms, especially with an increase in Kawasaki disease-like symptoms in young COVID-19 patients.", "RELATED: Top 10 uncertainties about the coronavirus", "\"They went against the World Health Organization's ‘law’ that no bodies receive autopsies.\"", "This is inaccurate. There is no recorded announcement from the World Health Organization that autopsies should not be conducted on deceased COVID-19 patients. In fact, the organization released guidance this month on how to perform such an autopsy safely.", "The first English-language autopsy report on COVID-19 patients was done in Oklahoma, and the findings were published on April 10.", "Our ruling", "A social media post claimed that Italy found that COVID-19 is an easily treatable bacteria when it went against WHO’s guidelines and performed an \"illegal\" autopsy.", "COVID-19’s cause has been extensively studied and identified as a virus, and the WHO never discouraged autopsies of patients who died from COVID-19. We rate this False.", "AXIOS, Italy reports lowest number of new coronavirus cases since February, May 25, 2020", "Facebook post, May 26, 2020", "Mayo Clinic, Bacterial vs. viral infections: How do they differ?, Sept 7, 2017", "Cornell University, Bacterial Genomes, accessed on May 27, 2020", "Current Genomics, RNA Viruses: RNA Roles in Pathogenesis, Coreplication and Viral Load, Oct 2015", "The Lancet, Genomic characterisation and epidemiology of 2019 novel coronavirus, Feb 22, 2020", "Italian Ministry of Health, FAQ - Covid-19, questions and answers, May 27, 2020", "Radiological Society of North America, Diagnosis, Prevention, and Treatment of Thromboembolic Complications in COVID-19: Report of the National Institute for Public Health of the Netherlands, April 23, 2020", "Radiological Society of North America, Acute Pulmonary Embolism Associated with COVID-19 Pneumonia Detected by Pulmonary CT Angiography, April 23, 2020", "WHO, Infection Prevention and Control for the safe management of a dead body in the context of COVID-19, March 24, 2020", "American Journal of Clinical Pathology, COVID-19 Autopsies, Oklahoma, USA, April 10, 2020", "PolitiFact, No, COVID-19 won’t respond to antibiotics, despite findings from new autopsies, May 19, 2020", "Cleveland Clinic, Lessons from Two COVID-19 Autopsies, April 16, 2020", "Email interview with Emily Bruce, the Faculty Scientist in the Department of Medicine at the Larner College of Medicine at the University of Vermont, May 27, 2020", "Email interview with Richard M. Watanabe, Professor of Preventive Medicine and Physiology & Biophysics at the Keck School of Medicine at USC, May 27, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]