["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Orlando community held a vigil after the Pulse nightclub shooting. (Associated Press)", "The Orlando shooting massacre at the Pulse gay nightclub that led to the deaths of 49 victims has led to more national attention about hate crimes targeting the gay community.", "U.S. Attorney General Loretta Lynch spoke about the attack hours later on Fox News Sunday.", "\"I think we have to keep our eye on a larger picture here, which is the victims of this crime were from a community that is often marginalized and that, frankly, the LGBT community is more often the victims of hate crimes than any other recognized group,\" she said.", "Lynch is correct if we examine per capita rates for hate crimes, although there are some caveats about the data -- mainly that there are gaps in how law enforcement reports hate crimes.", "The FBI defines hate crimes as \"criminal offenses motivated, in whole or in part, by the offender’s bias against\" a particular group such as a religion, race or sexual orientation.", "Data on hate crimes", "A spokesman for Lynch said she was referring to an analysis by the New York Times published days after the Orlando shooting. Using data from the FBI and the U.S. Census, the newspaper compared hate crimes per capita in two years: 2005 and 2014. The newspaper found \"L.G.B.T. people are twice as likely to be targeted as African-Americans, and the rate of hate crimes against them has surpassed that of crimes against Jews.\"", "Mark Potok, an expert on extremism at the Southern Poverty Law Center, did a similar analysis of 14 years of hate crime data in 2011.", "He found that LGBT (lesbian, gay, bisexual and transgender) people are far more likely than other minority groups to be victimized by violent hate crimes.", "Potok examined the percentage of the population represented by these groups:  LGBT, Jews, blacks, Muslims, Latinos and whites. Then he compiled the total number of hate crimes against persons (excluding crimes against property) between 1995 and 2008. Then he compared the level of hate crime aimed at each group to the group’s percentage in the population to determine the rate of victimization.", "He found that LGBT people were victimized at 8.3 times the expected rate. Jews were victimized at 3.5 times the expected rate, blacks at 3.2 times, Muslims at 1.9 times, Latinos at 0.6 times, and whites at 0.2 times.", "An important caveat: There are several holes in the reporting of hate crimes to the FBI. Local law enforcement agencies voluntarily report their data to a state agency that compiles the information for the FBI. Some local agencies report no hate crimes or don’t submit a report.", "A study by the federal Bureau of Justice Statistics found that 60 percent of violent hate crime victimizations were not reported to police in 2012.", "A 2016 Associated Press investigation found that more than 2,700 city police and county sheriff's departments have not submitted a single hate crime report to the FBI during the past six years — about 17 percent of all city and county law enforcement agencies nationwide.", "Among the agencies that reported zero hate crimes in 2014 were several major cities, including Jacksonville, Miami and Tampa.", "Another way to look at the data about hate crimes rather than per capita is the sheer number of crimes. By that measure, there were more hate crimes against African-Americans than LGBT residents. But that’s not surprising since African-Americans represent about 13.2 percent of the population according to the U.S. Census, while the LGBT community represents about 2.3 percent of the population, according to a survey done by the Centers for Disease Control (other surveys found a slightly higher rate.)", "Why would LGBT be victimized at a higher rate", "Answering the question as to why the LGBT community would be victimized at a higher rate is more complex.", "Some of the crime, paradoxically, may be motivated by more widespread acceptance of gay rights.", "\"We are seeing lots more gay people getting married,\" said Jack Levin, a sociologist at Northeastern University and expert on hate crimes. \"I think what hate crimes represent is a reaction to that.\"", "Some are motivated by fear.", "\"There is a visceral hatred against LGBT people in large part connected to fears about sexuality,\" Potok said. \"Sexuality is an incredibly fraught topic for some people and especially those people who fear they might have same-sex attraction themselves.\"", "Law enforcement is still investigating the Orlando shooting, but based on information so far, experts said that the shooter appeared to be motivated in part by bigotry and self-loathing. Omar Mateen, who was married to a woman, regularly visited the gay nightclub and used gay dating apps, according to reports by patrons at the club.", "Our ruling", "Lynch said, \"The LGBT community is more often the victims of hate crimes than any other recognized group.\"", "It’s worth noting that there may be widespread underreporting of hate crime incidents in general. However, the best available research shows that the LGBT community is victimized at a higher rate than other minority groups, according to FBI data.", "We rate this claim True.", "https://www.sharethefacts.co/share/c6bf52bd-bfaf-4b75-95ce-8cd3348a1de6", "Fox News Sunday, \"Lynch talks gun control, ISIS threat and Clinton email probe; Sen. Sessions on Trump's response to Orlando,\" June 19, 2016", "FBI, \"Latest hate crime statistics available,\" Nov. 16, 2015", "Southern Poverty Law Center, \"Anti-gay hate crimes: doing the math,\" Feb. 27, 2011", "New York Times, \"L.G.B.T. People Are More Likely to  be Targets of Hate Crimes Than Any Other Minority Group,\" June 16, 2016", "Bureau of Justice Statistics, \"Hate-crime victimization: 2004-2012 statistical tables,\" February 2014", "U.S. Census, Quick Facts", "Anti-Defamation League, Comparison of hate crime statistics, 2000-2014", "Anti-Defamation League, \"FBI 2014 Hate Crime Statistics Act Data: Cities That Did Not Report, Reported Zero or Reported One Incident,\" 2014", "Associated Press, \"AP: Patchy reporting undercuts national hate crimes count,\" June 5, 2016", "USA Today, \"Just over 2% tell CDC they are gay, lesbian, bisexual,\" July 15, 2014", "Miami Herald, \"What motivated Orlando killer? It was more than terrorism, experts say,\" June 17, 2016", "Miami Herald, \"Orlando mass shooting, aftermath rattle Florida’s gay rights fault lines,\" June 18, 2016", "PolitiFact, \"Hillary Clinton says anti-Muslim hate crimes tripled after Paris, San Bernardino,\" June 13, 2016", "Interview, David F. Jacobs, U.S. Department of Justice spokesman, June 21, 2016", "Interview, Mark Potok, Southern Poverty Law Center senior fellow, June 21, 2016", "Interview, Brian Levin, director of the Center for the Study of Hate & Extremism at California State University-San Bernardino, June 21, 2016", "Interview, Jack Levin, Northeastern University professor emeritus and co-director of the Brudnick Center on Violence and Conflict, June 21, 2016", "Interview, Michael Lieberman Anti-Defamation League Washington Counsel, June 21, 2016", "Interview, Brandon Lorenz, Human Rights Campaign spokesman, June 21, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]