["About this rating", "On 18 September 2016, Facebook user Rosemary Thomas shared a four-panel image of what she claimed was a breaded and deep-fried rat served to her at a Harlem-area Popeyes Chicken:", "Friends and family, this is a meal Popeyes in Harlem served my daughter, my niece and sister. This is clearly a rat and they have the nerve to have a 5 rating by the department of health. I've sent this picture to DESK@NY1 and no one has contacted me. People please free to share this picture. Think about all the other rat that have been served and the lasting effect this will have on my daughter, niece and sister. The exact address is 2730 Frederick Douglas Blvd.", "The claim was shared over a hundred thousand times, and social media users flooded Popeyes Chicken's Facebook page to express their disgust about the images. Some social media users perhaps recognized Thomas' claim as an iteration of a very old urban legend known as the \"Kentucky Fried Rat\":", "The \"Kentucky Fried Rat\" tale is one of the hoariest of food contamination urban legends, and some elements of its spread are easy to explain. Within the context of fast food restaurants, the offending eatery has to be a fried chicken outlet in order for the rat to be suitably disguised as a piece of food. Once the restaurant is established as one that serves fast-food chicken, it becomes Kentucky Fried Chicken because, as folklorist Gary Alan Fine writes, \"The frequency of attachment of an urban legend to the largest company or corporation is so common as to be considered a law of urban folklore.\" (These days, however, many KFC outlets receive their chicken pieces pre-battered, and thus one of them could not \"accidentally\" batter and fry a rat.)", "The choice of a rat as a contaminant is also easy: rats have turned up in food products before; they're the right size and shape to be mistaken for pieces of chicken (especially when fried in batter); and rats are vermin, symbols of filth and decay. The fact that the rat-chicken is usually eaten in the dark is a plot device to prevent premature discovery of the \"secret,\" although some might consider it an important symbolic aspect of the legend.", "So, what does this legend have to say? As our society becomes more urbanized (and frenetic), we become less and less involved with the preparation of our own food, frequently dining out instead of eating at home, scarfing a quick meal rather than enjoying a leisurely one, and leaving the food preparation entirely in the hands of others. And these others are not local restaurateurs we know well, but anonymous corporate fast food franchisees and their faceless employees. The combination of our guilt at abdicating this responsibility and our mistrust of corporations is expressed as fear that fast food entities who don't care about us will serve us tainted food prepared under unsanitary conditions, due to carelessness, laziness, or sheer malice.", "Like many other long-circulating urban legends, iterations (and parodies) of the deep-fried rat (or mouse) claim pop up from time to time on social media as first-person accounts. Typically, those claims are determined to be misunderstandings or fraudulent attempts to extort money from large companies.", "We contacted Popeyes Louisiana Kitchen, and spokeswoman Renee Kopkowski told us the customer originally arranged to meet with someone from Popeyes on 19 September 2016 to supply a sample of the item in question for testing but then postponed the meeting, so the company has not yet been able to submit the sample to third-party examination. Kopkowski also stated that Popeyes Louisiana Kitchen conferred with suppliers who suggested the depicted material was actually organ meat, and she added that New York City's Health Department subsequently performed a thorough investigation of the Harlem location and found no evidence of the presence of vermin (i.e., rats):", "A guest at a Popeyes in Harlem in New York City recently posted on her social media account saying she thought she found something unusual in her chicken. Everyone at Popeyes takes claims like this very seriously.  Food quality is our top priority.", "When the franchise owner of this restaurant learned of the guest’s post, he immediately tried contacting her to resolve the issue.  The pictures she posted were also sent to the poultry supplier and the owner contacted the health department to inspect his restaurant that day.   The health department re-confirmed the location’s “A” rating.", "It’s important to understand Popeyes uses fresh poultry.  It’s rare, but there are instances when chicken organs fail to be removed from the final product.  While they may look unpleasant, or sometimes look like non-chicken parts, they do not pose a health risk.", "The franchisee has requested that the guest in New York and the attorney she is working with turn over the product to have the product tested by an independent third party. Until that testing takes place, we can’t confirm her claim is valid", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]