["About this rating", "On Aug. 24, 2019, a 23-year-old Black man named Elijah McClain was walking home from the store when he was stopped by police officers in Aurora, Colorado (part of the Denver metropolitan area), after they received a report of a \"suspicious person\" wearing a ski mask. The encounter escalated, McClain was put in a chokehold, and a few days later he was dead.", "The Denver Post reported:", "Elijah McClain, 23, was walking home from a store around 10:30 p.m. on a Saturday evening when authorities contacted him near Billings Street and Colfax Avenue in Denver. Someone had called 911 to report a “suspicious person” who was wearing a ski mask and waving his arms.", "McClain routinely wore masks when he was outside because he had anemia — a blood condition — and became cold easily, according to his family.", "[...]", "After a struggle, McClain was handcuffed and officers requested medical assistance. Aurora Fire Rescue later injected him with ketamine in an attempt to sedate him, police said. He suffered cardiac arrest during the ambulance ride to a nearby hospital.", "[...]", "The following Friday McClain was declared “brain dead” and was expected to be taken off life support that afternoon, family members said. He died later that day.", "McClain's family called for the police officers involved in his death to be prosecuted, but it was announced in November that they would not face criminal charges. McClain's case did not receive the same national attention as other similar incidents, but it was thrust back into the spotlight after George Floyd's death in May 2020, when protests against racial injustice and police violence spread across the United States.", "In June 2020, an image of text supposedly relaying McClain's \"last words\" started going viral on social media:", "This message reads:", "I can't breathe. I have my ID right here. My name is Elijah McClain. That's my house. I was just going home. I'm an introvert. I'm just different. That's all. I'm so sorry. I have no gun. I don't do that stuff. I don't do any fighting. Why are you attacking me? I don't even kill flies! I don't eat meat! But I don't judge people, I don't judge people who do eat meat. Forgive me. All I was trying to do was become better. I will do it. I will do anything. Sacrifice my identity, I'll do it. You all are phenomenal. You are beautiful and I love you. Try to forgive me. I'm a mood Gemini. I'm sorry. I'm so sorry. Ow, that really hurt. You are all very strong. Teamwork makes the dream work. Oh, I'm sorry I wasn't trying to do that. I just can't breathe correctly.", "This is a largely accurate transcript of what McClain said in a video recording of his encounter with police in August 2019. These remarks can be heard on the body cam footage of one of the police officers involved in the incident. An official copy of this video from the Aurora Police Department can be seen below (the relevant portion of the video starts at around the 12:30 mark).", "The text in the viral transcript has been slightly edited to remove repeated phrases and inaudible moments (McClain says \"I'm just different\" multiple times), but none of the edits are misleading. The text describing actions in the viral post — at one point noting that McClain was crying, at another noting that he vomited — are also accurate.", "This viral transcript does omit at least one phrase uttered by McClain during this encounter. A few moments after the final words of this viral transcript, McClain says \"I can't fix myself\" before vomiting again.", "NPR reported:", "Someone picks up a body camera and McClain can be seen lying on his side with both hands restrained behind his back, and one officer jamming his knee on the man's torso.", "When McClain attempts to roll over to vomit, they shout at him to \"stop fighting us.\"", "\"If you keep messing around, I'm going to bring my dog out here and he's going to bite you,\" says an officer standing over McClain.", "McClain proceeds to vomit.", "\"I can't fix myself,\" he says weakly.", "McClain's body goes limp and he passes out.", "Eventually one officer asks, \"Are you OK?\"", "But he's not asking McClain. He's speaking to the officer on top of him.", "\"Yeah, I'm good,\" the officer says shifting his weight.", "When paramedics arrived, McClain was injected with ketamine (described by Aurora Police as \"a standard medication routinely utilized to reduce agitation\") and then loaded into an ambulance where he suffered cardiac arrest. On August 30, McClain was pronounced brain dead, removed from life support, and died.", "In February 2021, an independent investigation commissioned by the city found that police officers did not have legal basis to stop McClain. The Denver Post reports:", "Aurora police officers did not have a legal basis to force Elijah McClain to stop walking, to frisk him or to use a chokehold on him, an independent investigation commissioned by the city found.", "The initial investigation into the incident led by the department's detectives in the Major Crimes Unit was also deeply flawed, the investigators found. The detectives failed to ask basic, critical questions of the officers involved in McClain's death and instead \"the questions frequently appeared designed to elicit specific exonerating 'magic language' found in court rulings,\" the report states.", "[...]", "Aurora city officials on Monday morning released the 157-page report on the death of McClain at the hands of city police and paramedics. The city hired a panel of investigators to examine the officers' and paramedics' decision and make policy recommendations \"to lessen the chance of another tragedy like this one from happening again,\" the report states.", "Nieberg, Patty; Peipert, Thomas.   \"Colorado Reexamines Elijah McClain’s Death in Police Custody.\"\r\n    The Associated Press.   25 June 2020.", "Minutaglio, Rose.   \"2 Million People Signed This Petition Demanding Justice For Elijah McClain.\"\r\n    Elle.   25 June 2020.", "The Denver Post.   \"Elijah McClain Timeline: What Happened That Night and What Has Happened Since.\"\r\n    25 June 2020.", "Romo, Vanessa.   \"Colorado Gov. Appoints Special Prosecutor To Reopen Probe Of Elijah McClain Death.\"\r\n    NPR.   25 June 2020.", "Sherry, Allison.   \"Polis Appoints Special Prosecutor To Review The Death Of Elijah McClain.\"\r\n    Colorado Public Radio.   25 June 2020.", "Ockerman, Emma.   \"Millions Are Demanding Justice for Elijah McClain, Who Died After Cops Put Him in a Chokehold Last Year.\"\r\n    Vice News.   24 June 2020.", "Updated [22 February 2021]: Included additional reporting from the Denver Post.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]