["The photo was shared in this Facebook post on November 1, 2020.", "The photo caption states: \"aftermath of Typhoon Rolly in Virac Catanduanes....Brace Ourselves..there's still Typhoon Sioni (sic).... / LORD KEEP US SAFE IN YOUR MIGHTY HANDS AND UNDER YOUR BLOOD....HALLELUJAH....\"", "The photo is also overlaid with text that reads: “Virac, Catanduanes”.", "“Rolly” is the local name of Typhoon Goni, which was the most powerful typhoon to hit the Philippines this year, killing at least 20 and destroying tens of thousands of homes, as AFP reported here.", "Virac is the capital of Catanduanes province, an island in east Philippines that bore the brunt of the typhoon.", "“Siony” is the name of a tropical storm that threatened to hit the northern parts of the country on the heels of Typhoon Goni.", "Identical photos were also shared alongside a similar claim on Facebook here and here.", "However, this claim is false.", "A reverse image search on Google found the photo was published by Reuters news agency in this report dated November 10, 2013. The photo is the 23rd in a slideshow embedded in the report.", "The photo is captioned: “Residents walk on a road littered with debris after Super Typhoon Haiyan battered Tacloban city in central Philippines November 10, 2013.”", "The report reads, in part: “Rescue workers struggled to reach ravaged towns and villages in the central Philippines on Monday as they tried to deliver aid to survivors of a powerful typhoon that killed an estimated 10,000 people and displaced more than 600,000.”", "Below is a screenshot comparison of the photo in the misleading posts (L) and the Reuters photo (R):", "The Reuters photo also appears with the correct caption in this 2013 report by UK newspaper The Guardian.", "The misleading claim was also debunked here by Philippine news organisation Rappler.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]