["A letter viral on social media, with many presuming that it is a government order for social media users, is notifying people to abstain from using Facebook, Twitter, WhatsApp and Instagram to share political propaganda posts before the 2019 elections. “Do not share election-related posts, photographs and posters,” reads the ‘notice’ circulated under the name of ‘Crime Prevention Council of India.’", "The letter reads – “सोशल मीडिया से जुड़े Facebook, Twitter, Instagram, WhatsApp और Other Networks के माध्यग से कोई भी व्यक्ति आगामी चुनाव 2019 के दौरान चुनाव प्रचार सम्बन्धित पोस्ट, फोटो, बैनर आदि को एक दूसरे को न भेजें ! (Social media users connected to Facebook, Twitter, WhatsApp and other networks do not share political propaganda posts, photos and posters, before the coming elections.)”", "The concluding lines of the letter warn action by district-level special surveillance team of the Election Commission – “चुनाव आयोग की जिला स्तरीय Special Surveillance Team द्वारा कार्यवाही भी की जा सकती है।”", "Several social media users have shared the notice assuming it to be a government order.", "Many individual users have also sent queries to Alt News regarding the authenticity of the letter.", "While the name of the organisation might allude that it is affiliated to the government, facts prove otherwise. Alt News visited the site of ‘Crime Prevention Council of India (CPCI)’ – www.cpcindiaonline.com – and the site’s URL itself makes it evident that the organisation is not a part of the government.", "The URL of the ‘Crime Prevention Council of India’ ends with a ‘.com’ while websites of the Indian government either end with a ‘gov.in’ or ‘nic.in’.", "The official website of any ministry or government department always ends with the domain “gov.in”. For example – Ministry of External Affairs (mea.gov.in), Government of Uttarakhand (uk.gov.in), Swachh Bharat (swachhbharatmission.gov.in), Prasar Bharati (prasarbharati.gov.in).", "The website of any organisation affiliated to the Indian government ends with a ‘nic.in’. Domain name ‘nic.in’ is owned by the National Informatics Centre (NIC), which is the science and technology organisation of the Government of India under the Ministry of Electronics and Information Technology. ‘Nic.in’ can be allocated only to Indian government entities. For instance, Central Board of Secondary Education (cbse.nic.in), Indian Institute of Mass Communication (iimc.nic.in).", "The organisation is a non-governmental establishment. “We are an NGO that works towards reducing crime in the country via awareness programs, workshops, seminars, etc. A lot of our work also involves partnering with the government,” said Dr SK Pandey, Chairman of CPCI, to Alt News.", "“The letter viral on social media was wrongly issued by a member of CPCI and not the organisation. He should not have issued the letter as a ‘notice’ but only as a suggestion in public interest. The concerned person – District Officer Narendra Singh – has now been terminated from his position and is not associated with the organisation any more,” added Dr Pandey.", "Dr Pandey has also issued a letter on behalf of CPCI, clarifying that the earlier ‘notice’ was not issued by the organisation but a faulting district officer who has now been recused from his role. The letter also mentions that the Crime Prevention Council of India is a non-governmental organisation.", "The letter doing rounds on social media, notifying people to abstain from posting political propaganda content before the elections, was, thus, not issued by the government. It was merely a suggestion in public interest issued by a member of a non-governmental organisation. The NGO has, however, informed that the concerned member wrongly issued the letter.", "Despite the illusion of a government notice, social media users could have avoided falling for the letter by carefully analysing its tone and the organisation’s website URL provided at the bottom. Even though the letter gave the impression of a warning, it did not mention ‘Government of India’ or the name of any ministry. Moreover, the URL provided at the bottom ended with a ‘.com’ domain, which was sufficient to establish that the organisation was not a government entity.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]