["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A reader asked us to look into a claim made by Rachel Maddow about earthquakes at the Dallas/Fort Worth International Airport.", "If couples in Central Oklahoma felt the earth move on Valentine’s Day, it might not have been passion. Five earthquakes hit the area last Friday, followed by a sixth the next day. The quakes weren’t big. The strongest measured 3.5 on the Richter scale, but all of them were over the threshold to get residents’ attention.", "Rachel Maddow noticed as well. The MSNBC host linked the flurry of seismic activity to the region’s sizeable number of wells used to dispose of waste from oil and gas hydraulic fracturing, or fracking. Oklahoma has about 6,000. There are many clustered in the county where the quakes took place.", "Maddow suggested that Central Oklahoma take a tip from Texas.", "\"When the Dallas/Fort Worth Airport needed to stop its earthquake spike a few years ago,\" Maddow said, \"they temporarily shut down the wells that were injecting fracking fluid into the ground at high pressure on the airport property, and lo and behold, those earthquakes stopped.\"", "A reader asked us to see if that is true.", "We can report that it is.", "\"It’s an accurate assessment,\" said Dave Magana, the senior manager for public affairs at the airport.", "In fracking, operators pump water and chemicals into the ground to release oil and natural gas. When those fluids come back to the surface, the wastewater is moved to a disposal well where it is pumped back deep into the Earth. In 2008, the airport had leases with the Chesapeake Energy company for two such wells. One of them was near an old inactive fault line.", "The wells became active in September 2008 and the first earthquake came in October of that year. Brian Stump, a seismologist at Southern Methodist University, was part of a team that studied what was going on.", "\"Based on the timing and the location of the earthquakes, there was a plausible linkage,\" said Stump.", "Dallas-Fort Worth managers took Stump’s report to heart.", "\"The airport asked Chesapeake to close the well, and they did,\" Mangana said.", "The earthquakes stopped. The well in question has remained inactive, although a second well on airport land continues to operate.", "Fracking and its environmental impacts are a contentious issue. A study from the National Academy of Sciences did not find that getting natural gas this way led to \"induced seismic activity.\" However, it did conclude that disposal of wastewater \"does pose some risks.\"", "Our ruling", "Maddow said, \"When the Dallas/Fort Worth Airport needed to stop its earthquake spike a few years ago, they temporarily shut down the wells that were injecting fracking fluid into the ground ... (and) those earthquakes stopped.\"", "An airport official confirms Maddow's story, aside from the fact that it was one well. Officials at the airport asked that a well be shut down, and after it was, the earthquakes eventually stopped. Seismologists linked the well to the earthquakes.", "We rate the claim True.", "Update: This item was updated on Feb. 24, 2014, to make clear that airport officials asked Chesapeake Energy to shut down the well.", "MSNBC, The Rachel Maddow Show, Feb. 17, 2014", "KGOU, Oklahoma Earthquake Swarm On ‘The Rachel Maddow Show’, Feb. 18, 2014", "Newson6.com, Sixth earthquake rumbles in Central Oklahoma, Feb. 15, 2014", "Associated Press, Study: Quakes linked to post-gas drilling process, March 11, 2010", "State Impact Oklahoma, Exploring the links between earthquakes and oil and gas disposal wells", "National Academy of Science, Induced Seismicity Potential in Energy Technologies, June 2013", "Interview, David Magana, senior manager public affairs, Dallas-Fort Worth Airport, Feb. 19, 2014", "Interview, Brian Stump, seismologist, Southern Methodist University, Feb. 19, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]