["A short video is being circulated on social media with the claim that fake cashews being manufactured and sold in Kerala.", "The same clip was earlier viral with a different message, Twitter user @ProfMKay wrote, “A friend of mine sent this video to have it posted. Now we have one more added problem, please check the cashews before buying. Lesson: nothing to be taken for granted.” This video has been viewed over 3,000 times. (archived link)", "A friend of mine sent this video to have it posted. Now we have one more added problem, please check the cashews before buying. Lesson: nothing to be taken for granted. pic.twitter.com/3F9i7McA4t", "— ProfMKay🇮🇳 (@ProfMKay) August 20, 2020", "A Facebook Gurvinder Singh Sarpanch Saab also posted the viral video and wrote in Hindi, “Fake cashew nuts are made out of tamarind seeds. All hotels keep these for snacks as they can be procured very cheaply. There’s a huge consumption of these fake cashews. Pay the right price for the right goods.” This video has been viewed over 2,500 times. (archived link)", "(Translated from कटनी में इमली के बीजों से बनाए जाते हैं नक़ली काजू और सभी होटल में यही चलते हैं खाने में । बहुत सस्ते में मिलते हैं होटल वालों को , भारी मात्रा में खपत है इन नक़ली काजू की ।सही दाम देकर सही माल खरीदे ।)", "Alt News received several requests to fact-check this on WhatsApp (+917600011160) and on our official Android application.", "Alt News performed a keyword search on YouTube and found several similar videos a machine is producing cashew-shaped objects. One Tushar Pandya also uploaded the same on his YouTube channel.", "Alt News had a telephonic conversation with Pandya who manufactures machines that help in the mass production of Indian snacks. He is based out of Mumbai. There are plenty of other videos on his channel that show a machine making other such snacks. Pandya said, “I am aware a misleading video has gone viral on social media. Several people have called me the past few days. The claim that the machine is making fake cashew is false. This machine in the video is making flour-based cashew shaped biscuits. These are roasted before they are ready to eat.”", "In a reply to @ProfMKay, a Twitter user wrote, “These aren’t fake cashews. These are biscuits shaped like cashews. That’s a sheet of rolled dough passing through the stencil which cuts it into cashews. Looks like a small scale, local business. You can’t replicate the colour, feel, texture and taste of cashew so easily.”", "These aren’t fake cashews. These are biscuits shaped like cashews. That’s a sheet of rolled dough passing through the stencil which cuts the it into cashews. Looks like a small scale, local business. You can’t replicate the colour, feel, texture and taste of cashew so easily 😂😂 pic.twitter.com/DJfr5GvYwM", "— Armoured Assault (@AssaultArmoured) August 20, 2020", "There are also videos on YouTube that teach how to make cashew-shaped snacks at home.", "The social media claim that the video shows fake cashews is false.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]