["About this rating", "On 20 October 2015, Facebook user Zaida Pugh, AKA Ms Muffin Babey, uploaded a (since-removed) video purportedly >showing a woman stabbing her baby to death in order to get revenge on her boyfriend:", "[A] selfish mother is locked inside a bathroom with her newborn son. Her younger sister can be heard screaming hysterically on the other side of the door, pleading to get inside and take the baby before the unthinkable happens.", "As the younger girl screams, the mother begins stabbing her newborn son to death. Almost immediately, blood can be seen on the baby’s blanket as the mother continues to scream at the camera in an attempt to justify her actions. She insisted that she wasn’t ready to be a mother and that she wanted her life back. She wanted to enjoy the carefree lifestyle she had prior to motherhood.", "This video quickly went viral and racked up more than 1.2 million views within the first few days of its posting. Despite the video's popularity, neither it nor other sources provided any information about the incident depicted. That status changed on 22 October 2015, when Zaida Pugh posted a second video to her Facebook page explaining that the video was a prank in order to raise awareness for ... well, it's actually not clear what Zaida Pugh was trying to raise awareness for:", "Why did I do this video? Why do I do any of my videos. Because there's messages out there. I feel like I might be repeating myself a little too much. It's a wake up call. This is a call to the public. Hello? Wake up. This is actually something that is going on. This is something that we need to face and we need to make a change. Hello, this is a wake up call to everybody.", "Posted by Zaida Pugh on Thursday, October 22, 2015", "The child seen here wasn't harmed, and the two women featured in the video were acting. This clip was just one of several similar prank videos posted online by Zaida Pugh.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]