["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Even a presidential heckler can find his way to PolitiFact’s Truth-O-Meter.", "At a speech Monday in San Francisco, a young man yelled at President Barack Obama and urged the president to overhaul the nation’s immigration system.", "\"Mr. Obama, my family has been separated for 19 months now!\" the man said, according to a New York Times report. (You can watch a video of the incident here.)", "Obama continued trying to speak, but the man continued yelling, saying at one point: \"You have a power to stop deportation for all undocumented immigrants in this country.\" The heckler was later identified as Ju Hong, 24, of South Korea.", "The president replied, \"Actually, I don’t. And that’s why we’re here.\"", "In this standoff, the president is largely correct.", "We covered much of this ground in a fact-check of Florida U.S. Sen. Marco Rubio, who claimed that Obama could \"basically\" legalize all immigrants here illegally \"by the sign of a pen.\" We’ll review the evidence here.", "In the heckler’s case, he appears to be talking about Obama issuing an executive order to stop deportations. But experts said action like that would likely violate the separation of powers.", "Congress determines the laws governing how a person can legally reside in the country, so Obama cannot give out green cards, paths to citizenship or permanent residency en masse, experts told us. And Obama does not have the authority to override laws simply by proclamation.", "\"Executive orders have tended to be quite focused, not open-ended over time,\" said Kevin Johnson, University of California Davis School of Law dean. \"Such an order would likely be subject to quite possibly successful legal challenge, with the claim being that legalization would be contrary to an act of Congress, namely the Immigration and Nationality Act.\"", "Now, Obama has taken some executive action.", "In June 2012, amid stalled DREAM Act efforts, Obama announced a new administrative policy called Deferred Action for Childhood Arrivals that allowed undocumented immigrants who came to the country as children to apply for a renewable, temporary status that suspends deportation and allows them to work in the country. So far, U.S. Citizenship and Immigration Services has approved at least 455,000 people for this form of deferred action.", "Obama, however, has said he does not plan to go further. And experts say making the case would be difficult.", "If he wanted to order a stay of deportations across the board, he would have to provide a strong justification, such as a lack of resources to do the job, said Robert Delahunty, a University of St. Thomas School of Law professor who co-authored an argument against the constitutionality of Deferred Action for Childhood Arrivals.", "\"But he could do that only briefly, and only in what I’d consider pretty extreme circumstances,\" Delahunty said.", "On the other hand, the country’s immigration laws grant Obama and the Department of Homeland Security lots of wiggle room in granting temporary work permits and refusing to widely deport people, said Alex Nowrasteh, an immigration policy analyst at the libertarian Cato Institute. A widespread stay, though, would be \"a crazy scenario,\" he said.", "Even some of Obama’s loudest critics on immigration policy don’t think he would go that far.", "\"It could be done. Obama’s gotten away with as much, but I don’t think he’d do it,\" said Mark Krikorian, executive director of the Center for Immigration Studies, a think tank that is for stricter immigration control. \"That would be a bridge too far even for the pusillanimous appeasers among Republicans in Congress.\"", "Experts told us they think it’s more conceivable that Obama would chip away at the undocumented immigrant population little by little by building on the deferred action policy for children who came to the country as minors. An expansion would have to come with caveats, such as cut-off dates and clean criminal histories.", "\"It would be the mother of all political battles,\" said Carl Hampe, a private immigration lawyer who was counsel for the Senate subcommittee on immigration from 1983 to 1991 and worked for the Department of Justice under President George H.W. Bush. \"As a purely theoretical legal question, is there a plausible argument that the president has that legal authority? Some would argue yes.\"", "Our ruling", "While giving a speech in San Francisco, President Barack Obama was heckled and told he has the \"power to stop deportation for all undocumented immigrants in this country.\"", "Our experts say any executive action that sweeping would violate the separation of powers between Congress and the executive branch. Obama has taken some executive action to temporarily keep more undocumented immigrants in the United States, and likely could do more, but not to the permanent point that the heckler argues. We rate his claim Mostly False.", "New York Times, \"Obama Calls for Quick Action on Immigration, and So Does a Heckler,\" Nov. 25, 2013", "KTVU, \"RAW VIDEO: Pres. Obama responds to heckler during speech in SF,\" Nov. 25, 2013", "PolitiFact, \"Marco Rubio fears Obama could 'basically legalize' all undocumented immigrants 'by the sign of a pen',\" Aug. 22, 2013", "Interview with Bobby Whithorne, White House spokesman, Aug. 19, 2013", "Interview with Kevin Johnson, UC Davis School of Law dean, Aug. 19, 2013", "Interview with Shoba Sivaprasad Wadhia, Pennsylvania State Dickinson School of Law professor and director of Center for Immigrants’ Rights, Aug. 19, 2013", "Interview with Hiroshi Motomura, UCLA School of Law professor, Aug. 20, 2013", "Interview with David A. Martin, University of Virginia School of Law professor, Aug. 20, 2013", "Interview with Robert Delahunty, University of St. Thomas School of Law professor, Aug. 20, 2013", "Interview with Alex Nowrasteh, Cato Institute immigration policy analyst, Aug. 20, 2013", "Interview with Daniel Costa, Economic Policy Institute Director of Immigration Law & Policy Research, Aug. 20, 2013", "Interview with Lynden Melmed, former chief counsel of U.S. Citizenship and Immigration Services of the Department of Homeland Security and attorney at Berry Appleman & Leiden LLP, Aug. 20, 2013", "Interview with Carl Hampe, Baker McKenzie immigration attorney and an attorney for the Senate committee that drafted the 1986 immigration law, Aug. 20, 2013", "Interview with Steve Blando, U.S. Citizenship and Immigration Services spokesman, Aug. 21, 2013", "Interview with Mark Krikorian, executive director of the Center for Immigration Studies, Aug. 21, 2013", "U.S. Citizenship and Immigration Services, Deferred Action for Childhood Arrivals data, accessed Aug. 21, 2013", "National Journal, \"Immigration Plan B focuses on White House,\" Aug. 8, 2013", "Tampa Bay Times, \"Sen. Marco Rubio tours Florida to repair image damaged over immigration,\" Aug. 13, 2013", "PolitiFact, \"Michele Bachmann says Barack Obama can use executive order to give voting rights to illegal immigrants legalized under Senate bill,\" July 23, 2013", "Associated Press, \"Rubio warns of executive order on immigration,\" Aug. 14, 2013", "NBC Latino, \"Obama tells Telemundo he hopes for immigration overhaul within 6 months,\" Jan. 30, 2013", "MSNBC, \"Marco Rubio may be onto something when it comes to deportations,\" Aug. 13, 2013", "National Review, \"Executive overreach,\" June 12, 2012", "Washington Post op-ed, \"A lawful step for the immigration system,\" June 24, 2012", "PolitiFact,  \"Has Barack Obama deported more people than any other president in U.S. history?\", Aug. 10, 2012", "PolitiFact, \"Sen. Jim DeMint and other Republicans say Obama immigration plan is amnesty,\" June 20, 2012", "PolitiFact, \"Marco Rubio says Obama shows ‘reluctance’ to enforce immigration law,\" May 7, 2013", "Prosecutorial Discretion Memorandum, Homeland Security Secretary Janet Napolitano, June 15, 2012", "U.S. Immigration and Customs Enforcement, removal data, accessed Nov. 26, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]