["About this rating", "On 14 July 2016, scores of people were killed in Nice, France, when a large truck plowed through a Bastille Day crowd.  This terror attack took place just eight months after a series of coordinated terrorist attacks hit Paris and claimed the lives of 130 people, 89 of whom were killed at the Bataclan nightclub.", "As the world reacted in grief and horror to the Nice trgaedy, both  Fox News and Britain's Daily Mail newspaper published articles reporting that France affirmatively covered up unspeakable acts of torture that occurred at the Bataclan on the night of the November 2015 attacks. A headline published by the latter sensationally asserted that France (then grieving) purposely covered up the worst details of what was by all accounts unbridled horror:", "After repeating most of the rumors as if they were fact, the paper added that \"prosecutors at the parliamentary inquiry into the Bataclan deaths have cast doubt over the claims after revealing that no sharp knives were found at the scene.\" Fox News (aggregating from a separate source) similarly framed the rumors as fact:", "A French government committee has heard testimony, suppressed by the French government at the time and not published online until this week, that the killers in the Bataclan tortured their victims on the second floor of the club.", "The chief police witness in Parliament said that an investigating officer, tears streaming down his face, rushed out of the Bataclan and vomited in front of him just after seeing the disfigured bodies.", "According to this testimony, Wahhabist killers apparently gouged out eyes, castrated victims, and shoved their testicles in their mouths. They may also have disemboweled some poor souls. Women were stabbed in the genitals — and the torture was, victims told police, filmed for Daesh or Islamic State propaganda. For that reason, medics did not release the bodies of torture victims to the families, investigators said.", "But prosecutors claimed these reports of torture were “a rumor” on the grounds that sharp knives were not found at the scene. They also claimed that maybe shrapnel had caused the injuries.", "Both outlets single-sourced their claims from a 15 July 2016 article published by the HeatStreet web site. That outlet chose the hours after the Nice attack to dredge up old claims from an inquiry that occurred in March 2016, with the only marginal relevance to the claims being another outbreak of carnage and a frightened public. Nothing more occurred between the March 2016 inquiry and the July 2016 spate of claims to warrant republication of unvetted rumor in a time of international grief and worry.", "The portion in question originated via an inquiry published (not suppressed) by the French government, based on 21 March 2016 testimony in which investigators were asked about rumors of torture or propaganda creation at the Bataclan. A translated version of the inquiry's minutes revealed that investigators soundly debunked the claims on record:", "Mr President Fenech For the information of the inquiry, Mr. PT, can you tell us how you learned that there had been acts of barbarism within the Bataclan: beheadings, evisceration, enucleations?", "MTP After the assault, we were with colleagues at the passage Saint-Pierre Amelot when I saw tears streaming out of the eyes of an investigator who went to vomit. He told us what he had seen. I did not know this colleague, but he was so shocked that it went to see it myself, naturally.", "Alain Marsaud. Acts of torture happened on the second floor?", "MTP I think, as I entered at the ground floor I saw there no such thing had occurred, only people hit by bullets.", "Minutes from the inquiry session of 30 March 2016 again addressed what were clearly marked as rumors, and the government inquisition again heard no forensic evidence that supported such claims:", "Mr. President. Following the November attacks, he was referred to the commission of barbaric acts.", "François Molins. It's a rumor. Forensic doctors were categorical: there was no act of barbarism, no use, including knives. According to a witness, the testicles of a victim were cut off, but no findings have corroborated it.", "Even if the French government hadn't made public their findings about torture and evisceration at the Bataclan prior to the attacks in Nice, the post-Bastille Day attack rumor operated on the assumption such a coverup was even possible. By all accounts, 89 people died at the Bataclan on 13 November 2015, while another 200 were wounded but survived, and many more escaped unscathed. Contemporaneous reports estimated that 1,000 people were in attendance at the Bataclan on 13 November 2015 with 700 of them were physically unharmed. Had the French government opted to cover up acts of torture and emasculation at the venue, there was nothing stopping the vast majority of surviving witnesses from sharing their stories. None did.", "Finan, Victoria.   \"French Government 'Suppressed Gruesome Torture' of Bataclan Victims ...\"\r\n    Daily Mail.   15 July 2016.", "Mensch, Louise.   \"EXCLUSIVE:France ‘Suppressed Reports of Gruesome Torture’ at Bataclan Massacre.\"\r\n    HeatStreet.   15 July 2016.", "Willsher, Kim.   \"Attack at Paris's Bataclan: 'Two or Three Men Began Shooting Blindly at Crowd.'\"\r\n    The Guardian.   13 November 2015.", "Assemblée Nationale.   \"Les Commissions D'enquête.\"\r\n    March 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]