["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Sen. Mark Begich, a Democrat, brands himself as being \"as independent as Alaska.\"", "Unsurprisingly, Republicans in the primary field for the 2014 midterm election versus Begich beg to differ. One such candidate, former state Attorney General Dan Sullivan, argued in a campaign email that Begich’s votes are in line with President Barack Obama’s positions on economic issues.", "\"Instead of standing up to President Obama’s reckless economic policies, Mark Begich has supported them 97 percent of the time,\" the email read. \"By rubber-stamping overspending and over-regulation, Begich and Obama are stifling our nation’s economic growth and standing in the way of job creation.\"", "Begich, Alaska’s junior senator, faces re-election for the first time in November. The leading Republican challengers are Sullivan and Lt. Gov. Mead Treadwell. Sullivan briefly served as attorney general. Since November 2010, he’s been commissioner of the Alaska Department of Natural Resources. This is his first run for public office.", "PolitiFact wanted to know if Begich and Obama really agree on economic issues 97 percent of the time.", "Let’s crunch some numbers", "Sullivan’s campaign office pointed us toward CQ Weekly’s presidential position votes report. That’s from Congressional Quarterly, a nonpartisan outlet for congressional news and legislative tracking.", "That analysis shows that, out of the pool of votes where Obama \"took a clear position,\" Begich’s vote matched the president’s stance 97 percent of the time.", "In 2013, the Senate took 291 roll call votes. CQ registers Obama as having taken a clear stance on 108 of those votes, or about 37 percent.", "We found the same trends across CQ reports since Begich took office in 2009. CQ put him voting with Obama over 90 percent of the time for each year served.", "This data looked at all votes, not just votes on economic policy. Also, all Democrats received 90 percent and higher ratings in the 2014 report. That shows that, in general, Democratic senators tend to vote with their president.", "CQ’s Roll Call, on the other hand, offered a different picture of Begich’s reputation in a profile of the race: \"Since entering the Senate, Begich, a former Anchorage mayor, has struck an independent pitch and continues to highlight his focus on Alaska issues, even when they swim upstream from the administration’s priorities.\"", "That independence was reflected in a different congressional rating we looked at from OpenCongress, a nonpartisan legislative tracking service that tracks how often each senator votes with the majority of his or her caucus. OpenCongress then ranks the results within each party, giving a more detailed take on where individual senators fall on an ideological spectrum.", "In 2013, for example, OpenCongress said Begich voted with the majority of Democrats 87.1 percent of the time. That’s based on all 291 Senate votes.", "OpenCongress ranked Begich at 45th for 2013 when it comes to voting with his party. That shows that Begich is among the most independent senators currently serving.", "Both the CQ and OpenCongress data focus on senators’ overall voting record, not specifically on economic policy, as Sullivan’s claim said.", "On economic policy, Begich voted against the March 2013 Senate budget proposal passed by nearly every other Democrat. Begich has also opposed Democratic measures in favor of free trade agreements with Colombia and Panama, and legislation that would put more taxes on the oil and gas industry.", "\"National Democrats often try to pay for something with oil and gas taxes,\" Begich told Politico in January. \"And I have to explain that ain’t happening: That ain’t happening over my dead body.\"", "Our ruling", "Sullivan’s campaign email claimed Begich supports Obama’s economic policies 97 percent of the time.", "The statistic the campaign offered looked at all Senate legislation, not just economic policy. Most Democrats scored 90 percent or higher. In another vote analysis that ranked Democrats according to party loyalty, Begich ranked only 45th. Notably, he’s crossed his party on economic issues like yearly budgeting and oil taxes.", "Sullivan’s claim hinges on one statistic in a way that doesn’t accurately reflect Begich’s voting record on economic policy. We rated this claim Mostly False.", "Congressional Quarterly member profiles, Mark Begich, accessed Feb. 19, 2014", "Congressional Quarterly, \"CQ Roll Call’s vote studies -- 2013 in review,\" Feb. 3, 2014", "CQ Roll Call, \"Most fascinating races of 2014: Alaska Senate,\" Dec. 29, 2013", "CQ Weekly, \"Presidential support,\" Feb. 3, 2014", "Email interview with Jerry McBeath, University of Alaska Fairbanks political science professor, Feb. 20, 2014", "Email interview with Mike Anderson, Dan Sullivan campaign spokesman, Feb. 20, 2014", "OpenCongress, \"Voting with party,\" accessed Feb. 20, 2014", "Phone and email interviews with Max Croes, Mark Begich campaign spokesman, Feb. 19-20, 2014", "Politico, \"Obama’s plan to save the Senate,\" Jan. 15, 2014", "PolitiFact Florida, \"Connie Mack says Bill Nelson votes 98 percent of the time with Obama,\" Oct. 17, 2012", "PolitiFact Florida, \"Fox’s Sean Hannity says Bill Nelson voted with Dems ‘nearly 95 percent’ of the time,\" Nov. 30, 2011", "PolitiFact Ohio, \"Ohio Republicans say Sherrod Brown has voted with Obama 95 percent of the time,\" Jan. 25, 2012", "Washington Post, \"Manchin-Toomey gun amendment fails,\" April 17, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]