["About this rating", "A bizarre story emerged from video game culture and social media in July 2019, when a widely-shared tweet claimed that dozens of people had contracted herpes from drinking bathwater they purchased from the Instagram star Belle Delphine.", "The tweet was posted on July 7 by the @BakeRises account, which at that time bore the name \"Daily Mail US\" and the logo of the Daily Mail website as its profile picture, using the caption \"Over 50 People Have Reportedly Contracted Herpes After Drinking Instagram Star, Belle Delphine's Bath Water\":", "Belle Delphine did appear, at least briefly, to have packaged and sold what she claimed was her own bathwater, but the \"herpes\" twist to the story was no more than a hoax.", "On July 1, Belle Delphine posted a photograph of herself to her four million Instagram followers, writing: \"I am now selling my bath water for all you thirsty gamer boys. Check out my new shop where I'm selling stuff for you!! www.belledelphinestore.com\":", "BelleDelphineStore.com was a functioning website, and the listing for \"GamerGirl Bathwater\" indicated that small containers of some form of liquid were indeed on sale for $30 each, although the item was listed as \"Out of stock\" as of July 9. The description of the bathwater included a remarkable disclaimer: \"Bottled while I'm playing in the bath. This really is bath water. Disclaimer: This water is not for drinking and should only be used for sentimental purposes.\"", "At least two YouTubers received delivery of the \"GamerGirl Bathwater,\" both having posted videos about the product, although we can't confirm that the packages they received contained bathwater (as opposed to some other kind of water).", "The initiative attracted the attention of social media users and garnered news articles by Newsweek and U.K. tabloid newspaper the Mirror, among others. A few days later the @BakeRises account got in on the act, tweeting out the \"herpes\" hoax.", "@BakeRises confirmed that the herpes claim was a prank in a series of tweets that clarified the \"Daily Mail US\" handle was no more than impersonation, and that reveled in the prospect of forcing Belle Delphine to refute the rumor and causing unnecessary worry to someone who bought the bathwater. Between July 7 and July 9, @BakeRises intermittently tracked how their hoax tweet had caused the number of their followers to explode, while another tweet explicitly stated that \"It seems the best way to grow on Twitter is to impersonate a company [the Daily Mail] and say things about a celebrity [Belle Delphine] that legally can be considered libel and I could potentially be sued for\":", "It seems the best way to grow on twitter is to impersonate a company and say things about a celebrity that legally can be considered libel and I could potentially be sued for.", "— Bake ❼ (@BakeRises) July 8, 2019", "Belle Delphine herself refuted the hoax on Instagram, writing \"You're a [clown] if you believed that\" in response to a commenter who had repeated the \"herpes\" rumor.", "Joyner, Alfred.   \"Who Is Belle Delphine? 19-Year-Old Instagram Model Sells Her Own Bath Water for $30 a Jar.\"\r\n    Newsweek.   5 July 2019.", "Boyd, Milo.   \"Instagram Model Sells USED Bathwater for £24 to Army of Loyal Followers.\"\r\n    The Mirror.   4 July 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]