["In a 2014 speech about how the criminal justice system shouldn’t penalize young adults for making certain mistakes, Sen. Kamala Harris, then California’s attorney general, described young people ages 18 to 24 as “stupid.”", "The quote being shared online lacks that context.", "Did vice presidential nominee Sen. Kamala Harris call young Americans stupid, as a post on social media claims?", "In an image posted by a Facebook page called \"Students for Trump,\" we see a photo of Harris next to a quote that reads, \"What else do we know about this population, 18 through 24? They are stupid!\"", "The post’s caption says: \"This is what Kamala thinks about young Americans?!\"", "The quote is part of something Harris said six years ago, but rather than insulting young voters, Harris  made the comment during a speech about the need to forgive mistakes made by young, low-level criminal offenders.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Harris made the remark during an address on criminal justice policy at a symposium hosted by the Ford Foundation in May 2014, when she was California’s attorney general.", "The quote on its own is missing the context of the larger point that Harris was trying to make, which was how the criminal justice system shouldn’t penalize young adults for making certain mistakes.", "The full video of her remarks (her comment comes around the 16:45-mark) shows that Harris is talking about forgiving young people’s low-level crimes, and how the system treats offenders in the age group during what she referred to as their most developmental stage in life.", "\"When I was at Howard University and we were in college, we were 18 through 24, and you know what we were called? College kids. But when you turn 18 and you’re in the system, you are considered an adult, period. Without any regard to the fact that, that is the very phase of life in which we have invested billions of dollars in colleges and universities knowing that is the prime phase of life during which we mold and shape and direct someone to become a productive adult.", "\"What’s the other thing we know about this population? And it’s a specific phase of life, remember, age is more than a chronological fact. What else do we know about this population, 18 through 24? They are stupid (audience laughs). That is why we put them in dormitories, and they have a resident assistant. They make really bad decisions. So we focused on that age population.\"", "Harris was describing a recidivism reduction program for first-time, low-level offenders in Los Angeles. The initiative, modeled after the \"Back on Track\" program that Harris launched in 2005 in San Francisco, would provide services to young Americans who were convicted of nonviolent felonies. If they met certain education and career goals, they would have their cases dismissed.", "A post on Facebook says Harris called young Americans \"stupid.\"", "It’s a partial quote of something Harris said. Harris was speaking about initiatives to reduce recidivism rates for young, low-level offenders and wryly made a comment about how young adults often make bad decisions in order to illustrate the broader point that more empathy is needed for them within the criminal justice system.", "Harris made the comment, but the post leaves out important details or takes things out of context. We rate it Half True.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Sept. 10, 2020", "Ford Foundation, California State Attorney General Kamala D. Harris on the importance of prison education, May 8, 2014", "Bureau of Justice Assistance, Back on Track: A Problem-Solving Reentry Court, September 2009", "Email and phone interview, spokesperson for Sen. Kamala Harris, Sept. 17, 2020", "Snopes, Did Kamala Harris Say Young Voters Are ‘Stupid’?, Aug. 14, 2020", "Reuters, Fact check: Kamala Harris quote on young people being \"stupid\" is missing context, Aug. 20, 2020", "USA Today, Fact check: Video online of Kamala Harris calling young people 'stupid' is missing context, Aug. 17, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]