["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump speaks during an NBC News Town Hall, at Perez Art Museum Miami, Thursday, Oct. 15, 2020, in Miami. (AP)", "An Instagram post spreading on social media claims that President Donald Trump is dead, but that’s wrong.", "\"Due to COVID-19, President Donald Trump passes away at 74,\" reads what looks like a screenshot of a CNN tweet. It was posted on Instagram on Oct. 12.", "Since then, of course, Trump has tweeted and appeared in public. On Oct. 15, he participated in a televised town hall.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "While Donald Trump sought treatment for his COVID-19 diagnosis at Walter Reed National Military Medical Center, he left the hospital on Oct. 5 and has been campaigning since. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, told the health news website STAT that the president \"did not suffer any significant consequences\" from COVID-19, according to an Oct. 13 story.", "We didn’t find any evidence that CNN ever tweeted that Trump died.", "Searching for the tweet on Twitter, we found an identical Oct. 9 tweet that similarly uses the Fox News logo, but the account is not actually Fox News; it’s @foxnewes.", "We rate this post Pants on Fire!", "Instagram post, Oct. 12, 2020", "Tweet, Oct. 9, 2020", "The New York Times, Highlights and key moments from Trump and Biden town halls, Oct. 15, 2020", "The New York Times, Trump leaves hospital, minimizing virus and urging Americans ‘Don’t let it dominate your lives,’ Oct. 5, 2020", "STAT, Fauci: Trump’s praid recovery from COVID-19, while welcome, ‘amplifies’ public misunderstanding of disease, Oct. 13, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]