["About this rating", "On June 26, 2019, a video supposedly showing small, white worms inside of a batch of cherries went viral on social media:", "This video, which was viewed millions of times within a week of its initial posting, drew plenty of reactions from viewers who were shocked and disgusted at the apparently sight of maggots in the fruit. While we won't argue about the gross-out factor of this clip, finding worms in cherries (or other pieces of fruit) isn't all that unusual.", "The video likely documents a subject familiar to cherry farmers, the larvae of the cherry fruit fly (Rhagoletis cerasi). Washington State University's Tree Fruit Website labels the western cherry fruit fly as a \"key pest in all cherry growing regions of the western United States.\" A photograph from the website showing the fruit flies' larvae in the flesh of a cherry resembles the images seen in the viral video:", "When someone asked the Department of Horticulture at Iowa State University for the best way to get rid of the \"white worms in my cherries,\" the university responded as follows:", "The small, white “worms” are probably the larvae of the cherry fruit fly (Rhagoletis spp.). Cherry fruit flies lay eggs on developing cherry fruit in May. Damaged fruit appear shrunken and shriveled when ripe, and usually contain one off-white larva (maggot) that is slightly longer than one-quarter of an inch.", "Cherry fruit fly damage varies greatly from year to year. It may be more practical to tolerate some damage and loss of usable fruit than to attempt effective preventive control. To prevent maggots from appearing inside the fruit, the tree must be thoroughly sprayed with a labeled insecticide when the adults emerge and before the females lay their eggs inside the young fruit. Because the flies emerge over an extended period of time, several sprays will be needed. You can monitor fruit flies with yellow sticky traps hung in the tree in early May. Check traps daily after the first fruit fly is caught and repeat the spray application until flies no longer appear. Effective home orchard type sprays can be purchased at your local garden center. Carefully read and follow label directions.", "The cherry fruit fly isn't the only insect to deposit its larvae in cherries, and this viral video might also show the larvae of the spotted wing drosophila (Drosophila suzukii):", "The spotted wing drosophila (Drosophila suzukii) is a relatively new pest of cherries and other soft fleshy fruits (strawberries, raspberries, blackberries, blueberries, etc). Unlike other vinegar flies that attack rotting or fermenting fruit, the spotted wing attacks maturing fruit. The name spotted wing drosophila comes from the single black spot at the tip of each wing of the male adult. Don't think though that you will be able to identify this fly by those markings without magnification because these adults are small, really small. The female is able to penetrate the skin of the fruit to lay her eggs and this act creates a small depression (“sting”) on the fruit surface. The eggs hatch and the maggots develop and feed inside the fruit, causing the flesh of the fruit to turn brown and soft.", "A video published in the peer-reviewed BMC Journal shows the larvae of the fruit fly D. suzukii in a ripe cherry:", "Larvae of the fruit fly Drosophila suzukii in a ripe cherry -- this species has become a substantial pest species in Europe and the USA. For more on how this species has evolved to be able to feed on ripe fruit, while its sister species can only feed on rotting fruit.", "While we certainly wouldn't recommend eating these white worms with your cherries, Garden Guru Pat Welsh noted that accidentally consuming one shouldn't consitute a health emergency: \"The larvae of Western cherry fruit fly don’t harm human beings who have accidentally ingested them since they are not adapted to living in human intestines, and they are mainly, after all, made up of cherry meat, but it is certainly a disgusting thought to know you have been eating worms.\"", "Both home and commercial farmers take precautions to prevent cherry fruit flies from contaminating their crops. As we have yet to see any information about a recall or public statements regarding a cherry fly infestation, the viral video of maggots in cherries likely captured a relatively isolated incident.", "Welsh, Pat.   \"Worms in Cherries.\"\r\n    PatWelsh.com.   2010.", "UC Master Gardener Program of Contra Costa.   \"Maggots in My Cherries Again This Year?\"\r\n    28 March 2016.", "ISU Extension and Outreach.   \"I Occasionally Find Small, White Worms in My Cherries. What Is the Best Way to Control Them?\"\r\n    Retrieved 3 July 2019.", "Messina, Frank and Timothy Smith.   \"Western Cherry Fruit Fly.\"\r\n    WSU Tree Fruit,   1993.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]