["About this rating", "On the afternoon of April 26, 2020, as controversy over U.S. President Donald Trump's recent remarks about injecting disinfectant to treat COVID-19 coronavirus disease continued to swirl, some social media accounts began reproducing what were said to be deleted tweets from Trump:", "In those putative tweets, the president continued his long-running feud with the press (particularly over its coverage of the investigation into possible Russian interference with the 2016 U.S. presidential election) in asserting that \"lamestream media\" reporters had received \"Noble Prizes\" which were awarded them \"under fraud,\" that the \"Noble Committee\" should demand the return of those prizes, and that \"lawsuits should be brought against ... Fake News Organizations\":", "When will all of the “reporters” who have received Noble Prizes for their work on Russia, Russia, Russia, only to have been proven totally wrong (and, in fact, it was the other side who committed the crimes), be turning back their cherished “Nobles” so that they can be given to the REAL REPORTERS & JOURNALISTS who got it right. I can give the Committee a very comprehensive list. When will the Noble Committee DEMAND the Prizes back, especially since they were gotten under fraud? The reporters and Lamestream Media knew the truth all along. Lawsuits should be brought against all, including the Fake News Organizations, to rectify this terrible injustice. For all of the great lawyers out there, do we have any takers? When will the Noble Committee Act? Better be fast!", "As captured in multiple screenshots like the one seen above, and documented in Pro Publica's Politiwoops database of deleted tweets, Trump did indeed post these tweets on the afternoon of April 26 and then deleted them about three hours later.", "Although numerous organizations — most notably the Pulitzer Prize Board — bestow awards for excellence in journalism, the Nobel (not \"Noble\") Foundation does not. Nobel Prizes are awarded in the areas of physics, chemistry, physiology or medicine, literature, peace, and economic sciences.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]