["The photo, which shows a long swimming pool stretching towards the ocean, was shared in this Facebook post on March 7, 2019. It has been shared more than 25,000 times.", "Below is a screenshot of the misleading post:", "The post’s caption states: “Maldives Tubalan, Malita,Davao Occidental.”", "The caption refers to Maldives Tubalan, a beach area located in Davao Occidental’s Malita municipality.", "The same photo was also shared here and here on Facebook; and here on Twitter alongside a similar claim.", "The claim is false; the photo has been shared in a misleading context.", "Reverse Google image searches found the resort is actually located in the Maldives in the Indian Ocean. It was published on January 3, 2019 in this Instagram post, which is geotagged in Maldives.", "Below is a screenshot of the Instagram post:", "The Instagram photo’s caption states in part: “Sitting on the edge of the longest infinity pool in the Maldives / this is also one of the island’s best spots to watch Sunset!”", "Below is a screenshot comparison of the photo in the misleading posts (L) and the Instagram photo (R):", "The photo was also reposted on Instagram here on January 22, 2020 by Fairmont Maldives, the hotel where the pool is located. The hotel is roughly 230 km north of Malé, the capital city of the Maldives archipelago.", "Similar photos of the pool that accurately describe its location have been shared in several travel reports; for example here, here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]