["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump has vowed to end what he calls a \"war on coal.\" Recently, Trump tweeted some good news for the industry.", "\"Coal production up 7.8% in past year,\" Trump wrote in his Oct. 31 tweet. \"Down 31.5% last 10 years. #endingwaroncoal.\"", "Attached to the tweet was a Fox News report that had precisely that figure. The stats played across the screen, and the reporter wrapped up with \"the war on coal is over, and good news for coal.\"", "Fox News told us they drew on the U.S. Energy Information Administration’s Short-term Energy Outlook report for October. There are actually a couple of numbers there. The one Fox News used was a forecast for 2017. It predicted that coal production would go from 728 million short tons in 2016 up to 785 million in 2017. That amounts to a 7.8 percent rise.", "Fox News could have gone with a higher number based on actual rather than predicted output. The government report said that in the first nine months of the year, production was 12 percent higher than at the same point the year before.", "So if anything, Fox News understated the increase.", "As for the drop over the past 10 years, that might be an understatement, too. The government numbers show a decline closer to 33 percent.", "There are a few other things to know.", "Perhaps most important, the government doesn’t expect the increase to continue. The same energy outlook said \"coal production is expected to increase by 8 percent in 2017 and by less than 1 percent in 2018.\"", "That’s in line with a couple of independent assessments.", "A 2017 report from the Bureau of Business and Economic Research at West Virginia University, focused only on West Virginia coal, anticipated growth in 2017 followed by modest increases until 2020. But \"after 2020, statewide coal production is expected to fall,\" the report said.", "The forecast is the same at the national level. A Columbia University analysis also anticipated a rise, but its best-case scenario showed a \"modest recovery\" that in the middle of the next decade would level off at 2013 levels.", "The rise also needs to be seen in historic context.", "One reason 2017 looked good is that 2016 was particularly bad, as this chart from West Virginia University makes clear:", "Coal had been been falling for years, as a result of several factors.", "The market for coal mainly depends on the price of natural gas, foreign demand and, to a lesser extent, the impact of government policy on domestic demand.", "At the top of the list, coal competes with natural gas as a fuel to produce electricity. Natural gas prices tumbled with a flood of natural gas largely due to technology called hydraulic fracturing, or fracking. Utility companies went for the cheaper option.", "Brian Lego, co-author of the West Virginia University study, said that coal producers in the southern part of West Virginia faced another challenge, a collapse in demand in China for the sort of coal used in making steel.", "\"There was over capacity in global steel production,\" Lego said. \"When the Chinese pulled back on producing that steel, there was less need for metallurgical coal.\"", "On top of that, as economic growth cooled off a bit in China, so did the country’s need for power. It cancelled 85 coal-fired plants that had been in the works. India had a similar story, which further reduced the demand for coal.", "The turnaround in 2017 came from a slight rise in the price of natural gas, which made coal more competitive on the domestic front. An uptick in demand for coal from China’s steelmakers raised prices for metallurgical coal, which allowed smaller mines that had been idled to come back online, Lego said.", "Clean air regulations put coal at a disadvantage compared to natural gas, he said, as electric utilities increasingly opted for natural gas as a cleaner fuel.", "\"Those rules were fully implemented in 2015,\" Lego said. \"That’s when you saw the old coal-fired plants retired.\"", "Lego said he’s seen no impact so far from the Trump administration’s efforts to reduce regulatory pressures on coal. The one change championed by the White House that holds the most promise, he said, would require utilities to keep larger stocks of fuel on hand.", "Administration policies could have a larger impact down the line. The Columbia University research group estimated that if fully implemented, the White House policies could increase production by 37 percent over what might have been under Obama administration policies.", "Trump said that coal production rose 7.8 percent since 2016. The number tracks back to a government forecast, which is less certain than actual production figures. But based on data for the first nine months of 2017, the increase was even higher -- 12 percent compared to the same period a year earlier.", "Trump tied the increase to the theme of \"ending the war on coal.\" The research we found said shifts in the price of natural gas and foreign demand are the primary drivers, not government regulation.", "We rate this claim Mostly True.", "Donald Trump, tweet, Oct. 31, 2017", "U.S. Energy Information Administration, Short-term Energy Outlook, Oct. 11, 2017", "U.S. Energy Information Administration, Weekly Coal Production, accessed Nov. 2, 2017", "U.S. Energy Information Administration, Quarterly coal report, Oct. 2, 2017", "Bureau of Business and Economic Research, Coal production in West Virginia 2017-2040, Summer 2017", "Columbia University Center on Global Energy Policy, Can Coal Make a Comeback?, April 26, 2017", "U.S. Bureau of Labor Statistics, Coal mining, accessed Nov. 2, 2017", "Interview, Brian Lego, assistant professor, College of Business and Economics, West Virginia University, Nov. 3, 2017", "Interview, Caley Cronin, spokeswoman, Fox News, Nov. 3, 2017", "Email interview, Steven Cheung, White House press office, Nov. 2, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]