["The one minute 54 seconds video was published in this Facebook post on July 12, 2019. It has been viewed more than 5,500 times.", "The footage shows a group of men vandalising a bus, smashing its windows with large rocks.", "The Facebook post’s caption, which is written in an anglicised version of Hindi, translates to English as: “Right now at BKC and Modi needs development. Mr. Modi this has been bought from our tax money and these son of pigs without paying taxes are enjoying and destroying the properties.”", "BKC is a reference to the Bandra-Kurla Complex, a commercial hub in India’s financial capital of Mumbai.", "Modi refers to India’s Prime Minister Narendra Modi.", "Below is a screenshot of the misleading post:", "The same footage was also shared with a similar claim here and here on Facebook, and here on Twitter and here on YouTube.", "The claim is false; the video actually shows a July 2019 protest over mob lynching in Surat, a city located in the western state of Gujarat in India.", "In the video, the word ‘Sitilink’ -- highlighted in the screenshot below -- can be seen on the bus, referring to a public bus transport system in Surat.", "The registration plates of the bus can also be seen in the footage.", "The number “GJ 05” can be seen. “GJ05” is a code for Gujarat vehicles in Surat, according to this government licensing website and this industry list.", "Below is a screenshot of the bus registration plate seen in the footage:", "A keyword search on YouTube found several TV media reports about an incident of mob violence and vandalism that took place on July 5, 2019 in Surat.", "This video, published on TV9Gujarati news verified Youtube channel on July 5, 2019, shows a large mob attacking a blue bus before they were dispersed by police using tear gas.", "The video's title states: “Rally against mob lynching incidents turns violent in Surat, police force deployed | Tv9GujaratiNews”.", "Another video of the incident uploaded on The Quint news website on July 5, 2019 shows the same blue coloured bus that appears in the footage in the misleading Facebook posts.", "Below is a screenshot comparison of an identifying feature that can be seen in both the misleading video (L) and a photo of the July 5 incident on the oneindia.com news website (R):", "The July 5, 2019 Surat mob violence incident was also reported by Indian media news channels here and here and here and here in online news media.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]