["England has experienced a surge in knife crime, but are Muslim immigrants responsible for a majority of attacks?", "\"What politicians and the (mainstream media) refuse to tell you,\" reads a Feb. 4 Facebook post featuring a photo of a bloody hand clutching a knife. \"In the past 12 months, 13,000 knife attacks were committed in London. 11,000 of those we’re (sic) done by Muslim immigrants.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Let’s take it piece by piece. First, consider the time period. The past 12 months is approximately February 2018 to January 2019 but the most recent data available from the Metropolitan Police Service, London’s police force, is December 2018.", "During the calendar year of 2018, there were 14,700 recorded knife crimes, according to the service. That’s more than the Facebook post claims.", "Knife crime was on the rise in London prior to 2018. In a foreword to \"The London Knife Crime Strategy,\" published in 2017, Mayor Sadiq Khan said, \"Our communities are sick and tired of the damage being done by knife crime,\" singling out the city’s \"most troubled young people\" as both potential victims and offenders. Seventy-five percent of victims of knife crime are males younger than 25, according to police data from 2016 and 2017. Among male offenders, more than half were described as black males younger than 25. \"There is a huge overlap between victims and offenders,\" according to the knife crime plan.", "Next, let’s look at who the offenders might be. The 80-page document makes no mention of Muslims or immigrants. Rather, in a section titled, \"Who are the offenders and who are the victims,\" the plan cites a police analysis that found almost 90 percent of offenders were male in 2016 and 2017, and of those, 62 percent were people described as having black, Asian and other minority ethnic backgrounds", "A public information request PolitiFact sent to the Metropolitan Police Service on Feb. 5 seeking information about the 2018 offenders’ religion, ethnicity and immigration status was not immediately answered.", "The service doesn’t release information about the religion or immigration status of criminal suspects, said Callum Jones, a spokesman for the service.", "\"There is no way that police or any other agency would have released statistics based on the religion and/or immigration status of offenders, so the information is clearly false,\" he said of the Facebook post.", "\"We don’t normally give out ethnic breakdown of perpetrators/victims,\" Jones also said. But he added that \"knife crime disproportionately affects boys and young men of African-Caribbean heritage.\" In the 12 months through November 2018, 94 percent of offenders were male.", "It’s relatively unusual for a violent incident to involve a knife in England, according to a BBC story from Nov. 5, 2018. \"Most violence is caused by people hitting, kicking, shoving or slapping someone, sometimes during a fight and often when they’re drunk.\"", "Knife crime is more prevalent in large cities, like London, the BBC reported, saying that the reasons cited range from police budget cuts to gang violence.", "Finally, lacking hard numbers proving the claim true, we turned to some experts.", "Stephen Case, a criminology professor at Loughborough University in England called the Facebook post \"absolute nonsense.\" He said he hasn’t seen any police statistics that substantiate it. \"I would doubt that the police collect stats on immigration status or religion at point of arrest,\" he said.", "\"This one’s pretty outlandish!\" said Iain Brennan, a psychologist who studies criminology at the University of Hull in England. The claims about the religion and immigrant status of offenders are unlikely to be verifiable, he said, because they’re not official categories that the country’s Ministry of Justice would include in their statistical releases.", "\"At the very minimum,\" he continued, \"it’s false because the date of posting means it would be impossible for the fact to be verified as any claim would have to be based on convictions, which take a long time to occur.\"", "Where does that leave us?", "We could find no data showing that Muslim immigrants are responsible for most knife attacks in London. A spokesman for the city’s police service denied that the claim was true, and academics we reached out to concurred. The burden of proof is on the Facebook post, and discovering no evidence to corroborate its claim, we rate this statement False.", "Facebook post, Feb. 4, 2019", "Email interview with City of London police, Feb. 5, 2019", "Email interview with Callum Jones, media and communications officer, Metropolitan Police Service, Feb. 5, 2019", "The New York Times, \"London confronts a spate of murders, with most victims killed by knives,\" April 7, 2018", "Mayor of London, The London Knife Crime Strategy, June 2017", "The New York Times, \"Rising knife violence alarms Britani as youths take up blades,\" May 3, 2017", "Metropolitan Police Service, Hate crime or special crime dashboard, visited Feb. 5, 2019", "The Guardian, \"Surge in knife and gun crime in England and Wales,\" April 26, 2018", "The Sun, \"Endless knife crime: London stabbings 2018 - latest knife crime statistics and attacks in Clapham, Crouch Hill, Hammersmith and Greenwich,\" Jan. 6, 2019", "BBC, \"Nine charts on the rise of knife crime in England and Wales,\" Nov. 5, 2018", "Office for National Statistics, Crime in England and Wales: year ending September 2018", "BBC, \"Is another year of rising knife crime ahead?\" Dec. 28, 2019", "Email interview with Stephen Case, criminology professor, Loughborough University, Feb. 8, 2019", "Email interview with Iain Brennan, reader in criminology, University of Hull, Feb. 8, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]