["About this rating", "Tesla and SpaceX CEO Elon Musk and experimental musician Grimes' baby boy was born on May 4, 2020, (aptly on what the internet calls \"Star Wars Day\").", "Musk revealed the birth in a response on Twitter.", "Since Musk and Grimes announced they were expecting a baby in January, speculation was rife about what the couple would name their child. And they did not disappoint.", "Image via Twitter", "Some speculated that the name was a reference to the CIA aircraft, the Lockheed A-12, also code-named Archangel. Æ appears to be a Nordic character, and some sources say it is also called \"ash.\"", "The name, however, does have an explanation according to Grimes:", "Image via Twitter", "Although Grimes mislabeled the SR-71 (Musk tweeted a correction), the name had many wondering if it was a joke, or if it was even legal. According to the BBC, Grimes may have given birth in California:", "The rules there stipulate that no pictographs, ideograms and diacritical marks for example è, ñ, ē, ç can be used when registering the birth. Names have to consist of the 26 letters of the alphabet.", "During an appearance on comedy show \"Saturday Night Live\" in May 2021, Musk joked about his son's name. \"'SNL' is also a great way to learn something new about the host. For example, this is my son's name,\" he said, gesturing to on-screen text of his son's name, which was amended to \"X AE A-XII,\" with Roman numerals instead of the number 12. \"It's pronounced: Cat running across the keyboard,\" he joked.", "The question of whether this is the newborn's legal name, is still the subject of speculation. As of this writing, the parents had not corrected the name they announced on Twitter, so we rate this True.", "BBC. \"X Æ A-12: Elon Musk and Grimes Confirm Baby Name.\"\r\n   5 May 2020.", "Dictionary.com. \"æ.\" \r\n    Accessed 6 May 2020.", "Harrison, Ellie.   \"X Æ A-12: How To Pronounce the Name of Elon Musk and Grimes' Baby.\"\r\n   The Independent.   5 May 2020.", "Penn State University.   \"Symbols Codes: Scandinavian/Nordic (Mainland)\"\r\n    Accessed 6 May 2020.", "Tenreyro, Tatiana.   \"Elon Musk Announced Grimes Gave Birth To Their Son And Said His Name Is X Æ A-12.\"\r\n   Buzzfeed.   4 May 2020.", "May 27, 2021: Updated to include SNL appearance, and son's amended spelling.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]