["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Capital Public Radio / file photo", "Rep. David Schweikert, R-Ariz., voted against a Democratic bill that told HHS to negotiate drug prices with drug makers, and pressured drug makers to limit price increases to the rate of inflation.", "Schweikert backed a Republican bill that capped out-of-pocket drug costs for Medicare recipients, and promoted the entry of cheaper generic drugs to the market.", "Independent analysts say the Republican bill would have a limited impact on drug prices.", "Handicappers rate the House race in Arizona’s 6th Congressional District as a toss-up, with the edge going to the Republican incumbent, David Schweikert.", "The high cost of prescription drugs resonates in retiree-heavy Arizona and a major union backing Democrat Hiral Tipirneni in the race has taken Schweikert to task for his voting record on the issue.", "\"David Schweikert took over $120,000 from the drug industry and voted against legislation to lower prescription drug prices,\" an Oct. 7 Facebook ad from the American Federation of State, County and Municipal Employees said.", "Schweikert did get that much money from the pharmaceutical sector in his time in office. And he did vote against a major Democratic bill that outside analysts said would push down drug prices.", "On the other hand, Schweikert backed a Republican bill that would have insulated millions of Medicare recipients from out-of-pocket costs, without doing as much to drive down drug prices.", "In this fact-check, we look at how both bills tackled rising prices, and whether protecting some patients from higher costs is the same as reining in underlying prices themselves.", "We made several efforts to connect with Schweikert’s staff and did not hear back.", "According to the Center of Responsive Politics, since 2011, Schweikert received $124,902 from the pharmaceutical/health supply sector. His support grew from a low of $10,100 in the 2014 election cycle, to $39,102 in the current one.", "The industry went from being Schweikert’s 26th largest donor in 2012, to being his eighth largest today.", "In December 2019, the House passed the Elijah E. Cummings Lower Drug Costs Now Act on a largely party line vote. (No Democrats voted against the bill and only two Republicans voted for it.) Under the bill’s most sweeping element, the government would negotiate with drug companies on the prices of as many as 250 drugs. Those prices wouldn’t simply apply to government insurance programs like Medicare. Private insurers could use them, too.", "The Congressional Budget Office estimated that in the course of 10 years, this would reduce government spending by $456 billion. The CBO left no uncertainty over the bill’s impact.", "\"The lower prices under the bill would immediately lower current and expected future revenues for drug manufacturers, change manufacturers’ incentives, and have broad effects on the drug market,\" the CBO told Congress.", "The CBO also estimated that the revenue reductions would have an impact on the drug industry. Overall, it would stand in the way of between eight and 15 new drugs coming to market over the decade.", "The drug industry’s leading trade group, Pharmaceutical Research and Manufacturers of America, vigorously opposed the Democratic bill, warning of \"devastating\" effects on drug innovation and jobs in the pharmaceutical sector.", "The bill also pressured drug makers to reduce prices on many drugs covered by Medicare. If the price of a drug had gone up faster than inflation, the company could either cut the price, or pay a rebate to Washington.", "The Republican bill — the Lower Costs, More Cures Act — did not include either of those two Democratic elements. But the two parties found something approaching common ground on the topic of capping out-of-pocket costs for Medicare recipients, although the levels of the caps differed. The Republicans capped out-of-pocket costs at $3,100, and the Democrats capped them lower, at $2,000.", "There were a number of other elements in both bills, but these three pieces capture the bulk of the moves that would directly affect what people pay for prescription drugs. Here’s a summary:", "Schweikert voted against the Democratic bill, and was one of 147 co-sponsors of the Republican bill.", "From the point of view of anyone on Medicare facing the high cost of prescription drugs, a cap on out-of-pocket costs would deliver welcome relief. Both the Republican and Democratic proposals would help millions of people.", "Both bills would insulate Medicare recipients from the highest costs, said University of North Carolina at Chapel Hill health care policy professor Jonathan Oberlander, but it’s reach is limited.", "\"A cap can of course provide meaningful help to those who spend large amounts on medications,\" Oberlander said. \"But it doesn’t help those subject to high prices whose total spending is still under the cap.\"", "Georgetown University professor Jack Hoadly said, \"Help with out-of-pocket costs does not address drug prices.\"", "\"It simply transfers more of the cost to either the government or the drug plan,\" Hoadly said. \"Eventually those costs will come back to beneficiaries in higher premiums.\"", "The Republican bill did include some elements that indirectly could keep prices lower. It aimed to stop drug makers from abusing patent protections and blocking the entry of cheaper generic drugs.", "\"Over time that could have an impact on prices,\" said Washington University in St. Louis law professor Rachel Sachs.", "In contrast, Sachs said, the Democratic bill targeted drug prices directly with impacts that went beyond Medicare beneficiaries.", "\"Either through negotiating with the drug makers or discouraging them from raising prices faster than inflation, that would touch a broad cross section of Americans,\" Sachs said.", "The Congressional Budget Office analysis gave an idea of how much money taxpayers would save on prescription drugs under the Democratic bill. The CBO did not do a similar analysis of the Republican measure.", "But analyst Juliette Cubanski at the Kaiser Family Foundation, a neutral source of health care policy data, said if the CBO had scored the Republican bill \"it would definitely have gotten a much smaller savings estimate.\"", "\"HR3 (the Democratic bill) included more provisions than HR19 (the Republican bill)  to cap drug price increases and attempt to lower prices overall,\" Cubanski said.", "A Facebook ad from the American Federation of State, County and Municipal Employees said Schweikert got over $120,000 from the drug industry and voted against a bill to lower prescription drug prices.", "Schweikert received $124,902 from the drug and health products industry since he entered Congress. He voted against a bill that would have had a significant impact on drug prices and was projected to cut industry revenues by hundreds of billions of dollars over 10 years.", "He backed a bill that would insulate millions of Medicare recipients from high out-of-pocket costs. According to multiple independent assessments, that alone would not drive down prices. Some measures in the bill could reduce some drug prices over time through competition from generic drugs.", "We rate this claim Mostly True.", "American Federation of State, County and Municipal Employees, Facebook ad, Oct. 7, 2020", "Opensecrets.org, Pharmaceutical/Health products campaign contributions, accessed Oct. 16, 2020", "U.S. Congress, H.R.19 - Lower Costs, More Cures Act, Dec. 9, 2019", "Congressional Budget Office, The Prescription Drug Pricing Reduction Act (PDPRA) of 2019, July 24, 2020", "Congressional Budget Office,  Effects of Drug Price Negotiation Stemming From Title 1 of H.R. 3, the Lower Drug Costs Now Act of 2019, on Spending and Revenues Related to Part D of Medicare, Oct. 11, 2019", "House Energy and Commerce Republicans, Walden, Brady, Foxx, Collins Introduce Legislation to Lower Drug Costs, Dec. 9, 2019", "Kaiser Family Foundation, Closing the Medicare Part D Coverage Gap: Trends, Recent Changes, and What’s Ahead, Aug. 21, 2018", "Kaiser Family Foundation, Chart Pack: Prescription drug proposals, December 2019", "The Senior Citizens League, 16 Percent of Medicare Part D Enrollees May Be at Risk of Hitting the Doughnut Hole in 2019,April 2, 2019", "Health Affairs, Prescription Drug Legislation In Congress: An Update, Dec. 12, 2019", "Commonwealth Fund, New Legislation to Control Drug Prices: How Do House and Senate Bills Compare? An Update, Jan. 9, 2020", "Pharmaceutical Research and Manufacturers of America, What you need to know about H.R. 3, Dec. 12, 2019", "The Hill, PhRMA CEO warns Pelosi bill to lower drug prices would be 'devastating' for industry, Oct. 10, 2019", "New York Times, House Votes to Give the Government the Power to Negotiate Drug Prices, Dec. 12, 2019", "Email exchange, Jonathan Oberlander, professor of health policy and management, University of North Carolina at Chapel Hill, Oct. 16, 2020", "Email exchange, Juliette Cubanski, deputy director of the Program on Medicare Policy, Kaiser Family Foundation, Oct. 15, 2020", "Email exchange, David Mitchell, founder, Patients for Affordable Drugs, Oct. 16, 2020", "Email exchange, Jack Hoadly, Oct. 16, 2020", "Interview, Rachel Sachs, associate professor of law, Washington University in St. Louis School of Law, Oct. 18, 2020", "Email exchange, Natalia Perez Santos, spokeswoman, American Federation of State, County and Municipal Employees, Oct. 15, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]