["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In the vice presidential debate, Republican Mike Pence tried to skewer Hillary Clinton by talking about the multi-billion dollar Clinton Foundation. Pence recycled a flawed GOP talking point that the foundation is a cash cow to enrich the Clintons and their friends.", "\"10 cents on the dollar from the Clinton Foundation goes to charitable causes,\" Pence said.", "This is based on a misunderstanding of how the foundation operates. In brief, it raises money to deliver services and projects itself. The amount of money it gives away as grants is a small sliver of its activities.", "We’ll use the Clinton Foundation’s most recent IRS tax form, for 2014, as an example. (It starts on Page 28 of this document.) The foundation reported total expenses in 2014 of a little over $91 million but grants of just $5.1 million. That’s close to 6 percent of the foundation’s money being spent on grants.", "But that doesn’t mean everything else is overhead, people who monitor charities and their practices say, or that only 10 cents of every dollar went to a charitable cause.", "\"Although it has ‘foundation’ in its name, the Clinton Foundation is actually a public charity,\" Brian Mittendorf, a professor of accounting at Ohio State University’s Fisher College of Business, wrote in the Chronicle of Philanthropy. \"In practical terms, this means both that it relies heavily on donations from the public and that it achieves its mission primarily by using those donations to conduct direct charitable activities, as opposed to providing grants from an endowment.\"", "What are some of the foundation’s programs?", "The Clinton Development Initiative helps farmers in Malawi, Rwanda and Tanzania raise more crops and get higher prices at the market.", "The Clinton Giustra Enterprise Partnership launched the Acceso Centro de Formacion to provide job training for people in Cartagena, Colombia.", "The Clinton Health Access Initiative, for instance, has gotten credit for providing access to lower-cost drugs for millions of people with HIV/AIDS.", "Financial statement rules require a nonprofit to split its expenses between program services, fundraising and management/general costs (the latter two are collectively what are referred to as \"overhead\"), Mittendorf told us.", "He said that in 2014, 87.2 percent of the Clinton Foundation’s expenses were on program services.", "\"Of course, this only speaks to how the organization used its funds and not whether that 87.2 percent was allocated to the most effective program efforts, but it is all we have in terms of verifiable data on this question,\" Mittendorf said.", "The American Institute of Philanthropy’s Charity Watch, reached the same conclusion. It has given the Clinton Foundation an A rating and says it spends only 12 percent of the money it raises on \"overhead.\"", "\"The Clinton Foundation is an excellent charity,\" Charity Watch president Daniel Borochoff said Aug. 24, 2016, on CNN. \"They are able to get 88 percent of their spending to bona fide program services and their fundraising efficiency is really low. It only costs them $2 to raise $100.\"", "Other Republican critics of the foundation have used slightly higher figures than Pence. Republican National Committee chair Reince Priebus said the foundation only spent 20 percent on good works. Conservative radio talker Rush Limbaugh said it was 15 percent. Those are inaccurate, too.", "Our ruling", "Pence said 10 cents on every dollar from the Clinton Foundation goes to charitable causes. While it’s true that the foundation gives away in grants a small fraction of its resources, about 87 percent of its expenses go toward services it provides directly.", "A leading expert in the finances of philanthropies, Mittendorf, says that while the Clinton Foundation calls itself a foundation, it operates like a public charity. Mittendorf cautioned that while the dollar amounts are clear and verified, that is no guarantee that the programs are effective and efficient. However, that is not the criticism Pence raised.", "We rate this claim False.", "https://www.sharethefacts.co/share/bf107795-1430-4e2d-be85-14f85d34477a", "Factcheck.org, Where Does Clinton Foundation Money Go?, June 19, 2015", "Clinton Foundation, 2014 audited financial report, accessed Aug. 24, 2016", "Chronicle of Philanthropy, How to Understand the Clinton Foundation, June 8, 2015", "Charity Watch, Clinton Foundation report, accessed Aug. 24, 2016", "CNN, interview with Daniel Borochoff, Aug. 24, 2016", "PolitiFact, Reince Priebus' False claim that 80% of Clinton Foundation costs are overhead, Aug. 25, 2016", "PolitiFact, Rush Limbaugh says Clinton Foundation spends just 15 percent on charity, 85 percent on overhead, April 29, 2015", "Email interview, Brian Mittendorf, Aug. 24, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]