["By Angelo Fichera", "Posted on May 17, 2019", "An image of elected officials playing a computer card game has gone viral on social media. But the photo is from 2009, and it shows state lawmakers in Connecticut, not members of Congress.", "Deception and poker go hand in hand, but one of the latest viral images to mislead users on social media invokes the more benign card game of solitaire.", "More than 40,000 users on Facebook shared the meme, which includes a photo of lawmakers sitting behind laptops as a colleague speaks in the background. The computer card game can be seen clearly on two of the screens, while a third screen appears to show an image of a baseball player on ESPN’s website.", "But the image is not current, nor is it of members of Congress — as the meme implicitly suggests, and as Facebook users commenting and sharing appeared to believe (“The easy slippery slide to becoming a multi millionaire! Get elected to a congressman!!!” one wrote). It’s actually a 10-year-old photo of state representatives in the Connecticut State Capitol.", "“House Minority Leader pictured standing, far right, speaks while colleagues play solitaire Monday night as the House convened to vote on a new budget,” the post reads. “These are the folks that couldn’t get the budget out by Oct. 1, and are about to control your health care, cap and trade, and the list goes on and on.”", "It also says “we all pay for” those lawmakers’ salary of “about $179,000 per year,” which is similar to how much members of Congress earn. The current annual salary for most members of Congress is $174,000. On the other hand, state lawmakers in Connecticut, like those in the photo, receive a base salary of $28,000, according to the National Conference of State Legislatures.", "The photo was taken Aug. 31, 2009, by Connecticut-based photographer Jessica Hill, and still appears on her website. Her caption reads: “House Minority Leader Lawrence F. Cafero Jr., R-Norwalk, far right, speaks while colleagues play solitaire on their computers as the House convenes to vote on a new budget for the fiscal year in the Capitol, in Hartford, Conn.”", "One of the two lawmakers seen playing the game, Democratic state Rep. Jack Hennessy, publicly apologized after the photo circulated — calling it “bad judgment … to play a computer game even for just a few minutes during the final House session on the budget.” He now serves as deputy speaker of the state House.", "Misrepresentations of the photo started not long after it was first published: The website Snopes wrote about it in November 2009, noting that “it has erroneously been attributed to a number of different legislative bodies, from the U.S. Congress to a variety of state legislatures.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“2018 Legislator Compensation Information.” National Conference of State Legislatures. 16 Apr 2018.", "“About.” JessicaHill.net. Accessed 16 May 2019.", "Brudnick, Ida A. “Congressional Salaries and Allowances: In Brief.” Congressional Research Service. 11 Apr 2018.", "Keating, Christopher. “Rep. Jack Hennessy Apologizes For Playing Solitaire at State Capitol During Late-Night Budget Debate.” Hartford Courant. 8 Sep 2009.", "“Legislators Playing Solitaire.” JessicaHill.net. Accessed 16 May 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]