["GOP presidential nominee Dwight Eisenhower, Wisconsin Gov. Walter Kohler and U.S. Sen. Joseph McCarthy met in Milwaukee in October 1952. Eisenhower was nominated though he was not the delegate leader entering the GOP convention. (Milwaukee Journal photo)", "Seeking an endorsement to boost his presidential campaign, Republican Ohio Gov. John Kasich met with the editorial board of the Milwaukee Journal Sentinel a week before Wisconsin’s primary.", "(He won the endorsement, but won no delegates in the April 5, 2016 primary.)", "A few minutes into the March 29, 2016 interview, Kasich was asked how he can win the GOP nomination given that he so badly trails Donald Trump and Ted Cruz in delegates.", "Kasich replied by predicting that none of the remaining Republican hopefuls will have amassed the necessary 1,237 delegates in order to claim the nomination ahead of the party’s July 2016 convention in Cleveland.", "Then he made a claim that, if true, could make his plan -- to get delegates at the convention to throw their support to him -- appear more plausible.", "Republicans have had 10 conventions in which no candidate had won a majority of delegates, Kasich said, and \"only three out of 10 times was the front runner selected. Did you know? You didn’t know that. I know you don’t know that.\"", "\"So, seven times, somebody who was not the leader of delegates was selected as the nominee of the party.\"", "So, the claim we’re checking is that 10 times, no Republican candidate for president had enough delegates to claim the nomination before the party’s convention, and seven of those times someone who was not the leader in delegates was chosen at the convention as the nominee.", "Kasich is essentially correct on the numbers.", "But his statement is somewhat misleading in that the scenario he describes hasn’t occurred in  more than 60 years, and the nominating process has changed considerably since then.", "Kasich’s evidence", "To back Kasich’s claim, his campaign cited a March 2016 article in The Federalist about \"brokered\" Republican conventions. Sometimes the term \"contested\" or \"open\" is also used.", "Despite Trump’s considerable lead, it’s an open question whether he will reach the threshold of 1,237 delegates prior to the gathering in Cleveland.", "As Kasich indicated, the article said seven out of the 10 Republican conventions in which no candidate had a majority of delegates, the person who won the nomination was not the delegate leader.", "The most recent brokered Republican convention was in 1952. Ohio Sen. Robert Taft entered the convention as the delegate leader, with 35 percent of the delegates, followed by General Dwight D. Eisenhower,with 26.3 percent. The article says the delegates gave the nomination to Eisenhower, who in turn won the presidential election, because he was deemed more electable.", "A March 2016 article in The Week about brokered conventions also cited the seven of 10 figures.", "Political scientist Barry Burden, director of the Elections Research Center at the University of Wisconsin-Madison, told us that Kasich’s seven-of-10 claim is on target. But there is an important caveat, according to Burden, who said:", "\"Before the 1970s, candidates often did not run in many primaries and caucuses to win delegates. And contested conventions were quite common. In the ‘modern’ nominating era, contested conventions are uncommon, with 1976 (Gerald Ford defeated Ronald Reagan) being the only close case. Before reforms pushed states to use open processes for selecting delegates, entering the convention with more delegates than an opponent was less meaningful than it is in the contemporary era.\"", "Other experts agreed.", "David Karol, government and politics professor at the University of Maryland, emphasized that the phenomenon Kasich cites \"is in the distant past, when the process and our political culture were quite different.\"", "Karol, who co-authored one book and co-edited another about presidential nominations, added:", "\"Most delegates were chosen by state party organizations and there was far less public input than there is today. But our political culture was quite different then and it wasn't considered an outrageous coup when the convention (chose someone other than the delegate leader). There wasn't a strong expectation that the nominee would run in and dominate the primaries.\"", "(A final note: Some experts say the count could be six of nine times in which a contested GOP convention resulted in the nomination of a candidate who wasn’t the delegate leader. But Northeastern University political science professor Willam Mayer, who has written books on presidential nominations, told us that Kasich’s definition of a contested convention is defensible.)", "Our rating", "Kasich said that 10 times, no Republican candidate for president had enough delegates to claim the nomination before the party’s convention, and seven of those times \"somebody who was not the leader of delegates was selected as the nominee of the party.\"", "He’s correct on the numbers. But his implication that history is on his side is misleading in that it’s been more than 60 years since the GOP chose a nominee who wasn’t the delegate leader going into the convention; moreover, the process of choosing a nominee has changed considerably in the intervening years.", "For a statement that is accurate but needs clarification, our rating is Mostly True.", "Milwaukee Journal Sentinel, video (3:30) of John Kasich editorial board interview, March 29, 2016", "PolitiFact Wisconsin, \"John Kasich claims ‘no rules’ in place for picking GOP presidential nominee at convention (Mostly True),\" April 8, 2016", "The Federalist, \"Brokered GOP conventions often produce a winning president,\" March 10, 2016", "Interview, Southern Illinois University visiting public policy professor John Jackson, April 12, 2016", "Northeastern University political science professor William Meyer, April 13, 2016", "Interview, attorney and The Federalist article author Trey Mayfield, April 12, 2016", "Email, University of Wisconsin-Madison political science professor Barry Burden, April 12, 2016", "Email, University of Maryland government and politics professor David Karol, April 13, 2016", "Email, Northeastern University political science professor Willam Mayer, April 12, 2016", "The Week, \"A brief guide to brokered conventions,\" March 28, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]