["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump speaks on Sept. 20, 2016, in High Point, N.C. (Sara D. Davis/Getty Images)", "Republican presidential nominee Donald Trump said in a stump speech that immigration is a national security issue, and he criticized Hillary Clinton for refugee policies that he says will make the country less safe.", "\"Altogether, Hillary Clinton's plan would bring in 620,000 refugees in her first term, alone, with no effective way to screen or vet them,\" Trump said Sept. 20. \"Her plan would cost $400 billion in terms of lifetime welfare and entitlement costs.\"", "We decided to look into Clinton’s plan and its costs. We  found that Trump is doing some embellishing.", "Refugee math", "Clinton has not laid out a four-year plan for refugees as Trump described. She’s actually only talked about how many refugees should have been admitted for a single year.", "Clinton called President Barack Obama’s plan to admit 10,000 Syrian refugees in fiscal year 2016 a good start in a September 2015 interview on CBS Face the Nation, but she said the \"United States has to do more.\" She suggested admitting 65,000 refugees, amounting to a 550 percent increase.", "We asked Clinton’s campaign how many refugees her administration would admit in the future and how much it would cost, but a spokesman said they had no new details.", "Trump’s campaign referenced a June 2016 analysis of the Senate Subcommittee on Immigration and the National Interest, chaired by Sen. Jeff Sessions, R-Ala., a Trump supporter.", "It makes the assumption that Clinton would bring in 155,000 refugees each fiscal year, totaling 620,000 in four years.", "Here’s the subcommittee’s math:", "It finds that Clinton would increase Syrian refugee admissions by 55,000. (Her suggestion of 65,000 minus Obama’s 10,000 for 2016).", "To determine how many total refugees Clinton would admit per year, it adds 55,000 to 100,000 -- the Obama administration’s previously stated refugee admission goal for fiscal year 2017. (He recently raised it to 110,000.)", "To conclude how many total refugees Clinton would admit in her first term, it multiplies 155,000 times 4 (total years in a presidential term) to total 620,000 refugees.", "The vetting process", "The United States has a refugee vetting process, and Clinton has not said she would move away from it. In fact, she’s stressed the vetting process in public remarks, including at a November 2015 speech about national security at the Council on Foreign Relations.", "\"Our highest priority, of course, must always be protecting the American people,\" Clinton said. \"So yes, we do need to be vigilant in screening and vetting any refugees from Syria, guided by the best judgment of our security professionals in close coordination with our allies and partners.\"", "Congress needs to make sure resources are available for background checks and a close look should be placed on visa programs, she said.", "There’s no precise dollar amount specified on Clinton’s immigration reform page on her website. It says Clinton would create a national Office of Immigrant Affairs and \"support affordable integration services through $15 million in new grant funding.\"", "'$400 billion in terms of lifetime welfare and entitlement costs'", "This summer, Trump said \"for the amount of money Hillary Clinton would like to spend on refugees, we could rebuild every inner city in America.\" We rated that claim Pants on Fire.", "In that fact-check, we noted that the Obama administration requested under $2.2 billion for refugee and entrant assistance for fiscal year 2017, when the goal was 100,000 refugees.", "If Clinton tripled the requested amount for refugee funding in fiscal year 2017 and multiplied it over a 4-year term, it would not reach anywhere near Trump’s $400 billion claim.", "However, in its June analysis, the Subcommittee on Immigration and the National Interest said the annual budget for refugee resettlement does not encompass all costs, including those related to refugees who qualify for public assistance programs such as Medicaid, Temporary Assistance for Needy Families and Supplemental Security Income.", "That budget also leaves out social services costs at local and state governments and costs of future benefits once refugees become lawful permanent residents and U.S. citizens, the analysis said.", "\"The true lifetime cost of admitting a single refugee must include an accounting of all benefits received by that refugee -- at the federal, state, and local levels, and over the course of that‎ refugee's lifespan,\" the analysis said. \"Any other calculation is akin to saying that the total cost of owning a new car is encapsulated in the down payment.\"", "Refugees come to the United States legally and are required to apply for lawful permanent residence a year after their arrival. But they also contribute to the economy.", "Refugees are qualified to get Social Security cards and are authorized to work. And like U.S. citizens, they have to pay employment, property, sales and other taxes, such as Social Security and Medicare.", "\"The only way to arrive at the large negative effects that Trump claims is to adopt the belief that refugees neither work nor pay taxes after they arrive,\" said Michael Clemens, an expert on migration and a senior fellow at Center for Global Development. \"That is untrue, and a method of counting only fiscal outflows while ignoring fiscal inflows is not a method that would be countenanced by any respected economist.\"", "Based on estimates from the Organisation for Economic Co-operation and Development, as well as data from Health and Human Services, a reasonably conservative figure for the total short-term, gross fiscal burden of each refugee is around $22,000, Clemens said. But that’s not the long-term net fiscal impact, he said.", "\"The lifetime fiscal effect of a refugee admission --  including the tax revenue they are likely to generate over the course of their working lives, and both the up-front cost of assisting them and the other government services they are likely to use, is likely to be small and positive,\" Clemens said, citing studies that found refugees tend to perform better in the labor market than non-refugee immigrants over the long-term.", "At a minimum, the true costs of refugees is disputed and hard to put an exact figure on.", "Our ruling", "Trump said, \"Altogether, Hillary Clinton's plan would bring in 620,000 refugees in her first term, alone, with no effective way to screen or vet them. Her plan would cost $400 billion in terms of lifetime welfare and entitlement costs.\"", "Clinton has not said she would bring anywhere near that number; that’s an extrapolation put together by the Trump campaign. Additionally, there are established protocols for screening and vetting refugees. Finally, the $400 billion figure only looks at potential benefits refugees might draw on without considering their economic output or taxes they might pay.", "Overall, we rate Trump’s statement False.", "C-SPAN, Donald Trump Rally in High Point, North Carolina, Sept. 20, 2016", "Email exchange, Donald Trump campaign, Sept. 22, 2016", "Email exchange, Hillary Clinton campaign, Sept. 21, 2016", "State Department, U.S. Refugee Admissions Program", "CBS News, Hillary Clinton: U.S. should take 65,000 Syrian refugees, Sept. 20, 2015", "PolitiFact, Donald Trump says Hillary Clinton wants to let 500 percent more Syrians into the U.S., June 13, 2016", "Council on Foreign Relations, Hillary Clinton on National Security and the Islamic State, Nov. 19, 2015", "PolitiFact, Ben Carson: 'There is currently no ability to vet' Syrian refugees, Nov. 19, 2015", "Hillary Clinton campaign website, Immigration reform", "Sen. Jeff Sessions website, Clinton refugee plan could bring in 620,000 refugees in first term at lifetime cost of over $400 billion, June 27, 2016", "Office of Refugee Resettlement, Refugees, accessed Sept. 23, 2016", "PolitiFact, Trump wrong that Clinton's refugee plan would cost more than rebuilding all inner cities, June 22, 2016", "U.S. Citizenship and Immigration Services, Green Card for a Refugee, accessed Sept. 23, 2016", "Justice Department, Refugees and Asylees Have the Right to Work", "Indiana State Department of Health, Myths about refugees", "Office of Refugee Resettlement, ORR Employment Outcomes: Refugee as Employee and Refugee as Self-Employed", "Email interview, Michael Clemens, an expert on migration and development and a senior fellow at Center for Global Development, Sept. 23, 2016", "Organisation for Economic Co-operation and Development, ODA reporting of in-donor country refugee costs", "Health and Human Services Department, FY 2017 budget request", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]