["About this rating", "A federal program subsidizes providers who supply telephone services to low-income consumers.", "The Obama administration did not create a program to provide free cell phones and service to welfare recipients.", "Imagine for a moment what your life would be like without a phone, corded or wireless. How would you contact emergency services if there was a fire or a serious injury? How would you contact a potential new employer, or keep in touch with a current one? How would you contact your utility company about a power outage, or a doctor about your sick child? How would you keep in touch with your loved ones and your community? In this day and age, telecommunications services are a real necessity, and not being able to afford them is a real liability.", "Those types of questions prompted the Federal Communication Commission to implement the Lifeline benefit program for income-eligible consumers in 1984. That program had two parts: Lifeline Assistance, which provided discounts on basic monthly landline telephone service at the primary residence of qualified telephone subscribers, and Lifeline Link-Up, which provided discounts on the initial installation fee for landline telephone service at the primary residence of qualified telephone subscribers.", "As cell phone usage has increased and cell phone service fees have dropped, the Lifeline program has been expanded to include wireless technology. Prepaid cell phone companies have spun off government-approved subsidiaries (such as Safelink Wireless, Assurance Wireless, and Reachout Wireless) to specialize in providing Lifelife-covered telephone services to qualifying participants:", "Examples:", "[Collected via e-mail, October 2009]", "Have you heard this one? THE OBAMAPHONE", "Actually in the state of Wisconsin it is 250 minutes of Free Air Time and they are running TV ads promoting it. No Bull", "Just when you think you've heard it all,, our illustrious Congress quietly comes up with a new zinger to put their hands in your pockets, and pick them while you aren’t watching.", "Isn't this just wonderful!", "I was standing in line at the checkout counter at Wal Mart and as I looked at the line behind me, I saw a couple of people talking about what looked like identical new cell phones, bragging about the fact that their phones were free and so was the airtime.", "The woman in line behind me had heard the same exchange and turned to the young man behind her and asked, \"Is that a new type of cell phone?\"", "The young man replied, \"Yes, this is my new 'Obama phone'\".", "She asked him what an \"Obama phone\" was, and he went on to say that, \"Welfare recipients are now eligible to receive\" what he described as (1) a FREE new cell phone, and (2) approximately 70 FREE minutes of air time every month.", "Needless to say, I was a little skeptical about his answer, so when I got back home, I 'Googled' it, and lo and behold, he was telling the truth.", "This was what I discovered:", "SafeLink Wireless is a government supported program that provides a free cell phone and airtime each month for income-eligible customers.", "In other words, your tax dollars are being distributed to a wireless phone provider to provide welfare recipients with free cell phones and airtime.", "I don't know about you, but as for me, enough is enough. We are $14 Trillion in debt, Congress is balking at continuing unemployment payments to those who want to work, and Congress is increasing the dole-out to dead beats.", "The ship of State is sinking, and it's sinking fast. The old concept of getting ahead through hard work has flown out the window. It has been replaced by Obama's and Congress' idea of \"Hope and Change.\" The country has changed all right, changed to \"Why should I work for it, when I can get it for free?\"", "[Collected via e-mail, October 2009]", "Here's another Obama program that we taxpayers are footing the bill for.", "I had a former employee call me earlier today inquiring about a job, and at the end of the conversation he gave me his phone number. I asked the former employee if this was a new cell phone number and he told me yes this was his \"Obama phone.\" I asked him what an \"Obama phone\" was and he went on to say that welfare recipients are now eligible to receive (1) a FREE new phone and (2) approx 70 minutes of FREE minutes every month. I was a little skeptical so I Googled it and low and behold he was telling the truth. TAX PAYER MONEY IS BEING REDISTRIBUTED TO WELFARE RECIPIENTS FOR FREE CELL PHONES. This program was started earlier this year. Enough is enough, the ship is sinking and it's sinking fast. The very foundations that this country was built on are being shaken. The age old concepts of God, family, and hard work have flown out the window and are being replaced with \"Hope and Change\" and \"Change we can believe in.\"", "From that basic framework, rumors like the ones encapsulated in the Examples cited above have circulated, claiming that \"the Obama administration created a program to give free cell phones paid for by taxpayer money to welfare recipients.\"", "All the elements of such statements are erroneous or exaggerated:", "All telecommunications service providers and certain other providers of telecommunications must contribute to the federal USF based on a percentage of their interstate and international end-user telecommunications revenues. These companies include wireline phone companies, wireless phone companies, paging service companies and certain Voice over Internet Protocol (VoIP) providers.", "Some consumers may notice a “Universal Service” line item on their telephone bills. This line item appears when a company chooses to recover its USF contributions directly from its customers by billing them this charge. The FCC does not require this charge to be passed on to customers. Each company makes a business decision about whether and how to assess charges to recover its Universal Service costs. These charges usually appear as a percentage of the consumer’s phone bill. Companies that choose to collect Universal Service fees from their customers cannot collect an amount that exceeds their contribution to the USF. They also cannot collect any fees from a Lifeline program participant.", "The costs of administering the Lifeline program have increased greatly with the move towards cellular telephone services, leading the FCC to approve a comprehensive overhaul of the program in January 2012 intended to eliminate waste, fraud, and abuse.", "A number of web sites touting Lifeline benefits and imitating the look of government web sites have sprung up on the Internet, but those sites are privately operated ones created to promote the sales of cellular services and have no official connection to the federal government or the current presidential administration:", "By 2010, Virgin Mobile, Verizon, Sprint, i-Wireless, Head Start, Consumer Cellular, Midwestern Telecom, Allied Wireless, and others had free phone plans. That's why you can find all these \"free cell phone\" websites that look kind of shady, like Obamaphone.net or FreeGovernmentCellPhones.net. In 2011, the FCC said that these carriers were \"fiercely competing for the business of low-income consumers by marketing ‘free’ phones.\" TracFone spokesman Jose Fuentes [said], \"We’ve had a lot of fly-by-night companies come in.\" Fuentes estimated that more than 1,700 wireless companies were part of Lifeline. Between 2008 and 2012, the number of people with Lifeline phones grew from 7.1 million to 12.5 million. These companies may be fly-by-night at providing cell phone service, but they are pretty good at marketing, and as the rush of merchandise tied to his inauguration showed, Obama's name seems to move product.", "Additional information:", "AFFORDABLE TELEPHONE SERVICE FOR INCOME-ELIGIBLE CONSUMERS", "Reeve, Elspeth.   \"The Obama Phone's Roots in Government Deregulation.\"\r\n    The Atlantic.   2 October 2012.", "Businessweek.   \"FCC Trims Subsidy That Powers TracFone Amid Fraud Concern.\"\r\n    2 February 2012.", "WSMV-TV [Nashville, TN].   \"Low-Income Residents to Get Free Cell Phones.\"\r\n    14 August 2008.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]