["About this rating", "In a statement sent to the media outlet The Hill, Sen. Mitch McConnell reportedly said that “loony lies and conspiracy theories” were a “cancer for the Republican party.” In his statement, McConnell then went on to cite some lies furthered by Rep. Marjorie Taylor Greene, a Republican from Georgia who has publicly stated fringe beliefs and racist views.", "However, the statement attributed to McConnell did not reference Greene by name.", "Snopes attempted to contact McConnell’s press team to confirm that the statement had been sent, and that he was talking about Greene, but did not receive a response at the time of publication.", "On Feb. 2, 2021, U.S. Senate Minority Leader Mitch McConnell reportedly said that Georgia Rep. Marjorie Taylor Greene accepted “loony lies and conspiracy theories” that were a “cancer for the Republican party.", "Greene, who is a Republican, is a known QAnon supporter and conspiracy theorist who has come under fire for expressing fringe beliefs and racist views since winning the U.S. House seat representing northwest Georgia in November 2020.", "In a statement reportedly sent to the news outlet The Hill, McConnell, a Republican from Kentucky, said the following:", "Somebody who’s suggested that perhaps no airplane hit the Pentagon on 9/11, that horrifying school shootings were pre-staged, and that the Clintons crashed JFK Jr.’s airplane is not living in reality. This has nothing to do with the challenges facing American families or the robust debates on substance that can strengthen our party.", "Snopes contacted McConnell’s press team to confirm whether or not the above statement was, in fact, sent to the news organization and if so, to verify whether McConnell was referencing opinions expressed by Greene. We did not receive a response at the time of publication.", "Though McConnell never explicitly mentioned the freshman Republican, the statements he alluded to have been linked back to Greene and some of her supporters. In January 2021, a video of Greene surfaced showing the lawmaker confronting David Hogg, a former Stoneman Douglas High School student and survivor of the mass shooting there, harassing him over his calls for gun legislation.", "Greene has also spread false claims suggesting that the shootings at a high school in Parkland, Florida, and the Sandy Hook Elementary School were hoaxes, that John F. Kennedy Jr.’s death in a 1999 plane crash was an assassination that paved the way for Hillary Clinton’s New York Senate Seat, and something other than a plane flew into the Pentagon on Sept. 11, 2001. These views and other unfounded claims were shared in a 2018 YouTube interview.", "Greene fired back on Twitter in a Feb. 1 post that called out “weak Republicans,” which some news outlets speculated to be a direct jab at McConnell.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]