["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Elizabeth Mayor Chris Bollwage knows what his critics will say during his re-election campaign: he's been in charge too long.\n\nBut Bollwage, a Democrat whose fifth term ends this year, has a few reasons voters should keep him in office.\n\n\"And we're moving in the right direction, the city of Elizabeth. We've done a lot of big things, with Ikea, Jersey Gardens, and we have opportunities here in our community. Our jobless rate, our unemployment rate, is the lowest of  all of the big cities in New Jersey,\" Bollwage said during a Jan. 15 speech at the Cuban Club, drawing applause from his audience. \"That's a great testament to our community.\"\n\nYou may want to hold back your applause, though, because the mayor is wrong.\n\nA reader asked PolitiFact New Jersey to check out Bollwage’s claim. We found Elizabeth’s unemployment rate stands at 11.9 percent, according to the most recent data available from the state’s Labor Department. Newark’s and Paterson’s jobless rates are bleaker,  at 14.1 percent and 15.4 percent, respectively.\n\nBut Jersey City -- the second most populous city in the state behind Newark -- has an unemployment rate of 10.2 percent.\n\nSo, among that group of cities with a population of more than 100,000, Elizabeth is third, not last.\n\nCity spokesman William Reyes said Bollwage meant to say Elizabeth has one of the lowest, not the lowest, unemployment rates among New Jersey’s most populous cities.\n\nIn his State of the City address, which Bollwage delivered before he gave the speech at the Cuban Club, the mayor got it right: \"Our unemployment rate is among the lowest of New Jersey’s largest cities and we are looking to reduce that even more.\" A chart Reyes sent us that was shown during the mayor’s address compared the unemployment rates in Elizabeth, Trenton, Newark, Paterson and Camden.\n\nOf those cities, Camden has the highest unemployment rate, at 18.8 percent, and Elizabeth had the lowest, at 11.9 percent. Jersey City wasn’t included.", "Here’s a breakdown of the unemployment rates in New Jersey’s 15 most populous municipalities:", "Population", "City", "Unemployment Rate: Nov. 2011", "Unemployment Rate: Nov. 2010", "277140", "Newark", "14.1", "14.5", "247597", "Jersey City", "10.2", "10.9", "146199", "Paterson", "15.4", "14.5", "124969", "Elizabeth", "11.9", "11.8", "99967", "Edison", "7", "6.8", "99585", "Woodbridge", "7.9", "8.6", "92843", "Lakewood", "8.8", "9.1", "91239", "Toms River", "9.5", "9.2", "88464", "Hamilton", "7.4", "7.6", "84913", "Trenton", "12.7", "12.5", "84136", "Clifton", "9.5", "9.7", "77344", "Camden", "18.8", "18.9", "75072", "Brick", "9.4", "9.3", "71045", "Cherry Hill", "6.9", "6.9", "69781", "Passaic", "12.6", "11.6", "Our ruling\n\nThe Elizabeth mayor said in an appearance at  the Cuban Club that the city has the lowest unemployment rate among New Jersey’s biggest cities.\n\nAmong cities with populations of 100,000 or more, Jersey City has a lower unemployment rate than Elizabeth.\n\nA city spokesman said Bollwage meant to say Elizabeth had one of the lowest, not the lowest, jobless rates among the state’s most populous cities -- a line he used in his State of the City address earlier this month.\n\nHe may have got it right then, but he got it wrong this time around.\n\nWe rate the statement False.", "To comment on this ruling, go to NJ.com.", "YouTube Channel of ElizabethNJHappens, Mayor Chris Bollwage Speaks at The Cuban Club, Jan. 15, 2012\n\nNew Jersey Department of Labor and Workforce Development, 2011 Labor Force Estimates for Municipalities with populations of 25,000 or more, accessed Jan. 16, 2012\n\nNew Jersey Department of Labor and Workforce Development, Labor Force Estimates, accessed Jan. 16, 2012\n\nU.S. Census Bureau: American Fact Finder, 2010 Census Redistricting Data: New Jersey, accessed Jan. 18, 2012\n\nPolitiFact New Jersey, Spreadsheet of New Jersey’s most populous cities and unemployment rates, created Jan. 18, 2012", "Email and phone interview with William Reyes, spokesman for Elizabeth city, Jan. 19, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]