["About this rating", "Political partisans often rush to social media in the wake of a mass shooting with unfounded claims, memes, and half-baked theories attempting to show how the \"other side\" was responsible for the violence. In June 2019, after a 40-year-old man shot and killed a dozen people in a municipal building in Virginia Beach, Va., a pair of rumors concerning his political affiliations were circulated on social media.", "The first rumor held that DeWayne Craddock was a \"black Muslim\", a claim we covered here. The other rumor, which we'll examine below, maintained that he was a supporter of U.S. President Donald Trump, wore a \"Make America Great Again\" (MAGA) hat, and had a \"2020 Trump\" bumper sticker on his car:", "We found no basis for this claim, and the Facebook user who spread this rumor provided no news reports or any other documentation to support the assertion. When pressed in the comments to provide a source, the user responded with a mocking message imitating Trump's speech pattern:", "My sources are the best sources. I have the best people and the best sources. I am never wrong and I never lie. Anybody who disagrees with me is fake news. Believe only me. Only I can save you. You have no hope without me. I am your savior. I am a stable genius. Many people say I am a genius. Many fine people tell me that. .", "As of this writing, little is known about what motivated the Virginia Beach shooter. He didn't appear to have any social media presence, and he also didn't post any sort of manifesto online explaining his reasons for the attack.", "Police Chief James Cervera told USA Today that \"police don't have a motive at this point for the attack.\" Law enforcement have not indicated that Craddock's politics, or his religion for that matter, played a role in the shooting:", "Just why Craddock opened fire at the city’s Department of Public Utilities Building 2, part of a sprawling municipal complex, where he held a mid-level engineering job for 15 years, remained a mystery a day after the massacre.", "He had not been fired, as some early reports had claimed; he left no explanatory note or online manifesto. In fact, he apparently shunned social media.", "He had no criminal record, other than a few traffic violations — and both the firearms he used Friday were legally obtained, officials said.", "It’s no wonder that City Manager Dave Hansen called the deadly rampage “a senseless, incomprehensible act of violence.”", "Garrison, Joey and Christal Hayes.   \"What We Know About the Suspect in the Virginia Beach Shooting That Killed 12.\"\r\n    USA Today.   1 June 2019.", "Dorn, Sara and Laura Italiano.   \"New Details Emerge About Alleged Virginia Beach Shooter DeWayne Craddock.\"\r\n    New York Post.   1 June 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]