["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Sen. Sherrod Brown, D-Ohio, is pondering a run for president in 2020. He has attacked tax cuts approved by President Donald Trump as disproportionately benefiting the rich. (AP)", "U.S. Sen. Sherrod Brown says he will decide by the end of March whether he will run for president in 2020. In the meantime, he’s been on a \"listening tour\" of early primary and caucus states such as Iowa and New Hampshire for more than a month.", "As the Ohio Democrat travels, one of the targets of his criticism is the Republican-backed tax-cut bill that President Donald Trump signed into law in December 2017.", "Brown, who along with all other Democratic senators voted against the bill, said of it:", "\"We need to throw out President Trump’s tax law — just completely throw it out and rewrite our tax code to put people first. We know what this last tax law did — 70 percent of the benefits went to the wealthiest 1 percent.\"", "He made virtually the same statistical claim in at least two other interviews.", "It’s partially right.", "When PolitiFact evaluated the bill just before Trump signed it, we found that every income group would pay less in taxes in 2019, but that the benefits would flow disproportionately to wealthier taxpayers.", "And by 2027, every income group below $75,000 would see a tax increase, while only those income ranges above $75,000 would still see a cut.", "The primary reason for that is some of the individual tax cuts phase out after 2025, because of congressional rules. By allowing some tax cuts to expire, the Republicans needed only 50 votes instead of 60 votes to change tax law. In this case, the tax changes that benefit lower-income people expire, while the measures that largely affect higher incomes do not.", "So-called reconciliation has been done numerous times in the past, by Democrats and Republicans, when their majorities in the Senate were strong enough only to meet the 50-vote threshold.", "Brown actually understated his claim, according to his Senate office. The office, citing a Vox news article, told us the senator should have said that 80 percent, not 70 percent, of the benefits of the tax law went to the wealthiest 1 percent.", "That article even went a bit further, saying nearly 83 percent of the law’s benefit would go to the top 1 percent.", "But that figure represents only one point in time for a law that spans 10 years.", "We’ve already rated as Half True a claim that 83 percent of the tax breaks go to the wealthiest 1 percent. That claim, like the Vox article, relied on an analysis that the nonpartisan Tax Policy Center, a joint project of the Urban Institute and the Brookings Institution, did for three years.", "In two of the years studied, 1 percenters  — in 2018, those with income of more than $733,000 per year  — got an estimated 20.5 percent of the tax law’s benefits in 2018 and will get 25.3 percent of the benefits in 2025, according to the  analysis.", "Only in 2027 would an estimated 82.8 percent of the tax cuts go to the top 1 percent of tax filers.", "Again, the shift occurs because most of the individual tax cuts end after 2025. That leaves corporate tax cuts, which do more to help upper income earners.", "(Our friends at the Washington Post Fact Checker and FactCheck.org also rated 83 percent claims and came up with conclusions similar to our Half True.)", "James Hines Jr., a University of Michigan professor of economics, told us that the Tax Policy Center is well respected for such estimates, but he also pointed to estimates done by Congress’ nonpartisan Joint Committee on Taxation.", "In 2019, according to the committee, the top 1 percent get an estimated 23.4 percent of the tax law’s benefits — similar to the Tax Policy Center’s estimate of the early impact of the tax law.", "By 2027, the 1 percent would actually get more than 100 percent of the tax law’s benefits, by the committee’s calculation.", "That’s because the joint committee included in its analysis the impact of the tax law effectively repealing the Affordable Care Act’s individual mandate in 2019. The repeal means lower- and middle-income taxpayers lose tax credits they would have received by buying health insurance on the health law’s exchanges, the Tax Policy Center’s Joseph Rosenberg told us.", "A final note:", "Adam Michel, a tax policy and federal budget analyst at the conservative Heritage Foundation, told us that the two sets of estimates appear accurate for what they measure, but that it only makes sense that people with larger incomes would get larger tax cuts in terms of total dollars.", "But Michel said that many lower-income people get more than a 15 percent cut in their taxes paid, while wealthier people may only get an 8 percent cut in their taxes.", "Brown says that with the Trump tax law, \"70 percent of the benefits went to the wealthiest 1 percent.\"", "One nonpartisan analysis estimates that in 2027, the top 1 percent will receive 83 percent of the benefits of the law that Trump signed. And another analysis puts that figure even higher for 2027.", "But both analyses estimate that through 2025, the 1 percent gets about 20 percent to 25 percent of the tax cuts.", "Brown’s statement is partially accurate, but leaves out important information. We rate it Half True.", "PolitiFact, \"Nevada TV ad cherry-picks tax cut benefits to top 1%,\" July 10, 2018", "PolitiFact Texas, \"Lloyd Doggett says 80 percent of Republican-sought tax cuts flow to wealthiest 1 percent,\" Oct. 20, 2017", "Email, U.S. Sen. Sherrod Brown staff member Matthew Keyes, March 1, 2019", "Vox, \"The Republican tax bill got worse: now the top 1% gets 83% of the gains,\" Dec. 18, 2017", "Washington Post Fact Checker, \"Does the Trump tax cut give 83 percent of the benefits to the top 1 percent?\" Nov. 14, 2018", "FactCheck.org, \"Democrats’ Misleading Tax Line,\" Jan. 26, 2018", "Interview, Tax Policy Center senior research associate Joseph Rosenberg, March 4, 2019", "Email, James Hines Jr., University of Michigan professor of economics, March 2, 2019", "Joint Committee on Taxation, \"Distributional Effects Of The Conference Agreement For H.R.1, The ‘Tax Cuts And Jobs Act,’\" (Page 6) Dec. 18, 2017", "Interview, Adam Michel, Heritage Foundation tax policy and federal budget analyst, March 4, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]