["About this rating", "Under some circumstances, providers in the UK added charges based on emojis sent as MMS texts (without users knowing about the charges); the issue was first reported in late 2014; by 2016, most mobile phone users at risk of such charges would already have incurred charges and become aware of the circumstance.", "American cell phone users have been charged; emojis specifically are racking up charges; the issue began in early 2016; new handsets were largely the cause of the issue.", "The scope of users still at risk of incurring emoji-based charges.", "In early 2016, rumors swirled that some mobile phone users in the United Kingdom were being charged for the use of emojis. A commonly cited article was a February 2015 Daily Mail piece about a British woman who was purportedly charged £1,200 for one month's use of emoticons:", "A mother was hit with a staggering £1,200 in phone bills after texting hundreds of smiley face emoticon symbols that weren't included in her 'unlimited' £31-a-month contract.", "Paula Cochrane, 48, had no idea she was being charged 40p per emoticon by her contact provider EE and said she was 'raging' after the company only offered to cut her bill by £100.", "Details, as usual, rapidly fell away on social media. Many users warned friends about \"new\" emoji charges, but didn't specify whether that applied to users outside the UK, under which circumstances such charges could be incurred, or that the issue wasn't new as in 2016:", "Some phones charge you to use Emoji's in your text messages.. In some it is sent as text and in some it is sent as MMS", "— Imran Akram Butt (@imbutt333) February 25, 2016", "Love Emoji's. Some mobile providers now class an emoji as an image and charge extra (mms) in text messages. Beware.", "— terry stickney (@stixson) February 28, 2016", "For those excited about #emoji functions, just be aware that your provider may charge as if it's a picture message: https://t.co/2TKEaQvyE9 — Smith Goodfellow PR (@SmithGoodPR) February 29, 2016", "The two service providers most commonly named in warnings were the UK's EE and O2, although several British mobile phone companies fielded questions on Twitter:", "@gpethick Hi Gary, here is some more information about Emoji's and your billing: https://t.co/5XHPg5HTqh Jasmine — EE (@EE) February 24, 2016", "@brettlin21 To be clear Jamie, we haven't changed anything - it's your phone that may convert SMS with an emoji to MMS - not us. — O2 in the UK (@O2) March 1, 2016", "@nicolajo11 It depends if your phone converts that text message into a MMS, because of the emoji Nicola. This can be prevented, though. BR — Tesco Mobile Care (@tescomobilecare) February 26, 2016", "Provider EE linked to a customer care page devoted to the emoji charge problem, explaining why some users were racking up higher-than-expected bills due to emoticon use:", "Many phones automatically convert some text messages to picture messages. So if you’ve been charged for sending a picture message when you didn't intend to send one, this might be because your device has automatically converted a text message (SMS) to a multi-media message (MMS), which may not be free with your plan.", "This can happen when:", "In February 2015, The Guardian contacted several providers as well as device manufacturers. Samsung indicated that phones manufactured before April 2014 might automatically convert emojis to images, but claimed that affected devices displayed a warning message:", "Samsung told moneysavingexpert.com that every device launched since April 2014 has a default setting that classifies emojis as an SMS and not an MMS. It said that for older devices, however, such as the Galaxy S4, emojis will lead to messages being converted from an SMS into an MMS. It added that a warning message is displayed to inform the user that their message will be sent as an MMS.", "The Guardian reported in January 2016 that group messages appeared to exacerbate the problem, and that the providers maintained that the extra charges were due to device settings (over which they had no control):", "If your phone’s “group messaging” option is turned on, group messages may be sent at chargeable MMS rates. Phone users are advised to go into their settings menu and turn off picture messaging, or MMS as it may be listed. Regular senders of group messages should consider signing up to the WhatsApp service instead. It is free to use for the first year and about 67p a year after that. It works with all the big phone operating systems.", "An O2 spokesman told Guardian Money: “This is something that is down to the handset manufacturers, and it happens on other mobile networks, too. We’ve worked with the manufacturers, and the majority now advise customers that the message they are sending has or will be converted to MMS.”", "EE also advised customers that the emoji charge issue was out of their hands:", "@Nialls_ch0nce Good evening, the way a phone handles emojis, whether SMS or MMS, is not controlled by EE, or any ... https://t.co/GkJEcbIKhP — EE (@EE) March 2, 2016", "Before the issue caused alarm in 2015 and 2016, a December 2014 post on the web site MoneySavingExpert.com reported similar findings about charges incurred under specific circumstances:", "Our research found the main issue is with pre-April 2014 Samsung handsets where users have racked up huge bills after adding emojis – picture icons such as :-) rather than the emoticon equivalent of :) – into text messages, despite having packages with all-inclusive text allowances (see our Mobile phone cost cutting guide for more ways to save).", "This is known to affect the Samsung Galaxy S1, S2, S3, S4, plus the Galaxy Note 1, 2, 3 and Galaxy Ace. On these handsets, when an emoji is added to a text message it is automatically converted into a picture message. These aren't usually included in users' packages and can cost up to 40p each depending on the network provider.", "The report advised users to turn off MMS capabilities to avoid emoji charges, and warned that users who had \"downloaded a special 'emoji keyboard' on any Android or Apple handset could also be hit.\"", "By February 2016, the issue appeared to be restricted mostly to the realm of rumors and social media. Complaints about emoji charges began circulating in 2014, and reports about the £1,200 bill dated back to February 2015. Few users in the UK stood to be hit with more charges, and no American users reported them. Finally, the issue appeared limited to older handsets, group messaging, and non-native emoji keyboards. Concerned users were advised to review their service providers' help pages about avoiding emoji-related charges.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]