["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump drew wide criticism July 14 for a tweet that told \" ‘progressive’ Democrat congresswomen\" to \"go back and help fix the totally broken and crime infested places from which they came.\"", "Some commentators said Trump’s tweet was racist. It was also based on a false premise. Three of the members of Congress he apparently targeted — Reps. Alexandria Ocasio-Cortez of New York, Rashida Tlaib of Michigan, and Ayanna Pressley of Massachusetts — were born in the United States. The fourth, Rep. Ilhan Omar of Minnesota, is a naturalized citizen who came to the United States as a refugee from Somalia.", "The following day, Trump fought back against the criticism at a White House event, going on offense against the four lawmakers, especially Omar.", "\"I hear the way she talks about al-Qaida,\" Trump said. \"Al-Qaida has killed many Americans. She said you could hold your chest out. ‘When I think of America, ehh. When I think of al-Qaida, I can hold my chest out.\"", "Trump continued, \"When I hear people speaking about how wonderful al-Qaida is, when I hear people talking about ‘some people,’ with the World Trade Center — some people? No, not some people. Much more than some people.\"", "The Trump re-election campaign referred PolitiFact to the following remarks Omar has made in the past. However, Trump was misportraying the substance of what she said.", "Rep. Ilhan Omar, D-Minn., outside the Capitol on June 24, 2019. (AP)", "Pro-Trump circles have given substantial attention to an interview Omar gave in October 2013 for a local PBS show, \"Belahdan,\" which covers Middle Eastern community issues and perspectives. Fox News commentators mentioned the interview this year in February, April and July.", "On the show, Omar was asked by interviewer Ahmed Tharwat about backlash faced by Somalis following the bombing of a Kenyan shopping mall. Al-Shabab, a terrorist group with ties to al-Qaida, claimed responsibility for the bombing that left 67 people dead.", "Omar criticized Al-Shabab for terrorizing communities, but she questioned why Somalis are expected to condemn an attack that they were not a part of.", "She also discussed with her interviewer a linguistic reason why Islamic terrorist groups seem especially scary to Americans — that the groups’ names, which often come from everyday Arabic words, seem foreign to the ears of English-speakers.", "At minute 16:49, Omar described an example of this phenomenon when she took a college class studying the ideology of terrorism.", "\"The thing that was interesting in the class was every time the professor said ‘al-Qaida,’ he sort of like — his shoulders went up,\" she said while laughing. \"‘Al-Qaida!’ ‘Hezbollah!’\"", "By contrast, she said, \"you don’t say ‘America’ with an intensity, you don’t say ‘England’ with the intensity. You don’t say ‘the Army’ with an intensity. But you say these names (of terrorist groups) because you want that word to carry weight. ... When you hear people speaking in Arabic, you know, suspicion arises, people start to pay attention.\"", "At a press conference on July 15, Omar was asked to respond to Trump’s charge. She said she would not dignify it with a response, saying it was long past time for Muslims to answer for every Islamic terrorist attack, any more than every white American needs to condemn each attack by a white perpetrator.", "The other potentially relevant remarks Omar has made in the past came during a March 23, 2019, address to the Council of American-Islamic Relations of Greater Los Angeles' fourth annual Valley Banquet in Woodland Hills, Calif.", "Omar’s remarks drew criticism from some quarters that she had soft-pedaled the 9/11 attacks carried out by al-Qaida.", "At one point in her remarks, Omar said that \"CAIR was founded after 9/11 because they recognized that some people did something and that all of us were starting to lose access to our civil liberties,\" according to the YouTube video of the event.", "She was wrong about CAIR’s founding — the group was actually established in 1994 — but her critics focused on her use of the phrase \"some people did something,\" which they suggested was a way for her to protect al-Qaida.", "Others believed Omar was using verbal shorthand and that her meaning was clear from the full speech.", "Elsewhere in the speech, she said that \" what we know, and what Islam teaches us, and what I always say, is that love trumps hate.\" She also said, \"Regardless of how hard Washington might get for me, or your neighborhoods might get for you, you have to always remember that we have a mission as humans to love one another, to care for our neighbors, to raise compassionate children, and to fully, every single day, show up and make sure that we are furthering justice.\"", "We found another instance in which some have said Omar’s actions were soft on terrorism more generally.", "In 2016, before she was serving in Congress, Omar wrote a letter to a federal court judge seeking compassion for a defendant in an ISIS conspiracy case. The case involved nine Minnesotans of Somali descent who had traveled to the Middle East to fight for the Islamic State. Although her letter didn’t mention any of the defendants by name, it was entered in the case involving one of them, Abdirahman Daud.", "Omar argued that it was better to rehabilitate the defendant rather than imprisoning him for decades.", "\"As you undoubtedly deliberate with great caution the sentencing of nine recently convicted Somali-American men, I bring to your attention the ramifications of sentencing young men who made a consequential mistake to decades in federal prison,\" she wrote, adding that \"such punitive measures not only lack efficacy, they inevitably create an environment in which extremism can flourish, aligning with the presupposition of terrorist recruitment.\"", "Here, too, however, Omar did not celebrate ISIS but rather described the defendant’s association with the terrorist group a \"consequential mistake.\"", "Ultimately, the judge sentenced Daud to 30 years in prison.", "Trump said Omar was \"speaking about how wonderful al-Qaida is.\"", "Some have been offended by Omar’s remarks in the 2013 interview and portions of her speech to CAIR. But in neither case did she enthuse about \"how wonderful\" the terrorist group is, or anything close.", "We rate the statement False.", "Donald Trump, remarks at the White House, July 15, 2019", "Donald Trump, tweet, July 14, 2019", "Vox, \"Trump says he’s not concerned about being racist because ‘many people agree’ with him,\" July 15, 2019", "Belhadan, Interview with Ilhan Omar, Oct. 3, 2019", "Twin Cities Public Television, About Belhadan, Accessed July 15, 2019", "Council on Foreign Relations, Al-Shabab, Jan. 31, 2019", "C-SPAN, news conference with four Democratic lawmakers, July 15, 2019", "CNN, Fact check: Trump falsely accuses Ilhan Omar of praising al Qaeda, July 15, 2019", "Fox News, \"Ilhan Omar once blamed 'our involvement in other people’s affairs' after al-Shabab attack on Kenyan mall,\" Feb. 4, 2019", "Time magazine, President Trump Doubled Down on 'Why Don't They Go Back' Remarks: Read the Transcript, July 15, 2019", "Fox News, \"Ilhan Omar, in bizarre clip, jokes about people saying ‘Al Qaeda’ in menacing tone,\" April 12, 2019", "Fox News, Tucker Carlson: Ilhan Omar plays race card whenever extremism questioned, July 11, 2019", "MPR, ISIS case defendants face sentencing this week, Nov. 14, 2016", "New York Times, Trump Tells Congresswomen to ‘Go Back’ to the Countries They Came From, July 14, 2019", "Snopes, Did Rep. Ilhan Omar Call for Lighter Sentences for Would-Be ISIS Recruits? Jan. 28, 2019", "Washington Post Fact Checker, \"‘Some people did something’: Rep. Omar’s remarks in context,\" April 11, 2019", "PolitiFact, Ilhan Omar misstates the facts about CAIR's founding, April 15, 2019", "PolitiFact, \"In context: ‘Some people did something,’\" April 14, 2019", "Email interview, Jeremy Slevin, U.S. Rep. Ilhan Omar spokesman, July 15, 2019", "Email statement from the President Donald Trump campaign, July 15, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]