["“The whole thing was staged. Dude was a known activist that kept coming at police to get them to react, then when they finally pushed him, he faked his injury,” says a June 6, 2020 Facebook post that includes an image allegedly showing tubing used for the fake blood.", "US President Donald Trump has helped fuel conspiracy theories surrounding the June 4 incident in which 75-year-old Martin Gugino was injured in the city of Buffalo, tweeting without providing any evidence that “he fell harder than was pushed” and suggesting that he could be a “provocateur” from the far-left movement Antifa.", "In footage of the incident published by the WBFO radio station, Gugino can be seen confronting police before he is pushed and falls to the ground during a protest in Niagara Square. Blood runs from his ear as he lies on the ground.", "Another video shows him being transported by paramedics on a stretcher, with a cervical collar around his neck and a bandage over his head.", "The incident came during protests across the country over police brutality against African Americans that were sparked by George Floyd’s death in Minneapolis police custody on May 25.", "It led to assault charges against Buffalo police officers, both of whom pleaded not guilty.", "Other posts making similar claims about Gugino faking an injury appear on Facebook here, here and here.", "But the claims are false.", "Gugino “is still at the Erie County Medical Center (ECMC),” Peter Cutler, its vice president of communications and external affairs, told AFP by phone, saying that the man is now in rehabilitation.", "“His medical status was updated from serious to fair” on June 9, Cutler added.", "Kelly Zarcone, Gugino’s attorney, said claims that her client faked an injury and staged his fall “are ridiculous and absolutely false.”", "“No one from law enforcement has even suggested anything like that,” she told AFP by email.", "And the Erie County District Attorney’s Office also confirmed that Gugino was injured in a statement on charges against the two police officers involved in the incident.", "“The 75-year-old male victim was taken to ECMC to be treated for a head injury, loss of consciousness, and bleeding from the right ear. He remains hospitalized in critical condition,” the June 6 statement said.", "Some social media users raised questions about the speed and volume of blood that came out of Gugino’s ear after the fall", "“That’s not at all unusual,” explains Dr Sanjay Dhall, Associate Professor in Neurological Surgery at the University of California, San Francisco.", "“Given the way he was stumbling backwards, that itself is enough speed to cause the head to hit the ground pretty hard,” he told AFP by phone.", "“When I first saw that video, I immediately thought of the bleeding that was probably going on inside of his head, and I’ve seen many life-threatening injuries in many people who did not survive falls like that,” Dhall added.", "And the supposed “tube” allegedly used for fake blood appears to actually be the strap of a second mask, similar in shape and color to an N95, worn underneath Gugino’s blue surgical mask, as seen in footage of the incident here.", "Claims that Gugino is an activist, however, are accurate. He has been arrested four times but never convicted, according to his blog.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]