["The liberal advocacy group Americans United for Change has\n\nan ad\n\nrunning in the Washington, D.C., market that attacks the GOP's\n\nrecently released alternative\n\nto the Democrats' health care plan.", "The ad adopts a faux broadcast news format, beginning with this jab:", "\"This just in: Republicans in Congress have introduced the Health Insurance Industry Profits Protection Act.\"", "The announcer says the GOP plan would let insurance companies continue denying care for pre-existing conditions, a\n\nclaim we looked at more closely\n\nwhen U.S. Rep. Debbie Wasserman Schultz said the same thing.", "The ad then makes this claim: \"Republicans will still let insurers raise premiums four times faster than wages.\"", "In its backup material for the ad, Americans United for Change cites\n\na report\n\nfrom the liberal group Health Care for America Now! (guess where they are in the health care debate) that states, \"Commercial health insurance premiums have risen four times faster than wages and have more than doubled in the last nine years.\" That report, in turn, credits the nonpartisan Kaiser Family Foundation's\n\n\"Employer Health Benefits -- 2008 Annual Survey,\"\n\nwhich backs up the statistic.", "So it's fair to say that insurance premiums have risen four times faster than wages over the last nine years. But is it fair to say that trend would continue under the Republican plan?", "\"They (Republicans) do nothing to control the cost of premiums,\" said Lauren Weiner, a spokeswoman for Americans United for Change. \"It's a tacit approval of the current trend.\"", "Weiner said that's because the Republican plan does little to expand the insurance pool, which she argues would lower costs for everyone. A report from the Congressional Budget Office concluded the GOP plan would only reduce the number of uninsured people by 3 million by 2019, while 52 million nonelderly people would remain uninsured (by contrast the Democrats' plan would reduce the uninsured by 36 million, leaving 18 million without coverage).", "The Republican plan also does not include a public option, Weiner said, so it would not create the necessary competition to drive down health insurance costs.", "Republicans say their plan would reduce premiums because it would let people buy health insurance across state lines; allow small businesses to pool together and offer health insurance to their employees at much lower costs; and institute medical malpractice reforms.", "For an objective assessment, we turned to the\n\nCongressional Budget Office analysis\n\nof the GOP plan. The CBO is a nonpartisan budget agency that creates calculations for how much bills in Congress will cost the government. Contrary to the Americans United claim, the CBO concluded the GOP plan would\n\nlower\n\npremiums. Specifically:", "• For the small group market (generally businesses with 2 to 50 employees — about 15 percent of the private market), the GOP plan would reduce average premiums in 2016 by 7 to 10 percent compared with amounts under current law.", "• For the individual market (just over 5 percent of the private market), the GOP plan would reduce premiums in 2016 by 5 to 8 percent.", "• And for the large group market (which represents 80 percent of private premiums), the GOP plan would reduce premiums in 2016 by 0 to 3 percent.", "The CBO cautioned that those estimates are \"very preliminary and are subject to an unusually high degree of uncertainty\" because of the difficulty in trying to disentangle how various proposals in the plan might affect premiums.", "Still, the CBO has done the most thorough and objective analysis of the bill, while the liberal groups have merely assumed that past trends will continue. Given the CBO's role as a nonpartisan, well-respected authority, we find its estimates more persuasive. We find the Americans United claim to be False.", "YouTube, Americans United for Change TV ad:\n\n\"Breaking News: Republicans Introduce Insurance Industry Protection Act,\"\n\nNov. 5, 2009", "The\n\nalternative health care reform bill offered by Rep. John Boehner\n\n, Nov. 4, 2009", "PolitiFact.com,\n\nWasserman Schultz says GOP alternative health care plan allows insurers to continue denying coverage for pre-existing conditions\n\n, Nov. 5, 2009", "Health Care for America Now!,\n\n\"Premiums Soaring in Consolidated Health Insurance Market,\"\n\nMay 2009", "Kaiser Family Foundation,\n\n\"Employer Health Benefits: 2008 Annual Survey\"", "Congressional Budget Office,\n\nLetter from CBO Director Douglas Elmendorf regarding the CBO analysis of GOP alternative health care plan,\n\nNov. 4, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]