["About this rating", "A 64-year-old California man with underlying conditions and a previous diagnosis of COVID-19 died shortly after receiving a dose of the SARS-CoV-2 vaccination.", "Lab results showed that the vaccine was “ruled out as a contributing factor in the individual’s death.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Authorities have concluded their investigation of a Northern California resident who died within hours of receiving the COVID-19 vaccine in late January 2021.", "According to the Placer County Sheriff’s Office (PCSO), a 64-year-old unnamed male, who was employed as a healthcare worker, was administered the SARS-CoV-2 immunization several hours before his death on Jan. 21. However, officials reported in a Jan. 30 update that a clinical examination and lab results determined that the COVID-19 vaccine was “ruled out as a contributing factor in the individual’s death.”", "“The individual began complaining of side effects within ten minutes of vaccination, which led to our decision to inform the public of the investigation occurring,” wrote the PCSO in an update shared to Facebook.", "“Through our investigation, we have learned more details about the individual. We have learned that not only had he recently been diagnosed with COVID-19, he also had underlying health issues, and had been exhibiting symptoms of illness at the time the vaccine was administered.”", "Snopes contacted PCSO Public Information Officer Angela Musallan, whose department also oversees communication for the county coroner's office, who confirmed the details of the Jan. 30 update.", "According to an initial Facebook post shared by the sheriff’s office on Jan. 23, the individual had tested positive for the novel coronavirus in late December 2020. However, the department did not release any additional details at the time as to the cause of his death. And although some news reports alluded to a possible link between receiving the vaccine and the individual’s death, there was no conclusive evidence that this was the case.", "Furthermore, it was not clear whether the individual received the Pfizer or Moderna vaccine, or who administered the vaccine. The sheriff’s department said that the vaccine was not administered by Placer County Public Health, but did not specify the circumstances under which the individual was vaccinated. Snopes contacted the sheriff’s department at the time, which declined to provide additional information.", "“There are multiple local, state, and federal agencies actively investigating this case; any reports surrounding the cause of death are premature, pending the outcome of the investigation. Our thoughts are with the family of the deceased,” stated the County of Placer Public Health and Sheriff-Coroner in a news release published on Jan. 23.", "A report published by CBS Sacramento described an anonymous woman who wrote on Facebook that the person who died was her 56-year-old grandfather. She alleged that the man died after experiencing an allergic reaction to the vaccination. She reportedly wrote:", "Twenty minutes later he realized his legs felt tingly and he was having shortness of breath. He was wheeled out in an ambulance…1 hour later he was in ICU on a ventilator and three hours later he passed away.", "Hearing this broke my families [sic] heart as he has taken care of my grandpa for years, and was there helping as we were coming to say our goodbyes.", "Snopes contacted the publication in an attempt to identify the woman and was told by reporter Marissa Perlman that the alleged granddaughter asked to remain anonymous. A report published by the Centers for Disease Control and Prevention (CDC) on Jan. 14, 2021, noted that a small percentage of vaccine recipients may experience anaphylaxis, a rare and severe life-threatening allergic reaction, after vaccination. Of more than 1.8 million first doses of the Pfizer-BioNTech vaccine, the agency detected 21 cases of anaphylaxis, nearly three-quarters of which occurred within 15 minutes of vaccination.", "“Based on early safety monitoring, anaphylaxis after the Pfizer-BioNTech COVID-19 vaccine appears to be a rare event,” wrote the CDC. “However, comparisons of anaphylaxis risk with that associated with non-COVID-19 vaccines are constrained at this time by the limited data available this early in the COVID-19 vaccination program.”", "Although the vaccine carries with it a rare risk of an allergic reaction, the CDC recommended in January 2021 that people still receive their immunization – even if they’ve already been diagnosed with COVID-19. But with that recommendation comes a small caveat: If a person was treated for COVID-19 symptoms with monoclonal antibodies or convalescent plasma, it is suggested they wait 90 days before receiving the vaccine.", "Snopes contacted California Health & Human Services, the U.S. Food and Drug Administration, and the Yale Public School of Health for further clarification about the safety and efficacy of the COVID-19 vaccine. We will update this article if we receive more information.", "Update [Jan. 29, 2021]: This article was updated to include comments from CBS Sacramento reporter Marissa Perlman.", "[Feb. 16, 2021]: This article was updated to include a Jan. 30, 2021, statement issued by the Placer County Sheriff’s Office.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]