["On January 21, farmer unions rejected the Centre’s proposal to keep the farm bills in abeyance for 18 months and reiterated their demand for the repeal of farm laws. The 11th round of talks between the central government and farmer unions are set to take place at Vigyan Bhavan, New Delhi on January 22, reported The Indian Express.", "In the backdrop of this, several Facebook and Twitter users posted a video that shows Muslim men and women at a rally. Based on the banners it appears that the video is from a farmers’ protest. At the bottom of the viral video, we can see the text ‘kishan morcha mumbai’.", "Pro-BJP propaganda media outlet Kreately tweeted the video and wrote in Hindi, “Are these farmers? What kind of a farmers’ protest is this? Is this Kisaan rally or Shaheen Bagh gang?” This tweet gained over 700 retweets. Alt News has documented misinformation put out by Kreately in the past.", "(Translated from Hindi text ये कैसे किसान? ये कैसी किसान रैली किसान या शाहीन बाग गैंग ?)", "ये कैसे किसान? ये कैसी किसान रैली किसान या शाहीन बाग गैंग ? pic.twitter.com/2qaPncafms", "— Kreately (@KreatelyMedia) January 22, 2021", "BJP leader Rameshnaidu Nagothu shared the viral video originally tweeted by Twitter user Dharmendra Chhonkar. Nagothu wrote, “Show me a farmer in this farmer rally at Mumbai” and tagged BJP leader Kapil Mishra and Ramesh Solanki.", "Show me a farmer in this farmer rally at Mumbai.@Rajput_Ramesh @KapilMishra_IND pic.twitter.com/4JceXvqvBK", "— Rameshnaidu Nagothu (@RNagothu) January 22, 2021", "Nagothu’s tweet was retweeted by both Mishra and Solanki. Both of them have shared misinformation in the past. (1,2)", "This slideshow requires JavaScript.", "Twitter user @ExSecular also posted this video. It has gained over 30,000 views. In the past, this account has shared several instances of false news.", "Farmer rally pic.twitter.com/bYMsQgjUzR", "— Exsecular (@ExSecular) January 22, 2021", "According to tweets by Congress leader Surbhi Dwivedi and Bollywood personalities Konkona Sensharma, Faraz Arif Ansari and Swara Bhaskar, a protest was organised in Mumbai on January 16 to show solidarity with the ongoing farmers’ agitation.", "#mumbaiWithFarmers pic.twitter.com/Ejn2VCUngg", "— Konkona Sensharma (@konkonas) January 16, 2021", "On January 16, Aam Aadmi Party member Abhijeet Dipke posted a video from Mumbai that shows women in burkha marching in solidarity.", "Only Punjab is protesting?", "Here’s Mumbai on the streets in support of farmers. #mumbaiWithFarmers pic.twitter.com/hbMVSSrbwA", "— Abhijeet Dipke (@abhijeet_dipke) January 16, 2021", "The Indian Express reported that about 100 organisations and civil society groups came together under the banner of ‘Kisan Alliance Morcha’ in Mumbai to support farmers’ agitation. The morcha began from Islam Gymkhana on Marine Lines and ended at Azad Maidan — the same was documented by Owais Khan on his YouTube channel NetChills Vlog at 0:50 mark.", "At 2:48, Khan’s video shows Muslim women in burkha.", "NewsClick reported that hundreds of women farmers gathered at Veer Kotwal Garden in Mumbai’s Dadar area to protest against “anti-farmer” laws on the eve of January 18. Amey Tirodkar, the author of this report, told Alt News, “Farmers’ protest in Mumbai have been taking place every day since January 16 and should continue till January 25. On January 18, on the occasion of Mahila Kisan Diwas, several farmers joined in solidarity with farmers of Punjab and Haryana. Just like all protests people from different walks of life have become a part of the movement.”", "In order to establish that the viral video is indeed from the same protest, Alt News rummaged through several videos and images posted with the hashtag #MumbaiWithFarmers and compared them with the viral video.", "Visual verification", "At the two-second mark in the viral video, a woman can be seen carrying a poster that reads ‘No Farmers, No Food’. The same was tweeted by poet Hussain Haidry from the protest in Mumbai on January 16.", "At the 14-second mark in the viral video, a woman can be seen carrying a poster that reads ‘Mumbai With Farmers’. The same was tweeted by AAP member Abhijit Dipke from the protest in Mumbai on January 16.", "The viral video thus shows members of the civil society holding rallies in solidarity with protesting farmers. The narrative that only farmers can partake in the movement is being repeatedly used to undermine the protests. On January 19, a photograph of a group of women seated onstage in front of a Punjabi banner was shared with the text, “Women power on the Kisan stage – When did the spirited women of Punjab start wearing burqas?” Alt News found that these were Muslim women who joined protesting farmers at Tikri border.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…"]