["The graphic was published here on Facebook on April 16, 2020.", "The purported quote, written in a mix of English and Tagalog, translates to English as: “Stop the criticism, suffer from this, you are poor, you don’t have savings, you did not prepare for emergency, that’s your fault. You are very lucky, the government is doing all its best to help you.\"", "The quote is credited to Panelo, who now serves as the chief presidential legal counsel for President Rodrigo Duterte, and is dated April 8, 2020.", "The post’s caption states, in part: “Painful but true.”", "Below is a screenshot of the misleading post:", "The same graphic, whose layouts appears identical to others published by Inquirer.net, was also shared on Facebook here, here and here alongside similar claims.", "However, the claims are false.", "Inquirer.net issued this statement on Facebook on April 12, 2020 denying they published the graphic and affirming that it was “manipulated”.", "Below is a screenshot of Inquirer.net’s statement, which shows a comparison of the doctored and original quote cards:", "The post reads, in part: “WARNING! The INQUIRER.net did not produce the image on the left. We urge the public to be wary and mindful of the content they share.”", "The original Inquirer.net graphic, published here, matches this official government transcript of Panelo’s April 8, 2020 press conference. Panelo did not seen making any comments on the poor in his remarks.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]