["Farmers have been holding demonstrations across the country in protest of the agricultural ordinances that were recently passed in the Parliament. Amidst this, some pictures and videos were being circulated on social media with claims that they were taken during the recent protests. Siyaram Gurjar, associated with the Indian Youth Congress, Rajasthan, shared a video on Facebook on September 23 where hordes of people can be seen out on the streets. The Hindi caption with the post read – “This flood of farmers in Panipat is telling, the time for BJP to go has arrived. In some time we will march towards Delhi, the more they try to stop us, the harder we will fight…” It is noteworthy that farmers in Panipat had taken out a rally where they walked to Delhi. This video received around 1.84 lakh views at the time of writing. (archived link to the post)", "Posted by SiyaRam Gurjar on Wednesday, 23 September 2020", "The clip was also shared on Twitter as scenes from Panipat, Haryana. (archived link to the tweet)", "हरियाणा के पानीपत में उमड़ा किसानों का ये सैलाब बता रहा है, कि भाजपा के अंतिम विसर्जन का समय आ चुका है !!#भाजपा_हटाओ_किसान_बचाओ #IStandWithIndianFarmers pic.twitter.com/w8DiWHlnm9", "— Ashish Narula (@Aapka_Ashish) September 25, 2020", "Another video was shared with claims that it shows farmers protesting the new bills in Delhi. A Facebook page called ‘Tetsip’ shared the video (archived link to the post). Another Facebook page shared the clip.", "Farmers marching in #delhi #barakhamba road yesterday In Protest Against New Farm Bills", "Posted by Tetsip on Thursday, 24 September 2020", "Several other images have also been shared on social media as visuals of the farmer protests in Panipat, Haryana. Yet another picture has been shared with the claim that it shows farmers gathering in Delhi’s Rajpath. Apart from these, a photo of a huge procession of crossing a bridge is being shared with the hashtag ‘#standwithfarmerschallenge’.", "This slideshow requires JavaScript.", "Old videos and pictures are being circulated on social media as the recent farmer protests. We will fact-check each of these one by one.", "Video 1", "A reverse image search of one of the frames of the video led us to a tweet by CPI(M) on February 21, 2019, according to which farmers marched from Nashik to Mumbai. Zee News also covered the ‘Kisan long march’ held last year.", "#KisanLongMarch is on its way leaving Nashik towards Mumbai despite refusal of permission by police. #KisanMarchesAgain #BJPBetraysKisans pic.twitter.com/cFUH6lLh9V", "— CPI (M) (@cpimspeak) February 21, 2019", "Video 2", "A reverse image search of the video’s keyframes took us to a tweet by ANI dated November 30, 2018. The video depicts farmer protests in Delhi two years ago. The tweet stated that farmers from all over the country had reached the capital to demand loan waivers and better Minimum Support Price (MSP) among other concerns. This clip had been taken at Barakhamba road in Delhi. A page named ‘Left’ had also posted the video stating that it was shot in Delhi on November 30, 2018.", "Delhi: Farmers from all across the nation hold protest for the second day over their demands of debt relief, better MSP for crops, among others; latest #visuals from near Barakhamba Road. pic.twitter.com/Po5aGAhuSk", "— ANI (@ANI) November 30, 2018", "Image 1", "With a reverse image search, we found this picture on a Facebook post from September 5, 2017. CPI(M) had also tweeted this image on September 5, 2017, stating that it was shot in Rajasthan. In addition to this, an article in Sabrang India from September 11, 2017, carried the photo reporting that farmers in Rajasthan had taken out a rally demanding loan waivers and pension schemes.", "This slideshow requires JavaScript.", "Image 2", "An article by The Indian Express dated September 12, 2018, carries images of farmer protests that began in March 2018. According to the report, around 40,000 farmers rallied from Nashik to Azad Maidan in Mumbai on foot. The agitation was organised by All India Kisan Sabha. The farmers arrived in Mumbai after travelling for six days.", "While we were unable to find the identical image, one of the pictures carried in The Indian Express report matches with the viral photo.", "This slideshow requires JavaScript.", "Image 3", "We found this picture in a report by The News Bangla from November 29, 2018, which stated that farmers in West Bengal took out a procession starting from Singur. The march saw completion after travelling 52 kilometres to Kolkata’s Raj Bhavan. A Twitter user had shared some photos of this procession on November 30, 2018.", "Image 4", "A reverse image search of this picture revealed that it was shared as farmers gathering at Delhi’s Rajpathin December 2018. A Newsclick article dated November 30, 2018, carried the image as Delhi. Apart from this, Sabrang India reported on December 1 2018, that the picture was taken at a rally by farmers and tribals from Ramlila Maidan to Parliament. This group took out a rally on November 29-30 against the Modi government’s policies ahead of the Lok Sabha elections.", "Therefore, a slew of old pictures and videos from previous farmer protests are being falsely identified on social media as visuals from the recent demonstrations.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]