["About this rating", "In late October 2016, a number of Facebook posts asserted that tequila, a strong liquor distilled from fermented mash of the agave plant, acts as a probiotic and confers myriad health benefits:", "Multiple claims were presented in the clip displayed above, the first of which was that doctors purportedly prescribed a \"tequila drink\" as a cold and flu remedy in the 1930s, adding that the agave soothes sore throats and maintains antibacterial qualities. The former statement didn't constitute any sort of compelling evidence, as a number of medical treatments popular in the 1930s have since been abandoned as ineffective or impractical and replaced with superior alternatives.", "As for the latter claim, agave was found to perform no better than a placebo as a cough and cold treatment for children. A 2008 study of agave showed it to demonstrate limited antibacterial properties, but both colds and influenza are viral in nature and thus unaffected by antibacterials (although viral illnesses occasionally introduce a secondary bacterial infections).", "The video clip also claimed that the lime served alongside tequila is a good source of Vitamin C to combat colds, but Vitamin C need not be consumed with tequila (and vice-versa), and no conclusive evidence has ever shown that Vitamin C supplements effectively \"fight colds.\"", "In a later portion of the video agave was again lauded as a weight loss supplement (albeit mitigated by the consumption of tequila). The claim dates to a constellation of 2014 articles lauding tequila as a weight loss miracle, based in turn on research not of tequila, but of agave. That research was not conclusive and was conducted on mice (not humans):", "A sweetener created from the plant used to make tequila could lower blood glucose levels for the 26 million Americans and others worldwide who have type 2 diabetes and help them and the obese lose weight, researchers said ... [t]he main reason it could be valuable, they explained, is that agavins, a natural form of sugar found in the agave plant, are non-digestible and can act as a dietary fiber, so they would not raise blood glucose. Their report was part of the 247th National Meeting of the American Chemical Society (ACS).", "\"We have found that since agavins reduce glucose levels and increase GLP-1, they also increase the amount of insulin,\" said Mercedes G. López, Ph.D. GLP-1 (glucagon-like peptide-1) is a hormone that slows the stomach from emptying, thereby stimulating production of insulin. She added, \"Agavins are not expensive and they have no known side effects, except for those few people who cannot tolerate them.\" In addition, agavins, like other fructans, which are made of the sugar fructose, are the best sugars to help support growth of healthful microbes in the mouth and intestines, she said.", "Moreover, a review of sweeteners published by the University of Washington Medical Center Diabetes Care Center in 2013 contradicted the claim that agave was an effective weight loss tool:", "Agave nectar is a highly processed type of sugar from the Agave tequiliana (tequila) plant. Agave nectar is about 1 1/2 times sweeter than regular sugar. It has about 60 calories per tablespoon, compared to 40 calories for the same amount of table sugar. Agave nectar is not healthier than honey, sugar, HFCS, or any other type of sweetener.", "The claim that agave has been shown to lower cholesterol came from the same study of mice presented in 2014, with no conclusive evidence demonstrating the efficacy of tequila for reducing cholesterol in humans. Concurrent research determined that no \"statistically significant differences in total cholesterol or triglycerides were detected,\" again in a mice-only trial.", "All mention of tequila's stimulating the appetite leads back to the video itself or related content, and we could locate no research suggesting that claim is true. A 2010 study contradicted claims that any alcoholic beverage aids digestion, and separate studies demonstrated risks associated with regular consumption of alcohol by former sufferers of Irritable Bowel Syndrome (IBS) as well as adverse effects [PDF] involving the entire gastrointestinal tract (including the colon).", "All in all, the primary beneficial effect of tequila appears to be that some people enjoy drinking it.", "Bode, Christiane and J. Christian Bode.   \"Alcohol’s Role in Gastrointestinal Tract Disorders.\"\r\n    Alcohol Health & Research World.   1997.", "Boyles, Salynn.   \"Can Vitamin C Shorten a Cold?\"\r\n    WebMD.   2 October 2002.", "D'Souza, Joy.   \"Five Unexpected Health Benefits of Tequila.\"\r\n    Huffington Post Canada.   23 August 2016.", "Evert, Allison.   \"Sweeteners - Sugars.\"\r\n    The New York Times.   30 April 2013.", "García-Curbelo, Y. et. al.   \"Prebiotic Effect of Agave Fourcroydes Fructans: An Animal Model.\"\r\n    Food & Function.   September 2015.", "Harding, Anne.   \"Study Offers Solution to Help Kids Who Have Coughs Fall Asleep.\"\r\n    Reuters.   28 October 2014.", "Heinrich, Henriette et. al.   \"Effect on Gastric Function and Symptoms of Drinking Wine, Black Tea, or Schnapps with a Swiss Cheese Fondue: Randomised Controlled Crossover Trial.\"\r\n    BMJ.   15 December 2010.", "Hooshmand, S. et. al.   \"Effects of Agave Nectar Versus Sucrose On Weight Gain, Adiposity, Blood Glucose, Insulin, and Lipid Responses in Mice.\"\r\n    Journal of Medicinal Food.   10 July 2014.", "Hendaus, Mohamed A. et. al.   \"Virus-Induced Secondary Bacterial Infection: A Concise Review.\"\r\n    Journal of Therapeutics and Clinical Risk Management.   24 August 2015.", "Swanson, Garth R. et. al   \"Is Moderate Red Wine Consumption Safe in Inactive Inflammatory Bowel Disease?\"\r\n    Digestion.   26 August 2011.", "Verástegui, Ángeles et. al.   \"Species of Agave with Antimicrobial Activity Against Selected Pathogenic Bacteria and Fungi.\"\r\n    World Journal of Microbiology and Biotechnology.   July 2008.", "American Chemical Society.   \"Tequila Plant Is Possible Sweetener for Diabetics — Helps Reduce Blood Sugar, Weight.\"\r\n    26 March 2014.", "American Chemical Society.   \"Tequila Raw Ingredient Being Developed Into Drug-Carrier That Targets Colon Diseases.\"\r\n    27 March 2007.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]