["The claim was published in this May 17 tweet. It has been retweeted more than 270 times.", "It states, in part: “Western Australia / They just passed a Covid 19 Emergency Powers Act That will authorize officers to test & vaccinate children at school - this includes removing their underwear.”", "The tweet features four images: one with text that echoes the caption, and the other two are purported excerpts of legislation about medical examination and treatment, with sections about vaccination and the possible removal of “anything, including underwear” during the process highlighted yellow.", "The fourth image shows a supposed copy of a “declaration of public health state of emergency in respect of COVID-19” signed on March 16, 2020, by Roger Cook, the health minister of Western Australia (WA), a state in Australia.", "The claim was also shared hundreds of times on Twitter here, and on Facebook here, here, here and here.", "The claim is misleading; as of May 2020, Western Australia has not passed any vaccine legislation in the wake of COVID-19 and has no COVID-19 vaccine programme in place.", "In response to the COVID-19 pandemic, the WA government declared a state of emergency on March 15, 2020, and a public health state of emergency on March 23.", "However, the declarations were made under the Emergency Management Act 2005 and Public Health Act 2016; neither of those were passed recently as suggested in the misleading posts.", "A spokesperson for WA Department of Health told AFP in an email dated May 19: “There is no such Act recently passed. WA is currently in a declared public health state of emergency, and a state of emergency under two different Acts -- but these have been in place for some time.”", "Two of the images in the misleading posts highlighted portions of section 158 of the Public Health Act 2016 to illustrate that vaccination can be forced upon children at school and their underwear may be removed.", "Western Australia’s current school-based immunisation program is part of the country’s voluntary National Immunisation Program, which offers free vaccines to eligible people to “to reduce the number of cases of diseases that are preventable by vaccination in Australia.”", "“There is no vaccine for COVID available in WA schools or anywhere else,” the WA Department of Health spokesperson added. “However there is a research study that will occur in some WA schools… The research study above is voluntary.”", "A media release from the Western Australia government published here on May 1 explains that the study aims to “test for COVID-19 in schools and psychosocial impacts of the virus” and consists of three stages, including COVID-19 tests at monthly intervals over a period of three months, contact tracing and surveys to examine the psychosocial impacts of the pandemic among students, their parents and teachers.", "“The current testing for COVID-19 involves obtaining nose and throat swabs, which are sent to the laboratory for testing. This is the process for the school based research study above,” the WA Department of Health spokesperson said. They added that the removal of clothing is not necessary for the study, and children will not have their clothes removed against their will.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]