["A video has been doing the rounds on social media where exercise equipment in a park is apparently moving on its own. Several people alleged that this was the result of paranormal activity. Former cricketer Akash Chopra tweeted (archive) the video and wrote, “Apparently this happened somewhere in UP. Received via WA. Who’s exercising?? Man shrugging??” This video has been viewed 1.8 lakh times, retweeted 1,300 times and liked 5,300 times at the time of writing this article.", "Other than this, the video was widely shared on Twitter and Facebook claiming that it was shot in Japani Park in Rohini Nagar, New Delhi. A Facebook page ‘The Irritated Indian’ posted (archive) this video on June 12 claiming the same. The video has been viewed 95,000 times at the time of writing this article.", "Ghost doing exercise at Rohini Japani park around 2am last night. 🧐", "Do you believe in ghosts? :O", "Posted by The Irritated Indian on Friday, 12 June 2020", "The video was also shared with the claim that it was from Rajouri Garden, New Delhi.", "Rajouri garden park at night 2 o’clock 🙄🙄🙄🙄🙄🙄", "Video – Asish Malik", "Posted by Taldangra Memes on Friday, 12 June 2020", "Some users even posted the clip on Twitter and Facebook saying it is from Jhansi. People were also warned to not visit this park after sunset.", "The claim that the machine moved due to “paranormal activity” is unsurprisingly false. Putting excessive oil and grease in machines reduces friction causing move for a long time even if a little force is applied. The Additional SP of Uttar Pradesh, Rahul Srivastava, said in a tweet that some mischievous elements intentionally made this video to share false news on social media. Rahul Srivastava also tagged Jhansi police in his tweet. Later, a video was shared from the handle of Jhansi police regarding the same incident. City’s Circle Officer informed that the police visited the site to enquire about the incident and found that it was due to excess oil and grease that the machine was moving for a long time after just a push. Jhansi police also tweeted a video in which a policeman pushes the machine and it starts moving on its own.", "तेजी से वायरल हो रहे वीडियो जिसमें झूला अपने आप झूलता हुआ दिखाई दे रहा है, सत्यता की जाँच @COCityjhansi द्वारा मौके पर जाकर की गयी तो झूले में अधिक ग्रीस लगे होने से एक बार हिला देने पर कुछ समय तक हिलता रहता है। आप सभी से अपील है कि भूत आदि होने की अफ़वाह न फैलाएं #FakeNewsAlert pic.twitter.com/kvqpQCMCSv", "— Jhansi Police (@jhansipolice) June 13, 2020", "Several media houses published reports after the video went viral, and debunked the claim that a supernatural power was behind moving the park equipment. A guard from Kanshiram Park, Jhansi was quoted in a report by Aaj Tak. He said that he has been working in the park for the past eight years and has never experienced any such event.", "Furthermore, Alt News got in touch with Inspector Sanjay Kumar Gupta of Sipri Bazar Police Station. Sanjay Kumar told us, “The machine got so free after oiling and greasing that it moved for quite some time when pushed once. The machine eventually stopped moving after it gradually slowed down. Even if somebody pushes it with a finger, the machine starts moving again. There is no other angle to this incident. Children sometimes playfully claim that the machine is moving on its own. Somebody took a video and shared it on social media.”", "Akash Chopra had raised suspicions about the incident in his tweet but he later shared another video when the truth came out. In the second video, a man is seen busting the lies spread on social media and denying claims of any “ghosts”. To prove this, he pushed the equipment from both the sides which caused the machine to move. The man in the video says that some people spread false news to defame the park but there is no reality to these claims.", "The Truth 🤷‍♂️🤣 https://t.co/70PFjQ2MPF pic.twitter.com/LabfGHm12c", "— Aakash Chopra (@cricketaakash) June 13, 2020", "This is not the first time that a video of a moving machine has been shared with claims that it had links with paranormal activities. A similar video was posted by Facebook page ‘JeDdah YOuth’ on January 13, 2020, claiming that a park in Dubai was possessed by ghosts. This video was viewed 13,000 times as of this writing. The video was also shared on Twitter.", "Ghost Exercise in park", "A #Jinn or #Ghost, was seen (not seen) in Park in #Saudi doing #Exercise", "What is your #excuse?", "#Jeddah #Riyadh #gym", "Posted by JeDdah YOuth on Sunday, 12 January 2020", "What is the truth of this video?", "A Twitter handle ‘@hoaxeye’ shared a post from an Instagram account ‘kuwaitup2date’. In this post, one can clearly see the reality of the moving machine. A person pushes the machine a little and it can be seen moving on its own for quite some time. This proves that all the claims about the machine being possessed by ghosts are false.", "A post shared by KUWAIT UPTO DATE (@kuwaitup2date) on Jan 13, 2020 at 1:34am PST", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]