["With Bihar set to go to polls from October 28, campaigning for the assembly election is in full swing. As a result, social media platforms have also been dominated by election chatter. They have been rife with misinformation, and a lot of old photos and videos being linked to the upcoming polls. In the midst of this, a photograph has been going viral which purportedly shows bottles of alcohol that the BJP-JD(U) alliance was planning to distribute to voters ahead of the upcoming election. Facebook user Pooja Sekher Yadav posted this picture with the same claim – “This is also part of BJP-JDU’s preparations for the Bihar election…. Remember, Biharis, alcohol is both poisonous and dangerous, so do not get swayed!!”. Yadav’s post had been liked more than 300 times at the time of writing. (archived link to the post)", "बिहार में बीजेपी-जदयू की कुछ तैयारी ऐसी भी चल रही है…", "ध्यान रहे बिहारवासियो ये जहर ओर कहर दोनो है इसलिये बहकावे में नही आना है…!!", "Posted by Pooja Sekher Yadav on Sunday, 18 October 2020", "A Facebook page called Rashtriya Janata Dal Madhubani also shared the image with the same caption. (archived link to the post). Another page named Prabhudh Patrakar – Bihar posted the image. (archived link)", "The image and accompanying claim have gained a lot of traction on both Twitter and Facebook.", "बिहार में बीजेपी-जदयू की कुछ तैयारी ऐसी भी चल रही है…. ध्यान रहे बिहार वासियों ये जहर ओर कहर दोनो है इसलिए बहकावे में नहीं आना है….!!@RJDforIndia @laluprasadrjd pic.twitter.com/Qync2avJ1f", "— Nikku yadav (@Nikku_Yadav_Ji) October 19, 2020", "Using a simple reverse image search, Alt News was able to locate the original image in an article by Thai Hitz, a website from Thailand, dated September 22, 2019. It discussed floods in Thailand’s Ubon Ratchathani area and food packets being prepared to help those affected. These food packets included rice, dry food and other essential items. The report also mentioned that a person named Johnny wanted to ‘help’ those stranded without alcohol during the floods. So, he put together bottles of liquor and distributed them in the flood-affected areas. The article also contains an image of a person distributing the bottles.", "This slideshow requires JavaScript.", "A link to Johnny’s Facebook page, ‘ตะลึง กรุง จอน นี่ มือ ปราบ’, was also provided in the report. We looked through his page and found the viral image posted on September 22, 2019.", "มาเด้อซุมขี้เหล้า บักได๋สิเอา ซามกูใจดี #แนวแก้เมื่อย", "Posted by ตะลึงกรุง จอนนี่มือปราบ on Sunday, 22 September 2019", "The page also had a few other images of people distributing the food packets.", "This slideshow requires JavaScript.", "According to a UNICEF report dated September 21, 2019, parts of Thailand, particularly in the north-east, were experiencing flooding. The report included pictures from flood-stricken areas. Relief Web also reported that some areas of Thailand were severely affected by the floods.", "Pictures of liquor bottles distributed in Thailand in 2019 were falsely linked to the upcoming assembly elections in Bihar. Netizens used the photo to target the BJP-JD(U) alliance, accusing them of trying to influence voters.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]