["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Secretly recorded video of Mitt Romney grabbed attention on Sept. 17, 2012, primarily for his claim that 47 percent of Americans \"believe they are victims\" entitled to government help.\n\nBut there’s more to the video snippets of Romney speaking privately to big Florida donors in Boca Raton. As the Republican presidential candidate explained his approach to wooing independent voters, he reeled off a series of statistics about the disappointing economy.", "We’re checking several statements from Romney’s remarks on May 17, 2012, but here we’re asking whether, \"Fifty percent of kids coming out of school can't get a job.\"\n\n Fifty percent of kids\n\nRomney has made similar remarks on the campaign trail before, and his campaign has pointed us to articles by the Associated Press and Time.com that each address the bleak job market for 2012 college graduates.\n\nThe key piece of evidence is from the Associated Press article, \"In Weak Job Market, One In Two College Graduates Are Jobless Or Underemployed.\" It’s based on research by the Center for Labor Market Studies at Northeastern University, which in turn is based on data from the federal Current Population Survey, as well as Labor Department measures of what level of education is required to perform each of some 900 jobs.\n\nHere’s how the AP summarized the findings:\n\n\"A weak labor market already has left half of young college graduates either jobless or underemployed in positions that don't fully use their skills and knowledge. Young adults with bachelor's degrees are increasingly scraping by in lower-wage jobs – waiter or waitress, bartender, retail clerk or receptionist, for example – and that's confounding their hopes a degree would pay off despite higher tuition and mounting student loans. ...\n\n\"About 1.5 million, or 53.6 percent, of bachelor's degree-holders under the age of 25 last year were jobless or underemployed. … Out of the 1.5 million who languished in the job market, about half were underemployed, an increase from the previous year.\"\n\nRather than roughly half of recent college grads not being able to find a job, the reality is that about 50 percent of recent college graduates are either unemployed or employed in jobs that aren’t commensurate with their degree. Of this 50 percent figure, about half are unemployed, and about half are in jobs that don’t require a college degree.\n\nIn August, PolitiFact checked with Andrew Sum, the Northeastern professor who did the research. Sum agreed with our analysis.\n\nRomney would have been more accurate if he had phrased his claim the way he did on other occasions, when he said \"half the kids coming out of college this year … can't find a job, or a job that's consistent with a college degree.\"\n\nWe also think there’s an additional piece of context worth mentioning. Viewers shouldn’t compare this 50 percent rate to the more familiar unemployment rate, which is currently at 8.5 percent. The reality is that even in strong economic times, a sizable percentage of recent college grads is either unemployed or employed in jobs below their abilities.\n\nAccording to the AP, the record low was still pretty high at 41 percent, in 2000 -- \"before the dot-com bust erased job gains for college graduates in the telecommunications and (information technology) fields.\" That’s far higher than the more familiar unemployment statistic for the overall population ever gets.\n\nWhile Romney glossed over details when he spoke with donors, painting a darker picture than supported by the research, he did get the tone right: At 53.6 percent, the number of college graduates unemployed or underemployed is the highest it’s been in at least 11 years.\n\n Our ruling\n\nRomney told campaign donors that \"50 percent of kids coming out of school can't get a job.\" He missed a key qualifier -- according to the research, about a quarter of recent college grads literally can’t find a job, while another quarter have found a job, but one that doesn’t require a college degree. Still, the research shows the employment picture for college grads is grimmer than at any time in more than a decade. We rate the claim Mostly True.", "Mother Jones, \"SECRET VIDEO: Romney Tells Millionaire Donors What He REALLY Thinks of Obama Voters,\" Sept. 17, 2012\n\nMother Jones, \"Mitt Romney on Treating Obama Gingerly,\" Sept. 17, 2012, via YouTube (1:10)\n\nPolitiFact, Republican Jewish Coalition says half of recent college grads \"can't find a job,\" Aug. 2, 2012 (Mostly True)\n\nPolitiFact, \"Mitt Romney is right, getting a job right out of college can be tricky business,\" Aug. 27, 2012 (True)\n\nEmail interview with Romney spokesman Ryan Williams, Aug. 22, 2012\n\nEmail interview with Andrew Sum, director of the Center for Labor Market Studies at Northeastern University, Aug. 1, 2012\n\nAssociated Press, 1 in 2 new graduates are jobless or underemployed, April 22, 2012.\n\nTime.com, Fewest Young Adults in 60 Years Have Jobs, Feb. 9, 2012.\n\nHuffington Post, \"Mitt Romney Explains '47 Percent' Leak: 'Victims' Comment Not Elegantly Stated,\" Sept. 17, 2012\n\nNational Journal, \"Romney: All of Obama's Supporters Want Government Handouts,\" Sept. 17, 2012\n\nPolitiFact, \"Romney repeats claim that Obama promised unemployment would not exceed 8 percent,\" Sept. 18, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]