["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Jerry Brown arrives for the State of the State in the Assembly Chamber at the State Capitol on Thursday January 21, 2016 in Sacramento, Calif. Photo by: Paul Kitagaki Jr., Pool, Sacramento Bee", "Near the end of his 2016 State of the State address, Gov. Jerry Brown claimed: \"two million new jobs have been created,\" in California since 2011.", "That’s a lot of new employment, we thought, especially for a state ranked by some as having the nation’s worst business climate, thanks to high taxes and regulation.", "Brown has staked his legacy, at least during his second stint in the governor’s office, largely on what he calls the \"California comeback.\"", "We decided to fact check his claim about job creation, which is a big part of that comeback.", "From 2007 to 2010, California lost more than a million jobs when the state’s housing and construction sectors collapsed.", "The loss of tax revenue and past skimpy savings meant multi-billion dollar budget shortfalls for California. It also meant heavy cuts in services for the poor, shuttering state parks and allowing levees, bridges and highways to crumble.", "In his speech at the state Capitol, Brown took some credit for the financial turnaround, noting that he’s helped pay down huge debts and create the state’s Rainy Day Fund.", "He didn’t take all the credit for the new jobs.", "\"Two million new jobs have been created and unemployment has dropped in half,\" since 2011, he said in his record 14th State of the State address. \"Of course, the global recovery has a lot to do with that. So, we should applaud, but we can’t control it, too.\"", "We’ll leave the global impact on California’s recovery as a question for another day. Our focus is on Brown’s comment that \"two million jobs have been created\" since 2011, the year he returned to the governor’s office, and more than two decades after his initial stretch as the state’s top executive.", "Crunching the job numbers", "Sifting through jobs data can be dizzying. And there are many ways to look at the numbers.", "For some guidance, we turned to Chapman University economist Esmael Adibi, who tracks state employment.", "Adibi pointed to \"nonfarm payroll jobs\" tracked monthly by the state and federal governments. Economists consider that category the most reliable because it eliminates farm employment, which fluctuates considerably. Everyone in the nonfarm category is listed on a payroll and considered an employee.", "Data from that category show that California had 14,301,300 nonfarm jobs in January 2011, when Brown’s third term started.", "A report released the day after Brown’s address shows the state had more than 16,320,100 of those jobs in December 2015.", "That’s a growth of just over two million jobs.", "Experts we spoke with said this is a ‘net job creation’ total. And because many jobs were also lost during this period, the gross number of positions created would have been well over two million.", "\"I believe the governor is correct,\" Adibi told us. \"The economy actually has done pretty good during his leadership.\"", "For some perspective, the two million jobs created in California accounts for about one-sixth of the nation’s net 12.4 million jobs added during the same period, according to U.S. Bureau of Labor statistics.", "It’s also roughly 600,000 more jobs than Texas added during the same period, the federal labor data show. Texas officials, including former Gov. Rick Perry, have made repeated efforts to siphon jobs away from the Golden State.", "Asked for the source of information for the California governor’s job creation claim, the Brown Administration pointed to the same non-farm payroll data as Adibi.", "Our ruling", "In his State of the State address, Gov. Jerry Brown said \"two million jobs have been created\" in California since 2011.", "The most reliable data used by both independent economists and the Brown Administration show California had about 14.3 million nonfarm payroll jobs when the governor returned to office in January 2011 and just over 16.3 million jobs last month. That’s a net growth of more than two million jobs.", "We rate the governor’s claim True.", "Phone interview with Esmael Adibi, director of Chapman University’s Center for Economic Research, Jan. 21, 2016", "Phone interview with Garin Casaleggio, spokesman for the California Labor and Workforce Development Agency, Jan. 21, 2016", "Phone interview with Jason Sisney, Chief Deputy Legislative Analyst, Legislative Analyst’s Office, California Legislature, Jan. 22, 2016", "California Employment Development Department, \"California’s nonfarm payroll jobs increase by 60,400,\" January 22, 2016", "Total Nonfarm Jobs, Texas, U.S. Bureau of Labor Statistics", "Total Nonfarm Jobs, California, U.S. Bureau of Labor Statistics", "Total Nonfarm Jobs, United States, U.S. Bureau of Labor Statistics", "California Legislative Analyst's Office, \"Great Recession: More Job Loss...Longer Time to Recover\", Dec. 4, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]