["A screenshot of BJP national spokesperson Sambit Patra’s alleged tweet is being circulated on social media. As per the screenshot, Patra tweeted on May 16, “I am watching Ertugrul nowadays & I see narendra modi has similar leadership qualities as Ertugrul .His Strong belief in God, his Courage to not give up, His conviction to Stand on his principles even when everyone is against him. @narendramodi”.", "Several Pakistan-based Twitter users shared the alleged screenshot of Patra’s tweet including @Nomii394 (archive link) and an anonymous account Pakistan Strategic Forum (archive link).", "Ertuğrul was a 13th-century Turkish warrior. Historical fiction series ‘Diriliş: Ertuğrul’ is based on Ertuğrul’s life who is considered the father of Osman I, founder of the Ottoman Empire. The show, which glorifies Muslim heroes, depicts Ertuğrul as a champion for the cause of Islam. He is shown fighting off external enemies such as the Mongols, Christian Byzantines and Templars. The series has been banned by the governments of the UAE, Saudi Arabia and Egypt alleging that Turkey wishes to influence the regions via soft power. Pakistani Prime Minister Imran Khan however has praised the show.", "The screenshot was also tweeted by two Jammu & Kashmir National Conference members — Sajjad Shaheen (archive link) and Shafqat Watali (archive link).", "Alt News received several requests to fact-check this on WhatsApp (+917600011160) and on our official Android application.", "In order to check the authenticity of the viral screenshot, Alt News performed a keyword search on Twitter restricting results between May 15-17, to check if Sambit Patra made such a tweet. We were unable to find any results, suggesting that the tweet with either never posted or it has been deleted.", "Taking a closer look at the screenshot, Alt News noticed several visual clues that indicate the screenshot isn’t authentic.", "1) ‘Following’ button is incorrectly placed  The ‘following’ button appears on the right-hand-side of a genuine tweet, just beside the user’s bio as seen below.", "However, the ‘following’ button appears on top of the tweet in the manufactured screenshot.", "2) Issues with date and time stamp", "The date and time stamp are separated by a hyphen in the viral screenshot.", "However, Twitter places a ‘dot’ before and after the date stamp. Another point worthy of mention is that the fake tweet does not carry information about the device used to post the tweet, unlike in the case of genuine tweets. 3) Only one version of the screenshot All screenshots circulating online have the same number of likes and retweets. If Patra had indeed made such a tweet more screenshots would have been available.", "Hence, the tweet where BJP spokesperson Sambit Patra is depicted comparing PM Modi with Ertuğrul is manufactured.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]