["Republican presidential candidate Newt Gingrich is comparing his struggles to those of President Ronald Reagan so often it’s turning into a habit.\n\nThe former West Georgia College history professor said June 22, during a speech at the Atlanta Press Club, that on the day of the 1980 New Hampshire primary, \"the top 13 people of Ronald Reagan’s staff quit.\" We ruled his claim Mostly True.\n\nGingrich recycled the historical tidbit that same day before a crowd near Baltimore and to Fox News’ Bill O’Reilly, both times in slightly different ways that hewed close to the truth.\nBut the Truth-O-Meter's dial began to spin when it got word of what Gingrich said June 27 on Fox News’ \"Your World With Neil Cavuto.\"   \n\nCavuto asked Gingrich how he will fight the perception his campaign is \"rudderless\" and assure voters that he can get his campaign on track.\n\n\"Well, first of all, by not being distracted, but focusing on substance and talking about the solutions we need as a country, and second by reminding people that Ronald Reagan had exactly the same challenges in 1980 -- John McCain had exactly the same challenges in 2007,\" Gingrich said.\n\nRonald Reagan had \"exactly the same\" challenges in 1980 as Newt Gingrich does?\n\nWe rated his earlier statement Mostly True because on balance, Gingrich’s claim squared with history. At about 2 p.m. Feb. 26, 1980, the day of the New Hampshire primary, Reagan met with campaign manager John Sears and two other top staffers in his hotel suite. Reagan and others blamed Sears for losing the Iowa caucuses.\n\nReagan handed Sears a news release that announced the campaign’s new manager was future Central Intelligence Agency head William Casey. It said Sears had resigned to return to his law practice.  \n\nSears got the message and left, as did staffers loyal to him.\n\nGingrich’s memory wasn’t perfect. But yes, many of Reagan’s top aides left the campaign on the day of his blowout victory in New Hampshire.\n\nStaffers left Gingrich’s campaign under very different circumstances.\n\nNews accounts said Gingrich’s high command rebelled after disagreements on the direction of the campaign. The Associated Press, which broke the story, described the dissent as a \"rebellion.\"\n\nOn-the-record accounts indicate Gingrich did not orchestrate these departures as Reagan did in 1980. Staffers left of their own accord because they disagreed with the direction of the campaign.\n\nThe departures started May 31, when Will Rogers, Gingrich’s Iowa political director, resigned. Rogers told The Des Moines Register that he thought Gingrich wasn’t campaigning or fundraising hard enough. Gingrich’s departure for a luxury vacation in the Greek isles was the last straw.\n\nFormer staffers Rick Tyler, Gingrich’s longtime spokesman, and the campaign’s Iowa director Craig Schoenfield both told The Boston Globe after they left that they and others resigned after a series of meetings involving top-level campaign aides.  \n\nSchoenfeld told Politico that staffers couldn’t convince Gingrich to run a more labor-intensive campaign.\n\n\"To be successful in Iowa you need to be here [and] taking a look at the way the schedule was, he’s not scheduled to be here in June at all and he’s got very few appearances in July,\" Scoenfeld said. \"You need to make sure that you give yourself a chance to be successful.\"\n\nTyler told the National Journal that staffers made up their minds to resign June 9, the day the news broke.\n\nThere are other glaring differences between the Gingrich and Reagan departures. Reagan switched staff during the primaries, as his campaign gained steam.  \n\nGingrich’s staffers left at a low point, after embarrassments on Medicare policy, his vacation to the Greek Isles, and news he held massive credit accounts at the jeweler Tiffany’s. The primaries are still eight months away.\n\nReagan lined up replacements before he pushed out his old staffers. Ten days after Gingrich’s staff left en masse, The Des Moines Register reported that Gingrich had yet to replace his Iowa staff.\n\nAt the Atlanta Press club, Gingrich referenced Reagan campaign history to drive home the fairly vanilla point that \"campaigns go up and down.\"\n\nOn Fox News, his point that he had \"exactly the same\" problems as Reagan in 1980 is outrageous self-flattery.\n\nReagan was on an upswing when his staffers left. Gingrich’s campaign is in a rut.\n\nReagan had replacements ready. Gingrich did not.\n\nReagan pushed out his staffers to run a more competitive campaign. Gingrich’s left him because they thought he wouldn’t do what it takes to win.\n\nGingrich started off in Atlanta with a statement about Reagan that was close to the truth, but as he repeated it, he embellished the facts so much that only a kernel of truth remained.   \n\nGingrich might wish he had Reagan’s problems. But on this one he deserves a Barely True.", "\"Your World With Neil Cavuto,\" \"Newt Gingrich climbing higher in GOP presidential polls,\" June 27, 2011\n\nPolitiFact Georgia, \"Gingrich cites Reagan's 1980 bid to say he can win presidency, June 29, 2011\n\nNational Journal, \"Newt Gingrich’s Staff Resigns\", June 9, 2011\n\nThe Des Moines Register, \"Gingrich campaign has yet to replace Iowa staff,\" June 19, 2011", "Talking Points Memo, \"Newt Gingrich: I’ll Still Be Here When Iowa Caucuses\", June 23, 2011\n\nDes Moines Register, \"Gingrich’s entire paid Iowa campaign team resigns,\" June 9, 2011\n\nNew York Times, \"Gingrich’s Future in Question After Aides Quit en Masse,\" June 9, 2011\n\nFox News, \"Newt Gingrich Speaks Out About Staff Shake-up, Hits Back at Critics\", June 23, 2011\n\nThe Boston Globe, \"Gingrich campaign hit by defections,\" June 10, 2011\n\nPolitico, \"Gingrich advisers resign en masse,\" June 9, 2011\n\nABC News, \"Newt Gingrich’s Senior Team Resigns Amid Conflicting Opinions About Campaign’s Direction,\" June 9, 2011\n\nThe Atlanta Journal-Constitution, Political Insider blog, \"His staff resigns en masse, but Newt Gingrich says campaign ‘begins anew Sunday,\" June 9, 2011\n\nThe Atlanta Journal-Constitution, \"Gingrich campaign fundraisers quit,\" June 21, 2011\n\nThe Washington Post, \"High command quits Gingrich campaign,\" June 9, 2011", "ABC News, \"Newt Gingrich says reason campaign staff quit is he’s ‘very different’\", June 22, 2011\n\nAssociated Press, \"Gingrich campaign in tatters as top aides resign,\" June 9, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]