["By Saranac Hale Spencer", "Posted on August 7, 2020", "A deceptively edited video clip of Joe Biden circulating on social media cuts an hour-long speech to less than one minute, retaining only parts of statements and his pauses between words.", "Joe Biden, former vice president and presumptive Democratic presidential candidate, spoke from a community center near his home in Delaware on July 28.", "The speech, which focused on addressing racial equality through his economic plan, and his answers to questions from reporters ran just over an hour. But a clip circulating on social media has spliced together parts of Biden’s remarks into a video that runs for less than a minute and shows him mostly saying some version of “um.”", "The clip included this description in the title, “Biden gets location wrong, sounds lost,” and garnered hundreds of comments on Facebook and Instagram, many of which expressed concern about Biden’s mental capacity. One such commenter wrote: “He is not a good person, but I don’t even have the heart to make fun of him. Cognitive decline is so sad, and I am stunned that his ‘loved ones’ would let him be paraded about like this.”", "But the clip was deceptively edited.", "It starts off accurately, showing the beginning of Biden’s remarks. He says: “Good afternoon, everyone. Welcome to Kingswood Community Center. Actually, that’s the one down, I used to work. That’s a joke; didn’t know where we were. Anyway,” Biden then laughed. The video clip then shows Biden saying: “It’s great to be here and back in a place where… .” But the clip doesn’t include the rest of the sentence, instead going on to splice together other parts of Biden’s remarks where he says “um” or “uh.”", "The only other words from Biden that the clip uses come from about 35 minutes into his remarks, when he’s answering a question about why he chose to speak from Delaware.", "In his full answer, Biden said he made that decision because “this is my home.” He explained that he would get the same kind of media coverage regardless of his location, and doing it in Wilmington, Delaware, made it easy to coordinate with campaign staff in Philadelphia.", "While that event was held at a community center, Biden has made several virtual appearances from his house near Wilmington since the COVID-19 pandemic swept the country in March. Following those appearances, President Donald Trump characterized Biden as staying in his “basement.”", "In his answer to the question, Biden made a reference to Trump’s comments. That’s where the social media clip picks up. It starts that section with Biden saying: “Operating out of home. All this stuff about hiding in the basement? Well, over 340 million people have watched what we’ve done like this on television. That’s as big as the American population.”", "Then, the clip ends.", "We asked Biden’s campaign what that figure was based on, but we didn’t get a response. Videos on the campaign’s YouTube channel routinely get thousands or tens of thousands of views, and the campaign also posts videos on other social media platforms. But it’s unclear how Biden got the tally of 340 million.", "We also reached out to Maggie VandenBerghe, who appears to have been the first person to post the clipped video. We didn’t get a response.", "VandenBerghe describes herself on her Facebook page as a “Conservative Filmmaker & Producer” and a “Pro Trump Patriot.” She didn’t explain in the caption accompanying the clip on either Facebook or Instagram that the video had been edited.", "The video of Biden’s complete remarks is below:", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Joe Biden Remarks in Wilmington, Delaware on the Economy.” C-SPAN. 28 Jul 2020.", "Trump, Donald (@realDonaldTrump). “Was in the Great State of Texas this week and explained that the Radical Left Do Nothing Democrats, headed up by their great leader, Sleepy Joe Biden (who never leaves his basement), are strongly against “Oil, Gas, Guns, & God”. Must be tough to win Texas on that platform!” Twitter. 2 Aug 2020.", "Joe Biden YouTube channel. Livestreams, Speeches, and Debates. YouTube. Accessed 6 Aug 2020.", "VandenBerghe, Maggie. Fog City Midge Facebook page. Accessed 6 Aug 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]