["“Fun fact: Canada didn’t buy a pipeline because Libs wanted. They bought a pipeline because Harper signed an agreement that says build it, or China can take Canada to a secret tribunal and we pay them damages.” This theory, which was the subject of commentary at the time of the purchase, re-entered the debate on Canadian social media following a September 27 tweet.", "The pipeline mentioned refers to the future expansion of the Trans Mountain pipeline, a controversial project that aims to carry more bitumen from the landlocked and oil-rich western Canadian province of Alberta to the west coast of British Columbia for export. In 2018, the Liberal government bought the pipeline for Cad$4.5 billion from US oil giant Kinder Morgan.", "The tweet, also shared as a screenshot on Facebook, provides a link to a 2018 opinion piece in the UK’s Guardian as the source for the theory. The piece explains that the reason for the pipeline’s purchase may be that Canada feared being sued in an independent court by Chinese investors under a trade agreement signed by Conservative Prime Minister Stephen Harper.", "A bilateral investment treaty between Canada and China was ratified in 2014. The Foreign Investment Protection Agreement, or FIPA, aims to ensure the equal treatment of Chinese and Canadian investments in both countries, although Chinese investments in Canada surpass those of Canadian investments in China.", "The suggestion that FIPA influenced the purchase of the pipeline is rather unlikely, several experts told AFP.", "The official position of the Liberal government on the purchase of the West-bound pipeline is that the Trans Mountain expansion is of national interest in terms of job and wealth creation for Canadians.", "According to Marie-France Faucher, a spokesperson for the Canadian Department of Finance, many factors were considered prior to the purchase, but “the Canada-China deal on the reciprocal promotion and protection of investments was not one.”", "“The government acquired these entities (the pipeline) when political risks made the project’s completion by the private sector too complicated,” Faucher told AFP in an email. She added that the government plans on selling the pipeline to new owners “at the appropriate moment.”", "As in several other free trade agreements, FIPA features a mechanism that allows Chinese and Canadian investors to sue the governments of Canada and China respectively, in independent arbitration courts.", "This mechanism is meant to ensure that foreign and national investors are treated equally in both countries. However, it is often decried because of the opaque nature of independent arbitration, and because it can allow investors to sue governments who choose to implement new social or environmental regulations that may interfere with a foreign investor’s ability to profit.", "Guy Saint-Jacques, Canada’s ambassador in China at the time FIPA was signed, told AFP he does not believe the agreement was a factor in the pipeline purchase. “I doubt there is a direct link, it would surprise me very much,” Saint-Jacques said.", "“There is no promise to build pipelines” in the deal, Saint-Jacques explained. Although he said Chinese investors have complained to him about the lack of infrastructure for the exportation of Alberta oil.", "“I think that Trudeau did this simply for domestic reasons,” he added.", "Armand de Mestral, a McGill University professor and international arbitration expert, told AFP he also doubts that FIPA influenced the Trans Mountain purchase. For Chinese investors to have a credible case under an independent arbitration court he said, “There needs to be a very direct link between the diminution of the investment’s value and a government decision.”", "Chinese companies began to invest billions of dollars in Alberta’s oil sands in 2009, and have continued to invest despite setbacks in the industry. However, de Mestral said that such investments are not sufficiently tied to the pipeline project to win an arbitration. Even if Chinese companies had fully owned Trans Mountain, there would need to be a government decision to block its construction to justify a fine following an arbitration, not just public pressure, he said.", "Canada and China are going through an unprecedented rift in their relations following the December 2018 arrest in Vancouver of top Chinese telecom executive Meng Wanzhou of Huawei on a US warrant.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]