["A picture of a man standing on the Indian national is floating on social media the past few days. The person has the Pakistani flag wrapped around him and a gun in his hands. The accompanying message suggests that he hails from Kolkata. The message also asks people to share the image as much as possible so that the man is soon arrested. Alt News has received several verification requests for the photograph on its official mobile application.", "On June 28, one Santosh Vyas tweeted, “यह कोलकाता के महेशतला में संतोषपूरी का रहने वाला है।इसे इतना वायरल करें की इसकी गिरफ्तारी हो सके (He is a resident of Santoshpur in Maheshtala, Kolkata. Make this so viral that the man is arrested.)” Santosh identifies as BJP Madhya Pradesh state executive member on his Twitter bio. By the time this article was written, his tweet garnered over 3,600 retweets.", "यह कोलकाता के महेशतला में संतोषपूरी का रहने वाला है।इसे इतना वायरल करें की इसकी गिरफ्तारी हो सके…!! pic.twitter.com/Sdd1bQtFEV", "— Dr.Santosh vyas…🌶🌶 (@DrSantoshvyas1) June 28, 2020", "A Facebook user shared this picture on a group called ‘Yogi ji ki Adalat (Must add 100 Yogi fans)’.", "The picture has also been shared with the claim that the man is Ashutosh Shukla of Kanpur.", "A reverse image search led us to an article published on the local website ‘Siwan Online’ on August 30, 2018. The article identifies the man as Sajid Hussain, a resident of Jasoli of Panchrukhi police station area, Siwan City, Bihar.", "Through a keyword search on YouTube, we found a video uploaded on August 31, 2018, which carries a statement of SP Naveen Chandra Jha. According to the police officer, a complaint was lodged at Panchmukhi police station and accused Mohammad Sajid Hussain was arrested. A case was registered against him for insulting the national flag. The SP added that cops were unable to find information about the gun in Hussain’s possession.", "On 30 August 2018, Prabhat Khabar published a report on the incident. This report too identifies the accused as Sajid Hussain from Siwan City, Bihar. Punjab Kesari shared a video report about the case on August 31, 2018.", "Therefore, a photograph of a man stepping on the Indian national flag has been shared with the false claim that he hails from Kolkata, West Bengal. The picture is related to a two-year-old case from Bihar.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]