["The photograph was taken at a locally-owned Chick-fil-A in Texas in 2015.", "The shirts were made and worn to support a local high school football team, the company says.", "Social media users are sharing an image on Facebook of Chick-fil-A employees wearing \"Back the Blue'' T-shirts, a color typically used to refer to the police. The posts suggest that the fast-food chain distributed the shirts following the recent protests over police brutality.", "The image in the post shows Chick-fil-A workers wearing the shirts through a drive-thru window.", "The caption above the photo starts with, \"As a retort to ‘BLACK LIVES MATTER.’\"", "Some of the words aren’t readable, but the caption concludes with: \"Be careful who you patronize. They may want your $$, but make a mockery of our oppression and pain. I hear you loud and clear tho (sic). I think y’all trash anyway.\"", "This is misleading. The photograph is several years old and was worn in support of a local high school football team at one Chick-fil-A location in Texas, the company says.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We reached out to Jackson Spalding, Chick-fil-A’s public relations firm, but did not hear back.", "A representative of the firm did tell Reuters that the photo is currently being taken out of context, and confirmed that the shirts were made in 2015 by \"one locally owned-and-operated Chick-fil-A restaurant\" to support a high school football team.", "A November 2015 article by law enforcement website PoliceOne.com counteracts that slightly,  and cites a quote from a manager who said the shirts were meant to support local law enforcement, as well as the football team.", "Meanwhile, in 2016, fact-checking website Snopes looked into claims that the shirts were given to Chick-fil-A employees in response to shootings at a Black Lives Matter protest in Dallas that killed five police officers.", "A Chick-fil-A representative clarified the manager’s words, and told Snopes the shirts were never meant as a reference to police officers and said that one locally owned restaurant in Houston created the shirts for the sole reason of supporting its local football team.", "The fast-food company released a statement June 3 addressing the protests and said that \"racism should have no place in society. Not now, not ever. It cannot be tolerated.\"", "Social media users are sharing an image of Chick-fil-A workers wearing \"Back the Blue\" shirts and claim the company distributed them to employees as a response to recent protests over police brutality.", "The photo is outdated and was taken in 2015 at one Chick-fil-A location in Texas. There are some conflicting reports about whether the shirts were also meant to honor local police officers, but the company repeatedly said the shirts were made to solely support a local high school football team.", "But the shirts were not distributed to Chick-fil-A employees across the country as a response to the current protests. We rate this False.", "Facebook post, June 2, 2020", "Reuters, Fact check: Chick-fil-A did not distribute \"Back the Blue\" shirts in response to recent Black Lives Matter protests, June 8, 2020", "Policeone.com, Photo: Texas Chick-fil-A employees wear 'Back the Blue' shirts, Nov. 19, 2015", "Snopes, Did Chick-fil-A Just ‘Drop a Bomb’ on Black Lives Matter?, July 12, 2016", "Chick-fil-A.com, Chick-fil-A responds to recent events, June 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]