["Senior journalist Ravish Kumar is once again in the cross hairs of fake news purveyors. After news poured in that Christian Michel, the ‘middleman’ in the Agusta Westland chopper scam had been extradited from the UAE, a video clip of Ravish Kumar began circulating on social media with the claim that Kumar has reported just the opposite.", "Special report on #ChristianMichel by Ravish and @Nidhi 👇🏻😂😂😂 pic.twitter.com/hWsflJY6jm", "— Shash (@pokershash) December 5, 2018", "The above tweet which was posted in the evening of December 5 has garnered over 4500 likes and over 2500 retweets. Several other handles too have posted this clip, in which Ravish Kumar is saying, “My colleagues Nidhi Razdan and Nita Sharma have reported Wednesday evening that the Dubai court has not given any order/directive for extraditing Christian Michel to India. The court had simply made an observation which was not even related to Michel. But on Tuesday, many reporters, referring to sources broke this news and conducted debates…” (translation).", "The above clip is circulating on Facebook as well, where it has been posted by a page PMO India Report Card.", "निष्पक्ष पत्रकार रविश कुमार क्रिस्चियन मिशेल को भारत भेजने की यूएई की अदालत के आदेश से काफी दुखी थे (चेहरे पर दुख पूरा झलक रहा है) और उनको तो विश्वास भी नहीं हुआ था, यहां तक कि उन्होंने तो इस खबर को झूठ साबित करने की कोशिश तक की थी, जबकि बाकी सारे पत्रकारों ने इस खबर की पुष्टि कर दी थी।", "Posted by PMO India : Report Card on Wednesday, December 5, 2018", "Other pages which have posted it include The Frustrated Indian, TheSatire.in, Bharat: An Untold Story, and Farrago Against Paid Media.", "Individual users on Facebook have shared it as well, ridiculing Ravish Kumar for his ‘reporting’ of the extradition.", "The video clip of Ravish Kumar circulating on social media is NOT a recent report following the extradition of Christian Michel. Alt News found that it was broadcast on the prime time show on NDTV India on September 19, 2018. The video of the same is available on YouTube and is posted below.", "In the above video, the portion from 0:41 to 1:27 corresponds to the 45-second video clip which has been circulated. Moreover, Ravish Kumar’s reference to Nidhi Razdan reporting that the UAE court has passed no order for extradition is corroborated by a tweet of Razdan dated September 19, 2018, the same day as the broadcast. In her tweet, Razdan reiterates that there is no court order to extradite Michel.", "Imp update- there is no court order to extradite Christian Michel, it is learnt that on 26th Aug, the UAE govt asked the court whether a British national can be extradited to a 3rd country. On 2nd Sept, the court gave an opinion, NOT an order. Indian Embassy verifying further", "— Nidhi Razdan (@Nidhi) September 19, 2018", "The same had been reported by ANI and Times of India on September 19, 2018. Meanwhile, the latest report of NDTV India on Christian Michel’s extradition can be accessed here.", "Ravish Kumar is an incessant target on social media, mostly through the use of fake, outrageous quotes but also occasionally through rumours.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]