["About this rating", "On April 1, 2009 — April Fools' Day —  the geek and gaming culture-focused retail company ThinkGeek released a product that they claimed was called \"Vilhelm Lillefläsk's Squeez Bacon.\" The site even created an involved history of the allegedly real product, which they also claimed had a 12-year shelf life:", "A few years after WWII ended, a young man working in a small restaurant in Sweden developed a new way to process bacon. By precooking it and blending it in a special way, he was able to make a fully cooked 100% bacon paste that could be squeezed from a tube. Knowing he had discovered something paradigm-shifting, young Vilhelm Lillefläsk quickly went into business. That, dear friends, is when Squeez Bacon® was born. And this delicious delectable from Sweden has finally been brought over to the USA - now with American Flavor!", "Both Squeez Bacon and Vilhelm Lillefläsk are made-up entities created for ThinkGeek's annual April Fools' Day fake product launch. A November 2009 New York Times Magazine piece referencing Squeez Bacon described that tradition, which began in 2001:", "On April 1 of each year since 2001, ThinkGeek, the online retailer, has devoted its home page to products that don’t exist. The names sound unlikely — Squeez Bacon, Surgestix Inhalable Caffeine Stix, p-Teq’s USB Pregnancy Test Kit, etc. — but they are presented as any item on the site would be: catalog description and list of features, pictures, maybe a video, price, “Buy Now” button. Click that and . . . ThinkGeek wishes you a happy April Fools’ Day.", "According to an April 2, 2009, story on the website Bacon Today, this is the image people attempting to procure Squeez Bacon would have seen had they added the product to their cart:", "Despite the fact that ThinkGeek — a website famous for its fake April Fools' Day products — explicitly stated that the product was not real 12 years ago, there remains confusion online as to the feasibility of buying a tube of Squeez Bacon. A Jan. 30, 2021, Reddit post in the \"Thanks I Hate It\" subreddit brought renewed attention to the fake product.", "Unfortunately (or fortunately, depending on your viewpoint) the product remains fictional. As such, the claim is \"False.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]