["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A TV ad by U.S. Sen. Tammy Baldwin attacks Leah Vukmir, her Republican rival in the Nov. 6, 2018, election, over oral chemotherapy and insurance companies.", "The ad from the Wisconsin Democrat, unveiled Sept. 10, 2018, features a Manitowoc woman who says:", "I’m 44 and I just finished my last chemo for a brain tumor. It was oral chemo, the only chemo for my kind of cancer. So, I’m glad that Republicans and Democrats made the insurance companies in Wisconsin cover oral chemo. Who would say no to that? Leah Vukmir. She was just about the only legislator who stood with the insurance companies instead of the people. Leah Vukmir, you ought to be ashamed.", "At one point, a photo of Vukmir is shown with these words on the screen: \"Voted against oral chemotherapy.\"", "The references are to votes by Vukmir, who is a state senator, on a bill that was later signed into law.", "Let’s see if Vukmir was \"just about the only legislator who stood with the insurance companies\" and \"voted against oral chemotherapy.\"", "All our fact checks in the U.S. Senate race.", "The law, signed by Republican Gov. Scott Walker in April 2014, makes it easy for cancer patients to afford oral chemotherapy, such as the pills the woman in the ad took. It prohibits health insurance plans from charging higher copayments, deductibles or coinsurance for oral chemotherapy than they do for injected or intravenous chemotherapy.", "Before the law, health plans typically covered oral chemotherapy under prescription drug plans that could have high copays; for some health plans, those copays could run into many thousands of dollars.", "In contrast, chemotherapy administered at a hospital or clinic was covered as part of a health plan's standard medical coverage — with no additional cost to the patient after the deductible was reached.", "Like us on Facebook. Follow us on Twitter: @PolitiFactWisc.", "Vukmir was one of two Republican senators to come out vocally against the bill and in support of insurers. She said at the time: \"I have a consistent record of opposing insurance mandates. A state mandate would only impact the insurance companies regulated by Wisconsin and not those regulated at the federal level, creating an uneven playing field and driving up costs for consumers.\"", "The bill was opposed by the Wisconsin Association of Health Plans, an HMO trade group, as well as another trade group, the Alliance of Health Insurers, and individual insurers. Insurers said the measure would drive up costs on insurance premiums and make it harder for employers and consumers to afford coverage.", "When the measure came to a vote in the Senate, Vukmir and GOP Sen. Paul Farrow cast the only no votes. The measure passed, 30-2.", "After changes were made to the bill in the Assembly, the Senate approved the bill again, 26-7. Vukmir again voted no because of her opposition to putting mandates on insurers; the other six senators said the changes weakened the bill.", "So, Vukmir was nearly alone in her opposition to an oral chemotherapy bill that was opposed by insurance companies.", "Her campaign told us that \"when government mandates price structures, providers eliminate coverage options and fewer people end up with quality care.\"", "But to be clear, her vote wasn’t against oral chemotherapy, per se. Rather, the law requires that insurers treat oral chemotherapy like traditional chemotherapy when it comes to how much patients must pay.", "Baldwin says Vukmir was \"just about the only legislator who stood with the insurance companies\" and \"voted against oral chemotherapy.\"", "On the main vote on a chemotherapy bill, Vukmir aligned with insurance companies that opposed the bill and was one of two state senators to vote no.", "That said, Vukmir’s vote wasn’t against oral chemotherapy. It was against stopping insurers from charging patients higher deductibles, copayments or coinsurance for oral chemotherapy than they would pay for traditional chemotherapy.", "For a statement that is accurate but needs clarification, our rating is Mostly True.", "YouTube, Tammy Baldwin TV ad, Sept. 8, 2018", "Email, Tammy Baldwin campaign spokesman Bill Neidhardt, Sept. 13, 2018", "Email, Leah Vukmir campaign spokesman Mattias Gugel, Sept. 14, 2018", "Wisconsin Public Radio, \"Oral Chemotherapy Bill Signed Into Law,\" April 3, 2014", "Wisconsin Legislature, Senate Bill 300 roll call, March 18, 2014", "Wisconsin Legislative Council, Senate Bill 300 memo, June 6, 2014", "Milwaukee Journal Sentinel, \"Wisconsin senators heavily support cancer drug bill; no vote planned,\" March 16, 2014", "Milwaukee Journal Sentinel, \"Assembly to consider cancer drug bill after Senate passes it 30-2,\" March 18, 2014", "Milwaukee Journal Sentinel, \"Scott Fitzgerald uses maneuver to prevent cancer drug vote,\" March 13, 2014", "Milwaukee Journal Sentinel, \"Scott Walker signs chemotherapy drugs bill at Froedtert,\" April 3, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]