["By Saranac Hale Spencer", "Posted on April 7, 2020", "Online posts falsely claim that the Kennedy Center for the Performing Arts donated $5 million to Democrats after it was allocated $25 million in the COVID-19 stimulus package. The center has not given any political contributions; it’s prohibited by law.", "The stimulus package that passed with bipartisan support in March to ease COVID-19’s crippling effect on the economy included $25 million for the John F. Kennedy Center for the Performing Arts.", "Shortly after that bill — the Coronavirus Aid, Relief, and Economic Security Act — became law, rumors started circulating online that the Washington D.C.-based arts center had given a $5 million contribution to Democrats.", "One popular version of the rumor started on Twitter and later migrated to Facebook as a screenshot meme, framing the bogus claim this way:", "Like a lot of misinformation that gets traction online, this tweet surrounded the falsehood with facts.", "It’s true that the Kennedy Center finished a $250 million expansion in 2019 and that it got $41 million in federal funding for fiscal year 2019. That was the center’s annual  appropriation for operations, maintenance and repairs, which it gets since it serves as a memorial to President John F. Kennedy. Most of the center’s budget comes from its programming income and philanthropic donations, as well as some other sources, such as gift shop sales. Those brought in a combined $216 million in fiscal year 2019.", "It’s also true, as we said, that the Kennedy Center has been allotted $25 million in the stimulus package. That money is “to prevent, prepare for, and respond to coronavirus, domestically or internationally,” according to the law, which specifies “deep cleaning” and “information technology to improve telework capability” as uses for the funds.", "President Donald Trump, who signed the act on March 27, defended the inclusion of the Kennedy Center in the stimulus package at a press briefing a few days before that, saying, “[T]hey’ve been essentially closed.  They have tremendous deficits that are built up. I mean, this thing has been devastating to it.”", "But the primary claim made in the tweet is not true. The Kennedy Center didn’t give $5 million to the Democratic National Committee, nor is it true that it “launders taxpayer money for the Democrats.”", "The Kennedy Center is registered as a 501(c)(3) nonprofit organization with the Internal Revenue Service and, according to the IRS, those tax-exempt charitable organizations are barred from making political contributions.", "Just to be sure, we searched the Federal Election Commission database for political contributions and found no record for political spending of any kind from the Kennedy Center going back as far as online records are available, which is 1980.", "Employees of the center are, of course, eligible to make political donations. But any such individual contributions would come from their own money, not the center’s funds.", "The writer of the original tweet, conservative content creator Cari Kelemen, later added a clarification that said: “[M]y original tweet should have said: *Tomorrow* donates $5 M to the DNC. It was meant as a next-step hypothetical.”", "But that hasn’t stopped others from taking the original claim and repeating it in new posts.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "U.S. House. H.R.748, Coronavirus Aid, Relief, and Economic Security Act. 27 Mar 2020.", "John F. Kennedy Center for the Performing Arts. Press release. “The Official Opening of the REACH.” 7 Sep 2019.", "U.S. House. H.J.Res.31 – Consolidated Appropriations Act, 2019. 15 Feb 2019.", "Trump, Donald. “Remarks by President Trump, Vice President Pence, and Members of the Coronavirus Task Force in Press Briefing.” Whitehouse.gov. 25 Mar 2020.", "Federal Election Commission. Individual contributions, John F. Kennedy Center for the Performing Arts. Accessed 6 Apr 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]