["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Andrea Schry, right, fills out the buyer part of legal forms to buy a handgun as shop worker Missy Morosky fills out the rest at Dukes Sport Shop in New Castle, Pa. (AP Photo/Keith Srakocic)", "A few days after President Donald Trump declared the coronavirus a national emergency and cautioned against gathering in groups, a Facebook post accusing the government of being \"up to something\" went viral in Pennsylvania.", "Here’s the full post:", "\"Is anyone paying attention to the bigger picture? And not what the media is feeding you? This virus is a distraction from the truth. Coming through Pennsylvania and stopped at a store and they have stopped selling gun ammo until further notice and all the cases are full so it’s not like they have run out. They are closing liquor stores. Next will be the banks. Then our phones will stop working. They don’t want venues of 50 or more people because they would have trouble trying to control 50-plus people. Something’s not right here and everyone is dumb enough to think it’s really just a virus. The numbers are nothing compared to H1N1 or Ebola. Everyone needs to realize our government is up to something and we are dumb enough to believe what you see on TV or on Facebook. Everyone better stock up on defense supplies because that toilet paper isn’t going to protect you when they come.\"", "Before we go any further, let’s get one thing straight – the coronavirus is real.", "The number of cases in the U.S. and the grim tally of deaths caused by the virus climbs exponentially every day, and the restrictions that drew skepticism from this Facebook user are the very measures that public health experts say will help slow the virus’ spread.", "There’s a lot to unpack in this misleading Facebook post, so we’ll take the claims one by one.", "When the post first appeared on March 16, there were no restrictions on the sale of guns or ammunition in Pennsylvania, and customers anxious about the coronavirus flooded firearms dealers. Then Gov. Tom Wolf ordered gun sellers and other businesses not deemed \"life-sustaining\" to close their doors. But he quickly reversed course under pressure from the Supreme Court of Pennsylvania and allowed them to reopen so long as the shops agreed to keep customers six feet apart.", "The Trump administration also advised states to consider gun sellers and shooting ranges essential businesses – on par with grocery stores and pharmacies.", "The post gets one thing right. Pennsylvania did initially close liquor stores, which are state run.", "Liquor stores reopened on Wednesday for online sales, but demand was so overwhelming that the Pennsylvania Fine Wine and Good Spirits website was unavailable for most users. The state liquor control board said access to the site would be \"randomized\" to prevent it from crashing.", "The Facebook user also warned that the government would soon close banks and cut the phone lines.", "There’s no evidence of this.", "Banks appear on Wolf’s list of life-sustaining businesses allowed to remain open, although some bank branches have closed voluntarily to keep customers and staff safe and others have reduced their hours or moved to drive-through service. Telecommunications companies like Philadelphia’s Comcast are easing shutoffs and waiving late fees to accommodate customers.", "Next the post argues that new rules against gathering in large groups are designed to prevent people from organizing. Really they’re the most important tool government officials have to stop the spread of the coronavirus, which scientists say is far more contagious than the flu. Pennsylvanians who defy the rules now risk arrest, and in New Jersey, 15 men who attended an ultra-Orthodox Jewish funeral were charged Wednesday with violating that state’s ban on large gatherings.", "Finally, the post suggests that coronavirus numbers don’t compare to H1N1 or Ebola, but top government scientists now predict that the coronavirus will be far deadlier than either of those diseases.", "During the H1N1 outbreak that started in 2009, more than 12,000 people in the U.S. died.", "About a dozen people were sickened with Ebola in 2014, but no one died.", "Last week, members of the Trump administration leading the government’s response to the coronavirus outbreak announced that the deadly pathogen could kill between 100,000 and 240,000 Americans. So far, nearly 5,000 people have died – 90 of them in Pennsylvania.", "State-run liquor stores did close in Pennsylvania as government officials scrambled to halt the spread of the coronavirus, but all the other claims made in this post are false.", "Most importantly, any suggestion that the coronavirus isn’t real or that it’s part of a government conspiracy is a ridiculous claim.", "The deadly virus is killing Americans right now, and abiding by unprecedented orders to stay home is the best way to halt its spread. We rate the post’s claim about the government being \"up to something\" Pants on Fire.", "Centers for Disease Control and Prevention, Coronavirus Disease 2019 (COVID-19), Cases in the U.S.", "Associated Press, \"Wolf reopens gun shops, orders more residents to stay home,\" March 24, 2020", "Pennsylvania Liquor Control Board, \"Pennsylvania Liquor Control Board Announces Closure of All Fine Wine & Good Spirits Stores,\" March 16, 2020", "State of Pennsylvania, \"Industry Operation Guidance,\" Updated April 1, 2020", "The Philadelphia Inquirer, \"Comcast offers free WiFi, waives data cap and late fees, won’t disconnect service during coronavirus outbreak,\" March 16, 2020", "State of Pennsylvania, \"Gov. Wolf, Sec. of Health: Pennsylvania on Statewide Stay-at-Home Order Beginning at 8 PM Tonight, \"Most Prudent Option to Stop the Spread,\" April 1, 2020", "Pennsylvania Department of Health, \"Help Stop the Spread,\" Updated March 24, 2020", "The Wall Street Journal, \"White House Projects 100,000 to 240,000 U.S. Coronavirus Deaths,\" April 1, 2020", "Centers for Disease Control and Prevention, \"2009 H1N1 Pandemic (H1N1pdm09 virus),\" June 11, 2019", "Centers for Disease Control and Prevention, \"2014-2016 Ebola Outbreak in West Africa,\" March 8, 2019", "Pennsylvania Department of Health, \"COVID-19 Cases in Pennsylvania,\" Updated April 2, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]