["Former Virginia Gov. Jim Gilmore was excluded from the Sept. 16 prime-time GOP presidential debate and from the \"undercard\" debate held earlier that day. (AP Photo)", "Former Virginia Gov. Jim Gilmore was not in a charitable mood Sept. 16 when he watched from afar as his 15 major rivals for the Republican presidential nomination debated on CNN.", "Gilmore was excluded because his polling numbers did not meet the 1 percent threshold for participation. He viewed the action from his campaign office in Alexandria -- first, the 90-minute \"undercard\" debate between the bottom four candidates, and then the three-hour main event among the top 11 that drew about 22.9 million viewers.", "Gilmore live-tweeted through it all, accusing his colleagues of misunderstanding issues, ducking questions and exhibiting facial expressions that were unpresidential. And then, there was this tweet, made during the 11-candidate debate:", "\"Not one candidate on the stage has military experience, and it shows,\" Gilmore wrote.", "We decided to check whether any of the prime-time debaters ever wore the uniform.", "Gilmore, it should be noted, has served in the military. Faced with a low draft number when he graduated from the University of Virginia in 1971, he enlisted in the Army for three years and served in the intelligence corps at NATO headquarters in Germany -- an experience he usually mentions in citing his qualifications for the White House. He rose to the rank of sergeant.", "As for the 11 debaters, we pored through biographies on their campaign websites and a variety of other authoritative sources for their resumes and backgrounds. No evidence of military service turned up for any of them.", "Three were old enough to be drafted during the Vietnam War -- Donald Trump, Ben Carson and John Kasich -- but managed to avoid conscription during an era when many college students received deferments from military service and draft numbers were determined by lottery drawings of birth dates.", "The draft effectively ended in December 1972, and the U.S. shifted to an all-volunteer military, but none of the candidates claims to have stepped forward either in the active military or the reserves.", "Participating in the main debate -- in addition to three candidates mentioned above -- were Jeb Bush, Chris Christie, Ted Cruz, Carly Fiorina, Mike Huckabee, Rand Paul, Marco Rubio and Scott Walker (who since has dropped out of the race).", "The B Team", "What about the four Republicans who participated in the undercard debate? Although they were not included in Gilmore’s statement, we thought it would be interesting also to look at their records.", "Sen. Lindsey Graham, R-S.C., served as an Air Force prosecutor from 1982 to 1988 and then spent 27 years as a reservist, first in the South Carolina Air National Guard and then transferring to the Air Reserve. Graham, who was not deployed for combat, retired as a colonel in June.", "His three debate partners -- Bobby Jindal, George Pataki and Rick Santorum -- list no military service in their resumes.", "The Democrats", "While we’re on the subject, let’s look at the military records of the five most prominent Democratic candidates. Nothing is listed for four of them: Hillary Clinton, Bernie Sanders, Martin O’Malley and Lincoln Chafee.", "Former Sen. Jim Webb of Virginia served in the Marine Corps from 1969 to 1972, including a 13-month stint as a rifle platoon and company commander in Vietnam. Webb, a recipient of the Navy Cross, the Silver Star, two Bronze Stars and two Purple Hearts, achieved the rank of captain.", "Our ruling", "While watching the main GOP presidential debate, Gilmore tweeted, \"Not one candidate on the stage has military experience … \"", "We rate his statement True.", "Jim Gilmore, Twitter, Sept. 16, 2015.", "Carly for President, \"Meet Carly,\" accessed Sept. 18, 2015.", "Encyclopaedia Britannica, \"Carly Fiorina,\" accessed Sept. 18, 2015.", "Marco Rubio U.S. Senate website, \"Biography,\" assessed Sept. 18, 2015.", "Marco Rubio presidential website, \"Meet Marco,\" accessed Sept. 18, 2015.", "Jeb 2016, \"Meet Jeb,\" accessed Sept. 18, 2015.", "The Almanac of American Politics 2006, Gov. Jeb Bush, accessed Sept. 18, 2015.", "Christie 2016, \"Meet Chris,\" accessed Sept. 18, 2015.", "Gov. Chris Christie, \"Chris Christie biography,\" accessed Sept. 18, 2015.", "Donald Trump presidential web site, \"About Donald J. Trump,\"  assessed Sept. 18, 2015.", "The Washington Post, \"What Donald Trump was up to while John McCain was a prisoner of war,\" July 20, 2015.", "Gov. John Kasich, biography, accessed Sept. 18, 2015", "The Almanac of American Politics 2000, Rep. John Kasich, accessed Sept. 18, 2015.", "Rand Paul for presidential website, \"About Sen. Rand Paul,\" accessed Sept. 18, 2015.", "U.S. Sen. Rand Paul, \"Meet Rand,\" accessed Sept. 18, 2015.", "Walker16, \"Meet Scott,\" accessed Sept. 18, 2015.", "Gov. Scott Walker, \"About Gov. Walker,\" accessed Sept. 18, 2015.", "Ben Carson presidential website, \"Meet Ben,\" accessed Sept. 21, 2015.", "Carson Scholars Fund, \"Dr. Carson,\" accessed Sept. 21, 2015.", "The Encyclopedia of Arkansas History & Culture, \"Mike Huckabee,\" accessed Sept. 21, 2015.", "Almanac of American Politics 2000, \"Gov. Mike Huckabee, assessed Sept. 21, 2015.", "U.S. Sen. Ted Cruz, \"About Senator Cruz,\" accessed  Sept. 21, 2015.", "The Washington Post, \"Who is Ted Cruz,\" Aug. 1, 2012.", "Pataki for President, \"Meet George,\" assessed Sept. 21, 2015.", "The Almanac of American Politics, \"Gov. George Pataki,\" accessed Sept. 21, 2015.", "Project Vote Smart, \"Rick Santorum’s biography,\"  accessed Sept. 21, 2015.", "The Almanac of American Politics 2000, \"Sen. Rick Santorum,\" accessed Sept. 21, 2015.", "Bobby Jindal for President, \"About,\" accessed Sept. 21, 2015.", "Office of the Gov. Bobby Jindal, \"The governor,\" accessed Sept. 21, 2015.", "Lindsey Graham presidential website, \"About,\" accessed Sept. 21, 2015.", "The Washington Post, \"Sen. Graham moved up in the Air Force Reserve ranks despite slight duties,\" Aug. 2, 2015.", "Gilmore for America, \"Bio,\" accessed Sept. 21, 2015.", "Richmond Times-Dispatch, \"Right to the point -- Gilmore’s career, life a testament to staying focused,\" Oct 12, 1997.", "The Washington Post, \"Gilmore’s careful climb toward top,\" Oct. 15, 1997.", "Hillary for President, \"Hillary’s story,\" accessed Sept. 21, 2015.", "Nation First Ladies’ Library, \"Hillary Clinton,\" assessed Sept. 21, 2015.", "Jim Webb `16, Biography, accessed Sept. 21, 2015.", "The Virginian-Pilot, \"Webb: A decorated hero and veteran of one war challenges the wisdom of another,\" Oct. 29, 2006.", "Martin O’Malley presidential website, \"Meet Martin O’Malley,\" assessed Sept. 21, 2015.", "Project Vote Smart, \"Martin O’Malley’s biography,\" accessed Sept. 21, 2015.", "Sen. Bernie Sanders, \"About,\" accessed Sept. 21, 2015.", "Project Vote Smart, Bernie Sanders, accessed Sept. 21, 2015.", "Lincoln Chafee presidential site, \"Meet Lincoln Chafee,\" accessed Sept. 21, 2015.", "The Almanac of American Politics 2006, \"Sen. Lincoln Chafee, accessed Sept. 21, 2015.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]