["The image was published on Facebook here on December 16. It has been shared more than 125 times.", "Below is a screenshot of the misleading Facebook post:", "The post’s Sinhala-caption translates to English as: “Couldn’t even keep it for a week”.", "The same image was also published with a similar claim on Facebook here, here, here and here. The captions written in these posts, some of which have been deleted, claim that the covered street art is located in Nugegoda, a Colombo suburb.", "Below is a screenshot of one of the other Facebook posts:", "The post’s Sinhala-caption translates to English as: “Nugegoda art that lasted only two days / Remember, that there are wastes of space like this also living in this country”.", "All of the claims are false; the image was digitally altered to include the posters covering the artwork, which is located in Dehiwala, another suburb south of Colombo.", "A keyword search in Sinhala on Facebook found this post published on December 14.", "It shows the same photo seen in the misleading posts without the posters.", "Below is a screenshot of the image in the Facebook post:", "Below is a screenshot comparison of the photo in the misleading posts (L) and the image in the earlier Facebook post (R):", "AFP visited the same location in Dehiwala on December 17 and found that the art was still intact. Below is a photo of the mural taken by AFP on that day:", "The creation of the street art mural was reported in this December 13, 2019, article published by Sri Lanka-based news site Asian Mirror, which stated it was painted under a flyover in Dehiwala.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]