["Former Hewlett Packard CEO Carly Fiorina gestures during the third Republican presidential debate. (Getty images)", "As the only female candidate on the debate stage, former Hewlett-Packard CEO Carly Fiorina said women voters shouldn’t assume that just because Democratic frontrunner Hillary Clinton is a woman that she has their interests at heart.", "\"It is the height of hypocrisy for Mrs. Clinton to talk about being the first woman president, when every single policy she espouses and every single policy of President Obama has been demonstratively bad for women,\" Fiorina said. \"Ninety-two percent of the jobs lost during Barack Obama's first term belonged to women.\"", "Her 92-percent claim dates back to the 2012 presidential race when it was used by the Republican National Committee and GOP nominee Mitt Romney. At the time, March 2012, the claim had some numerical validity but was also cherry-picked and flawed. We rated it Mostly False.", "We reached out to the Fiorina campaign and did not hear back, so we’re not sure if she based her statement on the same data as Romney’s campaign used.", "But here’s what we found back in April 2012: Between January 2009 and March 2012, the total drop in employment was, according to the Bureau of Labor Statistics, 740,000. In the same period, employment for women fell by 683,000.", "Do the division and you get 92.3 percent.", "A big problem with the claim in 2012 was that it cherry-picked the starting date for assessing Obama’s jobs track record. The recession began in December 2007, and he didn’t take office until January 2009, when it was nearly over. It’s difficult to blame any president for the economic situation he inherited.", "The bigger problem with Fiorina making the same statement today is that Obama’s first term continued for another 10 months.  During that time, the women job numbers did a U-turn and became a net gain.", "The government data show an increase of 416,000 working women between January 2009 and January 2013. Total employment also rose by 1.3 million. So more women actually were working at the end of Obama’s first term compared with the day he first took office.", "We used the January 2009 to January 2013 timeframe to be consistent with the original Republican framing of the critique of Obama’s economic policies.", "Our ruling", "Fiorina said 92 percent of the jobs lost during Obama’s first term belonged to women. By January 2013, the jobs numbers don’t back it up at all. The number of women with jobs increased by 416,000 during Obama’s first term.", "We rate this claim False.", "CNBC, Third Republican presidential debate, Oct. 28, 2015", "Bureau of Labor Statistics, Employment, Hours, and Earnings from the Current Employment Statistics survey", "Huffington Post, Romney Campaign Demands Correction From PolitiFact On Women's Job Loss Claim, April 11, 2012", "PolitiFact, Romney campaign says women were hit hard by job losses under Obama, April 10, 2012", "Washington Post, Are Obama’s job policies hurting women?,April 10, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]