["“This guy Akku Yadav from chennai, India whose sister was raped and the next thing he did was chopped off the rapist’s head and brought it to the police station. Your trending hashtags are just as useless as our government and laws,” is a message viral on social media.", "This guy Akku Yadav from chennai, India whose sister was raped and the next thing he did was chopped off the rapist’s head and brought it to the police station.. Your trending hashtags are just as useless as our government and laws. #HangRapistsPublically pic.twitter.com/sPItr3cavq", "— Wasiq Awan 🇵🇰 (@IamWasiq_) September 11, 2020", "A video of the same incident was viral last year with the message, “चेन्नई में बहन के साथ बलात्कार हुआ तो भाई ने बलात्कार करने वाले आरोपी का सर काट कर पुलिस स्टेशन ले गया इस तरह का कार्य करने से पहले 100 बार सोचे कि ऐसा भी अंजाम हो सकता है (In Chennai, a person beheaded the accused who had raped his sister; beheaded him and took it to the police station; think a hundred times before doing such acts, the consequences could be such- translation).”", "The disturbing video showed a man wearing a bloodied shirt walking around with a severed head. The video is 1:38 minutes long and shows the man accosted by police personnel as he walks. Due to the gory nature of the video, Alt News has not posted it here.", "The video had been uploaded by several individual users on Twitter in 2019. On Facebook, users have uploaded it on their timelines with an identical message. This suggested that the same is circulating on WhatsApp as well.", "Alt News searched Google with the keywords “Chennai beheading”, and found several news articles related to this incident. The claim floating on social media platforms along with this video is false.", "Firstly, this incident did not occur in Chennai. It took place in Mandya district of Karnataka in 2018.", "Secondly, the narrative accompanying the video is false.", "The incident had occurred on September 29, 2018 in the Mandya district of Karnataka. According to reports, the man seen in the video had beheaded his friend following a heated scuffle. Police had stated that the person had severed his friend’s head after the latter had made disgraceful remarks against his mother. TheNewsMinute states, “According to the police, Pashupathi brought the severed head to Malavalli from Chikkabagilu village, where the duo resided. “He (Pashupathi) informed the police officials that Girish spoke ill of his mother, which triggered a fight between the two,” added the SP.”", "In conclusion, the claim surrounding this video on social media is false. The incident took place in Mandya district, Karnataka in 2018 and was related to a petty quarrel.", "[This article was updated on September 11, 2020.]", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]