["About this rating", "On 25 July 2017, the far-right news and opinion web site Freedom Daily posted an article purporting to give an account of a violent Somali Muslim \"takeover\" of the small town of Shelbyville, Tennessee.", "Despite its surface resemblance to a news report, however, the post (dubiously bylined \"Prissy Holly\") was an ill-informed, opinion-laden attack on the Muslim refugee population of, well ... everywhere.", "It begins:", "Muslims continue to prove they have little intentions of integrating into modern civilization after fleeing their war-torn countries, as they continue to force Islam and Sharia Law onto unassuming Americans. Cities across America where migrants have been allowed to invade are rapidly transforming into Sharia swamps, just take a look at the startling transformation of cities like Dearborn and Minneapolis. As many Americans were left in shock and horror following the Minnesota woman being violently shot down by a Somali Muslim cop, now Somali migrants have set their sights on another American city to invade. Desperate Tennessee residents are frantically crying out for help, as the small town they once loved and cherished is being completely overrun by hordes of nasty Muslim migrants, who have now started targeting local Christians with violent Islamic crimes.", "The text becomes more specific as it continues:", "While it would be wise to keep these terrorists confined to Somalia as much as possible, liberals keep advocating to bring Somali Muslims to America by the thousands, where hordes of Somalis are dumped into American cities annually much to the horror of Americans across the country. And unfortunately for the residents of Shelbyville, Tennessee, a small American town about an hour’s drive from Nashville, they’re now becoming intimately acquainted with exactly what Sharia Law and Islam teaches, after third world migrants were dropped into their town overnight.", "From reading those paragraphs, one might easily come away with the impression that Shelbyville experienced some massive influx of Somali refugees in recent weeks or months, but that is not the case. Over the past fifteen years, the U.S. has resettled 51 refugees there, of whom 47 were Somali, according to data from the Refugee Processing Center, which tracks refugee resettlement in the United States. The largest number of refugees to resettle in the town in a single year was 11. With a population of around 20,000, these arrivals represent less than one percent of Shelbyville's total population.", "Official resettlement isn't the only way refugees arrive in U.S. communities, however. In the case of Shelbyville, already-resettled refugees began moving there in the early 2000s in order to take advantage of job openings in the local meatpacking industry. Exact counts are hard to come by, although, according to a 2010 U.S. Census estimate, Shelbyville had 446 foreign-born residents originating from sub-Saharan Africa as of that year, amounting to 2.3 percent of the total population. In a small town, that could cause a noticeable cultural shift. But it's hardly a \"takeover.\"", "In point of fact, we learned from Shelbyville Police Chief Jan Phillips that the Somali refugee population of the town has dramatically decreased since that time. A 2015 Census Bureau estimate put the total number of residents of Subsaharan African origin at 166 (less than 1 percent of the population). Needless to say, Phillips dismissed the notion that they had \"taken over\" Shelbyville as \"completely false\".", "A later paragraph in the Freedom Daily post describes the \"culture clash\" supposedly happening in the town (emphasis in the original):", "“They’ve had an impact here. Unfortunately, it’s not been a good impact,” said Brian Mosely, a reporter for the local Shelbyville Times-Gazette stated. “I found that there was just an enormous culture clash going on here,” he said. “The Somalis were, according to a lot of the people I talked to here, were being very, very rude, inconsiderate, very demanding. They would go into stores and haggle over prices. They would also demand to see a male salesperson, would not deal with women in stores. Their culture is totally alien to anything the residents are used to,” Mosely added.", "But although these remarks by former Shelbyville Times-Gazette reporter Brian Mosely are accurately quoted, they weren't uttered this year, or last year, or even five years ago. They date from 2009, when Mosely, who had written extensively about the arrival of Somali refugees in Shelbyville during the mid-2000s, was interviewed by the Christian Broadcasting Network.", "What of the \"Muslim migrants\" who Freedom Daily says are \"targeting local Christians with violent Islamic crimes\"? Here's the one and only example of such a crime they were able to cite (emphasis, again, in the original):", "But unfortunately for locals, a “culture clash” would soon be the least of their concerns after a series of violent crimes were taken out at the hands of these Somali migrants. Several months ago, the liberal media completely white-washed a series of events where three churches were shot up by Muslims. Jihad Watch was the only one to even report on the story, where AK47’s were used to shatter the windows of multiple churches in the area. They reported:", "\"A Muslim shoots up three churches and nothing is said about his motive or his Islamic identity. Would the same courtesy be shown a Christian who shot up three mosques? Why the coverup? Who is responsible for it?", "Three churches were shot up in the Shelbyville, TN area starting on the night of Sep 27, 2016. The Horse Mountain Church of Christ was shot 16 more times the night of Sep 29. The Philippi United Methodist Church along with another church was also struck by 7.62 x 39 rounds on the 29th. (7.62 x 39 rounds are consistent with an AK47 or a SKS rifle) The Bedford County Agriculture Center was also attacked with gunfire on the 29th, shattering the front glass. There were also reports of utility boxes being shot during this time.\"", "Although it is based on an actual incident, the Freedom Daily account is a bald-faced misrepresentation of the facts. Contrary to what is claimed, the 2016 Shelbyville church shootings did receive a fair amount of press coverage, in which it was, in fact, routinely reported that the sole suspect, Wendell Tobias Buchanan, was a \"recent convert to Islam,\" according to his family.", "What Wendell Tobias Buchanan was not, however, was a Somali refugee. No Somalis were involved or implicated in those attacks in any way.", "Freedom Daily's attempt to portray Shelbyville, Tennessee as a community torn asunder by violent foreign jihadists does not hold up to even the most basic scrutiny, trading instead on appeals to emotion and based on false reporting. Even the photographs in the article are fake, Chief Phillips told us. He is correct. An image supposedly showing downtown Shelbyville actually depicts the small town of Bell Buckle, 10 miles away. An uncaptioned photograph showing the police response to a public disturbance was actually taken in the aftermath of the 2015 Dylan Roof church shooting in Charleston, South Carolina.", "Based on the evidence we were able to amass, Shelbyville, Tennessee doesn't have a Somali refugee problem; Freedom Daily, on the other hand, does.", "Corrigan, Terence.   \"Prissy's Strange Version of the Truth.\"\r\n   Shelbyville Times-Gazette.   30 July 2017.", "Holly, Prissy.   \"Somali Muslims Take Over Small Tennessee Town And Force Absolute HELL On Terrified Christians.\"\r\n   Freedom Daily.   25 July 2017.", "Mosely, Brian.   \"Somali Refugees Find a Haven in Shelbyville.\"\r\n   Shelbyville Times-Gazette.   22 December 2007.", "Stakelbeck, Erick.   \"Somali Muslims Changing Small Town.\"\r\n   CBN.   19 May 2009.", "Trager, Kevin.   \"Family: Man Accused of Shooting Churches Not the Person We Know.\"\r\n   WSMV-TV.   26 October 2016.", "News Channel 5.   \"Suspect Arrested for Bedford Co. Shooting Spree.\"\r\n   2 October 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]