["By Jessica McDonald", "Posted on March 20, 2020 | Updated on March 27, 2020", "Following a flawed rollout of test kits in the U.S. for the new coronavirus, politicians have given inaccurate information related to the diagnostic tests distributed by the World Health Organization.", "Biden’s comments came during his one-on-one March 15 Democratic debate with Sen. Bernie Sanders, when he responded to a question about whether Trump was justified in complaining that inherited bureaucratic red tape hampered the administration’s response to COVID-19, the disease caused by the new virus.", "Biden, March 15: No, look, the World Health Organization offered — offered the testing kits that they have available and to give it to us now. We refused them. We did not want to buy them. We did not want to get them from them. We wanted to make sure we had our own.", "Biden is right that the U.S. wanted to make its own test, but he leaves out important context — including the fact that many countries with the scientific capability designed their own tests, and that the WHO test kits are largely meant for less wealthy countries with weaker health systems. And he’s wrong that the U.S. ever “refused” a test from the WHO.", "Trump’s claim appeared at the end of a March 17 press conference, when a reporter asked the president about Biden’s claim.", "Two other coronavirus task force members stepped in to respond, with coronavirus coordinator Dr. Deborah Birx discussing the importance of quality control and alluding to potential test defects, and Adm. Brett Giroir refuting the idea that the U.S. refused tests from the WHO.", "After both had spoken, Trump summarized things by saying, “So, number one, nothing was offered. Number two, it was a bad test. Otherwise, it was wonderful.” Trump is correct on the first point, but incorrect on the second — evidence indicates the test has performed well.", "Biden may have gotten the impression that the U.S. “refused” test kits from the WHO from a news report. A March 6 Politico story his campaign sent to us refers to the “Trump administration’s decision to forgo a World Health Organization test” and mentions that 60 countries received WHO tests. But Biden’s comments distort the situation.", "“To our knowledge, no discussions occurred between WHO and CDC (or other USG agencies) about WHO providing COVID-19 tests to the US,” WHO spokesperson Tarik Jasarevic told us in an emailed statement. “This is consistent with experience since the US does not ordinarily rely on WHO for reagents or diagnostic tests because of sufficient domestic capacity.”", "This point was also made by Giroir, a coronavirus task force member and the person in charge of coordinating diagnostic testing.", "Speaking in the same press conference in which Trump would incorrectly call the WHO test “bad,” Giroir said that when he became involved in the COVID-19 effort, he called the most “senior officials at the WHO as I could find,” and “as far as I can tell from sources that should know, no one ever offered a test that we refused.”", "And during a CNN/Facebook town hall on March 19, Mike Ryan, the executive director of the WHO’s Health Emergencies Programme, also debunked the notion.", "“WHO developed the tests mainly to support countries with weaker health systems,” he said, noting that the U.S. has a “fabulous” scientific system and “a wonderful capacity” to develop tests. “So no, we did not offer the tests to the U.S., which would be standard practice,” he added. “If we were asked, obviously, we would have responded.”", "The WHO told us that countries “did not have to pay” for the tests it distributed, which were produced by a manufacturer in Germany.", "Rangarajan Sampath, the chief scientific officer of the nonprofit Foundation for Innovative New Diagnostics, told us that the WHO tests are typically intended for low- and middle-income countries that lack the ability to test.", "In part, this is because any assay, or test, the WHO might choose to produce could be easily manufactured in the U.S. or European Union, Sampath said, so the agency doesn’t usually supply kits to those countries.", "Still, he said, any nation — even wealthy ones — can request a test kit from the WHO. “They don’t restrict them to low- and middle-income countries,” he said.", "The WHO did not share a list of the 120 countries that it said were sent nearly 1.5 million tests as of March 16, but a survey of agency statements reveals that many are concentrated in poorer parts of the world that have less scientific expertise than the U.S.", "Around 40 of them appear to be African Union countries, which the WHO’s director-general said had acquired the ability to test by Feb. 26 “using lab kits sent by WHO.” The WHO has also said it assisted 29 countries in the Americas — including some Caribbean islands and much of South and Central America — and nations in Southeast Asia with testing supplies and training.", "Countries the WHO has specifically named include Cameroon, Cote d’Ivoire, Congo, Egypt, Ethiopia, Gabon, Ghana, Kenya, Morocco, Nigeria, Tunisia, Uganda, Zambia and North Korea.", "Special attention has also been given to Iran, which on March 2 the WHO said it had supplied with 100,000 tests and on March 11 said it had given another 40,000 tests. That tally suggests that just under 10% of all the tests the WHO shipped went to Iran.", "Biden presents the U.S. decision to make its own test as a critical error. The Centers for Disease Control and Prevention did not respond to our questions about its testing decisions. But it’s not unusual for the U.S. to proceed in this manner, and the agency likely started creating its test before any other test protocols were publicly available.", "Sampath said it’s common for nations with the scientific know-how to develop their own diagnostics. And indeed, the U.S. is one of several countries, such as China, Japan, Thailand and France, that did so for COVID-19.", "As soon as the genome sequences of the new virus were released, Sampath said, various countries immediately started developing their own protocols and their own assays.", "And the CDC did develop a viable test very rapidly. It’s not clear exactly when the test was first ready, but the agency successfully used its own test to identify the nation’s first COVID-19 case on Jan. 20 and a CDC report suggests the test was operational at least two days earlier.", "As we’ve explained before, the CDC ran into trouble in February when it scaled up production of its test kits to send out to public health labs around the country. The agency attributed the problem to a manufacturing defect with one of the three sets of reagents used to identify the virus.", "A little over two weeks after announcing the problem, the agency provided a fix, telling labs that the problematic assay using the third set of reagents could be scrapped without sacrificing test accuracy. But the manufacturing snafu, along with other limitations on which tests could be used and which labs could do testing, delayed the expansion of the nation’s testing capacity. The U.S., however, was never without the ability to test for COVID-19.", "Sampath noted that even if the CDC had opted to use another test design, manufacturing errors could have still been a problem.", "“No matter which primers they were using,” he said, referring to one component of the test, “they could have had the same issue.”", "It’s worth pausing here to explain that the test the WHO has distributed is a modified version of the diagnostic test created by researchers at the Charité, a medical research institute in Berlin.", "As with the CDC test, the German test uses a molecular biology technique known as the polymerase chain reaction, or PCR, to scan through a patient sample to see if the virus is present. Both tests are largely the same, but the short passages of the viral genome that each test checks for are different.", "Because the test did not originate with the WHO, it is not fully accurate to call the test the “WHO test.”", "In a March 7 statement, Food and Drug Administration Commissioner Dr. Stephen Hahn claimed as much, saying that the “WHO does not have its own test that it is distributing globally,” and that the organization has “only posted on its website protocols from some test developers, such as the CDC.”", "It’s true that the WHO didn’t develop its own test from scratch, but as we have already relayed, the organization has distributed more than 1 million tests, which is what many people have called “the WHO test.” (And for the purposes of this article, when we refer to the WHO test or test kit, we are referring to the tests the agency has shipped around the world.)", "“The WHO selected this particular test for global distribution as it was modeled on the earliest published PCR protocol,” a WHO spokesperson told us, referring to the lab technique underpinning all of the molecular assays. The German protocol was first made available on Jan. 13 and announced in a press release on Jan. 16.", "On the WHO website, the German test is listed along with designs from six other countries, including the United States’ submission. A disclaimer notes that the order of the listing “is by country” and “does not imply any preference of WHO,” and that the protocols “have not yet been validated through a WHO process.”", "In other words, as Sampath told us, the WHO hasn’t endorsed a particular test and hasn’t said one is better than another, even though it did choose one to mass produce.", "That brings us to how well the WHO test performs — and Trump’s false claim that the test was “bad.”", "Trump may have concluded this from the way Birx responded when asked about Biden’s claim. She emphasized quality control of testing kits and said, “It doesn’t help to put out a test where 50% or 47% are false positives.”", "False positives are instances in which a test says a person has the disease when a person doesn’t — and should test negative. In the reverse problem, a person who has the disease can test negative when they are actually positive, in what’s called a false negative.", "But there is no evidence that the WHO test doesn’t work well. Sampath, whose organization is now testing different COVID-19 assays from various manufacturers to provide independent verification for countries, said there are “no known issues” with the test. The WHO’s Ryan also said in a CNN interview that the test has performed “extremely well in the field, in multiple countries.”", "“The test has been validated in three external laboratories, adapted by WHO and manufactured in line with international quality standards,” a WHO spokesperson said. “It has shown consistently good performance in laboratory and clinical use, and neither a significant number of false-positive nor false-negative results have been reported.”", "The White House and the vice president’s office did not respond to our requests for comment or clarification. But Birx told the New York Times that the test she alluded to with a 47 to 50% false positive rate was not the WHO test, but rather a diagnostic used in China.", "A study there found that 47% or more of people who didn’t have symptoms and had been in close contact with someone with COVID-19 might have been improperly flagged as having the disease. The paper, however, has been retracted, and the English-language abstract didn’t report the test’s overall false positive rate.", "NPR reported the retraction after FDA Commissioner Stephen Hahn referenced the study again in an on-air interview. According to NPR, the retraction occurred a few days after publication on March 5. The retraction was not indicated on PubMed, the National Library of Medicine’s biomedical literature database, until March 26.", "Updated, March 24: We added a video to this story.", "Updated, March 27: We have updated this story to include information about the retraction of a Chinese study about a COVID-19 diagnostic test. When we published our story on March 20, and even after we updated it on March 24, PubMed had yet to indicate that the paper had been retracted.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]