["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Roseanne Barr’s sitcom, \"Roseanne,\" was canceled by ABC after Barr posted a racist tweet about Valerie Jarrett, an African-American and adviser to Barack Obama during his presidency. But a recent Facebook post accuses the network of double-standards.", "\"Roseanne Barr compares Valerie Jarrett to a primate, is instantly fired and publicly shamed,\" it says. \"Whoopie (sic) Goldberg calls Judge Jeanine Pirro Trump’s sand ni**er.. Keeps job & is applauded by ABC.\"", "This post, which was published on Facebook on July 22, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Pirro and Goldberg definitely had an argument, but there’s no evidence that Goldberg ever used a racist slur against Pirro. Here’s what’s true — and what’s not.", "The revival of \"Roseanne\" was canceled in May 2018 hours after Barr, the show’s star, tweeted this about Jarrett: \"muslim brotherhood & planet of the apes had a baby=vj.\"", "\"The tweet sparked a public firestorm, including from ‘Roseanne’ star Sara Gilbert,\" ABC News then reported. \"It also prompted Wanda Sykes, a consulting producer, to quit the show in the leadup to the cancellation.\"", "Channing Dungey, the president of ABC Entertainment, is quoted in the story as saying the tweet was \"abhorrent, repugnant and inconsistent\" with ABC values.", "A couple months later, in July 2018, Fox News host Jeanine Pirro appeared on the ABC show \"The View.\" Goldberg, a co-host on the show, got into a yelling match with Pirro after Pirro \"appeared to suggest Goldberg suffered from ‘Trump Derangement Syndrome,’\" the Washington Post reported.", "Things escalated from there.", "\"Whoopi, you know what’s horrible?\" Pirro said. \"When people who shouldn’t be here end up murdering the children of American citizens.\"", "\"You know what’s horrible?\" Goldberg said. \"When the president of the United States whips up people to beat the hell out of people. Say goodbye! I’m done.\"", "You can watch the exchange here.", "The show went to commercial and when it came back Goldberg apologized. Pirro was no longer there, but Pirro told fellow Fox News host Sean Hannity that the fight continued backstage, where she said Goldberg used the F-word at her and spit at her. Goldberg confirmed she used the F-word but denied spitting, and she said that Pirro \"called everybody at the table a name I cannot repeat on TV.\"", "Lauri Hogan, a spokeswoman for ABC, told PolitiFact that Goldberg did not say the slur the Facebook post claims.", "We couldn’t find any credible corroborating evidence online that Goldberg said it, nor did we find such an article in the Nexis news database.", "We found no evidence that Goldberg called Pirro a racist insult. We rate this post False.", "Facebook post, July 22, 2019", "The New York Times, \"After racist tweet, Roseanne Barr’s show is canceled by ABC,\" May 29, 2019", "ABC News, \"‘Roseanne’ canceled after Roseanne Barr’s racist tweet about Valerie Jarrett,\" May 29, 2018", "The Washington Post, \"Whoopi vs. Judge Jeanine: ‘Trump Derangement Syndrome’ comment sparks yelling match on ‘The View,’\" July 20, 2018", "The View, \"Judge Jeanine Pirro on new book & more,\" July 19, 2019", "The Hill, \"Whoopi Goldberg: Pirro wasn’t kicked out, she left cursing at staff,\" July 20, 2019", "Email interview with Lauri Hogan, entertainment spokeswoman, ABC, July 25, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]