["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On Nov. 12, 2020, an image graphic supposedly containing a statement from U.S. first lady Melania Trump concerning her \"final Christmas\" in the White House started to circulate on social media. The statement came as a surprise to some, since her husband, U.S. President Donald Trump, had not acknowledged President-elect Joe Biden's victory and had filed lawsuits contesting the results of the 2020 presidential election.", "Did the first lady really concede defeat as Trump continued to contest the election results? No, this is not an official statement from the White House or Melania Trump.", "The above-displayed image comes from the website whitehouse.gov1.info. While this website contains information pertaining to White House events (such as Christmas decorations or the Easter Egg Roll), it is not an official government website. When this website writes \"2020 marks the final holiday season for the Trump White House,\" they do so to acknowledge that Biden is the projected winner of the 2020 election and that the Trump family is expected to leave the White House on Jan. 20, 2021. This is not, however, an official White House statement.", "Shortly after images from this page went viral, whitehouse.gov1.info added a brief disclaimer at the top of their holiday page:", "\"Note to Readers: Joe Biden won the election which makes this the final holiday season for the Trump White House. This is not the official White House website as noted in the footer below.\"", "As of this writing on Nov. 13, 2020, Melania Trump has not acknowledged the results of the 2020 election and has not reached out to incoming first lady Jill Biden about transitioning to the White House.", "CNN writes:", "First lady Melania Trump, much like her husband, is operating as though he didn't lose last week's election: She has yet to reach out to first lady-elect Jill Biden, a source familiar told CNN on Tuesday.", "On this day four years ago, Melania Trump had tea at the White House and a tour of the executive residence, at the invitation of then-first lady Michelle Obama, as is customary. But this time around, any movement towards a transition of the East Wing and the Executive Residence has not begun.", "Instead, another source with knowledge of Melania Trump's daily schedule said there is very little in the way of change taking place at all, and most of the focus of the first lady's office remains on day-to-day meetings and upcoming holiday planning.", "The president will not leave the White House until Jan. 20, 2021, which means that Melania Trump will have one final Christmas in the White House. Although there have been reports that the holiday decorations will go up as normal, the first lady has previously said that this tradition — decorating the White House for Christmas — is not her favorite part about being first lady.", "In October 2020, Stephanie Winston Wolkoff, a former top aide for the first lady, released a recording of Melania saying \"who gives a fuck about Christmas stuff.\"", "The New York Times writes:", "Melania Trump, the first lady, delivered a profanity-laced rant about White House Christmas decorations and mocked the plight of migrant children who were separated from their parents at the border, during a 2018 conversation secretly taped by her former aide and close confidante.", "“I’m working like a — my ass off at Christmas stuff,” Mrs. Trump laments to Stephanie Winston Wolkoff, who served as a top aide in the East Wing and has just published a tell-all book, “Melania and Me.” Mrs. Trump continues, “You know, who gives a fuck about Christmas stuff and decoration?”", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]