["Republican U.S. Rep. Glenn Grothman tweeted that “not even 24 hours into the new session of Congress and Democrats are voting to send our tax dollars overseas to fund abortions.” (Handout photo.)", "On Jan. 3, 2019, the House of Representatives -- fresh under Democratic control -- passed a bill in an effort to reopen government departments that were affected by the partial shutdown.", "Ultimately, that bill didn’t go anywhere, and the shutdown was resolved differently.", "But we wanted to return to that piece of legislation and a claim made by U.S. Rep. Glenn Grothman, R-Glenbeulah. His view: Democratic leaders sneakily inserted U.S. funding for overseas abortions into the bill.", "\"Not even 24 hours into the new session of Congress and Democrats are voting to send our tax dollars overseas to fund abortions,\" he tweeted Jan. 4, 2019.", "He expanded on that, a bit, in a statement issued Jan. 15, 2019:", "\"Democrats opened the new Congress by, on day 1, surreptitiously inserting a provision into H.R. 21 that will overturn (Protecting Life in Global Health Assistance) and allow the billions of dollars of aid we send to other countries to be used for abortions.\"", "Is Grothman correct that a provision in the first bill passed by House Democrats would \"allow the billions of dollars of aid we send to other countries to be used for abortions\"?", "Not exactly.", "The evidence", "When we asked for backup for the claim, Grothman spokesman Timothy Svoboda cited the text of the bill and noted it \"was sponsored by Nita Lowey and placed on the House floor by Democrat leadership — hence ‘Democrats.’ \"", "Svoboda also highlighted parts of the bill:", "Section 7071(a): The bill repeals Protecting Life in Global Health Assistance (PLGHA) (expanded Mexico City Policy) (pg. 1021-1022)", "PLGHA requires foreign nongovernmental organizations (NGOs) to agree, as a condition of their receipt of global health assistance grant money, not to perform or actively promote abortion as a method of family planning.", "Reinstated and modernized by President Trump, the policy now applies to all global health programs (approx. $8.8 billion based on FY17 global health assistance funding levels). If NGOs choose to stop doing abortions, they can remain eligible for federal grant money. The choice has been up to the NGO – either change business practices or forego funding from the United States.\"", "On the surface of it, Grothman seems to be correct.", "But there is more to it than that.", "Reagan-era Roots", "The program in question has been part of federal policy off and on for decades, with the policy frequently shifting between presidents.", "When originally announced by President Ronald Reagan in 1984 it was dubbed the \"Mexico City Policy\" after the site of a United Nations conference on global population. Critics called it the \"global gag rule.\"", "\"What the policy does is it requires foreign NGOs that receive U.S. government health assistance to certify that they are not using U.S. funds or any other funds to do several things,\" said Emily Maistrellis, a senior program officer for the Program on Global Health Justice and Governance within Columbia University’s Mailman School of Public Health. \"One is provide abortion as a method of family planning. Another is to counsel and refer women to an abortion in a context where abortions are legal.\"", "Organizations also can’t advocate or lobby for the continued legality or push for the legality of abortion in their country. (The policy does not apply to cases of rape, incest or if childbirth endangers the mother’s life.)", "President Bill Clinton revoked the policy in 1993, claiming it undermined efforts to promote safe family planning abroad. President George W. Bush reinstated it. Then President Barack Obama rescinded it.", "In 2017, President Donald Trump reinstated it -- but went further. He expanded it under a new name: Protecting Life in Global Health Assistance.", "The original version applied to funding for family planning programs.", "\"The policy in its expanded version is applied to any global health funding,\" Maistrellis said. \"It’s expanded in terms of dollar amount. It’s expanded in terms of areas of health and the potential (foreign) NGOs that will be affected.\"", "Barriers to funding abortions", "So, had the House Democrats been successful with their measure, and undid the new policy, would it mean U.S. aid money could then go to fund abortions?", "No.", "Before the Mexico City Policy, there was a budget amendment enacted in 1973 that states \"no foreign assistance funds may be used to pay for the performance of abortion as a method of family planning or to motivate or coerce any person to practice abortions.\"", "The so-called \"Helms Amendment\" was named for the late U.S. Sen. Jesse Helms, R-North Carolina.", "That remains in place and, according to Maistrellis, is \"scrupulously applied\" by federal agencies.", "If that’s the case, why has the Mexico City Policy been put in place and undone so many times over the years?", "That relates to a wrinkle in how it applies.", "Before the Mexico City Policy, U.S. aid recipients could use non-U.S. funds to engage in abortion-related activities, but had to keep it separate from U.S. aid money. So, when the policy is not in effect, countries that pursue abortion-related activities can still get U.S. family planning money. They just can’t mix the two pots together.", "When the policy is in place, if foreign NGOs want to receive any family planning funds from the U.S., they cannot use any other funding for abortion-related activities.", "Meanwhile, under Trump’s expanded policy, any U.S. health funding -- not just family-planning related money -- is affected in this way.", "That’s the policy in place today.", "Our rating", "Grothman claimed a provision in a bill backed by House Democrats would \"allow the billions of dollars of aid we send to other countries to be used for abortions.\"", "Part of the language in the bill would have extended a long-running back-and-forth on the Mexico City policy. But the so-called Helms Amendment would have remained in place.", "Therefore, U.S. tax dollars could not be used to fund abortions abroad.", "We rate Grothman’s claim False.", "Phone interview with Emily Maistrellis, 2/4/2019", "The 1949 Geneva Conventions: A Commentary, Google Books", "House Bill 21, text, 1/18/2019", "Vox, House Democrats officially unveil their first bill in the majority:a sweeping anti-corruption proposal, Jan 4., 2019", "Congressman Glenn Grothman, Facebook page", "Congressman Glenn Grothman, website", "E-mail correspondence with Tim Svoboda, Jan. 30, 2019", "C-SPAN, House Session Part 3", "CBS, What is the Mexico City Policy?, Jan. 23. 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]