["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A faked photo allegedly from a flooded street in Houston has been used online since 2011.", "A viral photo being spread online in the wake of Hurricane Harvey of a shark swimming down a Houston street is actually a hoax that has been passed around for years.", "\"Believe it or not, this is a shark on the freeway in Houston, Texas. #HurricaneHarvy,\" read a tweet from @Jeggit on Aug. 28, 2017. The photo appeared to show a shark swimming in the street, as shown from the driver’s seat of a vehicle.", "Believe it or not, this is a shark on the freeway in Houston, Texas. #HurricaneHarvy pic.twitter.com/ANkEiEQ3Y6", "As of this writing, the image had been liked more than 36,000 times and retweeted more than 28,000 times.", "But it’s a fake image, which appeared to have been first circulated at least as far back as 2011. The photo turned up after Hurricane Irene struck Puerto Rico. It linked to an Aug. 25, 2011, photo on imgur.com showing the big fish swimming alongside what looks like an SUV.", "Then it came back in 2012, with social media users claiming it was taken in New Jersey during Hurricane Sandy.", "In 2015, this very same shark had already been spotted in Houston after severe floods.", "Just a shark swimming on the streets in Houston 😳 pic.twitter.com/PWfaZfHixw", "Then it somehow swam to North Myrtle Beach, S.C., after Hurricane Joaquin later in 2015.", "So where did this really come from? The PhotoShopped image appeared to have taken the shark from a photo that ran in Africa Geographic in 2005.", "Origin of shark in interstate floodwaters: https://t.co/tKD1QECAig The fake photo first appeared in 2011 after #Irene struck Puerto Rico. pic.twitter.com/qbCXRDZ39C", "That picture showed a great white shark swimming behind a kayak, and folks on Reddit noticed the similarities back in 2011.", "Don’t believe this fish tale, because it’s a hoax that has been luring people for years. We rate it Pants On Fire!", "Washington Post, \"Hurricane Irene: ‘Photo’ of shark swimming in street is fake,\" Aug. 26, 2011", "Twitter, schlager_jake tweet, May 29, 2015", "Twitter, Jeggit tweet, Aug. 28, 2017", "Twitter, WeatherHustle tweet, Aug. 28, 2017", "Vice.com, \"'Shark Swims Down a Flooded Street' Is a Viral Hoax That Won't Die,\" Aug. 28, 2017", "Daily Beast, \"No, a Shark Isn’t Swimming Down a Houston Freeway,\" Aug. 28, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]