["Sen. Kamala Harris, D-Calif., speaks at a town hall in Hemingway, S.C., on March 8, 2019. (AP)", "Sen. Kamala Harris, D-Calif., has attracted attention with a proposal to boost average teacher pay by $13,500 if she’s elected president.", "To promote that policy, Harris sent a tweet that said, \"In 30 states, average teacher pay is less than the living wage for a family of four. The teacher pay gap is a national crisis. Sign your name next to mine if you agree.\"", "In 30 states, average teacher pay is less than the living wage for a family of four. The teacher pay gap is a national crisis. Sign your name next to mine if you agree: https://t.co/qiTuiwf9ri", "Is it really true that \"in 30 states, average teacher pay is less than the living wage for a family of four\"? Studies have argued that teacher pay has been stagnating in recent years, but it’s worth noting the particular framing Harris used.", "The Harris campaign pointed us to a study published in 2018 by Education Resource Strategies (ERS), an education consulting group, that compared average teacher salaries to a living wage, concluding that in more than half of states, average teacher salaries are below a family living wage for that state. A \"living wage\" refers to a calculation pioneered by the Massachusetts Institute of Technology that determines, based on geographic location, how much income is needed to meet a basic level of existence. It includes costs like food, housing, child care and health care. (Some federal poverty measures do not include all of these criteria.)", "The summary can be seen in this chart from the report.", "Case closed? Before deciding, let’s take a closer look at what’s included in salary data that ERS used.", "First, the analysis doesn’t include benefits, which for unionized teachers can be more favorable than benefit packages in other types of jobs.", "Second, the data addresses pay earned during nine- or 10-month contracts that are typical for school systems; it does not include additional income the teacher may be able to earn during the summer. Yet this nine- or 10-month income is being compared to a living wage calculation based on a 12-month year.", "If a teacher works during the summer, their salary total would be higher, possibly rising above the living wage. The amount would vary by state. \"In Georgia, the average teacher would need to make only $735 over the summer, but in Colorado it would be over $12,000,\" said ERS spokeswoman Karen Silverman.", "And third, ERS’ data does not account for a spouse’s income, nor does it  incorporate an analysis of teachers who are single and have no children. Both these factors could determine the amount of a teacher’s applicable living-wage standard.", "How much should these caveats matter in evaluating Harris’ tweet?", "Jesse Rothstein, director of the Institute for Research on Labor and Employment at the University of California-Berkeley, said concerns that the data doesn’t account for these circumstances are legitimate but amount to nitpicking.", "On the question of summer income, for instance, \"there is a long debate on this question,\" he said. \"Teachers in practice do quite a bit of work over the summer to prepare for school and in part because teachers are rarely able to find highly-paid summer jobs.\"", "Tara Sinclair, an economist at George Washington University, said it’s important not to ignore the gender context when discussing a field that is overwhelmingly female.", "\"It's an unfair gender bias that potential income from spouses comes up immediately in discussions of teacher pay when it might not come up in discussions of the pay of other occupations — imagine police officers or firefighters for example,\" Sinclair said. \"This comparison is about what teachers are paid, not what households with teachers in them earn.\"", "Sinclair also said that considering the size of families can also be problematic. \"It seems like a slippery slope when talking about pay since it's illegal to ask about marital status or children in hiring, so that seems inappropriate to consider for pay as well,\" she said.", "Sinclair said she would prefer to see public officials compare teachers’ salaries to the average salaries of the college-educated. Still, she said, there is value in what Harris said, because it supports the idea that \"teaching is a profession that should be valued more in society than it currently is.\"", "Harris said, \"In 30 states, average teacher pay is less than the living wage for a family of four.\"", "Since a living wage is in part calculated based on a person’s household and family circumstances, the comparison Harris used excludes such factors as non-salary benefits, summer income, working spouses, and smaller family sizes. Harris's premise is that teacher pay alone should support a family of four. In the context she specifies, her statement is accurate.", "We rate the statement Mostly True.", "Kamala Harris, tweet, March 26, 2019", "ERS, \"Low Teacher Salaries 101,\" June 2018", "Center for American Progress, \"Mid- and Late-Career Teachers Struggle With Paltry Incomes,\" July 23, 2014", "Learning Policy Institute, \"Teacher Turnover: Why It Matters and What We Can Do About It,\" August 2017", "Economic Policy Institute, \"The teacher pay penalty has hit a new high,\" Sept. 5, 2018", "Massachusetts Institute of Technology, Living Wage Calculator, accessed March 29, 2019", "National Education Association, \"Rankings of the States 2017 and Estimates of School Statistics 2018,\" April 2018", "National Center for Education Statistics, \"Table 211.60. Estimated average annual salary of teachers in public elementary and secondary schools, by state: Selected years, 1969-70 through 2015-16,\" accessed March 28, 2019", "New York Times, \"Kamala Harris’s First Campaign Policy: A Raise for Teachers,\" March 26, 2019", "Education Week, \"Average Teacher Salary Is Below the Living Wage in Half the Country, Report Says,\" June 14, 2018", "Email interview with Karen Silverman, spokeswoman for ERS, March 29, 2019", "Email interview with Barbara McKenna, director of media relations at the Learning Policy Institute, March 28, 2019", "Email interview with Jesse Rothstein, director of the Institute for Research on Labor and Employment at the University of California-Berkeley, March 28, 2019", "Email interview with David Bills, education professor at the University of Iowa, March 28, 2019", "Email interview with Tara Sinclair, George Washington University economist, March 30, 2019", "CPRE Research Reports, \"Seven Trends: The Transformation of the Teaching Force – Updated October 2018,\" accessed April 1, 2019.", "Email interview with Ian Sams, spokesman for Kamala Harris, March 28-29, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]