["The 45-second video was published here on Facebook on November 27, 2020.", "The post’s Hindi-language caption translates to English as: “This video shows the funeral procession of Congress leader Ahmad Patel in Gujarat's Bharuch city. It should be noted that there is a protocol in place for the last rites of a person who died of COVID-19, but that guidelines are not being followed here.”", "Ahmed Patel, a top Indian National Congress (INC) party politician died on November 25, 2020 after being diagnosed with Covid-19. He was 71.", "Patel’s funeral was held at his birthplace, Piraman, in Gujarat's Bharuch district, on November 26, 2020.", "The video was also shared here, here, here and here on Facebook, alongside a similar claim.", "The claim is false.", "A keyword search found this video published on YouTube on November 25, 2020 by Indian media organisation Hindustani Reporter, which appears to show the same casket seen in the misleading posts.", "The video description states: “Jamil Shaikh’s cremated; funeral drew a massive crowd.”", "Jamil Shaikh was a politician of the Maharashtra Navnirman Sena (MNS) party.", "Below is a screenshot comparison between the coffin seen in the misleading posts (L) and the coffin in the Hindustani Reporter YouTube video (R):", "According to this report by local newspaper Mumbai Mirror, Shaikh, who served as the president of a civic ward in Maharashtra’s Thane city, was shot dead by unidentified assailants on November 23, 2020.", "A livestream of Ahmed Patel’s funeral procession was shared here on the INC’s official Twitter account, dated November 26, 2020.", "The coffin seen in the Twitter video does not match the coffin that can be seen in the video in the misleading posts.", "Below is a screenshot comparison between the coffin seen in the misleading post (L) and the coffin in the INC’s video (R):", "Patel’s funeral was reported by several Indian media channels, including The Hindu here, the Ahmedabad Mirror here and Gujarat Tak here. None of the photos and videos published in these reports show coffins that appear similar to that in the misleading post.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]