["About this rating", "In June 2020, amidst nationwide protests initially triggered by the police-custody death of George Floyd, an unarmed Black man, in Minneapolis, a Facebook user posted a (subsequently deleted) account claiming that her local Walmart outlet in Grove, Oklahoma, was repeatedly playing a message over the store's loudspeaker stating that \"Walmart understands white privilege exists and supports Black Lives Matter\" and \"acknowledge[s] the injustices committed by law enforcement agencies\":", "This happened to Hanna brown in grove walmart posting so people can share the crap out of this", "My husband is a good man. My husband is not perfect. My husband makes mistakes. My husband is the type of person that would help anyone at any time. My husband is a police officer. Today I watched the light in my husband and my son's eyes leave. Today I had to defend one of the bravest men I have ever met.", "Let's back up a bit. Today is Sunday, June 14th, 2020. Our family went to church as we do every Sunday. After church, we ran to Walmart in Grove Oklahoma. This is not unusual for our family, in fact, this is almost always a weekly trip. Someone has forgotten something and we zip over to Walmart and pick up what we need.", "Today changed that for our family. We will never return to Grove Walmart or any other Walmart. While in the store a message repeatedly played over the loudspeaker. This message stated that Walmart understands white privilege exist and supports Black lives matter. It went on to say how they support the black community and acknowledge the injustices committed by the law enforcement agencies. I watched my nine-year-old son whip his head around and the light goes out in my husband's eyes. We decided to leave the store. My husband was just going to leave and not say anything to anyone. But I had to show my son that his father was a good man and that sometimes we have to stand up for what is right.", "I asked our check out person if she would please get a manager for us. She said why maybe I can help. I said no please just call a manager. She refused. She looked at my husband and asked him to tell her why I wanted a manager. My husband replied that the message on the speaker is directly against his line of work and that it was not friendly towards the police department. She responded with I am no longer comfortable speaking with you. He said that is fine but you asked what was wrong so I told you. She said I did ask but I no longer want to know. I said that it is fine could you please call the manager my husband and I would like to speak with the manager. He is a police officer and would like to address this issue. At this time she said that she would not serve us at all because he was a police officer and she just walked away. She left us with half of our order rang up. I looked at the lady behind me with tears in my eyes and she told my husband thank you for your service.", "Some other checkers came and finished the purchase. A few minutes later two male employees came up. The manager asked what happened. When we told him he said that she had the right to not serve anyone. My husband agreed with that. My husband told the manager that he didn't expect Walmart to back Blue lives but he did think of the very least for impartiality. The manager proceeded to tell us that corporate feel like there are more black people than law enforcement and that money is more important to the corporation than law enforcement and their families. He said this was Walmart's corporate policy.", "I asked the man so Walmart is not going to support law enforcement officers at all? His response was no not as long as they were making more money from the people in this movement. So this tells me that they only care about money.", "The manager said that people at corporate make the decisions and they have to play the message. Another officer came up and showed his badge asked about the broadcast and we told him about how we were treated and that Walmart corporation feels that law enforcement can be refused service just for being police officers his face registered utter shock.", "My son was devastated. We were treated like criminals. My husband was devastated. This is what These black lives matter and defund the police is causing. This is not okay.", "I am a proud LEO wife, I am proud of my husband. My husband may save that lady someday but still, she will hate him.", "But as the Grand Lake News (and others) reported, the referenced in-store audio recording was a message from Walmart President and CEO Doug McMillon that acknowledged the \"intense sense of pain, fatigue and frustration\" being felt by \"our black and African American associates and communities.\" It made no mention of Black Lives Matter or law enforcement or \"white privilege,\" nor did it specifically endorse any particular group or movement:", "Here’s a special message from Walmart President and CEO Doug McMillon:", "Over the past few days I have personally heard from many of our associates, leaders and members of the Walmart community. Overwhelmingly, people are hurting. There is an intense sense of pain, fatigue and frustration. Let me say clearly to our black and African American associates and communities, we hear you, we see you, I want you to know you are valued. You are loved members of our family. We need you to know you are not hurting alone, that I and others are hurting with you.", "“So what now? Where do we go from here? Until we as a nation confront and address these hard realities, we’ll never achieve the best of what we can be. What does this mean for us, for Walmart? Words and feelings matter, but they are not enough. More action is required. We’ll find new ways to accelerated the desired changes inside our company and we’ll also find way that our business can influence real change in our country. To learn more about how we’re working to advance fairness, equity and justice, visit corporate.walmart.com/equity.", "Other Facebook users visited the same Walmart and recorded the audio being played in-store to verify its content, and posted material that cast doubt on several other aspects of the original claim:", "Goff, Chloe.   \"Check Out the Facts, Misquoted Walmart Audio Causes Viral Post.\"\r\n    Grand Lake News [Grove, OK].   15 June 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]