["Sen. John McCain, trying to make a case at a church forum that Americans should feel protective of the former Soviet republic of Georgia, cited its significance in Christian history.", "\"I am very saddened here to be with you and talk about Russian re-emergence in the centuries-old ambition of the Russian Empire to dominate that part of the world,\" McCain told the Rev. Rick Warren at Saddleback Valley Community Church in California on Aug. 16, 2008. \"Killings, murder, villages are being burned, people are being wantonly ejected from their homes. The latest figures from human rights organizations — 118,000 people in that small country. It was one of the earliest Christian nations. The king of then-Georgia in the third century converted to Christianity.\"", "McCain characterized Georgia similarly on other occasions.", "\"Georgia is an ancient country, at the crossroads of Eastern Europe and Central Asia, and one of the world's first nations to adopt Christianity as an official religion,\" McCain said in a campaign statement on Aug. 11, 2008.", "It is true that what is now Eastern Georgia, then known as Kartli, adopted Christianity quite early.\n\nSt. Nino\n\n\n\n, the Apostle of Georgia, introduced Christianity to the country in the 300s, converting King Marian III in 314, according to Ronald Suny, a professor of history at the University of Michigan and author of the 1988 book\n\nThe Making of the Georgian Nation.", "\"When the king converted he forced everyone else to become Christian,\" Suny said. \"That's the year before the Roman Empire became Christian.\"", "So yes, Georgia was indeed an early adopter of Christianity. Note, however, this did not happen in the third century as McCain said. The first century lasted through the year 100, the second through 200, and the third through 300. Georgia became a Christian state in 314, which was the fourth century.", "Also, scholars quibble with McCain's use of the word \"nation.\" In common parlance and under some dictionary definitions, a nation can be any territorial division. But a more subtle understanding is a group of people who believe they are entitled to some form of political representation, and thus give authority and legitimacy to a government. This concept arose in the 18th and 19th centuries. Prior to that, there were empires, dynastic states, theocracies, kingdoms and so forth, but not nations.", "\"To claim that whatever entity 'Georgia' may have been in the third century was a 'nation' is factually anachronistic,\" John Pilch, a professor of biblical literature at Georgetown University told us in an e-mail exchange. (Furthermore, he said, the word \"Christian\" was not fashionable at the time of the Georgian king's conversion — Christians at that time might have referred to themselves as \"followers of the Way.\")", "These are quibbles though. A fair reading of the thrust of McCain's claim is that the place we call Georgia was an early adopter of Christianity, and that's true. He didn't use the word \"nation\" perfectly and he flubbed his centuries, but his claim is still Mostly True.", "FirstRead,\n\nMcCain Makes Statement on Georgia\n\n, Aug. 11, 2008, accessed Aug. 19, 2008", "Catholic.org,\n\nSt. Nino\n\n, accessed Aug. 19, 2008", "Interview with Ronald Suny, professor of history at the University of Michigan, Aug. 19, 2008", "E-mail exchange with John Pilch, professor of biblical literature at Georgetown University, Aug. 18, 2008", "E-mail exchange with Michael Naydan, professor of Ukrainian studies, Germanic and Slavic languages and literatures at the Pennsylvania State University, Aug. 19, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]