["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Marco Rubio, R-Fla., appeared on the Jan. 12, 2014, broadcast of \"Face the Nation.\"", "The war on poverty would be more effective if states had more control over federal programs such as Head Start, says U.S. Sen. Marco Rubio, R-Fla.", "In an interview with Rubio on CBS’ Face the Nation, host Bob Schieffer pointed out this approach resembles the optional Medicaid expansion under the Affordable Care Act. Right-leaning leaders in several states rejected federal money to cover more residents through the federal-state program.", "\"What if these states opt out of these programs?\" Schieffer asked.", "Obamacare is different, Rubio replied.", "\"Well, here’s the distinguishing factor. Under Obamacare, when you turn Medicaid over to the states, what you're saying to them is, the money will be available up front for the expansion for a few years,\" he said. \"Then, the money will go away, but you get stuck with the unfunded liability. I’m not saying we should do that.\"", "Is Rubio correct about the federal money for expanding Medicaid going away after a few years?", "Somewhat.", "The Affordable Care Act aimed to expand access to health insurance for the nation’s uninsured residents. The architects of the law envisioned an expansion of Medicaid in each state to cover low-income adults up to 138 percent of the federal poverty level, which in 2013 was $15,856 for an individual or $26,951 for a family of three in 2013.", "The Supreme Court ultimately upheld the law as constitutional, but justices struck down the mandatory Medicaid expansion. That left it to state leaders to decide whether to offer more residents coverage through the jointly administered program.", "Twenty-three states are not expanding Medicaid, including Texas and Florida, states with high uninsured populations, according to the Kaiser Family Foundation. On the other side, 26 states including the District of Columbia are implementing the expansion in 2014, and two states will move ahead with an expansion after the first year.", "For conservative governors in Ohio, Michigan and Arizona, the deal offered by the federal government to expand was too good to pass up.", "The federal government will cover 100 percent of the cost of adding new adult Medicaid beneficiaries from 2014 to 2016.", "The federal government will scale down its payments to 95 percent in 2017, 94 percent in 2018, 93 percent in 2019, and 90 percent in 2020, according to the National Conference of State Legislatures.", "The 90 percent level is permanent. States will not have to shoulder more than 10 percent of the cost after that, unless Congress passed a law to change the ratio.", "Our ruling", "Rubio said, \"Under Obamacare, when you turn Medicaid over to the states, what you're saying to them is, the money will be available up front for the expansion for a few years. Then, the money will go away, but you get stuck with the unfunded liability.\" His office did not respond to us.", "The federal government will only pay 100 percent of the costs of expanding Medicaid for three years starting in 2014. But Rubio leaves a misleading impression with viewers that all of the money just goes away. The federal government plans to bring down its share to a permanent funding level of 90 percent.", "Rubio's statement contains an element of truth, but ignores critical facts that would give a different impression. We rate it Mostly False.", "CBS Face the Nation transcript", "Kaiser Family Foundation, Analyzing the Impact of State Medicaid Expansion Decisions, July 2013", "Kaiser Family Foundation, Status of State Decisions on the Medicaid Expansion Decision, updated December 2013", "U.S. Department of Health and Human Services news release, \"HHS finalizes rules guaranteeing 100 percent funding for new Medicaid beneficiaries,\" March 2013", "National Conference of State Legislatures, Medicaid and the Affordable Care Act, June 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]