["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a ceremony honoring law enforcement officers killed in the line of duty, President Donald Trump underlined the threat of MS-13 gang members and his administration’s efforts to deport them.", "\"Recently, MS-13 gang members called for the assassination of New York City police officers so the gang could quote, ‘take back the streets.’ They got it wrong. We are the ones who are taking back the streets. We are getting them out of our country by the thousands,\" Trump said May 15. \"Every week we're setting new records on — we have a ‘catch and release’ program, too. It’s called we catch them and we release them in the country they came back from, we are getting them out. Or we are putting them in prison.\"", "There are an estimated 10,000 MS-13 gang members in the United States. Not all are immigrants. Some are U.S. citizens who can’t be deported.", "Still, we wondered about Trump’s claim that MS-13 gang members are being deported \"by the thousands.\"", "We found that thousands of gang members have been deported under Trump’s administration. However, it’s unclear how many of them were MS-13 gang members, because U.S. Customs and Immigration Enforcement does not track removals by specific gang affiliation. An expert who researches gangs and criminal justice said there is a lengthy process between a gang member’s arrest and deportation.", "You may not realize this, but as a nonprofit news organization, we depend on — and answer to — you. Your support directly impacts our abilility to provide objective reporting on issues that matter.\n\nDonate to our Spring Campaign. Go on the record as saying facts matter!", "ICE does not track gang removals by specific gang, but the agency does specifically target MS-13 members for arrest and removal on the basis of their immigration violations, said Matthew Bourke, a spokesman for the agency.", "Bourke said 5,396 gang members were removed in fiscal year 2017 (which includes about four months of the Obama administration, running from Oct. 1, 2016 through Sept. 30, 2017).", "From Oct. 1, 2017 through Dec. 16, 2017 (the latest data available), 1,082 gang members were removed.", "It’s impossible to determine how many of them were MS-13 gang members.", "There is other data indicating the Trump administration’s efforts to deport MS-13 gang members, but that doesn’t necessarily support Trump’s claim.", "ICE’s Homeland Security Investigations division arrested nearly 800 MS-13 gang members in fiscal year 2017.", "ICE’s investigations division arrested 405 MS-13 gang members, Bourke said, citing first-quarter data for fiscal year 2018.", "\"The time it takes to remove a validated gang member can vary depending on whether the alien has started removal proceedings; whether the alien has a final order of removal; or whether the alien has pending criminal charges in a local jurisdiction,\" Bourke said.", "It’s unlikely that all of the MS-13 gang members arrested in 2017 were already deported, because of the time required to remove someone after an arrest, said Jorja Leap, an anthropologist and adjunct professor at UCLA Luskin School of Public Affairs who researches gangs and criminal justice.", "\"Most members of MS-13 that I know that have been arrested are being held in court pending trial,\" Leap said. \"The process is lengthy.\"", "Trump said of MS-13 gang members, \"We are getting them out of our country by the thousands.\"", "It’s difficult to determine how many MS-13 members have been deported under Trump’s administration, because immigration officials don’t break down deportation data by gang affiliation.", "At least 1,200 MS-13 gang members were arrested from Oct. 1, 2016, through the end of Trump’s first calendar year. The time between an arrest and deportation varies per case, but an expert told us the process is lengthy.", "Trump’s statement contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "C-SPAN, President Trump Remarks at National Peace Officers' Memorial Service, May 15, 2018", "Email interview, Matthew Bourke, U.S. Customs and Immigration Enforcement spokesman, May 15, 2018", "Email interview, Jorja Leap, an anthropologist and adjunct professor at UCLA Luskin School of Public Affairs, May 15, 2018", "FBI, How We’re Ganging Up on MS-13, July 13, 2005", "Associated Press, AP FACT CHECK: Trump overlooks MS-13 gang’s American roots, Feb. 8, 2018", "U.S. Customs and Immigration Enforcement, DHS announces progress in enforcing immigration laws, protecting Americans, Dec. 5, 2017", "PolitiFact, Trump falsely claims his administration has deported half of MS-13 gang members, June 30, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]