["A local television channel, City 42, posted a video report on its official Facebook page which has been viewed more than 70,000 times since it was published January 17. The report claims that the Lahore airport will soon serve alcohol.", "“Change has come. Now liquor and beer will be available at Lahore airport,” the report says.", "Another similar report in the Daily Pakistan newspaper is headlined: “CM (Chief Minister) Punjab approves liquor bar at Lahore airport.”", "The report says: “A local company is to set up a duty-free shop to sell alcoholic beverages at the Allama Iqbal International Airport after approval from the PTI-led government”.", "PTI refers to the ruling Pakistan Tehreek-e-Insaf party.", "The misleading story has been reported by multiple other news outlets, for example Pakistan Today here.", "The reports claim that a liquor license has been granted to Unicorn Prestige Limited, a local franchise holder for hotel operator Swiss International Hotels.", "On November 25, 2018, Swiss International Hotels issued a press release saying that they had signed an agreement to franchise a hotel at Lahore’s International airport.", "The press release is headlined: “Swiss International and Unicorn Prestige sign a franchise agreement for a new 350 luxury hotel at the Allama Iqbal International Airport in Lahore, Pakistan.”", "In the body of the press release, Swiss International Hotels clarify that the hotel, which is scheduled to open in March 2019, is separate from the Lahore airport.", "“Royal Swiss Lahore is strategically located at just 500 meters from the Allama Iqbal International Airport in Lahore, Pakistan,” it says.", "“Along with its 350 rooms and suites, the hotel will be complemented with the Swiss International’s signature concepts; the Swiss Restaurant & Lounge, the Noodles & Rice, the TED & Co - Bar & Lounge, the Moods - Cigar Lounge, the Swiss Select Lounge, the Swiss Café Leafs & Beans, 7 Eventives Meeting venues, the Inspirations Pool & Gym and a World-Class Spa,\" the release says.", "The company also tweeted about the new Lahore airport hotel on November 25, 2018, and posted about it on their official Facebook page here.", "Wonderful signing ceremony of the Franchise agreement with the first Royal Swiss Hotel at the International airport in Lahore, Pakistan. Congratulations Hans Kennedie and Jameel Abbas, CEO of Unicorn Prestige! https://t.co/P2jhYREvQm", "An AFP reporter visited the site and confirmed that the hotel is being constructed on a separate property, divided from the main airport by the Airport Avenue road.", "The location of the new hotel is marked by the red pin on the map below:", "The Pakistani government’s official Twitter account dedicated to debunking misinformation said that the City 42 news report about alcohol at airport was “fake news.”", "Dissemination of #FakeNews is against the journalistic code of conduct. Reporting false news may cause harm to our national objectives. Spreading fake news is a punishable crime under the Prevention of Electronic Crimes Act 2016.https://t.co/jHdKQyVx3m pic.twitter.com/AyRBFqhHi4", "Shahbaz Gill, a spokesman for Punjab province -- where Lahore is located -- said in a video statement posted on his Facebook page on January 17, 2019 that the reports were inaccurate.", "“Today news was broadcast on some private television channels that liquor and beer will be available at the Lahore airport and it was said that the Punjab government has given permission for it,” Gill said.", "“This news is incorrect and facts are being misreported. What are facts... I am going to tell you that near the Lahore airport a four-star or a five-star hotel is under construction and it is going to be completed in March,” Gill said.", "“All the four stars and five stars hotels have permission (to sell liquor and beer) and this one also has same permission,” he said.", "Alcohol consumption was officially banned in 1977 in Pakistan. Non-Muslims and foreigners are allowed to drink alcohol, and some four- and five-star hotels in the country have licenses to serve it.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]