["Popular Nigerian entertainer Tunde Ednut, who has more than 2.5 million followers on Instagram, posted a screenshot of a tweet featuring this image on October 21, 2020. AFP Fact Check has previously debunked several of his posts, including here and here.", "The image has been shared across social media platforms, including on Facebook by prominent Nigerian singer Yemi Alade, as well as by Nigerian and Ghanaian news websites reporting on the anti-police brutality protests in Lagos and other key cities in the West African nation.", "The demonstrations in Nigeria erupted in early October after a video of a man being allegedly killed by police went viral.", "The rallies have continued despite the dismantling of the controversial Special Anti-Robbery Squad (SARS) police unit and promises of government reform.", "The unrest worsened after security forces opened fire on a large crowd at the Lekki toll gate in Lagos on October 20, 2020. The shooting has drawn international condemnation and boosted the global spread of the #EndSARS hashtag on Twitter.", "Amnesty International said 12 people were killed by security forces at two separate locations in Lagos.", "However, Lagos governor Babajide Sanwo-Olu at first insisted no fatalities had been recorded but later said one person had died from \"blunt force trauma to the head\".", "AFP Fact Check found the photo was from a play staged by Christian members of the National Youth Service Corps (NYSC) in Nigeria’s southern Akwa Ibom state as part of independence celebrations on October 1, 2020.", "NYSC is a mandatory one-year national service programme for tertiary education graduates in Nigeria.", "The graduates who staged the play were part of the Nigeria Christian Corpers' Fellowship (NCCF).", "The viral photo “is not in anyway related to Lekki shootings (sic),” NCCF Akwa Ibom said on its Instagram account.", "A post shared by NCCF AKWA IBOM (@nccfaks) on Oct 22, 2020 at 6:32am PDT", "“This is to notify the public that the picture trending online of a man carrying a lady covered in Nigerian flag appearing dead is a picture from NCCF Akwa Ibom state, stage drama night tagged ‘Lord, Heal Our Land’ on the 1st October, 2020 at the NCCF state secretariat,” the statement reads. “The lady in question is alive.”", "AFP Fact Check also tracked down Onyinye Francis, an NYSC member who acted in the play, after spotting her comment on Alade’s Facebook post.", "Onyinye had clarified that the photo was shot during a drama presentation by NCCF members.", "She also posted the footage of the play on her Twitter account. It shows the scene depicted in the photo.", "Pls help and share this video pic.twitter.com/tfXu1a8Wo8", "The bracelet seen on the woman’s wrist, the position of one of her hands, and other visual clues are the same in both the viral image and Onyinye’s footage.", "AFP Fact Check confirmed Onyinye’s footage was indeed filmed at the NCCF secretariat in Akwa Ibom’s capital Uyo.", "A sift through the NCCF’s Instagram feed found several photos showing the interior of the secretariat, including this one embedded below.", "A post shared by NCCF AKWA IBOM (@nccfaks) on Sep 1, 2020 at 5:15am PDT", "The building’s gallery, a banner with the inscription “IN HIS STEPS”, and a projected screen are visible in both the video clip and the image.", "The management of NYSC has also dismissed claims that the image is tied to the protests as false.", "The viral photo is among several images that have been shared out of context in the wake of the unrest in Nigeria. AFP Fact Check has debunked others here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]