["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In her inaugural speech, Atlanta Mayor Keisha Lance Bottoms told the crowd that the city was well-positioned to move forward in the coming years.", "\"We came back from the Great Recession and worked hard for eight years to put Atlanta’s finances in a good place,\" Bottoms said. \"Atlanta is on its strongest financial footing in 40 years.\"", "Four decades is a long time, and we wanted to give that assertion a harder look.", "In large measure, the claim holds up. But there are some caveats about the exact numbers that support it. Plus, measures of financial strength are always somewhat subjective.", "A few key indicators give a broad picture of how well any municipality is doing.", "There is the bond rating, which companies such as Moody’s and Standard & Poor's use to indicate the risk of lending money to the city.", "The rating firms bumped up Atlanta in 2016. Standard & Poor’s raised its rating to AA+ from AA. Moody’s raised its rating to AA1 from AA2. Fitch increased its rating to AA+.", "As far as anyone can tell, those are the best ratings the city has ever enjoyed.", "Fiscal analysts also look at pension fund exposure. As the number of retirees grows, live longer, and the cost of health care continues to rise, the future costs have become much larger than the cash in the pension fund needed to cover them.", "One of the mavens of municipal finance data, Richard Ciccarone at Merritt Research Services, gave Atlanta a mediocre grade on its pension position.", "\"Their funding ratio is only 65.9 percent, which is not that good,\" Ciccarone said. \"It’s been worse. It has been low as 55.4 percent in 2006.\"", "City spokeswoman Jenna Garland said the decision in 2017 to merge three pension boards into one would tighten up fund management and increase investment returns.", "\"Improved pension fund performance will result in a reduced need for the city to fund pension benefits, freeing those funds for use for city services,\" Garland said.", "Not so fast, said Katherine Willoughby, professor of public administration at the University of Georgia.", "\"I would be in a wait-and-see mode,\" Willoughby said. \"These are volatile things, and you hope the money will come in, but you don’t know until it happens.\"", "The pension fund issue was not a significant factor in the late 1970s.", "Perhaps the biggest feather in the city’s cap is the hefty balance of the general fund at the end of 2017. The general fund is Atlanta’s main account to pay for everything from fixing potholes to keeping police on the beat.", "It went from $153 million in 2016 to $200 million in 2017. Measured against the city’s $553 million budget, the percentage — 35.8 percent — had never been higher", "\"Never before in the city’s history have we both had a AA+ credit rating alongside record reserves and a record percentage of the budget in reserves,\" Garland said. \"We believe the historical record would reflect that at no point from 1978 until 2016 when the city’s credit was upgraded was the City in a stronger financial position than today.\"", "The city’s fiscal team dug into the financial archives of old Consolidated Annual Financial Reports and sent us a spreadsheet. This table is an excerpt showing four key years.: 1978, 1979, 2016 and 2017. (Other financing resources include one-time dollars that flowed in or out of the general fund apart from the usual revenues or expenses. The total budgeted number is the amount city leaders approved at the start of the year. Total expenditures are the actual spending for the year.)", "Year", "Beginning Fund Balance", "Total Revenues", "Total Expenditures", "Other resources", "End Fund Balance", "Total Budgeted Expenditures", "Percent of budget", "1978", "31,213,421", "101,955,596", "95,055,812", "(1,451,941)", "36,661,264", "141,848,805", "25.85%", "1979", "36,661,264", "113,507,631", "110,880,579", "(833,375)", "38,454,941", "162,465,755", "23.67%", "2016", "38,454,941", "530,310,000", "545,822,000", "17,647,000", "40,589,941", "543,311,000", "7.47%", "2017", "153,149,000", "572,908,000", "597,180,000", "71,205,000", "200,082,000", "558,379,000", "35.83%", "The city’s main yardstick to make comparisons across 40 years is to look at the general fund’s ending balance as a share of the total budget at the start of the year. In those terms, 2017 is much stronger than 1978, 35 percent compared to 25 percent.", "Michael Pagano, dean of the College of Urban Planning and Public Affairs at the University of Illinois at Chicago, said it’s difficult for large cities to enjoy the margin that Atlanta has.", "\"To have 35 percent for a city the size of Atlanta is remarkable,\" Pagano said.", "On the other hand, while it’s fair to compare the fund to the original budget, Pagano said it’s equally fair to compare to the actual spending.", "\"If you are asking how well you performed, then you want to compare to the actual expenditures,\" he said.", "Willoughby agreed, saying the budget is more theoretical, and \"it’s more anchored in reality to look at the actual spending.\"", "When we did that, the results flipped and the early years looked better than the recent ones.", "Year", "Total Expenditures", "Fund Balance", "Percent of Expenditures", "1978", "95,055,812", "36,661,264", "38.57%", "1979", "110,880,579", "38,454,941", "34.68%", "2016", "545,822,000", "153,149,000", "28.06%", "2017", "597,180,000", "200,082,000", "33.50%", "At the same time, after correcting for inflation, the shear size of the fund is larger today than in the past 40 years.", "Neither Pagano nor Willoughby took anything away from the gains Atlanta has made, particularly in the way it has risen from the fiscal wreckage of the Great Recession. Their point was that there are different ways to crunch the numbers.", "And they also offered several cautionary thoughts about what lies beneath the data.", "In the mid-1980s, Pagano collected surveys from financial officers at the 100 largest cities. The numbers he got from Atlanta for those years (included in the full spreadsheet, but not in the excerpt above) didn’t match what the city sent us. Conclusion?", "Pinpoint accuracy is not in the cards. Numbers that are broadly correct are about the best you can expect, especially when looking across several decades.", "Willoughby and Pagano cautioned against reading too much into the one-time $71 million bolt of cash that came in 2017. Our research found that money came from the decision to liquidate two city funds, with tens of millions from the Underground Atlanta project accounting for the bulk of it.", "\"It was a benefit for this year,\" Willoughby said. \"But you can’t count on it happening again. To pin your good fiscal health on one big drop of money is probably not appropriate.\"", "All of the experts we reached told us that there’s always a subjective element in municipal finance.", "\"This is more of an art than a science,\" said Tracy Gordon, senior fellow at the Urban Institute. \"How you combine the metrics and how you rate them involves some value judgments.\"", "Bottoms said the city was on the strongest financial footing in 40 years. Several indicators point in that direction, though the weakest factor centers on pensions. Atlanta faces significant challenges in funding its future pension obligations. That was not a factor in 1978. However, the situation is better than a decade ago.", "More promising is the city’s bond rating. It is higher than ever.", "The relative size of the general fund also falls in the plus column. In constant dollars, the 2017 general fund is larger today than it was 40 years ago — one long-time researcher called it \"remarkable.\" The fund did rely on some one-time cash infusions and a different, also reasonable, approach shows that the situation was a little better in 1978.", "There are factors that detract from the claim’s accuracy but the facts support the general thrust. We rate this claim Mostly True.", "Fox 5, Inauguration of Keisha Lance Bottoms, Jan. 2, 2018", "City of Atlanta, Mayor Kasim Reed Announces the Passage of the Pension Board Reform Ordinance, Dec. 13, 2017", "City of Atlanta, Mayor Kasim Reed Announces Upgrades to the City of Atlanta’s Credit Ratings from Three Major Agencies, March 9, 2016", "Government Finance Officers Association, Fund Balance Guidelines for the General Fund, Sept. 2015", "Urban Affairs Review, Assessing and Measuring the Fiscal Health of Local Governments, Aug. 2, 2004", "Fiscal Times, How Strong Are Your City's Finances? 116 US Cities Ranked, Jan. 9, 2017", "City of Atlanta, Office of the Controller, accessed Jan. 10, 2018", "Interview, Katherine Willoughby, professor of public administration, University of Georgia, Jan. 11, 2018", "Interview, Richard Ciccarone, president & CEO, Merritt Research Services, Jan. 9, 2018", "Interview, Michael A. Pagano, dean, College of Urban Planning and Public Affairs, University of Illinois at Chicago, Jan. 11, 2018", "Interview, Jenna Garland, spokeswoman, City of Atlanta, Jan. 10, 2018", "Interview, Jim Beard, chief financial officer, City of Atlanta, Jan. 10, 2018", "Interview, John Gaffney, deputy chief financial officer, City of Atlanta, Jan. 10, 2018", "Email interview, Rebecca M. Hendrick, professor of public administration, University of Illinois at Chicago, Jan. 9, 2018", "Interview, Tracy Gordon, senior fellow, Urban Institute, Jan. 9, 2018", "Interview, Dave Jacobson, vice president - communications, Moody’s Public Finance Group, Jan. 9, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]