["The posts, including this one published March 22, 2019, and shared nearly 500 times since, contains a collage of black-and-white photos, including one of a topless woman on the beach.", "The Hindi-language caption above the collage reads in English: “Congress leader Sonia Gandhi strengthening her party in her younger days. Some obscene photos to dazzle Congress supporters.”", "India’s national elections are due to begin on April 11 and run until May 19. Here is an AFP story on the upcoming ballot.", "Below is a screenshot of one of the false posts:", "The montage has been shared multiple times on Facebook with the same claim, for example here, here and here.", "But the photos in the collage that include the woman and the man are all linked to the 1962 James Bond film “Dr. No” and show the lead actors Sean Connery and Ursula Andress.", "An online search found that \"Dr. No\" was distributed by United Artists. The key words “united + artists + Dr. + No” were used in a Google search to find official photos or adverts related to the movie, and led to this page on auction site Heritage Auctions.", "Below is a screenshot of the Heritage Auctions page, which contains an image of a \"Dr. No\" lobby card:", "The man and woman in the \"Dr. No\" image, which is in colour, and the posted black-and-white photo look the same.", "Below is a comparison between the image included in the post (L) and the one from the auction website (R):", "Three of the images in the misleading Facebook post are available on the website of Alamy stock photography.", "The two images in the post showing the man holding the woman can be seen here on the Alamy website with the caption: “Dr. No England 1962 - Regie: Terence Young Bild: SEAN CONNERY u. URSULA ANDRESS aka Dr. No”.", "Below is a comparison of the posted image (L) and the stock photo (R):", "The image on the the top right of the false post is also available on the Alamy site here, with the heading: \"Sean Connery, Ursula Andress 'Dr. No' 1961 United Artists File Reference #30387 036THA”", "A similar image can also be found here on James Bond fan page 007.com.", "The three images are compared below, with the posted photo on the left, the stock photo in the middle, and the James Bond fan page photo on the right:", "The image at the top left of the post can be seen in the “Dr. No” section of Ursula Anderss profile on entertainment website IMDB.", "The two images are compared below, with the photo posted to Facebook on the left, the IMDB photo on the right.", "Comments on the misleading Facebook post showed some people did believe the woman in the images is Sonia Gandhi.", "The Hindi-language comment below translates as: “Please don't post these photos. These photos reflect badly on Indian culture. People no longer have any shame”", "The photo depicting the woman on her own has been less widely spread online than the others.", "A Google reverse image search found a series of shots on little-known sites as well as on photo-sharing site Pinterest here. The caption says the photo was published in Vogue magazine in 1973, and names the photographer as Helmut Newton.", "A search using the keywords \"Helmut + Newton + vogue + US + Ursula + Andress + 1973\" led to the Ciaovogue website, which documents vogue magazines published between 1965 and 1975.", "Here, in the site's section on the US edition of Vogue, is a screenshot of the photo published in the November 1973 edition of the magazine:", "A comparison below shows the photo used in the montage (L) and the photo found on the site that reproduces the editions of Vogue (R):", "The photo montage posts have previously been debunked by Indian fact-check sites here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]