["About this rating", "As Halloween approached in October 2020, a set of images supposedly showing the \"world's spookiest mushrooms\" started to circulate on social media. While we can't factually determine the spookiness or creepiness of these mushrooms, we can determine if these photographs are real or fake.", "A number of social media pages have shared versions of the \"world's spookiest mushrooms\" image set that included anywhere from a handful to a few dozen photographs. One of the most popular iterations was posted to the Nature Vibes Facebook page where it received more than 80,000 shares.", "We've examined the images in these \"spooky mushroom\" sets and, generally speaking, they all feature photographs of genuine (and genuinely weird-looking) species of mushrooms. In one case an image of a burnt Banksia Cone, an Australian plant that fruits after being burned in bushfires, was erroneously included.", "We'll take a closer look at some our favorite frightening fungi, such as the \"devil's fingers,\" \"bleeding tooth,\" and \"inky cap\" mushrooms below.", "While the images included in these \"spooky mushrooms\" posts vary, they almost all start with an image of quite possibly the world's weirdest mushroom, Clathrus archeri, which also goes by the names \"octopus stinkhorn,\" \"squidward mushroom,\" or \"devil's fingers.\" The viral photograph appears to have been taken by James McCulloch in 2015 and shows the devil finger's erupting from its suberumpent egg. A time-lapse video shows the growth of this mushroom.", "https://www.youtube.com/watch?v=OjiKQ55HHpY&feature=emb_title", "Auricularia auricula-judae, is also known as the \"wood ear,\" \"jelly ear,\" or \"Judas' ear\" mushroom. It is frequently found in Ireland, mainland Europe, and Asia. While it may be a bit strange looking, this is an edible fungus, although we've heard that the taste isn't much to write home about.", "Coprinopsis atramentaria, or \"inky cap\" mushroom, have gills that turn black and eventually liquify into an \"ink,\" giving the mushroom its common nickname. The viral photograph included in this \"spooky\" mushroom post was taken by biologist David George Haskell in 2012.", "Neil Bromhall, an award-winning wildlife photographer, shared this tim-elapse video of a similar species of ink cap mushrooms, the Coprinopsis picacea, or \"magpie inkcap\" fungus, growing and liquifying on the forest floor:", "Not only does the Hydnellum peckii, or the \"devil's tooth,\" mushroom, produce spores that look like blood, it also produces tooth-like projections that hang underneath its cap. While this is a truly spooky-looking mushroom, this is just a phase for this fungus. As it matures, it gets decidedly less spooky. Here's a young devil's tooth mushroom (left) and a mature one (right):", "We imagine that the Xylaria Polymorpha, or \"dead man's fingers,\" have been responsible for a few tall tales about the dead rising from their graves. Interestingly, this is a saprobic fungus, which means that it grows on decaying matter. This mushroom goes through a number of changes during its life cycle and doesn't really take on that \"zombie\" look until final stages. We have not been able to determine who took the ghostly image included in this viral post, but here's another photograph of the dead man's fingers that was originally shared by a Facebook user named Regan Daniels. Believe it or not, these dead man's fingers occasionally look like dead man's toes.", "While most of the fungi on this list could be aptly described as spooky or creepy, cordyceps, a genus of ascomycete fungi, are terrifying. Most of the 400 cordyceps species are parasitic and grow on infected insects and anthropods. Paul Bertner captured the image of this fungus growing on a moth that's included in this viral list, but here's a video from National Geographic showing this parasitic species in the wild:", "Hericium erinaceus is a mushroom of many names. This edible, medicinal, odd-looking mushroom is also referred to by names such as the \"bearded tooth,\" \"pom pom,\" or \"lion's mane\" mushroom. According to the Mushroom Expert website, this shaggy shroom grows from the wounds of living hardwood trees.", "Han, Mark.   \"The Cordyceps Fungus Turns Insects into Zombies.\"\r\n    INSH.   14 May 2018.", "Kuo, Michael.   \"Xylaria Polymorpha.\"\r\n    Mushroom Expert.   Retrieved 24 October 2020.", "Science Net Links.   \"Weird & Wonderful Creatures: Bleeding Tooth Fungus.\"\r\n    23 June 2016.", "First-nature.com.   \"Auricularia Auricula-Judae.\"\r\n    Retrieved 24 October 2020.", "Laurinavicius, Rokas and Mantas Kacerauskas.   \"The ‘Dead Man’s Fingers’ Fungus Looks As Creepy As It Sounds, And Here Are 6 Pics To Prove It.\"\r\n    Bored Panda.   July 2020.", "Brc.ac.uk.   \"Clathrus Archeri.\"\r\n    Retrieved 24 October 2020.", "Kuo, Michael.   \"Hericium Erinaceus.\"\r\n    Mushroom Expert.   Retrieved 24 October 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]