["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Thousands of students could receive a private education through corporate donations to a so-called \"scholarship\" program, but one critic claims the proposed school voucher program would be funded on the backs of public schools.\n\nJulia Sass Rubin, a spokeswoman for the anti-voucher group Save Our Schools NJ, explained the funding mechanism within the proposed legislation, known as the Opportunity Scholarship Act, during a recent interview on News 12 New Jersey’s Power & Politics show.\n\n\"(The Opportunity Scholarship Act) would be funded directly from public school budgets,\" Rubin said during the show broadcast on Dec. 3 and 4. \"So it would absolutely take money out of the public school system to transfer to private and religious schools.\"\n\nAfter reviewing the legislation, PolitiFact New Jersey determined that Rubin skipped a few elements of the proposed voucher program, but she still has a point that public schools would lose state aid as a result.\n\nThere’s no direct link between the scholarships and public school budgets, as Rubin said. Students would receive scholarships through donations made by corporations, and use them to pay for tuition at other public schools or private schools.\n\nHowever, those corporations would get tax credits in return, and to make up for that lost tax revenue, the state would withhold aid from the students’ original school districts.\n\nIn a phone interview, Rubin acknowledged the process involving the tax credits, but argued that public schools are ultimately paying for the program.\n\n\"It’s like a money laundering scheme,\" Rubin told us. \"It’s a direct reduction in school aid. So the schools are paying for it.\"\n\nLet’s explain how the proposed voucher program would work:\n\nThe Opportunity Scholarship Act is part of Gov. Chris Christie’s education reform agenda, but the legislation has stalled in the Legislature since early this year. About two weeks ago, opponents and supporters of the bill held competing rallies, one in Jersey City and one in Trenton.\n\nThe current version of the Act would set up a five-year pilot program to award scholarships to public and private school students residing in 13 school districts with failing schools, including Asbury Park and Newark. Public school students would be able to leave those districts and attend school elsewhere.\n\nThree organizations throughout the state would distribute the scholarships to parents or guardians of the selected students.\n\nCorporations making donations for the scholarships would get tax credits worth 100 percent of the value of their donations, costing the state millions’ worth of tax revenue. That’s where the school aid dollars come in.\n\nAccording to the state’s nonpartisan Office of Legislative Services, which analyzed the Senate version of the bill, up to nearly $1.2 billion in state aid would be initially withheld from the 13 districts over the course of the program. Of that amount, about $354 million would be returned to the districts, according to OLS.\n\nBut the remaining roughly $840 million would be retained by the state to offset the loss of corporate business taxes, according to OLS.\n\nSo, the scholarships would not be directly funded by public school dollars, but in a roundabout way, education aid would be withheld to cover the tax credits granted to donors providing the scholarships.\n\nBut Adam Bauer, a spokesman for Republican state Sen. Tom Kean Jr., one of the bill’s sponsors, argued that under the state’s school funding formula, schools would lose a proportionate share of state aid if their enrollment declined for any other reason.\n\n\"That’s how the formula works,\" Bauer said in an email. \"Why then is it such a travesty when this happens as a result of a student choosing to go elsewhere as part of a scholarship program?\"\n\nOur ruling\n\nIn a television interview, Rubin claimed the Opportunity Scholarship Act \"would be funded directly from public school budgets\" and \"take money out of the public school system to transfer to private and religious schools.\"\n\nThe program would not make a direct link between public school budgets and the scholarships. But to offset the cost of tax credits awarded to the scholarship donors, the participating school districts would lose state aid.\n\nWe rate the statement Mostly True.", "To comment on this ruling, go to NJ.com.", "Interview with Julia Sass Rubin on News 12 New Jersey’s Power & Politics show, broadcast Dec. 3-4, 2011\n\nOpportunity Scholarship Act, as reported by the New Jersey Senate Budget and Appropriations Committee\n\nNew Jersey Office of Legislative Services, Analysis of Opportunity Scholarship Act, March 4, 2011\n\nInterview with Allen Dupree, New Jersey Office of Legislative Services, Dec. 7, 2011\n\nPhone and email interviews with Julia Sass Rubin, Save Our Schools NJ, Dec. 7-8, 2011\n\nThe Star-Ledger, 2,500 attend Trenton rally supporting school voucher program for N.J. students in failing districts, Dec. 1, 2011\n\nEmail interview with Adam Bauer, a spokesman for the state Sen. Tom Kean Jr., Dec. 5-8, 2011", "Email interview with Justin Barra, spokesman for the New Jersey Department of Education, Dec. 14, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]