["About this rating", "As we've noted many times in these pages, one common way in which people attempt to demonstrate the aptness of a particular social or political viewpoint is to put its expression into the mouth of a revered historical figure. Surely if one of great minds of our civilization, someone who lived hundreds (or even thousands) of years ago, said the very same thing we're thinking today, then surely that's proof we've hit upon some eternal truth that should be sagaciously heeded. In short, attributing apocryphal quotations to everyone from Confucius to Abraham Lincoln is an attempt to capitalize on the maxim that \"great minds think alike.\"", "1. The poor, work & work.", "2. The rich, exploit the poor.", "3. The soldier, protects both.", "4. The taxpayer, pays for all the three.", "5. The wanderer, rests for all the four.", "6. The drunk, drinks for all the five.", "7. The banker, robs all the six.", "8. The lawyer, misleads all the seven.", "9. The doctor, kills all the eight.", "10. The undertaker, buries all the nine.", "11. The politician lives happily on account of all the ten.", "The list reproduced above, charting how all the various classes of society exploit each other from the top down — with politicians living happily at the pinnacle — is commonly attributed to Roman politician and orator Marcus Tullius Cicero (106 BC-43 BC), who once served as Consul of the Roman Republic.  But like another quotation frequently offered as a summation of Cicero's political thinking (which was actually invented by a 1960's novelist), this one is a little too conveniently modern in language and content to be anything more than, at best, a very loose paraphrase of something Cicero once said.  And given that Cicero was himself a lawyer and a politician, it's unlikely he would have excoriated those professions as misleading and feasting off the misfortune of others.", "In fact, this item is apocryphal: there's no known source for it (or anything remotely resembling it) in Cicero's recorded letters, speeches, and works.  Moreover, there's no record of its having been attributed to him (or anyone else) prior to 2012, when it was posted to an Occupy Wall Street-related forum.  In other words, it's nothing more than a modern invention of some anonymous Internet wag.", "Incidentally, the dating of this list (43 B.C.) coincides with the last year of Cicero's life — he had been declared an enemy of the state, and that year he was caught and executed while attempting to flee to Macedonia.  His last words were reportedly not a discourse on the social order, but an instruction to his captors:  \"There is nothing proper about what you are doing, soldier, but do try to kill me properly.\"", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]