["By Lori Robertson", "Posted on December 9, 2020", "A TV ad from Democrat Raphael Warnock falsely says Republican Sen. Kelly Loeffler “supports raising taxes on Georgia’s middle class.” That’s a reference to the 2017 Republican tax law that temporarily cut individual income taxes, but Loeffler supports making permanent provisions that are set to expire after 2025.", "The Tax Cuts and Jobs Act, for which Loeffler also has voiced support, cut taxes on average initially, but it will raise them after 2025 for most taxpayers, unless the law’s provisions are extended.", "Loeffler says on her campaign website that she wants to: “Make the Tax Cuts and Jobs Act’s tax cuts for working and middle class families permanent.”", "Warnock and Loeffler are facing off in one of two runoff elections in Georgia that will decide which political party has control of the U.S. Senate. Loeffler, a wealthy businesswoman, was appointed to her seat after Republican Sen. Johnny Isakson retired in December 2019 for health reasons. The winner of the upcoming Jan. 5 election will serve the last two years of Isakson’s six-year term.", "Loeffler wasn’t able to vote on the Tax Cuts and Jobs Act, since she took office in January 2020, but she has voiced support for the law. When Republicans passed it in December 2017, they designed the law with expiring individual income tax provisions so they could keep down the cost of the legislation to pass it with a simple majority. At the time, they said they expected a future Congress to extend those tax cuts, rather than allowing taxes for many to increase.", "But Loeffler is on record saying she wants to make the law’s tax cut provisions “for working and middle class families permanent.” That’s what she says in an economic plan she unveiled in late April.", "The Warnock campaign argues that its statement is accurate, because Loeffler hasn’t introduced legislation to extend the individual income tax cuts. The campaign points to bills Loeffler introduced in June that are associated with her economic plan, noting they don’t address the expiring tax cuts.", "But that doesn’t mean Loeffler won’t introduce – or support – efforts to extend those cuts in the future, particularly given the provisions don’t expire until after 2025.", "Loeffler also has signed a pledge with Americans for Tax Reform, saying she would “oppose any and all efforts to increase the marginal income tax rates for individuals and/or businesses.” In a press release, her campaign said she was “committed to opposing all tax increases at the federal level.”", "No action is needed, however, for the Republican tax law’s individual income tax provisions to expire. Instead, Congress would need to act to preserve those provisions.", "Warnock’s ad begins by highlighting a Sept. 11 Salon article about Loeffler’s work as an executive with the financial company Intercontinental Exchange. (Her husband, Jeff Sprecher, is the founder and CEO of the company, as well as chairman of the New York Stock Exchange.)", "The ad charges that “after the Great Recession, Loeffler made millions helping big banks get offshore tax relief by setting up a complicated corporate web in the Caymans, allowing banks to hide assets there to avoid paying U. S taxes.” That reflects the Salon article, which called the arrangement an “offshore tax dodge.” We asked Loeffler’s campaign repeatedly about the Warnock ad and the Salon article, but we haven’t received a response. A spokesperson for Intercontinental Exchange told Salon “there has been no avoidance of U.S. taxation whatsoever” with the holding company in question.", "We’ll concentrate here on the ad’s next claim: that Loeffler is “for raising taxes on Georgia’s middle class.” The ad cites an Oct. 31 New York Times opinion piece on the Tax Cuts and Jobs Act and a Dec. 30, 2019, radio interview in which Loeffler voices support for that law, two days before she took office.", "Loeffler, Dec. 30, 2019: I think President Trump’s tax cuts were incredibly helpful in making America more competitive from a business perspective. When you look at the ability of companies to repatriate money into the United States, that they were having to keep offshore for unreasonable tax implications. All of these things add up and have created more jobs.", "As for individuals, the Tax Cuts and Jobs Act did lower taxes, on average, for all income groups after it was enacted. An analysis of the legislation by the Urban-Brookings Tax Policy Center found: “Compared to current law, taxes would fall for all income groups on average in 2018, increasing overall average after-tax income by 2.2 percent.”", "The TPC found that only 5% of taxpayers would pay more in taxes under the law in 2018. Those in the middle quintile, earning between $49,000 and $86,000, would get about a $900 tax cut, on average, the TPC said.", "In 2025, all income groups, on average, would still see a tax cut, compared with prior law, with the middle quintile still receiving about a $900 average cut.", "But after that year, most individual income tax provisions in the law expire, leading to higher taxes for 53% of taxpayers in 2027. The bottom three quintiles (those earning up to about $93,000) would see small tax increases of $20 to $40, on average, compared with prior law.", "Mark J. Mazur, director of the Tax Policy Center, told us the tax law is a “very idiosyncratic” piece of legislation. Whether or not a taxpayer saw a tax cut or an increase depended on their personal circumstances.", "By 2025, most taxpayers — 76% — still get a tax cut from the law, but 9% get an “an average tax increase of almost $2,500,” the TPC analysis found.", "In the middle quintile of income earners, 87% get an average tax cut of $1,220 in 2025, while 11% pay an average $1,040 more in taxes, compared with prior law. That’s an increase from the 7% in that group paying higher taxes in 2018.", "One reason the benefits of the law lessen over time for some is a change in the way tax thresholds are indexed for inflation.", "Mazur explained that several individual income tax provisions, including the thresholds for the tax brackets and the maximum earned income tax credit, are indexed for inflation. Before the Tax Cuts and Jobs Act, that inflation measure was the consumer price index for all urban consumers (or the CPI-U). The tax law changed that to what’s called the chained CPI, which is a slower inflation adjustment.", "“Economists think it’s a better measure of inflation,” Mazur said, because it allows for changes in the basket of goods people buy. Consumers might buy more apples, he explained, if the cost of oranges goes up, instead of buying more expensive oranges.", "But this change in the CPI reduces the measure of inflation “by somewhere around two-tenths or .25% a year,” he said. That means people will be pushed into slightly higher tax brackets over time or get “slightly smaller” earned income tax credits.", "So, some people will see slight tax increases due to the inflation change, which is a permanent part of the law. Mazur said the impact of that is small, but it “compounds over time.”", "But the big impact that leads to a tax increase for a majority of taxpayers — and 70% of those in the middle quintile — is the expiration of most of the individual income tax provisions after 2025.", "“Absent action by Congress, individuals will face a higher tax burden in 2026,” the business-backed Tax Foundation has said.", "But, as we said, Loeffler supports extending those expiring tax provisions, so she is not “for raising taxes on Georgia’s middle class,” as the ad claims.", "Why do these individual tax cuts expire in the law? As we’ve explained before, in order to pass their tax bill through budget reconciliation, a process requiring only a majority vote in the Senate, Republican lawmakers could not add more than $1.5 trillion to the deficit over 10 years. Nor could they have a bill that added to the deficit beyond that 10-year window.", "So “the ‘easy’ options” to make that happen, the Committee for a Responsible Federal Budget noted, was to have some of the tax cuts expire.", "Democrats, including the Warnock campaign, have criticized Republicans’ move to keep in place corporate tax cuts in the law while letting the individual income tax cuts expire. The campaign pointed us to a Dec. 20, 2017, CNN Money article headlined: “Enjoy your tax cuts while they last.”", "“Republicans made individual tax cuts temporary so they could meet budget rules that let them pass their tax overhaul with no Democratic votes,” the CNN Money article said. “But don’t worry, they say. A future Congress won’t let middle class tax cuts expire. Recent precedents — like the oft-extended Bush tax cuts — suggest they may be right. Still, there’s zero guarantee of that. After all, a lot can change over eight years.”", "Warnock’s ad cites a New York Times opinion piece by Joseph E. Stiglitz, an economist and Columbia University professor. In that piece, Stiglitz wrote that those earning between $10,000 and $30,000 “are among those scheduled to pay a higher average tax rate in 2021 than in years before the tax ‘cut’ was passed,” citing estimates from the Congressional Budget Office and the Joint Committee on Taxation.", "But Garrett Watson, a senior policy analyst with the Tax Foundation, called that “misleading” in a Nov. 18 post. He explained that the apparent increase in JCT tables is due to fewer people using Affordable Care Act premium tax credits. The tax law eliminated the monetary penalty for not having insurance, reducing the incentive for some people to get coverage.", "In fact, the TPC analysis, which doesn’t show average tax increases for some income groups until 2027, doesn’t include the health insurance tax credits, Mazur confirmed. The impact of eliminating the penalty for not having coverage, Mazur said, is that “fewer people sign up for the Affordable Care [Act] plans through the marketplaces, so they’re less likely to get a tax credit for that” and “fewer people sign up for Medicaid.”", "We asked Stiglitz about his assertion about 2021 tax rates. He replied in an email: “The main point of my piece is that tax rate increases in 2027 — increases relative to average taxes paid in 2019 and average tax rates paid under prior law — have already been legislated, and most people are not aware of that.", "“In terms of using the language of tax increase or tax decrease, in economic analysis we look at net changes (e.g. taking into account, say, reductions in tax expenditures),” he continued. “I followed the practice of my fellow economists and the Joint Committee on Taxation in looking at net payments. My use of ‘average tax rates’ (and changes in those rates) is precisely that of the Joint Tax Committee.”", "As for Warnock’s position on the tax law, Michael J. Brewer, a spokesman for the campaign, told us Warnock “believes the permanent tax cuts for the wealthiest and corporations should be repealed and that Congress should make permanent the tax breaks for the middle class, which would otherwise expire.”", "In other words, both candidates support making the “middle class” tax breaks — however they might define that — permanent.", "It’s not clear either candidate would get an opportunity to alter the GOP tax law in the near term.", "Mazur noted that given the expirations don’t take effect until 2026, it would probably be 2024 when we see some action from Congress.", "By then, the initial term of whoever wins this Georgia runoff election — Warnock or Loeffler — would be over. The winner will have to mount a reelection campaign in 2022.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]