["About this rating", "What do antifa, Nov. 4, and riots have in common? They inspire conspiracy theories, it seems.", "A circulated screenshot of an August 2020 Facebook post called on “antifa comrades” to disguise themselves as supporters of U.S. President Donald Trump. By wearing Make America Great Again (MAGA) hats, U.S. flags, and even a “convincing” police uniform, the post claimed, \"comrades\" could deceive police and news media into thinking Trump supporters, not antifa, were rioting on Nov. 4, 2020, a day after the U.S. presidential election.", "Snopes readers shared a screenshot of this flyer and asked us to look into whether it was actually connected to antifa groups:", "The meme read:", "Antifa comrades! On Nov. 4 don’t forget to disguise yourselves as patriots/Trump supporters: wear MAGA hats, USA flags, 3%er insignias, a convincing police uniform is even better!", "This way police and patriots responding to us won’t know who their enemies are, and onlookers and the media will think there are Trump supporters rioting so it’s harder to turn popular opinion against us!", "We found no evidence that this meme was connected to any actual antifa groups.", "We should note that “antifa”— short for anti-fascist — is not a single group, but a very broad term referring to an amorphous coalition of leftist activist organizations that often act on their own initiative and don't have any centralized organizing body.", "The flyer has circulated online before in 2017 and 2019, as well as in 2020. Conspiracy theories about anti-fascist groups rioting on Nov. 4 are common, especially across the conservative parts of the internet. However, the 2020 screenshot of the flyer was unique because it was attached to a post referencing the Nov. 3 presidential election, adding fuel to rumors that something could be afoot in the near future.", "Will Sommer, a politics reporter who also focuses on conservative media, investigated the origins of Nov. 4/antifa conspiracy theories and this meme in a 2017 Medium post. He pointed out how the above-displayed flyer was part of many \"fabricated 'planning documents'\" shared on Facebook that urge antifa movements to commit violence. Sommer's report also highlighted how left-leaning, anarchist media hub It's Going Down had disavowed any Nov. 4 activity.", "The 2020 version of the meme, a screenshot, showed Facebook user Katy Krasnow sharing it to the Hickman County Antifa Facebook group. We reached out to Krasnow and tried to locate the Hickman County Antifa page, which appeared to have been taken down. Krasnow confirmed to us that she did post the meme and it was meant to be a joke. She found it when she searched for \"antifa memes\" on DuckDuckGo, a search engine. She said:", "Hickman County Antifa was a satire page, either the creator or Facebook took it down, that post was just a bad joke. I deleted soon after it got shared because it made a lot of people freak out more than I expected, nobody in the group was really actually connected, we were just sharing dumb antifa memes.", "We reached out to Facebook to learn if the page was indeed deleted by a group administrator or by Facebook, and we will update this post if we receive more information.", "But whether it was in 2020 or previous years, many people took such memes related to Nov. 4 seriously. Back in 2017, pro-Trump blog The Gateway Pundit ran a headline stating “Millions of Antifa Supersoldiers Will Behead White Parents” on that day. Conspiracy theorist Alex Jones also claimed antifa activists would be handing out AK-47s on Nov. 4.", "Snopes investigated similar claims in 2017 that argued law enforcement agents had announced that “antifa” was planning “extended violent unrest or civil war” beginning on Nov. 4. We found there was no truth behind these rumors.", "@AntifaChecker, a Twitter account devoted to sniffing out phony \"antifa\" accounts, indicated it was not aware of the 2017 call to action:", "We found no evidence of violent, antifa-led insurrections occurring in the U.S. on Nov. 4 over the past few years. On Nov. 4, 2017, there were anti-Trump rallies organized around the country by leftist groups, but these were far cries from cases of \"rioting.\" In New York City, for example, around 300 people showed up, leaflets were distributed, and only a handful of Trump supporters turned up to counterdemonstrate, according to news reports.", "Because the source of the above-displayed post confirmed to us it was shared as a joke, rumors of Nov. 4 activity have been disavowed by known antifa media outlets in the past, and we found that this meme had no connection to actual antifa activities, we rate this claim as “False.”", "Hayden, Michael Edison.   \"'Antifa Civil War' on November 4 Was Really Just a Few Protests Against Trump.\"\r\n   Newsweek.   4 November 2017.", "Ibrahim, Nur.  \"Can Trump Designate Antifa as a ‘Terrorist Organization’?\"\r\n   Snopes.  3 June 2020.", "LaCapria, Kim.  Is ‘Antifa’ Planning a Civil War?\"\r\n   Snopes.  10 October 2017.", "Nebraska Antifa.   \"On The November 4th “Civil War” Hoax.\"\r\n   It's Going Down.   6 November 2017.", "Sommer, Will.   \"How the “November 4” Conspiracy Theory Took Over the Pro-Trump Internet.\"\r\n   Medium.  31 October 2017.", "Swenson, Kyle.   \"The Antifa Apocalypse is Coming This Weekend, if You Believe the Hype.\"\r\n   The Washington Post.   1 November 2017.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]