["About this rating", "Following U.S. President Joe Biden's inauguration in January 2021, posts surfaced on social media alleging that one of former President Donald Trump's campaign advisers, Harlan Hill, previously said he would livestream himself eating his shoe if Biden indeed won the election.", "The quote was correctly attributed.", "Speaking to McKay Coppins, a writer for The Atlantic, on the evening of Nov. 3, 2020 — as the evening polls closed in the presidential election and states first began releasing results — Hill said of Trump:", "“Oh, he’s gonna win. One hundred percent.”", "“You’re that confident?” [Coppins] asked.", "“Absolutely.”", "“And if it goes the other way …”", "“I’ll eat my shoe. We’ll do it in a live-stream.”", "We obtained a transcript of that exchange via The Atlantic's website, where Coppins published a story titled, \"When the MAGA Bubble Burst\" on Nov. 7. On that day, Biden was announced the 46th president of the United States because he had crossed the winning threshold of 270 Electoral College votes.", "We reached out to Hill, who wrote on his website he was picked to join an advisory board for Trump's election campaign in early 2017, to ask him about his quotes in The Atlantic. Additionally, Snopes sought clarity on if, how, or under what circumstances he was planning to follow through with the pledge. We have not heard back from him, but we will update this report when or if we do.", "Based on our research, however, Hill did not appear to dispute the accuracy or authenticity of the comments attributed to him on election night at a party hosted by political strategist Steve Bannon.", "On Jan. 22, two days after Biden's inauguration, the news outlet Mediaite published a story after it — like Snopes — asked Hill if he was planning to eat his shoe. Mediaite journalist Zachary Petrizzo wrote:", "Hill has now apparently backed out of the wager.", "'Trump won,' Hill told Mediaite when asked if he planned to eat his shoe. (Hill’s claim that Trump won the 2020 election is patently false.)", "You can read all of our fact checks regarding the 2020 election and the Trump campaign's false claims that its political opponents used illicit, nefarious methods to win.", "In sum, considering Hill's quotes in The Atlantic and the fact that he denied an opportunity by Mediaite to clarify what he meant by saying \"I'll eat my shoe\" and explain the literalness of his interview, we rate this quote correctly attributed.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]