["The one-minute and 43-second video was published on Facebook here on June 24, 2020. The video has been viewed more than 66,000 times.", "Osmania Hospital is a government-run hospital and medical college in Hyderabad, the capital of the state of Telangana.", "The footage includes a watermark of a logo that reads: “INDTODAY”.", "The video was also shared on Facebook alongside a similar claim here, here, here and here.", "The claim, however, is misleading.", "Keyword Google searches found that Ind Today, a Hyderabad-based news agency, published the footage on its YouTube channel here on December 25, 2013.", "“Unclaimed bodies pile up at OGH mortuary | Hyderabad Osmania General Hospital,” reads the video’s caption.", "In response to the misleading posts, Ind Today published this statement on its Facebook page on June 26, 2020.", "“The video showing several piles of dead bodies, kept for days together in the morgue, is actually six year old. It's YouTube video published on December 25, 2013,” the post reads.", "Ind Today also urged the public “not to mistake it as the fresh video and also not to panic.”", "The footage was also published by other regional Indian media outlets in 2013; including ETV Andhra Pradesh here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]