["About this rating", "On 10 September 2017, a now-viral video posted to Facebook by Wendy Wilkerson Underwood contained claims that the Red Cross in Houston, Texas was instructed to throw out a significant quantity of food and supplies donated by the public in the aftermath of Hurricane Harvey:", "Have you seen the posts about the Red Cross and their abuse of volunteers and evacuees? Well, this is going to blow you away! They are throwing supplies into the trash in Houston. But don't worry, they said they can collect more from what's going on in Florida. I'm glad they are so respectful of their donors hard earned money.", "In the video, the camera pans over a pile of food, bags, and crates in what appears to be a garage, while the woman narrating it reiterates that it consisted of donations to the organization that had been discarded. No additional information is given. According to the person who narrated the video, the director of the Red Cross in Houston said this was done \"because they can get more for Florida.\" The narrator also says that that the items shown in the video include 600 brand new, donated blankets and 500 pounds of dog food.", "But Red Cross spokesperson Elizabeth Penniman denied in a statement that any such order had been given:", "We work with a large number of partners, who provide bulk donations of goods to the Red Cross. There has been no directive given at any of our operations to discard or dispose of any new donated items such as canned food, water, diapers, blankets or dog food.", "Penniman added that the organization had attempted to contact Underwood:", "Numerous inquiries to Ms. Underwood, who originally posted this video, have gone unanswered. These inquiries have come from both the local Red Cross staff on the ground in Texas, the Disaster Response Operation in Texas, and from Red Cross National Headquarters in Washington, DC. It is important to note that these videos seem to have been filmed in Ms. Underwood’s garage in Waco, Texas, nearly 200 miles — or a three-hour drive — from our primary warehousing operations in Houston. We have asked Ms. Underwood if she was on the ground at any one of our Red Cross shelters or warehousing facilities; we have asked her to open these closed plastic bags to show us what is in them, and we have asked her to identify the “Red Cross Director” she cites. She has not done so.", "The Red Cross also released a lengthy statement about the matter (although without directly addressing these specific claims):", "The Dangers of Rumors and Misinformation", "Today there are roughly 6,000 American Red Cross volunteers on the ground in 13 states and U.S. territories whose sole purpose is to help their neighbors. These 6,000 volunteers are helping thousands they’ve never met, who have been devastated by Hurricanes Irma and Harvey, as well as thousands more threatened by wildfires across the West and Northwest. In too many cases to count, our volunteers have set aside family and professional obligations to put our humanitarian mission first and lend a hand.", "While these volunteers work tirelessly to deliver much-needed aid to areas decimated by unprecedented disaster events, the American Red Cross is faced with an onslaught of baseless claims, rumors or outright lies that do nothing more than undermine our critical relief efforts.", "On this page, we embrace the exchange of different ideas and points of view. And during times of disaster, we know that emotions run high and misinformation is quick to spread. But these accusations (theft, charging for services, denying assistance) not only derail the efforts of so many workers providing aid, they divert resources away from our core mission: to deliver relief. The countless hours spent addressing malicious falsehoods ultimately risk hurting those we’re trying to serve.", "So for those of you who doubt our credibility, we have one thing to say to you: Join us. Sign up. Put on a Red Cross vest and volunteer at one of our shelters, blood drives or events. We welcome your service.", "For those with complaints, provide specifics so that we may follow up to ensure our services are adequately meeting needs and measuring up to the standards we expect and communities deserve. We take legitimate criticisms seriously.", "But for those of you determined to perpetuate hatred, rumors, misinformation or lies, you’ll have to excuse us for not addressing you, as we’ve got important work to do to provide help to those in need.", "The organization does sometimes discard items that have been donated, but there is no evidence that it does so indiscriminately or on a large scale, and it only throws out supplies that are unusable for one reason or another, according to Penniman:", "With donations of food — whether for those in our shelters, or for pets that might be sheltering with their owners, we have policies and procedures in place to protect the health for all concerned. Very often, we receive an overwhelming amount of donated food to our disaster operations, as well as donations of pet food. As we cannot ensure the safety of food prepared in non-commercial settings, we do not accept home-cooked food as donations. In the case of donated pet food, we cannot accept opened bags of food. Even properly prepared food, if not clearly monitored or packaged, can quickly go bad through no fault of those who prepared or are serving it.", "While it remains unclear whether these were actually discarded donations or just a pile of somebody's storm-damaged possessions in a garage, a 2016 CBS report highlights the fact that many well-intentioned charitable contributions are of no use to disaster relief efforts and are often thrown away as a result:", "However, the Red Cross has come under scrutiny in the past for alleged mismanagement of donations and funds. Investigative news outlet ProPublica has a whole series on the nonprofit organization and how it has spent its money after disasters.", "Update [13 September 2017]: Added comment from the Red Cross and updated story throughout.", "Correction [18 September 2017]:  A previous version of this article incorrectly identified the person who posted the video to Facebook as \"Wendy Wilkinson Underwood,\" and indicated that she was the video's owner and narrator. Wendy Wilkerson Underwood reposted but did not narrate the video.", "Dan Mac Guill is a former writer for Snopes.", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]