["Michael Bloomberg appeared on CBS' \"Face the Nation\" on Aug. 3, 2014.", "Statesmen from nearly 50 African countries are in Washington this week for President Barack Obama’s historic African Leaders Summit, which has been billed as an attempt to strengthen the United States’ economic investments in Africa.", "Former New York mayor Michael Bloomberg praised the summit on Aug. 3’s Face the Nation, pointing to investments from Chinese companies in African infrastructure. And education spending, Bloomberg said, is the best evidence of big things to come in Africa.", "\"China has looked at it and said this is a place where because they are spending highest percentage of their GDP on education of any part of the world, although in all fairness it's starting small,\" he said. \"But you are going to create a middle class there that's going to want an awful lot of the products.\"", "\"The next big cities,\" he said, \"are going to be in Africa.\"", "That seemed to contradict the Western trope that African schools aren’t meeting the needs of their students.", "What we found is that Bloomberg is in the ballpark looking at data from 2008 but wrong when looking at more recent numbers.", "Looking back to 2008", "While we didn’t hear from Bloomberg, he may have been thinking of an article in his Bloomberg Businessweek by Howard French, author of China’s Second Continent: How a Million Migrants Are Building a New Empire in Africa.", "\"African investment in education, among the highest in the world in terms of percentage of GDP, can barely keep up with the heavy demand for learning,\" French wrote, going on to cite Africa’s recent gains in school enrollment across all levels of learning.", "French referred us to a report by the McKinsey Global Institute, \"Lions on the move: The progress and potential of African economies.\" That report pegs Africa’s public spending on education as a percentage of GDP at 5 percent in 2008. That’s \"a smaller portion than the OECD countries’ 6 percent,\" they wrote, \"but more than in Latin America or some Asian countries.\" The OECD, or the Organisation for Economic Co-operation and Development,  is composed of 34 countries in every continent except Africa that are generally considered developed and high-income.", "The above graph from a United Nations Educational, Scientific, and Cultural Organization (UNESCO) report expands on the data from the McKinsey study and looks at spending per region across the globe. Both reports, we should note, only look at public spending on education -- data on private education spending isn’t readily available for non-OECD countries.", "If you take education spending as a percentage of government spending, not GDP, Africa actually beats out the OECD, 20 percent to 11, according to the McKinsey Global Institute. But looking at 2008 figures -- as did all the reports we found that looked at education spending for continents -- Bloomberg’s wrong. Africa’s close, and their progress on education is impressive by other measures, but the world’s developed nations spend proportionally more on education.", "Updating the data", "But part of the buzz about Africa is that its governments are rapidly increasing their spending on education. For instance, a 2011 UN report noted that Africa had increased its education spending by an average of 6 percent a year from 2000 to 2010.", "The 2008 data also isn’t perfect, because some notable countries are missing, including China.", "So we set out to update the UN and McKinsey’s analysis with more recent data.", "Every year, UNESCO publishes public education spending as a percentage of GDP for every country where it’s available, which works out to less than half of the 196 recognized countries almost every year. The World Bank keeps a database of these numbers, year-by-year.", "To update the stats from UNESCO and McKinsey, we took the World Bank’s dataset and removed every country that hadn’t published new data since 2008. Then we took the most recent figure for the remaining 160 countries, and multiplied each country’s percentage by its most recent GDP figure from the World Bank to get an estimate for total education spending for each country.", "The data for every country is the most recent available, though the data isn’t the same year for every country.", "We then broke down the countries into geographic regions using a UN classification -- which segregates countries more or less by continents -- and took the total education spending for each region and divided it by each region’s total GDP to get weighted averages. The results:", "Source: PunditFact.com", "As you can see from the chart above, Africa lags behind Latin America and Oceania, in addition to Northern America (the UN name for North America) and Europe.", "The picture could look different for education spending as a percentage of government spending instead of GDP -- African countries’ spending on education is increasing alongside their GDPs, albeit at a slightly slower rate -- but that’s not how Bloomberg framed his claim.", "Our ruling", "On Face the Nation, Bloomberg said that Africa is spending \"the highest percentage of their GDP on education of any part of the world\" in the course of praising China’s investment in Africa’s growth.", "Reports from the United Nations had Africa’s proportional spending on education higher than everywhere but North America and Europe in 2008. But since then, Africa’s overall economic growth has outpaced its governments increasing spending on education. Our calculations based on the most recent available data put Africa’s proportional spending beneath every continent except Asia.", "African countries do spend more of their governments’ budgets on education than many developed countries, so Bloomberg’s broader point about Africa’s growth has some merit. But Bloomberg’s claim cited GDP. We rate his claim False.", "Michael Bloomberg on Face the Nation, Aug. 3, 2014", "Email interview with Howard French, professor at the Columbia University Graduate School of Journalism, Aug. 5-6, 2014", "Bloomberg Businessweek, \"High Stakes in Africa: Can the U.S. Catch China?\" July 31, 2014", "The Wall Street Journal, \"African Consumer Spending Expected to Double by 2020,\" Aug. 3, 2014", "United Nations, \"Classification of Countries by Major Area and Region of the World,\" 2012", "The Atlantic, \"The Next Asia Is Africa: Inside the Continent’s Rapid Economic Growth,\" May 21, 2012", "The World Bank, \"Public spending on education, total (% of GDP),\" Aug. 6, 2014", "United Nations Educational, Scientific and Cultural Organization, \"Financing Education in Sub-Saharan Africa,\" 2011", "McKinsey Global Institute, \"Lions on the move: The progress and potential of African economies,\" June 2010", "United Nations, \"UN report reveals increasing spending on education in sub-Saharan Africa,\" April 27, 2011", "The World Bank, \"GDP ranking,\" July 1, 2014", "The World Bank, \"Africa’s Growth Set to Reach 5.2 percent in 2014 With Strong Investment Growth and Household Spending,\" April 7, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]