["Photographs of Hindu deity Ram and 3D portraits of the upcoming Ram Mandir in Ayodhya will be beamed across giant billboards in Times Square, New York on August 5, as per media reports. The display would celebrate the commencement of the temple’s construction.", "In the backdrop of this, several people on social media have shared an image of billboards in Times Square adorned with pictures of Ram. Avinash Gorakshakar, director research ProfitMart, tweeted the viral image claiming this was Times Square “an hour ago”. The image was liked by over 1,500 users. Several other Twitter users also posted the viral image including Sunder Chaudhary, @FltLtAnoopVerma, @satyendra81 and @mauna_adiga.", "Similarly, many Facebook users (1, 2, 3, 4) posted the viral image.", "Tamil Nadu-based news outlet Kathir News published an article headlined, “Jai Shriram slogans to be played in Times Square on Shri Ram Bhoomi Puja”. The article carried the same picture. (Translated from டைம்ஸ் ஸ்கொயரில் ஸ்ரீ ராமர் – பூமி பூஜை அன்று ஒலிக்க இருக்கும் ‘ஜெய் ஸ்ரீராம்’ கோஷங்கள்.!)", "Alt News performed a reverse image search and found an identical image on several websites. However, the viral image has been flipped horizontally.", "Pictures of Hindu deity Ram were photoshopped into the original picture and subsequently flipped horizontally. The similarities are pointed out below.", "1. Green billboard on top of a white building (highlighted in red).", "2. Corona beer billboard close to the green billboard (highlighted in yellow).", "3. An identical number of cabs in the front most row on each side of the street (highlighted in green and orange).", "4. A picture of Ram has been superimposed on a poster of the musical Wicked (marked in blue). A portion of the green poster can be spotted behind Ram’s image.", "Furthermore, a keyword search “times square billboard generator” on Google leads to makesweet.com where a temple of the same image is available.", "Thus, a picture showing images of Hindu deity Ram splashed all over New York’s Times Square billboards was manufactured then flipped horizontally to escape reverse-image search attempts.", "[Update: The poster of ‘Wicked’ is for the musical and not the movie releasing next year. The same was rectified after it was pointed out.]", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]