["About this rating", "Much online ink has been spilled over unfounded claims about the dangers of “chemical ripening” in fruit and vegetable products.", "In the case of bananas and many other fruits, ripening occurs naturally as a response to a plant hormone called ethylene that is released at specific stages of a plant’s development. For reasons ranging from transportation logistics to visual aesthetics, most commercial bananas are picked well before they are ripe and triggered to ripen in concert by being exposed to trace levels of ethylene gas in a specialized, climate-controlled ripening chamber a few days before being distributed for sale in supermarkets.", "From a chemical standpoint, an ethylene-treated banana (the actual scientific term) is no different than a banana that has ripened naturally, as the same substance is triggering the ripening in both cases. From a food-safety perspective, no differences exist between ethylene-treated bananas and bananas that have ripened on their own schedule, either. In the U.S., the post-harvest ripening of organic-labeled tropical fruit with ethylene is explicitly allowed.", "In fact, any banana bought at a supermarket in the United States (and much of the rest of the world) is all but certain to have been ethylene-treated, even those found in the \"organic\" section. We asked Maricruz Ramirez Sanchez, an expert in post-harvest technology at the University of Costa Rica’s Agronomy Research Center, what percentage of bananas sold in U.S. supermarkets would be ethylene-treated. “I would say 100%,” she told us by email.", "That fact is what makes a meme purporting to offer a quick visual method to identify which of two Whole Foods bananas has been “chemically ripening” so perplexing:", "Both bananas in the image are almost certain to have been ethylene-treated. Still, we asked Ramirez Sanchez if the presence of green stalks and brown spots, or any other visual clue, could reliably betray a banana’s ethylene-treatment history. She told us it would be possible to see green stems in both naturally ripened and ethylene-treated bananas, adding that “there is no visual test, and there is no chemical test, to confidently assess if a banana has been ethylene treated or naturally ripened.”", "USDA National Organic Standards Board Technical Advisory Panel.   “Ethylene.\"\r\n    2007.", "National Geographic.   “The Surprising Science Behind the World's Most Popular Fruit.\"\r\n    24 October 2017.", "Islam, Md. Nazibul et al.   “A Review on the Legislative Aspect of Artificial Fruit Ripening.”\r\n    Agriculture & Food Security.   20 June 2016.", "U.S. Code of Federal Regulations.   “Title 7 Part 205.605: Nonagricultural (nonorganic) Substances Allowed as Ingredients in or on Processed Products Labeled as “Organic” or “Made With Organic (Specified Ingredients or Food Group(s)).”\r\n    Accessed 28 May 2019.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]