["About this rating", "In April 2017 the Last Line of Defense web site published an article positing that Supreme Court Justice Ruth Bader Ginsburg had beenrushed to the hospital in an unresponsive state:", "Just days after having a nominee sworn into the highest court in the land, President Trump may get another chance. Justice Ruth Bader Ginsburg, at 84-years-old, has been rushed to George Washington Hospital in what paramedics referred to as an “unresponsive” state.", "According to Fox News, Ginsburg was in her home early Wednesday morning when she slipped into unconsciousness. Her bodyguard found her and called 911. The responding paramedics arrived in under 4 minutes and had her at the hospital within 10, but so far, reports are saying she has yet to be revived.", "This was not a genuine news item, as it originated with The Last Line of Defense, a fake news site with a long history of publishing fabricated stories. The site carries a disclaimer identifying its content as satirical:", "DISCLAIMER: The Resistance may include information from sources that may or may not be reliable and facts that don’t necessarily exist. All articles should be considered satirical and any and all quotes attributed to actual people complete and total baloney. Pictures that represent actual people should be considered altered and not in any way real.", "The photograph that accompanied this fake news article was taken from an unrelated event: the image of the ambulance dates from 2015 and shows Chicago Fire Department paramedics placing a stabbing victim into the back of an ambulance.", "Brown, Daniel.   \"Man Stabbed on Red Line Train in Loop.\"\r\n    The Chicago Tribune.   4 August 2016.", "Stryker.   \"Ruth Bader Ginsburg Taken to Hospital Unresponsive.\"\r\n    The Last Line of Defense.   Retrieved 14 April 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]