["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Workers wearing personal protective equipment bury bodies in a trench on Hart Island, Thursday, April 9, 2020, in the Bronx borough of New York. (AP)", "Photos and video footage showing dozens of caskets being buried in large trenches on Hart Island in New York City are legitimate.", "Not all local COVID-19 victims are being automatically buried there. The site has been used by the city since the 19th century as a public cemetery for unclaimed people and those whose families can’t afford private burials.", "Harrowing images of wooden caskets being lowered into mass graves in New York City circulated on social media as the city responded to the COVID-19 pandemic.", "The images and related video footage are accurate depictions of recent burials on Hart Island in the Long Island Sound. That said, there have been some misconceptions about the mass graves.", "Posts about the grave site were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "First, mass burials didn’t begin on Hart Island during the COVID-19 pandemic. The city has used the location as a public cemetery for over 150 years, burying unclaimed people and those whose loved ones can’t afford private burials.", "Second, not all locals who die from COVID-19 are being buried there, as some posts have suggested. The site is still designated for deceased people with no known next of kin.", "But as the city struggles with the mounting death toll amid the pandemic, burials on the island have dramatically increased in recent weeks.", "There are usually about 25 burials on the island each week, the New York mayor’s press secretary Freddie Goldstein told CNN. But that number has climbed to nearly 25 each day.", "The island’s interment operation is managed by the city’s Department of Correction, and inmates usually assist in the burials. But that has changed since the pandemic.", "DOC spokesperson Jason Kersten has said that city inmates are not currently involved with the burials: \"For social distancing and safety reasons, city-sentenced people in custody are not assisting in burials for the duration of the pandemic. Contracted laborers are performing this important work under DOC supervision,\" according to a report by the Gothamist.", "Bodies are ordinarily held at the city’s morgues anywhere from 30 to 60 days, Goldstein said. But to make room for the influx of deceased individuals during the pandemic, the city’s medical examiner’s office announced a new policy of holding unclaimed bodies for only up to 15 days before they are transferred to the island.", "New York City’s Hart Island has been used as a public cemetery for unclaimed bodies since the 1800s, but the city’s staggering death toll amid the COVID-19 pandemic has dramatically increased the number of burials on the island.", "Social media posts about the burials are mostly accurate, but many need additional information. We rate this Mostly True.", "New York Times, As Morgues Fill, N.Y.C. to Bury Some Virus Victims in Potter’s Field, April 10, 2020", "History of the Hart Island Project, Accessed April 14, 2020", "CNN, Unclaimed coronavirus victims may be buried on New York's Hart Island, as the state's death toll climbs, April 10, 2020", "Gothamist, Mass Burials On Hart Island Increase Fivefold As COVID-19 Death Toll Skyrockets, April 9, 2020", "NYC.gov, City Burial, Accessed April 14, 2020", "Snopes, Are ‘Mass Graves’ Being Dug for COVID-19 Deaths?, April 10, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]