["A social media post shared amid an historic polar vortex shows an image of a man lying on a sidewalk, frozen and covered in snow.", "The caption says, \"15 Homeless people have already been found frozen to death in Chicago,\" and implores users to count their blessings.", "It's brutally cold in the Midwest and there's no question this record-breaking weather event carries with it extreme danger. So far, there have been eight deaths reported as the powerful storm has moved across the United States.", "But there is no evidence for the claim of 15 homeless deaths, and the tragic photo is actually from a 2013 winter event in Canada.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The claim appears to have originated on Twitter on Jan. 27, a couple of days before the cold blast hit the city. Still, that tweet has been retweeted more than 22,000 times.", "We found one death reported in the Chicago area and related to the polar vortex, a man was struck and killed by a snowplow.", "As of Jan. 31, there had been at least seven other reported deaths connected to the extreme cold blast. All are tragic. But none of those deaths were of Chicago’s homeless. And, in fact, they took place in multiple states. The fatalities include a couple who died in a car crash on a snowy road in Indiana; a man found in front of his neighbor’s house in Michigan; the body of another man discovered in a Wisconsin garage; and a University of Iowa student found outside in the middle of the night.", "The accompanying photograph was also not taken in Chicago and is not from this year.", "In the picture, the homeless person is actually sleeping on a Toronto sidewalk on Jan. 22, 2013, when temperatures dipped to minus-25 degrees. It was featured in the Canadian outlet the National Post. A reverse-image search shows that the photo was later uploaded to other websites starting in February 2013.", "The city of Chicago took measures to get people off the streets and converted schools, libraries and other buildings into warming centers. As temperatures plunged, one Chicago homeless shelter took in around 800 homeless men, women and children who sought refuge — surpassing its capacity more than triplefold, according to local news reports. And one anonymous donor offered to pay the hotel bills for roughly 70 homeless people.", "A social media post says that 15 homeless people died in Chicago from the recent cold snap.", "While there have been multiple deaths connected to the weather event, none of those, so far, have been reported to be of any homeless persons from the Chicago area.", "Additionally, the photo of the homeless person featured in the post is six years old and was taken in Canada.", "We rate it False.", "Facebook post, Jan. 30, 2019", "Tweet, Jan. 27, 2019", "NOAA, The science behind the polar vortex, Jan. 29, 2019", "National Post, Homeless man sleeps on a sidewalk in extreme cold, Jan. 22, 2013", "USA Today, \"'Stay inside': Death toll up to 8 people as Arctic cold blasts Midwest, East,\" Jan. 30, 2019", "CBS Chicago, Chicago’s Largest Homeless Shelter Took In About 800 People Tuesday During Night Of Deadly Cold, Jan. 30, 2019", "The Hill, Good Samaritan pays for hotel rooms for 70 homeless in Chicago amid record cold, Jan. 30, 2019", "Chicago Warming Center Map, Accessed Jan. 31, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]