["The Indian Premier League (IPL) under way in the UAE garnered controversy after social media outrage that former Indian cricketer Sunil Gavaskar made a ‘distasteful’ remark on Royal Challengers Banglore (RCB) captain Virat Kohli and his wife Anushka Sharma during live commentary. Indian mainstream media joined the bandwagon publishing reports citing the alleged comment made during a match between RCB and Kings XI Punjab (KXIP).", "News18 ascribed the following quote to Gavaskar, “Inhone lockdown me toh bas Anushka ki gendon ki practice ki hai,” suggesting he made a double entendre. While the article remains as of this writing, News18 took down its tweet.", "Bollywood Hungama, Asianet News, Mumbai Mirror and DNA India were among other prominent English media organisations that attributed the same quote to Gavaskar. Its unsavoury English translation reads, “Virat Kohli has only trained against Anushka’s balls during the lockdown.”", "This slideshow requires JavaScript.", "Hindi media outlets Jansatta, Zee News and Live Hindustan also did not miss the opportunity to criticise Gavaskar.", "This slideshow requires JavaScript.", "Times Now anchor Navika Kumar demanded that Gavaskar should be removed from the commentators’ panel. Journalist Chaitali Narula also criticised him for his “obscene” comment.", "For Tweeple to troll @AnushkaSharma for @imVkohli performance is disgusting. And the less said about Sunil Gavaskar the better. In fact BCCI should remove him from the commentators’ panel for the MCP attitude. #BoycottGavaskar", "— Navika Kumar (@navikakumar) September 25, 2020", "Soon, #BoycottGavaskar became a Twitter trend.", "A few other outlets termed his remarks ‘distasteful’, ‘unsavoury’ and ‘sexist’ without carrying the alleged quote in the reports. The News Minute quoted Gavaskar saying, “During the lockdown, he [Kohli] just practised his bowling with Anushka,” and suggested that the remark was made after “Kolhi was dismissed for 1 in RCB’s run-chase.” The report was later updated.", "Similarly, The Indian Express republished a PTI copy which said Gavaskar’s remarks were “unsavoury” and “in bad taste”. This article was also updated later.", "Actor Anushka Sharma put out a statement criticising Gavaskar for “accusing a wife” for her husband’s game. “Mr. Gavaskar your message is distasteful is a fact but I would love for you to explain why you thought of making such a sweeping statement on a wife accusing her for her husband’s game?”", "#AnushkaSharma sends out a message to veteran cricketer #SunilGavaskar after his remark on #ViratKohli’s performance during the #IPL game last night. pic.twitter.com/NityLDuNRl", "— Filmfare (@filmfare) September 25, 2020", "Journalist Barkha Dutt commended the actor and tweeted, “Good on you Anuskha for calling out the crap, whether from Sunil Gavaskar or anyone else. Hurrah.”", "Alt News watched the live footage of the match and found that Gavaskar had been grossly misquoted. Virat Kohli, well-known for his batting and fielding prowess, had dropped two catches of KXIP’s KL Rahul in the first innings. While Rahul had scored an impressive 132 not-out in the game, Kohli got out for 1 while trying to hook KXIP’s bowler, Sheldon Cottrell.", "Gavaskar’s remark came as Kohli was about to face the third delivery of the third over bowled by Cottrell. As Kohli walked to bat after the early dismissal of Josh Philippe, Gavaskar mentioned his dropped catches and said, “[Josh Philippe’s early dismissal] has given Virat Kohli a chance to play more overs [Kohli walked out in the 12th over in RCB’s first match]. He dropped two catches in the field. So he knows he has to do something [special].”", "After Kohli played the first ball, commentator Akash Chopra (along with Sunil Gavaskar) discussed how the players had been out of practice.", "Chopra: As all the players have set their foot on the field after a long time, [you can] feel that the swords have caught rust, they are not as ready. If you see the IPL career [of Virat Kohli] – he has unparalleled 5427 runs. But Sunny bhai, not playing cricket for 6-8 months, it is not easy.", "Gavaskar: Absolutely. He [Kohli] didn’t get a chance to undertake the necessary practice. He knows that the more he practices, he’ll improve. When the lockdown happened, he only practised against Anuskha’s bowling, we have seen the video, but nothing is going to come of that.", "Chopra: He was practising in his apartment. There is no privacy at all. (People in the) nearby building also shot a video of it.", "While it can be argued that Sharma’s name should not have found a place in the commentary, Gavaskar neither made an indecent remark nor blamed the actor for her husband’s performance.", "Speaking with India Today, Gavaskar said, “Firstly, I would like to say it again. Where am I blaming her? I am not blaming her. I am only saying that the video said that she was bowling to Virat. Virat has played only that bowling during the lockdown period. It’s a tennis ball, fun game that people have to pass time during the lockdown. That’s all. Where am I blaming her for Virat’s failures?”", "A remark made by commentator Sunil Gavaskar during RCB vs KXIP on September 24 was blown out of proportion on both mainstream and social media, leading actor Anushka Sharma to say that Gavaskar made “sweeping” and “distasteful” comments on her private life.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]