["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The set of the Democratic primary debate hosted by NBC News on June 27, 2019, in Miami, featured flag imagery and a patriotic color pallet of red, white and blue. (AP Photo/Wilfredo Lee)", "In the race to the White House, who is the most patriotic candidate? Not the Democrats, a recent Facebook post suggests.", "\"Not a single American flag at the Democrat Debate,\" reads the text next to a photo of the presidential candidates who participated in the first of two nights of debates hosted by NBC.", "The image was posted on Facebook on June 27, before the second debate, and riled up some commenters who took the opportunity to denounce the Democratic Party’s values.", "This post, which was shared more than 4,300 in less than 24 hours, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "A spokeswoman for NBC News did not immediately respond to PolitiFact’s email asking about the claim. But looking at photos of the debate, we found more than the digital image of a White House that appears behind the candidates in the Facebook post.", "This Getty photo, for example, shows the NBC News logo with the red and white stripes of the flag, and a graphic behind the candidates that resembles a flag rippling in the wind. Red, white and blue and stars and stripes dominate the stage. You can see more such photos here and here.", "Additionally, we found photos of a number of candidates sporting American flag lapel pins, including Rep. Tim Ryan, Rep. Tulsi Gabbard, former Maryland congressman John Delaney, New York City Mayor Bill DeBlasio", "There are no physical flags in the pictures. But searching for photos of the 2016 Republican presidential debates, it appears similar sets were used — lots of stars, stripes and an American color palette.", "Searching through pages of Getty Images photos from the first debate, we saw none with a physical American flag made of cloth. But the stage had a digital set that prominently featured images of the flag — including one hanging on the White House image that appears in the Facebook post — and several candidates wore flag pins on their lapels.", "We rate this claim False.", "Facebook post, June 27, 2019", "Slate, \"Wednesday’s debate showed the Democrats are (mostly) moving left,\" June 27, 2019", "Google Image search for \"Democratic debate night 1,\" June 28, 2019", "Google Image search for \"Republican presidential debate 2016,\" June 28, 2019", "Getty Images, Photos of the Democratic presidential debate, visited June 28, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]