["About this rating", "Tim Kaine stepped down as DNC chair in 2011 and was replaced by Debbie Wasserman Schultz.", "Kaine vacated the spot to run for a Senate seat at the behest of President Obama, Wasserman Schultz wasn't the only DNC member considered for the chair role in 2011, and President Obama (not Tim Kaine) was the main driver of Wasserman Schultz's selection.", "In late July 2016 the above-reproduced rumor began circulating online, holding that Hillary Clinton's running mate, Senator Tim Kaine of Virginia, had been chair of the Democratic National Committee (DNC) until he was replaced by Debbie Wasserman Schultz (a former Clinton campaign manager) in 2011 — a move undertaken as part of a long-con plan to influence the 2016 election, agreed to by Kaine in exchange for Clinton's promise to select him as her running mate in 2016.", "The graphic displayed above was credited a Reddit user, and the comment that inspired it appeared in a 26 July 2016 r/adviceanimals thread reacting to Wikileaks' DNCLeaks. The claim it presented was double-layered: One aspect considered the timeline of events and tenure of DNC chair Wasserman Schultz, and the second pertained to speculative backroom deals made between key players to influence the 2016 election.", "In the comment on which the image was based, the Redditor said:", "OK, so we all know Debbie Wasserman Schultz (DWS) was the co-chair of Hillary's 2008 presidential run, where she lost the nomination to Obama. So, in order to lock down the nomination for 2016, Hillary was able to get DWS in charge of the DNC and manipulate it from within. That's the theory anyway, except ...", "In order for this to work, they would first have to, not only get the DNC chair to step down, but also get them to recommend DWS for the position. The Clinton's would have to promise something to that person, something more prestigious than being head of the Democratic party. So who was that person and what did they get in return?", "It would appear that Donna Brazile was in-line to get the position, but she was only the interim chair after the previous chair left, served only one month. According to this, https://rulers.org/usgovt.html#parties, the previous chair of the DNC prior to DWS was Tim Kaine.", "The last paragraph of the rumor was easy to corroborate. Kaine indeed was chair of the party's national committee until 2011, after which Wasserman Schultz filled the vacancy following a month in which Donna Brazile served as interim chair:", "After establishing a largely accurate timeline, the rumor flowed into stickier territory that pertained to unknowable motives and potential deal-brokering behind closed doors. However, both Kaine's departure and Wasserman Schultz's appointment were newsworthy in their own right in 2011 and generated plenty of political news coverage. On 5 April 2011, the Washington Post reported Kaine's decision to step down as DNC chair in order to pursue a soon-to-be vacant Senate seat:", "Timothy M. Kaine announced that he would run to succeed retiring Sen. James Webb, giving Virginia Democrats a marquee candidate for a race that could help determine control of the U.S. Senate and the political direction of a rapidly evolving state.", "“I’m running!” Kaine said on his Twitter feed, adding a link to a video highlighting his record as a Richmond City Council member and mayor, as well as governor of Virginia. Kaine, who stepped down as chairman of the Democratic National Committee, followed up with an e-mail to supporters about his decision.", "According to that article, Kaine's decision to seek election to the U.S. Senate was secondary to his position of DNC chair until fellow Democrats, including President Obama, urged him to pursue the former:", "Kaine had previously suggested that he wasn’t interested in running for Senate. He was lobbied by senior Democrats in Virginia and across the country, most conspicuously by President Obama, a friend and political ally.", "Obama, who defied recent history by winning Virginia in 2008, is likely to make the state a central front in his reelection effort in 2012, and each man hopes that the other’s presence on the ticket will help him win.", "Kaine is the only Democrat to officially announce a Senate campaign, with most others in the state saying they would defer to him. The exception is Rep. Robert C. “Bobby” Scott, who has said he would decide on a Senate bid by July.", "Because Kaine’s decision has been widely expected — especially since he told a University of Richmond law school class that he was “increasingly likely” to run, according to a spokesman — the rhetorical battle lines for the contest have already been drawn.", "Just as news coverage cited President Obama as a factor in Kaine's decision to step down and seek a Senate seat, so too did contemporaneous reporting suggest that the appointment of Wasserman Schultz to the DNC chairmanship was driven by Obama's preferences:", "President Barack Obama has chosen Florida Rep. Debbie Wasserman Schultz as the incoming chairwoman of the Democratic National Committee, the party announced.", "Wasserman Schultz, 44, was chosen for her strength as a fundraiser and as a television messenger and for her clout in the crucial swing state of Florida, the sources said.", "She will succeed Tim Kaine, who announced that he will run for U.S. Senate from Virginia.", "The committee announced the choice in an email to members from Vice President Joe Biden.", "“In selecting Debbie to lead our party, President Obama noted her tenacity, her strength, her fighting spirit and her ability to overcome adversity,” Biden wrote.", "An earlier article about Kaine's presumed bid for the Senate in 2011 and political chatter about his replacement mentioned that Wasserman Schultz did not have a direct line to the DNC chair position, and several other choices were also on the table:", "Democratic National Committee Chairman Tim Kaine is on the verge of a Senate run, but Team Obama wants to broaden the search beyond the two top candidates to succeed him — former Ohio Gov. Ted Strickland and Florida Congresswoman Debbie Wasserman Schultz, Democrats say.", "Strickland and Wasserman Schultz are very much in contention, sources close to the process tell POLITICO, but President Obama’s political team has expanded its hunt for a more out-of-the-box candidate for a job they view as central to keeping the White House and the Senate in 2012.", "“All bets are off,” said one top Democrat ... But there’s a growing sense in Obama’s orbit that while either Strickland or Wasserman Schultz would be acceptable candidates, neither would represent the kind of bold stroke that characterizes Obama’s electoral style.", "Sources close to the matter didn’t proffer any other names, but POLITICO has learned that there are other beyond-the-Beltway Democrats being considered for the post.", "“Debbie and Ted have been hanging out there for a while. But now there’s definitely a third choice, and maybe a fourth said,” a senior aide said. “They want to make a splash.”", "None of these reports prove the backroom deal hypothesis is incorrect, but they did suggest Wasserman Schultz wasn't moved to the DNC chair position without hesitation or consideration of other options. Moreover, such reporting tacked Kaine's departure directly to his decision to seek a Senate seat at the behest of President Obama and not a deal to garner a spot on the national ticket five years in the future.", "Separate contemporaneous coverage in the New York Times also addressed Wasserman Schultz's ties to Clinton but noted that the former had hopped aboard the Obama train with alacrity in 2008:", "The party vacancy attracted several potential candidates, including former Gov. Ted Strickland of Ohio. He was among the finalists for the position, officials said, but heading into the 2012 presidential election year, when women voters will be among the key constituencies, the president was encouraged by advisers to select Ms. Wasserman Schultz.", "Four years ago, Ms. Wasserman Schultz supported Senator Hillary Rodham Clinton in the Democratic presidential primary fight, but she quickly switched her loyalties to Mr. Obama when he became the presumptive nominee. She campaigned aggressively on his behalf for the rest of the 2008 campaign.", "In light of information readily available at the time, the chain of events (Kaine's Senate run, the search for a successor, and Wasserman Schultz's appointment) appeared far more innocuous than it does now based purely on considering a timeline. It was true that Wasserman Schultz succeeded Kaine in 2011 (with Donna Brazile serving in the interim for a month), and it was also true Wasserman Schultz campaigned for Clinton before flipping for Obama in 2008. But given the number of articles discussing up to four considered replacements for Kaine at the DNC, and the reasons for his 2011 Senate run, the theory's suppositions would require years of false posturing in the media to cover up the purported deal.", "Viewed through the lens of the July 2016 #DNCLeaks scandal (which revealed that the purportedly neutral committee actively worked as an arm of the Clinton campaign and sought to sabotage the campaign of fellow Democrat Bernie Sanders), the claim about Tim Kaine's vacating his seat as DNC chair sounded somewhat plausible. But the events the claim was based upon it had occurred five years earlier and seemed unlikely as a form of early collusion intended to stack the deck in favor of another future Hillary Clinton presidential bid — at the very least, the claim posited an far-sighted plot to fabricate a Senate seat vacancy to \"excuse\" Kaine's departure and deliberate efforts to plant false information about purported contenders for the spot of DNC chair before Wasserman Schultz was appointed. Finally, no reporting at the time suggested that Tim Kaine had \"recommended\" Wasserman Schultz as his replacement; rather, such reports held that President Obama did.", "WikiLeaks' October 2016 \"Podesta Emails\" dump involved an exchange between a public relations specialist and former informal Clinton advisor and Clinton campaign chairman John Podesta indicating that Kaine may have been tapped for the VP spot as early as July 2015. An e-mail with a subject of \"Bob Glennon\" sent by Erick Mullen to Podesta on 15 July 2015 stated:", "Won't stop assuring Sens Brown and Heitkamp (at dinner now) that HRC has personally told Tim Kaine he's the veep.", "A little unseemly", "Allen, Mike and Molly Ball.   \"Wasserman Schultz to Lead DNC.\"\r\n    Politico.   5 April 2011.", "Pershing, Ben.   \"Kaine Quits as DNC Head, Enters U.S. Senate Race to Succeed Virginia’s Webb.\"\r\n    Washington Post.   5 April 2011.", "Thrush, Glenn.   \"Post-Kaine DNC Up in the Air.\"\r\n    Politico.   2 April 2011.", "Zeleny, Jeff.   \"Wasserman Schultz Picked as D.N.C. Chairwoman.\"\r\n    The New York Times.   5 April 2011.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]