["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Christina Pipkin cries as she visits a makeshift memorial at the site of a mass shooting in El Paso, Texas, on Aug. 5, 2019. (AP)", "After a gunman killed at least 22 people at an El Paso Walmart and shopping center, a rumor about Immigration and Customs Enforcement — the federal agency responsible for enforcing immigration law — spread virally on social media.", "\"ICE just rolled up to the school where the families are reunifying after the El Paso shooting to check citizenship papers,\" said a meme on a maroon background posted on Aug. 3, 2019.", "The post, which did not provide any independent sourcing, was shared more than 24,000 times. It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "However, the meme is incorrect.", "When we contacted Immigration and Customs Enforcement, a spokeswoman said that \"ICE does not conduct immigration enforcement operations during tragedies like the one that recently impacted El Paso, Texas. This is not a time to compound one tragedy upon another by spreading fear in our community with false rumors of ICE operations.\"", "The statement reiterated what ICE had tweeted on Aug. 4.", "Despite false rumors to the contrary, ICE does not conduct immigration enforcement operations during tragedies like the one that recently impacted El Paso, Texas. (4/5)", "The agency added that ICE personnel do routinely participate in the initial response to local tragedies, and did provide such support to local and state law-enforcement officials in the immediate aftermath of the El Paso shooting.", "However, ICE’s role in this immediate response, by policy, does not include immigration enforcement operations, the agency said.", "Another federal agency, the west Texas office of Customs and Border Protection, also tweeted that its personnel did not conduct any \"enforcement operations at area hospitals, the family reunification center or shelters. We stand in support of our community.\"", "Rumors continue to circulate on social media that CBP/Border Patrol is targeting victims of the tragic shooting. These statements are untrue. CBP personnel have returned to regular duties which include hospital watch duties for those in our custody requiring medical attention.", "A widely shared social media post said that \"ICE just rolled up to the school where the families are reunifying after the El Paso shooting to check citizenship papers.\" While ICE did help back up state and local law enforcement officials in the immediate aftermath of the shooting, the agency said that immigration enforcement is specifically prohibited in such situations.", "We rate the statement False.", "Facebook post, Aug 3, 2019", "Immigration and Customs Enforcement, tweet, Aug. 4, 2019", "CBP West Texas, tweet, Aug. 4, 2019", "El Paso Times, \"ICE: Rumors of immigration enforcement during El Paso mass shooting false,\" Aug 5, 2019", "Snopes.com, \"Did ICE Check Citizenship Papers After the El Paso Shooting?\" Aug. 5, 2019", "Email interview with Leticia Zamarripa, public affairs officer with the Department Of Homeland Security and Immigration and Customs Enforcement, Aug. 6, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]