["About this rating", "Puerto Rico Governor Ricardo Rosselló said on 3 October that the federal government had denied an earlier request by Puerto Rico for food stamps rules to be waived so that recipients could use EBT cards to purchase hot foods.", "The U.S. Department of Agriculture granted Puerto Rico's 28 September request for a \"hot food\" waiver, and denies rejecting any earlier such request.", "It's unclear what Governor Ricardo Rosselló was referring to when he mentioned an initial request for a hot food waiver being denied by the federal government.", "With relief and recovery efforts still under way in Puerto Rico, after a series of hurricanes in the fall of 2017, reports emerged on 3 October that the Trump administration had denied the United States commonwealth the same food stamp assistance earlier given to the hurricane-stricken states of Texas and Florida.", "We received several enquiries from readers about the veracity of these reports.", "The Hill reported that Trump had denied Puerto Rico's request to \"let hurricane victims use food stamps for prepared hot meals.\" The web site's original article has been updated, but an apparent excerpt from the original piece on the Democratic Underground blog reads:", "Puerto Rico Gov. Ricardo Rosselló says the federal government has denied the U.S. territory's request for its citizens to redeem food stamps for ready-to-eat hot meals, amid widespread food shortages and power outages in the aftermath of Hurricane Maria.", "That information, according to the updated article on The Hill, came from an earlier New York Times report, which has itself been updated and now reads:", "Though Mr. Rosselló said on Tuesday that the federal government had denied a request to allow hurricane victims in Puerto Rico to use food stamps at fast-food restaurants and other places that serve prepared hot meals, officials at the Department of Agriculture, which oversees the federal nutrition program, said they sent a letter to Puerto Rico on Sept. 30 approving a waiver that would allow food-stamp recipients to use their benefits to buy hot food.", "Under normal circumstances, the rules of the Nutrition Assistance Program (NAP, commonly known as food stamps) mean electronic benefit transfer (EBT) cards cannot be used to purchase these kinds of foods. Texas and Florida have successfully asked the Food and Nutrition Service (FNS), the Department of Agriculture agency that oversees NAP, for temporary emergency waivers on this rule in light of the damage caused by hurricanes in those states.", "In a press conference on Tuesday 3 October, Ricardo Rosselló said that Puerto Rico had petitioned the federal government for a waiver on hot food and fast-food restaurants, and that he hoped to receive that waiver.", "The relevant section of this video of Rosselló's press conference starts at 1.20.", "I have submitted a petition so that FNS [the Food and Nutrition Service] can - so we can request a waiver for FNS so that some of the food stamps and the moneys provided to the most vulnerable population could be used for purchasing in fast food establishments with pre-made foods.", "The reason being that this will give accessibility to the people of Puerto Rico to get prepared and hot food, and as we're seeing, a lot of these establishments are starting to develop effectiveness. So we've made that petition, and expect a waiver so that the people of Puerto Rico that depend on this can actually get some hot food for them and for their families.", "However, we know that a request for a \"hot food\" waiver made by Puerto Rico's Department of Family and Children on 28 September was agreed to by the Food and Nutrition Service on 30 September - three days before Rosselló's remarks. This is made clear in a letter included in The Hill's updated article.", "Later in the press conference, though, Rosselló says a previous request for a hot food waiver was denied. The relevant exchange there starts at around the 34.45 mark. His comments were made in Spanish, but can be translated as follows:", "There was an initial request made at a lower level, which was denied.", "This was reflected in a report about the press conference by the Puerto Rican news web site El Nuevo Dia, which wrote (translated from Spanish):", "The Governor said there was an initial petition to the federal government so that NAP recipients could purchase prepared food, but that was denied, so this new petition is a reconsideration.", "It's not clear whether the governor was erroneously referring to the 28 September request as having been denied, or referring to an earlier request, while erroneously describing the 28 September request as still pending.", "We were unable to contact the offices of either Puerto Rico's governor or Secretary of Family and Children, who made the 28 September request. In a statement, the U.S. Department of Agriculture told us they were not aware of any earlier request for a hot food waiver, but had given the Puerto Rican government \"technical assistance\" on that issue.", "The Department of Agriculture provided us the following chronology of correspondence, requests and responses surrounding the suspension of food stamps rules in Puerto Rico:", "We were unable to contact the offices of either Governor Rosselló or the Department of Family and Children, in order to ask whether they regard this timeline as complete and accurate. Phone service is still down for much of the island.", "The 30 September letter - published by The Hill in its updated article - was written by Patricia Dombroski, Mid-Atlantic Region Administrator for the Department of Agriculture's Food and Nutrition Service, and addressed to Glorimar Andujar-Matos, Secretary of Family and Children in Puerto Rico.", "Among other provisions, it states that:", "We approve the request to waive your state plan requirements and allow hot foods to be purchased at certified retailers utilizing the EBT portion of the NAP card, and allow the cash portion for purchases of hot foods at any retail outlet for the months of October and November.", "However, the Food and Nutrition Service did not agree to every food stamps-related request made by Puerto Rico's Department of Family and Children.", "The department had requested that the cash portion of each recipient's monthly NAP allotment should be increased from 20 percent to 50-100 percent - meaning recipients would have been able to withdraw half or even all their food stamps allocation as cash.", "The FNS denied this request, and instead decided to postpone for two months a new rule which would have lowered the cash portion from 20 percent to 15 percent. The rule was originally due to kick in at the start of October.", "On 3 October, Governor Ricardo Rosselló wrote to Agriculture Secretary Sonny Perdue to ask him to reconsider that denial, and the request is pending, as of 5 October 2017.", "Weixel, Nathaniel.  \"Trump Officials Allow Puerto Ricans to Use Food Stamps for Hot Food.\"\r\n  The Hill.  3 October 2017.", "Healy, Jack; Robles, Frances; Nixon, Ron.  \"Aid is Getting to Puerto Rico. Distributing it Remains a Challenge.\"\r\n  New York Times.  3 October 2017.", "El Nuevo Dia.  \"Rosseló Pide una Reconsideración para Flexibilizar Requisitos del PAN.\"\r\n  El Nuevo Dia.  3 October 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]