["About this rating", "In December 2019, a photograph supposedly showing then-first lady Nancy Reagan with Mr. T in a Santa Claus costume in the early 1980s was posted to the Old School Cool section of Reddit:", "This is a genuine photograph of the former first lady and the star of the action television show \"The A-Team.\"", "In addition to being a star, Mr. T was also an anti-drug advocate. In 1983, Nancy Reagan, who had recently launched her \"Just Say No (To Drugs)\" campaign, invited Mr. T (born Lawrence Tureaud) to the White House for a Christmas event.", "Mr. T, who wore a sleeveless Santa suit and entertained guests as the first lady gave reporters a tour of the holiday decorations, described the invitation as the most \"surprising\" thing to happen to him in a 2008 interview:", "When I got invited to the White House to meet Ronald Reagan in 1983. Nancy Reagan was campaigning to get kids to say no to drugs, and they heard about me going round schools telling kids to stay away from drugs. It was a real honour for a black kid from the ghetto who grew up on welfare.", "A contemporary news report from UPI noted that at one point the \"First Lady took her turn perching on Santa's lap,\" which prompted Mr. T. to joke \"Burt Reynolds, eat your heart out.\"", "An archived video from ABC News also shows her sitting on Santa Claus' (a.k.a. Mr. T's) lap:", "https://abcn.ws/1P4kzRN", "The viral photograph at the center of this article was reportedly taken by Mary Anne Fackelman, a photojournalist who eventually was assigned to cover the first lady. We have been unable to find an official copy of this photograph. However a postcard version on Card Now exists.", "Nancy Reagan once again invites a popular hero to preside at the White House Christmas festivities for children. Youngsters adore Mr. T and instinctively know he's a nice guy. Mrs. Reagan appreciates his support in fighting drugs, his interest in young people, and his indefatigable entertaining for her Christmas children. With his usual attire of pounds and pounds of glittering gold, Mr. T gets in the Christmas spirit by donning the red and white Santa suit to pass out goodies and treat children to his uplifting presence. December 12, 1984.", "A number of other photographs of the former first lady and Mr. T in his Santa suit are available via Getty Images. The Ronald Reagan Presidential Library has the following image in its archives:", "UPI.   \"Mr. T Plays Santa at the White House.\"     13 December 1983.", "Robinson, Will.   \"Nancy Reagan dead: Mr. T remembers Just Say No work with former First Lady.\"\r\n    Entertainment Weekly.   7 March 2016.", "The Independent.   \"The 5-minute Interview: Mr T, Actor.\"\r\n    16 February 2008.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]