["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Barack Obama's re-election campaign released a Web-based tool called \"The Life of Julia\" to show how his policies benefit women of all ages.", "The Obama campaign has created Julia, a character on its website, to show the contrasts between President Barack Obama and Mitt Romney.", "\"The Life of Julia\" is a Web cartoon that claims Julia would have a richer and more rewarding life under Obama than under Romney.", "The cartoon compares the candidates' impact on Julia at a dozen points in her life. For this item, we're checking the claim about Julia at age 25.", "\"Under President Obama: After graduation, Julia's federal student loans are more manageable since President Obama capped income-based federal student loan payments and kept interest rates low. She makes her payments on time every month, keeping her on track to repay her student loans.\"", "\"Under Mitt Romney: Under the Romney/Ryan budget, interest rates on federal student loans would be allowed to double, affecting Julia and 7.4 million other students.\"", "That surprised us because we recalled Romney and House Republican leaders saying recently that they did not want the rates to double. So we looked into the claim.", "What’s at stake", "First, some background on the student loan issue.", "As PolitiFact Ohio noted recently, the College Cost Reduction and Access Act (H.R. 2669) was passed by Congress in 2007. The law gradually reduced the interest rate on federally subsidized loans to undergraduate student borrowers from 6.8 percent in July 2006 to 3.4 percent in July 2011.", "Advanced by a newly Democratic-majority Congress, the law had bipartisan support. Democrats were joined by 77 House Republicans and 35 Senate Republicans. The bill was signed by President George W. Bush.", "The law expires in July and if no action is taken, the interest rate will return to 6.8 percent. That would affect more than 7 million borrowers, and add $1,000 a year to the repayment cost of the average loan, according to Education Secretary Arne Duncan.", "Obama's budget proposal for fiscal 2013 included money to extend the lower rate, though only for one year. Romney, Ryan and House Republican leaders would also keep it at 3.4 percent, although they want to pay for it by repealing a portion of the Democratic health care law.", "Romney’s position on the loan issue", "During a campaign of sharp disagreements, the student loan rate is a rare example of unity between Obama and Romney.", "At an April 23, 2012, campaign appearance near Philadelphia, Romney said, \"I support extending the temporary relief on interest rates for students\" given the \"extraordinarily poor conditions in the job market.\"", "The Associated Press reported that Romney did not offer specifics on how the extension should be paid for or how long it should last, and as we will explain below, resolving these differences will not be easy.", "Still, the comments indicate that Julia's rates wouldn't rise under Romney as the cartoon suggests.", "Romney’s position on the Ryan budget", "But note that Obama campaign attempts to link Romney to the budget produced by Rep. Paul Ryan, R-Wis. Democrats have made the Ryan budget a centerpiece of their attacks since it would likely lead to deep cuts in federal spending, including reductions in popular programs.", "The Obama campaign pointed us to two pieces of evidence to link Romney to Ryan’s budget.", "First, Romney said at a March campaign event in Chicago, \"I'm very supportive of the Ryan budget plan. It's a bold and exciting effort on his part and on the part of the Republicans, and it's very much consistent with what I put out earlier. ... I applaud it. It's an excellent piece of work and very much needed.\"", "Second, the Obama campaign quotes Ryan saying on the March 25, 2012, edition of CBS’ Face the Nation that he expects Romney to implement his budget proposal if he wins the presidency. When CBS’ Norah O’Donnell asked Ryan, \"If Mitt Romney became president of the United States, you`re convinced he would follow through with a lot of the reductions that you make in this plan?\" Ryan twice said \"yes.\"", "But these statements are hardly a slam-dunk that Romney has embraced the entire Ryan budget -- nor that it will be enacted. While Romney praised the proposal, he stopped short of promising to enact it.", "Then there’s the question of what the Ryan budget would actually do regarding student loans.", "What Ryan would do", "The Ryan budget is a blueprint, with significant discretion left for future congressional actions on the specifics about revenues and spending. Nowhere in the budget does it say, \"Allow the rates on student loans to double.\" The budget could result in a doubling of rates (or perhaps a smaller increase) if that’s what Congress chooses to do in the future. However, Congress could choose to protect the lower interest rates and cut elsewhere instead.", "\"Democrats are claiming that the House-passed budget doubled the rate because it did not directly address the question of how to extend it,\" said Conor Sweeney, a spokesman for the House Budget Committee, which Ryan chairs. \"This is not how a budget works. The budget sets overall targets and gives committees of jurisdiction broad latitude in meeting those targets.\"", "As it happens, the brouhaha on the campaign trail over student loans prompted Republican leaders on April 27 to vote on a bill to stop the rate from doubling. The bill would continue the 3.4 percent rate and pay for it by repealing a provision of Obama’s health care law known as the Prevention and Public Health Fund. The bill passed by a 215-195 vote. The coalition in support was predominantly but not exclusively Republican; 13 Democrats voted for the GOP leadership-backed bill while 30 Republicans defected and voted against it.", "So both parties want to keep the rate the same. The sticking point is how to pay for it. Many Democrats, including the White House, are strongly opposed to repealing the health fund, which supports immunization, research, screenings and wellness education. House Speaker John Boehner, R-Ohio, has labeled the money a \"slush fund,\" a characterization Republicans have long used for the program. PolitiFact rated the term as a Pants on Fire falsehood a year ago.", "Sweeney, the Ryan spokesman, said the bill that passed the House \"is fully compatible with our budget’s targets.\" And Ryan himself voted for it.", "The parties are so polarized that it's not clear how they might compromise on the issue. Still, a majority of the House, including a large majority of Republicans, did go on record to support a bill that would keep the interest rate from doubling.", "Our ruling", "The Obama campaign claims that loan rates would double on Julia under Romney and the Ryan budget. But the evidence suggests otherwise.", "Romney opposes allowing the rates to double, and House Republicans -- including Ryan -- have voted to stop it from happening. Their approach to pay for the extension may not suit the White House, but it's inaccurate to say the rates would double. We rate the claim False.", "Barack Obama for President, \"The Life of Julia,\" accessed May 4, 2012", "POLITICO, \"Romney endorses Ryan budget,\" March 20, 2012", "Washington Post, \"Obama, Romney focus on student debt as campaign issue,\" April 23, 2012", "CBS News, transcript of Face the Nation, March 25, 2012", "Associated Press, \"Romney Backs Student Loan Proposal Obama Supports,\" April 23, 2012", "Associated Press, \"Obama, Romney seek to stop doubling of student loan interest rate,\" April 24, 2012", "Associated Press, \"Speaker: House to vote Friday on student loans,\" April 25, 2012", "PolitiFact Ohio, \"House Speaker John Boehner labels money in health care bill 'slush funds,'\" March 31, 2011", "PolitiFact Ohio, \"John Boehner tweets that Dems voted to double student loan interest rates,\" May 1, 2012", "Vote tally for the Interest Rate Reduction Act, April 27, 2012", "Email interview with Steve Ellis, vice president of Taxpayers for Common Sense, May 4, 2012", "Email interview with Brendan Buck, spokesman for House Speaker John Boehner, May 4, 2012", "Email interview with Conor Sweeney, spokesman for House Budget Chairman Paul Ryan, May 4, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]