["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "One of Elena Kagan's top credentials -- that she was dean of Harvard Law School -- created some controversy on the day that President Barack Obama announced her nomination to the U.S. Supreme Court. As dean, Kagan took a lead role in trying to keep military recruiters off campus because of the \"Don't Ask, Don't Tell\" policy that prevents gays and lesbians from serving openly in the military. Several Republicans pointed to that episode in their initial comments on Kagan, calling the incident troubling. Sen. John Barrasso, R-Wyo., also pointed out that the incident put her on the losing side of a Supreme Court ruling.At Harvard Law School, Barrasso said, \"She took a position and the Supreme Court ruled unanimously that she was wrong.\" Barrasso said he was keeping an open mind on the nomination. We were interested in fact-checking his statement that the Supreme Court \"ruled unanimously that she was wrong.\" The controversy over military recruiters began even before Kagan became dean of Harvard Law in 2003. Harvard was one of several top-tier law schools that attempted to ban military recruiters because of the policy that prevented gays and lesbians from serving openly in the military. In 2003, Kagan penned a letter to the law school community expressing her thoughts on the issue: \"I abhor the military's discriminatory recruitment policy. The importance of the military to our society -- and the extraordinary service that members of the military provide to all the rest of us -- makes this discrimination more, not less, repugnant. The military's policy deprives many men and women of courage and character from having the opportunity to serve their country in the greatest way possible. This is a profound wrong -- a moral injustice of the first order. And it is a wrong that tears at the fabric of our own community, because some of our members cannot, while others can, devote their professional careers to their country.\"Congress threatened to yank federal funding for schools that banned recruiters through a measure known as the Solomon Amendment, named for Rep. Gerald Solomon, R-N.Y., and first passed in 1996. Schools and recruiters tried to sort out their differences in the intervening years, with some schools providing partial access. But eventually the issue came before the Supreme Court in 2004 in a case known as Rumsfeld vs. Forum for Academic and Institutional Rights, known as FAIR. FAIR was an association of law schools that opposed the Solomon Amendment.In her role as a professor of law at Havard, Kagan signed onto an amicus brief (sometimes known as a \"friend of the court\" brief) filed by 40 Harvard professors that argued that the federal government should not be able to withhold funding if the schools applied the same policies to all recruiters. Harvard, for example, required all recruiters to sign forms indicating they would not discriminate against applicants based on sexual orientation. The withholding of funds interfered with the schools' freedom of expression to oppose what they felt were discriminatory policies.The Harvard law professors argued in their brief that \"this case is not -- and has never been -- about whether law schools may 'discriminate' against the military or whether they must provide 'equal access' to military recruiters. Instead, the question is whether the Solomon Amendment confers upon military recruiters the unprecedented entitlement to disregard neutral and generally applicable recruiting rules whenever a school's failure to make a special exception might incidentally hinger or preclude military recruiting. The answer is 'no.'\"The Supreme Court, however, disagreed in an 8-0 ruling on March 6, 2006. The majority opinion, written by Chief Justice John Roberts, ruled against FAIR and, in doing so, rejected the claims of Kagan and the other law professors that the school had the right to enforce non-discrimination policies against the military. \"Under the statute, military recruiters must be given the same access as recruiters who comply with the policy,\" the opinion said.The court also rejected arguments that claimed that the law schools' treatment of military recruiters could be considered expression under the First Amendment. If the action itself were purely expressive, the court reasoned, the schools would not have to issue statements explaining their actions. The court compared the situation to someone who says he won't pay his income taxes because he disapproves of the Internal Revenue Service. The disapproval is protected speech, but the non-payment of taxes is not.The opinion was supported by Justices John Paul Stevens, Antonin Scalia, Anthony Kennedy, David Souter, Clarence Thomas, Ruth Bader Ginsburg, and Stephen Breyer joining Roberts. Justice Samuel Alito did not participate because he had not yet been seated to the court when oral arguments were made. Barrasso said Kagan \"took a position and the Supreme Court ruled unanimously that she was wrong.\" The court did reject the arguments put forward by the law schools, which included FAIR and the brief filed by the Harvard professors. All of the justices who voted opposed the law schools' arguments. So we rate Barrasso's statement True.", "Fox News, Barrasso ready to question Kagan, May 10, 2010", "FindLaw, Rumsfeld v. Forum for Academic and Institutional Rights (FAIR), March 6, 2006", "The Oyez Project,  Rumsfeld v. Forum for Academic and Institutional Rights (FAIR)   ,  547 U.S. ___ (2006), accessed May 6, 2010. Amicus brief submitted by Harvard Law School Faculty, Rumsfeld v. Forum for Academic and Institutional Rights (FAIR), 2004SolomonResponse.org, Documents Related to FAIR v. Rumsfeld, May 6, 2010", "The Harvard Law Record, Kagan e-mails school, Oct. 6, 2003", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]