["The post begins: “On Wednesday, Dr. Oz had a show on the fastest growing cancer in women, thyroid cancer,” referring to a syndicated television program featuring Dr. Mehmet Oz, broadcast throughout North America.", "The post -- which was shared on Facebook here, here and here and on Instagram here and here -- goes on to recommend that women ask for a “thyroid guard” when receiving a mammogram in order to protect against thyroid cancer.", "Medical experts said the advice about mammography is false.", "Dr. Sandhya Pruthi of the Mayo Clinic, a non-profit US medical center, has explained: “One study estimated that during a mammogram, which involves two X-rays per breast, a woman’s thyroid is exposed to the equivalent of 30 minutes of natural radiation. Even over many years of annual mammograms, this amount of additional radiation is considered tiny.”", "The Canadian Cancer Society estimated that 8,200 Canadians would be diagnosed with thyroid cancer in 2019. According to Health Canada, women get thyroid cancer “three times more often than men,” and it is diagnosed more than any other form of cancer in people 15-29 years old in Canada, according to Thyroid Cancer Canada.", "This stands in contrast to the false post’s assertion that mammography, a procedure usually recommended for women age 40 and older, would be a key cause of thyroid cancer.", "Although there is no one cause, Canada’s health authority states that the risk of developing cancer in the gland goes up with a family history of the disease, and with too little or too much iodine in a person’s diet.", "According to the Mayo Clinic, a key risk factor is exposure to high levels of radiation, including “radiation treatments to the head and neck and fallout from sources such as nuclear power plant accidents or weapons testing.”", "A mammogram “is a non-invasive X-ray used to check breasts for breast cancer and other abnormalities. It is the only test shown to reduce breast cancer deaths,” according to the American College of Radiology.", "“The radiation to the thyroid is negligible during a mammogram,” Dr. Paula Gordon, one of Canada’s leading experts in breast cancer detection and diagnosis, told AFP by phone.", "Gordon explained that “thyroid shielding is unnecessary” and that the lead in the shield may interfere with the imaging, leaving a woman needing another screening.", "The link between the claim and the “Dr. Oz” show appears to date back to 2011. Representatives for the “Dr. Oz” show did not respond to requests for comment, but this article, currently available under the “cancer” section on the show’s website, contradicts the advice in the social media posts.", "It cites this 2012 study conducted at Emory University in the US state of Georgia, which found that “thyroid shielding during mammography is unnecessary and may increase retakes rather than afford radiation protection of the thyroid.”", "\"Overall the study of cancer as it relates to diagnostic radiation use is very difficult because of many limitations including that cancer is very common in the population in general and cancer that may have been caused by radiation doesn't look any different than another cancer,\" Dr. Susanne Perschbacher, Oral and Maxillofacial Radiologist and Assistant Professor at the University of Toronto, told AFP by email.", "However, Perchabacher told AFP that shielding is recommended in patient protocols for dentists unless it would interfere with the image, such as in panoramic radiography.", "A large study published by the American Thyroid Association examined the risks from dental X-rays and found that repeated exposure without a thyroid shield increased the risk of thyroid cancer.", "The American Dental Association updated its recommendations for limiting patient radiation exposure in 2012. It specifically states: “Examples of good radiologic practice include use of protective aprons and thyroid collars, when appropriate.”", "The Canadian Dental Association also recommends shielding.", "Research has examined the quality of health recommendations made on medical talk shows, including the “Dr. Oz” show, finding mixed results. For example, a 2014 study led by Dr. Christina Korownyk of the University of Alberta determined, “Approximately half of the recommendations have either no evidence or are contradicted by the best available evidence.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]