["About this rating", "On June 9, 2020, the streaming service HBO Max announced that it was temporarily pulling the 1939 movie \"Gone With The Wind\" from its library due to its depiction of slavery, the Civil War, and Black Americans, and that when the movie returned, it would be accompanied by a discussion on the movie's historical context.", "The announcement sparked a flurry of messages on social media, with some arguing that pulling the movie for its depiction of race was hypocritical, even though it was the vehicle that led to the first Academy Award for a Black actress, Hattie McDaniel.", "Others noted, however, that while McDaniel was the first Black person to win an Oscar, her win at the 1940 Academy Awards was somewhat overshadowed by the fact that she was forced to sit in the back of the room where the event was hosted, separate from her white co-stars.", "The 12th Academy Awards were held at Coconut Grove Nightclub in the Ambassador Hotel on Feb. 29, 1940. \"Gone With the Wind\" was the most nominated film of the night, and the movie's white stars were seated at a table near the main stage.", "The Hollywood Reporter noted that the Cocoanut Grove had a strict \"no blacks\" policy, and that McDaniel was only allowed to be inside the building after David Selznick, the movie's producer, called in to request a special favor:", "The 12th Academy Awards were held at the famed Cocoanut Grove nightclub in The Ambassador Hotel. McDaniel arrived in a rhinestone-studded turquoise gown with white gardenias in her hair ... McDaniel then was escorted, not to the Gone With the Wind table — where Selznick sat with de Havilland and his two Oscar-nominated leads, Vivien Leigh and Clark Gable — but to a small table set against a far wall, where she took a seat with her escort, F.P. Yober, and her white agent, William Meiklejohn. With the hotel's strict no-blacks policy, Selznick had to call in a special favor just to have McDaniel allowed into the building (it was officially integrated by 1959, when the Unruh Civil Rights Act outlawed racial discrimination in California).", "The 2008 book \"African Americans and the Oscar: Decades of Struggle and Achievement\" noted that McDaniel was the first Black actor to attend an Academy Awards banquet, but also noted that the award-winning actress was relegated to a table in the back of the room:", "The Academy Awards ceremony took place at the Coconut Grove of the Ambassador Hotel in Los Angeles on February 29, 1940. Hattie was the first African American attendee at an Academy banquet. She was relegated to sitting with her escort at a rear table away from the Caucasion attendees, but Hattie was too much of the consummate professional to complain.", "A video from the Oscars' YouTube channel gives a longer (although not complete) look at her speech. As Fay Bainter presents the award, the camera cuts to show prominent white actors in the crowd, but McDaniel is nowhere to be seen:", "https://www.youtube.com/watch?v=e7t4pTNZshA\n\nThe above-displayed video from the Oscars YouTube channel also omits McDaniel's approach to the stage. We've reached out to the Academy to see if the full video (or any photographs of McDaniel's table are archived) and will update this article if more information becomes available.", "It should also be noted that McDaniel was not invited to the premiere of \"Gone With the Wind\" in 1939. The premiere was held in Atlanta, Georgia, which at the time had strict segregation laws. Selznick attempted to get some of the Black actors who worked on the film, including McDaniel, invited to the premiere, but MGM studios advised against it because she would not have been allowed to sit in the theater with her white co-stars.", "Here's a relevant excerpt from a 2010 biography of Clark Gable:", "Among other cast members flown in were Ona Munson, Laura Hope Crews, Evelyn Keyes, and Ann Rutherford. None of the black actors were represented. David Selznick had at least attempted to bring Hattie McDaniel, but MGM advised him not to because of Georgia's segregationist laws, which would have required McDaniel to stay in a colored-only hotel and prevented her from sitting in the theater with her white peers.", "Here's a video from the Smithsonian about McDaniel and the bigotry she faced after filming \"Gone With the Wind\":", "https://www.youtube.com/watch?v=in_xAcNZYRw", "Abramovitch, Seth.   \"Oscar's First Black Winner Accepted Her Honor in a Segregated 'No Blacks' Hotel in L.A..\"\r\n    Hollywood Reporter.   19 February 2015.", "Bauer, Laura.   \"Hollywood Heroines: The Most Influential Women in Film History.\"\r\n    ABC-CLIO.   7 December 2018.", "Harris, Warren.   \"Clark Gable: A Biography.\"\r\n    Crown.   2010.", "Pallotta, Frank.   \"'Gone With the Wind' Pulled From HBO Max Until It Can Return with 'Historical Context'.\"\r\n    CNN.   19 June 2020.", "Mapp, Edward.   \"African Americans and the Oscar: Decades of Struggle and Achievement.\"\r\n    Scarecrow press.   2008.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]