["The video was published in this Facebook post on February 18, 2020. It has been viewed more than 5,700 times.", "The 15-second clip shows Zhong speaking in Mandarin with a hospital patient lying on a bed. Their comments can be translated to English as:", "Patient: \"...not sure if caused by serious coughing.\"\n\tZhong: \"I see, coughing is serious. Let me discuss with Director Chen.\"\n\tPatient: \"Sorry to trouble you.\"\n\tZhong: \"Will discuss, take it easy.\"\n\tPatient: \"Save me.\"\n\tZhong: \"Yes, take it easy. You are still young.\"", "The logo for Douyin, the Chinese version of video-sharing app TikTok, can be seen in the bottom right-hand corner of the video.", "The Facebook post’s traditional Chinese-language caption translates to English as: “Professor Lin Zhengbin is the leader in the field of organ transplantation in China. When academician Zhong Nanshan visited Professor Lin, the top professional of the country, Professor Lin begged, ‘save me!’", "“It’s terrifying to see academician Zhong wearing such little protective equipment!”", "Below is a screenshot of the misleading Facebook post:", "Zhong is a prominent scientist at China’s National Health Commission who helped expose the scale of the SARS outbreak that killed hundreds of people in both mainland China and Hong Kong in 2003.", "Professor Lin, a chief physician at Tongji Hospital in Wuhan, who died of novel coronavirus at the age of 62 on February 10, 2020, according to Health Times, a newspaper published by Chinese state media People’s Daily.", "As of February 26, COVID-19 has killed more than 2,600 people and infected almost 80,000 others, mostly in China, according to this AFP report.", "The same footage of Zhong was also shared alongside a similar claim on Facebook here, here and here; on Twitter here, here and here; and on YouTube here and here.", "The claim is false; the footage has been taken from a television programme broadcast by Chinese state media channel CCTV in 2016. It shows Zhong meeting with a 71-year-old patient with chronic obstructive pulmonary disease that year.", "The same footage was found in this episode of the programme, Great Masters, which was published on CCTV’s science and education YouTube channel on October 12, 2016.", "The video’s simplified Chinese headline translates to English as: “20161012 Great Masters respiratory specialist Zhong Nanshan”. The clip can be seen from the 21-minute 58-second mark to the 22-minute 10-second mark in the video.", "Below are screenshot comparisons of the misleading video (L) and the CCTV video (R):", "In the clip, a voiceover can be heard referring to the man in the hospital bed as a \"71-year-old lung disease patient\" before Zhong appears on screen.", "“On a normal working day of May 2016, Zhong Nanshan was in the office of Respiratory Research Institute, having a small consultation for a 71-year-old lung disease patient through CT images. According to hospital tests, the patient had chronic obstructive pulmonary disease,” the voiceover states from the 19-minute to 19-minute 24-second in the video.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]