["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Names are drawn for the first members of Austin’s district-drawing commission in this photo live-tweeted on the @austintexasgov account May 22, 2013. Alan McQuinn photo / City of Austin", "When Austin announced the first members of a commission that will draw new City Council districts, Republican political consultant Derek Ryan offered quick analysis.", "Eight names were drawn May 22, 2013, and within a couple of hours Ryan, a voter data specialist and former research director for the state Republican party, tweeted, \"Seven are D primary voters, only one has voted in an R primary.\"", "Some might think that 88 percent Democratic sounds about right for Austin, the \"blueberry in the tomato soup\" of Texas politics. In fact, 70 percent of recent voters in party primaries in Austin voted exclusively in Democratic primaries from 2006 through 2012, with 22 percent participating exclusively in Republican primaries, according to numbers that Democratic pollster Jeff Smith of Austin ran for us.", "Voting in a primary election doesn’t necessarily prove someone’s political lean, though in Texas it’s the closest signal available from voting records. Texans do not register to vote by party affiliation; anyone can vote in either primary, even switching from election year to election year.", "In Austin, where many down-ticket races field no Republican opposition, sometimes the only way a voter can affect the outcome is by choosing between Democratic candidates in the primary. In the same way, it often makes sense for voters in, say, Midland, to commit to the county’s Republican primary.", "Council races in Austin are nonpartisan, and while city ordinance says the commission should have \"diversity by race, ethnicity, gender and geography,\" it doesn’t specify any restrictions on members’ politics. But we looked into whether Ryan got the commission members’ votes right.", "In November 2012, Austinites voted to switch the council from seven citywide members to 10 district representatives and a mayor, starting with the November 2014 election.", "Some 550 people applied to be on the 14-member commission that will draw the new districts’ maps by Dec. 1, 2013. A panel narrowed the pool to 60 finalists, then city staffers drew names at random, according to the city’s website. The new members will choose six more from the pool of finalists to round out the group.", "Ryan told us by email, \"When the eight were announced, I did a quick check on those individuals,\" looking at records from the 2006, 2008, 2010 and 2012 primaries. Afterward, he said, he got curious about the other eligible applicants and calculated that 55 percent voted in the 2012 Democratic primary and 24 percent voted in the Republican primary.", "He started his research, Ryan said, with information from the commission applications the city posted online. Then he matched each applicant’s information to his own voter database, which he said he compiled from information kept by county clerks’ offices and the Texas secretary of state, the state’s chief elections officer.", "The applicants whose names were drawn for the commission were Magdalena Blanco, Mariano Díaz-Miranda, Rachel Farris, Phil Hewitt, Carmen Llanes Pulido, Art Lopez, Anna Saenz and Maria Solis.", "All except Llanes Pulido were registered Travis County voters from 2006 through 2012; according to Smith’s records, Llanes Pulido was registered in Travis from 2007 through 2012. If she voted in the 2006 primary somewhere else, Smith said, it probably was not in Texas, because his records showed no voting history for her before the 2007 general election.", "At our request, Travis County Tax Office spokeswoman Tiffany Seward looked up each new commission member’s 2006-2012 primary voting record and emailed us the results.", "2006", "2008", "2010", "2012", "Magdalena Blanco", "D", "D", "R", "R", "Mariano Diaz-Miranda", "No vote", "D", "D", "D", "Rachel Farris", "No vote", "D", "D", "D", "Phil Hewitt", "D", "D", "D", "D", "Carmen Llanes Pulido", "Not registered in Travis", "D", "D", "D", "Art Lopez", "D", "D", "D", "D", "Anna Saenz", "No vote", "D", "No vote", "No vote", "Maria Solis", "No vote", "D", "D", "D", "We sought to speak with all eight for their views and reached everyone but Saenz, although Blanco, Farris, Hewitt and Lopez declined to comment. Farris, incidentally, writes the MeanRachel.com blog, where she is identified as a Democratic activist who also writes for the Huffington Post.", "Three commissioners who voted in the latest three Democratic primaries said by telephone that voting records did not tell the whole story and party politics won’t bear on the commission’s job.", "Llanes Pulido told us, \"I consider myself politically independent; I do not consider myself a Democrat.\" She dislikes how primaries cause voters to identify themselves with a party, she said, and as an elections judge had asked voters, \"In which primary would you like to participate?\" rather than \"Are you a Democrat or a Republican?\" Party leanings are not germane, she said, \"because the Austin City Council is a nonpartisan council and the elections are nonpartisan elections.\"", "Díaz-Miranda said Ryan’s tweet wasn’t relevant. \"The job we’re doing is to try to bring more people to feel represented,\" he said. He considers himself independent, he told us. \"I’ve also voted Republican here,\" he said; as an example, he said, he voted for Terry Keel for Travis County sheriff (a post Keel held from 1992 to 1997 before serving as a Republican state representative from Austin).", "Solis said, \"I’m not going to give you an opinion about my politics because that’s not what this is about. … I think I’m a well-informed, balanced person that will vote on what we’re supposed to be doing and not on my party preference.\" The commission’s job, she said, is to give voters representation that is \"hopefully more within their own area, and hopefully they will know the people that they are voting for.\"", "Our ruling", "Ryan said the first choices to draw Austin’s council districts are seven Democratic primary voters and one GOP primary voter.", "Records show that six of the eight members voted in the three Travis County Democratic primaries from 2008 through 2012, and two of the six also voted in the county’s 2006 Democratic primary. One commissioner voted in the 2008 Democratic primary and didn’t vote in any others. One voted in two Democratic primaries and two Republican primaries since 2006.", "We rate his statement as True.", "CLARIFICATION, 11:30 am, June 5, 2013: We revised this story to clarify that 70 percent of recent voters in party primaries in Austin cast ballots exclusively in Democratic primaries. The original version said 70 percent of Austinites had recently voted exclusively in those primaries. This revision did not affect our rating of the claim.", "Tweet from Derek Ryan, Ryan Data & Research, May 22, 2013", "Telephone and email interviews, excerpted, with Derek Ryan, May 29-31, 2013", "Austin American-Statesman news story, \"Eight members chosen for Austin districts commission,\" May 22, 2013", "Telephone interview with Patricia Fraga, Public Information Office, City of Austin, May 30, 2013", "Telephone interview with Jeff Smith, pollster, Opinion Analysts, May 30-June 2, 2013", "Spreadsheet, data on Austinites voting in at least one of the four most recent primaries, produced for PolitiFact Texas by Jeff Smith of Opinion Analysts, May 31, 2013", "Telephone and email interviews with Tiffany Seward, director of communications and training, Travis County Tax Office, May 31, 2013", "City of Austin ordinance 20120802-051, accessed June 3, 2013", "City of Austin web page, \"10-One Redistricting Portal,\" accessed June 3, 2013", "Telephone interviews with Magdalena Blanco, Mariano Díaz-Miranda, Rachel Farris, Phil Hewitt, Carmen Llanes Pulido, Art Lopez and Maria Solis, May 31-June 2, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]