["About this rating", "A raw analysis of unadjusted statistics for fiscal year 2016 shows that on average Senator Warren's male staffers earned more than her female staffers.", "The analysis excluded relevant data and failed to include criteria necessary to prove the claim that women on Senator Warren's staff were paid less than their male counterparts for equivalent work.", "On 4 April 2017, the Washington Free Beacon published a report stating that Elizabeth Warren of Massachusetts, who is considered one of the more politically progressive members of the U.S. Senate, pays her male staffers more than she pays her female staffers, despite the her emphatic public statements on behalf of equal pay for female workers:", "[W]omen working for Warren were paid just 71 cents for every dollar paid to men during the 2016 fiscal year, according to a Washington Free Beacon analysis.", "The median annual earnings for women staffers, $52,750, was more than $20,000 less than the median annual earnings for men, $73,750, according to the analysis of publicly available Senate data.", "When calculated using average salaries rather than median, the pay gap expands to just over $26,051, or about 31 percent.", "Consistent with previous Free Beacon analyses of Senate salary data, only full-time staffers who were employed for the entire period in question were included in the calculations.", "For example, Warren's former chief of staff Mindy Myers and her male replacement Dan Geldon were not included because neither worked the full year.", "Among employees employed the entire year, only one woman, Warren's director of scheduling, earned a six-figure salary, at $100,624.88.", "Five men — Warren's director of oversight and investigations ($156,000), legislative director ($149,458), deputy chief of staff ($119,375), Massachusetts state director ($152,310), and deputy state director ($113,750) — earned more than Warren's highest paid woman staffer in 2016.", "However, the implied claim that Warren pays women less than men for equivalent work is flawed because the Free Beacon report didn't account for differing pay among job titles — in other words, it was an apples-to-oranges comparison that didn't actually compare the pay of workers of both genders who perform equivalent job duties. The report also only used salary data for staffers who worked in Warren's office for the full 2016 fiscal year (which spanned parts of 2015 and 2016), a selective and arbitrary timeframe that eliminated the most obvious comparison available.", "In regards to the latter point, we note that Mindy Myers, a woman, and Daniel Geldon, a man, held the same position as Warren's chief of staff consecutively. As Chief of Staff in 2015, Myers earned $164,458, and when she left at the end of the year (and later accepted a position as executive director of the Democratic Senatorial Campaign Committee), she was replaced by Geldon, whose salary is the same as hers was, according to salary data from the Secretary of the Senate. The Free Beacon excluded Myers and Geldon from their analysis on the basis that neither worked for Warren throughout the full 2015-2016 fiscal year and therefore didn't note that the two were paid equally for holding the same job position.", "As to the former point, Brad Fitch, chief executive officer at the Congressional Management Foundation (a nonprofit dedicated to improving operations in Congress and citizen engagement with lawmakers), noted that in order to fairly assess gender pay parity, researchers must take into account variables such as experience and education levels, as well as staff turnover and the reality that people with different job titles earn different salaries — factors not considered in the Free Beacon's analysis:", "The methodology used in the analysis is flawed; they combined positions and people at different levels in the office. It's the equivalent of comparing a female astronaut to a male welder to conclude some people get paid more than others. If you compare a staff assistant to a chief of staff, it’s not a fair comparison.", "Fairly comparing pay rates between men and women who work in Senator Warren's office is therefore a challenge because not many of her staffers hold the same job titles, and even among those who do, pay discrepancies between men and women are not obvious when education and experience are factored in. For example, of the ten people who were \"regional directors\" on Warren's staff in the first half of the 2016 fiscal year, the highest-paid was a man who holds a J.D. and has worked for Warren since 2012. The second-highest paid was a woman who was promoted and received a raise in the second half of the year, setting her pay higher than that of the highest-paid male regional director (but also changing her job title).", "Additional factors not considered include that at least one of Warren's staffers, Lauren Miller, also works for the senator's campaign, so her office salary of $69,324 in the 2016 fiscal year is probably only part of her full compensation. Additionally, Kaaren Hinck earned $118,332 in 2015 as an adviser to Warren, but she wasn't included in the report because she left her job halfway through the fiscal year. Yet another woman whose pay wasn't counted was Tracey Lewis, who earned $33,000 while working as Warren's state strategic adviser for just 4 months.", "Salary information for Senator Warren's staff is publicly available through the Secretary of the Senate's office, but the Free Beacon's use of only the most recent fiscal year's data, their exclusion of high-earning women on Senator Warren's office staff due to narrow (and seemingly arbitrary) selection criteria, and their non-consideration of job duties and titles doesn't support the implication that Senator Warren pays women less than men for equivalent work. At best, it shows that male staffers earned more than female staffers in Senator Warren's office because more men occupied the top positions among her staff during a selected time frame.", "Scher, Brent.   \"Elizabeth Warren’s Female Staffers Made 71% of Male Staffers’ Salaries in 2016.\"\r\n    Washington Free Beacon.   4 April 2017.", "Bowman, Bridget.   \"DSCC Names First Female Executive Director.\"\r\n     Roll Call.   21 December 2016.", "U.S. Government Publishing Office.   \"Report by the Secretary of the Senate.\"\r\n    11 May 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]