["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump’s rapid ascension from reality TV star and businessman to presumptive Republican nominee is truly historic, former House Speaker Newt Gingrich, R-Ga, said in a post on Twitter.", "Shortly after Trump secured enough delegates to officially clinch the GOP nomination, Gingrich extolled Trump in a post on social media. \"No one in American history has moved from a June 16 announcement to a May 26 winning of a majority,\" Gingrich told his 1.55 million followers. \"Trump's achievement is remarkable.\"", "Many do see Trump’s victory as remarkable. And Gingrich would have been on firmer ground had he stuck to the narrative of Trump's ascension rather than focusing on the timeline.", "But the speed at which Trump went from his announcement at Trump Tower to becoming the GOP standard bearer isn’t a remarkable achievement.", "Trump announced his candidacy for president June 16, 2015, in New York, and officially clinched the GOP nomination May 26, 2016, after 29 unbound delegates said they would support Trump.", "That’s a span of 346 days, if you include May 26.", "We didn’t have too look too far to find shorter spans for non-incumbents.", "John Kerry in 2004", "John Kerry didn’t announce his run for the White House until Sept. 2, 2003, and he clinched the Democratic nomination May 5, 2004. That’s a speedy 246-day window.", "George W. Bush in 2000", "Republicans, too, have been much quicker.", "George W. Bush announced his run for the White House June 12, 1999. He clinched the GOP nomination after the primaries of March 15, 2000,  a span of 278 days.", "Al Gore in 2000", "In the same election, Al Gore needed a little less time. Gore announced his run June 16, 1999, while clinching the same day as Bush, March 15, 2000. That’s 274 days.", "Bob Dole in 1996", "Bob Dole, a senator from Kansas, announced his campaign April 10, 1995, and clinched the Republican nomination March 19, 1996. That’s 345 days, one fewer than it took Trump.", "Bill Clinton in 1992", "Bill Clinton announced his campaign for president Oct. 3, 1991. Even though he didn’t clinch the Democratic nomination until June 2, 1992, he still only needed a total of 244 days — more than 100 days quicker than Trump.", "For the record, Trump took a few weeks less than Mitt Romney in 2012 and John McCain in 2008, and he easily bested Barack Obama, who needed about 16 months in 2008.", "A spokesman for Gingrich, Ross Worthington, said Gingrich's point was that no one has won the nomination from a standing-start in such a short period.", "\"The other nominees you mention did not begin running for president on their announcement day,\" Worthington said. \"Instead, they were clearly running, or at least preparing to run, for months or even years before they made an official announcement. They all had significant preexisting political operations and held significant political offices. The achievement that Newt is referring to is starting from zero to winning the nomination outright.\"", "Our ruling", "Speaking of Trump’s path to becoming the 2016 GOP standard-bearer, Gingrich said: \"No one In American history has moved from a June 16 announcement to a May 26 winning of a majority.\"", "Whatever Gingrich was trying to say, it didn't come out quite right. As one person replied to the former speaker on Twitter, \"This tweet sounds smart and impressive if someone doesn't have Google.\"", "Of the last eight non-incumbent presidential nominees, five (Kerry, Gore, Bush, Dole and Clinton) went from announcing their candidacy to becoming the presumptive nominee quicker than Trump.", "This claim is historically wrong. We rate it Pants on Fire!", "Newt Gingrich, Twitter post, May 26, 2016", "Email interview with Ross Worthington, May 27, 2016", "NPR, \"Donald Trump clinches GOP nomination,\" May 26, 2016", "Date duration calculator", "John Kerry presidential announcement, Sept. 2, 2003", "John Kerry clinches nomination, May 5, 2004", "George W. Bush presidential announcement, June 12, 1999", "George W. Bush clinches nomination, March 15, 2000", "Al Gore presidential announcement, June 16, 1999", "Al Gore clinches nomination, March 15, 2000", "Bob Dole presidential announcement, April 10, 1995", "Bob Dole clinches nomination, March 19, 1996", "Bill Clinton presidential announcement, Oct. 3, 1991", "Bill Clinton clinches nomination, June 2, 1992", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]