["“I Got This CDC Vaccine Results Data That Is Updated Every Friday, Check This Out: Moderna Vaccine, Has Killed 271 People & Hospitalized 611 People. Pfizer Vaccine, Has Killed 387 People & Hospitalized 791 People (sic),” reads the caption in a Facebook post published on February 14, 2021.", "Below the caption is what appears to be a screenshot from the CDC database that tracks reactions to vaccines in the US — the so-called Vaccine Adverse Event Reporting System (VAERS).", "However, the post misrepresents the CDC data. It also incorrectly reports the current tally for adverse reactions among people who have received the Pfizer-BioNTech vaccine.", "Since the United States began its Covid-19 vaccination campaign on December 14, 2020, VAERS has registered the deaths of 934 people (0.0018%) who have gotten a shot. In its latest update, the CDC said no link had been established between the reported deaths and the vaccine.", "“A review of available clinical information including death certificates, autopsy, and medical records findings revealed no link with vaccination,” the institution wrote in a statement on its website on February 16, 2021.", "“To date, VAERS has not detected patterns in cause of death that would indicate a safety problem with COVID-19 vaccines.”", "VAERS tracks all “adverse” reactions to vaccines, both “serious and non-serious”, including “cardiac arrest” and “injection site pain”.", "A search on VAERS on February 22, 2021, found that 429 people who received a Pfizer-BioNTech shot have died and 1,061 hospitalised. For the Moderna vaccine, the tally stands at 382 deaths and 821 hospitalisations. These numbers are updated every Friday. However, experts emphasise that these deaths are not directly linked to the vaccines for Covid-19.", "“VAERS does not determine if reports of death were caused by Covid-19 vaccine”, CDC spokesman Curtis Gill told AFP Fact Check.", "“For these reports, which are classified as serious, CDC makes an attempt to follow up and to get medical records: hospital records, clinic records, death certificates, and autopsy reports to verify and better understand the adverse event.”", "Some of the “adverse events” reported could be true adverse reactions to the vaccine, while others might be coincidental and not linked to getting the shot, Gill noted.", "“It is important to remember that classification as a serious report does not mean those adverse events were caused by the vaccine,” he said.", "As of February 22, 2021, more than 63 million doses of Covid-19 vaccines have been administered in the United States, and nearly 19 million people have received both shots, according to the CDC’s Covid Data Tracker.", "Both the CDC and Food and Drug Administration physicians review every reported death, including a deceased’s medical records. So far, they have found no connection between the deaths and the vaccines being administered in the United States.", "“Covid-19 vaccines were rigorously studied during clinical trials and will continue to be monitored now that they are being used by the public. When combined with other protective measures, vaccines are one of the best tools we have to fight the pandemic,” Gill said.", "Last month, similar claims (fact checked here) were made in Norway that people died because of the Pfizer-BioNTech vaccine. Norwegian health authorities stated that there is no direct causal link between these deaths and the Covid-19 vaccine administered, as AFP reported.", "Similar misleading posts appeared in German, alongside a claim that Norway halted its Pfizer-BioNTech vaccination campaign, which is false. AFP Fact Check debunked this here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]