["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Alex Jones, a conspiracy-minded conservative commentator, said the Charlottesville, Va., protests and counter-protests on Aug. 11-12, were staged acts of civil unrest funded by liberal interests to hurt conservatives and President Donald Trump.", "In a pair of videos posted on his website Infowars.com, Jones accused the Southern Poverty Law Center of going to \"central casting\" to hire actors to \"dress up as white supremacists.\" There is no evidence that is true, and Jones provided no evidence to support his claim in his video.", "Jones then claimed the foundation for the Charlottesville protests is seen in emails between the Democratic Party and George Soros, a billionaire who often supports liberal causes.", "\"It was clear once Trump got inaugurated, they were going to go for civil unrest,\" Jones said.", "\"If you go back to the Wikileaks, from over a year ago, the Democratic Party is sending emails to George Soros and back and forth at the highest levels of the Democratic Party saying, ‘We’re losing the public. Minorities are getting into the free market. We (Democrats) want to keep people in their mother’s basement as baristas.’", "\"Remember even Hillary said that. ‘What are we going to do to keep control of them? Keep them in the dark, keep them desperate.’", "\"These are quotes. Hundreds and hundreds of emails,\" Jones said.\" We’ve covered them … linking to them.\"", "While Jones offered no evidence the Charlottesville protests were staged, he did say there are quotes from Soros, Clinton or Democratic Party officials in emails talking about controlling minorities and stoking fear in the public to \"keep them desperate\" and \"keep control of them.\"", "So we decided to see if there is any evidence of that.", "We couldn’t find any. (We reached out to Jones through the media contact form on his Infowars.com website and did not hear back.)", "For this fact-check, we consulted three email batches Jones could be talking about -- the emails Hillary Clinton made public during her time as secretary of state (search the government database), the leaked emails of Clinton campaign chairman John Podesta (search the Podesta emails), or the leaked emails of the Democratic National Committee (search the DNC email database).", "Jones claimed the \"Democratic Party is sending emails to George Soros and back and forth at the highest levels of the Democratic Party saying, ‘We’re losing the public. Minorities are getting into the free market. We (Democrats) want to keep people in their mother’s basement as baristas.’\"", "There are 15 emails in the DNC email database that mention the word \"Soros,\" and five of those come from Politico email newsletters. Of the remaining 10, five reference news coverage and one is text of a speech from Trump referencing Soros (\"Forget Soros, leave him alone, he’s got enough problems.\")", "The other four are from May 22, 2016, and discuss a mobile application someone was building to support the Democratic nominee. The developer of the application was looking for funding for the project, including from Soros.", "We also searched under Soros’ Open Society Foundation or OSF. We found four additional emails, the most interesting of which appears to be a communications officer for OSF trying to schedule a tour of the White House.", "We did find an email, which Infowars has written about, that Soros sent to Clinton while she was secretary of state (see the email).", "The 2011 email is about unrest in Albania, which included a series of anti-government protests amid corruption charges.", "In the email, Soros asks Clinton to bring \"the full weight of the international community\" to try and ease tensions in the country. Soros writes that he is particularly concerned of the actions of Albania’s prime minister and that Soros has heard of videotape showing national guard members firing on demonstrators.", "Infowars also has written about a 2014 email from Podesta’s account in which Clinton campaign manager Robby Mook said Clinton would only attend a fundraiser for a Soros-supported group, America Votes, \"to make Soros happy.\"", "The most recent emails leaked from Podesta’s account are from March 2016, and seem to be related to a meeting between Soros and Podesta.", "\"In general I think George is more interested in talking about policy than the campaign per se, though I can’t imagine you won’t spend some time on politics,\" Soros aide Michael Vachon wrote (read the email). \"In a separate email I will send you George’s latest thinking on the migration crisis, which he is spending a lot of time on. His other big preoccupation these days is Ukraine. Both the migration crisis and Ukraine are part of his view of Europe as falling apart, and the US as ultimately not doing enough to prevent the political disintegration of its most important ally.\"", "Here’s the bottom line: Whatever the emails say about Soros’ access to top Democrats, including Clinton, they don’t say anything akin to what Jones claimed.", "It’s a bit easier to triangulate what Jones was talking about when he said, \"Remember even Hillary said that. ‘What are we going to do to keep control of them. Keep them in the dark, keep them desperate.’ \"", "He’s likely referring to leaked audio of a February 2016 Clinton fundraiser in which Clinton was talking about the supporters of Bernie Sanders. Infowars wrote about this, too.", "Here is what Clinton said (bold emphasis is ours):", "Clinton: \"Some are new to politics completely. They’re children of the Great Recession. And they are living in their parents’ basement. They feel they got their education and the jobs that are available to them are not at all what they envisioned for themselves. And they don’t see much of a future. I met with a group of young black millennials today and you know one of the young women said, \"You know, none of us feel that we have the job that we should have gotten out of college. And we don’t believe the job market is going to give us much of a chance.\" So that is a mindset that is really affecting their politics. And so if you’re feeling like you’re consigned to, you know, being a barista, or you know, some other job that doesn’t pay a lot, and doesn’t have some other ladder of opportunity attached to it, then the idea that maybe, just maybe, you could be part of a political revolution is pretty appealing. So I think we should all be really understanding of that and should try to do the best we can not to be, you know, a wet blanket on idealism. We want people to be idealistic. We want them to set big goals. But to take what we can achieve now and try to present them as bigger goals.\"", "You can listen to the comments here, courtesy of the Intercept, but you can see how Jones distorts Clinton’s comments.", "Jones said Democrats wanted to keep \"people in their mother’s basement as baristas,\" to \"control them,\" \"keep them desperate.\"", "But Clinton was talking about people new to politics who grew up at a time when opportunities were difficult to find. She never once discussed controlling or keeping people desperate. Clinton did face criticism for describing Sanders supporters as people living in their parents’ basement, but that’s not what Jones was saying.", "Jones said, \"if you go back to the Wikileaks, from over a year ago, the Democratic Party is sending emails to George Soros and back and forth at the highest levels of the Democratic Party saying, ‘We’re losing the public. Minorities are getting into free market. We (Democrats) want to keep people in their mother’s basement as baristas.’ \"Remember even Hillary said that. ‘What are we going to do to keep control of them? Keep them in the dark, keep them desperate.’", "Jones' comments were part of a broader accusation that the events in Charlottesville were staged by liberals and coordinated by top Democrats.", "We can find no evidence that Jones’ broad attack, or his specific claim about comments made by Soros, Clinton or Democrats in emails, checks out. Clinton did describe supporters of Bernie Sanders as working as baristas or living in their parents’ basements. But that’s well short of what Jones alleged.", "We rate this claim Pants on Fire.", "Infowars.com, Exclusive: Virginia riots staged to bring in martial law, ban conservative gatherings,\" Aug. 12, 2017", "Hillary Clinton secretary of state email database, accessed Aug. 14, 2017", "Leaked emails of Clinton campaign chairman John Podesta, accessed Aug. 14, 2017", "Leaked emails of the Democratic National Committee, accessed Aug. 14, 2017", "Infowars, Soros gave Clinton step-by-step instructions on how to tackle Albania unrest – Wikileaks email, Aug. 12, 2016", "Inforwars, ‘Make Soros happy’: Clinton campaign discusses importance of pleasing billionaire in hacked email, Oct. 17, 2016", "RT, ‘Clintons won't forget what their friends have done’: WikiLeaks release #PodestaEmails6,\" Oct. 13, 2016", "Infowars, Clinton describes Sanders supporters as ‘basement-dwellers’ & ‘baristas’ in leaked recording, Oct. 2, 2016", "Los Angeles Times, Campaign 2016 updates: Trump supporters say he's a 'genius' for avoiding taxes, \" Oct. 2, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]