["By Angelo Fichera", "Posted on April 11, 2019", "A meme targeting Rep. Ilhan Omar uses an edited quote to cast doubt on her “allegiance” to the United States.", "Online falsehoods about Rep. Ilhan Omar are in no short supply. We’ve previously covered deceptive claims about the Minnesota Democrat’s religion, her election and her commitment to the U.S. Constitution.", "The latest work of fiction about Omar — one of the first two Muslim women elected to Congress — uses a doctored quote to cast doubt on her fidelity to the U.S.", "“I should not be expected to pledge allegiance to any country … including America,” the popular meme on Facebook reads.", "The meme further asserts that it’s a “Dem representative Ilhan Omar quote.”", "But there’s no evidence Omar ever said that. Instead, the supposed quote is likely a modified version of a remark that Omar made in relation to Israel.", "For context: In early February, Omar was criticized for comments she posted on Twitter about a pro-Israel lobbying group, American Israel Public Affairs Committee, that many viewed as anti-Semitic. House Speaker Nancy Pelosi and other top Democrats denounced “Congresswoman Omar’s use of anti-Semitic tropes and prejudicial accusations about Israel’s supporters” in her tweet as “deeply offensive.” Omar apologized.", "Then, later that month, at a panel discussion, Omar addressed the criticism and in doing so said: “I want to talk about the political influence in this country that says it is O.K. for people to push for allegiance to a foreign country.”", "That comment drew further criticism, with some interpreting the comment as another suggestion of “dual loyalty” on the part of Jewish people. A spokesman for Omar, in a statement to media outlets, argued the quote was being misinterpreted and was about “the undue influence of lobbying groups for foreign interests of all kinds.”", "In a March 3 tweet, responding to a fellow Democratic congresswoman’s criticism, Omar wrote: “Our democracy is built on debate, Congresswoman! I should not be expected to have allegiance/pledge support to a foreign country in order to serve my country in Congress or serve on committee. The people of the 5th elected me to serve their interest. I am sure we agree on that!”", "So, while Omar said she “should not be expected to have allegiance/pledge support to a foreign country,” she did not say the same about the U.S. In fact, her tweet noted that her loyalty was with her constituents in Minnesota’s 5th Congressional District.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“Democratic Leadership Statement on Anti-Semitic Comments of Congresswoman Ilhan Omar.” Press release, Office of U.S. House Speaker Nancy Pelosi. 11 Feb 2019.", "Fabian, Jordan and Brett Samuels. “Trump calls on Omar to resign over remarks condemned as anti-Semitic.” The Hill. 12 Feb 2019.", "Facebook Live video of Progressive Issues Town Hall. Busboys and Poets. Facebook. 27 Feb 2019.", "Omar, Ilhan (@IlhanMN). “Listening and learning, but standing strong 💪🏽.” Twitter. 11 Feb 2019.", "Omar, Ilhan (@IlhanMN). “Our democracy is built on debate, Congresswoman! I should not be expected to have allegiance/pledge support to a foreign country in order to serve my country in Congress or serve on committee. The people of the 5th elected me to serve their interest. I am sure we agree on that!” Twitter. 3 Mar 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]