["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump’s visit to the Sheffer Corp. near Cincinnati was billed as a chance to discuss the recently enacted tax law. While Trump did discuss the tax law, most coverage of the speech led with a digression in which Trump accused Democrats of treason.", "It came as Trump was touting a drop in African-American unemployment, as he had done on several occasions previously. He knocked Democrats for their failure to applaud when he mentioned this during his State of the Union address.", "\"You’re up there, you’ve got half the room going totally crazy, wild — they loved everything, they want to do something great for our country,\" Trump said on Feb. 5. \"And you have the other side, even on positive news — really positive news, like that — they were like death and un-American.  Un-American. Somebody said, ‘treasonous.’ I mean, yeah, I guess, why not? Can we call that treason? Why not? I mean, they certainly didn’t seem to love our country very much.\"", "There’s actually a very good reason why not: The Constitution.", "\"It was a profoundly stupid and ignorant statement,\" said Carlton F.W. Larson, a law professor at the the University of California-Davis who is writing a book about treason and the American Revolution. \"There are occasional hard cases where it is debatable whether something constitutes treason. But this is not one of them.\"", "The White House did not respond to an inquiry for this article, but White House spokesman Hogan Gidley told NBC News the following day that Trump had been \"tongue in cheek,\" and in the daily White House briefing, Press Secretary Sarah Huckabee Sanders said, \"The president was clearly joking with his comments.\"", "Still, we’ve decided to fact-check Trump’s statement for two reasons. First, the long lead-up to the \"treason\" comment came off as entirely serious, and while the reference to \"treason\" itself was uttered in a flip manner, it fell short of being clearly a joke. (Watch the video and judge for yourself here.)", "Second, the Constitution is very clear when it comes to the definition of treason.", "The Constitution -- which mentions very few crimes specifically -- defines treason this way:", "\"Treason against the United States, shall consist only in levying war against them, or in adhering to their enemies, giving them aid and comfort. No person shall be convicted of treason unless on the testimony of two witnesses to the same overt act, or on confession in open court.", "\"The Congress shall have power to declare the punishment of treason, but no attainder of treason shall work corruption of blood, or forfeiture except during the life of the person attainted.\"", "This is a narrow definition. On the most basic level, treason has to occur in wartime, or during an armed rebellion against the government.", "With the possible exception of an American \"levying war\" against U.S. troops in a place like Afghanistan, \"the biggest-picture takeaway is that there is no treason occurring on any side now,\" said Jed Shugerman, a legal historian at Fordham Law School.", "Indeed, Shugerman has previously cautioned those on the left who would label members of Trump’s circle as treasonous for allegedly cooperating with Russia during the 2016 election. The most fundamental reason why the word \"treason\" would be inaccurate in such cases, Shugerman and others argue, is that the United States is not at war with Russia.", "\"We are not at war with Russia under any fair understanding of the word,\" he said. Shugerman added that even a notion like \"cyberwar\" with Russia is a metaphor for war rather than an actual deadly conflict, unless that cyberwar were to escalate to, say, hacking into nuclear power plants with the intent of exploding them.", "Calling U.S.-Russia relations \"war\" is no more accurate than calling the Super Bowl \"war\" just because the players talk about battle plans and how to attack their enemy, he said.", "Because the definition of treason is so narrow, charges have only been brought a few dozen times in the country’s history, and none, apparently, since the end of World War II, which -- perhaps not coincidentally -- was the last officially declared war.", "A rendering of the Whiskey Rebellion. (Wikimedia commons)", "Charges of treason have been prosecuted in relation to the Whiskey Rebellion in 1794; against Aaron Burr (who was acquitted); Thomas W. Dorr, who set up a parallel government of Rhode Island in the 1840s (he was convicted but later pardoned); and a number of cases related to slavery and the Civil War.", "There was a flurry of treason cases during and after World War II, including the poet Ezra Pound for pro-Axis propaganda (he was hospitalized for insanity) and the broadcast propagandists known as Tokyo Rose and Axis Sally (both of whom served prison time).", "The rarity of treason charges can also be seen in the examples of actions that never drew a treason charge.", "When Eugene V. Debs was prosecuted for encouraging draft avoidance during World War I, he was charged with sedition, not treason. During the Cold War, Julius and Ethel Rosenberg were convicted of espionage charges, not treason. (Espionage does not have to occur during wartime, or even against an enemy.) And Jane Fonda was never charged with treason for allegations of anti-Americanism when she consorted with the North Vietnamese during the Vietnam War.", "Legal scholars we contacted unanimously said Trump’s words were ill-conceived.", "\"It’s not only legally frivolous and offensive to suggest that an act of political protest as simple as not clapping isn’t treason, but it’s wholly ignorant of why the Constitution has a treason clause in the first place — to prevent what was a common practice in England at the time, in which the government labeled its political opponents as ‘traitors’ and used that as an excuse to throw them in jail,\" said Stephen I. Vladeck, a law professor at the University of Texas.", "\"Being rude and partisan does not come close to the constitutional definition of treason,\" agreed Robert F. Turner, a fellow at the Center for National Security Law at the University of Virginia.", "Michael C.H. McDaniel, the director of Homeland Security Law Programs at Western Michigan University, said there could hardly be a clearer example of protected political speech than the one Trump decided to label treasonous.", "\"Expressing partisan disagreement with the president is not treason -- in fact, it is political speech, the core speech to which the First Amendment is protecting from the Federal government,\" he said.", "Trump said that at the State of the Union address, Democrats, \"even on positive news … were like death and un-American. Un-American. Somebody said, ‘treasonous.’ I mean, yeah, I guess, why not? Can we call that treason? Why not?\"", "There’s a good reason why not: Declining to applaud the president doesn’t come anywhere near meeting the constitutionally defined threshold of treason, which in any case can’t occur except in wartime. Rather, legal experts agree that it is a clear case of constitutionally protected free speech. We rate the statement Pants on Fire.", "Donald Trump, remarks at the Sheffer Corporation, Blue Ash, Ohio, Feb. 5, 2018", "CNN, \"Donald Trump thinks not clapping for him is 'treasonous,' \" Feb. 6, 2018", "U.S. Constitution, treason provision", "San Francisco Chronicle, \"Few ever charged or convicted of treason in U.S. history,\" Dec. 9, 2001", "Associated Press, \"Past Americans Charged With Treason,\" Dec. 17, 2001", "Washington Post, \"Trump was speaking ‘tongue in cheek’ when he said Democrats were ‘treasonous,’ spokesman says,\" Feb. 6, 2018", "Washington Post, \"Five Myths About Treason,\" Feb. 17, 2017", "Washington Post, \"The Daily 202: Why Trump flippantly accusing Democrats of ‘treason’ is not a laughing matter,\" Feb. 6, 2018", "Jed Shugerman, \"Stop using the word 'treason.' We don’t need to,\" Feb. 15, 2017", "Mark Knoller, tweet, Feb. 6, 2018", "Interview with Jed Shugerman, a legal historian at Fordham Law School, Feb. 6, 2018", "Email interview with Carlton F.W. Larson, law professor at the the University of California-Davis, Feb. 6, 2018", "Email interview with Stephen I. Vladeck, law professor at the University of Texas, Feb. 6, 2018", "Email interview with Robert F. Turner, fellow at the Center for National Security Law at the University of Virginia, Feb. 6, 2018", "Email interview with Michael C.H. McDaniel, director of Homeland Security Law Programs at Western Michigan University, Feb. 6, 2018", "Email interview with Kermit Roosevelt, law professor at the University of Pennsylvania, Feb. 6, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]