["A viral video circulating on the internet claims to show Marines allegedly refusing to salute President Joe Biden on Inauguration Day.", "The one-minute clip shows Biden and Jill Biden walking into the U.S. Capitol as Marines hold open the door.", "\"Notice the Marines do not salute Biden. How did we miss that?\" Infowars personality Owen Shroyer says during the video.", "The claim was shared to Rumble, a site rated as a questionable source by Media Bias/Fact Check,  on Jan. 23 by the account NorthAmericaNews1. The video has over 21,000 views as of Jan. 28.", "USA TODAY reached out to NorthAmericaNews1 and Infowars for comment.", "Fact check: Satirical flyer promotes Capitol siege as Stanford law group event", "The clip of the Bidens walking into the Capitol building is authentic. However, the video was taken before Biden was sworn in as the 46th president.", "A longer version of the original video appeared on CNN, ABC and other news outlets on Jan. 20, with captions stating that Biden and then-Vice President-elect Kamala Harris had just arrived to the Capitol with their families.", "Capt. Joseph Butterfield, a public affairs officer for the Marine Corps, also confirmed to USA TODAY that Biden was president-elect at the time the video was captured and that \"Marines always salute the President of the United States.\"", "As Biden entered the Capitol before being sworn in, the Marines were following protocols and were not required to salute him.", "\"The commentary in the video, as well as the accompanying video title, misrepresents facts and attempts to turn a ceremonial procedure into a political statement,\" Butterfield said in a statement. \"There was no political statement being made, and the Marine Corps proudly remains an apolitical organization.\"", "Fact check: Story of Marine Corps leader rebuking Pelosi is fabricated", "The Marine Corps Drill and Ceremonies manual states that the purpose of the hand salute is \"to demonstrate mutual respect and courtesy between members of military organizations and to show respect to national colors.\"", "By saluting first, no military officer implies that he is inferior to the person whom he salutes, according to Marine Corps University.", "This is not the first time false allegations targeting the Marines and Inauguration Day have appeared on social media.", "The claim that the Marine Corps commandant rebuked House Speaker Nancy Pelosi over security for Inauguration Day has been previously debunked by USA TODAY.", "Fact check:Satirical post claims Biden has labeled Libertarians as terrorists", "A video claiming to show Marines who \"refuse\" to salute Joe Biden is MISSING CONTEXT, based on our research. The video is authentic, but because Biden was not yet sworn in as president, the Marines were not required to render a salute. A Marines Corps spokesperson confirmed that the video and the text accompanying it misrepresent the facts.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]