["About this rating", "December 2018 saw the arrival of a new wrinkle in the so-called \"War on Christmas,\" namely the claim that conservative-leaning entertainers were holding fundraising activities to help save the holiday from annihilation by Christmas-hating liberals.", "Specifically, according to a 6 December article on the consistently misinformative America's Last Line of Defense (LLOD) website, Detroit rock-and-rollers Ted Nugent and Kid Rock together raised more than $10 million for the cause:", "Kid Rock and Ted Nugent have just finished off their charity tour to raise money to fight the War on Christmas. Nugent and Rock, whose real name is Louie, say the money they raise will go first and foremost to the community in and around their hometown of Detroit. Fellow Lions fan and expert on Motown, Art Tubolls, told Rolling Stone:", "“These two are battling the forces of evil in Michigan. People here openly worship Moon Gods and practice Shania Law. The money they raise will go to festive coffee cups for local shops who can’t afford to say ‘Merry Christmas’ or the liberals who buy that crap will put them out of business. They allocated more than $2 million for garland alone for Dearborn. They also have no turkeys or beef available for dinner on the West side of Kalamazoo. Now, with the help of these true Christians, places where Christmas was nearly forgotten are suiting up their mall Santas and putting the Salvation Army Bellringers back to work.”", "However, neither entertainer announced their participation in such a tour (before or after it was supposedly completed), nor did any such report appear in the pages of Rolling Stone. The so-called \"expert on Motown\" quoted above, Art Tubolls, exists nowhere except on the pages of LLOD, which frequently cites that name, along with a constantly rotating set of credentials, whenever an expert source is required for quotation purposes.", "The network of websites and social media accounts comprising LLOD publishes fictional stories with clickbait headlines calculated to attract likes and shares for their politically divisive content. Their \"About Us\" page describes that content as \"satire\":", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical.", "As to the \"War on Christmas,\" any funds currently being raised in the interests of defending the supposedly embattled holiday ought to be regarded as superfluous. Sometime conservative icon and Christmas warrior Bill O'Reilly declared the war over during a segment of his Fox News Channel show in 2006. According to O'Reilly, Christmas won.", "Eagleton, Flagg.   \"Kid Rock, Ted Nugent Raise More Than $10 Million to Fight the War on Christmas.\"\r\n    America's Last Line of Defense.   6 December 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]