["About this rating", "On Nov. 8, 2020, Tim Murtaugh, communications director for President Trump's re-election campaign, posted two images that supposedly showed an issue of The Washington Times newspaper published immediately after the 2000 election that heralded a supposed victory by Al Gore with the headline \"President Gore.\"", "Murtaugh posted these images the day after The Associated Press, The New York Times, Fox News, and several other major news outlets called the 2020 presidential election and projected that Joe Biden and Kamala Harris had defeated U.S. President Donald Trump and Vice President Mike Pence. Murtaugh declared that the \"President Gore\" headline was a reminder that \"that the media doesn’t select the President\":", "Gore famously lost the 2000 election to George W. Bush after a prolonged legal battle over the vote count in Florida.", "While Murtaugh was right to state that the news media do not select the next president, the images he used to illustrate this point were fake. The Washington Times did not put the headline \"President Gore\" on the front page of their paper in 2000, as they noted on Twitter:", "A copy of The Washington Times' front page from Nov. 8, 2000, documents that the newspaper in fact ran a headline declaring George W. Bush the winner of that year's presidential race:", "The fake \"President Gore\" edition of The Washington Times dates back until at least 2010 when it was posted on Deviant Art by user \"Emperor Norton I.\" An \"improved\" version of the image (featuring a fake coffee stain for added authenticity) was shared a few years later on an \"alternative history\" online forum during a discussion thread focused on a fictional version of the 2000 election in which Gore was elected president. That version was accompanied by the message: \"I give thee a gift of photomanipulation from my archive.\"", "It should also be noted that while Murtaugh's claim that the \"media does not select the president\" is accurate, it appears to contradict President Trump's prior claim that the election must be called on election night. News outlets (including Snopes) debunked the president's talking point and explained that while news outlets often \"project\" the winner of an election on election night, the process of officially designating the winner extends for weeks after Election Day.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]