["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump spoke at a campaign rally in Waukesha, Wis., on Sept. 28, 2016. (Rick Wood photo)", "Attacking Hillary Clinton at a rally in Waukesha, Wis., one theme Donald Trump sounded repeatedly was: \"Follow the money.\"", "And one of the attacks during Sept. 28, 2016 remarks was this:", "\"In her campaign for president, Hillary Clinton has received $100 million in contributions from Wall Street and hedge funds.\"", "That’s a colossal figure.", "Is it accurate?", "Hedging bets", "Clinton’s support from the financial sector has made news throughout the campaign. A week before the Trump rally, it was reported that George Soros and two other hedge fund managers had given a total of $5.5 million to Clinton’s campaign or to super PACs supporting her in August 2016.", "But that’s a long way from $100 million.", "If you think you’ve heard that figure before, perhaps it was from a February 2016 report by the Wall Street Journal. It estimated that since Clinton and former President Bill Clinton entered national politics in the early 1990s, Wall Street has contributed more than $100 million to their political campaigns, charitable foundation and personal finances.", "So, that doesn’t help Trump’s claim.", "The campaign figures", "The go-to source on this is OpenSecrets.org, the website of the nonpartisan Center for Responsive Politics.", "The center generally considers \"Wall Street\" and hedge funds to be the securities and investment industry. However, other industries could be added, as well.", "Trump’s campaign didn’t get back to us with evidence to back his claim.", "But we tried to view his claim broadly. We counted contributions to Clinton’s campaign as well as to super PACs that support her. And we counted contributions not only from the securities and investment industry, but also two related industries, as they are categorized by the Center for Responsive Politics.", "To be clear: The contributions don’t come from firms. Rather they come from individual employees or members of the organizations, or political action committees tied to the organizations.", "Here’s what we found (figures are rounded):", "Industry", "Contributions to Clinton campaign", "Contributions to pro-Clinton super PACs", "Total", "Securities and investment", "$7.23 million", "$51.4 million", "$58.6 million", "Miscellaneous finance", "$2.55 million", "$1.18 million", "$3.74 million", "Commercial banks", "$1.9 million", "$55,000", "$1.96 million", "Grand totals", "$11.7 million", "$52.6 million", "$64.3 million", "It’s also worth noting, as the Center for Responsive Politics has reported, that most of the \"Wall Street\" contributions benefiting Clinton \"have come from a tiny group of ultra-wealthy, liberal donors who work in finance. Wall Street more broadly doesn’t have any outsized affection for Clinton, but a relative handful of donors who work in the industry have invested heavily in her.\"", "Meanwhile, the corresponding figures for Trump and super PACs backing him total far less than $2 million.", "(Trump has often said he is \"self-funding\" his campaign, a claim that’s been rated Half True. His campaign accepts contributions, but there’s no question he has funded much of the effort, which might explain in part why Clinton gets so much more money from Wall Street.)", "Our rating", "Campaigning outside Milwaukee, Trump said: \"In her campaign for president,\" Clinton \"has received $100 million in contributions from Wall Street and hedge funds.\"", "The gold-standard source on this subject puts the figure at $64 million.", "We rate Trump’s statement False.", "YouTube, Donald Trump rally (48:20), Sept. 28, 2016", "PolitiFact National, \"Banks paid Hillary Clinton ‘over $1 million and are contributing millions more to elect her,’\" (Half True) March 9, 2016", "Wall Street Journal, \"Hedge Fund Money Has Vastly Favored Clinton Over Trump,\" July 29, 2016", "Center for Responsive Politics, Hillary Clinton summary, accessed Oct. 3, 2016", "Center for Responsive Politics, Hillary Clinton breakdown by industry, accessed Oct. 3, 2016", "Center for Responsive Politics, Hillary Clinton and super PAC breakdown by industry, accessed Oct. 3, 2016", "Center for Responsive Politics, \"Actually, Hillary Clinton’s Wall Street money? More than double that 3 percent,\" Dec. 21, 2015", "Email, Center for Responsive Politics editorial and communications director Viveca Novak, Oct. 3, 2015", "Email, Hillary Clinton campaign spokeswoman Gillian Drummond, Oct. 4, 2016", "Email, Donald Trump campaign spokesman Steven Cheung, Oct. 4, 2016", "CNBC, \"The big hedge funds are betting big on Hillary Clinton,\" Sept. 21, 2016", "Pensions & Investments, \"Hedge fund execs top presidential donor lists,\" Oct. 3, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]