["Shehla Rashid, student leader from JNU, has often being at the receiving end of right-wing trolls on social media. Now, it has been claimed that Rashid has been booked under sections of the IPC for her controversial tweet on Nitin Gadkari and RSS plotting the murder of PM Narendra Modi, a tweet which she subsequently defended as ‘sarcasm’.", "Right-wing accounts on social media have claimed that union minister Nitin Gadkari has filed a case against Shehla Rashid, and that she has been booked under sections of the IPC that pertain to inciting religious sentiments. Among the earliest to tweet this was TheGiniKhan (@giniormet), whose tweet has been retweeted over 3500 times and ‘liked’ over 7300 times. @giniormet is a popular right-wing handle that masquerades as a Muslim woman who is supportive of the BJP.", "Section 153A deals with ‘promoting enmity between different groups’, whereas section 295 pertains to defiling places of worship, and 295A of the IPC addresses ‘deliberate and malicious acts intended to outrage feelings’.", "Shehla Rashid booked under sections of 153A, 295 and 295A of IPC by Nitin Gadkari…..", "— TheGiniKhan (@giniromet) June 10, 2018", "“Shehla Rashid @Shehla_Rashid Has Been Booked Under Sections of 153A, 295 and 295A of IPC by Shri Nitin Gadkari @nitin_gadkari Thank You  Nitin Ji Much Appreciated Now JNU Needs to Take Action & Remove her & Stop Spending Tax Payers Money On Such Crooks @Swamy39 @ShefVaidya”, tweeted Sanatan Dharma, which has more than 7500 followers. The tweet has been retweeted more than 370 times and has accumulated more than 580 likes. An account named after Swati Raina, anchor with Zee Business, has also tweeted this claim which has been retweeted widely. It may be noted that this is not the official account of the journalist.", "Shehla Rashid @Shehla_Rashid Has Been Booked Under Sections of 153A, 295 and 295A of IPC by Shri Nitin Gadkari @nitin_gadkari", "Thank You 🙏Nitin Ji Much Appreciated", "Now JNU Needs to Take Action & Remove her & Stop Spending Tax Payers Money On Such Crooks@Swamy39 @ShefVaidya pic.twitter.com/3FjvHikmIO", "— Sanatan Dharma (@HinduDharma1) June 11, 2018", "Alt News contacted Parliament Street Police Station where it is claimed that the FIR has been lodged, to verify the status of the complaint. The police confirmed that no FIR has been lodged against Rashid, although a complaint has been received and investigation is underway. Moreover, Business Standard reported, The BJP’s youth wing today filed a complaint with the police against Jawaharlal Nehru University (JNU) student leader Shehla Rashid for making “unpleasant remarks” against Union Minister Nitin Gadkari, the organisation said in a statement.", "On June 9, as reports emerged of a possible assassination plot on Prime Minister Narendra Modi, Rashid had tweeted, “Looks like RSS/Gadkari is planning to assassinate Modi, and then blame it upon Muslims/Communists and then lynch Muslims #RajivGandhiStyle“.", "Looks like RSS/Gadkari is planning to assassinate Modi, and then blame it upon Muslims/Communists and then lynch Muslims #RajivGandhiStyle", "— Shehla Rashid (@Shehla_Rashid) June 9, 2018", "The tweet invited a great deal of controversy, following which Rashid claimed that the tweet is ‘sarcastic’. Nitin Gadkari, however, was unimpressed and threatened legal action against ‘anti-social elements’, refraining from naming anyone in his tweet.", "I would be taking legal action on anti-social elements who have made bizzare comments; attributing personal motives to me, regarding the assassination threat to PM @narendramodi", "— Nitin Gadkari (@nitin_gadkari) June 9, 2018", "While her unsubstantiated allegation on Nitin Gadkari and the RSS have understandably caused controversy, it is no justification for misinformation of this nature that has been circulated in her name.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]