["About this rating", "On Sept. 15, 2020, Democratic U.S. presidential candidate Joe Biden sat down with Jose Diaz-Balart for an interview on Telemundo Noticias. Shortly after the interview aired, a 26-second clip started to circulate in conservative circles that purported to show how Biden was \"caught red-handed\" using a teleprompter — insinuating that Biden's answers were scripted. This clip reached a wider audience on Sept. 21, when U.S. President Donald Trump's son Eric shared the clip with the comment: \"Unreal!\"", "Biden was not caught red-handed using a teleprompter. This clip is missing context and is being shared with a bad-faith accusation in an attempt to smear the presidential candidate.", "Biden's interview with Telemundo featured a number of questions from potential voters via a video stream that was broadcast on a nearby screen. In the above-displayed clip, Biden is addressing a woman on this video screen. When the video goes dark, he appears to say, \"OK, I lost that line,\" meaning that the video feed had gone dark. Diaz-Balart then tells Biden not to worry about the feed, and says, \"we can talk, you and I, on that\" issue.", "Here's a still from Telemundo's broadcast showing what was on this screen a few moments before the viral clip at the center of this false rumor:", "When Diaz-Balart was asked if Biden was using a teleprompter during this interview, he told Politico reporter Marc Caputo \"of course not.\"", "Diaz-Balart said: “Of course not. He was asked to answer questions from Telemundo viewers —they were on a monitor. He would answer the monitor. In one moment the monitor went to black — he said 'I lost the lady.' I told him he could answer looking at me. And that was that.”", "Biden's full interview with Telemundo can be viewed below. The moment shown in the viral clip can be seen around the 10-minute mark.", "https://www.youtube.com/watch?time_continue=607&v=rOMCGizKDOo&feature=emb_title", "Biden's responses during this interview were not scripted and displayed on a teleprompter. The out-of-context viral clip shows the moment a screen went dark as Biden was addressing a woman's virtual question.", "Phillips, Morgan.   \"Biden Says He's Worried About Trump's 'Insurrection' Talk in Spanish-Language Interview.\"\r\n    Fox News.   15 September 2020.", "Latino Rebels.   \"The FULL Telemundo Joe Biden Interview and Transcript.\"\r\n    16 September 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]