["President Ram Nath Kovind unveiled a portrait of Subhas Chandra Bose at Rashtrapati Bhavan to commemorate the revolutionary’s birth anniversary. However, a tweet on the event sparked both shock and amusement among those who claimed that the President unveiled a painting of Bengali actor Prosenjit Chatterjee who played Subhas Chandra Bose in Srijit Mukherjee’s 2019 release ‘Gumnami’. One of the firsts to claim was Dr Adil Hossain (@adilhossain) whose tweets are now protected. A screenshot of his tweet has been added below.", "The assertion soon took a political shape with the Congress and the TMC mocking the ruling BJP. Official handles of West Bengal Congress, TMC MP Mahua Moitra, President of Tamil Nadu Congress Committee Mohan Kumaramangalam and Chhattisgarh Minister of Health TS Singh Deo amplified the claim.", "This slideshow requires JavaScript.", "National Coordinator of Digital Communications and Social Media at Congress Gaurav Pandhi claimed the same while sharing pictures of Prosenjit Chatterjee from the movie.", "Several journalists including Barkha Dutt, Shiv Aroor, Swati Chaturvedi, Rajdeep Sardesai and prominent personalities such as Richa Chadha and Tehseen Poonawalla also made similar tweets.", "Alt News cropped the portrait from the full image and reverse-searched it on Yandex. This led us to a photograph of Bose similar to the portrait tweeted by BJP leader Chandra Kumar Bose in 2019. He is the grand-nephew of Subhas Chandra Bose.", "Netaji said regarding the nature of patriotism& Indian nationalism – “All those who have accepted India as their motherland or all those who have made India their permanent home are my brothers.Temple of Lord Jagannath in Puri and the Taj Mahal are equally objects of my pride.” pic.twitter.com/48qRWsxYB7", "— Chandra Kumar Bose (@Chandrakbose) December 27, 2019", "A comparison of this image and the portrait brings out many similarities – the tilt of the cap, the position of the leaf-like design on the cap. the curve of the lips, the bags around his eyes and the crease on the coat.", "There could be varying opinions on the accuracy of Paresh Maity’s painting of Subhas Chandra Bose unveiled at Rashtrapati Bhavan, but his reference photograph was certainly not actor Prosenjit Chatterjee’s portrayal of Bose from the film ‘Gumnami’. The complete portrait painted by Maity has been attached below.", "A post shared by Art Alive Gallery (@artalivegallery)", "A comparison of the complete portrait with the photograph is further proof that his reference was Bose’s photograph.", "Subsequent reverse-image search on Yandex and Bing throws up different versions of the reference photograph (3 and 4). We found another image (5) that shows Bose in a similar pose and a facial comparison proves that the reference photograph used by the artist is a legitimate picture.", "Journalist Nistula Hebbar tweeted that Bose’s grand-niece Jayanti Bose Rakshit had given Maity the photograph for reference. Several people including Barkha Dutt, Shiv Aroor, Gaurav Pandhi and Mahua Moitra later took down their tweets.", "[Update: After the widespread minsiformation, actor Prosenjit Chatterjee also put out a tweet.]", "Donate Now", "Co-Founder Alt News, I can be reached via E-mail at [email protected] and on Facebook at https://fb.com/freethinker.", "Follow @free_thinker", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]