["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "After winning the 2010 Republican nomination for governor, Gov. Rick Perry told supporters Tuesday that energized voters are upset at congressional spending.\n\nIn a wide-ranging speech, Perry specified two factors, saying: \"Washington cannot hide from the fact that Congress hiked the national debt ceiling to $14.3 trillion. They cannot hide from the fact . . . that the budget that they’re going forward with has more than $5 trillion in debt in it over the next five years.\"\n\nDo those debt numbers hold up?\n\nPerry's campaign pointed us to news accounts of the U.S. House and Senate voting in January to raise the federal government’s debt limit to $14.3 trillion, a historic high adopted solely with Democratic votes in the Democrat-majority bodies. Proponents noted that the increase was needed to allow the government to continue borrowing and avoid default.\n\nOn Perry's reference to the federal debt increasing by $5 trillion over five years, his campaign pointed to a Feb. 1 article on President Barack Obama's proposed 2011 federal budget. The story says Obama's proposal would result in deficits of $5.08 trillion over five years.", "Separately, Obama's proposed budget shows the nation's public debt increasing from $7.5 trillion in 2009, reflecting actions taken under President George W. Bush and the Congress that made budget decisions in 2008, to $13.1 trillion in 2014—potentially increasing $5.6 trillion. The debt increase from 2010 to 2015 is projected at $4.7 trillion.", "Josh Gordon of The Concord Coalition, which advocates long-term fiscal responsibilty, cautioned that much of the current and immediately expected deficits are due to economic troubles and not White House or congressional actions. Gordon said it's typical for government to run a deficit during an economic downturn.", "In the end, Obama’s proposed budget won’t sail through Congress; presidents (and governors) propose, lawmakers dispose. Still, Obama's proposal seems a reasonable basis for Perry’s debt claim.\n\nThe governor also is correct on the size of the increased federal debt limit.\n\nWe rate Perry's statement as True.", "E-mail, Travis Richmond, research director, Gov. Rick Perry campaign, March 3, 2010\n\nInterview, Josh Gordon, policy director, The Concord Coalition, March 3, 2010", "Politico, \"Five years, $5.08 trillion in debt,\" Feb. 1, 2010\n\nThe Hill, \"House raises debt limit to $14.3 trillion,\" Feb. 4, 2010\n\nThe Washington Post, \"Senate agrees to record increase in debt limit to $14.3 trillion,\" Jan. 29, 2010\n\nPresident Barack Obama, \"Budget of the United States Government, Fiscal Year 2011,\" \"Summary Tables, Table S-1. Budget Totals,\" Feb. 1, 2010\n\nReuters, \"Senate backs increase in debt limit to $14.3 tln,\" Jan. 28, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]