["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump fired off a frustrated tweet about North Korea after a Sunday political news show.", "\"Sleepy Eyes Chuck Todd of Fake News NBC just stated that we have given up so much in our negotiations with North Korea, and they have given up nothing. Wow, we haven’t given up anything and they have agreed to denuclearization (so great for World), site closure, and no more testing!", "Sleepy Eyes Chuck Todd of Fake News NBC just stated that we have given up so much in our negotiations with North Korea, and they have given up nothing. Wow, we haven’t given up anything & they have agreed to denuclearization (so great for World), site closure, & no more testing!", "NBC Meet the Press host Todd drew Trump’s ire for saying that a more positive tone for negotiations was in the air, but not more than that.", "\"We don’t have a release of any of those Americans that they’ve held captive,\" Todd said April 22. \"We don’t have a pledge of denuclearization as the ultimate goal.\"", "Kim Jong Un announced North Korea will stop nuclear testing, but @ChuckTodd asks some tough questions about other unresolved diplomatic concerns. pic.twitter.com/6Jk0Y2NoR1", "Trump’s tweet insisted that North Korea indeed had agreed to denuclearization, so we looked at the record. In terms of what North Korea itself has said, Trump has gotten ahead of events.", "North Korea announced April 20 that it would shut down its northern nuclear test site. A translation of a broadcast from North Korea’s state news agency said North Korean President Kim Jong Un unveiled the decision at a Workers’ Party Central Committee meeting.", "\"The northern nuclear test ground of the Democratic People’s Republic of Korea will be dismantled to transparently guarantee the discontinuance of the nuclear test,\" the newscaster said.", "Kim also reiterated the promise to conduct no weapon or missile tests while talks were under way. He added that tests were no longer needed because the country had met its goal of developing its weapons capability.", "So far, North Korea has yet to officially commit to scrapping its nuclear program. It has left it to other countries to put that possibility on the table.", "Most recently, South Korean President Moon Jae-in told dozens of South Korean media executives April 20 that North Korea was \"expressing its commitment to complete denuclearization.\"", "Moon said North Korea is not demanding the withdrawal of American troops from bases in South Korea. That would be a significant shift, but as the Korean newspaper Dong-a Ilbo reported along with Moon’s comments, \"there is still a considerable gap between Washington’s demand of the North’s denuclearization in a minimum period of time and Pyongyang’s calls for progressive and synchronous measures for denuclearization.\"", "Denuclearization has been in the air since Kim made a rare trip to Beijing to meet with Chinese President Xi Jinping. The official Chinese news service Xinhua reported March 28 that Kim said, \"It is our consistent stand to be committed to denuclearization on the peninsula.\"", "Trump also tweeted about his Secretary of State nominee Mike Pompeo’s meeting with Kim.", "\"Mike Pompeo met with Kim Jong Un in North Korea last week, Trump tweeted April 18. \"Meeting went very smoothly and a good relationship was formed. Details of Summit are being worked out now. Denuclearization will be a great thing for World, but also for North Korea!\"", "So, no direct statements from North Korea on denuclearization, but the word has been in play and not refuted by North Korea.", "The White House pointed to an opinion piece in the Washington Times as support for Trump’s latest statement.", "The April 19 headline said, \"North Korea agrees to ‘complete denuclearization,’ says South.\"", "That op-ed cited an NBC News report that had the headline, \"North Korea willing to accept 'complete denuclearization' without conditions, Moon says.\"", "The NBC News post repeated a Reuters report from April 19 that said, \"South Korea's Moon says North seeking 'complete denuclearization'.\"", "In the nuances of diplomacy, the transition from \"seeking\" to \"agrees to\" is a big deal.", "\"North Korea has agreed to talk about it (denuclearization), not to do it,\" said Frank Jannuzi, president of the Mansfield Foundation, a group that funds work on U.S.-Asian policy.", "Arkansas Republican Sen. Tom Cotton sounded unimpressed with what North Korea has promised so far, even with the closure of its test site.", "\"I think this announcement on Friday is better than continued testing, but it's not much better than that,\" Cotton said on CBS’s Face the Nation April 22.  \"It's an easily reversible decision, and they made no announcement about their medium- or short- range ballistic missiles that threaten hundreds of thousands of Americans in Korea and Japan just like it threatens our allies there.\"", "South Korean skeptics of the North’s intentions have noted that denuclearization has been central in previous high-level negotiations without producing tangible results.", "Jannuzi said North Korea often speaks of denuclearization as the dying wish of Kim’s grandfather, Kim Il-sung.", "\"They always said he wanted that the peninsula be denuclearized,\" Jannuzi said. \"All we have from the North right now is basically what’s always been there.\"", "Trump said that North Korea had agreed to denuclearization. While North Korea has promised to halt testing and close a weapons test site, it has not officially said that it is committed to denuclearization.", "Other leaders have made that statement on their behalf, and even in that case, the only promise is that they are willing to talk about reaching that point. That is not the same as agreeing to do it.", "We rate this claim False", "Donald Trump, tweet, April 22, 2018", "NBC News, tweet – Todd comments, April 22, 2018", "CBS News, Face the Nation – Cotton, April 22, 2018", "Dong-a Ilbo, Trump calls for N. Korea’s ‘complete denuclearization', April 20, 2018", "Korea Times, North Korea to suspend nuclear, missile tests, shutdown atomic test site, April 21, 2018", "Hankyoreh, President Moon emphasizes that North Korean committed to denuclearization, April 20, 2018", "Reuters, North Korea says will stop nuclear tests, scrap test site, April 20, 2018", "Washington Times, North Korea agrees to ‘complete denuclearization,’ says South, April 19, 2018", "NBC News, North Korea willing to accept 'complete denuclearization' without conditions, Moon says, April 19, 2018", "Reuters, South Korea's Moon says North seeking 'complete denuclearization', April 19, 2018", "Korea Times, Road to North Korean denuclearization is littered with failure, April 22, 2018", "Email interview, Frank Jannuzi, president Mansfield Foundation, April 22, 2017", "Email interview with Joseph de Thomas, professor of international affairs at Penn State University, April 18, 2018", "Email interview Scott Snyder, senior fellow for Korea studies and director of the program on U.S.-Korea Policy, Council on Foreign Relations, April 18, 2018", "Email interview, Steven Cheung, director of strategic response, White House Press Office, April 22, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]