["“Kashmiri women She is from Shopian South kashmir. Beaten during CASO by Indian occupation Army and SOG.” read a caption affixed with a set of images. A Twitter handle, @MrsIshaNaim tweeted the images of a woman with bruises, claiming that she was beaten up during a cordon and search operation (CASO) carried out by the Indian army in Shopian district of Jammu and Kashmir.", "Several other individual users have shared the same images with the identical narrative. @IrshadShabnum, a Twitter handle tweeted the images with a message, “They have beaten her ruthlessly”.", "One Ishrat Kashmiri posted the images on a Facebook group, Kashmir Burning Today, saying, “My mom injure by Indian Army in Srinagar Kashmir. Koi hay jo hamari Help karay. India please leave Kashmiri for life”. It has been shared more than 1400 times.", "A Twitter user, Sabah Kashmiri claimed that the woman in the image is Neelam Gul, a Pashto actress and singer who hails from the Mardan district of Khyber Pakhtunkhwa province, Pakistan.", "So this fake account is portraying #Pashto actress #Neelam Gul as a Kashmiri woman tortured by security forces. We must be cautious before we start following such fake accounts, there are thousands of them. https://t.co/RAQDqVKE3a", "— Sabah Kashmiri (@SabahKashmiri) December 6, 2018", "Based on the information, Alt News did a Google search with the keywords, “Neelam Gul” and found a YouTube video. The video titled, “Pashto Actress Neelam Gul Kicked By Her Husband | Da Neelam Gul Faryad” was posted on August 2, 2018.", "A Facebook page Neelam Gul had uploaded an extended version of the same video on August 2, 2018. An article published by a Pakistani daily, The News International on October 29, 2018 stated, “In August this year, a video of a bruised Neelam Gul, dancer and singer from Mardan district, emerged on social media where she cried out for help from the police against her abusive husband.”", "In the past as well, videos and images of Kashmir have been shared with a false narrative. Recently, a video of an accidental fire in Uri district, Jammu and Kashmir was passed off as Indian army burning houses of Kashmiris.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]