["About this rating", "Some families have announced to their communities that their autistic children would be carrying a blue bucket on Halloween.", "Carrying a blue bucket while trick-or-treating is not a widely recognized symbol for people with autism.", "Trick-or-treating on Halloween can be a somewhat scary endeavor for children, especially for those with autism. On 25 October 2018, Facebook user Alicia Plumer shared an idea on how to make the holiday more enjoyable for her 21-year-old autistic son BJ:", "This post quickly went viral and created the impression that all autistic trick-or-treaters should carry blue buckets to inform their communities about their condition. The notion was even picked up by news outlets who reported as fact that the \"blue bucket\" was used to symbolize autism:", "Whether you’re out and about this Halloween or staying home to hand out sweets to well-costumed kiddos, you might spot a blue pumpkin today -- whether it’s a plastic version used as a sweets-holder or carved and sitting outside someone’s home. This isn’t just a fun style choice. A blue pumpkin is used to symbolise autism, and will be carried by trick or treaters to signal that they may have certain needs.", "Most of this publicity glossed over that a significant aspect of the original idea was not just to alert neighbors to the presence of an autistic person on Halloween, but to inform them not to be put off by an adult trick-or-treater.", "While Plumer's idea may be a good one, the \"blue bucket\" for trick-or-treaters is not a universal symbol for autism, and parents of autistic trick-or-treaters should not expect this form of candy carrier to impart any meaningful information to their communities. The \"blue bucket\" is not mentioned in either of the Halloween Guides from Autism Speaks or the Autism Society, and when we reached out to the Autism Society for more information about the practice, they told us that they were unaware of it.", "The Halloween guide from Autism Speaks suggests that autistic trick-or-treaters could wear signs or badges to inform their neighbors about their condition:", "Plumer told television station WJLA that she got her idea from a friend, Lisa Lee, who was inspired by the Food Allergy Research & Education's \"Teal Pumpkin Project\":", "The idea of the blue bucket came from Plumer’s friend, Lisa Lee, who says every year BJ and Plumer struggle with people being “not so nice while trick or treating.” She knows how much BJ loves Halloween so when she saw the bucket at Walmart, she bought it for him.", "“I thought I had read something on Facebook about it. Really what I read was about the teal pumpkins and food allergy children - but why not blue pumpkins for autism!” says Lee.", "So the blue Halloween bucket was merely one mother's idea on how to passively inform a community that her adult son with autism would be trick-or-treating in the area on Halloween. While this suggestion may one day catch on and become a common symbol for autistic children on Halloween, it is not yet so.", "Kincade, Katrina.   \"Son with Autism Carries Blue Bucket This Halloween.\"\r\n    WJLA.   30 October 2018.", "Scott, Ellen.   \"What It Means When You Spot a Blue Pumpkin or Bucket This Halloween.\" \r\n    Metro.   31 October 2018.", "Oct. 28, 2019: This story's claim and \"What's True\" text have both been updated prior to Halloween in 2019. This story was originally published in 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]