["The image, which can be seen in this Facebook post dated July 15, 2019, shows bodies stacked on top of each other and left on stretchers on the floor in a packed morgue building.", "The post has been shared more than 750 times. Its caption says:", "\"This is one the of the Photos that conviced Iceland to spearhead the reolution to investigate the Duterte drug war. Bodies are 'stacked like firewood' as funeral parlours in manila struggle to cope with thousands of street executions.", "\"Photo, first appeared 2013, then 2014, then used again on September 2016 by a yellow propagandist allegedly as victims of war on drugs.. But another picture showing dead bodies as complained by residents in QC was of old corpses dead as early as 9 months according to funeral parlor long before Duterte took office.\"", "Below is a screenshot of the misleading post:", "Graphic imagery", "Show", "Hide", "Similar posts were also shared on Facebook here and here.", "In July 2019, Iceland submitted a resolution to the UN Human Rights Council requesting a report on the situation in the Philippines following alleged incidents of extrajudicial killings and enforced disappearances. The UN approved the resolution on July 11, 2019.", "“Duterte drug war” mentioned in the post is a reference to the war on drugs introduced by Duterte's administration following his election in 2016.", "The claim that the photo was taken before Duterte took office in June 2016 is false.", "A Google reverse image search found that the photo in the post was actually taken by Daniel Berehulak, the 2017 winner of the Pulitzer in the breaking news photography category.", "Berehulak won the prize for his photos showing the alleged victims of the war on drugs in the Philippines.", "The photo used in the misleading post is included in a slideshow of his photos on the Pulitzer website. Below is a screenshot of the page:", "Graphic imagery", "Show", "Hide", "The caption of the photo says: “At the morgue, bodies were stacked like firewood. The man on the floor, Danilo Deparine, 36, was found dead under a bridge within a week of when his younger brother, Aljon, 23, met the same fate.", "\"It took their mother, Maria Mesa Deparine, three weeks to scrape together loans and donations totaling 50,000 pesos -- $1,030 -- for Aljon's funeral; then she negotiated a cut rate of 12,000 pesos, about $240, to bury Danilo with a one-day wake instead of the usual week. (10/11/2016)”", "An online search of the names “Danilo Deparine”, “Aljon Deparine” and “Maria Mesa Deparine” led to this February 2017 article on local news site Inquirer.net about the kin of the alleged victims of extrajudicial killings.", "Another article published in January 2017 on the Union of Catholic Asian News website also talked about the said killing of Danilo and Aljon allegedly due to the war on drugs.", "The photo was also published in this New York Times article on December 7, 2016.", "Below is a screenshot of the photo on the NYT website:", "Graphic imagery", "Show", "Hide", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]