["About this rating", "A woman was murdered and her 13-year-old granddaughter was beheaded in killings apparently related to drug trafficking activity, and one of the suspects in the murders is reportedly an undocumented immigrant.", "The \"mainstream media\" did not \"suppress\" reporting of the crime, and it's unclear which of the suspects was responsible for killing the girl.", "Authorities say a 13-year-old Alabama girl with special needs was beheaded after she saw her grandmother killed in a cemetery.", "Huntsville television station WAFF reported the details of a grisly crime which emerged at a preliminary hearing in a Madison County court for 26-year-old Yoni Aguilar, who, along with 34-year-old Israel Palomino, is charged with two counts of capital murder in the June 2018 slayings of 49-year-old Oralia Mendoza and her granddaughter, Mariah Lopez.", "According to court testimony, in the days before the murder Aguilar, Palomino, Mendoza, and Mendoza's friend Laticia Garcia went to Georgia to pick up a large amount of drugs, and something that took place during the trip prompted Palomino and Mendoza to engage in an ultimately fatal argument. Aguilar and Palomino eventually drove the victims to a cemetery, where Mendoza was fatally stabbed:", "The grandmother was associated with the Sinaloa Cartel, a drug-trafficking organization, a Madison County sheriff's investigator testified.", "It was June 2 when Palomino, Aguilar, Mendoza and a woman named Leticia Garcia went to pick up a quarter kilo of meth in Norcross, Georgia, a small city northeast of Atlanta, authorities said. Something apparently went wrong during the trip, [Investigator Stacy] Rutherford told the court. It was Mendoza and Garcia who were tied to the [Sinaloa] cartel, and Palomino thought there might be a setup, the investigator testified.", "During the early morning hours of June 4, Mendoza was told she and Lopez would be taken somewhere safe.", "Instead, Rutherford testified, Palomino and Aguilar drove the woman and her granddaughter to Moon Cemetery on Cave Springs Road. Mendoza and Palomino got out of the car and argued about the drug buy, according to Aguilar's account.", "The argument escalated, and Aguilar told police Palomino killed Mendoza.", "I just left the preliminary hearing for Yoni Aguilar, one of the accused killers in the Madison County slayings of a grandma and 13-year-old. pic.twitter.com/LvVlYklyfO", "— Ashley Remkus (@aremkus1) July 12, 2018", "The suspects reportedly killed 13-year-old Mariah because she was a witness to the slaying of her grandmother, taking her to a secluded area where, Aguilar claimed, Palomino forced him to kill the girl:", "Aguilar claims Palomino killed Mendoza. Investigators say he told them that he was sitting in the passenger seat while Palomino and Mendoza were outside talking. That’s when he said he saw Mendoza's arms slide down the car and Palomino jump in the car and leave with Mariah in the backseat.", "In court, the investigator added that Aguilar told them that they had to kill Mariah because she witnessed her grandmother's murder. Mendoza was Mariah's main guardian. Mariah was also on the autism spectrum.", "Aguilar told investigators that Palomino held his hand with the knife and moved it back and forth to behead the 13-year old.", "Palomino denies he made Aguilar kill Mariah.", "The disreputable web site Your News Wire published an article on this subject headlined \"Illegal Immigrant Beheads 13-Year-Old Girl in Alabama -- Media Blackout,\" which asserted that \"the mainstream media has failed to report on the barbaric crime\" because \"mainstream media outlets are now choosing to suppress horrific news stories involving illegal immigrants.\"", "However, the underlying crimes were in fact widely reported by multiple national U.S. news outlets, including Fox News, the Washington Post, the Associated Press, and Cox Media Group.", "Moreover, according to Huntsville station WAAY, while Aguilar was an undocumented immigrant, Palomino was legally in the U.S. on a green card. Since it's as yet unclear what involvement each of the two men had in Mariah Lopez's death, it cannot be definitively stated at this time that an \"illegal immigrant beheaded a 13-year-old.\"", "Bonvillia, Crystal.   \"13-Year-Old Girl Beheaded After Seeing Grandmother Killed in Alabama Cemetery.\"\r\n    Atlanta Journal-Constitution.   13 July 2018.", "Ferrell, Gabrielle and Sydney Martin.   \"Police Confirm the Identity of Remains Found at Moon Cemetary.\" [sic]\r\n    WAAY-TV.   27 June 2018.", "Betz, Bradford.   \"Pair Beheaded Girl, 13, After Fatally Stabbing Her Grandmother, Police Say.\"\r\n    Fox News.   15 July 2018.", "Wootson Jr., Cleve R.   \"A Teen Saw Her Grandma Killed. Then Cartel-Linked Drug Dealers Beheaded Her, Authorities Say.\"\r\n    The Washington Post.   15 July 2018.", "The Associated Press.   \"Investigator: Girl Was Beheaded After Seeing Grandmother Die.\"\r\n    The Seattle Times.   14 July 2018.", "Remkus, Ashley.   \"13-Year-Old Beheaded After Witnessing Grandmother's Slaying, Investigator Testifies.\"\r\n    AL.com.   12 July 2018.", "Dmitry, Baxter.   \"Illegal Immigrant Beheads 13-Year-Old Girl in Alabama — Media Blackout.\"\r\n    Your News Wire.   14 July 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]