["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Pope Francis delivers a blessing during the Angelus prayer in St. Peter's Square at the Vatican, Sunday, March 5, 2017. (AP)", "Has Pope Francis said that it’s time to ditch the Bible?", "Nope -- he still thinks the Bible is the good book.", "\"Pope Francis cancels the Bible and proposes to create a new book,\" said a headline on the Everyday Devotional website, which says it reports the latest Christian news around the world.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat online hoaxes.", "While the story that followed the headline warned against changing the Bible, it didn’t contain any information showing that Francis cancelled the Bible.", "The headline is the same as one about a week earlier by There Is News, which stated that Francis announced, \"The Bible is totally outdated and needs a radical change, so The Bible is officially cancelled.\" The story said that a new book will replace the Bible, and one of the names under consideration is \"Biblia 2000.\" There is News identifies itself as a humor website.", "Pope Francis has made a series of controversial statements about religion and social issues, but there is no evidence that he called for cancelling the Bible.", "In fact, in 2017, Francis called on people to consult the Bible as often as they look at their cell phones.", "\"What would happen if we treated the Bible like we do our mobile phones? If we turned around to retrieve it when we forgot it? If we carried it with us always, even a small pocket version? If we read God’s messages in the Bible like we read messages on the mobile phone?\"", "That sounds like a leader devoted to the Bible. We rate this statement Pants on Fire.", "Everyday devotional, \"Pope Francis cancels the Bible and proposes to create a new book,\" April 9, 2018", "There is News, \"Pope Francis cancels the Bible and proposes to create a new book,\" April 9, 2019", "Reuters, \"Pope says carry and read bible as if it were a mobile phone,\" March 5, 2017", "Snopes, \"Did Pope Francis Cancel the Bible and Propose a New Holy Book?\" April 9, 2018", "PolitiFact, \"No proof Pope Francis said Jesus is metaphorical,\" Nov. 22, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]