["“Friends जरा इस फोटो को गौर से देखिये, भारत के इतिहास में क्या यह दृश्य देखने को आपकी आँखें तरस गई होंगी” (Friends, look at this photo carefully, it is the scene your eyes were waiting to see in Indian history -translated) An image with the above text has been shared by Facebook page, JAY MODIRAJ (“जय मोदीराज”) which has more than 12 lakh followers. At the time of writing this article, it has been shared more than 1600 times and ‘liked’ more than 3300 times. Image depicts Prime Minister Narendra Modi surrounded by the world leaders.", "Friends जरा इस फोटो को गौर से देखिये, भारत के इतिहास में क्या यह दृश्य देखने को आपकी आँखें तरस गई होंगी,", "Posted by JAY MODIRAJ (“जय मोदीराज”) on Tuesday, 17 July 2018", "The same image was shared by a Facebook user on April 26, 2018, with the same text. It has been shared more than 54000 times and ‘liked’ more than 4200 times at the time of writing this article.", "Friends जरा इस फोटो को गौर से देखिये, भारत के इतिहास में क्या यह दृश्य देखने को आपकी आँखें तरस गई होंगी,", "Posted by M.P. Agarwal on Thursday, 26 April 2018", "“आप देख रहे है अन्तर्राष्ट्रीय स्तर पे भारत की इज्जत को चार चाँद लगा दिए मोदीजी ने उनको सादर नमन: और जिनको मिर्ची लगी हो वो कृपा इस पोस्ट से दूर रहे” (You can see how the respect for India has been enhanced on the international stage thanks to Modiji. Best regards to him and those who have been rattled should remain away from this post -translated). A post on July 16, 2017, with the above claim and same image, has been shared more than 38000 times.", "Alt News did a Google reverse image search and found an article published by Business Insider on July 11, 2017, titled ‘A photo of Trump and other leaders staring at Putin is going viral – but it’s fake’. The article stated, “One picture that made its rounds on Twitter featured a serious-faced Putin surrounded by other world leaders, all staring at him as if they were focused on something he was saying.”", "According to the Business Insider article, the original image was taken by a photographer, Kayhan Ozer for Getty Images, an American stock photo agency. The authentic image was captioned, “President of Turkey Recep Tayyip Erdogan (R) talks with US President Donald Trump (L), accompanied by Foreign Affairs Minister of Turkey Mevlut Cavusoglu (2nd R), during a session within the G20 Leaders’ Summit in Hamburg, Germany on July 07, 2017.”", "Morphing images is one of the easiest methods to circulate misinformation. Very often, people tend to believe even poorly photoshopped images like this one due to their inherent biases. It is advisable that any viral photograph on social media is first cross-checked using simple techniques such as Google Reverse Image search.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]