["The screenshots appeared here in an image on Twitter on February 4, 2020. The post has been retweeted more than 840 times.", "The image shows two media reports by two Indonesian media outlets; Tempo and Warta Ekonomi.", "Below is the screenshot of the misleading post:", "The Indonesian-language tweet, translated to English, reads: “Before the coronavirus outbreak, in January 2019, there were around 3,000 Chinese workers. After the outbreak, in January 2020, it reached 40,000. An increase in the number of foreign workers in a year is around 37,000.", "“Each month the average foreign worker coming is around 3,100. THAT’S JUST IN MOROWALI..!!! Do you realise it or not..??”", "The Indonesian-language headline of the Tempo report reads: “Manpower Minister: Only 3,000 Chinese Workers in Morowali”, while the Indonesian-language headline of the Warta Ekonomi report reads: “To Prevent Coronavirus, More Than 40 Thousand Chinese Workers Quarantined in Morowali”.", "“Morowali” refers to PT Indonesia Morowali Industrial Park (IMIP), an industrial site located in Morowali regency, in Central Sulawesi province. It hosts nickel ore smelters and stainless steel production, and is majority-owned by China’s Shanghai Decent Investment Group.", "Since its emergence in the central Chinese city of Wuhan in late 2019, the novel coronavirus has killed at least 900 people and infected some 39,800 others in China alone, as reported here by AFP on February 10.", "The same image also appeared on Facebook with a similar claim here, here, here and here, and has been shared more than 1,000 times.", "The claim is misleading. The industrial park in Morowali employs 43,000 people – but only around 5,000 of them are Chinese citizens while the remaining 38,000 are Indonesian citizens.", "–The Warta Ekonomi report–", "A keyword search on Google found this Warta Ekonomi report published on January 31, 2020. It has the same headline and photo as seen in the misleading post.", "Below is the screenshot of Warta Ekonomi’s report:", "The report's first two paragraphs translate to English as: “Foreign media put a spotlight on thousands of workers from China who are being quarantined at a factory in Morowali to prevent the spread of the Wuhan coronavirus.", "“As we observe on Friday, January 31, 2020, French media France24 ran a story titled Thousands on Virus lockdown at China-backed Plant in Indonesia, which translated to Indonesian: Ribuan Orang Dikarantina dalam Pabrik China di Indonesia untuk Mencegah Penyebaran Virus.”", "The report cited by Warta Ekonomi is an AFP article that was republished by France 24.", "The second and third paragraphs of the AFP article state the overall number of the workers and the number of foreign Chinese workers at the industrial park: “PT Indonesia Morowali Industrial Park has sealed off its nickel mining hub on Sulawesi island and is barring any of its 43,000 staff from entering or leaving without written permission.", "“There are some 5,000 guest workers from mainland China at the sprawling site which hosts nickel ore smelters and stainless steel production.”", "The figures came from the company’s spokesman, Denny Kurniawan. In a WhatsApp message to AFP on January 31, 2020, he wrote, “There are some 5,000 foreign workers from mainland China and 38,000 Indonesian workers” at IMIP.", "Although the Warta Ekonomi headline states, “More Than 40,000 Chinese Workers Quarantined in Morowali”, the fifth paragraph of its report quotes a paragraph from the AFP story that “there are some 5,000 guest workers from mainland China” in Morowali.", "Below is the screenshot comparison between Warta Ekonomi report in the misleading post (L) and the report on the website (R):", "–The Tempo report–", "Another keyword search on Google found this Tempo published on January 26, 2019.", "It has the same headline and photo seen in the screenshot in the misleading post.", "Below is the screenshot of Tempo’s report:", "The report's first two paragraphs translate to English as: “Manpower Minister M. Hanif Dhakiri said the number of foreign workers from mainland China was only 10.7 percent from the total 28,000 workers in Morowali. Or about 3,000 people.", "“‘For example in the Morowali Industrial Area. The Chinese investment there has so far provided 28,000 jobs. Of the 28,000 available jobs, three thousand people are Chinese workers and 25,000 are mostly Indonesian workers,’ Hanif said in a press release in Jakarta, Friday, January 26, 2019.”", "Below is the screenshot comparison of the Tempo report in the misleading post (L) and the report on the website (R):", "Hanif Dhakiri was Indonesian manpower minister from 2009 to 2014.", "He issued a statement in January 2019 about the number of Chinese workers in the industrial park after a video went viral with a false claim that it shows “tens of thousands of Chinese workers protesting in Morowali”. The claim has been debunked by Tempo here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]