["“Did you know that… your incognito mode browsing history is stored in system32 folder. To be safe, delete it,” reads the meme -- along with an icon of the folder and a spy-like image associated with Google’s privacy mode.", "One Facebook post shared on June 20, 2020, includes the meme, with a caption that reads: “Thank me later!!”.", "“The C:\\Windows\\System32 directory is a critical part of the Windows operating system where important system files are stored. Some pranksters online may tell you to delete it, but you shouldn’t,” wrote Chris Hoffman, editor of How-To Geek, an online technology magazine.", "Technical support website Computer Hope says that most Microsoft Windows error messages “will contain the system32 directory because many of the system files Windows uses to run are stored in this directory”.", "“By itself, the system32 directory will not cause any errors, unless it is missing, of course.”", "It’s not easy to delete the folder as it is protected by permissions but if you do get around them, this technology blogger recorded what happens when it's deleted.", "For example, he shows how the start menu and task manager begin to malfunction and how other applications don’t even open.", "“The Windows installation is ruined until you completely reinstall Windows and you really can’t do anything with it, even with the built-in recovery features it won’t be able to fix it.”", "So why would people be encouraging you to delete System32? The latest posts are part of a long-running hoax, which has been shared in the past under the guise of trying to make your “computer run faster”.", "“Many non-computer savvy folks have no idea what the System32 folder is at all, leading to some enterprising trolls spreading a meme that ‘deleting System32 will make your computer run twice as fast’,” according to the technology blog Techquickie on YouTube.", "“This particular piece of meme-mory has been making its rounds on the internet since at least the early 2000s, but the way it’s usually presented still fools many computer novices.”", "As the Google Chrome support page explains, private browsing is not one hundred percent private. Activity such as location can be seen by websites you visit or sign in to, by your employer or your internet service provider.", "The Kingpin browser, which uses incognito mode and adblock, states on its website that with a little bit of coding a user can retrieve the private browsing history of a person, as long as they are on the same computer.", "“The private browsing mode has a loophole. You can see the browsing history of someone using incognito mode but only if you have access to their computer. Also, they must be using the Windows operating system.”", "David Szivos, managing director at South African ICT firm SA Computers, told AFP that you can only retrieve incognito browser history while the incognito tab is open and active.", "“Once it’s closed the browser history is wiped from the computer. However, the DNS cache on the computer does retain network activity log and that includes all websites visited,” Szivos told AFP in an email.", "“This can be recalled by using the ipconfig /displaydns command in elevated Command prompt mode. It can be wiped by using ipconfig /flushdns command in the same window,” said Szivos.", "Internet tutorials are freely available with information on how to safely remove unwanted browsing history.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]