["About this rating", "A photograph purportedly showing Martin Luther King, Jr. in the back seat of a police car along with a dog took another lap around the internet in January 2019, as social media users honored the civil rights leader on his birthday. This image was frequently attached to the claim that the pictured canine was a police dog put into the back seat of the vehicle in a futile attempt to \"intimidate\" King:", "\"In June 1964, Dr. Martin Luther King Jr. was placed in the back seat of a police car in St. Augustine, Florida. A police dog was put into the car with  him in an apparent attempt to intimidate King. Instead, the two promptly became friends. Today we honor this great man and the legacy of love and unity he left behind.\"", "The above is a genuine photograph of Martin Luther King, Jr. sitting in the back seat of a police vehicle in the company of a police dog. However, we couldn't find any credible sources to support the claim that the dog had been put there in an attempt to intimidate King, or that King and the dog subsequently \"became friends.\"", "The photograph was taken on 12 June 1964 and captured King and the dog as they were being escorted back to jail from King's grand jury testimony in St. Augustine, Florida, following his arrest the day prior for staging a sit-in at a segregated restaurant.", "Here are some other images of King and the dog in the police car, as well as the captions that accompanied them from the Associated Press, the State Library and Archives of Florida, and the Civil Rights Library of St. Augustine:", "Dr. Martin Luther King, Jr. rides in the back seat of a police car with a police dog as he is returned to jail in St. Augustine, Fla., after testifying before a grand jury investigating racial unrest in the city, June 12, 1964. Andrew Young is seen outside the car. (AP Photo)", "Martin Luther King, Jr. being escorted away from the Grand Jury, in a Highway patrol car, with a police dog in the back seat. (Florida Archives)", "Dr. Martin Luther King, Jr. rides in the back seat of a police car with a police dog as he is returned to jail in St. Augustine, Fla., after testifying before a grand jury investigating racial unrest in the city, June 12, 1964. Andrew Young is seen outside the car. (Civil Rights Library)", "We haven't been able to locate any accounts asserting that the dog was employed as a pawn in an attempt to intimidate King. In fact, the dog was mentioned as a superfluous detail in most the contemporaneous reports we encountered. The claim that the dog was used for intimidation purposes (and that King and the dog became friends) looks to be a modern interpretation based solely on the optics of the photograph and appears to have been posted first (without any citations or supporting evidence) by the \"Dogs in History\" blog in May 2016.", "The historical record doesn't appear to support such an interpretation, however.", "This claim insinuates that this photograph was taken in the immediate aftermath of King's arrest and that police officers used the dog in an attempt to intimate and subdue an unruly activist. But that wasn't the case: the picture was snapped the day after King's arrest, as he was escorted from giving grand jury testimony.", "Another reading could be that the dog was used to intimidate King before he testified to the grand jury about segregation in St. Augustine, but again, that isn't what happened: this picture was taken after King's testimony, not before.", "This claim makes even less sense when considering the fact that police officers had been protecting King and other demonstrators from angry mobs for several days prior to the taking of this photograph.", "Here's a brief rundown of the events that preceded this picture:", "Martin Luther King, Jr. and other civil rights leaders staged a number of marches, protests, and sit-ins in St. Augustine, Florida, in the summer of 1964, and because these acts of non-violent civil disobedience often drew counter-protesters and escalated the possibilities violence, police officers were often on the scene.", "A report published in the Palm Beach Post stated that more than 200 officers turned out to protect participants of an anti-segregation march on 10 June 1964, and when counter-protesters started hurling rocks at the demonstrators, police used dogs and tear gas to disperse the \"ugly mob\":", "Violence broke out again Wednesday night during an anti-segregation march by 400 persons despite heavily armed escort of more than 200 police.", "An angry crowd of more than 100 white men milled about in a city park and some of them broke police lines and attacked demonstrators. The crowd broke up concrete block fixtures in the park and hurled chunks of rock and brick.", "Several marchers and at least one policeman were struck.", "Police officials fired tear gas into the ugly mob in an effort to disperse them from the park. Dogs were used in trying to break up the mob.", "Thu, Jun 11, 1964 – Page 1 · The Palm Beach Post (West Palm Beach, Palm Beach, Florida, United States of America) · Newspapers.com", "While police offered protection to the protesters, they also arrested a number of the civil rights activists. On 11 June 1964, the day after the anti-segregation march was attacked by a white mob, King and several other demonstrators were arrested after they refused to leave a segregated restaurant in St. Augustine, as the Miami News Times reported at the time:", "\"The Rev. Martin Luther King and 11 other civil rights demonstrators were arrested here today for trying to sit-in at a segregated restaurant. On the heels of a second night of racial violence in the nation's oldest city, the mustached King and his companions were booked into the county jail on charges of trespassing, violating the unwanted guest law and conspiracy.\"", "Thu, Jun 11, 1964 – 16 · The Miami News (Miami, Florida, United States of America) · Newspapers.com", "King was booked into St. Johns County jail but was moved to undisclosed facility during the night after officers became aware of several threats against the civil rights leader's life, as an Associated Press report published in the Sedalia Democrat noted:", "\"Dr. Martin Luther King Jr., jailed for trying to integrate a restaurant, was moved to an undisclosed town today because of threats on his life, Sheriff L.O. Davis said.", "The sheriff said King was taken away from the St. Johns County jail during the night. He would not say where the integration leader was being held.", "\"We had to take him out for his own protection,\" Davis said. \"We may bring him back later today. We've had some threats on his life, and I don't want my jail destroyed.", "The next day, King was brought to testify in front of a grand jury to testify about segregation and racial violence in St. Augustine. The viral photograph was snapped after King gave his testimony and showed the civil rights leader as he was being escorted back to jail. A contemporary report from the Associated Press noted that a dog was \"on the seat beside\" King but made no mention of the dog's purpose.", "Associated Press.   \"Moves King to Another Town Today\". \r\n    12 June 1964.", "Associated Press.   \"Grand Jury Hears Martin Luther King\". \r\n    12 June 1964.", "Nellius, Dick.   \"King Jailed in St. Augustine.\"\r\n    The Miami News.   11 June 1964.", "Dogs-In-History.Blogspot.com.   \"Famous Dogs in History.\"\r\n    25 May 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]