["About this rating", "On 26 December 2018, President Trump and First Lady Melania Trump made a surprise visit to Al Asad Air Base in Iraq for a Christmastime meeting with military members who were stationed in the war zone there. Shortly thereafter, a claim began circulating on social media that Melania Trump was the first First Lady to undertake such a trip:", "The definition of what constitutes a 'war zone' or a 'combat zone' is somewhat subjective and therefore variable. Although these terms may invoke images of areas under immediate threat of military attack, we found no record of any first lady's traveling to or remaining in an area where armed hostilities were actively taking place. These terms are often used to refer to the general areas in which a war is being fought and do not necessarily have strict or well-defined boundaries, as encapsulated in the IRS' definition of such:", "The term “combat zone(s)” is a general term ... and includes all of the following hostile areas where military may serve: actual combat areas, direct combat support areas, and qualified hazardous duty areas. With respect to deadline extensions, the term “combat zone(s)” includes contingency operations areas.", "That said, by the standards of contemporaneous reporting, Melania Trump was not the first First Lady to make such a trip. Although our list may not be comprehensive, we found that first ladies Eleanor Roosevelt, Pat Nixon, Barbara Bush, Hillary Clinton, and Laura Bush were all reported during their tenures as having ventured into \"war zones\" and other potentially dangerous territories as they visited troops stationed overseas.", "Eleanor Roosevelt, for example, made several trips to war zones during World War II in the 1940s:", "The First Lady was allowed to go to Guadalcanal where she visited many hospitals and again made offers to write to the families of wounded soldiers. During the course of her trip she had visited 17 islands and it was estimated that she saw over 400,000 soldiers. In the end Admiral Halsey said, “she had accomplished more good than any other person or any group of civilians that had passed through my area.”", "For Eleanor Roosevelt, the extensive travels to war zones made her even more determined to try to find a road to lasting world peace after this horrific war was over. She wrote in My Day “if the generation that fights today is to lay the foundations of which a peaceful world can be built, all of us who have seen the war close range must remember what we see and carry a crusading spirit into all of our work.”", "First Lady Pat Nixon was also described as having taken part in a \"dangerous visit\" to \"an active combat zone\" in Vietnam in 1969:", "While neither of Pat Nixon’s sons-in-law saw active duty in South Vietnam, the First Lady herself came close to witnessing it herself. Joining the President on a dangerous visit to the embattled nation, she was the first First Lady to enter an active combat zone since Eleanor Roosevelt.", "During her time there, Mrs. Nixon spent nearly all of it focused on the troops -- both those on break from the field and those being cared for in medic hospital units.", "Since 1969, Barbara Bush, Hillary Clinton, and Laura Bush have all traveled to military bases overseas to meet with U.S. troops. First Lady Barbara Bush visited Saudi Arabia over Thanksgiving in 1990, in the midst of Operation Desert Shield (the build-up of troops and the defenses of Saudi Arabia at the beginning of the Gulf War):", "President Bush didn't come to Saudi Arabia with any guns or missiles, but he had a much more effective secret weapon -- Barbara Bush.", "For homesick American troops celebrating Thanksgiving just 80 miles from the Kuwaiti border, she was everybody's missing Mom whose smile sent spirits soaring ...", "In a day that took the Bushes and their entourage from Jiddah on the Red Sea to Dhahran on the Persian Gulf, the First Couple ate two holiday turkey dinners and talked to hundreds of men and women in two encampments at secret locations in the desert and on a U.S. ship in the gulf. Mrs. Bush isn't the only First Lady to visit American troops abroad. Eleanor Roosevelt went to the South Pacific in 1943, and Pat Nixon went with President Nixon to Vietnam in 1969.", "While Hillary Clinton was First Lady, she traveled to Bosnia in 1996. Although active hostilities in Bosnia had ended a few months prior to her visit, officials still considered the area a \"potential\" combat zone:", "Protected by sharpshooters, Hillary Rodham Clinton swooped into a military zone by Black Hawk helicopter to deliver a personal \"thank you, thank you, thank you\" to U.S. troops. \"They're making a difference,\" the first lady said of the 18,500 Americans working as peacekeepers in Bosnia.", "Mrs. Clinton became the first presidential spouse since Eleanor Roosevelt to make such an extensive trip into what can be considered a hostile area, although others have visited hot spots.", "[T]he highlight of her trip was the visits she made to two fortified posts outside the U.S. base in Tuzla. Even President Bill Clinton, restricted to the base by bad weather in January, did not see as much of this war-ravaged region as Mrs. Clinton did.", "Although Clinton's trip to Bosnia may have scored her political points during her time as First Lady, that visit would later become a subject of controversy and criticism. During the 2008 presidential campaign Clinton was accused of exaggerating the dangers of her Bosnia visit for saying she had been \"under sniper fire\" when she landed at the Tuzla Air Base.", "(It should be noted that when Hillary Clinton's trip to Bosnia in 1996 was touted as \"the first time since Roosevelt that a first lady has voyaged to a potential combat zone,\" that claim was similarly debunked.)", "Laura Bush also visited troops overseas during her time as first lady, paying a brief visit to Afghanistan in 2005:", "Under heavy protection in this dusty, dangerous capital, Laura Bush talked with Afghan women freed from Taliban repression and urged greater rights. She expressed high hopes, envisioning a day when tourists would flock here for vacations.", "There were reminders of war at every turn of Bush's visit. U.S. soldiers in camouflage fatigues manned M-60 machine guns at both ends of four transport helicopters that flew the first lady and her entourage to events around Kabul. Apache attack helicopters that shadowed the aircraft provided further security.", "Radcliffe, Donnie.   \"Barbara Bush's Pilgrimage.\"\r\n    The Washington Post.   23 November 1990.", "Associated Press.   \"Hillary Clinton Visits Bosnia, Thanks U.S. Peacekeepers.\"\r\n    26 March 1995.", "CNN.   \"Clinton Says She 'Misspoke' About Sniper Fire.\"\r\n    25 March 2008.", "Riechmann, Deb.   \"In Afghanistan, Laura Bush Focuses on Strides by Women.\"\r\n    The Washington Post.   31 March 2005.", "Anthony, Carl.   \"First Ladies & Veterans: The Vietnam War to Modern Times, Part 4.\"\r\n    National First Ladies Library.   13 November 2014.", "National Parks Service.   \"Eleanor Roosevelt and World War II.\"\r\n    3 December 2015.", "Smithsonian.   \"Why Eleanor Roosevelt Visited Active War Zones During WWII.\"\r\n    Retrieved 28 December 2018.", "Moore, Mark.   \"Donald and Melania Trump Make Surprise Visit to US Troops in Iraq.\"\r\n    New York Post.   26 December 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]