["About this rating", "With communities in Texas attempting to recover and rebuild from the devastating effects of Hurricane Harvey in late 2017, an administrative measure taken by one Texas city has attracted national attention.", "Texas Monthly reported:", "The city of Dickinson, in Galveston County, was among the hardest-hit places when Hurricane Harvey’s torrential rains slammed Texas. Residents now seeking Harvey relief face a strange ultimatum: agree not to boycott Israel, or your application for aid will be denied.", "The Houston Chronicle wrote:", "A recently passed state law prohibits Texas governmental entities — including cities — from contracting with or investing certain public funds in companies that boycott Israel.", "\"Anti-Israel policies are anti-Texas policies, and we will not tolerate such actions against an important ally,\" Gov. Greg Abbott said in a news release earlier this year.", "Dickinson's application for aid to rebuild homes and businesses requires residents to state that they will not boycott Israel during the term of the agreement, according to a form on the city's website.", "We received several inquiries from readers wondering about the veracity of these reports.", "As of 24 October 2017, the city of Dickinson, Texas, does indeed require anyone applying for a Hurricane Harvey Repair Grant to promise not to boycott Israel.", "Those seeking a grant are required to sign an agreement with the city of Dickinson \"for the purpose of providing funds to assist in rebuilding a home or a business impacted by Hurricane Harvey within the City in a timely manner that will maintain the City’s ad valorem and sales tax revenues, along with other benefits for the City as a whole.\"", "One of the terms of the application is:", "11. Verification not to Boycott Israel. By executing this Agreement below, the Applicant verifies that the Applicant: (1) does not boycott Israel; and (2) will not boycott Israel during the term of this Agreement.", "Dickinson Mayor Julie Masters told local TV news channel KHOU that the city was required to include that condition on the release of the funding by a recently-passed Texas state law - House Bill 89, which Governor Greg Abbott signed in May, and which came into effect on 1 September 2017.", "The law states:", "A governmental entity may not enter into a contract with a company for goods or services unless the contract contains a written verification from the company that it:", "Does not boycott Israel; and", "will not boycott Israel during the term of the contract.", "Speaking to KHOU, Mayor Masters said:", "We had to include that verbiage [from] that statute that was required in that statute...We're just the messenger - don't crucify us. We're just following state law.", "H.B. 89 does not appear to require that any release of public funds come with a commitment by the recipient not to boycott Israel. Rather, it states that Texas (or cities and towns within Texas) cannot enter into a contract with anyone \"for goods or services\" without adding the \"no boycott\" clause.", "Under Dickinson's \"repair grant application and agreement,\" the city would \"provide financial assistance directly\" to the recipient for the purpose of repairing and rebuilding private homes and businesses. So it's unclear how the city receives \"goods or services\" in return for the grant.", "However, the agreement also defines the grant recipient as an \"independent contractor.\"", "According to KHOU, Masters is set to consult with Texas state officials over the wording of the law.", "The American Civil Liberties Union has criticized both the Dickinson agreement and the state law, saying it was \"reminiscent of McCarthy-era loyalty oaths.\"", "In a statement, ACLU of Texas Legal Director Andre Segura said:", "The First Amendment protects Americans’ right to boycott, and the government cannot condition hurricane relief or any other public benefit on a commitment to refrain from protected political expression.", "Reigstad, Leif.   \"Dickinson Residents Must Take Stance on Israel to Get Harvey Relief.\"\r\n    Texas Monthly.   20 October 2017.", "Lewis, Brooke A. and Margaret Kadifa.   \"Dickinson Demands Hurricane Harvey Victims Agree to Not Boycott Israel.\"\r\n    Houston Chronicle.   22 October 2017.", "City of Dickinson, Texas.   \"Hurricane Harvey Repair Grant Application and Agreement.\"\r\n    Unknown publication date.", "Chapin, Josh.   \"City of Dickinson Defends Harvey Relief Requirement Regarding Israel.\"\r\n    KHOU-TV.   20 October 2017.", "King, Phil.   \"House Bill No. 89.\"\r\n    Texas State Legislature.   2 May 2017.", "ACLU of Texas.   \"Texas City Tells People no Hurricane Harvey Aid Unless They Promise Not to Boycott Israel.\"\r\n     20 October 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]