["Assembly Majority Leader Lou Greenwald has been a longtime critic of Gov. Chris Christie for providing tax breaks to millionaires, but apparently he and other Democratic legislators approved a new state budget with funding to do just that.\n\nThose dollars would provide a tax break for \"everyone,\" including people earning more than $1 million, the Camden County Democrat said during a July 15 interview on \"Inside Story\" on Philadelphia-based 6abc.\n\nBut PolitiFact New Jersey found Greenwald is wrong to suggest that funding would support an across-the-board tax cut.\n\nChristie originally called for an across-the-board reduction in the state income tax, but the Republican governor and the Democrat-led Legislature have since indicated that any tax cut would likely be limited to individuals below a certain income level and not apply to millionaires.\n\nAlso, Greenwald and other Assembly Democrats have advocated for a plan that includes raising taxes on millionaires, not lowering them.\n\nFirst, here’s the exchange between Greenwald and \"Inside Story\" host Matt O’Donnell.\n\nO’Donnell:  \"Do New Jerseyans deserve a tax break right now? Do all of them deserve a tax break right now, not next year?\"\n\nGreenwald: \"The answer to that question is yes, and the money is in the budget to give them a tax break this year.\"\n\nO’Donnell: \"Everyone?\"\n\nGreenwald: \"Everyone.\"\n\nO’Donnell: \"Including people who make more than a million dollars?\"\n\nGreenwald: \"Oh, absolutely.\"\n\nNow, here’s the history behind the tax cut debate raging in Trenton.\n\nChristie kicked off the discussion with his State of the State address in January, when he called for an across-the board 10 percent cut in the state income tax. That proposal equaled a tax cut for all New Jerseyans.\n\nBut Christie and the Democrats have indicated that such an across-the-board cut is now off the table.\n\nIn early March, Democrats in the State Senate and the State Assembly each laid out their own tax cut proposals, which only would benefit households earning up to $250,000 per year by providing an income tax credit based on their property taxes.\n\nThe key difference between the two proposals was that the Assembly Democrats called for increasing taxes on taxable income exceeding $1 million.", "The Legislature last month approved legislation sponsored by Greenwald to authorize that tax hike. At that point, the tax increase was no longer tied to an income tax credit, but instead to boosting property tax relief payments for residents earning up to $250,000.", "But Christie conditionally vetoed that bill and recommended amending it to implement an income tax credit for homeowners with $400,000 or less in taxable income. The governor’s latest proposal is based on the Senate Democrats’ plan.\n\nDemocrats, who set aside $183 million in the fiscal year 2013 budget for a tax cut, have said a reduction only would occur if Christie meets his revenue projections in the coming months.\n\nWhile it remains unclear whether any tax cut will be approved, Christie and the Legislature have indicated that a reduction would not be an across-the-board cut, but limited to residents below a certain income level and not apply to millionaires.\n\nIn response to our findings, Brian McGinnis, communications director for Greenwald, told us the assemblyman’s point was that reducing the property tax burden for the middle class would ultimately benefit all New Jerseyans, including millionaires.", "\"The Majority Leader has frequently talked about the hidden tax on all New Jerseyans being the hit a family’s property values take because property taxes are so high,\" McGinnis said in an e-mail. \"In providing significant property tax relief to 95% of New Jersey families, our plan would have addressed this problem — helping to stabilize property values and benefiting people throughout the state, including millionaires.\n\n\"Furthermore, as the Majority Leader said in the interview, lower property taxes for the middle-class makes our state a more attractive place to live, meaning millionaires (whom the Governor calls job creators) can attract more talented employees.\"\n\nOur ruling\n\nIn a TV interview, Greenwald said \"the money is in the budget\" to give a tax break to \"everyone,\" including people making more than $1 million.\n\nBut Christie and Democratic legislators have indicated that any tax cut would likely be limited to New Jerseyans below a certain income level and not apply to millionaires. In fact, Greenwald has been a leading advocate of doing just the opposite: raising taxes on millionaires.\n\nWe rate the statement False.", "To comment on this ruling, go to NJ.com.", "6abc.com, Inside Story, July 15, 2012\n\nNJToday, Democrats Respond to Christie's Speech on Tax Relief, July 2, 2012\n\nPolitiFact New Jersey, Chris Christie claims Democrats \"don't want to cut your taxes under any circumstances\", May 25, 2012\n\nNorthJersey.com, Alternative tax plan from Democrats, May 20, 2012\n\nNew Jersey Assembly Democrats, Majority Leader Greenwald on Middle Class & Seniors Property Tax Relief, June 21, 2012\n\nAssembly Bill A-3202, Makes FY 2013 supplemental appropriation of $789,000,000 to Homestead Benefit Program and amends budget language provisions to provide for significantly enhanced property tax relief payments to beleaguered homeowners and tenants, vetoed by Gov. Chris Christie on July 2, 2012\n\nAssembly Bill A-3201, Increases the gross income tax rate on taxable income exceeding $1 million contingent on enactment of certain homestead benefit enhancement legislation, conditionally vetoed by Gov. Chris Christie on July 2, 2012\n\nNew Jersey Governor’s Office, Governor Chris Christie Calls on Legislature to Join Him and Immediately Act to Deliver Middle-Class Tax Relief, July 2, 2012\n\nNew Jersey Governor’s Office, Conditional veto of Assembly Bill A-3201, July 2, 2012\n\nPolitiFact New Jersey, Stephen Sweeney claims his tax cut proposal would lower property taxes, March 15, 2012\n\nE-mail interview with Brian McGinnis, communications director for Assemblyman Lou Greenwald, July 16-17, 2012", "NorthJersey.com, Assembly plan for middle-class tax relief, March 11, 2012", "New Jersey Assembly Democrats, Greenwald, DeAngelo & Benson: Middle-Class Family Struggles Show Assembly Dem 20% Property Tax Relief Credit Best for N.J., April 18, 2012\n\nThe Star-Ledger, N.J. Democrats strike tentative $180M tax cut deal contingent on Christie hitting revenue projections, June 14, 2012\n\nThe Star-Ledger, Gov. Christie offers compromise tax cut at special Legislature session, July 2, 2012", "New Jersey Assembly Democrats, Property Tax Relief Proposal, accessed July 17, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]