["About this rating", "Saudi Arabia caused controversy in October 2017 by conferring citizenship on a robot named \"Sophia,\" who appeared at the Future Investment Initiative event in Riyadh.", "\"It is historical to be the first robot in the world to be recognized with citizenship.\" Please welcome the newest Saudi: Sophia. #FII2017 pic.twitter.com/bsv5LmKwlf", "— CIC Saudi Arabia (@CICSaudi) October 25, 2017", "\"Sophia’s recognition made international headlines,\" wrote the Washington Post, \"and sparked an outcry against a country with a shoddy human rights record that has been accused of making women second-class citizens.\"", "And indeed, it didn't take long for things to turn sour, at least according to one web site.", "\"Saudi Arabia beheads first female robot citizen,\" read the headline on a 9 November 2017 article on the military satire site Duffel Blog. In reality, that article - like everything on Duffel Blog - is fabricated.", "The number of robot citizens in Saudi Arabia was reduced back to zero today after Sophia Robot was beheaded in a public square in Riyadh. Sophia made news recently when Saudi Arabia granted her citizenship, making her the world’s first robot to gain such legal status.", "Sophia became the first robot citizen to be executed after a band of angry Saudi men dragged her into the streets earlier today for a public execution, setting yet another milestone for progress in the country.", "Apart from the fact that the Duffel Blog is, by its own description \"in no way, shape or form a real news outlet,\" there is no corroboration for the beheading story from any legitimate news source.", "The story also contains details that are clearly intended as humorous: \"A survey shows 79% of Saudi Arabian men approve of the execution, along with 100% of American men named Elon Musk.\"", "Despite all this, the story still managed to fool some readers.", "Duffel Blog has a long record of producing fabricated and satirical military-themed articles. A disclaimer on the web site reads:", "We are in no way, shape, or form, a real news outlet. Everything on this website is satirical and the content of this site is a parody of a news organization. No composition should be regarded as truthful, and no reference of an individual, company, or military unit seeks to inflict malice or emotional harm.", "All characters, groups, and military units appearing in these works are fictitious. Any resemblance to real persons, living or dead, or actual military units and companies is purely coincidental.", "Wootson Jr., Cleve R.  \"Saudi Arabia, Which Denies Women Equal Rights, Makes a Robot a Citizen.\"\r\n  Washington Post.  29 October 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]