["House Intelligence Committee Chairman Adam Schiff, D-Calif., talks to reporters about the release by the White House of a transcript of a call between President Donald Trump and Ukrainian President Voldymyr Zelensky on Sept. 25, 2019. (AP)", "Democratic Rep. Adam Schiff knew more about the makings of a whistleblower complaint against President Donald Trump than he let on, according to reporting from the New York Times. But Republicans, including Trump, who have seized on the Times reporting have erred in claiming the reporting suggests Schiff helped write the complaint itself.", "The Oct. 2 story said Schiff — the head of the House Intelligence Committee, which is investigating Trump — had learned about the whistleblower complaint before it was officially filed. The newspaper reported that the CIA officer who filed the complaint had approached a committee aide for advice on how to proceed with concerns over Trump’s July phone call with the president of Ukraine.", "The article explained how Schiff, D-Calif., knew to press for the release of the whistleblower complaint, which the Trump administration had previously tried to keep from Congress.", "The same day that the Times published its report, several right-leaning outlets jumped on the story, claiming it showed the whistleblower \"colluded\" with House Democrats. During a press conference, Trump claimed Schiff \"probably helped write\" the complaint and called it a hoax.", "One Facebook post published the same day took it a step further, alleging Schiff and House Speaker Nancy Pelosi, D-Calif., worked with lawyers to \"devise the complaint.\"", "Another one says, \"Nancy Pelosi and Adam Schiff were participants with attorneys and are complicit in EDITING AND COMPOSING THE ‘WHISTLEBLOWER COMPLAINT’ BEFORE IT WAS FILED.\"", "Those posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Schiff \"learned about the outlines\" of the whistleblower complaint from the House Intelligence Committee aide who consulted with the CIA officer, the Times reported. The Times did not report that Schiff helped write, or devised the complaint.", "The Times reporting, which relied on anonymous sources and has been corroborated by the Washington Post, shows that the whistleblower approached one of Schiff’s aides with only a vague accusation against Trump. The aide told the CIA officer to find a lawyer and then told Schiff some of what the whistleblower told them. The aide did not share the officer’s identity with Schiff.", "The whistleblower’s primary concern centered on the phone call Trump had with Ukraine President Volodymyr Zelensky on July 25.", "RELATED STORY: Timeline: The Trump impeachment inquiry", "During that call, a summary of which was released by the White House Sept. 25, Trump asked Zelensky to consider reviving an investigation linked to Burisma, the Ukrainian energy company that Joe Biden’s son had worked for as a board member while his father was vice president. That request came after Trump froze nearly $400 million in military aid to Ukraine.", "The whistleblower reached out to the House Intelligence Committee aide sometime before they filed the official complaint to the inspector general of the intelligence community Aug. 12. Pelosi announced a formal impeachment inquiry of Trump on Sept. 24, and Schiff is leading that inquiry.", "The Washington Post article said it is not uncommon for the House Intelligence Committee to receive informal inquiries from whistleblowers before a formal complaint is filed, according to \"current and former committee staffers.\" And the officer took their concerns to the committee only after they had a colleague relay them to the CIA’s top lawyer, which resulted in the CIA alerting the White House. That spooked the whistleblower into taking their concerns directly to the House, the New York Times reported.", "Schiff did receive some information about the whistleblower complaint before it was formally presented to Congress. But both the House Intelligence Committee and a lawyer representing the whistleblower told us the complaint was drafted independently of Schiff’s input, and we could find no evidence to the contrary. At the same time, Trump and Republicans have produced no evidence to suggest Schiff had helped draft or shape the complaint.", "We asked the House Intelligence Committee what Schiff learned from the aide about the whistleblower complaint. A spokesman declined to comment on the particulars of that interaction, but he denied that Schiff had any contact with the whistleblower directly.", "\"As Chairman Schiff has made clear, he does not know the identity of the whistleblower, has had no communication with them or their attorney, and did not view the whistleblower’s complaint until the day prior to the hearing with the (Department of National Intelligence) when the (Office of the Director of National Intelligence) finally provided it to the Committee,\" the committee spokesman said in an email.", "RELATED STORY: PolitiFact's Trump-Ukraine-Biden coverage in one place", "We also reached out to Mark Zaid, the attorney representing the CIA officer. He said he also can’t comment on what Schiff knew about the whistleblower’s concerns, but that the officer \"drafted the complaint entirely on their own.\"", "\"In fact, none of the legal team saw the complaint until it was publicly released by Congress,\" Zaid said in an email. \"To be unequivocally clear, no member or congressional staff had any input into or reviewed the complaint before it was submitted to the intelligence community inspector general. Nor has the whistleblower or the legal team met with or even discussed this complaint with congressman Schiff.\"", "Several Facebook posts claimed that Schiff helped write the whistleblower complaint against Trump.", "We still don’t know exactly what information Schiff received about the whistleblower’s concerns. But there is no evidence to suggest that Schiff knew who the whistleblower was, much less that he helped them draft this complaint. The Facebook posts go beyond what has been reported.", "Absent any additional evidence, the claim that Schiff helped write the whistleblower complaint is inaccurate. We rate the Facebook posts False.", "The Daily Wire, \"Trump, Media, Critics Nuke Schiff Over Whistleblower Bombshell: ‘He Helped Write It,’\" Oct. 2, 2019", "Email interview with the House Intelligence Committee, Oct. 4, 2019", "Email interview with Mark Zaid, the whistleblower’s attorney, Oct. 4, 2019", "Facebook post, Oct. 3, 2019", "Facebook post, Oct. 3, 2019", "The Federalist, \"BREAKING: Anti-Trump Whistleblower Colluded With House Democrats Before Filing Complaint,\" Oct. 2, 2019", "The New York Times, \"Acting Intelligence Chief Refuses to Testify, Prompting Standoff With Congress,\" Sept. 17, 2019", "The New York Times, \"Schiff Got Early Account of Accusations as Whistle-Blower’s Concerns Grew,\" Oct. 2, 2019", "PolitiFact, \"Here's the readout of Donald Trump's call with Ukrainian President Volodymyr Zelensky,\" Sept. 25, 2019", "The Rush Limbaugh Show, \"Schiff Colluded with Leaker, Suggested He Become Whistleblower,\" Oct. 2, 2019", "The Washington Post, \"Whistleblower sought informal guidance from Schiff’s committee before filing complaint against Trump,\" Oct. 2, 2019", "YouTube video from Fox News, Oct. 2, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]