["About this rating", "The Dakota Access Pipeline, abbreviated as DAPL, was a fixture in news reports for much of late 2016 as protesters blocked construction sites for a proposed oil pipeline that would potentially cut through land sacred to the Standing Rock Sioux Tribe.", "The protests have been studded with clashes and arrests.  Police took 141 people into custody after a confrontation with demonstrators while clearing an encampment off private property near the Dakota Access Pipeline on 27 October 2016, the Washington Post reported. Among those taken into custody was Caddo Nation chairwoman Tamara Francis-Fourkiller, an expert on sacred burial grounds who was advising the Sioux of Standing Rock in negotiations with construction supervisors.", "On 29 October, family members of the tribal leader said an anonymous donor had stepped forward with $2.5 million dollars to pay bail for the release of Francis-Fourkiller and everyone else arrested earlier that week, according to News 9 of Oklahoma City. The same information was disseminated on the White Wolf Pack blog.", "Two days later, however, a nonprofit legal group involved in the proceedings issued a statement strongly denying that any such donation was made or received:", "The Red Owl Legal Collective, who appeared at the bond hearings for those arrested, absolutely denies that any such contribution was received or used for bail money, vehicle forfeiture money, or in any manner for the defense of those arrested. We question the validity of the statement from \"The White Wolf Pack\" or any other media source, and we are concerned that this false assertion will deter people from contributing to the organizations who have been involved in posting bail for and defending the water protectors.", "A 30 October post on the Red Owl Legal Collective's Facebook page thanked donors to the Legal Defense Fund of the Sacred Stone Camps and the jail support team from the Red Warrior Camp for assistance securing the release of those arrested:", "We have reached out to the parties involved for further clarification, and await their responses.", "Hawkins, Derek.   \"Dakota Access Protesters Accuse Police of Putting Them in ‘Dog Kennels,’ Marking Them with Numbers.\"\r\n   The Washington Post.   1 November 2016.", "Mitchell, Jessi.   \"More Than 140 People Arrested As Pipeline Protest Tensions Escalate.\"\r\n   News 9.   30 October 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]