["About this rating", "Since 2014, climate-change deniers have squeezed millions of views, Facebook shares, and Twitter retweets by retelling a story alleging the discovery of “faked” NASA data designed to “fit a climate change narrative.” Though copied almost wholesale from a blog post, the version of the story that has had the most online traction was published on the one-stop conspiracy theory/supplement shop that goes by the name Natural News. The article suggested:", "In what might be the largest scientific fraud ever uncovered, NASA and the NOAA have been caught red-handed altering historical temperature data to produce a \"climate change narrative\" that defies reality. [...] We now know that historical temperature data for the continental United States were deliberately altered by NASA and NOAA scientists in a politically-motivated attempt to rewrite history and claim global warming is causing U.S. temperatures to trend upward.", "There is a lot to unpack here, but the first thing you need to know is records of global surface temperatures are constantly refined based on the addition of new data, fresh statistical analyses, or new historical insight into the history of a specific source of data. Reporting on such a shift as something to “uncover” betrays a potentially willful ignorance of how climate science operates. These changes are publicly reported, based on stated scientific criteria, and subjected to rigorous internal and external peer review.", "The “smoking gun” concerns a climate record known as the NASA Goddard Institute for Space Studies Surface Temperature Analysis (GISTEMP). These records are based on a massive global dataset of temperature stations from around the world, combining several collections of data originally collected by individual weather stations. The record provides “a measure of the changing global surface temperature with monthly resolution for the period since 1880, when a reasonably global distribution of meteorological stations was established.”", "To argue for evidence of “faked” data, Natural News, as well as the original blog post, highlighted a version of the GISTEMP record for the United States first published in 1999, comparing it to one published later, in 2012. The record, these sources point out, has shifted:", "(These charts plot how far off each year’s average U.S. temperature differs from the average temperature for the entire period 1951–1980; the frame labeled “a” is from 1999.)", "It should be no shock that the data shifted following 1999, as illustrated graphically in the above diagram, because NASA published multiple papers in 1999 and 2001 about these changes and why they were made. Links to these papers can be found on the NASA website, which also publicly summarizes the changes in several other places.", "Writing for the climate information website Skeptical Science, Berkeley Earth research scientist Zeke Hausfather, whose work (in part) independently analyzes adjustments made by government agencies’ climate records, explained the need for making adjustments to such datasets in general. A primary misconception, he argues, is that an “unadjusted global temperature record” — which necessarily has to take into account not only the temperature reading at a given recording station, but also how to translate that data spatially to come up with a single annual or monthly number — is not really a thing that exists to begin with:", "There are a number of folks who question the need for adjustments at all. Why not just use raw temperatures, they ask, since those are pure and unadulterated? The problem is that ... there is really no such thing as a pure and unadulterated temperature record. Temperature stations in the U.S. are mainly operated by volunteer observers (the Cooperative Observer Network, or co-op stations for short). Many of these stations were set up in the late 1800s and early 1900s as part of a national network of weather stations, focused on measuring day-to-day changes in the weather rather than decadal-scale changes in the climate.", "Nearly every single station in the network in the network has been moved at least once over the last century, with many having 3 or more distinct moves. Most of the stations have changed [the type of instruments used]. Observation times have shifted from afternoon to morning at most stations since 1960, as part of an effort by the National Weather Service to improve precipitation measurements.", "So what were the issues that led to changes between the 1999 record and the later record? According to NASA’s GISTEMP website, “Starting in the 1990s, the methodology took into account documented non-climatic biases in the raw data and eliminated or corrected unrealistic outliers.” The goal of these adjustments is to remove shoddy data from the dataset using pre-established methodologies, not to fit a “climate change narrative.”", "These “non-climatic biases” include things like stations taking temperature measurements at different times of day, stations physically moving locations (sometimes to a different elevation), and other artifacts that produce change in a record not attributable to climate or weather. These non-climatic biases were identified and their method of adjustment described in a publicly available 2001 paper found, among other places, on NASA’s website. They included:", "Additionally, post-1999 GISTEMP records employ models to fill in areas with missing data to make a more complete record from a spatial perspective. The methods used and their effect on the data are all disclosed online. However the issues described above are largely moot at the time of this writing in 2019. The GISTEMP analyses at issue above concern a formulation of the dataset (GISTEMP v3) that has been replaced by an improved model named GISTEMP v4, which includes a much larger set of data and a whole other set of adjustments.", "All told, the most significant effect of all these changes came from the time-of-day adjustments. Collectively, the adjustments served to produce a slightly increased warming trend in the United States record compared to the earlier records.", "The largest adjustments are the time of observation debiasing and station history adjustment, each of which increases the mean warming over the United States by about 0.15ºC over the 100 years. The net of all five adjustments to the ... record is a warming of about 0.3ºC", "To suggest — 14 years after the fact — that identifying publicly discussed adjustments to raw data whose methods have been published in peer-reviewed journals represents catching scientists “red-handed” in “the largest scientific fraud ever uncovered” exposes only the ignorance of the author, not some nefarious sleight of hand by climate scientists. As such, the claim is rated \"False.\"", "Lee, Stephanie M.   “How Anti-Science Forces Thrive On Facebook.”\r\n    BuzzFeed News.   7 March 2017.", "stevengoddard.wordpress.com.   “Data Tampering At USHCN/GISS.”\r\n    Accessed 3 October 2019.", "Adams, Mike.   “Global Warming Data Faked by Government to Fit Climate Change Fictions.”\r\n    Natural News.   23 June 2014.", "Hausfather, Zeke.   “Understanding Adjustments to Temperature Data.”\r\n    Skeptical Science.   26 February 2015.", "NASA Goddard Institute for Space Studies.   “GISS Surface Temperature Analysis (GISTEMP v4)”\r\n    Accessed 3 October 2019.", "Carbon Dioxide Information Analysis Center.   “NASA GISS Surface Temperature (GISTEMP) Analysis.”\r\n    Accessed 3 October 2019.", "Hansen, J.R., et al.   “GISS Analysis of Surface Temperature Change.”\r\n    J. Geophys. Res.   1 December 1999.", "Hansen, J.R., et al.   “A Closer Look at United States and Global Surface Temperature Change.”\r\n    J. Geophys. Res.   1 October 2001.", "NASA Goddard Institute for Space Studies.   “History of GISTEMP.”\r\n    Accessed 3 October 2019.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]