["About this rating", "On 14 December 2016, the Facebook page \"Occupy Democrats Logic\" (not to be confused with \"Occupy Democrats\") published a screenshot of a claim about the People for the Ethical Treatment of Animals (PETA) organization and some lobsters they allegedly attempted to \"save\":", "PETA came to Nebraska and bought a bunch of our live lobsters and freed them onto the Missouri River.", "The Missouri River is freshwater.", "Lobsters are saltwater.", "Yeah, they died.", "Thanks, PETA.", "The original post depicted in the screenshot was dated 29 March but lacked a year. Also missing were details about the name of the fishmonger, identifying information about the bungled lobster rescue, or any other details that would help tie the claim to an actual event.", "Earlier versions of a similar rumor gave it the flavor of an urban legend:", "@AsheSchow Years ago a PETA activist smashed a lobster tank in the middle of NYC to let the lobsters \"run free.\" They all died. — Darth Paul (@PaulGof2814) April 26, 2016", "Lobsters are indeed unable to survive in freshwater, and the Missouri River is a freshwater body. However, comments made by the Facebook page's operators suggested that the claim was shared as a joke or parable about PETA and its associates and not as a reflection of a real-life incident:", "We asked PETA via Twitter whether there was any truth to the tale but did not receive a response.", "Meanwhile, as participants in online forum threads discussed the claim during its December 2016 circulation, we found no information (either in news reports or anecdotes) suggesting that this particular story had existed until shortly before then.", "The \"lobsters in Nebraska\" rumor was one of a constellation of claims that PETA engages in behavior that is negligently or purposely harmful to the animals they profess to care deeply about. But (as with earlier rumors of similar thematic basis), we found no evidence the described lobster abuse took place, either incidentally or regularly.", "Northeast Fisheries Science Center (NESFC).   \"Lobster FAQs: Can a Lobster Be Kept Alive in Fresh Water with Ice?\"\r\n    Accessed 14 December 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]