["About this rating", "Following the Jan. 6, 2021, insurrection at the U.S. Capitol in the District of Columbia, photographs depicting the riot and its resulting damage took over newspaper front pages around the nation. One such widely viewed picture, of rioters scaling on the Capitol grounds, was snapped by Associated Press photographer Jose Luis Magana.", "Magana's photograph was featured in a many local and national news reports around the U.S., from USA Today to the San Francisco Chronicle. In nearly all of the newspapers and online publications that used Magana's work, editors chose to accompany the image with the caption offered for it by The Associated Press , which read as follows:", "Supporters of President Donald Trump Climb the west wall of the U.S. Capitol on Wednesday, Jan. 6, 2021, in Washington. {AP Photo/Jose Luis Magana}", "But the Tyler Morning Telegraph, a newspaper based in Tyler, Texas, opted to instead run an alternative — and untrue — caption with the photograph identifying the rioters as “members of Antifa dressed as supporters of President Donald Trump.\" The inaccuracy was pointed out in a Jan. 8 Tweet posted by journalist Michelle Garcia, a verified user and editor of NBC BLK:", "The Tyler Morning Telegraph addressed the incorrect cutline on the Associated Press photograph in a statement issued online on Jan. 8. Editors noted that an “incorrect cutline” was used with an Associated Press photo which “incorrectly identified protesters as members of Antifa”:", "Tyler Morning Telegraph", "“This was inserted by one person and does not represent the views or opinions of the Tyler Morning Telegraph,” read the statement. “The error has been corrected in every place that we can correct it and we will run a correction in print.”", "We do not yet know who was responsible for the incorrect cutline or whether that person still works for the Tyler Morning Telegraph. The newspaper did not immediately respond to a request for further clarification and a copy of the printed correction.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]