["About this rating", "A vaguely worded bill (SB180) proposes expanded protections for Kentucky residents seeking to deny services based on sincerely held religious beliefs.", "Kentucky has banned (or is attempting to ban) interracial marriages.", "On 12 March 2016, the web site Winning Democrats published an article reporting that the Kentucky state senate had passed a bill legalizing discrimination against mixed-race couples:", "Despite being legal in the United States since 1967, Kentucky Republicans are trying to turn back the clock on interracial marriage by allowing discrimination against interracial couples.", "A bill moving forward in the Kentucky Senate would give private businesses and public institutions the right to discriminate against basically anyone they want to as long as they hide behind their Bibles when they do it.", "That article story referenced a SB 180, a bill introduced into the Kentucky state senate on 18 Feb 2016, and the mention of \"allowing discrimination against interracial couples\" led some readers to infer that the bill in question had made (or would make) mixed-race marriage illegal in Kentucky.", "The bill made no mention of interracial couples, however. Instead, it sought to clarify that under the provisions of the Religious Freedom Restoration Act enacted by Kentucky in 2013, businesses could not be punished for violating local ordinances that prohibit discrimination based on sexual preference or gender identity if the discriminatory practices were based on \"sincerely held religious beliefs\":", "Government shall not substantially burden a person's freedom of religion. The right to act or refuse to act in a manner motivated by a sincerely held religious belief may not be substantially burdened unless the government proves by clear and convincing evidence that it has a compelling governmental interest in infringing the specific act or refusal to act and has used the least restrictive means to further that interest. A \"burden\" shall include indirect burdens such as withholding benefits, assessing penalties, or an exclusion from programs or access to facilities.", "The Kentucky Legislature's official SB180 page summarized the bill as follows:", "Create a new section of KRS Chapter 446 to define \"protected activities,\" \"protected activity provider,\" and \"protected rights\"; provide legislative intent; prohibit any statute, regulation, ordinance, order, judgment, of other law or action by any court, commission, or other public agency from impairing, impeding, infringing upon, or otherwise restricting the exercise of protected rights by any protected activity provider; prohibit a protected activity provider from being fined, imprisoned, held in contempt, or otherwise punished or found liable for actions or inactions related to providing or refusing to provide protected activities unless a court finds that the complaining person or the government proved by clear and convincing evidence that a compelling governmental interest in infringing upon the act or refusal to act existed and the least restrictive means was used.", "The bill's three pages make no mention of race in general or of interracial marriage in particular. The argument advanced by critics is that the bill is so vaguely worded that it would allow officials (both public and religious) to refuse to sanction mixed-race marriages, or businesses to provide service to mixed-race couples, simply by citing a religious objection to racial blending:", "In other words, interracial couples, Muslims, atheists, and gay people can be denied services by businesses and the government for religious reasons even though federal law explicitly forbids discrimination. While the bill does not expressly mention these groups, it is so broad that it might as well.", "However, the provisions of this bill have not actually been passed into law in Kentucky, nor — contrary to what is asserted above — has the bill even been approved by the Kentucky senate (it has simply cleared committee, paving the way for it to be voted upon). The measure would have to be passed by both houses of the Kentucky legislature, and signed by the governor, before becoming law.", "Moreover, it is exceedingly unlikely that a state's allowing its residents to engage in racially-based discrimination (in the form of denial of services) by citing \"sincerely held religious belief\" would pass constitutional muster if challenged.", "That doesn't mean citizens shouldn't be concerned about the potential deleterious effects of such a broadly or vaguely worded law, though. For example, a 29 February 2016 editorial published in Kentucky's State Journal, written by a former lobbyist familiar with Kentucky's recent legislative history, detailed concerns about the bill's potential to advance discriminatory laws and practices:", "[O]ver the past decade I have witnessed an unfortunate trend toward discrimination against gay citizens, based on, of all things, religious beliefs.", "Nothing is more evident of that than Senate Bill 180 from the current legislative session.", "This bill has already gained approval from a Senate committee, oddly enough with the moniker of Public Protection, and if it achieves passage, Lexington's mayor may not be welcomed into some businesses in his own city, Sir Elton John may not be able to go into some restaurants in Louisville after one of his concerts and a great number of Kentucky’s gay citizens, many of whom I proudly call friends could suffer the same fate in cities across our fine Commonwealth. So where does this stop? Will police one day not have to protect gay citizens?", "Nobody knows the answer to those questions, and that is what we as Kentuckians should fear.", "Thankfully, the House of Representatives is still in a position, at least for now, to stop such legislation.", "Many instances of this controversy appeared to stem from a 3 March 2016 article posted to the web site Progress Kentucky, which contained a clarification at the end about a potentially misleading headline:", "Senators, please pull this bill. It is a bad bill that promotes discrimination, that will damage our state, and in the end will actually be dangerous to the very people you are trying to protect. Kill SB 180.", "Update: I have changed the headline on the story, as I came to agree with others that it was misleading. The Senate did not pass the actual bill (yet); it only passed in committee.", "But, the rest of the story stands. This bill is both so broad and so poorly written that it could absolutely lead to the kind of discrimination that I hope the sponsors never intended.", "If you believe that this sort of discrimination in the name of so-called religion is wrong, contact your legislators.", "In short, SB 180 was primarily interpreted as a bill that would allow individuals to cite their religious beliefs as a legally valid reason for discriminating against same-sex couples, but some critics attempting to warn the public of the bill's implications broadened its hypothetical scope to encompass legalized discrimination against mixed-race couples as well.", "On 15 March 2016, SB180 passed in a 22 to 16 vote and moved on to the state house. It was not codified into law on that date.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]