["About this rating", "Bill Clinton was filmed inside a polling place in West Roxbury; Massachusetts state officials called the campaign to \"remind\" the Clintons of polling place laws; the state maintained they were unaware of any illegal activity.", "Bill Clinton definitively broke Massachusetts election law on 1 March 2016.", "Whether the \"150 foot rule\" was broken at any point during the day.", "On 1 March 2016 — Super Tuesday — people in twelve states (as well as Democrats both in the territory of American Samoa and living abroad) cast votes in the Presidential primaries.  On the Democratic side, which included eleven of those twelve states, Vermont Senator Bernie Sanders came away with Colorado, Minnesota, Oklahoma, and Vermont, while former Secretary of State Hillary Clinton took Alabama, Arkansas, Georgia, Massachusetts, Tennessee, Texas, and Virginia.", "Massachusetts quickly emerged as a point of contention among Sanders supporters. While Clinton carried double-digit margins in all other states she won, Massachusetts remained an outlier with a narrow 1.4 point margin:", "For some time after the state's polls closed, pundits and press were reluctant to call Massachusetts for either candidate. The New York Times' \"Upshot\" blog reported:", "Massachusetts was distinctive on Super Tuesday for another reason, as well. Former President Bill Clinton was on site at many polling places in the state throughout the day, shaking hands and greeting primary voters who came out to cast ballots. Sanders supporters shared stories on social media in which they claimed Bill Clinton engaged in electioneering, obstructed polling places, suppressed voters by causing a commotion, or otherwise engaged in activities that obstructed or influenced the vote:", "Bill was campaigning for #Hillary DIRECTLY OUTSIDE of a MA polling location today!", "THIS IS ILLEGAL! #Electioneering https://t.co/ahmjn4hlXo", "— Michigan for Bernie (@Michigan4Bernie) March 1, 2016", "#SuperTuesday Even if not illegal, electioneering and blocking parking lots and polling areas is a bad move. https://t.co/7X8MzTgKJK — Casey Ferguson (@caseynsb) March 1, 2016", "Here's a fun video of a former President of The United States electioneering for his wife! https://t.co/RvHrVTtFjc — Tristan Odle (@Tristan_Odle) March 1, 2016", "The controversy didn't live and die just on social media platforms, although it did inspire a hashtag: #MoveBillGetOutTheWay.  The Boston Globe reported later that day that the claims caught the attention of election officials, and earned the Clinton campaign a \"reminder\":", "According to the Election Day Legal Summary on [Secretary of State William F.] Galvin’s website, certain activities on Election Day are prohibited within polling locations and within 150 feet of polling places, including the “solicitation of votes for or against, or any other form of promotion or opposition of, any person or political party.”", "Bill Clinton had also been inside the Newton Free Library, a polling station in Newton, on Tuesday, after greeting supporters outside. A spokesman from Galvin’s office said Hillary Clinton’s campaign had been “notified” of the state rules. “We have heard about it, and the clerks have been instructed and the campaign has been instructed that 150 feet is the rule,” said Brian McNiff, a spokesman for Galvin’s office.", "Galvin reiterated the state's position in a comment to the New York Times, confirming they had called the Clinton campaign before Bill Clinton's appearance in New Bedford, after reports began flooding in:", "“We had to remind some of our poll workers that even a president can’t go inside and work a polling place,” William F. Galvin, the Massachusetts secretary of state, said in an interview.", "A pool report from Mr. Clinton’s visit to Boston’s West Roxbury neighborhood on Tuesday morning said that he went inside the polling place with the city’s mayor, Martin J. Walsh ... When one woman asked for a photo, Mr. Clinton said, “As long as we’re not violating any election laws,” the pool report said.", "He then showed up at a library in Newton, Mr. Galvin said, and the poll workers were flummoxed. “We had to remind everybody what the rules are, that there is no campaigning within 150 feet of the voting booths because people are entitled to their privacy,” Mr. Galvin said. “And it’s not just him but his media entourage.”", "“He can go in, but he can’t approach voters,” Mr. Galvin said. “We just took the extra precaution of telling them because this is not a usual occurrence. You don’t usually get a president doing this.”", "In a 1 March 2016 Boston.com piece, Brian McNiff, a spokesman for the Massachusetts secretary of state, reiterated that the Clinton campaign was \"reminded\" of election rules during the Massachusetts primary:", "McNiff was asked if Clinton’s presence would, on its own, constitute a solicitation. “He’s a well known person. And he’s a spouse of a candidate,” McNiff said. “That should answer the question.” He declined to further elaborate.", "A video was tweeted out by WCVB reporter Sera Congi, in which Bill Clinton was shown inside a polling place:", "Fmr President Bill Clinton and @marty_walsh Meeting election workers in West Roxbury #wcvb #SuperTuesday pic.twitter.com/BiHK3eGSoc — Sera Congi (@seracongi) March 1, 2016", "A Change.org petition addressed to Massachusetts Attorney General Maura Healey called for Clinton's arrest, and maintained:", "This is a call for the immediate arrest of President Bill Clinton for clear, knowing and egregious violation of the campaign laws to swing an election in a significant way. It could not be any clearer in the Massachusetts General Laws. \"Campaigning within 150 feet of a polling station, or in any way interfering with the right to vote\". Choosing the critical battleground state of Massachusetts, Bill Clinton should immediately be subject to arrest and prosecution. Bill Clinton was not only electioneering within the boundary. Although the spokesperson for Bill Clinton denies that he was ever inside a polling place, photos and video show him clearly greeting and talking up election workers inside.", "After being told to refrain from this activity, which is a 3rd degree Voter Violation Felony, for which Clinton indeed must have known the law and chose to violate it, Bill Clinton does not vote in Massachusetts, and would have no other business in a polling station on election day besides campaigning for his wife.", "The Dallas Morning News reported that the activity wasn't a clear-cut case of breaking election law, and fell into ambiguous territory:", "So did Bill Clinton break Massachusetts election laws? Only if he was actively campaigning when he went inside the polling stations, which doesn’t seem to be the case.", "Did the pack of people traveling with him make things a little inconvenient for voters? Probably. Did it rise to the level of a crime? Probably not.", "On 2 March 2016, CNN spoke to Brian McNiff about the controversy. McNiff said the Galvin's office was not aware of any legally prohibited activity at any of the four polling places involved:", "Brian McNiff, spokesman for the secretary of the commonwealth of Massachusetts, says shaking hands alone isn't prohibited. Explicit campaigning is what's banned within 150 feet of a polling places.", "\"Just meeting people doesn't constitute campaigning,\" McNiff told CNN. \"We received no information that anything like that happened.\"", "His office said it reached out to the Clinton campaign Tuesday \"just to remind them about the 150 foot rule.\"", "It's true that Bill Clinton's Super Tuesday activities in Massachusetts caught the attention of state officials, and that between stops, the Clinton campaign was reminded by Galvin's office of \"the 150 foot rule.\" However, McNiff told reporters that the office was unaware of any specific violations, and did not indicate that officials believed any laws had been broken.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]