["The video was notably shared on this Facebook page, which has more than 80,000 followers. It has been viewed over 13,000 times since it was posted on January 7, 2020.", "The caption reads: “Video of Iraq citizens stonning [sic] U.S Army caravan in Iraq.”", "The same video was posted alongside the same claim in several other Facebook posts, like here and here.", "The logo on the video belongs to the Russian international television network RT (formerly known as Russia Today).", "Using the digital verification tool InVID, we extracted keyframes and ran a reverse image search on the Yandex search engine. This led us to find the same video (in higher quality, and slightly longer) on RT Arabic’s official YouTube page. The title, in Arabic, reads “The residents of Al-Malikiyah throw stones at Turkish patrols,” and the caption mentions that this is a Turkish-Russian joint patrol. Al-Malikiyah is a city in northern Syria.", "Last November, during the same week RT published this video, AFP reported that a Turkish-Russian military patrol was pelted with stones by angry protesters in northern Syria.", "By typing different keywords into YouTube (like “Turkish,” “Russian,” “Syria” and “stones”), we found other videos from the same protest, including a CBS Evening News report titled “Kurds protest Turkish and Russian forces in Syria”. The report features CBS foreign correspondent Charlie d’Agata reporting on the ground in northern Syria.", "A closer look at CBS report shows that it matches the location of the RT video.", "First, there is a cemetery along the roadside in both videos. In the first clip, the graves are visible starting at 1'10'', while in the CBS report, they appear at 1'16''.", "In both videos, you can see an identical tree in the cemetery, as shown below.", "At one point, the two videos also share the exact same shot showing a man dressed in beige trousers and a white shirt throwing a projectile at the passing vehicles. The camera then pans out to reveal a boy dressed all in red and a girl in a white shirt and black pants, who are also throwing projectiles.", "In October 2019, Turkey and Russia agreed to patrol a strip of land in northern Syria in a bid to remove the Syrian Kurdish YPG militia to beyond 30 kilometres from the Turkish border. The deal brokered between Turkish President Recep Tayyip Erdogan and Russian President Vladimir Putin can be found here.", "Why was this deal made?", "The Turkish government considers the YPG to be a terror group due to its links to the outlawed Kurdistan Workers' Party (PKK) that has waged a bloody campaign against the Turkish state since 1984. Ankara and Moscow struck the deal after the United States’ abrupt withdrawal of 1,000 US troops from northern Syria in October 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]