["About this rating", "On Feb. 8, 2021, a Facebook post on the America's Last Line of Defense page posited that the NFL's Super Bowl LV champions had refused an invitation to the White House. The invitation purportedly came from U.S. President Joe Biden. The post and story were shared thousands of times. The day before, the Tampa Bay Buccaneers, led by quarterback Tom Brady, defeated the Kansas City Chiefs 31-9.", "The article read, in part:", "Superbowl Champions Refuse Invitation to 'Stolen' White House", "...", "By now we all know who was victorious and boy, was that exciting, right?  Did you see that pass that went right across where the Viagra ad was in the stands?  Absolutely incredible!  Mr. You-Know-Who is definitely going to get MVP for that beautiful nonsense!", "Anyway, even though the best team won, they’re refusing to go to the White House because the towel boy is a trumptard who thinks the election was somehow stolen, yes, even now.  It was decided that nobody wanted the dumbass kid to cry all night, so they told him they cancelled and then locked him in a toilet stall wrapped up in jockstraps.  So maybe it’ll happen later.  Great game!", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical.", "For background, here is why we sometimes write about satire/humor.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]