["A 10-year-old photo of CNN’s Anderson Cooper is circulating the internet as \"evidence\" of exaggerated Hurricane Florence coverage by the media.", "Variations of the post have generated thousands of social media shares, including Donald Trump Jr. on Twitter and a senior official at the Department of Housing and Urban Development on Instagram.", "It’s a shame that CNN’s ratings are down 41%. What’s worse is there’s a simple solution that they refuse to accept. Stop Lying to try to make @realDonaldTrump look bad. https://t.co/O3XyWchsJh pic.twitter.com/BCUCxKnOvO", "Speaking from the studio, Cooper took the last 10 minutes of Anderson Cooper 360° on Sept. 17 to defend himself against the 2008 photo-turned-2018 meme that said he exaggerated the floodwater levels of Hurricane Florence by standing or kneeling in a ditch.", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The photo was taken during a liveshot in 2008 while Cooper was in Texas covering Hurricane Ike. Clips of the 2008 footage were posted on several blogs at the time, verifying the segment’s age.", "At the time, Ike had been downgraded to a tropical storm, but there was still significant flooding in the area where Cooper was reporting. Cooper notes several times that the water is receding. At one point, he has his cameraman film a wooden pole that is still wet from when water levels were about a foot-and-a-half higher.", "\"You can see the water is definitely going down,\" he said in the 2008 liveshot.", "Cooper also said in the original liveshot that he’s standing next to a road that is on higher ground than most of the area and is being used for evacuations. He points out that there is a drop-off from the road to the surrounding area.", "In his fact-checking segment, Cooper said his camera crew was standing near the road to keep the camera equipment dry. He also said he was not standing on the road because he did not want to hinder the evacuation efforts.", "Doug Thomas, a long-time CNN audio technician, was the cameraman seen in the viral photo. He died in September 2017.", "This photo comes from 2008 coverage of Hurricane Ike. Cooper repeatedly shows the range of water depth in the liveshot and is not on his knees or in a ditch. Because the photo is from 2008, the liveshot was not taken to \"make @realDonaldTrump look bad.\"", "We rate this claim Pants on Fire.", "Donald Trump Jr., tweet, Sept. 16, 2018", "Anderson Cooper 360°, tweet, Sept. 17, 2018", "CNN, \"Anderson Cooper debunks Trump Jr.'s fake news claim on live television,\" Sept. 18, 2018", "Lynne Patton, Instagram post, Sept. 16, 2018", "AllThingsAndersonCooper.com, \"Ike, the day after,\" Sept. 13, 2018", "The Washington Post, \"Anderson Cooper accuses Donald Trump Jr. of ‘tweeting lies’ with old hurricane photo,\" Sept. 18, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]