["Shortly after the governor of Nigeria’s southern Ondo state, Rotimi Akeredolu, and his wife, Betty Anyanwu-Akeredolu, cast their votes during a local election on October 10, 2020, footage from a Nigerian TV station showing armed police shooting in the air surfaced on social media along with different claims.", "Akeredolu contested the election under Nigeria’s ruling All Progressives Congress (APC) to secure his second term in office.", "But before he was officially declared the winner on October 11, 2020, numerous online posts, including this one on Facebook with more than 122,000 views, claimed that the TV clip showed an attack on voters by Akeredolu’s security guards, leaving three people dead and his wife injured.", "The video clip was also shared in this tweet with claims that it shows an attack by supporters of Nigeria’s main opposition People’s Democratic Party (PDP).", "But the video is not recent and was taken more than two years earlier.", "Using the InVID-WeVerify tool, AFP Fact Check ran several reverse image searches on keyframes of the video. We then found a longer version of the clip published on YouTube in October 2018 by Nigerian television station ChannelsTV.", "The clip is the second in a series of reports shot by the network during a PDP primary election for an MP seat in Nigeria’s southern Delta state ahead of the country’s 2019 general elections.", "According to ChannelsTV, violence broke out at the polling venue in the capital Asaba following an argument among party delegates, which later prompted police to fire into the air.", "The TV banner in the original video reads: “DELTA STATE PDP HOUSE OF REPS PRIMARY”.", "The text was manipulated in the versions now being shared on social media, to read: “AKEREDOLU’S WIFE INJURED, 3 KILLED AS GOVERNOR’S DETAILS INVADE PU” as well as “JEGEDE’S WIFE SHOT, OTHERS INJURED AS PDP THUGS INVADE POLLING UNIT”.", "Eyitayo Jegede was PDP’s candidate in the state election.", "The ticker beneath the TV banner has also been changed to include a message about face masks and then another about the governorship election, though it jumps choppily from one to the other and back again.", "AFP Fact Check confirmed the footage was indeed recorded in Nigeria’s Delta state.", "Using Google Maps, we found a picture showing the exact location in Asaba called The Cenotaph. It serves as an event centre for special occasions, according to the state government.", "Physical features in the video, including the military statue, can be seen on the Google Maps image.", "ChannelsTV also spoke out against the misuse of its report.", "“FAKE NEWS: The video below is doctored and is not part of Channels Television’s coverage of the Ondo 2020 Governorship Election,” reads a tweet by the TV station.", "FAKE NEWS: The video below is doctored and is not part of Channels Television's coverage of the Ondo 2020 Governorship Election.\n\n\t\tThe events playing out in the video is from an incident in Delta State two years ago.\n\n\t\tSee link to the original video: https://t.co/Q3AHXtNWaR pic.twitter.com/jZyTyrOHHO", "Anyanwu-Akeredolu has repeatedly dismissed the claim as untrue. “That is insane, that is absurd,” she said in an interview with Channels Television alongside her husband.", "Shortly after the claim went viral, she addressed her purported injury in a Facebook video, saying “it’s all false” and that the claim shows what “distractors are trying to do to damage the exercise”.", "Although there were reports of politically-fuelled clashes at some voting stations in Ondo state, no credible media organisations in Nigeria reported on violence at this particular venue.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]