["About this rating", "In July 2020, Mississippi state Sen. Chad McMahan posted a warning to businesses in his state that were declining to handle cash during the COVID-19 pandemic (due to fears of virus transmission via surface contact) that they were breaking the law by refusing to accept payment in legal tender:", "Notice to businesses not accepting cash, Legal Tender, in Mississippi.", "I've had several people reach out to me about an issue taking place in our state. Scott, thank you for the email.", "It is my understanding several companies in Mississippi are refusing to take cash as payment.", "Take a look at the photos attached. This is a Federal Reserve Note, a $20 bill. This paper money, this note, is Legal Tender for all debts, public and private.", "Business owners, if you refused to take cash, the debt is paid in full.   If you are a business owner and you refuse to take cash, you are breaking the law.", "Here is an example, if I stop by your store and I purchase $44 worth of fuel, and I try to pay you with a $100 bill and you refuse payment of cash, the debt is paid in full. There is nothing you can do to prosecute me because you have refused payment of Legal Tender, unless the business suspects counterfeit bills.", "I'm asking residents of Mississippi to make me aware of companies who will not receive or take your cash. They will be receiving a call from my office, the Department of Revenue, and the Attorney General's office.", "McMahan was wrong in a legal sense, however: No federal law requires all businesses in the U.S. to accept currency or coins as payment for goods and services.", "The designation of coins and/or currency as \"legal tender\" does not mean that all merchants must accept that form of payment for all transactions.  In short, when a debt has been incurred by one party to another, and the parties have agreed that cash is to be the medium of exchange, then legal tender must be accepted if it is proffered in satisfaction of that debt.  However, otherwise the selling party may set the medium of exchange to be anything they choose: dollars, bananas, precious gems, feathers, whiskey, etc.  They may also choose to accept cash payment only via alternative forms (e.g., credit/debit card, check, money order) rather than currency itself.", "The U.S. Treasury answers this question of legal tender acceptability on their website thusly:", "Q: I thought that United States currency was legal tender for all debts. Some businesses or governmental agencies say that they will only accept checks, money orders or credit cards as payment, and others will only accept currency notes in denominations of $20 or smaller. Isn't this illegal?", "A: The pertinent portion of law that applies to your question is the Coinage Act of 1965, specifically Section 31 U.S.C. 5103, entitled \"Legal tender,\" which states: \"United States coins and currency (including Federal reserve notes and circulating notes of Federal reserve banks and national banks) are legal tender for all debts, public charges, taxes, and dues.\"", "This statute means that all United States money as identified above are a valid and legal offer of payment for debts when tendered to a creditor. There is, however, no Federal statute mandating that a private business, a person or an organization must accept currency or coins as for payment for goods and/or services. Private businesses are free to develop their own policies on whether or not to accept cash unless there is a State law which says otherwise. For example, a bus line may prohibit payment of fares in pennies or dollar bills. In addition, movie theaters, convenience stores and gas stations may refuse to accept large denomination currency (usually notes above $20) as a matter of policy.", "As noted above, however, although no federal regulation requires businesses to accept currency and coins as payment, local regulations may do so. Massachusetts has had such a law in place since 1978, and New Jersey enacted similar legislation in 2019. A few cities (e.g., San Francisco, Philadelphia) have prohibited stores from going cashless as well.", "But Mississippi has no such requirement on its books, something McMahan seemingly acknowledged when he later said that, “To meet the needs and demands of Mississippians -- the average person that’s out here working and going to the grocery store and living their lives -- I would like to see every business in Mississippi have a pathway to take cash legal tender.\"", "Cornell, Kate.   \"Mississippi Senator Wants Cash to Be Accepted Amid Coin Shortage.\"\r\n    WJTV.   16 July 2020.", "Hetrick, Christian.   \"New Jersey Ban Will Force Shops to Accept Cash; Municipal Parking Lots, Car Rentals Exempted.\"\r\n    The Philadelphia Inquirer.   18 March 2019.", "DeCosta-Klipa, Nik.   Maura Healey Reminds Businesses It Remains Illegal to Refuse Cash Over Coronavirus Fears.\"\r\n    Boston.com.   1 April 2020.", "U.S. Department of the Treasury.   \"Legal Tender Status.\"\r\n    Accessed 17 July 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]