["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Fox Business host Lou Dobbs said Obama's policy to defer deportation action on young immigrants \"created\" today's flood of children at the border.", "One of the consistent talking points among conservatives discussing the thousands of kids arriving at the U.S. border is that President Barack Obama’s 2012 immigration policy is responsible.", "The policy allowed certain young people without legal status to apply for a two-year deferral of any removal proceedings. Though it does not apply to people just now crossing the border, conservatives say it gave children and their families the idea that they could try. And so they have.", "We’ve heard that thinking from former Pennsylvania Sen. Rick Santorum, Texas Sen. Ted Cruz, Republican strategist Karl Rove and now, Fox Business News host Lou Dobbs.", "\"This president and his administration knew what was happening with the issuance of the executive order in 2012, which created these children coming across,\" Dobbs said on July 21, 2014.", "There is a problem with the claim, however. The dates don’t line up as neatly as people are letting on.", "The deferred action policy", "In June 2012, about four months before the presidential election, the Obama administration issued a memo saying it would allow certain young people without legal immigration status to apply for a two-year deferral of any removal proceedings. That deferral could be extended and anyone who was accepted would also gain the ability to work in this country. Generally speaking, it targeted people who had come across the border with their parents when they were little and had lived in the United States for many years.", "The move came after Republicans rejected a bill, the DREAM Act, that would have put these immigrants on a path to citizenship.", "To qualify, people had to show that they came to the country before they were 16, had lived here continuously since 2007, had never been convicted of a crime, were age 30 or under, and were either in school or had at least a high school education or had served in the armed forces.", "The government began accepting applications in mid August.", "Tracking the rise of children coming to the border", "The Congressional Research Service is a nonpartisan body that delivers policy research for Congress. In a June 2014 report, analysts included a chart showing how many new children had been handed over to the Office of Refugee Resettlement. Under a 2008 law aimed at protecting young victims of human trafficking, this is the agency responsible for taking care of unaccompanied minors apprehended by U.S. border or immigration agents.", "The chart measured the number of children processed by month, so we can get a better picture of how things played out along the border. The numbers don’t include children stopped at the border and immediately sent back, but they do mirror the overall trends.", "As you can see, monthly referrals largely were steady between October 2008 and January 2012. They then started to rise between January and April 2012, months before Obama announced his executive action.", "After that, they plateaued until January 2013, when they grew exponentially.", "Based on this chart, the rate of arrivals nearly doubled before Obama announced his new policy.", "Overall, there is not a simple cause and effect relationship that Obama issued his policy and arrivals went up. But this isn’t to say that Obama’s policy played no role in the current flood of children arriving at the border.", "The administration tacitly acknowledges some relationship. Department of Homeland Security Secretary Jeh Johnson published an open letter in key Central American countries in which he made the point that the new policy would not apply to children who show up today.", "\"A child must have been in the United States prior to June 15, 2007 – seven years ago,\" Johnson wrote.", "In a report on the causes behind the current crisis, congressional researchers said many factors are driving the flood of children at the border. Those fleeing El Salvador, Guatemala and Honduras account for most of the influx. Those countries suffer from high rates of crime and poor economies. Surveys found that about half of the children had been harmed or threatened by gangs or agents of the state. Children did not tend to come from Central American countries with less crime and better economies.  The same surveys found that many of  the children sought to join family members already living in the United States.", "The 2008 revised trafficking law is another potential factor. It opened a new legal option for unaccompanied children from countries other than Mexico and Canada. They can apply for asylum on the grounds that if they were sent home, they have good reason to fear that they would face persecution. It is unclear if fear of gang-violence meets that condition. Nevertheless, the children are getting a hearing and while they wait for the process to play itself out, they remain in this country.", "Our ruling", "Dobbs said the Obama policy directed at younger immigrants created the the problem at the border. The initial rise in arrivals began before Obama announced the policy and if anything, plateaued or declined a bit immediately afterward. However, the administration went out of its way recently to send the message that the policy did not apply to newcomers, suggesting the policy played some role.", "The influx of children comes mainly from the most troubled nations in Central America. The claim that Obama’s policy created the influx does not match the timeline and ignores other important factors.", "We rate the claim Mostly False.", "Fox News, Lou Dobbs Tonight, July 21, 2014", "U.S. Department of Homeland Security, Deferred action memo, June 15, 2014", "Brookings, DACA Renewals Ramp Up, July 8, 2014", "Shorenstein Center on Media, Politics, and Public Policy, Unaccompanied migrant children in the United States: Research roundup, July 22, 2014", "Congressional Research Service, Unaccompanied Alien Children: Potential  Factors Contributing to Recent Immigration, July 3, 2014", "Congressional Research Service, Unaccompanied Alien Children: An Overview, June 23, 2014", "Fox News, Fox News Sunday, July 13, 2014", "Homeland Security Department, An Open Letter to the Parents of Children Crossing Our Southwest Border, June 23, 2014", "Migration Policy Institute, Dramatic Surge in the Arrival of Unaccompanied Children Has Deep Roots and No Simple Solutions, June 13, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]