["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Voters cast their ballots in Milwaukee amid the coronavirus pandemic on April 7, 2020. (Mike De Sisti/Milwaukee Journal-Sentinel)", "Wisconsin Senate Democrats blamed Sen. Patrick Testin for the state losing $25 million in federal funding for unemployment benefits.", "Like most lawmakers, Testin doesn’t have the power to schedule legislative sessions.", "He could’ve lobbied Senate and Assembly leaders to meet sooner, but he didn’t.", "Wisconsin Democrats hammered Republicans after the state lost out on $25 million in federal coronavirus relief funding for unemployment benefits due to slow action by the GOP-controlled Legislature.", "But instead of targeting Senate Majority Leader Scott Fitzgerald of Juneau or other top-ranking Republicans, Democrats zeroed in on  …", "Patrick Testin?", "In a May 8, 2020 news release headlined \"25 million reasons not to trust Patrick Testin,\" the Democratic committee of the state Senate pointed the finger squarely at the first-term Republican from Stevens Point, with executive director Eric LaGesse declaring:", "\"It is unfathomable that he would refuse to do his job when it means helping Wisconsin workers and families that are being hit the hardest by COVID-19.\"", "Testin is chairman of a key health-related committee and like his colleagues, he can lobby leaders to schedule floor sessions. But the power to determine when the Assembly and Senate meet largely lies in the hands of leadership.", "How does the claim rate?", "A quick refresher on the lost funding: Wisconsin could have received $25 million through the federal CARES Act to help pay for unemployment benefits as long as it did not require residents to wait one week to receive aid.", "But Republican leaders in the Senate and Assembly didn’t schedule floor sessions to take up a package backed by Gov. Tony Evers that, among other things, waived the waiting period, until three weeks after the federal legislation passed.", "Republicans thought Wisconsin could be reimbursed retroactively to early March. They were wrong, so the state has to foot the bill for those benefits.", "Where does Testin fit in?", "When asked for backup for the claim that Testin was to blame for the lost money, LaGesse argued in an email that the senator didn’t push for quicker action on the relief package. As chairman of the Committee on Health and Human Services, he asserted, Testin should be \"the leading voice in his caucus on health issues.\"", "LaGesse criticized Testin in other arenas, including his opposition to extending Gov. Tony Evers’ stay-at-home order to May 26. But the statement from the Democratic committee focused primarily on Testin’s role in the loss of federal funding, so we will, too.", "The Democrats’ statement raises an unusual question: Is it Testin’s \"job\" to ensure the legislature meets?", "Not quite.", "The Senate and Assembly primarily meet during scheduled floor sessions, which wrapped up for 2020 earlier this year. That meant lawmakers needed either a special session or an extraordinary session to take up the relief package. The key difference between the two: who can call them.", "Per the state constitution, only the governor has the authority to call the Legislature into a special session — a move Evers used to no avail to persuade lawmakers to delay the April 7, 2020 spring election. Evers, a Democrat, did not call for one here.", "Instead, the Assembly and Senate convened an extraordinary session on April 14 and 15. Lawmakers can do that either through a joint resolution or petition, or at the direction of each house’s committee on organization.", "Each organizational committee is composed of leaders from each party -- a group that does not include Testin.", "To be clear, a single lawmaker can’t call an extraordinary session.", "Committees are a different story. Chairs like Testin have broad leeway to call meetings throughout the biennial session, which ends on Jan. 4, 2021. The Health and Human Services committee last met on March 17, 2020 and didn’t take up any matters related to COVID-19.", "But even if Testin had called a committee meeting, it couldn’t have taken up the relief package because committees can only vote on legislation that has been referred to them by leaders. And this measure was not before his committee.", "So, Testin could’ve lobbied his colleagues to meet. But that’s about it.", "Running for reelection, for starters.", "Testin is facing a challenge from retired Stevens Point police officer Paul Piotrowski in November 2020 in what Democrats view as one of their best opportunities to flip a Senate seat. That potential vulnerability is likely part of what motivated state Democrats to target Testin.", "In an email to PolitiFact Wisconsin, Testin’s campaign noted the U.S. Department of Labor issued administrative rules for the CARES Act on April 30 -- two weeks after the vote -- that quashed the retroactive provision. The implication: Republicans didn’t know that would happen, so they didn’t feel pressured to rush the relief package.", "The federal agency told the state Department of Workforce Development on April 20 that the state couldn’t be reimbursed for benefits paid before the relief package became law, the Milwaukee Journal Sentinel reported. That, too, came after the Senate and Assembly voted.", "But Democratic members of the state’s congressional delegation did warn GOP leaders of that possibility on April 3, 2020. So the urgency was clear.", "Still, that doesn’t change the fact Testin, who ultimately voted for the plan, had no ability to get it done on his own.", "The Wisconsin State Senate Democratic Committee blamed Testin after Wisconsin lost $25 million in federal funding, saying the senator refused \"to do his job.\"", "The rules for convening legislative sessions mean Testin -- a first-termer who is not part of leadership -- couldn’t do much more than ask leaders to take up the package sooner.", "But that hardly puts the full weight of the lost money on him.", "That leaves us with a claim that contains an element of truth but ignores critical facts that would give a different impression.", "We rate the claim Mostly False.", "Wisconsin State Senate Democratic Committee, 25 million reasons not to trust Patrick Testin, May 8, 2020.", "Email from Eric LaGesse, executive director of the Wisconsin State Senate Democratic Committee, May 12, 2020.", "Milwaukee Journal Sentinel, Wisconsin lost out on $25M in federal funding because GOP lawmakers waited to pass coronavirus relief bill, May 7, 2020.", "Wisconsin Rapids City Times, Be our guest: Testin disagrees with Safer at Home Order extension, April 17, 2020.", "Committee on Health and Human Services, Senate Executive Session, accessed May 18, 2020.", "Milwaukee Journal Sentinel, Wisconsin governor shuts malls, bars and restaurants and limits gatherings to no more than 10, March 17, 2020.", "Email from Testin for Senate 2020, May 13, 2020.", "Stevens Point Journal, Retired Stevens Point cop announces Democratic bid to unseat Republican state Sen. Patrick Testin, Feb. 27, 2020.", "U.S. Department of Labor, Advisory: Unemployment Insurance Program Letter No. 20-20, April 30, 2020.", "2019 Senate Joint Resolution 1, accessed May 18, 2020.", "Wisconsin Legislative Council, Extraordinary sessions of the Legislature, accessed May 18, 2020.", "2019 Senate Committee on Senate Organization, accessed May 18, 2020.", "2019 Assembly Committee on Assembly Organization, accessed May 18, 2020.", "April 2020 extraordinary session, accessed May 18, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]