["By Jessica McDonald", "Posted on October 18, 2019", "A popular Instagram post falsely claims “over 1,100 people died from reactions to the [flu] shot” in 2018, and suggests that the immunization gave some children polio. The flu vaccine cannot give anyone polio and there is no evidence to support the 1,100 figure.", "Just as flu season is kicking into gear in the U.S., an Instagram post is spreading false and misleading information about flu shots.", "Coupled with a photo of someone receiving an injection, the post reads, “As flu season approaches, flu shots are being given at many locations. However, many are wondering if these shots are actually safe. In 2018, over 1,100 people died from reactions to the shot, and some children that received the shot were diagnosed with polio. One questionable ingredient found in the shots is mercury, an element that is highly poisonous if ingested.”", "The post has racked up nearly 11,000 ‘likes’ in four days. But each of its claims is either unsubstantiated, false or misleading. The flu shot is the single best way to protect against seasonal influenza, a viral disease that in some years kills thousands and in other years kills tens of thousands of Americans.", "To start, contrary to the post’s intimations, flu shots have a good safety record. As the Centers for Disease Control and Prevention explains, the most likely side effects are mild, and include soreness or redness at the injection site, headache, fever and nausea.", "A more concerning side effect is a serious allergic reaction, which could lead to anaphylaxis, and ultimately death. But such reactions are rare.", "An analysis of CDC data from 2009 through 2011 identified just 33 instances of vaccine-triggered anaphylaxis after more than 25 million vaccine doses, or around 1.3 cases per million doses. Of these cases, only one person was hospitalized and no one died. When broken down by vaccine type, the anaphylaxis rates were similar for flu shots — around 1-2 cases per million shots.", "Another study evaluated the safety of the nasal spray version of the flu vaccine in children ages 2 to 17 between 2003 and 2013. Over that decade-long stretch, there was just one confirmed case of anaphylaxis within 3 days of the vaccine, and the child recovered.", "Although there is no official data on the number of deaths that might have resulted from the seasonal influenza vaccine in 2018, other lines of evidence underscore how unlikely it is to die from a bad reaction to a flu shot. Consider submissions to the Vaccine Adverse Event Reporting System, or VAERS. In many instances, people wary of vaccines have pointed to VAERS as proof of their danger. But a reported event does not mean a vaccine caused it. Anyone can report to the system through an online form, and there is no vetting of the report. The VAERS website cautions that “for any reported event, no cause-and-effect relationship has been established.”", "Paul Offit, a pediatrician and vaccine expert at Children’s Hospital of Philadelphia, told us VAERS is “a very noisy system that scares people unnecessarily.”", "Still, what is clear is that even in VAERS, there are very few reports of deaths following influenza vaccines. According to the searchable database, only about two dozen deaths were reported following the seasonal flu vaccine in 2018. The database is limited to what is reported, but healthcare providers are required to report many serious events, including any cases of anaphylaxis or resulting death following an immunization.", "A similar story plays out in data from the Department of Health and Human Services through the National Vaccine Injury Compensation Program, or VICP. Between 1988 and 2019, a total of 176 people have alleged a death due to an influenza vaccine. According to data provided to us by the agency, 36 of those filings have been dismissed, 46 are still being adjudicated, and 94 were compensated. That works out to fewer than six filings per year, and about three compensated claims per year.", "As we’ve explained before, receiving compensation for a claim does not mean the vaccine was at fault; it simply means the parties agreed on a negotiated settlement. As the VICP website explains, about 70% of paid claims are settled, and “HHS has not concluded, based upon review of the evidence, that the alleged vaccine(s) caused the alleged injury.”", "The post’s claim that 1,100 died from the flu vaccine in a single year has no basis. Not only do published studies rarely if ever observe deaths plausibly tied to the flu vaccine, but no one is even claiming that many deaths through the monitoring and compensation systems.", "The post’s second claim — that the flu shot may have given children polio — is false. Polio, or poliomyelitis, is a potentially deadly and highly infectious disease caused by the poliovirus. As the CDC explains, when the virus infects the brain and spinal cord, it can cause paralysis. Outbreaks of polio in the late 1940s and early 1950s once caused more than 35,000 cases of paralysis each year in the U.S. But with the advent of the polio vaccine, transmission of the virus ceased.", "The flu vaccine has nothing to do with polio and does not contain any poliovirus. As a result, it’s impossible for the shot to give kids polio. The disease is currently present in a relatively small number of countries in Africa and Asia, and last year wild poliovirus caused only 33 cases worldwide. Since 1979, no cases of polio have originated in the U.S., and the last imported case was in 1993.", "Besides for the baseless death statistic and false polio claim, the Instagram post also misleads about the safety of mercury in flu shots. A small amount of mercury is in some versions of the flu vaccine because of the mercury-based preservative thimerosal, which is added to prevent contamination of multi-dose vaccine vials. But as we’ve written, there is no evidence that the amount in vaccines is dangerous.", "According to the CDC, thimerosal has been used safely since the 1930s and numerous studies confirm that it does not pose a risk unless someone is allergic. The quantity of mercury in a flu shot is very small. As the Children’s Hospital of Philadelphia notes, an infant who feeds only on breastmilk will consume around 15 times as much mercury than the amount in a flu vaccine.", "The type of mercury in a flu shot is also different from the methylmercury that makes its way up the food chain and accumulates in the environment. Vaccines contain ethylmercury, a less hazardous form of mercury that doesn’t stay in the body very long.", "Even if this evidence is not convincing, concerns over mercury aren’t a good reason to skip the flu shot because there are mercury-free options available. Thimerosal is not present in any of the single-dose syringes or the nasal spray version of the flu vaccine for the 2019-2020 season.", "Indeed, what the Instagram post does not mention are the very real dangers of seasonal influenza — and the very clear benefits of vaccination. Per the World Health Organization, flu severely sickens about 3 million to 5 million people each year worldwide, and kills 290,000 to 650,000 people. In the U.S., around 8% of the population falls sick every year, and thousands die.", "Last flu season, 138 children died from suspected cases of influenza, and the year before 186 children died, around 80% of whom were not vaccinated. For that 2017-2018 season, the CDC estimates there were 49 million flu illnesses, nearly 1 million hospitalizations and 79,000 deaths in the U.S. Only around 40% of the population was vaccinated, but the CDC estimates this prevented around 7 million flu cases, more than 100,000 hospitalizations and 8,000 deaths. The CDC recommends flu vaccination for everyone above six months of age who does not have a contraindication.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Conspiracy Theories (@cotheories). “Are you getting a flu shot this year?” 13 Oct 2019.", "Centers for Disease Control and Prevention. “Flu Vaccine Safety Information.” 17 Sep 2019.", "National Center for Biotechnology Information. “Risk of Anaphylaxis After Vaccination in Children and Adults.” 6 Oct 2015.", "National Center for Biotechnology Information. “The Safety of Live attenuated Influenza Vaccine in Children and Adolescents 2 through 17 Years of Age.” 6 Oct 2015.", "Vaccine Adverse Event Reporting System. “Guide to Interpreting VAERS Data.” Accessed 18 Oct 2019.", "Vaccine Adverse Event Reporting System. “VAERS Homepage.” Accessed 18 Oct 2019.", "Children’s Hospital of Philadelphia. “Paul A. Offit, MD.” Accessed 18 Oct 2019.", "Offit, Paul. Professor of Pediatrics and Director of the Vaccine Education Center, Children’s Hospital of Philadelphia. Interview with FactCheck.org. 16 Oct 2019.", "Kramer, Martin. Director of Communications, Health Resources & Services Administration. Email sent to FactCheck.org. 17 Oct 2019.", "Center for Disease Control and Prevention. “About the Vaccine Adverse Event Reporting System (VAERS).” Accessed 18 Oct 2019.", "Center for Disease Control and Prevention. “Vaccine Adverse Event Reporting System (VAERS).” 28 Aug 2015.", "Health Resources and Services Administration. “National Vaccine Injury Compensation Program.” Accessed 18 Oct 2019.", "Health Resources and Services Administration. “Data and Statistics.” Data accessed 1 Oct 2019.", "McDonald, Jessica. “Williamson Misleads on Children’s Health, Vaccines.” Factcheck.org. 20 Aug 2019.", "Health Resources and Services Administration. “Vaccine Injury Compensation Data.” Data accessed 18 Oct 2019.", "Centers for Disease Control and Prevention. “What is Polio?” 25 Jul 2017.", "Centers for Disease Control and Prevention. “A Polio-Free U.S. Thanks to Vaccine Efforts.” 16 Jul 2018.", "Polio Global Eradication Initiative. “This Week.” 16 Oct 2019.", "World Health Organization. “Poliomyelitis.” 22 Jul 2019.", "Centers for Disease Control and Prevention. “Polio Elimination in the United States.” 28 Nov 2017.", "Centers for Disease Control and Prevention. “Thimerosal in Flu Vaccine.” 16 Oct 2015.", "McDonald, Jessica. “Rep.-elect Green Wrong About Vaccines, CDC Fraud.” 21 Dec 2018.", "Centers for Disease Control and Prevention. “Frequently Asked Questions about Thimerosal.” 28 Aug 2015.", "Centers for Disease Control and Prevention. “Thimerosal in Vaccines.” 27 Oct 2015.", "Children’s Hospital of Philadelphia. “Vaccine Ingredients­ ­– Thimerosal.” 24 Apr 2018.  ingredients", "Centers for Disease Control and Prevention. “Prevention and Control of Seasonal Influenza with Vaccines: Recommendations of the Advisory Committee on Immunization Practices — United States, 2019–20 Influenza Season.” 23 Aug 2019.", "Centers for Disease Control and Prevention. “What are the Benefits of Flu Vaccination?” 24 Jan 2019.", "World Health Organization. “Influenza (Seasonal).” 6 Nov 2018.", "Centers for Disease Control and Prevention. “Key Facts About Influenza (Flu).” 13 Sep 2019.", "Centers for Disease Control and Prevention. “Summary of the 2017-2018 Influenza Season.” 5 Sep 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]