["“Our Brother Hank Aaron - RIP - wanted to be an example and an inspiration to Black People by taking the COVID-19 vaccine. Unfortunately, he may have become a clear example to Black People of why this vaccine CANNOT be trusted…Two weeks after receiving his first Moderna shot, Hank Aaron died in his sleep. No cause of death is given, but you do the math,” a January 22, 2021 Facebook post reads.", "The profile picture of the poster, Wesley Muhammad, appears to feature Nation of Islam leader Louis Farrakhan, who has warned “the Black community against taking the Covid-19 Vaccine with the US Government’s treacherous history of experimentation, medications and vaccines.”", "Muhammad’s post contains the hashtag “#FarrakhanWarnedUs.”", "Robert F. Kennedy Jr, son of slain senator Bobby Kennedy and the nephew of former US president John F. Kennedy, also posted an article on Facebook linking Aaron’s death to the vaccine.", "“Hank Aaron’s tragic death is part of a wave of suspicious deaths among elderly closely following administration of COVID vaccines,” Kennedy said in the post to his roughly 300,000 page followers.", "The article linked to in Kennedy’s post, headlined: “Home Run King Hank Aaron Dies of ‘Undisclosed Cause’ 18 Days After Receiving Moderna Vaccine,” was published on the day of Aaron’s death by Kennedy’s non-profit anti-vaccine advocacy organization Children’s Health Defense.", "Kennedy regularly uses his social media accounts to advocate against vaccines, including this false claim that the flu shot is more than twice as deadly as Covid-19.", "Baseball star Aaron died on January 22 at age 86.", "A Black man who defied racist hatred to break Babe Ruth’s Major League home run record, Aaron later became a pioneer in front-office opportunities for Black players after their careers.", "The Hall of Famer received the Moderna Covid-19 vaccine on January 5 at Morehouse School of Medicine in Atlanta, Georgia, in part to signal to Black Americans that the shots are safe.", "Concerning Aaron’s cause of death, Fulton County medical examiner Karen Sullivan told AFP in an email: “There was no information suggestive of an allergic or anaphylactic reaction to any substance which might be attributable to recent vaccine distribution.”", "“In addition, examination of Mr Aaron’s body did not suggest his death was due to any event other than that associated with his medical history,” Sullivan said.", "“Based on the information provided by Mr Aaron’s family and physical examination of his body, it is my medical opinion that Mr Aaron’s death was not related to his recent vaccination for Covid-19.”", "Goldie Taylor, head of marketing and communications and Morehouse School of Medicine, also said by phone that Aaron’s death “was not related to the vaccine.”", "She emailed the school’s official statement, which reads in part: “Mr Aaron was a public health advocate and worked with us to help bridge the health equity gap in Atlanta and around the world. His passing was not related to the vaccine, nor did he experience any side effects from the immunization.”", "The Atlanta Braves baseball team released a statement announcing that Aaron “passed away peacefully in his sleep.”", "In the United States, Black and Hispanic people are far more likely to die from Covid-19 than whites, according to the US Centers for Disease Control and Prevention (CDC), due to economic disparities.", "But surveys show African Americans are also among those most reluctant to get vaccinated, which experts say is understandable given America’s history of conducting medical experiments on Black people.", "Among the most notorious examples was in Tuskegee, Alabama between 1932 and 1972, when Black men were unwittingly denied treatment and used to study the effects of syphilis.", "The CDC website says that clinical trials showed that the Moderna vaccine “appeared to have high effectiveness in clinical trials (efficacy) among people of diverse age, sex, race, and ethnicity categories and among persons with underlying medical conditions.”", "In an email, Martha Sharan of the CDC added: “Covid-19 vaccines are safe and effective...While CDC is aware of reports of deaths occurring after administration of Covid-19 vaccines this is rare.”", "Sharan, of the Division of Healthcare Quality Promotion, said: “It’s important to remember that many adverse events, including death, following immunization are often coincidental -- meaning that while an adverse event may happen after getting vaccinated, the vaccine is not always the cause of it.”", "The CDC uses the new V-safe app to let users to quickly report any side effects they experience from the Covid-19 vaccine and receive reminders for their second dose. The app is available here.", "More than 425,000 Americans have died from Covid-19 at the time of this article’s publication.", "This claim follows a pattern of misleading claims about deaths of vaccine recipients, debunked by AFP Fact Check here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]