["Multiple internet bloggers are falsely accusing David Hogg, a student survivor of the deadly shooting at Marjory Stoneman Douglas High School in Parkland, Fla., of being a paid actor with a past of pushing for additional restrictions on guns.", "The conspiracy theories spread to the mainstream when Benjamin Kelly, an aide for Florida state Rep. Shawn Harrison, R-Tampa, told a reporter that Hogg and another student were \"actors\" who \"travel to various crisis (sic) when they happen.\"", "Here's the email. I asked for more information to back up the claim and was sent another email that linked to a YouTube conspiracy video. pic.twitter.com/VRSVOcjj3E", "The aide was fired, and the Broward County School District said Hogg and his classmate are \"absolutely students at Stoneman Douglas.\"", "Here are the facts.", "Conspiracy theorists have latched on to a CBS news video of Hogg in Los Angeles from 2017 as evidence that the teen might be a plant.", "Hogg posted a video that showed an argument between his friend and a lifeguard on Redondo Beach. The argument was unrelated to guns.", "After Hogg’s friend put a boogie board on a trash can on the beach, a lifeguard asked him to remove it. The friend complied with the lifeguard's request, but the interaction turned sour after the friend made a snide remark.", "Hogg’s video of the dispute went viral. CBS later interviewed Hogg about the dispute and the video.", "From there, websites like the conspiracy-minded Infowars reached for straws, including Hogg’s appearance after the shooting on CBS This Morning.", "\"Interestingly, Hogg has reconnected with CBS for an appearance on CBS This Morning as the mainstream media unabashedly features high school students as figureheads for a new anti-gun push,\" InfoWars wrote in a blog.", "Folks on the internet took the claim one step further and claimed that the video was proof that Hogg was just pretending to be a high school student in a different state. At one point, the No. 1 trending video on YouTube was a video suggesting that Hogg was an actor, but the video has since been removed.", "Hogg says he was visiting California, which is corroborated by his personal Twitter account.", "\"I love going to LA for the summer,\" he tweeted August 5, 2017.", "I love going to LA for the summer pic.twitter.com/C2x5L3jbBB", "Shortly after, on Aug. 10, 2017, Hogg posted a short vlog (video blog) on YouTube about his experience in California. And finally, The Eagle Eye, Marjory Stoneman Douglas' newsmagazine, published a story about his vacation and viral video.", "Some social media users took the claim further and said that Hogg actually graduated from Redondo Shores High School in California.", "But evidence that supported those theories — like a supposed yearbook photo of Hogg in California — was debunked by fellow Stoneman Douglas High students on Twitter.", "One student, Sarah Chadwick, said that the images of Hogg allegedly pictured in a California yearbook were really from Stoneman High.", "\"She claims it’s not a Douglas yearbook (which I promise it is, I know multiple people in that picture) yet there’s someone in the pic wearing a douglas t-shirt????\" Chadwick tweeted.", "She claims it’s not a Douglas yearbook (which I promise it is, I know multiple people in that picture) yet there’s someone in the pic wearing a douglas t-shirt???? pic.twitter.com/BwPDyGztgK", "Another Stoneman Douglas High alumnus tweeted a video, which showed him flipping to Hogg’s photo in a Douglas yearbook.", "\"There’s a photo going around claiming David Hogg did not attend Douglas, but a school in California. Here’s a video to debunk that:\" tweeted Joey Wong.", "There’s a photo going around claiming David Hogg did not attend Douglas, but a school in California. Here’s a video to debunk that: pic.twitter.com/hJsMNSdAsF", "Some, meanwhile, have used Hogg’s criticism about the FBI, combined with the fact that his father is a former FBI agent, to suggest some conspiracy aimed at hurting President Donald Trump.", "Those theories are unfounded.", "Conspiracy-minded websites are claiming Stoneman Douglas High students are crisis actors hired to stir up controversy.", "Not only is there no credible evidence to support this claim, plenty of evidence contradicts it entirely. The school district has confirmed that the targeted students are, in fact, students. Broward County Schools Superintendent Robert Runcie and Stoneman High students on Twitter have confirmed that Hogg is a senior at Stoneman Douglas, not a crisis actor.", "We rate this claim Pants on Fire!", "Tampa Bay Times, Florida lawmaker’s aide fired after saying outspoken Parkland students are actors, Feb. 20, 2018", "Gateway Pundit, \"EXPOSED: School Shooting Survivor Turned Activist David Hogg’s Father in FBI, Appears To Have Been Coached On Anti-Trump Lines [VIDEO]\" Feb. 19, 2018", "Washington Post, ‘I am not a crisis actor’: Florida teens fire back at right-wing conspiracy theorists, Feb. 21", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]