["About this rating", "On Friday Feb. 5, President Biden took his first flight as U.S. President: a 25-minute trip from D.C. to his home state of Delaware. Images of Biden at Wilmington Airport disembarking from an Air Force C-32 plane (similar to a Boeing 757), as opposed to the larger VC-25A counterpart (a military version of the Boeing 747) commonly associated with Air Force One, created an outlandish talking point in QAnon world: That Biden was flying on a \"Fake Air Force One,\" making the flight proof that former President Donald Trump was still the President of the United States:", "This absurd conclusion betrayed an ignorance about how presidents travel by air. While two large, technologically impressive 747-style Air Force planes (VC-25As) are typically used for Presidential transport, any Air Force plane (regardless of what kind of craft it is) is designated with the call sign \"Air Force One\" when it carries the President of the United States.", "The plane used for Biden's short hop to Delaware was not a VC-25A, but rather a C-32. C-32's are used by the Air Force to transport U.S. political leaders, and that type of plane is the typical go-to for Vice Presidential travel. However, it is not uncommon for this model plane to be used as Air Force One for short domestic trips or for flights to smaller airports such as the one in Wilmington. Presidents Obama and Trump have both used C-32s for presidential trips. Here is Trump exiting a C-32 for a Presidential Visit to Fort Drum, New York, Aug. 13, 2018:", "https://streamable.com/2qgdvb\n\nBecause any plane Biden traveled on would be given the call sign \"Air Force One,\" and because the plane Biden used is commonly employed by presidents for shorter trips, claims of a \"fake Air Force One\" are themselves \"False.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]