["About this rating", "Even those who don't particularly follow the animal rights movement are generally aware of some of the publicity stunts that organizations such as People for the Ethical Treatment of Animals (PETA) have engaged in to call attention to their cause, such as attempting to elicit sympathy for fish by rebranding them as \"sea kittens,\" protesting a dog show while dressed in Ku Klux Klan outfits, producing a racy \"Vegetarians Have Better Sex\" commercial for the 2009 Super Bowl, and engaging in street tableaux garbed in bloody furs.", "Against this background, it's probably not surprising that some readers would take at face value an article describing a group of animal rights activists who decided to stage a protest against the use of leather at a motorcycle gang rally, and for their efforts ended up being duct-taped inside restaurant Dumpsters or force-fed hamburgers by annoyed bikers:", "The organizer said a group of concerned animal rights activist groups, \"growing tired of throwing fake blood and shouting profanities at older women wearing leather or fur coats,\" decided to protest the annual motorcycle club event \"in a hope to show them our outrage at their wanton use of leather in their clothing and motor bike seats.\" \"In fact,\" said the organizer, \"motorcycle gangs are one of the biggest abusers of wearing leather, and we decided it was high time that we let them know that we disagree with them using it ... ergo, they should stop.\"", "According to witnesses, protesters arrived at the event in a vintage 1960's era Volkswagen van and began to pelt the gang members with balloons filled with red colored water, simulating blood, and shouting \"you're murderers\" to passers by.", "Many readers who encountered this tale out of its original context via e-mail forwards and web site repostings did take it at face value, but it was nothing more than a bit of satire published on The Spoof! website on 3 January 2010 and (in slightly different form) on the Glossy News web site four days later.  (The former site included a disclaimer noting that \"The story above is a satire or parody. It is entirely fictitious,\" while the latter site describes itself as \"an accredited online satirical publication.\")", "The spoof spread so widely that the local newspaper in the town where the fictitious story was set, the Johnstown [Pennsylvania] Tribune-Democrat, received numerous inquiries asking why they hadn't covered the incident:", "Our newsroom has received dozens of inquiries about the story.", "\"Aren't you going to look into this?\" one caller asked.", "Another accused us of hiding the truth to protect the rally.", "Lisa Rager, executive director of the Greater Johnstown/Cambria County Convention and Visitors Bureau, which plans and organizes the [annual \"Thunder in the Valley\" motorcycle] rally, said this was not the first tall Thunder tale she'd heard.", "\"Believe me, we've heard many different rumors,\" she said. \"But I have to say, this is probably the most interesting one.\"", "Rager hopes not many people took the story seriously.", "Johns, Arlene.   \"This Hog Tale Had No Substance.\"\r\n    The [Johnstown] Tribune-Democrat.   24 January 2010.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]