["U.S. Sen. John Cornyn speaks at the University of Texas at Austin in June. [CARLOS GARCIA/ AUSTIN AMERICAN STATESMAN]", "U.S. Sen. John Cornyn said the federal government has not convened a commission to review the country’s criminal justice system and recommend large-scale improvements in decades.", "During a call with Texas reporters on June 11, Cornyn touted a part of Senate Republicans’ police reform bill that would set guidelines for such a commission.", "\"We haven’t done this top-to-bottom review of our criminal justice system at the national level since 1965,\" he told reporters.", "Democrats later blocked the JUSTICE Act bill, saying it didn’t go far enough.", "We wanted to know: Has it truly been more than half a century since the American criminal justice system has undergone a federal review?", "Trump’s commission", "Cornyn and other Republican lawmakers have pushed to create a commission to study ways to reduce crime and improve policing across the country, filing unsuccessful legislation to establish such a commission since at least 2010.", "But last year, President Donald Trump directed the formation of a commission through an executive order, sidestepping the need for legislative action. In January, U.S. Attorney General William Barr announced the creation of the Presidential Commission on Law Enforcement and the Administration of Justice.", "The part of the wide-ranging bill Cornyn highlighted during his conversation with reporters had been lifted from a standalone bill that covered just the creation of the commission.", "That bill was introduced before Trump created the commission, but a spokesman for Cornyn said the senator would still like to see it advance because he believes his version is more holistic.", "While the President’s Commission is made up of law enforcement officials only, Cornyn’s would include community leaders, civil rights advocates, crime victims, social services providers and public health officials.", "Cornyn’s bill would also task the commission with a broader area for review, covering the criminal justice system as a whole and its effect on various areas of government from health care to education. The current commission is limited to law enforcement and crime control issues within the Department of Justice’s jurisdiction because of the way it is set up.", "Additionally, similar to the 9/11 Commission, the bill calls for a group that would be making recommendations directly to Congress. The current commission, in 18 months, will report its findings to the Attorney General, who will submit a final report to the President.", "Deputy Attorney General Jeffrey A. Rosen, during his introductory remarks at the opening ceremony for the commission in January, echoed Cornyn’s statement and said \"it has been over 50 years since we have systematically studied ways\" to improve upon the criminal justice system.", "Earlier commissions", "Drew Brandewie, a spokesman for Cornyn, said Cornyn was referring to the Commission on Law Enforcement and Administration of Justice that President Lyndon B. Johnson created in 1965.", "The commission ended up coming up with more than 200 recommendations -- many of them now very well-known mainstays, such as the 911 emergency call system and research organizations like the Bureau of Justice Statistics.", "It, too, was established by way of executive order. Johnson signed the order July 23, 1965, according to The American Presidency Project at the University of California Santa Barbara.", "In the 1965 commission’s final report, members wrote that Johnson had created the group \"recognizing the urgency of the Nation's crime problem and the depth of ignorance about it.\"", "The report stated that Johnson wanted to address a key issue with the criminal justice system: a lack of data on police, courts and other justice agencies, which made it difficult to make basic assessments of crime on a national level.", "Prior to Johnson’s commission, the last effort that was similar in scope was established under President Herbert Hoover to examine the enforcement of alcohol prohibition and its impact on other criminal elements, according to a 1931 report produced by Hoover’s commission.", "Johnson’s commission came as race riots were breaking out in major U.S. cities over police brutality and other frustrations, including the well-known Los Angeles Watts Riots.", "\"The commission in 1965 really stemmed from the upheaval in the country at the time, and from everything I’ve read, Barry Goldwater, he made ‘law and order’ a big issue during the campaign,\" said Marc Levin, founder and chief of policy and innovation at the conservative criminal justice initiative Right on Crime. \"And when LBJ came in, he really felt that we needed to take a look at this.\"", "Levin agreed that no such commission has been formed since Johnson’s. He said other groups have met and provided recommendations in the years since, but none were as robust as that of a national commission.", "In 2014, for example, Congress created the Charles Colson Task Force on Federal Corrections, which made recommendations on how to make the prison system more just and efficient. But that only looked at the Bureau of Prisons and not the entire criminal justice system from police to courts.", "\"I think (Cornyn’s) statement is very accurate,\" he said.", "Our ruling", "Cornyn said it had been 65 years since a national commission studied the American criminal justice system and produced recommendations.", "Experts and academic research show that a commission of that scale, with that broad an area of review, has not been convened since Johnson’s 1965 group.", "We rate this claim True.", "Washington Post, Attorney general launches presidential commission on law enforcement, June 5, 2020", "Email interview, Drew Brandewie, a spokesman for U.S. Sen. John Cornyn, June 17, 2020", "Press release, Cornyn Statement on Establishment of Presidential Criminal Justice Commission, June 17, 2020", "Email interview, Kristina Mastropasqua, Office of Public Affairs, Department of Justice, June 25, 2020", "Phone interview, Marc Levin, founder and chief of policy and innovation at Right on Crime, June 26, 2020", "Congress.gov, H.R. 1607, accessed June 26, 2020", "Congress.gov, S. 573 , accessed June 26, 2020", "Congress.gov, S.2434, accessed June 26, 2020", "U.S. Department of Justice, Statement from Attorney General Barr on the establishment of the presidential commission, accessed June 17, 2020", "U.S. Department of Justice, Deputy Attorney General Jeffrey A. Rosen Provides Introductory Remarks at the Presidential Commission on Law Enforcement and the Administration of Justice Opening Ceremony, accessed June 17, 2020", "The American Presidency Project, Executive Order 11236—Establishing the President's Commission on Law Enforcement and Administration of Justice, accessed June 30, 2020", "Justice Professional, Stimuli of Police Education: Wickersham and LBJ's (Lyndon B. Johnson) Commission, accessed July 1, 2020", "National Institute of Justice Journal, The 40th Anniversary of the Crime Report, accessed July 1, 2020", "National Commission on Law Observance and Enforcement, Report on the Enforcement of the Prohibition Laws of the United States, Jan. 7, 1931", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]