["About this rating", "On the morning of Oct. 20, 2020, Peninsula Humane Society and Society for the Prevention of Cruelty to Animals (PHS/SPCA) in Redwood City, California responded to a phone call from a man who had been using the ATM machine outside of a Chase Bank after business hours.", "\"The man who called us was using the cash machine at the bank and saw through the windows what he thought was a stuffed animal on a desk. Then he saw it move and realized it was a live raccoon inside the bank,\" PHS/SPCA’s Communications Manager Buffy Martin Tarbox told Snopes in an email.", "Photographs taken at the scene show the bushy-tailed invaders unstealthily marauding through the halls of the bank and sitting behind a desk. (Of course, those photos since became a viral sensation on social media.) The young raccoons knocked over a computer and several garbage cans in their raid.", "PHS/SPCA", "But how they accessed the building came as an even bigger surprise. A trail of muddy pawprints led responders to the conclusion that the raccoons climbed an outside tree to the roof of the bank and managed to crawl through the air ducts before falling through the ceiling tiles.", "“There were several broken ceiling tiles, and the masked bandits knocked papers around and even a computer over. Thankfully the raccoons were not injured during their morning escapade, and to our knowledge, they didn’t abscond with any money,” said Tarbox.", "However, the raccoons had eaten a tin of almond cookies from the employee break room.", "PHS/SPCA", "\"Raccoons are incredibly intelligent and skilled at getting into places,\" said Tarbox, adding that the San Mateo County Animal Rescue and Control Department, which serves Redwood City, frequently responds to calls about raccoons trapped in all kinds of precarious positions. In early 2020, the organization rescued a raccoon that was found hanging from an underpass. And it's not just California raccoons that are known for getting themselves into compromising situations. In 2018, one such nocturnal daredevil went viral after scaling a Minnesota skyscraper and ultimately reaching a height of several hundred feet.", "Tarbox said that neither raccoon in the 2020 incident was injured — despite having crashed through the ceiling — and both were in good health.", "“It’s not every day an animal organization gets called to deal with a bank break-in, but since the bank robbers were masked bandits of the wildlife kind, we were indeed the appropriate responders,” said in a news release. “The bank managers let our rescue staff into the bank, and after about ten minutes of chasing the raccoons around the bank, we were finally able to safely shoo them outside. They apparently didn’t want to leave the bank.”", "Weber, Brendan.   \"'Masked Bandits': 2 Raccoons Break Into Peninsula Bank.\"\r\n    NBC Bay Area.   20 Oct 2020.", "\"Raccoon Bandits Break Into California Bank, Don’t Make Off With Any Cash.\"\r\n    ABC7.   21 Oct 2020.", "Hang, Matthew and Christina Caron.   \"Daredevil Raccoon Climbs Minnesota Skyscraper and Becomes a Sensation.\"\r\n    The New York Times.   13 June 2018.", "\"Raccoons Cause a Stir By Breaking Into a Redwood City Bank.\"\r\n    Peninsula Humane Society & SPCA.   20 Oct 2020.", "Larthridge, Resell.   \"How a Pair of Raccoons (Probably) Broke Into a Bank.\"\r\n    CNN.   25 Oct 2020.", "Rosemurgey, Emma.   \"Raccoons Use Air Ducts to Break into Bank.\"\r\n    Unilad.   22 Oct 2020.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]