["About this rating", "On 19 January 2019, while stumping with reporters outside the White House to promote the efficacy of his proposed wall along the U.S.-Mexico border, President Trump cited the city of San Antonio, Texas, as an example of a city made much safer by the construction of a wall:", "Trump cites San Antonio as an example of a city where a border wall has worked. It’s located 150 miles north of Mexico and there is no wall. pic.twitter.com/CyiOiGuCy3", "— Adam Best (@adamcbest) January 19, 2019", "“Everybody knows that walls work,\" Trump maintained. \"You look at different places, they put up a wall, no problem. You look at San Antonio, you look at so many different places, they go from one of the most unsafe cities in the country to one of the safest cities, immediately, immediately.”", "President Trump's words left many viewers puzzled, as the city of San Antonio not only has no wall, but it isn't situated anywhere near a national border.  It's about 150 miles north of Mexico, and it has been far removed from the Mexican border since Texas achieved independence in 1836 and was subsequently annexed into the United States in 1845.", "Most likely President Trump confused San Antonio with the western Texas city of El Paso (just across the Mexico–U.S. border from Ciudad Juárez), which he had described in similar terms a week earlier:", "\"El Paso, Texas, went from one of the most unsafe parts or cities in the United States to one of the safest cities in the United States as soon as they put up the wall,\" Trump said. \"They built a wall and fencing apparatus that blocked people. So they went from one of the most dangerous cities to one of the safest cities, all within a very short period of time.\"", "Some news accounts have disputed Trump's claims about the construction of a wall's supposedly having made El Paso immediately and significantly safer, averring that reports show a decline in violent crime rates antedated El Paso's border wall construction, and a slight rise occurred afterwards:", "According to the FBI's Uniform Crime Report, in 2017 there were 21 murders in El Paso County, putting its homicide rate at 2.5 per 100,000 inhabitants. The rate of violent crime was 356.3 per 100,000 people -- lower than the national rate of 382.9. El Paso's population was 847,071 in 2017.", "Violent crimes, as reported by El Paso's Police Department to the FBI for the Uniform Crime Report, began falling in 1997, with their steeper decline settling in around 2002. The crime decline predates El Paso's border wall construction, which began in 2006 and ended in 2008.", "During that period, crime went up. In 2007 there were 2,574 violent crimes reported to the city's police and in 2008 there were 2,825. Violent crime has mostly stayed at under 3,000 incidents for the past 11 years.", "Timmons, Patrick.   \"Low Crime in El Paso Predates 'Wall'; Smugglers Are U.S. Citizens.\r\n    UPI.   17 January 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]