["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A fake news story said that San Juan, Puerto Rico's city council voted to impeach Mayor Carmen Yulin Cruz. (Getty Images photo)", "A fake news story that said the mayor of Puerto Rico’s capital of San Juan was being impeached originated on a website that is part of a network of trolls looking to fool readers.", "\"San Juan city council votes unanimously to impeach Trump-hating mayor,\" read the headline on an Oct. 15, 2017, post on anews-24.com, as well as some other websites. Facebook users reported the story as being potentially fabricated, as part of the social network’s efforts to curb fake news.", "The post accused San Juan Mayor Carmen Yulin Cruz of deliberately withholding relief supplies from residents following Hurricane Maria, citing a Sept. 28 New York Post article about logistical problems in Puerto Rico. San Juan’s city council decided in an emergency meeting that they would begin impeachment proceedings, the anews-24.com post said.", "Cruz made headlines for blasting President Donald Trump’s response to Hurricane Maria, with Trump responding in kind on Twitter.", "But she isn’t being impeached by anyone, because the article, which is fake, came from a site that parodies real news. It first appeared on the website AsAmericanAsApplePie.org on Oct. 12.", "AsAmericanAsApplePie.org has all the hallmarks of a series of fake websites associated with Christopher Blair, a self-described liberal troll who creates fictional stories to try to fool conservative readers.", "We’ve fact-checked plenty of stories that originated from websites run by or affiliated with Blair, including TheLastLineOfDefense.org, FreedomCrossroad.us, OurLandOfTheFree.com and FreedomJunkshun.com.", "AsAmericanAsApplePie.org uses the same website architecture as these other sites, and carries a disclaimer that reads, \"As American as Apple Pie is here to be your beacon of something you can kinda rely on sometimes but not really.\"", "The impeachment proceedings against Cruz are made up. We rate this claim Pants On Fire!", "Anews-24.com, \"San Juan City Council Votes Unanimously To Impeach Trump-Hating Mayor,\" Oct. 15, 2017", "AsAmericanAsApplePie.org, \"San Juan City Council Votes Unanimously To Impeach Trump-Hating Mayor,\" Oct. 12, 2017", "PunditFact, \"If you're fooled by fake news, this man probably wrote it,\" May 31, 2017", "USA Today, \"San Juan Mayor Carmen Yulin Cruz on Trump exchange: 'I don't give a (expletive)',\" Oct. 11, 2017", "CNN, \"Source: Trump's Puerto Rico tweets were response to San Juan mayor,\" Oct. 13, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]