["About this rating", "An image supposedly showing a newspaper clipping from 1953 containing an oddly prescient prediction about future cellphones was circulated on social media in November 2019:", "There'll Be No Escape in Future From Telephones", "Pasadena - AP - The telephone of the future?", "Mark R. Sullivan, San Francisco, president and director of the Pacific Telephone & Telegraph Co., said in an address Thusday night:", "\"Just what form the future telephone will take is, of course, pure speculation. Here is my prophecy:", "\"In its final development, the telephone will be carried about by the individual, perhaps as we carry a watch today. It probably will require no dial or equivalent, and I think the users will be able to see each other, if they want, as they talk.", "'Who knows but what it may actually translate from one language to another?\"", "This is a genuine newspaper clipping.", "The above-displayed report was written by the Associated Press and was published in a variety of papers in 1953. While we have not been able to locate this exact clipping in the Tacoma News Tribune, we have found this story published in news outlets such as The Spokane Chronicle, The (Wilmington, Delaware) News Journal, The Akron Beacon Journal, and the Boston Globe:", "Fri, Apr 10, 1953 – 32 · The Boston Globe (Boston, Massachusetts) · Newspapers.com", "This 1953 prediction has proved to be largely accurate. Modern phones are certainly \"carried about by the individual.\" Phones can also be integrated with smartwatches, perform video calls, and provide near-instantaneous translations.", "While this is a genuine newspaper clipping from 1953 containing a largely accurate prediction about modern phones, we'd like to provide a little additional context to this rumor. For starters, the person making these claims was the president of a phone company and was likely privy to latest developments in the field. For instance, while it wouldn't be until the 1960s for the first cordless phone to be invented, and the 1980s for true mobile phones to hit the market, the foundations for these products were being laid prior to 1953.", "In 1946, AT&T offered the first commercial mobile telephone service to subscribers in St. Louis. Users had to have about 80 pounds of equipment installed in their cars, and the service could only handle a handful of calls at a time, but it did mark the beginning of the mobile-phone era. Video calls, too, can be traced back to at least the 1930s. While it would take decades for this technology to be refined into a commercial product, the concept of video calling wasn't entirely far-fetched in 1953. Lastly, it should be noted that Sullivan wasn't the first to envision a smartwatch. While this product wasn't in development in the 1950s (as far as we can tell), smartwatches had popped up a few times in fictional content. Detective Dick Tracy's two-way watch radio made its debut in 1946:", "Hanson, Matt.   \"Google Just Turned Your Phone Into a Real-Time Translator.\"     TechRadar.   14 January 2015.", "Today's Engineer.   \"The Foundations of Mobile and Cellular Telephony.\"     August 2012.", "McCracken, Harry.   \"Dick Tracy's Watch: The Most Indestructible Meme in Tech Journalism.\"     Time.   11 February 2013.", "NY Times.   \"AT&T's History of Invention and Breakups.\"     13 February 2016.", "BBC.   \"A History of the Telephone.\"     Retrieved 6 November 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]