["About this rating", "In early January 2018, clothing company H&M came under fire for an advertisement showing a black child in a sweatshirt that read: \"Coolest Monkey in the Jungle.\" Shortly after the company issued an apology and discontinued the shirts, the entertainment web site Huzlers published a piece claiming that the company was attempting to make amends with an \"Equally Racist\" collection.", "The \"Equally Racist\" collection, as imagined by Huzlers, aims to offend people of all different racial identities, including white people:", "After H&M faced huge controversy for putting an African American boy to model a hoodie which read “Coolest monkey in the jungle”, It is being reported that H&M is planning on releasing a new collection that according to chairman Stefan Persson, is “equally racist to all the other races”. The collection will be called the “You’re Not Alone” collection.", "Stefan told reporters that the monkey hoodie was mostly being criticized by black people, so they decided to work on a collection that is racist to not only blacks, but also Hispanics, Whites, west Asians, and east Asians. Check out the collection so far below:", "Huzlers is a well-known satire web site with a long history of pushing misinformation. They carry a disclaimer in the footer stating that \"Huzlers.com is the most infamous fauxtire & satire entertainment website in the world.\"", "However, people also began posting the images independent of the article itself (and thus the disclaimer). These images include a child of apparently Middle Eastern descent wearing a shirt that says \"I'm the bomb,\" and an East Asian child wearing a shirt that implies he eats dog meat.", "Of course, the images are doctored. Huzlers simply took images of children wearing real H&M clothing and then digitally added racist logos. Here's a look at the real H&M products (left) and the doctored Huzlers images (right):", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]