["About this rating", "In May 2018, the Capriccio Bubbly Sangria beverage generated a good deal of publicity online and in news coverage, drawing frequent comparisons to Four Loko as well as speculation about its ingredients and rumored effects on consumers:", "Four Loko may have some competition when it comes to scary-strong alcoholic drinks. People are freaking out about Capriccio Bubbly Sangria, a bottled sangria that's apparently getting people so drunk, some are calling it sorcery.", "Although grape wine, fruit juice, and natural flavors are listed as Capriccio's main ingredients, people claim it must possess some unnatural secret elixir — like \"devil's piss,\" to quote one drinker — because of its destructive effects.", "\"I smashed two of these last night and blacked [the fuck] out,\" one person claimed.", "The collective internet freak-out began on May 12, when Twitter user @StateofThe__ tweeted screenshots of two Facebook users' reactions to the drink. That tweet went viral, sparking plenty of comments from other people who'd had scary experiences with Capriccio.", "These two separate people and I had seen a third post. This drink must have some secret shit they don’t include in the ingredients cause this wild asf pic.twitter.com/KvrnSyQ7bt", "— ICONIC INDY.G✨ (@StateofThe__) May 12, 2018", "One of the most prominent rumors about the beverage involved a supposed screen shot from an alleged news report aired by Chicago television station WFLD (Fox 32 Chicago) stating that Capriccio Sangria was \"spreading HIV worldwide\":", "We found no evidence that WFLD, or any other legitimate news organization, aired such a report.  This image appears to be a digitally doctored one in which a fake chyron was overlaid onto a screenshot of an ordinary Fox News/WFLD report about the drink's sudden popularity.", "The Capriccio Sangria rumor is just the latest entry in a long string of hoaxes positing that various food items have been contaminated with HIV.  As we often note, such rumors fail the reality check that HIV would not survive in this type of environment long enough to pose a real danger to unwitting consumers:", "+Human Immunodeficiency Virus (HIV) is the virus that caused Acquired Immunodeficiency Syndrome (AIDS). Recently, there has been report of rumors circulating among the users of mobile electronic devices claiming that various food products were contaminated with HIV. Can HIV/AIDS be transmitted by food?", "According to the World Health Organization (WHO), HIV cannot be transmitted by water or food. In fact, HIV does not live long outside the human body. Even if the food contained small amounts of HIV-infected blood or semen, exposure to the air, heat from cooking, and stomach acid would destroy the virus. Based on the current scientific evidence, WHO and the U.S. Centers for Disease Control and Prevention (CDC) are of the opinion that food is not a source of HIV infection.", "Szathmary, Zoe.   \"The New 'Four Loko'? Capriccio Bubbly Sangria Causes Social Media Buzz.\"\r\n    Fox News.   17 May 2018.", "Matthews, Melissa.   \"Capriccio Bubbly Sangria Has Been Dubbed the New Four Loko.\"\r\n    Men's Health.   15 May 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]