["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A fake news story said that President Donald Trump greenlit a pre-dawn raid on a mansion and compound owned by former President Barack Obama in Thailand.", "\"Delta Force raids Obama stronghold in Thailand,\" said a Dec. 27 headline on the website Someonesbones.com.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news. The photo of the alleged Obama compound in Thailand is actually a resort, and a Pentagon spokesman told PolitiFact that the story was false.", "Someonesbones describes itself as \"primarily dedicated to exploring the Nibiru realities and exposing scientific and govermental corruption.\" (Yes, the website can’t spell \"government\" and says that the government and mainstream media are liars.)", "The story by Someonesbones has no actual evidence and quotes an anonymous source who said that Obama owns real estate and shadow companies across the globe.", "The story said that Obama, by proxy through the Solyndra Corporation, owned a mansion and a 400-acre estate in Thailand.", "Solyndra was a solar company that received money as part of the stimulus package. The U.S. Department of Energy invited Solyndra to apply for money in 2006 before Obama took office. The collapse of Solyndra in 2011 became political fodder leading up to the 2012 election.", "In Someonesbones’ made-up raid, Delta Force seized several encrypted laptops and over 200 million dollars in gold bullion, in addition to dozens of crates containing Chinese-manufactured firearms and explosives. (The only truthful part of that is Delta Force is an actual elite counter-terrorism unit.)", "Another sign that this is fake news: the story identified the prime minister of Thailand as Nik Bukharin while the actual prime minister is Prayuth Chan-ocha. (Nikolay Ivanovich Bukharin was a Soviet political leader who died in 1938.)", "The story had green and black images of what appeared to be military officers in night vision goggles. We searched the photos on Google images and one appeared to be similar to an image used in a 2013 story about the movie Zero Dark Thirty, which was about the hunt for Osama Bin Laden.", "The photo of the fictitious Obama compound in Thailand is actually Villa Rak Tawan, a luxurious estate in Phuket used for vacations and weddings.", "Someonesbones.com said \"Delta Force raids Obama stronghold in Thailand\" but we found no evidence that such a raid occurred. We rate this headline Pants on Fire.", "Someonesbones.com, \"Delta force raids Obama stronghold in Thailand,\" Dec. 27, 2017", "Villa Rak Tawan, Website, Accessed Jan. 8, 2018", "SFGate, \"On the ‘Zero Dark Thirty’ controversy,\" Jan. 11, 2013", "LinkedIn, William Flinn, April 1, 2017", "Snopes, \"Did Delta Force Operators Raid an 'Obama Stronghold' in Thailand?\" Jan. 2, 2018", "PolitiFact, \"Fact-checking Solyndra,\" Nov. 17, 2011", "Interview,  Adrian J.T. Rankine-Galloway, Major, U.S. Marine Corps, Defense Press Operations, Office of the Secretary of Defense, Jan. 8, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]