["About this rating", "The Apostles' Creed is a statement of Christian belief commonly recited during services in a number of Christian denominations.  The text of the creed varies with translation and denomination, but the\nEnglish Language Liturgical Consultation version, for example, reads as follows:", "I believe in God, the Father almighty,\ncreator of heaven and earth.\nI believe in Jesus Christ, God's only Son, our Lord,\nwho was conceived by the Holy Spirit,\nborn of the Virgin Mary,\nsuffered under Pontius Pilate,\nwas crucified, died, and was buried;\nhe descended to the dead.\nOn the third day he rose again;\nhe ascended into heaven,\nhe is seated at the right hand of the Father,\nand he will come to judge the living and the dead.\nI believe in the Holy Spirit,\nthe holy catholic Church,\nthe communion of saints,\nthe forgiveness of sins,\nthe resurrection of the body,\nand the life everlasting. Amen.", "The sincerity of President Trump's religious beliefs was called into question on 5 December 2018 as many viewers noticed that he apparently did not recite the Apostles' Creed during President George H.W. Bush's funeral at the Washington National Cathedral. Columnist John Ziegler, for instance, noted how \"weird\" it was that President Obama, who was often wrongly identified as Muslim, fully recited all the words of that statement of faith, while President Trump, who courted and won support from the Evangelical community, did not:", "Ziegler was hardly the only one to levy this criticism at President Trump:", "Similarly, the Washington Post reported on the issue that:", "The Apostles' Creed is one of the prayers most core to Christianity. It states in a few lines the basic narrative of Jesus’s life, is the statement of faith in one God and is said daily by Christians across the globe.", "[O]ne Christian didn’t say it. And Twitter noticed.", "Video from the funeral of George H.W. Bush showed a front row of presidents at Washington National Cathedral, standing and reciting it along with the program, as the voice of Episcopal Bishop Michael Curry boomed through the speakers to the thousands of mourners. Jimmy Carter, Bill Clinton, Barack Obama and their wives glanced up and down from the programs they held in front of them and spoke the prayer, along with everyone else visible in the video. The program, as is typical, calls for the Creed to be said in unison.", "President Trump stood, with his hands folded in front of him, waist-high, the program in his left hand, his lips not moving. Melania Trump also did not speak, nor did she hold a program.", "While we can't speak the sincerity of President Trump's faith, we can confirm that these criticisms were backed up by video from George H.W. Bush's funeral. President Trump only appeared on screen for a short time during the recitation, but when he did he could be seen standing silently with his hands clasped and his program unopened, while other attendees, including former president Barack Obama, former first lady Michelle Obama, former president Bill Clinton, and former secretary of state Hillary Clinton, all held their programs open as they recited the Apostles' Creed from them.", "Here's a video from C-SPAN of the relevant portion of George H.W. Bush's state funeral:", "We examined other broadcasts of the funeral to see if they captured President Trump reciting any part of the Apostle's Creed. While we couldn't find video capturing President Trump during the entirety of the creed recitation, we did find video from Time magazine showing him in the same posture as above (silently holding his program at his waist) for about 15 seconds while others around him recited the statement of faith:", "We can only speak to what the video record shows, however, and not its significance.  It's possible that either or both of the Trumps had religious or other personal reasons for declining to participate in that aspect of the service.  Indeed, in a Washington Post opinion piece, Patrick Nugent defended President Trump's actions, regardless of what might have motivated them:", "The Apostles' Creed is not just a prayer one can or should recite out of courtesy for the sake of show, good manners or good taste.", "The Creed — or any Christian creed — is a statement of belief and a public commitment to very specific, carefully enumerated theological doctrines. It is not a bland, generic greeting-card prayer addressing an impersonal creator, a “force,” “the universe” or “the spirit of goodness” that could conceivably be uttered by anybody of any religious perspective or none at all.", "I admit entirely that the Trumps' abstention could well have been motivated by cluelessness, inattention, bad taste, bad manners, unfamiliarity, distraction or any number of other things. But the bottom line is that they abstained from reciting aloud, in public, a personal commitment to the truth of very specific, classic, ancient Christian doctrines.", "The president participated in a public ceremony in his capacity as head of state, not as a Presbyterian (which is how he has identified himself). As such, he has no obligation to declare those theological truths, or any others, aloud in public. In fact, I’d suggest, he has an obligation not to do so if he disagrees with any of them, or all of them, or doesn’t especially care, or isn’t sure, or doesn’t understand — or just thinks the president should be theologically neutral in public.", "This wasn't the only criticism levied at President Trump over something he allegedly did (or didn't do) at George H.W. Bush's funeral. Many social media users also accused him of disrespecting the deceased by failing to place his hand over his heart while the former president's casket was carried into Washington National Cathedral. We investigated this rumor, too, and found that the accusation was largely inaccurate.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]