["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "While President Donald Trump was overseas, he urged on congressional Republicans who were forging ahead with their tax plans.", "\"I am proud of the Republican House and Senate for working so hard on cutting taxes and reform,\" Trump tweeted Nov. 13. \"We’re getting close! Now, how about ending the unfair and highly unpopular Individual Mandate in Obamacare and reducing taxes even further? Cut top rate to 35 percent with all of the rest going to middle income cuts?\"", "I am proud of the Rep. House & Senate for working so hard on cutting taxes {& reform.} We’re getting close! Now, how about ending the unfair & highly unpopular Indiv Mandate in OCare & reducing taxes even further? Cut top rate to 35% w/all of the rest going to middle income cuts?", "From Trump's tweet to the Senate Republicans' ears, apparently.  Senate Majority Leader Mitch McConnell, R-Ky., emerged from a closed-door Republican caucus meeting Nov. 14 saying, \"We’re optimistic that inserting the individual mandate repeal would be helpful.\" The Congressional Budget Office estimated that repeal would reduce deficits by more than $300 billion over 10 years, although about 13 million fewer people would not have health insurance.", "The health care law’s requirement that most people have coverage has long stuck in Trump’s throat.", "We wondered if the mandate is \"highly unpopular,\" as he said.", "The polling shows that it is the least popular of the Affordable Care Act’s changes, but how people feel about it depends on how you frame the question.", "When asked simply if they like or don’t like the mandate, as many as two-thirds of the people say they don’t. A Kaiser Family Foundation tracking poll found that 63 percent had an unfavorable opinion in November 2016. An Associated Press/NORC poll in January 2017 came back with 36 percent in favor, 13 percent who didn’t care one way or the other, and 50 percent who opposed it.", "The White House press office noted a February 2017 YouGov poll that found that 34 percent favored including the mandate in any bill to replace the Affordable Care Act and 66 percent opposed it. The press office also pointed to similar results from an April 2017 Harris poll.", "Public opinion became more complicated around the time Republicans started voting on bills to repeal and replace Obamacare. As that process moved forward, more pollsters began asking people if they thought the individual mandate should stay or go.", "In March 2017, CNN/ORC gave respondents a list of options and asked them if they \"favor or oppose including that policy in a replacement bill.\" Half, 50 percent, said the requirement to obtain coverage should be kept and about half, 48 percent, said it should be ditched.", "The Kaiser tracking poll in October 2017 took a different approach to the same topic, and got results similar to CNN/ORC.", "Kaiser set up the question this way: \"The Trump administration has made a number of changes related to the health insurance marketplaces. Do you approve or disapprove of the following actions made by the Trump administration?\"", "Kaiser described the policy as \"the federal government may stop enforcing the requirement that all individuals have insurance or pay a fine.\"", "Half, 50 percent, of the people said they approved of that, while 47 percent said they didn’t. Again, a split decision.", "An earlier Kaiser tracking poll triggered higher levels of support for enforcing the mandate. In August 2017, pollsters framed the issue in terms of \"President Trump taking actions to make the law (Obamacare) fail.\"", "Put that way, only one-third, 31 percent, said they wanted Trump to stop enforcing the mandate, and two-thirds said it should be enforced.", "Broadly speaking, in the context of getting rid of the Affordable Care Act, most polls show that about half of the public opposes the mandate and about half supports it.", "Obamacare has many moving parts that interact with each other. The individual mandate has a particularly strong tie to the law’s protections for people with pre-existing conditions. The rationale is that if the government is going to force insurance companies to cover everyone, then it must deliver a big insurance pool with a lot of healthy people in it. (There might be other ways to get to more or less the same place, but this fact-check is about the mandate.)", "The pre-existing conditions protection is popular. In the November 2016 Kaiser poll, nearly 70 percent of the public supported that piece of the puzzle. But only 35 percent liked its evil twin, the individual mandate.", "In 2014, the Kaiser Family Foundation probed what people know about the mandate and found that opinions were \"malleable.\"", "\"When people were told that most people already fulfill the mandate with coverage they get through an employer or government plan, or that people would not have to pay the fine if buying insurance would take up too large a share of their income, support increased to 6 in 10,\" said Liz Hamel, director of Kaiser’s public opinion research team.", "Hamel told us that attitudes about the mandate have shifted as overall support for Obamacare has grown. Republican views have largely held steady, but independents have warmed to the law, and Democrats even more so.", "\"Democrats in particular have rallied around the ACA in the past year as it has come under threat of repeal or dismantling by executive order,\" Hamel said. \"In the current political context, people who support the ACA are willing to defend even the pieces of it that they don’t like rather than see the whole law undermined or repealed.\"", "Trump said the individual mandate is \"highly unpopular.\" As recently as February 2017, a YouGov poll found that 65 percent of people opposed it, a finding that is consistent with earlier polls from other organizations. That’s a fair sign of the provision’s unpopularity.", "On the other hand, when people were given more details about the mandate, they had a more favorable view, as high as about 60 percent.", "And in the context of repealing the Affordable Care Act, the most recent polls found the public generally split 50/50 on whether to keep the mandate in force.", "Public opinion about the individual mandate is not a simple black-and-white choice. As a leading expert explained, people might not love it, but they are willing to live with it.", "We rate this claim Half True.", "Donald Trump, tweet, Nov. 13, 2017", "YouGov, The public wants Obamacare minus the individual mandate, February 27, 2017", "Harris Poll, Americans Uneasy With Push to Repeal Obamacare, May 4, 2017", "Kaiser Family Foundation, Tracking poll, October 2017", "Kaiser Family Foundation, The Politics of ACA Repeal and Replace Efforts, Aug. 11, 2017", "Kaiser Family Foundation, Tracking poll, December 2014", "Kaiser Family Foundation, Tracking poll, November 2016", "CNN, CNN/ORC poll: Public splits on revoking individual mandate, March 7, 2017", "CNN/ORC Poll, Health care, March 7, 2017", "AP/NORC Poll, Many Want Changes to the Health Care Law but Few Support Its Immediate Repeal​, January 2017", "Pew Charitable Trust, Why the Unpopular Individual Mandate Is Likely to Endure (For Now), Sept. 15, 2017", "Congressional Budget Office, Repealing the Individual Health Insurance Mandate: An Updated Estimate, November 2017", "Email interview, Daniel Hopkins, associate professor, Department of Political Science, University of Pennsylvania, Nov. 14, 2017", "Email interview, Liz Hamel, director, public opinion research, Kaiser Family Foundation, Nov. 13, 2017", "Email interview, Steven Cheung, spokesman, White House press office, Nov. 14, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]