["About this rating", "A volunteer group of Louisiana residents known as the \"Cajun Navy\" travel to offer assistance during hurricanes.", "A popular September 2019 social media post supposedly chronicling Cajun Navy activities during Hurricane Dorian actually depicted their efforts during Hurricane Harvey two years earlier.", "In September 2019, as Americans were tracking the unpredictable path of Hurricane Dorian and fearing it might make landfall in Florida, many social media users, including conservative columnist Todd Starnes, shared a post with a picture showing a procession of vehicles towing small boats. The accompanying text identified the drivers as volunteers headed out to help potential storm victims in Florida and the Carolinas:", "Several of our readers sent me a link to this incredible Facebook post written by a gentleman named Floyd Richard Burdett. It’s word a read, folks. Full disclosure – I cannot independently verify where the photograph was taken.", "There are still plenty of red-blooded American men who are willing to head towards the danger zone – girded by Almighty God and toxic masculinity. We got word that the Cajun Navy is already on the ground in Florida.", "One of those guys is my cousin, who is part of a swift water rescue team from Memphis. They are headed to Jacksonville, Florida.", "Y’all say a prayer for these brave men and the good people of Florida and the Carolinas.", "Let this sink in for a minute.....Hundreds and hundreds of small boats pulled by countless pickups and SUVs from across the South are headed for Florida.", "Almost all of them driven by men. They're using their own property, sacrificing their own time, spending their own money, and risking their own lives for one reason: to help total strangers in desperate need ...", "Although volunteers may indeed have begun heading to Florida and/or the Carolinas to offer assistance during Hurricane Dorian in early September 2019, this particular photograph and text is dated from two years earlier and pictured members of Lousiana's \"Cajun Navy\" headed to Texas (not Florida) to help rescue victims of Hurricane Harvey (not Hurricane Dorian) in August 2017 (not 2019):", "The Houston Chronicle described the Cajun Navy's efforts in Texas at the time as follows:", "Texans are getting help from their neighbors who know too well the dangers hurricanes can bring.", "The Cajun Navy, a band of Louisiana residents who used their boats and resources to rescue people during Hurricane Katrina, have been authorized to come to Texas and help rescue Hurricane Harvey victims.", "At the beginning of September 2019, a representative of the Cajun Navy 2016 group said they were prepared to help with Hurricane Dorian but at the moment were unsure where to head due to the uncertain path of the storm:", "Like many of us, Ben Husser has been getting updates on Hurricane Dorian from the news. But unlike the rest of us, he and the search and rescue crew from Cajun Navy 2016 are headed to the action.", "“Our first group is probably going to leave Monday or Monday night [September 2],” said Husser.", "Husser is a volunteer for the Cajun Navy 2016. He and his team do strictly search and rescue missions, but at this point, they don’t know where they are headed. This makes planning to help those in need, even more difficult, Husser say.", "“As of right now we’re looking at 3 or 4 different locations,” said Husser ...", "Husser says the Cajun Navy 2016 are second responders and will only take their boats to places where they have permission. But for now, they are waiting and watching the storm closely to follow its path.", "In short, the gist of this social media post circulated in 2019 and describing the helpful efforts of some volunteers during hurricanes is true, but it was written about events that took place two years earlier, during a different storm in a different location.", "Soicher, Spencer.   \"Cajun Navy 2016 Prepared to Help, But Don’t Know Where.\"\r\n    WAFB-TV.   1 September 2019.", "Starnes, Todd.   \"Hundreds of Men Driving Pickup Trucks & Hauling Boats Heading to Florida.\"\r\n    ToddStarnes.com.   3 September 2019.", "Pandolfo, Chris.   \"This Viral Post Captures Houston Heroes So Perfectly You Will Cry.\"\r\n    Conservative Review.   1 September 2017.", "Axford, William.   \"Cajun Navy Comes to Houston to Help Rescue Hurricane Harvey Victims.\"\r\n    Houston Chronicle.   28 August 2017.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]