["“सिकराय गनीपुर रोड़ पंचमुखी मंदिर के पास पकड़ा गया एक ओर गिरोह का सदस्य आदमीयो को देख कर खेत मे भाग गया मोके पे पुलिस बुला कर पकड़ाया (One more gang caught by people near Panchmukhi temple on Ginipur road, Sikrai. On seeing people, he was running away from men towards the fields. He was later handed over to the police -translated)”, reads the message posted by Facebook page Dausa Times on August 7, 2019. The video shows an angry mob pushing around a man whose hands they’ve tied with a rope. In the video, a person from the mob can be heard asking the man, “how many children have you butchered so far with this”, while pointing to an object.", "सिकराय गनीपुर रोड़ पंचमुखी मंदिर के पास पकड़ा गया एक ओर गिरोह का सदस्य आदमीयो को देख कर खेत मे भाग गया मोके पे पुलिस बुला कर पकड़ाया", "Posted by Dausa Times on Wednesday, 7 August 2019", "The message shared along with the video suggests that a member of a child-lifting gang was arrested by the police in Dausa district’s Sikrai town, Rajasthan. Facebook page – JK Meena Saray – posted a longer version of the video taken from a different angle but shared with the identical message. The mob relentlessly inquires about an object purportedly carried by the man. Throughout the video, the man kept changing his responses which were sometimes even unrelated to the questions.", "On looking for news reports from Dausa district, Rajasthan with some generic keywords, we were unable to find any. Alt News contacted Manpur police station regarding this matter. We sent the video to SHO Surendra Kumar Bakolia. He watched the clip and informed us that the man was mentally unstable. He said, “The incident took place on August 7. He was mentally unstable. He said anything in response to their questions. He was sent for a medical check-up and there were no [major] injuries. This man was later sent to an NGO based in Bharatpur which takes care of mentally challenged people.”", "In conclusion, a video of a mentally-challenged man falsely accused of being a child-kidnapper and taken hostage by a mob in Rajasthan’s Dausa district was shared by some Facebook pages to spread child-lifting rumours. Earlier, a video of a mentally-ill woman in Sri Ganga Nagar district, Rajasthan, held captive by a mob over suspicion of child-lifting, was also shared to stoke the rumours.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]