["About this rating", "Controversy surrounded President Donald Trump's activities and engagements on the weekend of Veterans Day in November 2018. The president travelled to France to join other world leaders for Armistice Day commemorations but failed to attend a memorial event at a U.S. military cemetery outside Paris on 10 November due to travel complications caused by heavy rain, a decision that prompted widespread criticism of Trump.", "On 12 November, the morning after his arrival home from Europe, Trump then declined to attend a traditional Veterans Day commemoration ceremony at Arlington National Cemetery.  That action prompted a viral Facebook post claiming that Trump was the first sitting U.S. president in 56 years not to lay a wreath at the Tomb of the Unknown Soldier in Arlington for the occasion of Veterans Day:", "That claim was false, however.  The following list documents years in which the sitting U.S. president did not attend a Veterans Day wreath-laying ceremony at Arlington, stretching back to 1989:", "2018: President Donald Trump spent Veterans Day at the White House.", "2017: Trump spent Veterans Day in Vietnam, accompanied by Vietnam War veterans at a commemoration event.", "2014: President Barack Obama spent Veterans Day on an official visit to China.", "2011: Obama spent Veterans Day with troops on board the USS Carl Vinson.", "2010: Obama spent Veterans Day with troops stationed at Yongsan Army Garrison in Seoul, South Korea.", "2008: President George W. Bush spent Veterans Day at the Intrepid Sea, Air and Space Museum in New York, while Vice President Dick Cheney attended the wreath-laying ceremony at the Tomb of the Unknowns.", "2005: Bush spent Veterans Day with troops at Tobyhanna Army Depot in Pennsylvania.", "2001: Bush attended events in New York, including a commemoration at the site of the World Trade Center two months after the September 11th attacks. Cheney attended the traditional ceremony at Arlington in his stead.", "1992: President George H.W. Bush visited the Vietnam Veterans Memorial at the National Mall in Washington D.C. rather than Arlington.", "1990: Bush spent Veterans Day weekend at Camp David, Maryland.", "1989: Bush attended the dedication of the Texas Vietnam War Memorial in Dallas, while General Colin Powell, Chairman of the Joint Chiefs of Staff, represented him at the traditional Arlington ceremony.", "President Bill Clinton laid a wreath at the Tomb of the Unknown Soldier on all eight Veterans Days that fell during his tenure in the White House, but three out of the four presidents who preceded Donald Trump did not participate in the traditional Arlington Ceremony at one time or another.", "While Veterans Day (which originated in the traditional November commemoration of Armistice Day) is intended to celebrate all U.S. military veterans, Memorial Day (held on the last Monday in May) is specifically intended to commemorate and honor those who died while serving in the U.S. military.", "President Trump himself has attended both Memorial Day ceremonies so far in his tenure, but previous presidents have been known to miss the traditional Arlington commemoration on the last Monday in May, a history we wrote about in 2010 when President Barack Obama's visit to Chicago that year prompted similar social media claims that his decision was unprecedented.", "In fact, President George W. Bush made alternative arrangements in 2002, as did President Bush Sr. on all four Memorial Days during his tenure, and President Ronald Reagan on four out of eight occasions during his two administrations.", "As he did for Veterans Day, President Clinton attended ceremonies at the Tomb of the Unknowns on every Memorial Day during his eight years as president.", "BBC News.   \"Armistice Day: White House Defends Trump WWI No-Show.\"\r\n     12 November 2018.", "Chamberlain, Samuel.   \"Trump, Pence Miss Veterans Day Observance at Arlington Cemetery.\"\r\n    Fox News.   13 November.", "Dwyer, Devin.   \"Trump Marks Veterans Day with Commemoration in Vietnam.\"\r\n    ABC News.   10 November 2017.", "Landler, Mark.   \"Obama's Focus in China is on Leader, Not Public.\"\r\n    The New York Times.   10 November 2014.", "Compton, Matt.   \"President Obama Attends the Carrier Classic.\"\r\n    White House.   12 November 2011.", "Lee, Jesse.   \"President Obama to America's Veterans: 'We Remember.'\"\r\n    White House.   11 November 2010.", "McGeehan, Patrick; Chan, Sewell.   \"Bush Leads Ceremony at the Intrepid.\"\r\n    The New York Times.   11 November 2008.", "Office of the White House Press Secretary.   \"President Commemorates Veterans Day, Discusses War on Terror.\"\r\n    11 November 2005.", "CNN.   \"Bush Honors Veterans, WTC Heroes and Victims.\"\r\n    11 November 2001.", "Bush, George.   \"Public Papers of the Presidents of the United States -- George Bush, July 1 to December 31, 1990.\"\r\n    Accessed 16 November 2018.", "U.S. Department of Veterans Affairs.   \"Remarks by General Colin L. Powell, Veterans Day National Ceremony, Arlington National Cemetery.\"\r\n    11 November 1989.", "Watkins, Eli.   \"Trump Marks Memorial Day with Arlington Visit.\"\r\n    CNN.   29 May 2017.", "Qiu, Linda.   \"On Memorial Day, Trump Honors 'Our Heroes' at Arlington.\"\r\n    The New York Times.   28 May 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]