["About this rating", "In January 2016, the Obama administration successfully negotiated the release of four Americans who had been imprisoned in Iran in exchange for the release of seven Iranians who had been imprisoned in the United States.(A fifth American prisoner was released separately.) At around the same time, the U.S. airlifted the equivalent of USD $400 million in various currencies to Tehran, sparking conspiracy theories about the timing:", "House Speaker Paul D. Ryan (R-Wis.) was among those who seized on the timing and cloak-and-dagger delivery method, which was first reported by the Wall Street Journal, saying it proved suspicions that the Obama administration had tried to hide a payment for the four Americans, including Washington Post reporter Jason Rezaian. GOP candidate Donald Trump called it an example of the administration’s foreign policy failures.", "“Obama administration sent plane load of cash to #Iran as ransom as part of deal on hostages. Just unreal,” tweeted Sen. Marco Rubio (R-Fla.), a long-standing critic of the Iran talks.", "As with other issues that would normally fall by the wayside in a normal daily news cycle, the payout to Iran became prime fodder for yet another election-year debate:", "State Department spokesman John Kirby joined Bill Hemmer on \"America's Newsroom\" to defend a $400 million cash transfer to Iran during the release of four Iranian-held U.S. hostages.", "Kirby said the money had been frozen in a trust fund in the U.S. for decades and it was \"their money.\"", "He asserted that the fact that the transaction occurred during the release of the detained Americans was \"coincidental.\" Hemmer pressed Kirby, saying that it appears that this cash transfer was kept secret and was effectively a \"ransom.\"", "\"It looks bad,\" Hemmer said.", "However, the $400 million dollar transfer was actually an openly announced one, paid in settlement of a nearly 40-year dispute between Iran and the United States — a settlement that likely saved the United States several billion dollars.", "Back in late 1979, after Iranian revolutionaries took 52 Americans hostage at the US Embassy in Tehran, the United States severed diplomatic relations with Iran and froze Iranian assets in America. Among those frozen assets was a $400 million delivery of fighter jets from the U.S. that Iran’s previous government had already paid for.", "Although the American hostages were finally released a year later, issues such as the frozen Iranian assets (including that $400 million) were not settled at that time. Instead, an international court based in the Hague, the Iran–United States Claims Tribunal was established to deal with such legal claims. The tribunal process dragged on for years and years without a ruling on the $400 million being issued, and finally, when arbitration process was apparently about to wind up (quite possibly not in American's favor), the U.S. agreed to pay Iran back the $400 million principal along with $1.3 billion in interest. If the issue had gone to the tribunal for a decision, as was expected, the U.S. could have been on the hook for the full $10 billion in compensation Iran was seeking.", "It is true the U.S. agreed to the settlement at the same time it was negotiating a nuclear deal with Iran and for the return of four U.S. citizens who had been detained by Iran. However, the negotiations over these these issues were conducted by completely separate teams in order to avoid any overlap or suggestions of connections between them.", "As Vox noted, charges that the U.S. had paid \"ransom\" to Iran for the release of hostages didn't even make logical sense:", "The payment, which sounds really shady out of context, was actually the end of a boring, decades-old international legal case totally unrelated to the hot-button nuclear and prisoner issues.", "[T]here was no direct evidence to back up [the ransom] theory. The speculation about timing was just that — speculation.", "Iranian negotiators on the prisoner exchange were not the same negotiators involved in the weapons deal settlement. Therefore, they couldn’t make demands of the US team negotiating the weapons deal settlement, which means they couldn’t negotiate a quid pro quo of money for hostage release, the definition of a ransom.", "Moreover, the basic logic of it didn’t make any sense. Iran was going to get that money back no matter what through the arbitration process — probably more, if the Obama administration was right. Why would [Iran] release potentially valuable hostages in exchange for money it would have gotten otherwise? Iran would have to be the world’s dumbest hostage taker.", "Even though the Obama administration openly announced the settlement in January 2016, it wasn't until several months later that claims the U.S. had offered a \"ransom payment\" began to circulate due to spin from some Iranian officials. But Vox also noted that spin wasn't too credible:", "[One cited] piece of evidence for the payment being a ransom is that the Iranians spun it that way.", "But of course Iranian officials would spin it as a hostage payment. This makes them look strong to their domestic audience and America look weak. We don’t take political spin from American officials at face value, so we shouldn’t take Iranian spin at face value either — especially when it’s contradicted by independent evidence.", "By delivering the payment on the same day as the prisoner release, Iranian officials could claim that they got the money as part of a ransom deal.", "But the truth is that the Iranians could have claimed that no matter when the cash was delivered. If the Obama administration had forked over $400 million six months later, those same Iranian defense officials could have lied and said it was part of the prisoner release deal rather than the weapons settlement.", "The lie isn’t significantly more credible just because the cash was delivered on the same day. Nor should American media and politicians help validate the Iranian lie by treating Iranian propaganda as actual evidence.", "On 18 August 2016, the Obama administration acknowledged that delivery of the $400 million payment due to Iran in settlement of the dispute over payment for military equipment had been held up until officials were sure that American prisoners Iran had agreed to free in a separate deal were safely away:", "State Department spokesman John Kirby addressed questions by explaining that the U.S. held on to the $400 million cash payment until American prisoners were on a plane and safely away from Iran to “retain maximum leverage.” Kirby said the arrangement did not in any way constitute a ransom payment, as President Barack Obama's Republican critics have alleged.", "“We deliberately leveraged that moment to finalize these outstanding issues nearly simultaneously,” he said. “With concerns that Iran may renege on the prisoner release, given unnecessary delays regarding persons in Iran who could not be located as well as, to be quite honest, mutual mistrust between Iran and the United States, we of course sought to retain maximum leverage until after American citizens were released. That was our top priority.”", "The fact that the money was physically sent to Iran in various currencies  rather than simply transferred by wire may seem odd in the context of the United States' increasingly cashless society, but that was done in order to avoid existing Treasury Department sanctions that banned the use of American currency in transactions with Iran, and international sanctions which at that time kept Iran from accessing the global financial markets (and which were lifted in January 2016).", "Beauchamp, Zack.   \"The US Did Not Pay a $400 Million 'Ransom' to Iran.\"\r\n    Vox.   4 August 2016.", "Keane, Angela Greiling and Christopher Condon.   \"Obama Says Iran Deal Backs Diplomacy, U.S. Sets New Sanction.\"\r\n    Bloomberg.   17 January 2016.", "Lee, Matthew and Bradley Klapper.   \"Trump Off Base on Clinton and Iran Payment.\"\r\n    AP/The Washington Post.   3 August 2016.", "Solomon, Jay and Carol E. Lee.   \"U.S. Sent Cash to Iran as Americans Were Freed.\"\r\n    The Wall Street Journal.   3 August 2016.", "Los Angeles Times.   \"That Payment to Iran? It Wasn’t Ransom.\"\r\n    7 August 2016.", "Labott, Elise et al.   \"US Sent Plane with $400 Million in Cash to Iran.\"\r\n    CNN.   4 August 2016.", "Allen, Ron and Erik Ortiz.   \"$400M Payment to Iran as Americans Freed Not a Ransom.\"\r\n    NBC News.   3 August 2016.", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]