["About this rating", "Images depicting Danville police vehicles with raised hoods are genuine and unaltered.", "The vehicles' hoods were raised during a lengthy investigation on a hot day to prevent the units from overheating and not to obstruct the units' dash cams, and the department has no policy allowing the latter", "On 22 September 2016, a Facebook user posted the status update reproduced above, claiming that police in Danville, Virginia, had permission to use the hoods of police vehicle to obstruct dash cam views at their discretion (presumably to avoid the recording of any potantial evidence of police misbehavior):", "I don't like wasting breath but I will say this-PUSH THE ISSUE AS TO WHY THE DANVILLE VA POLICE DEPT. HAS PERMISSION TO LIFT THEIR HOODS, WHICH COVERS UP THE CAMERA VIEW, DURING A STOP OR WHATEVER(This picture is from a previous situation that the police responded to a few weeks back)!!! The response given by their representative is that this helps the car to not overheat. I was over by the police precinct yesterday in Green Street park and a police car was on for over 30 minutes with no one in it. Seemed like overheating was definitely not an issue then. Raise this issue over and over. Injustices has been happening in this city for so many years, but given what we are seeing nationwide- WE NEED THOSE CAMERAS TO BE ON AND HAVE CLEAR VIEW AT ALL TIMES!!!ESPECIALLY IN DANVILLE VA!", "The claim was widely shared via social media, often as a warning to individuals in the Danville area with respect to potential dangers during traffic stops:", "Police in Danville, Virginia are putting the hoods of their cars up when they pull people over to block the dash cameras from filming them. pic.twitter.com/oCwQglQTXg", "— Shaun King (@ShaunKing) September 26, 2016", "The original image of two police vehicles with raised hoods was traceable to a 24 August 2016 Danville Register & Bee article about an investigation of shots fired near a police precinct. The raised hoods seen in that image were not mentioned as having anything to do with a traffic stop or civilian interactions with police.", "We contacted the Danville Police Department to ask whether the department had such a policy in place (i.e., allowing officers to obstruct dash cams) and inquire about the images circulating on social media, and the officer with whom we spoke was aware of the photographs and stated that no such policy in Danville permitted police to deliberately obstruct their vehicle dash cams.  He also told us that the photographs were taken during the investigation of a civilian vehicle that had been \"shot up,\" adding that the investigation took place over the course of an afternoon as police spent several hours combing the area for evidence such as shell casings  Since responding vehicles remained at the scene for several hours, he said, officers lifted their units' hoods as a preventive measure to protect against overheating.  (Weather records demonstrate daytime temperatures in Danville ranged from the mid-80s to the 90s during the week of 24 August 2016.)", "In a separate e-mailed response, a representative from the Danville Police Department affirmed that circumstance and provided a more detailed explanation about why police vehicle overheating is a common issue:", "The amount of electronic equipment required in a Patrol vehicle causes a substantial amount of heat to build in the engine compartment. If you notice in the photos of the Police cars there are also  cooling louvres on the hoods. This was the first attempt to stop the overheating issues which were disabling our vehicles and causing very expensive repairs. Our cars are in use 24 hours a day and the photo of the two patrol vehicles was on a day with temperatures nearing 100 degrees. The hoods aren’t opened unless the car is expected to idle with the emergency lights running for an extended period of time. The officers are equipped with Body Worn Cameras so there is a back up to an in-car camera that captures any citizen encounter far better than the in-car camera. There are video systems for inside and outside the car, an emergency light bar, Mobile Data Terminal, police Radio, printer and normal systems running off the heavy duty batteries in the cars. This generates a tremendous amount of heat which damages the engine electronics.", "The accusations that this is being done for any nefarious purpose are completely false. We have had zero complaints from local citizens.", "The problems are well known to Chevrolet. May I suggest contacting Chevrolet directly and demanding a remedy and retrofitting of the correction at their expense.", "Officers on police message boards in 2005 described lifting the hoods of their units to (among other reasons) ensure the safety of department canines during lengthy stops on hot days, a circumstance also mentioned in a River City TV interview with Danville Police about the social media controversy:", "A follow-up article from the Register & Bee noted that the problem that prompted the raising of patrol car hoods was not literally an issue with engines overheating, but a \"continual heating problem\" that damages electrical components:", "Community activists say the raised hood obscures the view of the dashboard camera, blocking the recording of whatever actions are taking place.", "Certain \"electrical parts in the engine\" will \"melt\" when the heat rises in the summer, according to Danville Police Lt. Mike Wallace.", "[Police Chief Philip] Broadfoot said it's not an overheating issue, it is a \"continual heating issue.\"", "No indication of a pulled-over civilian vehicle (or any other form of police-public interaction) is visible in any of the photographs circulated on Facebook, and no one has yet produced any pictures of a hood-up Danville police car clearly involved in a traffic stop or cited an instance in which evidence from a Danville traffic stop was unobtainable due to dashboard camera blockage.", "Livingston, Michael.   \"Officers Hear Shots Fired Near Green Street Precinct in Danville.\"\r\n    Danville Register.   24 August 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]