["The fake news website BBCNewsHub.com has struck again claiming among other people, T.V. Mohandas Pai and BJP MP, Subramanian Swamy as its latest victims. “Shocking list. One Indian political party included” tweeted Pai while sharing an article listing the ten most corrupt political parties in the world in 2018. The list was published in July 2018 and featured the Indian National Congress among other parties from different parts of the world. According to this list, INC ranks 2nd among the most corrupt political parties of the world. Pai has now deleted his tweet.", "BBC News Hub is a dubious website that is not related in any way to the British Broadcasting Corporation (BBC). The ‘About us’ section is equally hilarious. It states, “bbcnewshub.com is best place to provide complete, brief, correct, healthy and strong content for the respectable visitors which are related to all over the world. It provides the national and international current and all type of information.”", "The poorly worded article is full of grammatical mistakes. The article starts with a laughable description of political parties, stating that “a political party is a union of people who work conjointly and struggle against one another to win political power; political parties do hire member or contenders, these parties are also to run and organize elections to decide the government of any country in the world.” It goes on to describe Indian National Congress as “the powerful reigning party in India” and then announces that “every general election is leaded by Indian National Congress due to its majority in most regions.”", "It is difficult to imagine that anyone would fall for this website after reading the first few sentences. Even the title reads as Top 10 list of most corrupt political “party” in the world. But T.V. Mohandas Pai had plenty of company in others who also took such an obviously fake website at face value and shared its list. From an author of fake news website Postcard News to Vivek Agnihotri and Subramanian Swamy, the list is long.", "Social media users brought it to Mohandas Pai’s notice that he has tweeted a link to a fake news website. This did not seem to deter Pai who chose to defend his tweet.", "Fake site or not, most of the political parties there are over 50 years, their history is known, their corruption is also known https://t.co/uyTxPx8AV9", "— Mohandas Pai (@TVMohandasPai) September 17, 2018", "Trushar Barot, Digital Launch Editor with BBC also tweeted to Mohandas Pai requesting him to delete his tweet as it could lead to perpetuation of this misinformation, to which Pai replied,", "Why don’t you officially deny this and say that you have nothing to do with the address? It is your responsibility to look after your brand! Even you publish wrong news and people protest you just do not care too. https://t.co/mXmzJecOWj", "— Mohandas Pai (@TVMohandasPai) September 17, 2018", "It was only later in the day that Mohandas Pai deleted his tweet.", "In November last year, the same website listed PM Narendra Modi among “Ten most corrupt Prime Ministers in the world”.", "In yet another ‘list’, Prime Minister Narendra Modi’s family ranked 2nd among ‘Top 10 Most Corrupt Families In The World 2018’.", "Mohandas Pai is no stranger to this tendency of falling for fake news. Earlier, the former Infosys director had retweeted a tweet by Times How, a parody account of Times Now.", "Several media organisations including Alt News have busted the claims of this fake news website in the past, yet social media users continue to fall for it. In most cases when people come across content that reinforces their beliefs and prejudices, they share it without exercising any critical evaluation.", "Donate Now", "Follow @free_thinker", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]