["About this rating", "A spoof news site used singer Katy Perry's 12 February 2017 appearance at the Grammy Awards as the basis for a satirical story holding that the singer had been taken into custody after making threatening remarks about President Trump:", "Katy Perry was doing her typical liberal propagandist thing at the Grammy’s Sunday night when she made a huge mistake. After she walked off stage, still with her mic hot to the sound room and the Trump officials overseeing the show to make sure there were no lies or shenanigans, she told her friend Justin Timberlake about a sick fantasy she’s been having:", "\"I just want to string him up by his scrawny little nutsack and make him admit he has small hands right before I paint him a different color than orange and leave him to die.\"", "The statement, which was recorded by the sound booth and immediately impounded by a team that reports directly to Steve Bannon, will be used against Perry in court should they decide to charge her with treason as they should. Other than to confirm that Perry is in custody, nobody from the national security team is saying much else.", "Perry was escorted away from the event in a plain, unmarked black cargo van.", "While Perry did sing on the program, there have been no reports she threatened President Donald Trump afterwards.  The disclaimer for the site that originated this report notes that the site's content is satirical in nature:", "DISCLAIMER: The Resistance may include information from sources that may or may not be reliable and facts that don’t necessarily exist. All articles should be considered satirical and any and all quotes attributed to actual people complete and total baloney. Pictures that represent actual people should be considered altered and not in any way real.", "However, Perry's performance of \"Chained to the Rhythm\" was not without political elements. She confirmed that she wore an armband reading \"PERSIST,\" a possible allusion to the silencing of Sen. Elizabeth Warren (D-MA) by Senate Republicans on 7 February 2017.", "Supporters of Warren adopted the word and the phrase \"Nevertheless, she persisted\" following Senate Majority Leader Mitch McConnell's (R-KY) explanation for stopping Warren from criticizing Trump's nominee for Attorney General, Sen. Jeff Sessions (R-AL):", "Sen. Warren was giving a lengthy speech. She had appeared to violate the rule. She was warned. She was given an explanation. Nevertheless, she persisted.", "Planned Parenthood Federation of America president Cecile Richards tweeted following Perry's appearance to say: \"I spy a Planned Parenthood lapel pin onstage.\" (We have contacted both Richards and the singer seeking confirmation of that statement.)", "Perry closed her song standing alongside singer Skip Marley in front of a display depicting the preamble to the Constitution, with the opening phrase (\"We the People\") visible above her, as seen below:", "Okwodu, Janelle.   \"Katy Perry Gets Political with Her Grammys Onstage Look.\" \r\n    Vogue Magazine.   12 February 2017.", "Wang, Amy B.   \"‘Nevertheless, She Persisted’ Becomes New Battle Cry After McConnell Silences Elizabeth Warren.\"\r\n    The Washington Post.   8 February 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]