["About this rating", "In May 2019, readers questioned whether the federal government pays for erectile dysfunction medications such as Viagra, after the following image was circulated on social media:", "Both the image and the dollar amount it cited were dated as of this writing. The image shows a woman at a 2017 International Women's Day rally, while the $41.6 million figure on her sign was what was spent on Viagra by the Department of Defense in 2014.", "The image initially made the rounds in relation to a separate controversy in 2017, when U.S. President Donald Trump announced a decision to ban transgender people from serving in the U.S. military, claiming the military \"cannot be burdened with the tremendous medical costs and disruption that transgender [people] in the military would entail.\"", "At that time, multiple news articles reported the U.S. Department of Defense (DOD) was spending far more on erectile dysfunction medication than it would cost to provide medical care to transgender service members.", "The original sources for all these claims was a February 2015 Military Times article. That Military Times piece presented figures provided by the Defense Health Agency (DHA), a subsidiary of the Department of Defense, which documented that in 2014:", "We contacted the Department of Defense, which confirmed almost all of these figures were accurate for the year 2014, with some slight corrections: the total number of prescriptions for erectile dysfunction medication was 1,178,423, of which 905,683 were for Viagra; the total spent on Cialis was $22,827,346; and the cost of prescriptions for active duty members was $7.68 million. The DoD also clarified that the number of erectile dysfunction prescriptions given to active-duty members in 2014 was 140,789, not 102,885.", "According to data posted on the public transparency tool USASpending.gov, the DoD continues to purchase Viagra.", "Attempts in both 2019 and 2017 to make political points by juxtaposing the controversy du jour with coverage for erectile dysfunction prescriptions for service members and their families don't serve their causes well. For example, the Department of Defense does provide coverage for such prescriptions, but it also covers birth control.", "In September 2014, the Armed Forces Health Surveillance Center published figures showing that the rate of erectile dysfunction diagnoses among active-component service members had doubled between 2004 and 2013, and that 48% of cases were psychogenic, meaning the erectile dysfunction was linked to mental health issues such as post-traumatic stress disorder and depression.", "For context, we asked the DoD for a cost breakdown of how much it spends on birth control, but we did not receive a response by the time of publication. We will update when further information becomes available.", "Kime, Patricia.   \"DoD Spends $84M a Year on Viagra, Similar Meds.\"\r\n    Military Times.   13 February 2015.", "BBC News.   \"Why Does the US Military Buy So Much Viagra?\"\r\n    27 July 2017.", "Dan Mac Guill is a former writer for Snopes.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]