["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "(Associated Press)", "That figure tracks with a study from a left-leaning think tank that uses various numbers provided by Forbes regarding the net worth of billionaires.", "The timeframe for the study follows closely – but not exactly – with the declaration of the coronavirus as a pandemic.", "But the impact from COVID-19 on the stock market, for instance, began earlier. So the tally may distort the picture a bit, by starting at an economic low point.", "When Democratic presidential nominee Joe Biden visited Manitowoc on Sept. 21, his stop – at the Wisconsin Aluminum Foundry – had a blue-collar bent.", "So did his message.", "\"President talks all the time about how great the economy is,\" Biden told a group of workers.", "But, he noted, many places and sectors are not doing well amid the economic fallout of COVID-19, unemployment remains high and many Americans are at risk of losing their homes. Then he drew a sharp contrast:", "\"Now, the billionaires in this country are seeing their wealth increase by $800 billion,\" Biden said: \"Let me explain that again: all the billionaires in America, during the pandemic, their net worth combined, according to studies, have increased by $800 billion.\"", "Is Biden right?", "When asked for backup on the claim, a representative for Biden’s campaign pointed to an update of a report by the Institute for Policy Studies, a left-leaning Washington D.C. think tank.", "The report, \"Billionaire Bonanza 2020,\" was done by the institute in partnership with Americans for Tax Fairness. The latter falls under the non-profit New Venture Fund, which is managed by a for-profit company, Arabella Advisors, that consults on philanthropy.", "They used numbers from two features by Forbes.", "The first, is Forbes’ annual list of billionaires, \"The Richest in 2020,\" which was published April 7. That list was compiled based on stock prices and exchange rates on March 18. That would be one week after the World Health Organization declared the coronavirus a pandemic on March 11. (Trump declared a national emergency on March 13.)", "The second is Forbes’ \"The World’s Real-Time Billionaires,\" an online list that tracks the net worth of billionaires using that day’s stock prices and exchange rates.", "For its analysis, the group compared the two, and linked to a spreadsheet that showed the change in the billionaires’ net worth between March 18 and Sept. 15 was $845.1 billion.", "To be sure, not all billionaires gained during the time period, and not all billionaires listed had net worth numbers associated with them.", "But the overall change tracks well with what Biden said.", "That said, there is a wrinkle to discuss.", "The data used by the think tank roughly covers the period from when the coronavirus was formally declared a pandemic.", "But by that point, the coronavirus had been spreading around the globe for several months -- and already had an effect on stock prices and wealth. While there is no measuring stick available to begin the tally from January, it’s safe to say that picture would be somewhat different.", "The Institute for Policy Studies did not respond to email requests for comment from PolitiFact Wisconsin.", "But Timothy Smeeding, a University of Wisconsin-Madison professor of public affairs, noted there was some decline in the stock market prior to that low point at the end of March. Since then, it has overall been improving.", "So, the study only looks at gains during the bounceback from a very low point in the market. That may serve to exaggerate the growth during the pandemic at least to some degree.", "Citing a study, Biden claimed that billionaires in America saw their net worth grow by $800 billion during the pandemic.", "That number tracks with what the study found. And, while the dates in the study do not match up perfectly with when the coronavirus was declared a pandemic, they are close.", "That said, the effects of COVID-19 on things such as the stock market were being felt before the pandemic declaration, so the timetable being used may exaggerate the growth a bit because it uses a low starting point.", "Our definition for Mostly True is \"the statement is accurate but needs clarification or additional information.\"", "That fits here.", "Joe Biden, speech at the Wisconsin Aluminum Foundry, Sept. 21.", "Forbes, \"The Richest in 2020,\" April 7.", "Forbes, \"The World’s Real-Time Billionaires,\" accessed Sept. 25.", "Institute for Policy Studies, \"Billionaire Bonanza 2020 Updates\", Sept. 18.", "Phone interview with Timothy Smeeding, Sept. 25.", "Email with Laura Dresser, Sept. 25.", "Email from Forbes editor Kerry Dolan, Sept. 25.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]