["About this rating", "In November 2019, we started receiving queries about a Travel Channel television \"documentary\" called \"Helltown\" that supposedly showed the strange goings-on in an abandoned town in Ohio. Among other things, this show claimed that this town was the site of a \"cult compound shooting\" that left 14 people dead in the 1960s, that a teenager mysteriously disappeared after entering a restricted area in 2016 and was most likely eaten by a Wendigo (a mythological creature), and that a military operation in the area went haywire after the soldiers stumbled upon a group of occultists.", "We'll point out some specific inaccuracies throughout this article, but by and large \"Helltown\" is a work of fiction. This is a scripted piece of entertainment and not a genuine documentary. The experts, townspeople, police officers, and even the soldiers in the \"archival\" or \"found footage\" are actors.", "\"Helltown\" first aired on the Travel Channel just before Halloween in 2017, but it still frequently gets re-aired. Here's a trailer for the movie. It starts with a brief disclaimer noting that \"this story is inspired by accounts of a real American town that has been abandoned for more than 40 years.\" It isn't until the final frames of the film, however, that the Travel Channel reveals that \"certain events in this film are fictional\":", "None of the institutions or agencies that appear in the film are affiliated or associated with it in any way, nor have approved its contents. Any similarities in the film to actual persons, living or dead, is entirely coincidental.", "Though certain events in this film are fictional, the town of Boston, Ohio was real, and was forcibly evacuated by the United States Government in 1975.", "Travel Channel's disclaimer goes on to say that the \"reports of Paranormal and Occult Activity in the town are real, and have been cited as a possible reasons for the 1975 evacuation,\" and that \"conspiracy theorists continue to debate why the U.S. Government evacuated Boston, Ohio.\"", "While this Travel Channel special states that it is based on real \"reports\" and rumors, it also peddles a number of outright falsehoods. For instance, a 16-year-old was not killed by a Wendigo (or a bear) in 2016, authorities did not kill 14 people during a shootout with a cult, and two children did not mysteriously vanish from the area.", "This article is not meant to be a comprehensive list of every misleading detail included in the \"Helltown\" show. Rather, we're going to point out how some of the \"evidence\" was manufactured in order to show that this \"documentary\" is really just a work of fiction.", "What's the real story about \"Helltown\"?", "In 1974, Congress passed Public Law 93-555, which allowed the federal government to acquire land in order to establish the Cuyahoga Valley National Recreation Area. Boston Township in Ohio was one piece of land that was acquired for this project. Shortly after U.S. President Gerald Ford signed this legislation into law, the government started to purchase properties in Boston and forced people to move out of the newly designated national recreation area.", "The Frontline special \"For the Good of All\" took a look at how this legislation impacted the local population of Boston:", "When a national recreation site between Cleveland and Akron was first mandated by Congress in 1974, everyone applauded the project. But Frontline found that park policies of condemning hundreds of businesses and homes soon generated intense local opposition as well as charges that the homes of politically influential citizens were being spared.", "The government purchased hundreds of homes with the hopes of turning the area into a national park, but the project quickly fell behind schedule. As houses sat abandoned and vacant for years, urban legends about the area started to grow. Some claimed that the area was haunted, and that the government only purchased the land to cover up some sort of nefarious activity. Similar rumors spread, and soon the area became known as \"Helltown.\"", "According to Atlas Obscura, the last of the abandoned buildings of \"Helltown\" were torn down in 2016.", "What does the Travel Channel special \"Helltown\" get wrong?", "It's true that a number of houses were left abandoned in the 1970s after the government acquired the area of Boston Township in Ohio in 1974 to develop the Cuyahoga Valley National Recreation Area. While this historical event serves as the starting point for this show, \"Helltown\" quickly veers off into the world of fiction.", "The \"experts\" in \"Helltown\" are actors.", "For starters, the main expert in this \"Helltown\" video is presented as a professor of folklore and mythology at Cuyahoga Community College named Paul Wyndham:", "But this is not a \"professor of folklore.\" This is an actor. We reached out to Cuyahoga Community College and we were told that there was no \"Paul Wyndham\" on staff. Furthermore, according to a spokesperson for the college, Wyndham doesn't even pronounce \"Cuyahoga\" correctly in the film.", "This character is being played by actor Dave Evans, who apparently has a penchant for playing \"experts\" in pseudo-science documentaries. In 2012, he played \"Dr. Paul Robertson, former NOAA scientist,\" in Animal Planet's pseudo-documentary \"Mermaids: The Body Found.\"", "\"Helltown\" presents a number of other characters as if they were \"locals\" from the area. Again, however, these are just actors. The most misleading use of an actor comes from the \"archival\" footage that was supposedly unearthed during the making of this mockumentary. While conspiracy theorist Terry Greenbaum (played by actor Darren White) presents this footage as if it were taken in 1975 — the footage is preceded by a title card reading \"The following is an edited version of the raw 16mm footage recovered from Jack Writer's Camera Magazine, Filmed in 1975\" — it actually features modern footage of actor Michael Lipka.", "A 16-year-old was not eaten by a Wendigo (or a bear) in 2016.", "One outlandish claim in the movie is that a teenager was killed by a \"Wendigo,\" a mythological man-eating creature, in 2016. In addition to claiming that a teenager was killed, \"Helltown\" also claims that authorities covered up the truth about the mythical man-eater by blaming a bear for the teen's death.", "While this anecdote is presented in the form of a news report, this is just another staged production. This section (which appears around the 10-minute mark) features a fictional police official named Capt. Marie Hutchinson and stock footage of a deceased bear. There is also not a \"WBOH News\" channel in Ohio.", "We were unable to find any credible reports about a 16-year-old who was killed by a bear (or a Wendigo) in Cuyahoga National Forest in 2016. It appears that this rumor was made up out of whole cloth.", "Two children did not disappear in \"Helltown.\"", "At one point in this \"documentary,\" the filmmakers blame the disappearance of two children from Boston Township on a local cult. As evidence, they show what appears at first glance to be a newspaper clipping:", "This image, however, doesn't feature two children who went missing in Boston Township. Both of these images were taken from modern stock photographs:", "A shootout at a cult compound did not result in 14 deaths.", "A second fake newspaper clipping is also featured in the \"Helltown\" movie. This time, a doctored newspaper clipping is used to push the false claim that 14 people were killed in a shootout between authorities and the \"WW Cult.\"", "This is not a genuine newspaper, and the featured photograph does not show the \"compound headquarters\" of the WW Cult. This image actually shows a rural farm in the Czech Republic.", "\"Helltown\" is a work of fiction.", "In sum, the federal government in 1974 started to acquire land in Ohio to develop the Cuyahoga National Recreation Area, an actual place. This forced the residents of Boston Township to move, leaving a number of homes and buildings vacant, which eventually led to rumors about paranormal and occult activity in the area.", "While some people may truly believe that the area of \"Helltown\" is haunted, the majority of anecdotes included in this Travel Channel special are completely scripted fabrications being re-told by actors. A 16-year-old was not eaten by a Wendigo, two children did not mysteriously disappear, and authorities did not kill 14 people during a shootout. These incidents, as stated in the disclaimer at the close of this Travel Channel special, are completely \"fictional.\" We therefore rate the claim of strange happenings in this town as \"False.\"", "Atlas Obscura.   \"Helltown, Ohio.\"\r\n    Retrieved 25 November 2019.", "Didymus, John Thomas.     \"Is Helltown Real or Fake? Was Ohio Teenage Girl Killed in Wendigo Attack?\"\r\n    Monsters and Critics.   23 September 2019.", "My Strange and Spooky World.   \"Destination America Ignores, Rewrites History with Helltown.\"\r\n    9 January 2018.", "Vorel, Jim.   \"‘Mermaids: The New Evidence’ is the Worst Thing I’ve Ever Seen on TV.\"     Herald and Review.   30 May 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]