["President Donald Trump walks on the South Lawn at the White House in Washington on June 25, 2020. (AP/Brandon)", "The President’s Daily Brief, or PDB, is the primary daily intelligence report prepared before dawn for the president and other designated administration officials.", "There is no set length or format for the PDB, which has varied from one administration to the next since it first came into practice under President Harry Truman.", "David Priess, a former CIA briefer and author of a book on the PDB, said the PDB is rarely longer than 25 pages. It is segmented into “articles” and often includes visuals.", "Reports that Russia offered bounties to Taliban-linked militants to kill U.S. troops in Afghanistan have shined a new light on the daily intelligence report prepared before dawn for the president — and President Donald Trump’s willingness to engage with it.", "The White House has said Trump was never orally briefed on the threat, but warnings that a Russian intelligence unit placed bounties on American forces appeared in the President’s Daily Brief, called the PDB, according to multiple news reports.", "The New York Times and Politico reported that the information was in a February PDB. The Associated Press said it appeared in 2019.", "Trump is not known to look through the PDB regularly or read it to completion, as several news organizations have reported since he took office in 2017. He relies instead on oral briefings that he receives from intelligence officials every few days.", "Former National Security Adviser John Bolton wrote in his recently released memoir that \"Trump generally had only two intelligence briefings per week, and in most of those, he spoke at greater length than the briefers, often on matters completely unrelated to the subjects at hand.\"", "Now, as questions mount about Trump’s intelligence consumption habits — and whether he read the brief that discussed the Russian bounties — some of his cable news allies have stepped to his defense, suggesting the PDB documents are extraordinarily long.", "\"The president gets a President’s Daily Brief, which is like a mini novel, every single day,\" said \"Fox & Friends\" co-host Brian Kilmeade. \"So he gets verbally briefed, the highlights.\"", "Kilmeade may have accurately described how Trump gets his intelligence information. But his claim that the brief is \"like a mini novel\" mischaracterizes the length and style of the classified document that is meant to keep the president up to speed on critical national security matters.", "The White House did not respond to requests for comment. Fox News declined to comment.", "The PDB is a summary of high-level information and analysis on national security issues that is prepared daily for the president and other designated members of his administration, according to the Office of the Director of National Intelligence.", "The final product weaves together material provided by spies, surveillance, satellites, news reports and other sources of intelligence gathering.", "\"It gets the president spun up on relevant national security issues not only for that day, but for the week, month, or even year ahead,\" said Derek Grossman, a senior defense analyst at the RAND Corporation and former intelligence official who served in 2011 on the CIA staff that helped prepare the PDB for President Barack Obama.", "A version of the PDB has been furnished for every president since 1946, when President Harry Truman received what was then known as the Daily Summary, according to a history from the CIA. A number of PDBs from presidents John F. Kennedy, Lyndon Johnson, Richard Nixon and Gerald Ford have been declassified and are available on the CIA’s website.", "Today, the PDB is prepared by the Office of the Director of National Intelligence with the help of the CIA. Presidents are also assigned briefers who address any questions they have. Beth Sanner, the office’s deputy director of national intelligence for mission integration, regularly briefs Trump, reports say.", "The style and format of the PDB have varied from one administration to the next based on each president’s preferences, experts said. Obama was the first to request a digital version.", "There is no set length for the PDB, but it has rarely been less than one page or longer than 25 pages, said David Priess, a former CIA intelligence briefer under presidents Bill Clinton and George W. Bush and the author of \"The President’s Book of Secrets,\" a history of the PDB.", "Jeffrey T. Richelson, who was a senior fellow at George Washington University’s National Security Archive, wrote in a 2016 book on the intelligence community that the PDB was \"rather lengthy\" under Ford but \"reduced to a maximum of about 15 pages under Jimmy Carter.\"", "The PDB shrank to between nine and 12 pages under Clinton and then consisted of a half dozen or so one- to two-page articles under Bush, wrote Richelson, who died in 2017.", "This April 10, 2004, photo shows a copy on display in Crawford, Texas, of the first page of the declassified brief that President George W. Bush received August 6, 2001, on terrorist threats. (AP)", "Nixon is the last president who may have skipped reading the PDB, Priess said on Twitter. Before Trump took office, he claimed — falsely — that Obama didn’t read his PDB.", "Matt Olsen, the former director of the National Counterterrorism Center for three years in the Obama administration, said he typically got through the version of the PDB he received in a few minutes. The brief is divided into \"articles,\" which Olsen said are often bulleted and cover various issues.", "\"The PDB articles were very staccato, short-form,\" Olsen said. \"I’d say a page, sometimes a page and a half. And just a handful of articles made the cut to be (in) the PDB on a given day.\"", "The Office of the Director of National Intelligence and CIA declined to comment on the makeup of Trump’s written PDB. Citing two anonymous administration sources, USA Today reported that it can be anywhere from 18 to 75 pages and often features graphics, charts and bullets.", "Trump told Axios before taking office, \"I like bullets or I like as little as possible.\"", "\"My understanding is that the current PDB is comprised of very few words and mostly contains graphics to more effectively engage the president,\" said Grossman, the RAND analyst.", "While PDB articles can be dense, they don’t likely approach the length of novels and novellas. The PDB’s shorter length, coupled with the fact that it binds together reports on various issue areas, suggests that it would be more comparable in complexity to a magazine.", "Multiple awards for works of science fiction consider novels to be greater than 40,000 words and novellas over roughly 17,000 words, for example. The PEN/Bellwether Prize for Socially Engaged Fiction accepts only submissions over 80,000 words as novels.", "Grossman said he would not characterize the PDB as a \"mini novel,\" as Kilmeade did. \"The PDB is a series of articles (or graphics) that tell distinct and self-contained stories for the president and other recipients,\" Grossman said in an email.", "The PDB is \"definitely not a mini novel,\" added Olsen, the former director of the National Counterterrorism Center. \"It’s written for somebody who is a busy person.\"", "Kilmeade said the President’s Daily Brief \"is like a mini novel.\"", "The PDB is the primary written intelligence product prepared for the president each working day. Little is known about the contents of Trump’s PDB, which reports say he doesn’t always read.", "The top-secret document is written for quick consumption, experts said. It is not as long as a typical novel or novella.", "We rate this statement False.", "Fox News, \"Fox & Friends,\" July 2, 2020", "Media Matters for America, \"Fox & Friends host on Trump not reading the Presidential Daily Brief: It is 'a mini-novel every single day,'\" July 2, 2020", "Office of the Director of National Intelligence, \"WHAT IS THE PDB?,\" accessed July 2, 2020", "Central Intelligence Agency, \"President's Daily Brief,\" accessed July 2, 2020", "Central Intelligence Agency, \"The Evolution of the President's Daily Brief,\" accessed July 2, 2020", "The Associated Press, \"Only Verified Intelligence? A Look at Presidents’ Briefings,\" July 2, 2020", "USA Today, \"What to know about how Trump gets, or doesn't get, intelligence briefings,\" July 1, 2020", "Politico, \"Russia bounty flap highlights intel breakdown under Trump,\" July 1, 2020", "The New York Times, \"Suspicions of Russian Bounties Were Bolstered by Data on Financial Transfers,\" June 30, 2020", "CNN, \"White House says Trump reads amid questions about his handling of intelligence briefing,\" June 30, 2020", "CNN, \"White House was warned about potential Russian bounties for killing US troops in early 2019,\" June 30, 2020", "The Washington Post, \"2 things that seem to explain Trump’s ignorance about Russia’s bounties on U.S. troops,\" June 30, 2020", "David Priess on Twitter, June 30, 2020", "The Washington Post, \"Republican lawmakers confirm intelligence reports on Russian operation to target U.S. troops but say material needs further review,\" June 29, 2020", "The New York Times, \"Trump Got Written Briefing in February on Possible Russian Bounties, Officials Say,\" June 29, 2020", "The Associated Press, \"AP sources: White House aware of Russian bounties in 2019,\" June 29, 2020", "David Priess on Twitter, June 29, 2020", "The Washington Post, \"Russian bounties to Taliban-linked militants resulted in deaths of U.S. troops, according to intelligence assessments,\" June 28, 2020", "The New York Times, \"For Spy Agencies, Briefing Trump Is a Test of Holding His Attention,\" May 21, 2020", "John Bolton, \"The Room Where It Happened,\" 2020", "War on the Rocks, \"Adapting the President’s Daily Brief to Trump,\" Jan. 6, 2017", "Lawfare, \"Presidential Intelligence Briefings: The Process Is Working. But Is Trump Listening?\" Feb. 15, 2018", "The Washington Post, \"Breaking with tradition, Trump skips president’s written intelligence report and relies on oral briefings,\" Feb. 9, 2018", "American Enterprise Institute, \"Intelligence Beyond 2018: A Conversation with CIA Director Mike Pompeo,\" Jan. 23, 2018", "Mother Jones, \"Exclusive: Classified Memo Tells Intelligence Analysts to Keep Trump’s Daily Brief Short,\" Feb. 16, 2017", "Axios, \"Reality bites: Trump's wake-up call,\" Jan. 18, 2017", "The New York Times, \"What Is the President’s Daily Brief?,\" Dec. 12, 2016", "Jeffrey T. Richelson, \"The US Intelligence Community, Seventh Edition,\" 2016", "Email interview with Derek Grossman, a senior defense analyst at the RAND Corporation and an adjunct professor of the practice of political science and international relations at the University of Southern California, July 6, 2020", "Email interview with David Priess, former CIA intelligence briefer and author of \"The President’s Book of Secrets: The Untold Story of Intelligence Briefings to America’s Presidents\" July 2, 2020", "Phone interview with Matt Olsen, lecturer at Harvard Law School and the former director of the National Counterterrorism Center, July 2, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]