["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Barack Obama touted his energy strategy during his State of the Union speech.", "He called for safe extraction of natural gas, reducing our dependence on foreign oil and setting new standards for trucks -- and he shined a spotlight on solar power.", "\"It’s not just oil and natural gas production that’s booming; we’re becoming a global leader in solar, too,\" Obama said. \"Every four minutes, another American home or business goes solar; every panel pounded into place by a worker whose job can’t be outsourced.\"", "That timetable sounded like a rapid expansion of solar: Does a home or business go solar every four minutes? We’ll shed a little light on this claim.", "Solar expansion", "Obama’s claim came from Greentech Media (GTM), which published the statistic in August in its Solar Market Research Report, a project with the Solar Energy Industries Association. GTM provides quarterly and annual reports that contain solar-specific analysis and forecasts for industry professionals.", "A GTM chart shows how solar installations have rapidly increased in recent years from one every 80 minutes in 2006 to one every four minutes in 2013.", "\"A lot happens in America every four minutes,\" wrote GTM  in an August blog about their research. \"During that short time period, 30 babies are born, 4,080 McDonald's Big Macs are consumed, and 48,000 tons of CO2 are emitted. And as it turns out, the U.S. is now installing one solar photovoltaic (PV) system every four minutes as well. If market growth continues at its current pace, the American solar industry could be installing a system every minute and twenty seconds by 2016.\"", "Every quarter GTM collects the number of solar installations from utilities and state agencies. Researchers get data from 28 states (including Florida ) which represents about 97 percent of the market and devise an estimate for the remaining states, said Shayle Kann, senior vice president of research. GTM has been tracking the solar market since 2009 and collected this particular detailed data since 2010. (Kann said that the U.S. Energy Information Administration has some data on solar installations but not to the level of detail that GTM requires for quarterly reports.)", "In 2013, there were about 132,000 installations, and there were 525,600 minutes, so the math works out to about one installation every four minutes. GTM is finalizing the number of installations in 2013 -- GTM says it’s possible it could have been higher.", "Part of the reason for the rapid growth is that the cost of solar panels and installation has dropped, Kann said.", "Experts on alternative energy generally agreed with GTM’s research but offered some caveats.", "\"Solar is growing, but from a very small number...,\" said Christopher Bronk, director of the Program on Energy and Cybersecurity at Rice University. According to the  November electric power monthly report from the Energy Information Administration, \"PV solar energy accounts for about 1.5 percent of all electricity generated from renewable sources and .2 percent percent of all the electricity generated.\"", "And not surprisingly, solar is more common in some states than others.", "\"As you move to places with a lot more cloud cover, let’s say Washington, D.C., then solar energy isn’t going to work as well,\" said Stephen P.A. Brown, an expert in energy economics at the University of Nevada. \"Unless there is some huge change in technology it’s not projected to be the dominant form of energy any time soon or in fact ever.\"", "Our ruling", "During the State of the Union, Obama said, \"Every four minutes, another American home or business goes solar.\"", "Obama obtained that figure from an August report from Greentech Media. Solar has been expanding, but it remains a small slice of the overall market.", "We rate this claim True.", "Greentech Media Research, U.S. Solar Market Insight Report, Third quarter 2013", "Greentech Media, \"A solar system is installed in the US every four minutes,\" Aug. 19, 2013", "Solar Energy Industries Association, Solar Market Insight, Third quarter 2013", "Reuters, \"U.S. utilities face German-style solar burn,\" Jan. 3, 2014", "Solar Foundation, \"National solar jobs census 2013,\" Jan. 27, 2013", "Forbes, \"All-of-the above (but no coal or nukes): Decoding Obama’s encrypted SOTU energy comments,\" Jan. 28, 2014", "PolitiFact, \"Fact-checking Obama’s 2014 State of the Union,\" Jan. 29, 2014", "PolitiFact, \"Charlie Crist says we’re the Sunshine State but ‘we’re hardly doing any solar production,’\" Dec. 3, 2013", "PolitiFact’s Obameter, \"Invest in all types of alternative energy,\" Last update Feb. 20, 2009", "Interview, Shayle Kann, senior vice president of research Greentech Media, Jan. 29, 2014", "Interview, Stephen Lacey, senior editor, Greentech Media, Jan. 29, 2014", "Interview, Ken Johnson, spokesman for Solar Energy Industries Association, Jan. 29, 2014", "Interview, Christopher Bronk, Director, Program on Energy and Cybersecurity, Center for Energy Studies at Rice University, Jan. 29, 2014", "Interview, Stephen P. A. Brown, Professor of Economics and Director of the Center for Business and Economic Research at Lee Business School University of Nevada, Jan. 29, 2013", "Interview, Joel Darmstadter, Senior Fellow, Resources for the Future, Jan. 29, 2014", "Interview, Matt Lehrich, spokesman White House, Jan. 29, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]