["A video of a young Indian boy speaking on a talk show has been shared widely by Facebook users with the claim that he has been appointed by tech giant Google at an impressive salary of Rs.66 lakh per month. The narrative accompanying the video says,", "“Mr.Tanmai Bakshi, an Indian aged 13 Years (Entering into class 9) Has Been Appointed By GOOGLE USA At a Salary of Rs.66 Lakhs per Month.Please Watch His Interview With Co.Officials..What A Confidence…He Replies With Such A Poise…Authority…Simply Superb…That’s Why They Say..God’s Creations are Amazing At Times…Super Sharp..Brain He Has.. Really Wonder Boy”.", "Mr.Tanmai Bakshi, an Indian aged 13 Years (Entering into class 9) Has Been Appointed By GOOGLE USA At a Salary of Rs.66 Lakhs per Month.Please Watch His Interview With Co.Officials..What A Confidence…He Replies With Such A Poise…Authority…Simply Superb…That’s Why They Say..God’s Creations are Amazing At Times…Super Sharp..Brain He Has.. Really Wonder Boy : 👆🌷🌿", "Posted by Kailash Chandra on Tuesday, July 23, 2019", "The above video was posted on July 23 by an individual user and has been viewed over 24,000 times so far. Several individual users have posted the video on their Facebook timelines with identical text.", "On YouTube too, several videos have been posted with the claim that Google has hired Tanmay Bakshi for a whopping sum. The video posted below, for instance, claims that Tanmay’s package is Rs. 1.40 crore per month! The video was posted in April 2019 and has already been viewed over 1.7 million times.", "The young boy seen in the video is indeed Tanmay Bakshi. 15 year old Tanmay is a Canadian national and a child prodigy. Tanmay began coding at the age of 5 and developed his first app for the Apple (iOS) store at the age of 9. He currently works in collaboration with IBM. His Twitter bio describes him as a software developer and an author. Tanmay is also a popular YouTuber with a significant following of over 300,000. He mostly posts tutorials on coding and web development.", "The social media claim, that Tanmay Bakshi has been hired by tech giant Google for a whopping salary of Rs.66 lakh per annum, is false. This was confirmed by Tanmay himself via a tweet in 2017, suggesting that this rumour has been active since then.", "For those who think I’m working with @Google or @facebook, I’m not – although I’d love to 🙂", "— Tanmay Bakshi (@TajyMany) September 2, 2017", "The claim accompanying the video, that it represents an interview conducted by Google, too is false. Tanmay Bakshi had appeared on a talk show called The AM Show on a channel in New Zealand in August 2017 where he had spoken at length about Artificial Intelligence (AI) and programming. The video was posted by Tanmay on Twitter.", "Loved being @TheAMShowNZ https://t.co/fGUEN33rzn@IBMWatson‘s GrandChallenge – @Jeopardy#AskTanmay‘s(Watson+BiDAF @allenai_org) – @KBCsony? pic.twitter.com/gzbaYqxlVh", "— Tanmay Bakshi (@TajyMany) August 23, 2017", "It may be reiterated that the aforementioned claim about Tanmay Bakshi and Google is false.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]