["About this rating", "In February 2016, a rumor began to spread that iPhones and iPads contain a nifty Easter egg: If you set the date of your Apple product to 1 January 1970 then reboot, it will bring up a retro-themed menu based on the old Apple computer operating systems.", "Text on the image read:", "Blast from the past", "The original Macintosh introduced the world to computers, forever changing the way people experience technology, and allowing people to do things that were never possible before. With this easter egg, warp back in time with a class Macintosh theme to relive the magic on your iPhone. Change the date on your iPhone to January 1, 1970, press and hold the power button to reboot your device, and prepare for a wild ride!", "As cool as this might look, it’s a hoax, and a particularly nasty one at that. Resetting your phone’s date that far back will so thoroughly confuse your phone or tablet’s operating system that you’ll either need to take it to the Apple store for a replacement, or just buy a whole new phone or tablet:", "If you're worried about doing this by accident, don't. Setting the date on your phone is an onerous and time-consuming process, so there’s not much of a chance that you could accidentally brick your phone. However, it’s possible — at least in theory — that someone with time and malicious intent could trick a phone connected to a network into resetting its date by pretending to be a time server.", "The date bug affects iPhones, iPads and iPod touches with 64-bit processors running iOS 8 or iOS 9. Apple says it’s looking into the bug. According to the Guardian, users can protect themselves with a series of tweaks, such as manually setting their time and date, not enabling automatic time changes, and not turning off their iPhone or iPads.", "If you must have an old-school theme for your tablet or phone, fear not: they do exist! (Of course, all caveats about downloading third-party apps and jailbreaking your device do apply.) It's worth noting, by the way, that the very first Apple computer, the Apple I, came out not in 1970, but in 1976.", "On 15 February 2016, Apple confirmed that the bug exists, and said that an upcoming software update will address the issue.", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]