["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As Democrat Tim Kaine campaigns for the Senate, Republicans are hoping to link him with the stimulus bill passed by Congress in 2009.\n\nKaine was governor of Virginia and had just become chairman of the Democratic National Committee when President Barack Obama signed the American Recovery and Reinvestment Act on Feb. 17, 2009. The National Republican Senatorial Committee, which works to elect Republicans to the Senate, is saying the stimulus failed to put Americans back to work.\n\n\"President Obama and liberal former DNC Chairman Tim Kaine’s $787 billion stimulus failed to create jobs,\" the NRSC said in a June 3 press release.\n\nDid the stimulus really fail to create jobs? Lots of Republicans are saying that, and we thought we’d take a look.\n\nChris Bond, a spokesman for the NRSC, said the statement is based on Kaine’s assurances in February 2009 that the stimulus would save or create 3 million jobs. Bond also noted that the unemployment rate is at 9.1 percent and has been above 8 percent for 28 months in a row.\n\nBut the NRSC press release says nothing about 3 million jobs. The statement simply charges that the stimulus \"failed to create jobs.\" This is an old Republicans charge. Earlier this month we gave House Majority Leader Eric Cantor, R-7th, a False rating when he said the stimulus \"failed to get people back to work.\"\n\nLet’s review some of the evidence we found then.\n\nThe White House has posted on its stimulus website a listing of jobs funded by the stimulus, breaking it down by state and congressional district. Between February 17, 2009 and March 31, 2011, the U.S. had a reported 573,510 full-time equivalent jobs funded by stimulus fund contracts, grants and loans, which account for one-third of the cost of the stimulus.\n\nVirginia had a reported 11,446 full-time equivalent jobs funded by the stimulus fund contracts, grants and loans.\n\nWhite House data shows the bulk of the Virginia jobs -- 7,203 full-time equivalent positions -- were in downtown Richmond where the state government relied on stimulus funds to balance budgets from 2009 to 2011. That number may paint an exaggerated picture, however, because the state parceled much of the stimulus money to localities to help support schools.\n\nCharles Pyle, a spokesman for the state’s department of education, said that as of January 2011, Virginia school divisions reported they had saved 5,692 jobs and created another 926 jobs using stimulus money.\n\nA March report by the president’s Council of Economic Advisers estimated that between 2.5 million and 3.6 million jobs were created or saved by the stimulus through the fourth quarter of 2010.\n\nSeparately, the council’s report cited four independent analyses by the Congressional Budget Office and three private economic analysis companies. Here’s what the groups found:\n\n*CBO: Between 1.3 million and 3.6 million jobs saved or created.\n\n*IHS/Global Insight: 2.45 million jobs saved or created.\n\n*Macroeconomic Advisers: 2.3 million jobs saved or created.\n\n*Moody’s Economy.com: 2.5 million jobs saved or created.\n\nA side note: We also found it a stretch that the NRSC is giving Obama and Kaine equal ownership of the stimulus. Kaine was governor in 2009 and never voted on the bill nor participated in its drafting. Later, he did emerge as a key spokesman for stimulus as Obama’s hand-picked DNC chairman.\n\nLet’s review.\n\nThe NRSC says the stimulus  \"failed to create jobs.\"\n\nThe stimulus may  not have created as many jobs as Republicans and Democrats hoped. But there’s no doubt it put many people back to work and preserved the jobs of many more. We rate the NRSC statement False.", "National Republican Senatorial Committee, Unemployment rises to 9.1 percent in wake of Kaine and Obama’s failed $787 billion stimulus, June 3, 2011.\n\nBureau of Labor Statistics Current Population Survey, accessed June 2, 2011.\n\nE-mail interview with Chris Bond, spokesman, National Republican Senatorial Committee, June 16, 2011.\n\nCongressional Budget Office Report, \"Estimated impact of the American Recovery and Reinvestment Act on employment and economic output from January 2011 through March 2011,\"May 2011.\n\nCongressional Budget Office report, \"Estimated impact of the American Recovery and Reinvestment Act on employment and economic output from October 2010 through December 2010,\" February 2011.\n\nFiscal Times, \"Bernanke defends stimulus; takes Boehner to task,\" May 12, 2011.\n\nVirginia state government,stimulus bill spending, accessed June 1, 2011.\n\nWhite House, stimulus bill spending, accessed May 31, 2011.\n\nPolitiFact Florida, \"Rick Scott says the stimulus did not create a single private sector job,\" Sept. 17, 2010.\n\nPolitiFact national article, \"Obama says stimulus is responsible for 2 million jobs created or saved,\" February 17, 2010.\n\nPolitiFact national article, \"Scott Brown says stimulus ‘didn’t create one new job’, February 18, 2010.\n\nTestimony of Mark Zandi, chief economist at Moody’s Economy.com, before the Joint Economic Committee, Oct. 29, 2009.\n\nTalking Points Memo, Tim Kaine to stimulus-hungry, stimulus-hating GOPers: you’re hypocrites, Feb. 17, 2010.\n\nThe Washington Examiner, Kaine: Stimulus has generated over $1 billion for Va. infrastructure, July 21, 2009.\n\nUnited States Congress, H.R. 1: American Recovery and Reinvestment Act of 2009, Feb. 17, 2009.\n\nReport by incoming White House economists Christina Romer and Jared Bernstein, \"The job impact of the American Recovery and Reinvestment Plan,\" January 9, 2009.\n\nCNN, Kaine officially becomes DNC chair, Jan. 21, 2009.\n\nThe Daily Press, Gov. Kaine endorses Obama, Feb. 17, 2007.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]