["The one-minute 19-second video was published on Weibo here on June 28, 2020. It has since been viewed more than 440 times.", "The video’s simplified Chinese caption translates to English as:\n\t“/Oh god! The rain in Chongqing is way too heavy this year!\n\t\"Car and people got trapped, should have rescued people without caring about the car!\n\t\"Can't give up property rather than lives!\n\t\"People from the car were all washed away by the flood!”", "Chongqing and other cities in southern China experienced major storms in late June 2020. The heavy rain killed at least 12 people and sparked mass evacuations, as AFP reported here.", "The video was also shared alongside a similar claim on Facebook here and here, and on Twitter here, here and here.", "The claim is false.", "A reverse image search with video keyframes found the same footage was published here by FM1035 Huzhou Traffic Radio on September 12, 2017.", "The article states that an off-road vehicle was washed into a river in Guizhou province on the afternoon of August 30, 2017. The footage shared in the misleading posts can be seen in the article’s embedded video in the first eight seconds. It can also be seen from the 55-second mark to the one-minute six-second mark.", "Below are two sets of comparisons between the video in the misleading Weibo post (L) and the video included in the Chinese media article (R):", "The same incident was also reported on in 2017 by other Chinese media organisations, including here by the news site The Paper and here by Beijing Youth Daily.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]