["About this rating", "A photograph purportedly showing President Trump kissing former U.S. Senator Bob Dole on the forehead was circulated on social media in the days following the funeral of former president George H.W. Bush in December 2018:", "The internet's interest in this image, and Bob Dole in general, spiked in December 2018 after the 95-year-old politician rose from his wheelchair in order to salute Bush's casket. (Dole was gravely wounded by an artillery shell during World War II that left him with permanent disabilities.)", "Although this photograph is genuine, some viewers may have been left with the inaccurate impression that it was taken during Bush's funeral.", "The picture of Trump's kissing Dole on the forehead was actually taken in January 2018 during a ceremony held in the Capitol Rotunda, upon which occasion the former senator was bestowed with a Congressional Gold Medal. The original is available via UPI, who display it with the following caption:", "During a ceremony in the Capitol Rotunda, Dole was presented Congress' highest civilian honor by President Trump, Vice President Pence and Senate and House leaders.", "President Trump kisses World War II veteran and former Senate majority leader Bob Dole as he received the Congressional Gold Medal, the highest civilian honor, \"in recognition of his service to the nation as a soldier, legislator, and statesman.”", "Przybyla, Heidi.   \"Former Senator Bob Dole Receives Congressional Gold Medal in Capitol Ceremony\r\n    USA Today.   17 January 2018.", "Cole, Devan.   \"Bob Dole Helped Out of His Wheelchair to Salute George H.W. Bush.\"\r\n    CNN.   4 December 2018.", "Uria, Daniel.   \"'True American Hero' Bob Dole Receives Congressional Gold Medal.\"\r\n    UPI.   18 January 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]