["About this rating", "In May 2017, several hyperpartisan web sites reported that President Donald Trump had \"reinstated\" a day of commemoration for fallen police officers, after it was purportedly cancelled by his predecessor Barack Obama.", "On 6 May 2017, the USA For Americans web site published the claim:", "Obama didn’t want to offend anyone, so our country’s heroes were shut out. not anymore.", "President Trump made Barack Obama look like a complete fool this morning in front of more than 10,000 police veterans when he announced that he would reinstate a national day of remembrance for fallen officers that the traitor before him had done away with.", "Similar versions of the story also appeared on TheExaminer.site and Guerilla.news, also known as Guerilla Patriots.", "Peace Officers Memorial Day, as it is properly known, falls on 15 May. It was never cancelled or curtailed by President Obama, so the premise of these articles is entirely false.", "In the following video, Obama delivers remarks on Peace Officers Memorial Day in 2015:", "He did the same in 2010, 2012, and 2013", "Furthermore, every version of the article includes the following fabricated quotation from Donald Trump:", "Police officers in this country will no longer be treated like criminals. Obama decided your fallen didn't deserve to be honored. That changes today. Americans will remember those that keep our streets safe big time.", "President Trump has never said that.", "Nor did he address \"more than 10,000 police veterans\" on 6 May 2017. He did make a speech at the National Peace Officers' Memorial Service on 15 May 2017, which you can watch here.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]