["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Billionaire Donald Trump sent this tweet to cast doubt on the enrollment numbers for the new health care program.", "News from President Barack Obama that 8 million people have signed up for health insurance plans through state and federal marketplaces has drawn plenty of skepticism from the program’s critics. On Friday, billionaire and occasional presidential contender Donald Trump tweeted that the president’s claim is based on a fundamental deception.", "\"ObamaCare enrollment lie: Obama counts an enrollee as a web user putting a plan in ‘their online shopping carts’,\" read Trump’s tweet.", "Anyone curious about the first real test of the health care law is waiting to see how many people actually pay their first premium, so we thought it would be helpful to check the accuracy of Trump’s statement.", "There is a measure of truth to it, but it glides over many steps in the enrollment process.", "Applying for coverage", "We buy so many things online, it’s easy to think that buying health insurance through the government marketplaces follows a familiar pattern. You decide what you want to buy and then you pay for it. But getting health insurance coverage through an Obamacare marketplace is more complicated. Here’s a summary of the steps involved:", "Create an account", "Give the names and personal details for the people to be covered", "Provide Social Security numbers", "Report your household income", "List other insurance carried", "Option to explore Medicaid eligibility", "Report incarceration, recently gained immigration status, etc.", "Review and confirm accuracy of submitted information under penalty of perjury", "Select tax credit (if eligible) and report tobacco use", "Compare and select a plan -- plan details and monthly premiums displayed", "Confirm plan selection, access to your tax returns (if using tax credits)", "Submit application -- payment instructions", "The final screen on the federal site looks like this:", "Staff at the press office for the Centers for Medicare and Medicaid Services, the agency that handles Obamacare, told us that two things happen when this screen appears -- the government counts the person as enrolled and a data record called an 834 goes to the insurance company to start the billing process.", "If the person clicks the green button at the bottom to pay, what they will see depends on the insurance company. If the company accepts online payment, in theory, they will end up on the company’s payment page. Otherwise, they will get more details on the company’s billing process.", "The government doesn’t itself accept payments. The mechanics of paying take place between the buyer and the insurance company.", "At a couple of points in this process, the buyer clicks buttons that say \"Enroll,\" however, at the very end, they learn, \"Your payment must be received and processed by the effective date to be fully enrolled.\"", "Trump’s tweet included a link to an article on the conservative news website, Townhall.com. The article said \"The federal government counts people putting Obamacare plans in their online shopping carts as 'enrolled' before they pay for the plan or check out.\"", "A gradual path to full enrollment", "While it’s accurate that the government will count someone as enrolled before they have paid their bill, in a limited fashion, the insurance companies will also treat them as if they were.", "America’s Health Insurance Plans is a leading trade association for insurers. According to the AHIP press office, most states require a grace period of 30 or 31 days to give the company time to bill and the buyer time to pay. During that time, the health plan is required to pay claims, so long as the person ultimately pays the premium.", "Anyone who fails to pay after that first month has troubles.", "Jonathan Katz is an independent insurance broker in Northern Virginia. Katz told PunditFact that in his area, very few carriers accept online payments and typically, billing takes place through the mail.", "So far, Katz said the process has worked.", "\"The vast majority pay,\" Katz said. \"Why would you go through that long process and not pay?\"", "The Blue Cross Blue Shield Association, said that figures from early February show that 80 to 85 percent of new customers have paid their first premium. Other insurance companies have reported similar numbers.", "Our ruling", "Trump said that the administration lies about enrollment figures because it counts people when all they have done is put a plan \"in their online shopping carts.\"", "We've probably all put something in an online shopping cart, thought about it for a couple minutes, decided not to buy it and left it sitting there.", "If that same scenario occurs on healthcare.gov, does the White House consider a person enrolled?", "No. For a person to be considered enrolled, they must have submitted their application for health insurance. That information is transmitted to the federal government and the private insurance company.", "In a literal sense, that’s more than just popping something into an online shopping cart a la Amazon.", "Trump also is guilty of oversimplifying a highly regulated private industry. While some insurance companies accept online payments and give Obamacare enrollees the option to pay immediately, many do not. In the Virginia-Maryland market for example, most companies mail bills to the new customers who come through the government marketplaces. That means customers don’t even have the option of paying straight away.", "Also, while customers may not have paid, most states require a grace period of 30 or 31 days where insurers are required to pay claims.", "So maybe they don’t intend to pay and will eventually lose their coverage. But for now, they are treated as if they were enrolled. And they did a lot more than just load up an online shopping cart.", "We rate Trump’s claim False.", "Twitter, Trump tweet, April 18, 2014", "Townhall.com, Biden: That 7 Million Obamacare Enrollee Goal is Probably Not Going to Happen, Feb. 20, 2014", "White House, FACT SHEET: Affordable Care Act by the Numbers, April 17, 2014", "Virginia Medical Plans, How to Apply for Insurance on Healthcare.gov, Jan. 20, 2014", "Department of Health and Human Services, The Health Insurance Marketplace: What You Need to Know, Dec.4, 2013", "Centers for Medicare and Medicaid Services, Multimedia guide, Sept. 30, 2013", "Politico, So how many have paid ACA premiums?, March 13, 2014", "Interview, Richard Olague, spokesman, Centers for Medicare and Medicaid Services, April 18, 2014", "Interview, Jonathan Katz, independent insurance agent, Virginia Medical Plans, April 18, 2014", "Email interview, Klare Krusing, spokesperson, America’s Health Insurance Plans, April 21, 2014", "Email interview, Eric Lail, spokesperson, Blue Cross Blue Shield Association, April 21, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]