["About this rating", "On 18 June 2017, dubious web site The Daily Wire posted a story reporting that former President Barack Obama was \"silent\" about a shooting that targeted Republican members of Congress, but broke his silence to praise a \"former drug dealer.\"", "The story reads:", "Former president Barack Obama has been shooting his mouth off about everything lately.", "He doesn't like President Trump's plan to build a wall on the U.S.-Mexican border, hates his new budget proposal and really can't stand the Republican plan to overhaul Obamacare. On each topic, Obama has been highly vocal, seeking out media coverage.", "But when a Republican congressman was shot and badly wounded last week during a practice for a bipartisan congressional baseball game — silence. Not a peep.", "Yet Obama did reappear to praise former crack cocaine dealer and one-time thug Jay-Z in a video for his induction into the Songwriters Hall of Fame.", "Republican members of Congress had been practicing for a charity baseball game on 14 June 2017 at a park in Alexandria, Virginia, when a gunman targeted them and opened fire, critically wounding Majority Whip Steve Scalise of Louisiana and also injuring others including a U.S. Capitol police officer, a staffer and a lobbyist.", "Obama had, on the day of the shooting, called Sen. Jeff Flake (R-Arizona), who had been at the park but escaped gunfire. The 44th president offered his \"best wishes and prayers\" to the victims, Politico reported:", "\"This is particularly raw for those of us in Arizona,\" Flake told reporters of Tuesday's shooting, adding that Obama asked him to let Scalise know the former president is thinking about him. \"He went through this a couple of times,\" Flake added of Obama.", "We confirmed with Flake's spokesman that the call took place and that the Politico report accurately represented it.", "The former president also made a video inducting Jay Z, whose real name is Shawn Carter, into the Songwriters Hall of Fame on 15 June 2017. Carter is the first hip hop artist to be inducted. Jay Z has said he dealt drugs as a teen before finding success in the music industry (he is now 47 years old). In a 2013 interview with Vanity Fair, he said:", "I know about budgets. I was a drug dealer. To be in a drug deal, you need to know what you can spend, what you need to re-up. Or if you want to start some sort of barbershop or car wash — those were the businesses back then. Things you can get in easily to get out of [that] life. At some point, you have to have an exit strategy, because your window is very small; you’re going to get locked up or you’re going to die.", "In the recorded speech, the former president congratulated Carter and gave a nod toward their shared difficult beginnings, saying:", "I like to think Mr. Carter and I understand each other. Nobody who met us as younger men would have expected us to be where we are today. We know what it’s like not to have a father around. We know what it’s like not to come from much, and to know people who didn’t get the same breaks that we did. And so we try to prop open those doors of opportunity so that it’s a little easier for those who come up behind us to succeed as well.", "The premise of the Daily Wire article, that former President Barack Obama was mum about the Virginia shooting, favoring instead a \"former drug dealer\", is demonstrably false. Obama reached out the congressmen who were targeted in the shooting, and also recorded a speech congratulating a musician for a landmark accomplishment.", "Curl, Joseph.   \"Silent on Shooting of Congressman, Obama Reemerges to Praise Former Drug Dealer.\"\r\n     The Daily Wire.   18 June 2017.", "Schor, Elana.   \"Obama Reaches Out to Sen. Flake After Shooting.\"\r\n     Politico.   14 June 2017.", "Vanity Fair.   \"Jay Z on His Rags-to-Riches Story, Wooing Beyoncé, and How Blue Ivy Is His 'Biggest Fan.'\"\r\n  October 2013.", "Andrews, Travis M.   \"Obama Describes His Bond With Jay Z.\"\r\n     Washington Post.   16 June 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]