["About this rating", "On 14 October 2016, the \"THEIST VS ATHEIST\" blog at religiousmind.com posted an entry asserting that His Holiness, the 14th Dalai Lama, had proclaimed Republican U.S. presidential nominee Donald Trump to be \"worse than Hitler\" and a \"threat to humanity\":", "Dalai Lama says Trump shows psychopathic behaviors which are similar to that of Hilter [sic]. He made this statement in Zurich when he met 6500 Tibetans in Switzerland.", "Speaking to media after a grand offering ceremony organized by Tibetan community in Switzerland, he made several comments on world politics including sovereignty of  Tibetan lands from Chinese rule.", "When asked what he thinks of American politics where he has special interest he said \"I see another Hitler in the making\". He further added that Trump is a great threat to humanity.", "\"If American people vote for Trump, it will be the end of great Amarican [sic] civilization\"  he said.", "We found no record of the Dalai Lama's having said anything like what was reported at religiousmind.com.  News accounts of His Holiness' recent trip to Switzerland mentioned only his urging Tibetans to maintain their cultural heritage, not offering caustic criticism of American political candidates:", "The Dalai Lama urged young Swiss Tibetans to maintain their cultural heritage half a century after many of their grandparents left home.", "With 6,500 members, the Tibetan community in Switzerland and Liechtenstein is thought to be Europe's largest.", "\"This is our future generation of Tibetans,\" the Nobel Peace Prize-winning spiritual leader said of the children, dressed in traditional clothes, playing around a crowd assembled in an indoor arena. \"After I'm gone, these are the ones who will preserve the Tibetan identity.\"", "In front of an audience of 9,000, many of them Swiss-Tibetans, 26 community representatives made offerings to the 81-year-old Buddhist monk during an official tenshuk long-life ceremony.", "The earliest Tibetan settlers arrived in Switzerland in the 1960s, and Garne said the community was preparing to pass its heritage on to a third generation born and raised in the country, many of whose parents had also never seen Tibet.", "\"You should have the courage and determination to support the Tibetan cause,\" the Dalai Lama told the children. \"For that you need to understand the richness of the Tibetan culture.\"", "In fact, when Good Morning Britain host Piers Anthony asked the Dalai Lama about American elections in general and Donald Trump in particular in September 2016, His Holiness offered only a superficial impression of Trump, saying he had never met him and didn't know much about him:", "And when the Dalai Lama sat down with neuroscientist Richard Davidson on ABC News' \"10% Happier with Dan Harris\" in March 2016, His Holiness likewise responded to a question about Donald Trump by averring that he didn't know much about the subject and that he considered offering personal criticism to be unseemly:", "Dan Harris: “Can I ask just ask one last question and this is a more earthly question. I know you follow the news you listen to BBC. I’m just curious if you have any views on the presidential candidate in this country who’s making the most noise: Donald Trump.”", "Dalai Lama: [Laughing] “Oh, that’s your business. Firstly, I have no right or opportunity to vote. And secondly, [I’m on] a short, sort of, visit here, so I don’t know the whole background of these things. So sometimes I feel ‘oh, too much personal criticism’ — then I feel a serious discussion of policy matters, that’s useful, but little bits of personal criticism in these things, that looks a little bit cheap — that’s my view.\"", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]