["About this rating", "On 14 April 2019, the website DailyWorldUpdate.us published an article claiming that U.S. House of Representatives Speaker Nancy Pelosi had removed a 150-year-old sign reading \"In God We Trust\" from the House Chamber:", "Nancy Pelosi has done the unthinkable. Not only has she been caught with vodka at 11 AM in church, but she has also mothered no less than 4 criminal daughters, who have at least 14 names each, or between them, or both. Now this person, the leader of her party and 2nd behind Mike Pence for the Presidency, had a beautiful and historic sign removed from the chamber door of the House of Representatives.", "This is not a genuine news article.", "DailyWorldUpdate.us is one of many properties from the \"Last Line of Defense\" network of junk news websites. It carries the tagline \"Satire for flat earthers, Trumpsters, and Y'All Qaeda\" and explains on its \"About\" page that \"everything on this website is fiction.\"", "The included image does not show a 150-year-old \"In God We Trust\" sign being removed from the House Chamber entrance. This image was actually taken in 2015 and appears to show a sign being installed, not removed, on a courthouse in Roane County, Tenn.", "The words \"In God We Trust\" have been visible above the rostrum inside the House Chamber, however, since 1962.", "Times Free Press.   \"'In God We Trust' to be Displayed Over Roane County, Tenn., Courthouse Entrances.\"\r\n    16 July 2014.", "Hornback, Brian.   \"Roane County Declares, 'In God We Trust.'\"\r\n    BrianHornback.com.   21 March 2015.", "Daily World Update.   \"Nancy Pelosi Has 150-Year-Old Sign Removed From House Chamber Entrance.\"\r\n    14 April 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]