["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The photo is from a 2016 blog post about Nancy Pelosi walking out of a store in Connecticut.", "The blog post makes no mention of her being drunk or removed from the establishment.", "Pelosi is a frequent target of manipulated videos intending to make her appear drunk or ill. The Facebook post seeks to build on that false narrative.", "House Speaker Nancy Pelosi is a frequent target of manipulated videos intending to make her appear drunk or ill. A recent Facebook post seeks to build on that false narrative.", "\"Nancy Pelosi being ‘escorted’ out of a restaurant, drunk again! Is this the way the 3rd in line to the Presidency should act?,\" said the caption of a photo posted Jan. 31 on Facebook. The photo shows Pelosi, a Democrat from California, walking on a sidewalk seemingly with the help of a woman.", "The Facebook post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The photo shared on Facebook first appeared Sept. 16, 2016, alongside three other photos on a blog post headlined: \"Nancy Pelosi Shops in Hartford.\" The blog is run by Dennis House, a TV news anchor in Hartford.", "\"One of the most powerful women in Washington was in Hartford this Friday and spent about an hour or so shopping at one of Connecticut’s oldest stores,\" said the post on dennishouse.tv. \"Stackpole, Moore and Tryon has had its share of prominent shoppers ever since it opened in 1909, including House Minority Leader and former House Speaker Nancy Pelosi.\"", "The blog post said Pelosi was greeted by the store owner, Jody Morneault, and that Pelosi was later \"escorted to a waiting SUV by Morneault and a government security detail. The two hugged before Pelosi was whisked away.\"", "The blog post does not say that Pelosi was escorted out of a restaurant drunk.", "The other photos in the blog post feature an SUV parked outside the Stackpole Moore Tryon storefront, Pelosi smiling as she and Morneault walk out of the store, and Pelosi smiling and waving before boarding the SUV.", "The store’s Twitter and Facebook page have posts dating at least to 2013 showing Pelosi visiting the Connecticut store.", "In May 2019, as an altered video of Pelosi purportedly slurring went viral, her daughter, Christine Pelosi, rebuked the video in a tweet:", "\"Republicans and their conservative allies have been pumping this despicable fake meme for years! Now they are caught,\" she wrote. \"#FactCheck: Madam Speaker doesn’t even drink alcohol!\"", "We’ve rated Pants on Fire other claims that alleged Pelosi was kicked out of a benefit for children after drinking too much. This Facebook post about her being escorted out of a restaurant, \"drunk again,\" is not any more truthful. We rate it Pants on Fire!", "Facebook post, Jan. 31, 2019", "Internet Archive, Dennishouse.tv blog post - Nancy Pelosi Shops in Hartford, Sept. 16, 2016", "Stackpole Moore and Tryon Facebook post, Sept. 13, 2013; Facebook post Oct. 2, 2105", "Twitter, @SMTTuesdays tweet, Sept. 12, 2014", "PolitiFact, No, Nancy Pelosi did not get obscenely drunk at a cancer benefit, Jan. 23, 2019; Viral video of Nancy Pelosi slowed down her speech, May 24, 2019; No, Nancy Pelosi didn’t get drunk at a children’s benefit in a public park, Dec. 11, 2019", "Twitter, @sfpelosi tweet, May 23, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]