["The one-minute and 14-second video was published on Weibo here on October 17, 2020. It has been viewed more than 89,000 times.", "The post’s simplified Chinese caption translates to English as: “Thailand, protesters threw stones and sundries to police officers, in full fury.”", "The post circulated as Thailand experienced months of pro-democracy protests calling for reform to the monarchy, as reported by AFP here.", "The video was also shared with a similar claim on Weibo here and here, and on Facebook here.", "The claim is false.", "A frame-by-frame analysis found that the uniforms and gear worn by the police in the video are labelled “POLISI”, the Indonesian word for police.", "Below is a screenshot of the video showing the police markings:", "A further keyword search found that the footage shows a protest in Pontianak, the capital of the Indonesian province of West Kalimantan.", "Indonesian regional news outlet Tribun Pontianak reported on the unrest and published a corresponding photo of the protest here on October 8, 2020.", "The article’s Indonesian headline translates as: “Protest Against Omnibus Law in West Kalimantan Turns Chaotic, Dispersed Forcefully by Police.”", "The photo’s caption reads: “Demonstrations against the Omnibus Law at the West Kalimantan Regional Legislative Office ended in chaos. Thursday, 8 October 2020.”", "Below is a screenshot comparison of the footage shared in the misleading Weibo post (L) and the photo published by Tribun Pontianak (R):", "The location of the regional legislative office of West Kalimantan province in Pontianak can be seen on Google Maps here.", "Other Indonesian media, such as Suara.com and Kompas TV, also reported on the clash at the legislative office in Pontianak on October 8, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]