["स्वतंत्र देव सिंह ने राष्ट्रीय अध्यक्ष श्री अखिलेश यादव जी पर आरोप लगाए हैं, ये लोग आलीशान जीवन जीते थे और बंगले में लगे Ac,टाइल्स बंगले में 100 करोड़ रुपये लगाए हैं,और उखाड़ कर ले गए!आप श्री राजनाथ सिंह जी का बंगला देखिये,आख़िर मीडिया इसे क्यों नहीं दिखाती,ये क्यों खंडर बना गए! (Swatantra Dev Singh has accused the National President, Akhilesh Yadav- These people used to live a luxurious life and had spent a 100 crores rupees in Ac and tiles of the bungalow which they took away. You see Mr. Rajnath Singh’s Bungalow. After all, why doesn’t the media show it? How it has been turned into ruins! -translated) tweeted Preeti Chobey, National Secretary of Samajwadi Party. The photographs attached are allegedly of Union Home Minister Rajnath Singh’s house in UP, which he has vacated after a notice from the estate department based on a Supreme Court order asking all the former CMs to vacate their government bungalows allocated to them.", "स्वतंत्र देव सिंह ने राष्ट्रीय अध्यक्ष श्री अखिलेश यादव जी पर आरोप लगाए हैं, ये लोग आलीशान जीवन जीते थे और बंगले में लगे Ac,टाइल्स बंगले में 100 करोड़ रुपये लगाए हैं,और उखाड़ कर ले गए!आप श्री राजनाथ सिंह जी का बंगला देखिये,आख़िर मीडिया इसे क्यों नहीं दिखाती,ये क्यों खंडर बना गए! pic.twitter.com/2qMfD9kb6X", "— Preeti Chobey (@preeti_chobey) June 10, 2018", "Swatantra Dev Singh, Minister of State with Independent Charge for Transport & Protocol had demanded a probe against the Former Chief Minister Akhilesh Yadav for having illegally taken the Government owned properties of the bungalow. In response, Akhilesh Yadav had held a press conference in which he sarcastically offered two taps back to the government.", "Moreover, the same post from a Samajwadi party leaning Facebook page Jai Jai Akhilesh- AZMI(@lucknowsp) has been shared more than 6400 times and ‘liked’ more than 3400 times. It has also been shared more than 6200 times from a Facebook account Amit K. Yadav Saifai.", "पूर्व मुख्यमंत्री राजनाथ सिंह ने सरकारी आवास को ख़ाली करने के बाद मीडिया राजनाथ सिंह के आवास का नजारा नहीं दिखायेगी ।।", "Posted by Jai Jai Akhilesh- AZMI on Sunday, 10 June 2018", "The photographs of the ruined bungalow have their own distinct watermark which gives a clue of their source. The text of the watermark says ‘123RF’. Alt News did a Google Image Search for each image to verify its original source. Here are the results:", "2. This photograph is from Dreamstime, another stock photo website. This image was taken on 23rd October 2012 by a photographer, Alexandre Zveiger, titled ‘Old kitchen destroyed, interior abandoned house’.", "3. This image has a familiar news agency’s watermark. So, Alt News did a search on the official Reuters photo gallery with the words ‘ruined house’, and found that it is an image of a house which was damaged during a fight in the town of Debaltseve in Ukraine on February 25, 2015. The photo was clicked by Baz Ratner.", "4. ‘Long corridor of old destroyed house, interior’ was also clicked by photographer Alexandre Zveiger for another stock content agency, 123RF.", "All of the above photographs are unrelated and anachronistic. It takes only a glance to see the images have a watermark of different organizations and thus raise suspicion of their genuineness.", "Moreover, a report by TheLallantop stated, “State Property Officer Yogesh Shukla has said that the department has examined the vacant bungalows of all the former Chief Ministers and in which only the former Chief Minister Akhilesh Yadav’s Vikramaditya Marg bungalow was found to be ruined.”", "A Navbharat Times report published on 10th June had reported that Rajnath Singh’s bungalow was the first to have been vacated. The report also stated that there were some complaints about breakages in the house. An AC, wiring from some parts and a tin shade was reportedly found missing from the house. However, it may be reiterated that the images circulated and claimed to be from Rajnath Singh’s vacated bungalow are NOT genuine.", "The use of misleading images and/or videos by political parties and their supporters is not a new strategy and this instance represents yet another attempt to score brownie points on social media.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]