["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Protesters demonstrate in the Capitol rotunda on Feb. 26, 2011, in Madison. Demonstrators occupied the building for days protesting a bill that would restrict collective bargaining.", "In her battle against U.S. Sen Tammy Baldwin, Republican Leah Vukmir is presenting herself as a tried, true and tested conservative.", "That approach was evident in the primary battle, in which Vukmir, a state senator from Brookfield, defeated U.S. Marine veteran and businessman Kevin Nicholson.", "During a July 26, 2018 primary debate, Vukmir stressed that Wisconsin Republicans have \"moved the conservative ball down the field. We are not establishment Republicans in Wisconsin; we are activist Republicans.\"", "Vukmir then pitched herself as \"a strong leader with a track record who’s not going to buckle\" and cited the 2011 battle over Act 10 declaring:", "\"I have been through the gauntlet, when we had riots in that Capitol.\"", "Erm? What?", "The background", "The 2011 protests against what would become Act 10 turned into a round-the-clock occupation of the Capitol, with demonstrators camping out in the rotunda. It was the largest series of protests at the Capitol since the Vietnam War, with crowds reaching an estimated 100,000 in early March, after the bill had been signed by newly-elected Gov. Scott Walker.", "The protests were over a push by Walker and Republicans in the Legislature to dramatically curtail collective bargaining for most public employees. The move allowed the state and other units of government to require a higher share of pension and health care costs be paid by workers, which Walker and the GOP said was needed to close a state budget gap.", "The protests -- and the fact Senate Democrats fled to Illinois to delay a vote -- drew major news coverage for weeks.", "The tumult even attracted international attention, with Piotr Duda, president of the 700,000-member Polish trade union Solidarity, releasing a statement in support of the Wisconsin protesters. Meanwhile, Ian’s Pizza shops delivered hundreds of free pizzas to the Capitol, with the cost picked up by contributions from all 50 states — as well as Bosnia, China, Egypt, France and 20 other countries.", "But pizza deliveries in a riot zone?", "A similar claim", "Mattias Gugel, communications director for Vukmir’s Senate campaign, did not respond to our requests for back up for Vukmir’s claim.", "This is not the first time we heard, and evaluated, a \"riot\" claim.", "Appearing on MSNBC’s \"Morning Joe\" program the morning of Feb. 17, 2011, U.S. Rep. Paul Ryan, R-Wis., defended Walker’s efforts.", "\"It's not asking a lot, it's still about half of what private sector pensions do and health care packages do,\" Ryan said. \"So (Walker’s) basically saying, I want you public workers to pay half of what our private sector counterparts (pay) and he's getting riots -- it's like Cairo has moved to Madison these days.\"", "At the time, protests had also swept through the Middle East. In Egypt, 18 days of protests led to the  Feb. 11, 2011, resignation of Egyptian President Hosni Mubarak.", "Our rating of Ryan’s riot claim: Pants on Fire.", "Numerous law enforcement agencies handled the protests, including the Dane County Sheriff’s Department, Madison police, state Department of Natural Resources and Capitol police. But only a handful of arrests were reported.", "\"For the most part, people have been very respectful and very orderly,\" a public information officer for the Dane County Sheriff’s Department told us at the time. \"It certainly has been a very peaceful protest.\"", "To be sure, there were threats made against Walker and GOP lawmakers.", "In his book \"Unintimidated,\" Walker wrote that he received letters targeting his family and faced death threats and frightening encounters with protesters. There were also reports of threats being made against several lawmakers, including Senate Majority Leader Scott Fitzgerald.", "But that’s different than riots.", "At the time, Madison Mayor Paul Soglin said of Ryan’s \"riot\" statement: \"It’s astounding that he would say that. It’s so spectacularly wrong.\"", "Ryan himself admitted: \"It was an inaccurate comparison.\"", "Our rating", "During a campaign debate, Vukmir said: \"I have been through the gauntlet, when we had riots in that Capitol.\"", "That vastly overstates what happened, in an effort to burnish her own stand-tough persona for voters.", "The claim of \"riots\" in the Capitol was debunked in 2011 and rarely, if ever, has come up since. That is, until Vukmir put herself on the hot seat by recycling the claim.", "We still rate it Pants on Fire.", "Youtube, \"Today’s TMJ4 & UWM U.S. Senate GOP primary candidate debate, posted July 26, 2018, at about 7:30 mark.", "Milwaukee Journal Sentinel, \"Wisconsin U.S. Senate race: Leah Vukmir, Kevin Nicholson debate at UW-Milwaukee; others join later,\" July 26, 2018.", "Milwaukee Journal Sentinel, \"Marquette poll: Leah Vukmir and Kevin Nicholson in a dead heat in GOP U.S. Senate Primary,\" July 18, 2018.", "PolitiFact Wisconsin, \"U.S. Rep. Paul Ryan compares Madison to Cairo, calls protests over collective bargaining changes ‘riots,’\" Feb. 18, 2011.", "Real Clear Politics, \"Rep. Paul Ryan on Wisconsin protests: ‘Like Cairo Moved to Madison,’\" Feb. 17, 2011.", "PolitiFact Wisconsin, \"Our Truth-O-Meter.\"", "CNN Politics, \"Ryan equates Wisconsin protests to Egypt,\" Feb. 17, 2011.", "Wikipedia, Egyptian President Hosni Mubarak.", "Wisconsin State Journal, \"The protest that wouldn’t end: Act 10,\" Oct. 23, 2017.", "Politico, \"Gov. Walker writes of family threats,\" Nov. 13, 2013.", "Amazon.com, \"Unintimidated: A Governor’s Story and a Nation’s Challenge.\"", "PolitiFact Wisconsin, \"Gov. Scott Walker says protesters surrounded his car, locked his exit and rocked the vehicle after a 2011 appearance in La Crosse,\" Dec. 23, 2013.", "CBS News, \"Wisconsin vote spurs death threat, protests, legal questions,\" March 10, 2011.", "Wikipedia \"2011 Wisconsin protests.\"", "New York Times, \"Delivering moral support in a steady stream of pizzas,\" Feb. 25, 2011.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]