["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Cost is one of the key objections critics raise when the topic is the Patient Protection and Affordable Care Act, also known as Obamacare.\n\nThe issue came up July 26 during a debate on the public access program State of the State among Republican candidates for Rhode Island’s 2nd Congressional District seat. (It will begin airing Aug. 4.)\n\n\"I have a problem with almost every aspect of (Obamacare),\" said one of the candidates, Michael Riley. He said it would create too many new agencies and \"we also have skyrocketing health-care costs, even in the first two years of implementation. The CBO has already doubled its estimate for the cost (of Obamacare) so far, from roughly $800 billion to $1.7 trillion.\"\n\nThe CBO is the Congressional Budget Office, the widely respected nonpartisan agency that generates estimates and reports about the effect that proposed laws will likely have on the federal budget.\n\nWe asked Riley’s campaign for his backup and, while we waited for their response, began our own research.\n\nPolitiFact has checked similar claims and found them, to be kind, less than factual.\n\nThe CBO's initial estimate on March 2010 was that the gross cost from 2012 to 2019 would be $931 billion.\n\nIts newer estimate from March 2012 put the gross cost at $1,762 billion, which is where the complaints about doubling originated. But that was for a different time frame -- from 2012 to 2022.\n\nPolitiFact National found that if you compare the CBO figures for 2012-2019, a period covered by both reports, the estimate of the gross cost hadn't doubled, as Riley claimed. It had risen 8.6 percent, from $931 billion to $1.01 trillion.\n\nThe $1.7 trillion figure was so widely misused, the CBO issued a statement saying that its estimates had not shifted significantly. \"The projections for each given year have changed little, on net, since March 2010,\" the statement said.\n\nBut wait, as they say in the commercials, there's more.\n\nThe $1.7 trillion estimate doesn't include money saved from spending cuts, revenue from new taxes on the wealthy, penalties paid by individuals and workers who decide not to buy insurance, and other cost-saving measures included in the law.\n\nWhen the CBO took all of that into account, which it did in a 2010 report, it concluded that the health-care law would actually save money, lowering the deficit by about $132 billion between 2012-2019.\n\nIn a 2011 update, it found that the projected deficit reduction had slipped to $119 billion, but it was still a net savings.\n\nIn July, before Riley made his statement, the CBO updated some of its estimates in the wake of the U.S. Supreme Court's decision to uphold most of the 2010 law. The CBO said the cost would be lower still, although the new projected savings would come from the fact that several states have vowed not to expand the eligibility requirements for Medicaid to help more uninsured people, invoking an exemption opened up by the Supreme Court ruling.\n\nAt the same time, the CBO estimated that if the Affordable Care Act were to be repealed, that would add $109 billion to federal budget deficits from 2013 to 2022.\n\nRiley responded to our question by sending us a handful of links, most of them editorials from the conservative Washington Examiner that compared estimates from different time frames or disputed Obamacare supporters who say the cost estimates haven’t doubled. None mention the CBO's statement saying that the cost estimates have not changed appreciably over time.\n\nOur ruling\n\nCongressional candidate Michael Riley said the Congressional Budget Office’s estimate of the cost of Obamacare has doubled.\n\nThe CBO itself says that's not true and that its estimates, on a year-by-year basis, have not changed significantly.\n\nFurthermore, the numbers cited by Riley are misleading because they represent only the gross costs of the health care law, not any savings. According to the CBO, the savings will actually reduce the deficit, although that estimate hasn’t been updated in two years.\n\nInformation debunking similar claims has been available for the last four months here, here, here and, most recently, here.\n\nWe rate his claim False.\n\n(Get updates from PolitiFactRI on Twitter. To comment or offer your ruling, visit us on our PolitiFact Rhode Island Facebook page.)", "CBO.gov, \"Selected CBO Publications Related to Health Care Legislation, 2009–2010,\" (Table 4 from March 20, 2010 on page 32 of the PDF file, minus data for 2010 and 2011), accessed Aug. 1, 2012\n\nCBO.gov, \"CBO Releases Updated Estimates for the Insurance Coverage Provisions of the Affordable Care Act,\" March 13, 2012, accessed July 30, 2012\n\nCBO.gov, \"Another Comment on CBO's Estimates for the Insurance Coverage Provisions of the Affordable Care Act,\" March 16, 2012, accessed July 30, 2012.\n\nCBO.gov, \"Testimony - Statement of Douglas W. Elmendorf, director, CBO's Analysis of the Major Health Care Legislation Enacted in March 2010,\" (Table 1), March 30, 2011, accessed July 30, 2012\n\nCBO.gov, \"Estimates for the Insurance Coverage Provisions of the Affordable Care Act Updated for the Recent Supreme Court Decision,\" July 2012, accessed July 30, 2012.\n\nCBO.gov, \"CBO Releases Two Analyses Related to the Affordable Care Act,\" July 24, 2012, accessed July 30, 2012\n\nFactcheck.org, \"Health Care Costs Didn't Double,\" March 16, 2012\n\nWashington Post Wonkblog, \"No, the CBO hasn't doubled its cost estimate for health-care reform,\" March 20, 2012\n\nPolitiFact.com, \"Ted Cruz says health reform's price tag has doubled,\" March 21, 2012\n\nPolitiFact.com, \"TV ad says health law's cost is $2 trillion, 'double what we were promised,'\" July 11, 2012, accessed July 30, 2012\n\nE-mails, Michael Riley, Aug. 1, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]