["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "As the COVID-19 coronavirus disease spread around the world, a false claim gained traction in India during March 2020 via social media, including messages in WhatsApp. A series of posts claimed that vegetarians were unaffected by the disease, attributing it to the World Health Organization (WHO).", "On March 14, a post from the Facebook page I Support Indian Army (only radical Hindus join: please get 150 Hindus to join) was shared more than 600 times.", "The post says:", "No vegetarian person in the world has been caught with corona: WHO report. Vegetarians rejoice, the demons will die.", "But the WHO's website does not include a report claiming that vegetarians are not susceptible to contracting COVID-19.", "Another post forwarded to Snopes on WhatsApp attributes a quote to Dr. Gauden Galea, the WHO representative in China. In February, he's shown saying in a Facebook video from a page called Lebanese Vegans:", "As long as people eat meat, there is going to be some risk of infection.", "Galea's statement was in fact taken out of context. Indian news outlet The Logical Indian found a CNN report from January 2020 where he first made the statement after the origins of COVID-19 and its ability to spread from person-to-person was discovered. In an email exchange with The Logical Indian, he clarified:", "\"The statement was part of a longer discussion about the continued global risk of zoonotic viruses and the potential for 'spillover' into human populations. The intent was not to endorse any particular diet nor to condemn any other, but to recognize that as long as people eat meat, there is a need to rear animals, to slaughter them, and to distribute and sell the products. This proximity of animals and humans thus generated will create the opportunity, indeed the certainty, of animal-human spillovers of infectious disease. It is important therefore that the trade-in all livestock, from farm to table, be regulated in a One-Health approach looking at animal and human health as one continuum, with all sectors involved acting in unison. This applies to an even greater extent to the illegal trade in wild animals for food where other laws and considerations, from law enforcement to quarantine and conservation, will also apply.\"", "Scientists suggest that COVID-19 likely came from bats first, possibly passing through an intermediary animal before infecting humans. The hypothesis that COVID-19 emerged at a live animal market at Wuhan is also inconclusive according to Dr. Stephen Turner, head of the department of microbiology at Melbourne’s Monash University. But the interactions of different species at wet markets with fresh meat, fish, and perishables has been identified as an issue, according to immunologist Dr. Michelle Baker.", "On Twitter, the following message was copied and retweeted hundreds of times, even though it appears to be from a parody account:", "The post, from March 14, says:", "The whole world has become fans of sanatan culture. No vegetarian in the world has contracted coronavirus: WHO report. The entire world is now doing namaste… hawans and yajnas are being done… gaumutra (cow urine) and tulsi’s benefits are being understood… Gita and Ramayana are being read. Hail sanatan", "This seemingly satirical post was shared by other non-parody accounts as well. The post suggests that the vegetarian lifestyle, particularly in the context of Hinduism, has protected people from contracting the virus. It also mentions rituals and belief systems specific to elements of Hinduism.", "Only 23-37% of Indians are estimated to be vegetarians, even though 80% of the population is Hindu. Hindus still make up a big proportion of meat eaters in the country, with an estimated one-third of upper-caste Hindus adhering to a vegetarian diet.", "It should also be noted that the above series of posts are proliferating on social media during a time of heightened anti-Muslim sentiment in India. Social media posts blaming the spread of the virus on the Muslim minority community are increasing, including the use of hashtags such as #CoronaJihad. In the past, Muslims and other minority groups have been targeted and faced violence over accusations of slaughtering cows and eating beef.", "The Indian Ministry of Health and Family Welfare also released a post busting this myth, recommending that everyone should mainly eat thoroughly cooked food:", "This aligns with the WHO's recommendations on how to consume meat:", "The consumption of raw or undercooked animal products should be avoided. Raw meat, milk, or animal organs should be handled with care to avoid cross-contamination with uncooked foods, as per good food safety practices.", "The WHO also has guidelines for those who work in meat markets, particularly discouraging the slaughter and consumption of animals that were sick.", "Slaughterhouse workers, veterinarians in charge of animal and food inspection in markets, market workers, and those handling live animals and animal products should practice good personal hygiene, including frequent hand washing. They should consider wearing protective gowns and gloves while professionally handling animals and fresh animal products. Equipment and working stations should be disinfected frequently, at least once a day. Protective clothing should be removed after work and washed daily. Workers should avoid exposing family members to soiled work clothing, shoes, or other items. It is therefore recommended that protective clothes and items remain at the workplace for daily washing.", "As a general recommendation, sick animals should never be slaughtered for consumption; dead animals should be safely buried or destroyed and contact with their body fluids should be avoided without protective clothes. Veterinarians should maintain a high level of vigilance and report any unusual event detected in any animal species present in the markets to veterinary authorities.", "Thus, no evidence exists to support the claim that a vegetarian lifestyle can protect someone from contracting COVID-19, a claim that has been debunked by both media outlets and the Indian government. Furthermore, the WHO and its China representative, Galea, have made no recommendations based on diet. Their statements instead focus on the possible risks of COVID-19 spreading in spaces where meat is exchanged, and methods to process and consume meat and poultry safely.", "Considering that information, we rate this claim as \"False.\"", "Biswas, Soutik.   \"The myth of the Indian vegetarian nation.\"\r\n   BBC.   4 April 2018.", "Chakrabarti, Angana.   \"WHO didn’t say vegetarians haven’t contracted coronavirus, viral Twitter post is misleading.\"\r\n   The Print.   16 March 2020.", "Chattopadhyay, Aditi.   \"Fact Check: Did WHO Really Say Vegetarians Are Less Susceptible To Coronavirus?\"\r\n   The Logical Indian.   5 May 2020.", "CNN.com.   \"This may explain the spread of China's new virus.\"\r\n   20 January 2020.", "Encyclopaedia Britannica.   \"Sanatana dharma.\"", "Filkins, Dexter.   \"Blood and Soil in Narendra Modi's India.\"\r\n   The New Yorker.   2 December 2019.", "Jain, Ritika.   \"Covid-19: How fake news and Modi government messaging fuelled India’s latest spiral of Islamophobia.\"\r\n   Scroll.   21 April 2020.", "Perrigo, Billy.   \"It Was Already Dangerous to Be Muslim in India. Then Came the Coronavirus.\"\r\n   TIME.   3 April 2020.", "Readfearn, Graham.   \"How did coronavirus start and where did it come from? Was it really Wuhan’s animal market?\"\r\n   The Guardian.   28 April 2020.", "WHO.int. \"WHO recommendations to reduce risk of transmission of emerging pathogens from animals to humans in live animal markets or animal product markets.\"\r\n   26 March 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]