["About this rating", "Sgt. Andrew Tahmooressi, a U.S. Marine Corps veteran, was arrested in Tijuana after crossing the border into Mexico on 31 March 2014. He was imprisoned for seven months and claims to have been beaten and abused during his incarceration.", "Tahmooressi was arrested and charged with weapons-trafficking after being found in possession of three firearms and ammunition, and his claims of abuse and mistreatment have not so far been substantiated with concrete evidence.", "In the autumn of 2018, the journey of a \"caravan\" of thousands of migrants from Central America towards the United States' southern border dominated news coverage and debate for weeks. On 25 November, hundreds of the migrants, most of them from Honduras, were met by U.S. federal agents at the border post of San Ysidro in California. When one breakaway group attempted to rush from Mexico to the U.S., Border Patrol agents deployed tear gas, prompting both criticism and support for their actions.", "Speaking to reporters, U.S. Customs and Border Protection (CBP) Commissioner Kevin McAleenan asserted that some of the migrants attempting to rush across the border had also thrown “rocks and other projectiles” at CBP agents.", "The debate over the tear gas incident often followed partisan lines, with conservative supporters of President Donald Trump mostly defending the choice made by CBP agents, while progressive opponents of the president generally criticized the agents' actions, as well as the militarized response of the White House to the arrival of the migrants, some of whom were would-be asylum-seekers fleeing violence in Central America.", "Against that background, social media users shared a tweet which appeared to present liberal critics of the use of tear gas as naive or even hypocritical, in light of the alleged arrest and torture of a U.S. Marine who had accidentally crossed into Mexico in 2014.", "On 27 November, the right-wing Twitter account \"Educating Liberals\" posted a tweet that declared:", "In 2014, Mexico arrested one of our marines, tied him to a bed for 9 months, & then tortured him for accidentally crossing the border. Yet liberals think we are being “mean” when our border agents use tear gas to defend themselves from violent invaders throwing rocks. Get real.", "In 2014, Mexico arrested one of our marines, tied him to a bed for 9 months, & then tortured him for accidentally crossing the border.", "Yet liberals think we are being “mean” when our border agents use tear gas to defend themselves from violent invaders throwing rocks.", "Get real.", "— Educating Liberals (@Education4Libs) November 28, 2018", "The tweet was further promulgated when a screenshot of it was posted on the Facebook page \"Cloyd Rivers\", which features conservative memes and content as well as links to online clothing stores:", "The \"Educating Liberals\" tweet referred to the real case of Sgt. Andrew Tahmooressi, a U.S. Marine Corps veteran who crossed from the United States into Mexico near San Ysidro, California, on 31 March 2014. After police found three firearms and ammunition in his truck (items that he legally owned and was permitted to carry in the United States, but not in Mexico) he was arrested on suspicion of weapons trafficking.", "In a 911 call on the night of his arrest, Tahmooressi told a U.S. dispatcher that he had taken a wrong turn and accidentally crossed the border before being stopped by Mexican authorities:", "Tahmooressi spent seven months in prison in Mexico while awaiting trial. During that time, politicians from both parties, the broadcaster and U.S. Navy veteran Montell Williams, as well as Tahmooressi's mother Jill, all led a campaign to pressure Mexican authorities to release him and allow him to return home to Florida.", "In testimony before the U.S. House of Representatives' Foreign Affairs Committee, Jill Tahmooressi maintained that her son, who served in Afghanistan and was diagnosed with post-traumatic stress disorder (PTSD), told her he had attempted to kill himself because of his fear that \"the guards and the inmates were going to rape, torture and execute me.\" She also asserted that Sgt. Tahmooressi had told her he was chained to his infirmary cot for 25 days:", "On 31 October, a Mexican judge ordered Tahmooressi's immediate release from prison and return to the United States after prosecutors dropped the charges against him, which could have carried a maximum sentence of 21 years in prison upon conviction. Tahmooressi's attorney had argued that his PTSD meant he was unable to stand trial and should be returned home in order to resume treatment for the illness.", "One week later, Fox News broadcast a lengthy interview with Tahmooressi, in which he outlined the circumstances leading up to his arrest as well as his treatment in two Mexican prisons. Speaking to Greta Van Susteren, Tahmooressi said: \"I was handcuffed to a bed, four-point restraint ... for about a month.\" When asked why this unusual action had purportedly been taken on him, Tahmooressi replied:", "Because I wasn't behaving. I wasn't a behaved prisoner. I was lashing out. Not lashing out like being disrespectful, I never wanted to come off as disrespectful, but I just couldn't take it all ... I believe they did it because they were afraid of me, afraid that I might do something again and really end up doing something like successfully killing myself or harming somebody, and that they would get in trouble for it by not being able to control the situation.", "Tahmooressi claimed that he had attempted to escape from prison but was recaptured by guards who allegedly beat him, stripped him naked, and tied him to a pole for eight or nine hours. Subsequent to that, Tahmooressi claimed, he was handcuffed to a bed for a further 12 hours.", "Two or three days later, the former Marine claimed, he attempted to kill himself because he feared being subjected to a brutal attack by other inmates and thought they would attempt to extract information from him about his loved ones. Tahmooressi described his own state of mind at that time as being one of paranoia, adding that \"I had been watching a lot of conspiracy films, and it made me change the way I thought about things, and things that I believe.\"", "On 29 May 2014, Tahmooressi signed an \"affidavit of mistreatment,\" formally notifying the U.S. State Department about his allegations of abuse while he was being held in prison in Mexico. A consular email later released under the Freedom of Information Act summarized his claims in the following way:", "In his Affidavit of Mistreatment dated May 29, Mr. Tahmooressi stated he attempted to escape from the La Mesa prison on April 6. Mr. Tahmooressi said that once he surrendered, guards hit him three times in the leg with batons and stomped on his bare feet with their boots. He stated that handcuffs were placed on his wrists so tightly that they broke his skin open and that he was dragged, and then forced on to his knees with his face pressed up against a steel door, which made it difficult for him to breath [sic.] Next, Mr. Tahmooressi claims he was punched in the jaw three times and forcefully slapped by the guards a total of about 40 times in the jaw, face and forehead. Mr. Tahmooressi stated he was also punched in the stomach five times and in the rib cage about three times.", "Mr. Tahmooressi claimed that he was next taken to a room where his clothes were stripped off and handcuffed to a bed and forced to stay overnight naked. Mr. Tahmooressi stated the following day he was moved to another cell where he was handcuffed to a bed with one leg attached to one wall and a hand cuffed to the opposite wall for approximately 24 hours.", "However, the memo also noted that consular staff had not seen or received any indication from Tahmooressi that he had suffered such mistreatment in the seven weeks between when the abuse allegedly took place and when he first reported the alleged abuse to consular staff:", "Consulate had no notice and no indications of abuse prior to the recent claim. Inquiries to Mr. Tahmooressi during visits prior to May 29 regarding his condition and welfare had not elicited any claims of mistreatment.", "In news reports at the time, Mexican officials denied all allegations that prison authorities had mistreated Tahmooressi. We asked Mexico's Ministry for Foreign Affairs for a detailed response to those allegations as well as any evidence which might support their earlier denials but did not receive a response in time for publication.", "Jill Tahmooressi told us that she had visited her son in prison on three occasions, and that on one of those occasions she noticed \"red rings around his wrist\" which he attributed to handcuffs. She told us that apart from that incident, she did not have any concrete evidence to support her son's claims of mistreatment.", "She did provide us the names of two individuals who had regularly visited him in prison during 2014: one a former U.S. State Department official and the other a Christian pastor who counselled Sgt. Tahmooressi during his incarceration. We did not receive a response from either of them in time for publication.", "Fernando Bénitez, the high-profile attorney who represented Tahmooressi in Mexico and helped secure the prosecutors' decision to drop the charges against him, told us that he had never seen any evidence that his client had been beaten, restrained, or abused in prison. He corroborated Tahmooressi's account of having self-harmed while in prison and of having made something resembling an escape attempt, but he firmly rejected Tahmooressi's claims of mistreatment:", "I find those assertions hard to believe ... I do not know for a fact, but had that happened, it would have been the only incident of its nature in the last 20-25 years to take place here in Tijuana. It would have been unheard of, especially against an American and an American service member ...", "I find the [claims about] beatings and tortures very, very, very hard to believe. They would serve no purpose and would have placed those responsible in jail themselves.", "It should be noted that Bénitez also informed us that a dispute had taken place between himself and members of the Tahmooressi family regarding fees paid for his services in the Tahmooressi case.", "Conclusion", "The viral \"Educating Liberals\" tweet described the case of Sgt. Andrew Tahmooressi in the following way: \"In 2014, Mexico arrested one of our marines, tied him to a bed for 9 months, & then tortured him for accidentally crossing the border.\"", "Only part of this is verifiably accurate. Tahmooressi was indeed arrested and imprisoned after crossing into Mexico in March 2014, something he claimed he did accidentally. However, he was not arrested merely for crossing the border (accidentally or otherwise) -- he was arrested and charged with weapons trafficking after being found in possession of three firearms and ammunition. a crucial fact which the tweet failed to mention.", "Furthermore, not even Tahmooressi himself has ever claimed that he was tied to a bed for nine months. The full duration of his incarceration in Mexico was seven months, and Tahmooressi asserted that he spent around one month of that time chained to a bed in a Mexican prison and received beatings from prison guards.", "Mexican authorities have denied that any such abuse or mistreatment took place, Tahmooressi's former lawyer expressed heavy skepticism about the veracity of those claims, and despite our efforts we were unable to obtain any concrete evidence to support Sgt. Tahmooressi's allegations. This does not in itself mean they are not true, only that they are so far unsubstantiated.", "U.S. Customs and Border Protection.   \"Statement from Commissioner McAleenan on Incident at San Ysidro Yesterday Afternoon.\"\r\n    26 November 2018.", "Dibble, Sandra.   \"Marine Veteran Freed from Mexican Jail.\"\r\n    The San Diego Union-Tribune.   31 October 2014.", "Fox News.   \"'Like Some Kind of Animal in a Cage': Sgt. Tahmooressi Tells His Story.\"\r\n    6 November 2014.", "Pesantes, Erika.   \"Weston Marine Returns Home After Being Jailed in Mexico 214 Days.\"\r\n    The South Florida Sun-Sentinel.   1 November 2014.", "Valencia, Nick and Michael Martinez.   \"Mexico Frees Marine Detained for Seven Months on Weapons Charges.\"\r\n    CNN.   1 November 2014.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]