["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Lamar Smith, the Environmental Protection Agency and National Oceanic and Atmospheric Administration have been frequent sparring partners. In a Dec. 6, 2015 oped column, Smith, R-San Antonio, took to  the San Antonio Express-News to warn readers against  the EPA’s Clean Power Plan.", "The EPA has described the Clean Power Plan as a necessary, though not sufficient, step in addressing climate change -- and as part of a larger strategy to spur other nations to reduce emissions. It was the subject of a previous fact check. The plan is aimed at states with fossil-fuel fired electrical plants.", "Smith wrote: \"Texans will be hit even harder than those in other states. The Electric Reliability Council of Texas (ERCOT) has estimated that the Obama administration’s Power Plan will cause energy costs in Texas to rise as much as 16 percent per year.\" According to the Federal Regulatory Energy Commission, ERCOT manages 90% of the electrical load of Texas; it is a nonprofit corporation.", "The way the statement is phrased, it sounds as though every year energy costs in Texas will rise  16 percent. But the ERCOT report on the effects of the EPA Clean Power Plan says the increase will be over a longer period of time.", "Smith’s statement was based on incorrect information provided by an ERCOT official to his House Science, Space and Technology Committee.", "The ERCOT Oct. 16, 2015 report and an accompanying news release says that \"energy costs for customers may increase by up to 16% by 2030 due to the CPP alone, without accounting for the associated costs of transmission upgrades, higher natural gas prices caused by increased gas demand, procurement of additional ancillary services, and other costs associated with the retirement or decreased operation of coal-fired capacity in the ERCOT Region\" (ERCOT does not estimate how much these other factors might raise energy costs in their analysis).", "In other words, by 2030, energy costs will have risen 16 percent since the CPP took effect.", "So, how big is the disparity between a 16 percent increase by 2030 and a 16 percent increase each year until 2030?", "It helps to know when the Clean Power Plan is scheduled to come into effect.", "According to the EPA’s Clean Power Plan Final Rule, states with fossil fuel-fired electric generating units need to create plans that set emissions standards for those units. Vermont and the District of Columbia are exempt because they have none of the relevant units, and Alaska and Hawaii are exempt because the EPA says it lacks enough information to determine the best system of emission reduction for non-contiguous states.", "Plans are due in 2016 (with a possible extension to 2018), and the reduction in emissions needs to start by 2022, with extra rewards for states that also cut emissions in 2020 and 2021.", "If energy costs rise 16 percent each year from 2022 until 2030, that is roughly a 327 percent increase in the cost of energy.", "To help put this in real terms, we crunched some numbers on energy costs in Texas.", "The U.S. Energy Information Administration’s Residential Energy Consumption Survey reported the average annual electricity cost per Texas household at $2,160 in 2009, the last year for which data are available, and just under 4.5 percent of the median household income in Texas that year. Adjusted for inflation, that’s about $2,394 in 2015.", "If the Clean Power Plan caused energy costs to increase 16 percent by 2030, that bill would rise to about $2,777 in today’s dollars. If energy costs increased 16 percent per year, though, that bill would be $7,828. The median household income in Texas was $53,035 by the last Census. The first price would mean Texans would spend around 5 percent of their yearly household income on energy, while the higher number implies energy costs would eat up closer to 15 percent of income.", "Smith, whose 21st Congressional District includes portions of San Antonio, Austin and the Texas Hill Country, is chairman of the House Science, Space and Technology Committee, with jurisdiction over the EPA, NOAA and NASA.", "A spokeswoman for his committee, Laura Crist, said in an email statement that the congressman’s claim of a 16-percent increase per year was based on communications with ERCOT staff. She noted that the ERCOT estimate is conservative and does not include costs for upgrades.", "ERCOT, meanwhile, stood by the estimate in the report.", "\"It’s the 16 percent by 2030 that’s correct,\" said Robbie Searcy, ERCOT communications manager. Searcy said in a telephone interview that information provided to the House committee \"created a misunderstanding in the congressman’s office and that’s why there was an error.\"", "Our ruling", "One of PolitiFact’s Truth-O-Meter principles is that words matter, and at the very least, Smith's claim is worded ambiguously. The ERCOT analysis and a news release point to an increase in energy costs of 16 percent by 2030. Smith claims that increase per year.", "We rate this claim as False.", "FALSE – The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "EDITOR’S NOTE 3:30 p.m., 12/18/15: After publication, Trip Doggett, ERCOT president and chief executive officer, emailed a statement saying Smith’s statement of 16 percent per year was based an erroneous information provided by ERCOT. \"Because ERCOT inadvertently provided incorrect information to the Chairman’s staff, I would like to take this opportunity to state the correct information and offer an apology.\"", "This additional information did not change the rating of our claim.", "Op-ed article, \"House panel seeking good science, not fiction,\" Lamar Smith, San Antonio Express-News, Dec. 6, 2015.", "Report, \"ERCOT Analysis of the Impacts of the Clean Power Plan: Final Rule Update,\" Electric Reliability Council of Texas, Oct. 16, 2015.", "Press release, \"ERCOT releases report on Clean Power Plan Impacts,\" Oct. 16, 2015.", "Document, \"Carbon Pollution Emission Guidelines for Existing Stationary Sources: Electric Utility Generating Units, Final Rule,\" Environmental Protection Agency, Federal Register, Oct. 23, 2015.", "Blog post, \"Vermont Receives Record Funding for State Energy Efficiency Efforts,\" Agency of Natural Resources, State of Vermont, Oct. 22, 2015.", "Tool, \"Consumer Price Index Inflation Calculator,\" Bureau of Labor Statistics, Accessed Dec. 10, 2015.", "Survey data , Selected Economic Characteristics, 2014 American Community Survey 1-Year Estimates, US Census Bureau, Sep. 17, 2015.", "Survey, \"Household Energy Use in Texas,\" Residential Energy Consumption Survey, U.S. Energy Information Administration, 2009.", "Emails and phone interview, Robbie Searcy, ERCOT Communications Manager, Dec. 15, 2015.", "Email, Laura Crist, Communications Director for Lamar Smith, Dec. 15, 2015.", "Email, Shelly Botkin, ERCOT director of corporate commuications and government relations, Dec. 17, 2015.", "Email, Trip Doggett, ERCOT president and chief executive officer, Dec. 17, 2015.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]