["The 31-second video was published in this Facebook post on October 30, 2019. It has been viewed more than 26,000 times.", "The Indonesian-language text superimposed on the video translates to English as: “Cool technology at a traffic light of Tanjung market in Jember…”", "Below is the screenshot of the misleading post:", "Jember is a regency in Indonesia’s East Java province.", "The video was also published on Facebook here, here and here; and YouTube here.", "A number of Facebook users appeared to believe the video showed a real-life event, commenting that it was “amazing” and “creative”.", "The claim is false; the video has been edited to include special effects.", "A keyword search on Google found this video published on Instagram on October 15, 2019.", "The post's Indonesian-caption translates to English as: “Why is the song of the Depok mayor in Jember? By the way, don’t speed and always obey traffic rules everyone.”", "Monmaap kenapa lagu pak walkot depok ada di jember ya? Btw jangan kebut2an dan selalu patuhi peraturan lalu lintas ya gaess ? . @indovisualgram @indovidgram @editorest.id @aftereffectsindonesia @adobepremiereindonesia @visiteditor @visualeditor.id @visualinspirasi @weloveunej @infojember @jemberbanget @infodepok_id @depok24jam @exploredepok @explorejember @pesonajember . #indovisualgram #indovidgram #editorest.id #aftereffectsindonesia #adobepremiereindonesia #visiteditor #visualeditor.id #visualinspirasi #weloveunej #infojember #jemberbanget #pesonajember #explorejember", "A post shared by  Mochamad Ariyanto (@jalankedua) on Oct 14, 2019 at 11:39pm PDT", "The video features a song titled “Be Careful”, sung by Depok Mayor Mohammad Idris.", "Translated from Indonesian to English, the lyrics of the song read: “Be careful on the road, don’t be inconsiderate. When driving a vehicle, don’t speed. Don’t let people say you disrupt the traffic. Like a confused person who don’t know the rules.”", "Here is the video of the full song uploaded on YouTube by the Depok Transportation Agency on July 22, 2018.", "Depok is a city in West Java. Here is the official website of the Depok city government.", "The bio of the Instagram account reads: “Mochamad Ariyanto\n\t#Editor | #VisualEffects | #DigitalArt”.", "Ariyanto frequently posts videos edited with special effects not only on his Instagram account but also his YouTube account.", "He told AFP by Instagram private message on November 1, 2019, that he recorded the original video, which he later edited and posted it on his Instagram account.", "“The scene in the original video was taken at Tanjung market, \" he said. \"I recorded it at night at around 8pm. So, I recorded and edited the video myself.\"", "Ariyanto also sent AFP the original, unedited one-minute, 10-second video.", "AFP analysed the metadata of the video using online metadata viewer Get-Metadata and found it was taken on October 12, 2019, at 8pm local time using a Sony camera.", "Below is a screenshot comparison of the edited video Ariyanto posted on Instagram (L) and the original unedited video he sent to AFP (R):", "The scene of the video was taken at this intersection near Tanjung market in Jember. The intersection on Google Street View is embedded below:", "Below is a screenshot comparison between the original unedited video (L) and the intersection near Tanjung market as seen on Google Street View (R). AFP has circled prominent features in red.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]