["About this rating", "Gaylord Jackson Perry was a lanky 6'4\" right-handed pitcher from North Carolina notorious for his furtive — and often not-so-furtive — use of the spitball (and the Vaseline ball, and the KY Jelly ball) decades after baseball had banned it.", "In a 22-year major league career spanning the years from 1962-1983, Perry and his \"hard slider\" racked up 314 wins and 3,534 strikeouts as Perry won 20 or more games in a season five times, hurled a no-hitter in 1968, and became the first pitcher to win the Cy Young award in both leagues. Gaylord Perry's achievements on the pitching mound earned him a spot in baseball's Hall of Fame in 1991.", "Today's legend deals not with Gaylord Perry the pitcher, however, but Gaylord Perry the hitter:", "In 1963, baseball pitcher Gaylord Perry remarked, \"They'll put a man on the moon before I hit a home run.\" On July 20, 1969, a few hours after Neil Armstrong set foot on the moon, Gaylord Perry hit his first, and only, home run.", "\"They'll put a man on the Moon before he hits a home run\" — Giants manager Alvin Dark in 1964, about his feeble-hitting pitcher Gaylord Perry.", "Perry would collect his first homer on July 20, 1969, minutes after Apollo 11's lunar module touched down on the Moon.", "When Perry swatted his first Major League home run during a Dodgers-Giants contest on 20 July 1969, shortly before the Apollo 11 astronauts touched down on the lunar surface to become the first humans to visit the moon, newspaper accounts of the game played up the amusing coincidence:", "The way Gaylord Perry swings a bat, he stands as much chance of hitting a home run as ... oh ... as a man does of walking on the moon. Well, Perry and astronauts Neil Armstrong and Edwin Aldrin made it together Sunday. The San Francisco right-hander tagged his first career homer and pitched the Giants to a 7-3 victory over Los Angeles, tightening up the National League's West Division race while the astronauts took a moon stroll that tightened up the universe.", "Sometime later, accounts surfaced claiming that several years before that 1969 home run, someone had observed Perry's feeble batting skills and exclaimed, \"They'll put a man on the moon before he hits a home run.\" In the fashion of urban legends, different versions of the claim included contradictory details about who supposedly made that observation (sometimes it's Giants manager Alvin Dark, sometimes it's Perry himself) and when it was uttered (anywhere from 1962 to 1968).", "From the examples cited above, our choices about where to investigate the \"who said this?\" aspect of the legend begin with Gaylord Perry and Alvin Dark, the latter the manager of the Giants team with whom Perry began his major league career in 1962. We quickly narrow our options by noting that Perry himself attributed the quip to Alvin Dark, as related in the 1984 book Strike Two by former umpire Ron Luciano:", "Pitchers may not remember every home run they give up, but they certainly remember every one they hit. Usually this requires only a very short memory. Gaylord Perry's first major league home run was a historic one. He was with Alvin Dark's San Francisco Giants in 1968. \"I was taking batting practice one afternoon and I was just hitting line drives, I mean line drives. Harry Jupiter, a sportswriter, was watching me and said to Alvin, 'You know, that guy has some power.'", "\"Alvin laughed. 'Let me tell you something,' he said. There'll be a man on the moon before he hits a home run.'", "\"So a year later I was pitching against the Dodgers when we got the news that Neil Armstrong had stepped on to the surface of the moon. I came to bat about twenty minutes after that, against Claude Osteen — and hit my first major league home run.\"", "This account sounds like everything we could need to mark this one true: an involved participant providing names, dates, and even small details (e.g., Perry did indeed hit his home run off the Dodgers' Claude Osteen). One problem, though: Alvin Dark was no longer manager of the San Francisco Giants in 1968.", "Dark had been fired by the Giants after the 1964 season and was managing the Cleveland Indians in 1968, and since the Giants and Indians played in different leagues, Dark would not have had occasion to be standing around the batting cage offering remarks to a sportswriter at a regular-season Giants game any time after 1964.", "Perhaps the basics are true but in this account Perry simply misremembered the year or some other details. However, we haven't found any contemporaneous account that corroborates the story: If Alvin Dark made a disparaging remark about Perry's hitting to sportswriter Harry Jupiter prior to 1969, the latter apparently didn't record it for posterity, leaving only unverifiable (and fragile) human memory to confirm the tale.", "While Alvin Dark himself didn't deny the story, he didn't exactly provide a wealth of detail when asked about it in June 2002:", "Long before the DH and interleague play created [a] midyear shift in rules, Perry joined the Giants as a rookie in 1962. He was peppering pitches in batting practice one day when Examiner reporter Harry Jupiter mentioned Perry's impressive swing to manager Alvin Dark. Dark scoffed, saying, \"Man will land on the moon before Gaylord Perry hits a home run.\"Fast forward to July 20, 1969, and a Giants-Dodgers game at Candlestick Park. The public-address announcer informed the crowd that Neil Armstrong had set foot on the moon. Soon thereafter, on that same historic day, Perry hit a homer to center field off Claude Osteen — the first of his career.", "\"Alvin was right,\" Perry said later, \"but only by an hour.\"", "Dark, who was managing the Cleveland Indians in '69, noticed the extraordinary timing of his former pitcher.", "\"It was just an expression,\" Dark recalled earlier this month of his man-on-the moon remark. \"I saw in the newspaper that he hit the homer. Then I saw his quote a couple of days later about me being right.\"", "Much as we'd like to push this one across the finish line into the \"True\" column, this account doesn't quite get us there. Alvin Dark sounds curiously vague about his prediction (i.e., he doesn't say so much that he remembers making the remark as he does that he recalls reading about it in the newspaper after Perry finally hit a home run).", "It's also somewhat puzzling why anyone would have supposedly singled out Gaylor Perry for jokes about his batting prowess in the mid-1960s.  Certainly Perry was no whiz with the bat compared to everyday players, but as a pitcher he wasn't expected to hit much, and his batting stats were about average for a pitcher of his era.  Other pitchers from the same period, such as Bill Hands and Dean Chance, were far worse in the batter's box than Perry was.  In fact, the worst of the lot might have been Perry's own teammate Ron Herbel, who managed a mere six hits in the entirety of his nine-year pitching career, good for a microscopic lifetime average of .029.", "Maybe this tale is true, and the memories of the participants -- as often happens -- have become fuzzy over time. Or maybe -- as also often happens -- this tale was made up after the fact, but it's such a good story that the participants now remember it as something that really happened at the time.", "Kroichick, Ron.   \"Pitchers at Plate — Few Hits, Many Tales.\"\r\n    The San Francisco Chronicle.   14 June 2002   (Sports; p. 1).", "Luciano, Ron.   Strike Two.\r\n    New York: Bantam Books, 1984.   ISBN 0-553-05049-4   (p. 279).", "Associated Press.   \"Perry Blasts 'Moon Shot' to Tighten Division Race.\"\r\n    Toledo Blade.   21 July 1969.", "Los Angeles Times.   \"Dark Was Right, But Just Barely.\"\r\n    8 October 1987   (Sports; p. 2).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]