["About this rating", "In June 2019, a Facebook user created a page called Storm Area 51, They Can't Stop All of Us. There, users jokingly suggested that anyone curious about what lay within the highly classified United States Air Force (USAF) facility should attempt to \"raid\" the base. While this event may have started in jest, some people truly did show up outside of Area 51 on Sept. 20, 2019.", "How many people showed up? Well, according to a viral picture floating around social media, thousands:", "This is not a genuine photograph of the crowd outside of Area 51 in September 2019. This picture was taken in November 2014 in Nikomazi, South Africa, during a \"crusade\" by the religious group In His Name Ministries:", "Each year, In His Name holds five to six mass crusades in towns and villages across Africa. These open-air events are organised together with the local churches and held over a minimum of four days. While our generous donors enable In His Name to fund everything, pastors and believers labour with our team to market and plan the event over a period of several months. All this hard work yields phenomenal results:", "At least one other miscaptioned picture was being spread as if it showed the crowd outside of Area 51 in September 2019:", "This image also wasn't taken at Area 51. While we have been unable to determine the source of the picture, a few red flags suggest it's fake. For one, the government facility in Nevada is not actually named \"Area 51.\" Area 51 is a colloquial name for a facility officially called Homey Airport (KXTA). In other words, it's highly unlikely that this facility has an \"Area 51\" sign on its fence.", "On closer inspection, the \"people\" in this photograph don't appear to be real humans — or aliens, for that matter. This picture seemingly shows a group of characters in a video game.", "While these photographs don't document the \"raid\" on Area 51, some people truly did show up outside of the government facility on Sept. 20. As far as we can tell, no earnest effort exists to \"storm the gates,\" and this \"raid\" has been non-violent.", "Mick Akers, a journalist for the Las Vegas Review Journal, reported that about 100 people showed up:", "About 100 extraterrestrial enthusiasts converged at the back gate of Area 51 near Rachel to follow through on the original Storm Area 51 plan...", "...Law enforcement officers blocked the road about a mile from the gate, with attendees walking the rest of the way. About a dozen officers were stationed at the gate, ready to act if anyone tried to breach the area. At the strike of 3 a.m. an officer with a police dog in tow, walked up from inside of the gates.", "Some of the crowd acted as if they were going to “storm” the gates, but stopped after getting laughs from the crowd, as Europe’s “Final Countdown” blared from a attendee’s speaker.", "Law enforcement officials were lighthearted for the most part about the gathering, joking with the crowd. They gave a stern warning to a man in a purple Lucha Libre mask for touching the gate as he posed for pictures.", "Akers also shared several authentic photographs and videos of the crowd that gathered outside of Area 51 on that date:", "Here’s a quick video of this morning’s Area 51 back gate gathering. #Area51 #StormArea51 pic.twitter.com/YUrlPzBxM2", "— Mick Akers (@mickakers) September 20, 2019", "In His Name Ministries.   \"Crusade Report: Nkomazi, South Africa.\"\r\n    30 November 2014.", "Criss, Doug.   \"Alien Enthusiasts Descend on Area 51 for an Event That Started as a Joke.\"\r\n    CNN.   20 September 2019.", "Akers, Mick.   \"Area 51 Crowd 'Storms’ Security Gate Early Friday — PHOTOS.\"\r\n    Las Vegas Journal Review.   20 September 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]