["The image was published on Facebook here on June 18, 2020.", "It has been shared more than 300 times after it was shared in a Facebook group \"Australians against radical Islam\", which has more than 100,000 followers.", "The top image features a red flag with a black and white cross. The letters \"AF\" can be seen at the intersection of the cross.", "The bottom image shows a similar red flag with black and white cross, except the letters \"AF\" have been replaced with a swastika, an ancient symbol used as the emblem of the Nazi Party.", "The text overlaid in the collage reads: “Does the new Antifa flag remind you of anything?”", "The collage was shared alongside a similar claim thousands of times here, here, here and here on Facebook; here and here on Twitter; and here on Instagram. It was also shared alongside the same claim in other languages, including here in Spanish.", "The collage circulated online in 2017 and 2018, but again gained traction in June 2020 after US President Donald Trump vowed on June 1 to designate the antifa movement as a terrorist organisation. The White House has since repeatedly blamed antifa for the ongoing Black Lives Matter protests and riots, AFP reported here.", "The claim in the posts, however, is false.", "Doctored image", "A reverse image search on Google with the top image found that the purported photo of the “Antifa flag” has been digitally manipulated from footage of a flag at a far-right protest in the UK in 2016.", "The video of the original flag was published on YouTube here in January 2016 by Ruptly, the Berlin-based video branch of Russia’s state-owned RT television network.", "The video is titled “UK: Violence erupts at National Front and far-right march in Dover, arrests made”. It shows a similar scene as seen in the top image. The person seen dressed in black, however, can be seen holding a flag with the letters \"NF\", not \"AF\".", "The \"NF\" flag, which can be seen on display at other far-right UK protests here and here, is associated with the National Front, a far-right political party in the UK.", "Below is a screenshot comparison of the top image in the misleading post (L) and the 2016 Ruptly video (R) with the key difference circled in yellow by AFP:", "While various flags about anti-fascist action have been seen at antifa protests -- as seen in AFP photos here and here -- the movement does not have a designated flag or emblem because it is not an organised group.", "“Antifa is a politics or activity not a group. In general the most common images that antifa groups tend to use are the flags [seen here and here],” Mark Bray, a historian and the author of “Antifa: The Anti-Fascist Handbook”, told AFP in a June 27 email.", "Associate Professor Stanislav Vysotsky, a sociologist whose research focuses on fascist and anti-fascist movements, also said in an email to AFP dated June 30: \"Because the antifascist movement is decentralised, there is no official flag or symbol. There is some consistency in the use of the overlapping flag symbol of Antifascist Action or the three arrows of the Iron Front, but this is not official in any way, and there is a great variety of symbolism used by antifa activists.\"", "Swastika flag", "Dr. Mark Pitcavage, a historian and expert on extremism in the US, said the bottom image shows a Nazi flag.", "“The other flag in question is a Reichskriegsflagge (military flag or war ensign) from the Nazi era. This was a military flag used by the various armed forces of Nazi Germany between 1935 and 1945,” he told AFP. “Ostensibly Hitler himself designed the flag.”", "The Nazi-era flag can also be seen in AFP photographs taken during the era, including this one in 1936 and this one in 1945.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]