["About this rating", "As a polar vortex caused temperatures to plummet in many areas of the North America in January 2019, a set of cute photographs purportedly showing a bird (variously described as a goose or a duck) helping to keep a puppy warm circulated on social media. The most popular posting of these photographs (which garnered more than 235,000 shares within a week) was accompanied by a brief piece of text supposedly explaining the back story of the images:", "A man finds a goose that was shaking with cold stuck to a pole in Montana. When approaching, the surprise is capital. The goose was sheltering with her wings a puppy that was about to die frozen.", "We have so much to learn as a species ...", "These images appear to be real. However, they weren't taken recently, we've found no evidence that either animal was \"stuck to a pole,\" and we're skeptical that these photographs were snapped in Montana (or anywhere in the United States).", "These photographs have been circulating on Chinese social media sites and news platforms, such as Weibo and Toutiao, since 2017. The earliest posting that we could uncover came from March of 2017 in a blog post on the Chinese news platform NetEase.", "The accompanying story (roughly translated via Google) relayed a similar message to the viral Facebook post. According to NetEase, the dog was shivering on the side of the road when it was by encountered a group of ducks. The mother duck then put the pup under its arms in order to keep it warm:", "The puppy was shivering coldly on the side of the road. Even the passing ducks couldn’t see it. But one puppy ran straight at the puppy and hugged it to keep it warm.", "When the dog was hugged by the duck, it did not struggle and was safely taken in the duck's arms. It can be seen that the ducks have more love, and that mother love is great.", "In the care of the mother duck, the puppy no longer has to be afraid of being cold, and only this kind of particularly caring duck mother will do this. The average animal will not be like this for children who are not their own.", "A note at the bottom of this story states that NetEase allows users to post their own content, and that the story solely represents the words of the author. In other words, no verification process takes place.", "The story published to Netease didn't provide many specifics about the photographs (such as where they were taken), and we haven't been able to find any previous reports about them. While we can't say for sure what these pictures capture, they have been circulating online on Chinese social media sites since at least 2017 and were most likely taken somewhere in that country. The superfluous claim about the duck's being \"stuck to a post\" was added after the fact and appears to have been invented in an attempt to raise the stakes (and shareability) of this content.", "Although the back story behind these particular photographs may be unclear, it isn't unprecedented for birds and dogs to strike up friendships. A pelican in Turkey named Osman became a bit of a local celebrity after befriending a dog.", "Gibbens, Sarah.   \"The Polar Vortex, Explained.\"\r\n    National Geographic.    6 February 2019.", "NetEase.com.   \"小狗被冻得发抖，鸭子路过一看，立马抱住小狗取暖\"\r\n    23 March 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]