["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Denver Broncos football team found themselves without a quarterback for their recent game against the New Orleans Saints after the league discovered some of the team’s players had been maskless around another player who tested positive for COVID-19.", "But the Broncos didn’t quickly sign former San Francisco 49ers quarterback Colin Kaepernick to step in, as a recent Facebook post claimed.", "\"Breaking,\" the post said. \"Broncos signing Colin Kaepernick.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Kaepernick, who led the 49ers to the Super Bowl XLVII in 2013, has not played in the NFL since the 2016 season, when he began protesting police violence against Black Americans by sitting or kneeling during the pregame national anthem. In 2019, he and the NFL settled a grievance alleging that the league and team owners colluded to keep him out of football.", "For the Nov. 29 game against the Saints, the same COVID-19 protocols that prevented four eligible quarterbacks on the Broncos active roster from playing also precluded the team from signing Kaepernick.", "News broke on Nov. 28 that the quarterbacks wouldn’t be able to play in the game the next day. It would have taken at least six days for Kaepernick to be eligible to play under the NFL’s COVID-19 rules. New players must remain in isolation for six days before joining a team.", "Kendall Hinton, a practice squad receiver for the Broncos, filled in as quarterback on Nov. 29. The Broncos lost to the Saints 31-3.", "We rate this Facebook post False.", "Facebook post, Nov. 28, 2020", "The Associated Press, Hill leads Saints to 31-3 rout of QB-challenged Broncos, Nov. 30, 2020", "NBC Sports, Why Broncos can’t sign Kap to pay QB on Sunday vs. Saints, Nov. 28, 2020", "Fox News, NFL rules wouldn’t allow Colin Kaepernick to help COVID-19 stricken Broncos, Nov. 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]