["About this rating", "In January 2011, a black-and-white photograph began popping up on joke web sites, apparently showing Nobel Prize-winning physicist Albert Einstein pedaling a bicycle away from an atom bomb explosion in the desert. It has been meme fodder ever since.", "Though it has occasionally been presented as authentic, the tableau depicted in the photo is preposterous on the face of it and more likely to elicit laughter than credulity. In point of fact, it's a composite image constructed using two different photographs taken 29 years apart.", "The portion of the image showing Einstein on a bike was clipped (and flipped horizontally) from a photograph of the scientist taken by California Institute of Technology trustee Ben Meyer on 6 February 1933 in Santa Barbara:", "The background image of military and civilian observers watching a nuclear explosion in the desert was taken on 14 July 1962 — seven years after Einstein's death — at the Frenchman Flat nuclear test site in Nevada. The occasion was the so-called \"Small Boy\" detonation, one of a series of four tactical nuclear warhead tests conducted that year by the U.S. Department of Defense:", "In terms of historical accuracy, while it's true that Einstein's early theoretical work was instrumental in the conception and creation of the atomic bomb years later, Einstein himself played no practical part in that endeavor. Nor is there any public record of his having attended a nuclear weapons test.", "The image does resonate in an interesting way with two statements often attributed to Albert Einstein. One has never been substantiated and is generally considered apocryphal:", "I thought of [the theory of relativity] while riding my bicycle.", "The other is paraphrased from a letter written by Einstein to his son, Eduard, on 5 February 1940:", "Life is like riding a bicycle. To keep your balance you must keep moving.", "Isaacson, Walter. Einstein: His Life and Universe.\r\n  New York: Simon & Schuster, 2007. ISBN 0743264738.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]