["About this rating", "U.S. President Donald Trump was impeached by the Democratic-controlled U.S. House of Representatives on Dec. 18, 2019. The House had brought two articles of impeachment against Trump: obstruction of Congress and abuse of power. The charges stemmed from accusations that Trump attempted to extort Ukrainian President Volodymyr Zelensky by holding up crucial military aid in exchange for damaging information about one of Trump's potential 2020 presidential rivals.", "During a Senate impeachment trial that concluded on Feb. 5, 2020, Trump's Republican allies in control of the Senate voted to acquit him (with one Republican, Mitt Romney, voting to convict).", "Some Snopes readers inquired about an interview given by U.S. House Speaker Nancy Pelosi to CNN anchor Christiane Amanpour on Feb. 15, 2020, in which Pelosi appeared to claim that Trump was not really acquitted in the Senate.", "In the interview, Pelosi said that because Trump's Senate trial included no evidence or witnesses, the word \"acquittal\" does not apply. She said, \"You can't have an acquittal unless you have a trial. You can only have a trial when you have witnesses and documents. So he can say he's acquitted and the headlines can say acquitted. But he's impeached forever, branded with that, and not vindicated.\"", "Pelosi was referencing the fact that a slim majority of Senate Republicans had voted against admitting new witness testimony and documentary evidence into the trial, which was a strong point of contention with Democrats. For example, John Bolton, Trump's former national security adviser, stated publicly that he would have been willing to testify if called.", "Pelosi's opinion about the legitimacy of the Senate trial aside, Trump was in fact acquitted of the allegations made in the two articles of impeachment, with Republican majority votes to do so cast mostly along party lines.", "The impeachment process shares some terminology with the criminal justice system, including employing terms like \"trial,\" \"acquittal\" and \"conviction.\" However impeachment is a distinct process spelled out in the Constitution and has its own set of rules and procedures. As we reported in October 2019:", "People often use the word “impeachment” when referring to the removal of a president from office. But that’s not exactly how it works. The House of Representatives has the “sole Power of Impeachment,” as stated in Article I, Section 2, Clause 5 of the U.S. Constitution. But it is up to the Senate to convict and remove a president from office. In this way, “impeachment” is roughly akin to bringing formal charges against an individual. It is then up to the Senate to convict the individual on those charges.", "Unlike in criminal cases, guilt and punishment are not determined separately in an impeachment trial. Further, unlike in a criminal case, the Senate has the sole discretion to determine the rules of the trial. Therefore, one can't determine that because senators acquitted a president they found him \"not guilty\" of what he was accused of doing. An acquittal by the Senate could simply imply that they determined whatever he supposedly did didn't merit removal from office.", "In this case, even Republicans didn't really argue that Trump hadn't actually committed the acts that formed the basis of impeachment — they just argued that the dispute should have gone through the regular court system first, or that his behavior wasn't a serious enough infraction to boot him from office. That's another difference with the criminal justice system: In impeachment cases, you can't charge someone with lesser crimes or impose a lesser sentence — it's all or nothing.", "Impeachment is a historical rarity. Only three presidents in history have been impeached by the House: Trump, Bill Clinton in 1998, and Andrew Johnson in 1868. All were acquitted, meaning that never in the history of the United States has the Senate voted to convict and remove a president from office. Although Richard Nixon famously faced impeachment amid the Watergate scandal, he resigned from office before he was impeached by the House.", "Wilkie, Christina and Yelena Dzhanova. \"Senate Votes Against Calling New Witnesses in Trump’s Impeachment Trial.\"\r\n  CNBC. 31 January 2020.", "U.S. House of Representatives, History Art & Archives. \"List of Individuals Impeached by the House of Representatives.\"", "Strauss, Valerie. \"History Lesson: Richard Nixon Was Not Impeached.\"\r\n  Washington Post. 29 May 2017.", "C-SPAN. \"U.S. Senate ACQUITS President Trump on Article I: Abuse of Power, 48-52.\"\r\n  YouTube. 5 February 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]