["An article shared more than 14,000 times on Facebook claims the Nigerian government gave N20,000 ($52) to “everyone” across the country’s 36 states. This is false; the article in question shares a true story but uses an unrelated and misleading headline. Nigeria has a social investment programme to help the poor and handed out cash and food during the lockdown, but not to all citizens.", "One post, shared over a thousand times on Facebook and archived here, has been generating anger among some commenters, after the person who posted it suggested authorities were lying about giving financial help to all citizens.", "The same article has been shared in other posts here, here and here.", "Before the outbreak of the novel coronavirus disease (COVID-19), the Nigerian government had instituted a social investment programme (SIP) in partnership with the World Bank. Vice President Yemi Osinbajo, who spearheaded the programme, said in October 2019 that “two million informal traders” had benefitted from the programme, stating that its “conditional cash transfer scheme” is “meant to cover over a million of the poorest in our communities”.", "The programme provides low-interest loans to small businesses and smallholder farmers, offers jobs and training to unemployed people, and gives cash handouts to the poor and vulnerable. It also has a national school feeding programme, which provides a meal a day for pupils in government-run schools across Nigeria.", "During Nigeria’s lockdown, to slow the spread of COVID-19 across certain states, President Muhammadu Buhari ordered distribution of food items and cash to the most vulnerable in society for two months. Rice, beans and other staples were part of the programme from authorities to feed some of the poor and attempt to cushion the blow as shops and businesses were forced to shut. However, these handouts were for the most vulnerable in the country -- not for everyone.", "I have also directed that the current Social Register be expanded from 2.6 million households to 3.6 million households in the next two weeks.", "The misleading article with the headline “How We Gave N20,000 & Food Items To Everyone In 36 States — Minister” does not actually go on to say anything about handing out cash and food parcels to all Nigerians.", "The body of the story talks about digitising the payment of cash transfers to the poor. A Google search of the first paragraph of the story shows it was copied word-for-word from this Vanguard newspaper report on digitising the SIP.", "The article featured a photo Sadiya Umar-Farouq, the minister of humanitarian affairs, disaster management and social development. Contacted by AFP Fact Check, Halima Oyelade, special adviser to the minister, said that Umar-Farouq had made no such statement. She explained that the social investment programme is not for all Nigerians.", "“The scheme has been in existence since 2016, and we have a national register, which has the names of the poorest of the poor in Nigeria, who benefit from the programme,” she said. \"We got these names from working with the community.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]