["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump recently said that any Jews who vote for Democrats show \"either a total lack of knowledge or great disloyalty.\" Did Pope Francis say something similar about Catholics?", "That’s what an Aug. 26 Facebook post alleges, attributing this quote to the head of the Catholic Church: \"You cannot call yourself ‘Catholic’ and vote Democrat. It is a grave sin, one for which there is no redemption.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Searching for the quote online we found no results. We also didn’t discover any evidence that Pope Francis has condemned Americans who vote for Democrats.", "There are about 51 million Catholic adults in the United States, and today they’re evenly split between the Republican and Democratic parties, Pew Research Center reported in January. White Catholics are more likely to vote Republican, and Hispanic Catholics \"overwhelmingly back Democrats.\"", "Republican and Democratic Catholics both used to admire Pope Francis, according to Pew, but he’s become an increasingly polarizing figure in the church. Democrats and Democratic-leaning Catholics view him more favorably than Republicans and Republican-leaning Catholics. Republican Catholics are much more likely than Democratic Catholics to say he’s \"too liberal\" and \"naive.\" Most Catholic Democrats say he’s doing an excellent or good job of spreading the Catholic faith.", "We rate this Facebook post False.", "Facebook post, Aug. 26, 2019", "Associated Press, \"Trump: Any Jew voting Democratic is uninformed or disloyal,\" Aug. 21, 2019", "Religion News Service, \"Pope Francis: God redeemed everyone, ‘not just Catholics,’\" May 22, 2013", "Pew Research Center, \"Like Americans overall, U.S. Catholics are sharply divided by party,\" Jan. 24, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]