["About this rating", "In late January 2019, a meme that referenced a 2016 Swedish crime story and contained some measure of unverified information circulated on social media:", "What information is publicly available about this case holds that a 15-year-old boy, identified as Arminas Pileckas, was allegedly stabbed by a 14-year-old schoolmate around lunchtime in the small southern town of Broby in the Swedish county of Skane on 11 January 2016. The victim was taken to a hospital, where he died of his injuries.", "The narrative shared in the meme reflects the talking points favored by anti-immigration partisans in both Europe and the U.S. in regards to the tragedy. As the digital media outlet Vocativ reported, \"Anti-immigrant groups, websites and supporters are now seizing on the school stabbing story in Sweden — and the rumors it’s inspired — as the latest tale of barbaric migrants run amok.\"", "For instance, the right-leaning Swedish website Fria Tider reported that Pileckas \"was stabbed to death by a student from the Arab world after protecting a girl whom the killer had harassed.\" In the U.S., Breitbart ran with a similar headline: \"15 Year Old Boy Was Stabbed to Death by Arab Migrant Because He Was Protecting Young Girl from Sex Assault.\"", "Although such sites cast Pileckas as a hero, criminal proceedings involving children aren't public in Sweden, so media reports about the motive for the killing are drawn from interviews given by the parents of both children and have not been verified by authorities.", "Nils Karlsson, a member of the municipal council in the Swedish city of Malmö, said those with detailed knowledge about the case are prohibited from commenting on it publicly because of the young age of the offender. \"He was turned over to social services and they operate under very strict secrecy. So those who know more about the case are forbidden by law to talk about it. I highly doubt that Fria Tider has access to accurate information about any motives,\" Karlsson told us.", "Both children were immigrants: Pileckas' family is from Lithuania, while the 14-year-old suspect is from Syria. As is customary in Sweden, authorities don't furnish personal information about suspects, particularly minors, and Swedish legacy media outlets typically don't publish it. Discussion about motives initially surfaced on social media and reports from news outlets operating in the native languages of the suspect and victim. Stockholm-based Arabic language publication Al Kompis identified Pileckas' killer as Ahmed Mustafa al-Haj Ali.", "In interviews given to Lithuanian-language news outlets, including Lrytas.lt and the Baltic publication Delhi.lt, the murder victim's father, Žydrūnas Pileckas, said his son was killed because he had defended a female student against harassment from Ali. The Swedish tabloid Expressen did report an incident that involved the victim, the suspect, and other students in November 2015 that possibly led to the stabbing, but it didn't go into detail about what happened. According to Expressen, Arminas Pileckas reportedly \"protected a classmate against the 14-year-old and urged [that] the classmate be left alone.\" But Expressen didn't state that classmate's gender or ethnicity and didn't mention sexual harassment or assault.", "Ali's father, Mustafa al-Hajj Ali, told Al Kompis that Pileckas had been bullying his son but adults at the school had failed to intervene. Vocativ published a widely-shared video that purported to show Pileckas slapping the suspect, then chasing him down a hallway, but the video didn't show what led to the encounter. Ali's father told Al Kompis that the video was originally shared on the social media platform Snapchat as part of a bullying campaign against his son.", "The claim that Pileckas was protecting a girl from sexual assault may have morphed out of various unconfirmed reports about the murder investigation alongside widespread but unfounded Internet rumors labeling Sweden the \"rape capital of Europe\" — a claim pushed by anti-immigrant activists who exploited an influx of Arabic-speaking refugees to Sweden in 2015 for political purposes. But that claim is not corroborated by any official reports, and it's unlikely that law enforcement in Sweden would do so given the privacy laws applying minors there.", "We have reached out to Swedish police to see if they can verify any additional details of the case and are awaiting a response.", "TT/The Local.   \"Swedish Pupil Dies in Hospital After 'Stabbing.'\"\r\n    11 January 2016.", "Aftonbladet.   \"Dad: He Was Bullied - But Got No Help.\"\r\n    12 January 2016.", "Expressen.   \"Arminas, 15, Skrev Själv Om Konflikten.\"\r\n    14 January 2016.", "Lrytas.lt.   \"Prabilo Švedijoje Nudurto 15-Mečio Tėvai.\"\r\n    12 January 2016.", "Al Kompis.   \"The Father of the Boy Who Killed His Classmate Talks to the Combs About What Happened.\"\r\n    12 January 2016.", "Kavanaugh, Shane Dixon.   \"How a School Stabbing Became an Anti-Immigrant Rallying Cry.\"\r\n    Vocativ.   14 January 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]