["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Did the Great Emancipator support slavery measures?", "Over the years, PolitiFact has verified some interesting trivia about Abraham Lincoln.", "A claim that wrestling was one of Lincoln’s favorite sports he’s in the National Wrestling Hall of Fame, it turns out) was rated True. So was a claim that Lincoln once slipped out a window in an attempt to prevent vote in the Illinois Legislature.", "Now comes a more serious claim -- that the Great Emancipator once supported slavery measures.", "U.S. Rep. Paul Ryan, R-Wis., made the statement in a speech April 11, 2013 to the Susan B. Anthony List, a group that seeks to elect pro-life women to Congress.", "The potential 2016 presidential candidate invoked Lincoln in arguing that abortion opponents should try to appeal to \"the broadest audience\" by working, when possible, with abortion rights supporters.", "\"Our forebears knew to strive for perfection, not to expect it -- because mankind is flawed. Progress takes time. It takes work. And it takes common sense,\" Ryan said midway through his speech, entitled \"Building a Coalition for Life.\"", "\"Take Lincoln. He hated slavery as much as anyone. But he defended a law that preserved it. He supported the Compromise of 1850, which prohibited slavery in California but allowed it in New Mexico. He even backed a law to return runaway slaves to their owners.\"", "Lincoln agreed to compromises, Ryan asserted, \"if they brought him closer to his goal -- even in just a small way. We all know what happened. After years of turmoil, he helped pass the Thirteenth Amendment, which ended slavery for good.\"", "We’ll check the two specific parts of Ryan’s claim -- that Lincoln supported an agreement that allowed slavery in New Mexico \"and a law to return runaway slaves to their owners.\"", "Ryan’s position", "Asked to back Ryan’s statement, his press secretary, Kevin Seifert, cited this passage from Lincoln, a biography by historian David Herbert Donald:", "Lincoln \"did not call for the elimination of slavery in all national territories; he stood pledged to the Compromise of 1850, which allowed New Mexico and Utah to tolerate or to forbid slavery. He accepted the Fugitive Slave Act, though he suggested it should be modified so that it would ‘not in its stringency, be more likely to carry a free man into slavery, than our ordinary criminal laws are to hang an innocent one.’\"", "Seifert also cited a document that notes that the Compromise in 1850, which admitted California into the Union as a free state and allowed New Mexico, then a territory, to decide whether to allow slavery.", "To dig further, we consulted eight Lincoln experts. They generally agreed Ryan’s statement is partially accurate, but lacks key details.", "New Mexico and slavery", "While Ryan said Lincoln \"supported\" the Compromise in 1850, Lincoln was actually semi-retired from politics at the time, having left Congress a year earlier (he wasn’t elected president until 1860).", "At the time of the compromise Lincoln did not express support  for it, according to several experts, including Lincoln biographer Ronald C. White Jr.; Michael Burlingame, a Lincoln scholar at the University of Illinois-Springfield; and Columbia University historian Eric Foner.", "As president, Lincoln did agree to a proposal that would have admitted New Mexico as a state, said Lincoln biographer James McPherson. So in that sense, he could be said to have supported the Compromise of 1850, in that New Mexico had opted to approve a slave code. On the other hand, McPherson said, no slaves were counted in New Mexico in the 1860 census, which indicates slavery had not taken hold there.", "Fugitive Slave Act", "Similarly, Lincoln as president held that the federal government needed to abide by the Fugitive Slave Act, mandating for the return of runaway slaves, given that it was the law of the land. But, McPherson noted, Lincoln wanted legislation to give alleged fugitive slaves a trial before they could be returned.", "\"He did feel there was no choice but to defend the legality of the Fugitive Slave Act once it became law, and even said so in his first inaugural address -- but here some context is needed, too,\" said Lincoln scholar Harold Holzer. \"He refused to oppose so-called ‘personal liberty laws’ that were passed by northern states to justify disobedience to the Fugitive Slave Act.", "\"So, in sum, Lincoln always opposed slavery,\" said James Cornelius, curator at the Abraham Lincoln Presidential Library & Museum. \"But he also held, privately and out loud, that federal law must be obeyed.\"", "Our rating", "Ryan said Abraham Lincoln supported an agreement that allowed slavery in New Mexico \"and a law to return runaway slaves to their owners.\"", "He goes too far. Lincoln backed an agreement that allowed New Mexico to decide whether it would allow slavery. And Lincoln held that the federal government needed to abide the return of runaway slaves, given that was the law of the land, but he didn’t support it.", "Ryan’s statement is partially accurate, but leaves out important details. That fits our definition for Half True.", "U.S. Rep. Paul Ryan, speech, April 11, 2013", "Email interview, U.S. Rep. Paul Ryan press secretary Kevin Seifert, April 15, 2013", "Lincoln, page 181", "U.S. Senate, \"The compromise of 1850\"", "Interview, Yale University American history professor David Blight, April 15, 2013", "Interview, Lincoln biographer Ronald C. White Jr., April 15, 2013", "Interview, Lincoln biographer James McPherson, April 15, 2013", "Email interview, Abraham Lincoln Presidential Library & Museum curator James Cornelius, April 15, 2013", "Email interview, Columbia University historian Eric Foner, April 15, 2013", "University of Illinois-Springfield Lincoln scholar Michael Burlingame, April 15, 2013", "Email interview, Lincoln scholar Harold Holzer, April 15, 2013", "Interview, Lincoln biographer James McPherson, April 15, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]