["About this rating", "In July 2017, various news articles reported that a Wisconsin company Three Square Market would be offering its employees the opportunity to have a microchip implanted under their skin.", "On 24 July, Minnesota ABC affiliate KSTP reported:", "A Wisconsin company is about to become the first in the U.S. to offer microchip implants to its employees. Yes, you read that right. Microchip implants.", "The story went international, with the BBC, Daily Mail, RT, and Australia's 9 News network all covering it. We have received several emails from readers wondering about the veracity of these articles.", "Three Square Market (also known as 32M), a company that specializes in  vending machines and office break room self-service software is indeed offering its employees the chance to have a microchip implanted in their hands.", "This basic fact is accurately captured in the various news reports that emerged on 24 and 25 July 2017. However, what must be emphasized, and what some articles do not specify in their headlines, is that the implantation is entirely optional for employees.", "A blog post on the company's web site states:", "Three Square Market (32M) is offering implanted chip technology to all employees. Company employees will have the option to voluntarily implant an RFID [radio frequency identification] microchip between the thumb and forefinger underneath the skin... The RFID chip will allow employees to make purchases in the company’s break room market, open doors, login to computers, use copy machines, among other things.", "The RFID microchip uses the same near field communication technology (NFC) employed in contactless payment systems like Apple Pay.", "The company is also offering its workers a wristband with a RFID microchip attached to it, \"for employees interested in the technology, but not the implant...\"", "According to a company press release on 20 July 2017, the roughly 50 workers who are expected to opt for the microchip will have it implanted on 1 August 2017.", "Three Square Market's CEO Todd Westby said he envisions the microchips being used for a variety of purposes at the company:", "We foresee the use of RFID technology to drive everything from making purchases in our office break room market, opening doors, use of copy machines, logging into our office computers, unlocking phones, sharing business cards, storing medical/health information, and used as payment at other RFID terminals.  Eventually, this technology will become standardized, allowing you to use this as your passport, public transit, all purchasing opportunities, etc...", "In its blog post, the company said that the microchip does not have GPS (Global Positioning System) capabilities and is not trackable.", "In 2015, the Stockholm, Sweden office complex Epicenter began offering RFID microchip implants to the employees of companies based there, but we could find no news report or public announcement of any United States company doing so prior to July 2017, suggesting Three Square Market really is the first in the country to try it.", "Biohax, the Swedish company behind that initiative, is also working with Three Square Market on their microchip implants.", "Rosenthal, Josh.  \"Wisconsin Company to Implant Microchips in Employees.\"\r\n  KSTP.  24 July 2017.", "BBC News.  \"Wisconsin Company Three Square Market to Microchip Employees.\"\r\n  BBC.com.  24 July 2017.", "Edwards, Valerie.  \"Wisconsin Company Announces it Will Be Installing Microchips in Their Employees - but Insists There's No GPS Tracking.\"\r\n  Daily Mail.  23 July 2017.", "RT.  \"Handy Way to Pay: US Firm Plans to Fit Employees With Microchip Implants.\"\r\n  RT.com.  23 July 2017.", "9News.  \"American Company Microchips Employees With Device the Size of a Grain of Rice.\"\r\n  9News.com.au.  24 July 2017.", "Cellan-Jones, Rory.  \"Office Puts Chips Under Staff's Skin.\"\r\n  BBC.com.  29 January 2015.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]