["About this rating", "A preliminary and limited study demonstrated a correlation between the early stages of Alzheimer’s and the reduced ability to detect odor in a person’s left nostril compared to their right, utilizing peanut butter as the source of odor.", "This study, which was published in 2013 and had a sample size of only 94 patients (of which only 18 had been diagnosed with Alzheimer's), was not large enough to be conclusive; later attempts to replicate its results have failed or were based on similarly limited sample sizes.", "On 7 December 2016, celebrity spokesperson for the United States' number-one selling kitchen appliance David \"Avocado\" Wolfe (who believes, among other things, that the oceans contain salt to prevent water from levitating away from the planet's surface) published an article titled “Here’s How You Can Use Peanut Butter To Diagnose Alzheimer’s Disease!”", "In it, he states:", "Using just a scoop of peanut butter and a ruler, clinicians have discovered a way to change lives and provide an early diagnosis for Alzheimer’s. [...]", "The study involved participants with Alzheimer’s and other forms of dementia. Participants were asked to close their eyes and attempt to detect an odor with one nostril at a time. Researchers used a small container of peanut butter to measure the distance from each nostril that the participants were able to detect the odor. The study found that people with Alzheimer’s disease have a harder time detecting odors from their left nostril when compared to their right nostril. [...]", "So why peanut butter? Because it has a strong, familiar smell. People with Alzheimer’s can lose their ability to smell even before memory problems arise.", "This article cites a single 2013 study (titled “A brief olfactory test for Alzheimer's disease”) published in the Journal of the Neurological Sciences which reported the observation that individuals diagnosed with early stages of Alzheimer’s disease consistently displayed a reduced ability to smell out of their left nostril, relative to their right. The study, which measured the distance away from each nostril from which a patient could first smell a 14g container of peanut butter, reported:", "A left nostril impairment of odor detection was present in all the patients with probable AD. This pattern of odor detection was not present in the older control group in which detection distances were symmetric across the nostrils and was absent in the patients with other dementias whose detection distances were either symmetric or asymmetric with a right nostril impairment.", "This idea is not as crazy as it might sound at first blush. That damage to one’s olfactory senses correlates with some forms of dementia is not new science, and it has a well-established basis, as covered in a 2015 review on the topic:", "The areas that evidence early neuropathy in Alzheimer’s disease, particularly in the mesial temporal lobe, are areas that, in addition to their well known importance for memory function, are also critical for the processing of olfactory information.", "The authors of the 2013 study indicated that their results should be considered preliminary, as their sample size was too small to be conclusive. They called for further research into the question, as its utility as a non-invasive diagnostic would be groundbreaking.", "In 2014, another team of researchers grabbed the baton and attempted to replicate the results of the 2013 study. They concluded:", "The present study throws into question the findings of Stamps et al. that AD is associated with lateralized asymmetry of olfactory dysfunction. While the possibility exists that such asymmetry might occur in a few well-selected cases, our research clearly indicates that such a phenomenon is not a general one and cannot be relied upon in diagnosing AD.", "A 2015 study further complicated this story when it demonstrated a positive correlation, similar to the 2013 study, between mild cognitive impairment (which often, but not always, leads to Alzheimer's) and asymmetry in nostril olfactory function. This study, however — like the 2013 paper — utilized a small sample size, and argued that more research was necessary for any conclusive clinical application to be developed.", "This is a common tactic employed by Wolfe: He frequently cites out-of-date preliminary studies without proper context to make a highly shareable tidbit of what is ultimately false or misleading information. In the case of this peanut butter test, it is best to follow the advice of the 2013 study's lead researcher, Jennifer Stamps, herself, when she was interviewed about her preliminary findings by NPR in 2013:", "Don't try this at home. Having slight differences between your left and right nostrils is normal, and you might end up freaking out over nothing.", "davidwolfe.com.   \"Here’s How You Can Use Peanut Butter To Diagnose Alzheimer’s Disease!\"\r\n    7 December 2016.", "Stamps, Jennifer, J., et al.    \"A Brief Olfactory Test for Alzheimer's Disease.\"\r\n    Journal of the Neurological Sciences.   15 October 2013.", "Velayudhan, L.    \"Smell Identification Function and Alzheimer's Disease: a Selective Review.\"\r\n    Current Opinion in Psychiatry.   March 2015.", "Doty, Richard L., et al.    \"The Lateralized Smell Test for Detecting Alzheimer's Disease: Failure to Replicate.\"\r\n    Journal of the Neurological Sciences.   15 May 2014.", "Huart, C., et al.    \"Unirhinal Olfactory Testing for the Diagnostic Workup of Mild Cognitive Impairment.\"\r\n    Journal of Alzheimer's Diseases.   15 May 2014.", "Singh., Maanvi.    \"Why A Peanut Butter Test For Alzheimer's Might Be Too Simple.\"\r\n    npr.org.   11 October 2013.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]