["About this rating", "Some businesses in Sweden have begun experimenting with 6-hour workdays.", "Sweden has not officially moved to implement a nationwide shorter workday.", "On 7 September 2016, the Facebook page \"Smart Is the New Sexy\" posted a video reporting that \"Sweden is officially moving to a six-hour workday,\" thus promulgating a false rumor that has been circulating online for at least a year now:", "The business publication Fast Company reported in September 2015 that some companies in Sweden were experimenting with a shorter workday, but other online outlets that picked up the story distorted it, and soon the Internet was full of articles claiming that all of Sweden was moving to a 6-hour workday.", "On 1 October 2015, the Swedish newspaper The Local responded to these rumors, explaining that while some businesses may be trying out a 6-hour workday, this change is a purely experimental and voluntary one that has not been mandated by law nor implemented nationwide:", "International media have gone crazy for the idea that Swedish employers are introducing a six-hour work day, but for those of us living in the Nordic nation, the hype has little to do with the reality, writes The Local's Editor Maddy Savage.", "Just before lunchtime, I got a call from a major UK broadcaster asking if I could help out with a feature on what the producer described as \"Sweden's new six-hour work day\". He said he had \"spotted a story about it in the Sydney Morning Herald\".", "I turned down the request politely. I usually love sharing my knowledge of Sweden and my experiences of living here when approached by global media. But on this occasion I was unable to. Because the idea that there's a been mass shift towards shorter days in my adopted home simply isn't true.", "Toyota centres in Gothenburg, Sweden’s second largest city, moved to shorter days 13 years ago. A district council in Kiruna, in Sweden's far north offered 250 staff a six-hour work day in the 1980s (scrapping the method in 2005).", "The most high-profile case in recent months is of a retirement home in west Sweden which started trialling a six-hour day in February, following long discussions about the experiment. A hospital in Gothenburg followed suit.", "Since then a few companies have announced that they are also testing the concept, including a number of startups quite obviously hoping to make a name for themselves. These include Filimundus, an app developer based in Stockholm which must be cracking open some Swedish 'snaps' this week after being quoted by media across the globe, and Background AB, a creative communication agency in Falun, Dalarna.", "Most of those trialling the idea have reported a positive impact, from increased efficiency to better communication and fewer staff sick days. So, it makes sense that other companies could soon start taking up the mantle.", "But, the idea that Swedish firms are currently queuing up to offer their staff even shorter contracts than they do now is quite simply wrong.", "Fernandez, Camila-Catalina.   \"No, Sweden Is Not Enforcing a Six-Hour Work Day.\"\r\n    Vice.   7 October 2015.", "Peters, Adele.   \"Why Sweden Is Shifting to a 6-Hour Workday.\"\r\n    Fast CoExist.   29 September 2015.", "Savage, Maddy.   \"Why Sweden Is a Long Way from Six-Hour Days.\"\r\n    The Local.   1 October 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]