["About this rating", "In early August 2020, Snopes readers asked whether the following meme shared across social media accurately quoted U.S. President Donald Trump's commenting on the United States Postal Service and voting by mail:", "This quote appears to be a fabricated one.", "Although the meme's text states that Trump made the remark on a talk radio show hosted by Fox News personality Sean Hannity on July 30, 2020, Trump wasn't a guest on  Hannity's AM radio talk show  that day.", "It's true that Trump has repeatedly disparaged mail-in voting, falsely stating  that voting by mail leads to rampant election fraud (except in Florida). He even appeared to suggest in a tweet, which prompted widespread backlash, that the November 2020 election should be delayed because the widespread use of mail-in ballots during the ongoing pandemic would compromise the results.", "Some concern has also been expressed that Trump has reduced the effectiveness of the Postal Service with budget cuts, as The New York Times reported: \"Fueled by animus for Jeff Bezos, the founder of Amazon, and surrounded by advisers who have long called for privatizing the post office, Mr. Trump and his appointees have begun taking cost-cutting steps that appear to have led to slower and less reliable delivery.\"", "However, we found no evidence that Trump made the remark in the above-displayed meme. It wasn't posted to his Twitter account or recorded in any statements transcribed by the White House. And Trump was not a guest on the Hannity show on July 30, 2020, so he didn't make the remark there, as suggested by the meme.   These words appear to be someone else's paraphrase of what they assumed Trump was thinking or planning.", "We therefore rate this claim \"False.\"", "Lee, Jessica.   \"Do Mail-In Ballots Increase Risk of Voter Fraud?\"\r\n    Snopes.com.   26 May 2020.", "Welna, David.   \"Citing Election Delay Tweet, Influential Trump Ally Now Demands His Re-Impeachment.\"\r\n    NPR.   31 July 2020.", "Shear, Michael D. et al.   \"Mail Delays Fuel Concern Trump Is Undercutting Postal System Ahead of Voting.\"\r\n    The New York Times.   31 July 2020.", "Freking, Kevin.   \"Trump Encourages Mail Voting in Florida But Sues in Nevada.\"\r\n    The Associated Press.   5 August 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]