["About this rating", "In late September 2020, rumors circulated online alleging sexism on the part of U.S. Senate Majority Leader Mitch McConnell because, allegedly, he would not participate in election debates that included female moderators.", "The claim stemmed from McConnell's 2020 race against Democratic challenger Amy McGrath for a Kentucky U.S. Senate seat. McConnell, a Republican who is seeking a seventh term, allegedly refused to participate in debates with McGrath that featured one or more women as hosts, per social media posts and media reports.", "\"McConnell refuses to appear in debates with female moderators,\" a press release from Kentucky's Democratic Party said.", "To determine the validity of the allegation, we first researched where it originated.", "According to the Louisville Courier Journal, the campaigns for McConnell and McGrath sent letters challenging each other to debate in August 2020.", "Over the course of weeks, the two candidates sparred over debate details, and each accepted invitations to different forums — including an Oct. 12 event co-hosted by Gray TV-owned news stations and the University of Kentucky's student government. As of late September, only McConnell had confirmed his participation in that debate.", "Meanwhile, McGrath said her participation in the Oct. 12 event hinged on whether organizers would include a female moderator, per local news reports.", "According to the Journal, McGrath claimed event planners originally planned to have two television news anchors — a woman and a man — host the candidates, but organizers dropped the female moderator after \"negotiating\" with the McConnell campaign. Courtney Daniel, the communication's director for McGrath's campaign, said in a statement:", "Amy is ready and willing to debate Mitch, but Mitch is afraid to take the stage unless he dictates every detail. [...] We want to have a debate that includes representation that reflects our electorate, and we won’t let him railroad us on that. [...]", "Amy looks forward to participating in the Gray TV debate when the gender balance of the moderators is restored.", "But no evidence proved debate organizers and the Republican candidate's campaign ever discussed, much less agreed on, those alleged terms of agreement — that the original schedule of moderators should be changed to meet McConnell's alleged standards on gender. The Lexington Herald Leader reported:", "[According] to an initial letter sent out to the campaigns, the debate would be hosted by WAVE’s Shannon Cogan [a female] and WKYT’s Bill Bryant [a male]. By the time a second letter inviting both campaigns to the debate was sent out September 16, only Bryant was moderating.", "When McGrath’s campaign raised questions about why Cogan was dropped, they were informed that it was because both campaigns had mentioned Bryant as a potential moderator, according to emails shown to the Herald-Leader.", "In other words, McGrath's claims were unsubstantiated. Robert Thomas, the news director at WKYT, a Gray TV-owned station, said organizers told both campaigns how the debate would be moderated, though he did not elaborate on the nature or timeliness of those communications, according to the Lexington Herald Leader newspaper.", "Additionally, Dan Fabrizio, the news director at another Gray TV-owned station, WAVE 3 News, said in a statement to the Journal:", "\"Throughout this process, our overriding objective has been to provide a forum for the two major candidates in a critical election for U.S. Senate to present their views on important issues to Kentucky voters. We remain committed to working toward this and look forward to welcoming both Amy McGrath and Mitch McConnell to the debate stage.\"", "McConnell's campaign refuted the allegations of prejudice against women regarding the debate roster. Campaign spokesperson Kate Cooksey said in a statement to news reporters:", "\"We sincerely hope Amy McGrath finds a reason to accept the debate rather than an evolving grab bag of laughably ridiculous excuses why she cannot. [...] Amy McGrath absurdly suggests gender discrimination...as the primary reason she can’t appear.\"", "In sum, considering no evidence exists to confirm McConnell said he would not participate in debates that include female moderators affirming his challenger's allegation of making such a demand, we rate this claim \"False.\"", "Roth, Madeline.   \"Mitch McConnell 'Refusing To Debate His Election Rival If There Is A Female Moderator'.\"\r\n   Independent.   30 September 2020.", "Watkins, Morgan.   \"Mitch McConnell and Amy McGrath May Not Debate Each Other, After All.\"\r\n   Louisville Courier Journal.   29 September 2002.", "Desrochers, Daniel.   \"Will McGrath And McConnell Debate Before Election? It May Depend On The Moderator.\"\r\n   Lexington Herald Leader.   28 September 2020.", "Schreiner, Bruce.   \"McConnell, McGrath Jockey Over Debates In Senate Race.\"\r\n   The Associated Press.   26 August 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]