["The video posted on multiple Facebook accounts (see here and here) starts by stating: “The Philippines acquire its first diesel-electric submarines”.", "The caption posted with the video says:", "“Proudly the Philippines received two submarine.\"", "The video shows images of a submarine being wheeled out of a shipyard hangar:", "A reverse image search shows that this footage is actually of the American nuclear-powered submarine, the USS John Warner, being transferred to a floating dry dock in 2014.", "The footage was posted on the Huntington Ingalls YouTube channel in 2014. Huntington Ingalls are an American military ship building company.", "Other images used in the Facebook video are of the cruise-missile submarine USS Ohio on a port visit to Malaysia in 2015.", "The Department of National Defense (DND) told AFP that the Philippines has not acquired any submarines.", "“No, we have not,” DND spokesman Arsenio Andolong told AFP when asked whether the Philippine navy had already acquired submarines.", "“We are still conducting doctrinal and market research for the Navy’s submarine acquisition program,” he added in a text message exchange on September 9.", "The Facebook posts and video have been shared 18,800 times to Facebook groups -- mainly ones which support Philippine President Rodrigo Duterte -- with over a million followers, according to data from social media monitoring site CrowdTangle.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]