["About this rating", "In October 2017, several web sites falsely reported that actress Sandra Bullock had publicly defended President Donald Trump while also launching an attack against 2016 Democratic presidential nominee Hillary Clinton. The US World Now web site, for example, put out an article under the following lengthy headline:", "Actress Sandra Bullock to Hillary Clinton: 'If You Don't Like Our President You Can Leave and Never Come Back Again, You Are One Jealous Woman Who is Nothing to Compare With Trump, I Hope He Will Arrest You Soon.' Do You Support Her?", "The body of the article itself did not contain this quote, however. Rather, it was composed of copied and pasted sections from a two-year-old People magazine article in which Bullock actually expressed her dislike of Donald Trump:", "One politician who seemingly won’t get the star’s vote in the 2016 presidential election? Donald Trump.", "“I don’t agree with that at all,” Bullock said of the candidate’s comments on Mexican-Americans. “That was not a statement that I can get behind. I don’t agree with that statement.”", "Not surprisingly, this portion of the interview did not make it into the US World Now article.", "The same fabricated quotation was used as a clickbait headline by the Trump Times and My Info News web sites, while the Political Feed  worked the fake quote into the body of their article:", "Sandra Bullock stated that she is not “politically vocal” but rather that doesn’t mean she isn’t stubborn with regards to America’s administration.", "\"I simply need what’s best for our nation,” Bullock said amid a question and answer session for her new film, Our Brand Is Crisis, in Los Angeles last Friday. And the best part was when she stated this:", "“If you don’t like our current President, you can leave our country and never come back, especially you Hillary.”", "“Hatred is the last thing we need nowadays, we must unite. Donald Trump is doing everything he is available of to improve our nation, just respect that activity and stay patient.”", "Political Feed made it entirely obvious that the quotation was fabricated by claiming Bullock had made her remarks at a press conference \"last Friday\" for \"her new film\" Our Brand is Crisis, a movie that had actually been released two years earlier.", "Kimble, Lindsay.   \"Sandra Bullock Says Her Political Views Are Informed by What's Best for Her Son.\"\r\n    People.   17 October 2015.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]