["A video of two men gunning down a group of people in an alley has been gathering a lot of traction on social media. Users claim that the visuals are from Mumbai’s Dongri area. A Twitter user shared the clip with a caption that read, “Shots fired in Dongri. How many more good days?”.", "Shoot out at dongari Or kitney Achhey din pic.twitter.com/bPyq1wbfwI", "— #binod (@binod__budy) March 8, 2021", "We received a request to fact-check the video on the Alt News WhatsApp number and mobile app. The clip is also being circulated with a Gujarati caption where it is described as an incident from Vakhariya Bazar in Gujarat’s Veraval.", "This slideshow requires JavaScript.", "Similarly, another user wrote, “Down with these Nizams and leaders. Such violent incidents have become common practice under their rule. Scenes from Dongri, Mumbai.”", "Director Ram Gopal Verma also tweeted the video asking where was it shot.", "Can someone tell me where this happened ? pic.twitter.com/FLoZpazDW8", "— Ram Gopal Varma (@RGVzoomin) March 8, 2021", "We noticed that a user named @khan25_shoaib replied that the video shows a movie set. He also posted a clip where some people that appear in the viral video can be seen.", "pic.twitter.com/iYmwBjay92", "— SHOAIB,KHAN25 (@khan25_shoaib) March 8, 2021", "The people who have been ‘shot’ can be spotted in both videos. Nobody is coming to their aid and there is no panic on the street which suggest that it is a movie shooting video. Furthermore, the man who was shot gets up and one can also see cameras and other equipment on the other side.", "People can be heard speaking in Gujarati in the video posted by @khan25_shoaib. We performed a search based on this and found a post on the ‘Our gir Somnath’ Facebook page. According to the post, the clip going viral on WhatsApp is fake. It also mentioned that no such incident occurred in the Veraval market.", "હમણાં એક બે દિવસથી વોટ્સ એપ મા ફરતો આ વીડિયો તદન ખોટો છે વેરાવળ વખારિયા બજાર મા કોઈ પણ મર્ડર થયું નથી ખોટી અફવાઓથી દૂર…", "Posted by Our gir somnath on Monday, March 8, 2021", "Fact Crescendo found Goa News Hub had uploaded the same video stating, “Film shooting of a shoot out at Mapusa has created panic on the net as the clip is being made viral claiming to be real life incident.”", "Film shooting of a shoot out at Mapusa has created panic on the net as the clip is being made viral claiming to be real life incident. pic.twitter.com/AR2My84m1V", "— Goa News Hub (@goanewshub) February 7, 2021", "Rupesh Samant, founder and editor of Goa News Hub, told Fact Crescendo, “The video was mostly a part of a local movie shoot. There are several video clips which show that the victim in the video gets up and walks away.”", "A YouTube video of the shooting from another angle makes it clear that it is not a real-life incident.", "A video of a film shooting in Goa is viral as an actual incident of people gunned down in Mumbai.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]