["One Facebook post that wrongly identifies the boy to be from Harrisburg has gained over 7,000 shares and more than 150 comments and reactions. The post, which we’ve archived here, says that the boy was “kidnapped today” -- which can essentially mean any day, encouraging people to keep sharing the image.", "\"Pass this photo this boy has been kidnapped today in Harrisburg. If it was my kid I would hope people would pass it!\" the caption reads.", "A reverse image search on Google quickly led us to several articles which identify the boy as Ariel Revello, some of them indicating that the post is outdated or inaccurate. A search on Twitter for the boy’s name retrieved tweets from several emergency accounts confirming that Revello, aged seven at the time, had been found.", "Ariel Revello is located ! pic.twitter.com/GcL456FUU2", "**AMBER ALERT CANCELLED**\n\t\tAmber Alert for Ariel Revello is cancelled, he has been located.", "The call to locate Revello had been issued through Amber Alert, a US government service that asks the public for help in finding abducted children. The alert for Revello was issued on March 12, 2016, and authorities announced that he had been found a day later.", "Active Amber alerts for missing children in the US can be found here on the website of the National Center for Missing and Exploited Children, while alerts for those found are deleted. A search for Revello’s name came up void, indicating that he had been found.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]