["About this rating", "In November 2020, a rumor started to circulate on social media that George Soros, the billionaire philanthropist frequently featured in right-wing conspiracy theories, was the owner of the new social media site Parler. The rumor was based largely on a supposed screenshot from a Fox News broadcast bearing the words \"Fox News Confirms: George Soros is a Majority Owner of New Social Platform Parler.\"", "This is not a genuine screenshot from Fox News, and Soros does not own Parler. The chyron displayed here is fake.", "A few immediate red flags signal that this image was doctored.", "For one, no articles exist on FoxNews.com (or any other news outlet) reporting that Soros is an owner of Parler. The website is actually owned by John Matze and a few investors (none of whom are Soros). Also, why would reporter John Roberts be reporting about Parler from the White House lawn?", "Robert's position on the White House lawn made more sense when we found the source of this doctored image. The fake image about Soros was created from a screenshot of a Fox News broadcast on Nov 10, 2020, that showed reporters Sandra Smith and Roberts discussing U.S. President Donald Trump's plan to contest the results of the 2020 election. The chyron during this segment actually read: \"Trump Campaign Files Lawsuit Alleging Two-Tiered Voting System in Pennsylvania.\"", "Parler's CEO also disputed this rumor, writing that \"Parler has NOT been sold\" and that \"George Soros has absolutely no association in any capacity with parler.\"", "Matze wrote:", "Hi Everyone, can you believe how desperate the trolls are getting falsely claiming Parler is own by Soros? Not even creative haha. Minus 10 points for lack of creativity. ?", "Ive seen the image circulating. It appears photoshopped. I highly doubt Fox News would report something like this. Always be skeptical and check with us if you hear rumors. I will transparently answer any questions you all have as best as possible.", "George Soros has absolutely no association in any capacity with parler. I’ve echo’d my previous Parley about the ownership structure. #transparency", "The ownership structure of Parler is myself, a small group of close friends and employees. Additionally, Parler has 2 strategic investors. Dan Bongino & Jeffrey Wernick.", "Parler has NOT been sold. These are malicious lies intended to damage and malign the brand of Parler. Anyone claiming otherwise is a hoaxer and most likely acting from malice. This is the length enemies of free speech will go to try to take down the ONLY platform that protects your speech, privacy and data. Parler.", "Dan Bogino, one of Parler's investors, also disputed the rumor on Twitter.", "On Nov. 14, 2020, the Wall Street Journal reported that Parler has financial backing from Robert and  Rebekah Mercer, both of whom are known for funding conservative causes.", "It should be noted that this is far from the first time that Soros has been falsely accused of owning or funding a project. This rumor is a bit unusual, however, as the billionaire is typically falsely accused of funding organizations painted as left leaning, such as the Black Lives Matter movement, Antifa, protesters, and any and all Democratic politicians. Bad-faith rumors have also been spread falsely claiming that Soros owned Snopes.", "Correction [12 November 2020]: Originally article mistakenly identified John Roberts as John King.", "Update [17 November 2020]: Updated to include Parler's financial links to Robert and Rebekah Mercer.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]