["An audio clip with a male voice is viral on messaging applications such as WhatsApp accompanied with pictures of people unloading cargo from an Air Asia flight. In the clip, the man can be heard warning the Muslim community about a ‘sinister plot’ of the Indian government led by Prime Minister Narendra Modi to kill a section of the population by injecting a vaccine imported from the United States of America. He claims that the government will decide who will live and who won’t. It proclaims that the attack will take place in a month or so.", "“They will inject this vaccine in the garb of saving lives from coronavirus. Whoever takes the vaccine will die. The medicine will come from America, Modi is getting it from Trump. You see this and share everywhere,” concludes the man while urging people to spread the word. Alt News has received several requests on its designated WhatsApp number (+91 7600011160) to fact-check this claim.", "The man can be heard saying, “ये देखो भाई नरेंद्र मोदी अमेरिका गया था। और ये दवाइयाँ अमेरिका में बन चुकी है, टीके के नाम पर पुरे हिंदुस्तान में लगवाई जाएँगी। और किसको मारना है किसको जियाना है और कितनी आबादी कम करनी है। इस इंजेक्शन का अटैक डेढ़ महीने – एक महीने के अंदर होगा बाकी ये लगाये जायेंगे टीके के नाम से और कोरोना वायरस से बचाने के नाम से और बचेगा नहीं जिसको लगा वो ख़तम। ये अमेरिका से दवाई आने वाली है इंडिया, ट्रम्प से मंगवा रहा है नरेंद्र मोदी आप इसको देखो और शेयर करो सब जगह.”", "Upon viewing the images closely, a banner could be seen on the fuselage of the plane which resembled the Malaysian flag. With a keyword search on Google, Alt News found a visually similar image featuring Malaysian State Sabah’s Chief Minister Datuk Seri Mohd Shafie Apdal and China’s Kota Kinabalu consul-general Liang Caide along with the medical equipment donated by China. It was published by Malaysian newspaper The Star on March 29, 2020.", "According to the report, the Sabah government had initiated a fundraising drive for China when the country was battling coronavirus in February to assist the country. “China’s Kota Kinabalu consul-general, Liang Caide, returned the favour on behalf of his government with thousands of boxes of face masks, protective suits, goggles, thermometers and others,” reported the media outlet on March 29, 2020. These images depict the first batch of the consignment that was delivered to Sabah as China reciprocated Malaysia’s goodwill gesture.", "We will fact-check all the four images separately and establish that all of them belong to the consignment of medical equipment delivered by China to Malaysia’s Sabah state.", "Image 1", "The first image shows a group of people including the Sabah’s Chief Minister and China’s Kota Kinabalu consul-general holding a banner which reads, “WE ARE BROTHERS, FIGHTING TOGETHER.” In the comparison posted below, the image on the left is the one circulating on WhatsApp whereas, on the right is an image published along with a news article reporting the event. We have matched the individuals seen in both the photos to establish that it is the same event.", "Image 2", "The second viral image is of a man wearing a mask and holding a box in his hands.", "The same man holding a box at the airport in Sabah was found in a different image that was published in a video report (at 33 seconds) by The Star.", "Image 3", "With a keyword search on Twitter, we found a visually similar image tweeted by the State Information department of Sabah on March 29.", "Pesawat sewa khas yang membawa bekalan Kit Perubatan dari China tiba di Terminal Dua Lapangan Terbang Kota Kinabalu pada jam 3.10 petang tadi.", "📸 Vicky S Matanjang#JaPenSabah#KitaJagaKita#StayAtHome pic.twitter.com/LRC25fUfzF", "— Jabatan Penerangan Negeri Sabah (@JapenSabah) March 29, 2020", "Image 4", "The fourth image shows a group of men, wearing red jackets and pants, getting down from a airplane.", "We could not trace the fourth image on the internet, however, we found that these man dressed in red jackets and tracks can be seen in the video (at 13 seconds) posted below. The video was tweeted on March 29 with the caption, “Dozens of boxes of facemasks from China arrived in Sabah.”", "Dozens of boxes of facemasks from China arrived in Sabah on March 29, 2020, with the rest of the donations to come in stages.", "Posted by Daily Express Online on Sunday, 29 March 2020", "In conclusion, a dangerous audio clip warning the Muslim community about a ‘sinister plot’ of the Indian government to ‘poison’ them in the garb of coronavirus vaccine was shared along with the images of medical aid received by Malaysia’s Sabah state from the Chinese government.", "Furthermore, a vaccine for coronavirus is yet to be developed and trials are underway. In the past as well, we have observed misinformation promoting anti-vaccination propaganda. In 2018, rumours were circulated, especially in the Muslim community, linking the Measles-Rubella (MR) vaccine with RSS and BJP, and how there’s a conspiracy to hurt the Muslim community by manipulating vaccines. Alt News Science had debunked the rumour at length in this article.", "Note: The number of positive cases of the novel coronavirus in India is more than 3,700 and close to 100 deaths have so far been reported. The government has imposed a complete restriction on movement apart from essential services to tackle the pandemic. Globally, more than 12 lakh confirmed cases and close to 64,000 deaths have been reported. There is a growing sense of panic among citizens, causing them to fall for a variety of online misinformation – misleading images and videos rousing fear or medical misinformation promoting pseudoscience and invalid treatments. While your intentions may be pure, misinformation, spread especially during a pandemic, can take lives. We request our readers to practice caution and not forward unverified messages on WhatsApp and other social media platforms.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]