["A fleet of five French-manufactured Rafale jets arrived in India on July 29. The new planes were escorted by two Sukhoi 30 MKIs after they entered the Indian air space in Ambala, as per the media. In the backdrop of this, an 11-second clip of an aeroplane refuelling another mid-air has gone viral with the claim that these are new Indian Rafale jets.", "Twitter user @dreamthatworks, who is also followed by Prime Minister Narendra Modi, posted the viral video and wrote, “And that is how the refuelling is done mid-air #ThankYouPmModiForRafale #RafaleJets #RafalePowersIndia“. This tweet has been retweeted over 1,000 times.", "And that is how the refuelling is done mid-air #ThankYouPmModiForRafale #RafaleJets #RafalePowersIndia @KiranKS @anilkohli54 pic.twitter.com/vUtPuTsz0a", "— DreamThatWorks (@dreamthatworks) July 29, 2020", "Similarly, several Twitter users posted this clip along with the claim.", "Ever wondered how refuelling is done mid-air?? This is how it works. #indianairforce #RafaleJets #Rafale @IAF_MCC pic.twitter.com/ByKrFz4Y30", "— Vivek(Mathai)George (@vivekmathai) July 29, 2020", "Alt News performed a reverse image search using InVid, a video verification too, and found that the viral video was tweeted by the Brazilian Air Force in 2018.", "As per their tweet, the video shows Brazilian Air Force’s F-5 engaged in mid-flight refuelling of the Brazilian Navy’s A-4 fighter jet.", "Interoperabilidade! Caça F-5 da Força Aérea Brasileira realiza reabastecimento em voo em caça A-4 da Marinha do Brasil! ↗🇧🇷 @marmilbr 📸 Maj Gustavo Cury.#1GDA #AviaçãodeCaça #FAB #Dimensão22 #Defender #ForçasArmadas #Brasil pic.twitter.com/AzDNIQvmTR", "— Força Aérea Brasileira 🇧🇷 (@fab_oficial) September 28, 2018", "Images of mid-air refuelling of Indian Rafale jets were posted by the Indian Embassy in France on July 28.", "Few shots from 30,000 feet! Mid air refuelling of #RafaleJets on their way to #India@IAF_MCC @French_Gov @FranceinIndia @MEAIndia @IndianDiplomacy @DDNewslive @ANI @DefenceMinIndia @Armee_de_lair @JawedAshraf5 pic.twitter.com/VE7lJUcZe7", "— India in France (@Indian_Embassy) July 28, 2020", "The viral video was earlier fact-checked by News Mobile.", "A 2018 video tweeted by the Brazilian Air Force was shared as mid-air refuelling of Rafale jets en route India.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]