["About this rating", "An item about ridiculous questions supposedly asked of travel agents by \"clueless\" Congresspersons is yet another instance of an old bit of generic humor's being modified to apply to contemporary politicians. We've collected examples of this list of howlers dating from as back as far as 1998, and those earlier versions failed to identify the geographically challenged as members of Congress, instead presenting them as 'a client,' 'a secretary,' 'a man,' 'another man,' and so forth. Those earlier versions also began with a preface that trumpeted the collection as \"Actual stories from a variety of Travel Agents\" rather than the politically repositioned \"Actual stories provided by a retiring Washington, D.C. travel agent of 30+ years\":", "The following are actual stories provided by a retiring Washington, D.C. travel agent of 30+ years:", "In July 2009, a more specific version began circulating that coupled the names of actual Congress members (all of them Democrats) with the various entries, identifying them as the political goats of the moment. Some of the entries were obviously anachronistic -- for example, a 2003 version referenced a \"New Hampshire Congresswoman,\" but Carol Shea-Porter, the first woman ever elected to Congress from New Hampshire, didn't take office until 2007:", "Is this why our country is in trouble?", "A DC airport ticket agent offers some examples of 'why' our country is in trouble!", "1. I had a New Hampshire Congresswoman (Carol Shea-Porter) ask for an aisle seat so that her hair wouldn't get messed up by being near the window. (On an airplane!)", "2. I got a call from a Kansas Congressman's (Moore) staffer (Howard Bauleke), who wanted to go to Capetown. I started to explain the length of the flight and the passport information, and then he interrupted me with, \"I'm not trying to make you look stupid, but Capetown is in Massachusetts.\"", "Without trying to make him look stupid, I calmly explained, \"Cape Cod is in Massachusetts, Capetown is in Africa.\" His response — click.", "3. A senior Vermont Congressman (Bernie Sanders) called, furious about a Florida package we did. I asked what was wrong with the vacation in Orlando. He said he was expecting an ocean-view room. I tried to explain that's not possible, since Orlando is in the middle of the state. He replied, 'don't lie to me, I looked on the map and Florida is a very thin state!\" (OMG)", "4. I got a call from a lawmaker's wife (Landra Reid) who asked, \"Is it possible to see England from Canada?\" I said, \"No.\" She said, \"But they look so close on the map.\" (OMG, again!)", "5. An aide for a cabinet member(Janet Napolitano) once called and asked if he could rent a car in Dallas. I pulled up the reservation and noticed he had only a 1-hour layover in Dallas. When I asked him why he wanted to rent a car, he said, \"I heard Dallas was a big airport, and we will need a car to drive between gates to save time.\" (Aghhhh.)", "6. An Illinois Congresswoman (Jan Schakowsky) called last week. She needed to know how it was possible that her flight from Detroit left at 8:30 a.m., and got to Chicago at 8:33 a.m. I explained that Michigan was an hour ahead of Illinois , but she couldn't understand the concept of time zones. Finally, I told her the plane went fast, and she bought that.", "7. A New York lawmaker, (Jerrold Nadler) called and asked, \"Do airlines put your physical description on your bag so they know whose luggage belongs to whom?\" I said, 'No, why do you ask?' he replied, \"Well, when I checked in with the airline, they put a tag on my luggage that said (FAT), and I'm overweight. I think that's very rude!\"", "After putting him on hold for a minute, while I looked into it. (I was dying laughing). I came back and explained the city code for Fresno, Ca. is (FAT - Fresno Air Terminal), and the airline was just putting a destination tag on his luggage.", "8. A Senator John Kerry aide (Lindsay Ross) called to inquire about a trip package to Hawaii. After going over all the cost info, she asked, \"Would it be cheaper to fly to California and then take the train to Hawaii?\"", "9. I just got off the phone with a freshman Congressman, Bobby Bright (D) from Ala who asked, \"How do I know which plane to get on?\" I asked him what exactly he meant, to which he replied, \"I was told my flight number is 823, but none of these planes have numbers on them.\"", "10. Senator Dianne Feinstein (D) called and said, \"I need to fly to Pepsi-Cola, Florida. Do I have to get on one of those little computer planes?\" I asked if she meant fly to Pensacola, FL on a commuter plane. She said, \"Yeah, whatever, smarty!\"", "11. Mary Landrieu (D) La. Senator called and had a question about the documents she needed in order to fly to China. After a lengthy discussion about passports, I reminded her that she needed a visa. 'Oh, no I don't. I've been to China many times and never had to have one of those.\"", "I double checked and sure enough, her stay required a visa. When I told her this she said, \"Look, I've been to China four times and every time they have accepted my American Express!\"", "12. A New Jersey Congressman (John Adler) called to make reservations, \"I want to go from Chicago to Rhino, New York.\"", "I was at a loss for words. Finally, I said, \"Are you sure that's the name of the town?\"", "'Yes, what flights do you have?\" replied the man.", "After some searching, I came back with, \"I'm sorry, sir, I've looked up every airport code in the country and can't find a rhino anywhere.\"", "\"The man retorted, \"Oh, don't be silly! Everyone knows where it is. Check your map!\"", "So I scoured a map of the state of New York and finally offered, \"You don't mean Buffalo, do you?\"", "The reply? \"Whatever! I knew it was a big animal.\"", "Now you know why the Government is in the shape that it's in!", "Could anyone be this DUMB?", "YES, THEY WALK AMONG US, ARE IN POLITICS, AND THEY CONTINUE TO BREED.", "I don't write it, I just offer it for your consideration. Like manure, you just gotta spread it around.", "Because such lists are ever-changing, some of the earlier entries fail to appear in the modern \"dumb Congresspeople\" versions, namely:", "[Note: The Newhart program that aired on CBS from 1982-90 was actually set in Vermont, and the inn shown in the program's opening shots was located there as well.]", "The agent scoured a map of the state of New York and finally offered, \"You don't mean Buffalo, do you?\"", "\"That's it! I knew it was a big animal!\"", "At any given moment, you'll find this list circulating with a number of confusing arrangements in which some entries are present but others have been omitted. Similar lists such as the \"Funny comments made on Welfare applications\" and \"Howlers culled from insurance claims forms\" also tend to pick up and shed entries as they pass from one set of hands to another.", "Lists such as these sometimes make their way into the newspapers, where they slip by editors and are run under 'funny but true' headers. Though we won't dispute they're funny, the 'true' part has yet to be substantiated by anyone — some of the entries may reflect situations encountered by anonymous travel agents somewhere, sometime, but they may also be nothing more than deliberate concoctions by unknown humorists rather than verifiable proof that folks (especially Congresspeople and Senators apparently) are getting dumber all the time.", "As to why such tales appeal, as one columnist said in 1998: \"Like anything on the Web, they should be taken with a grain of salt. But they certainly ring true, and that grain of salt might well irritate wounds that many of us have suffered stumbling over ourselves during periods of trip-witlessness.\"", "Besides, it's kind of comforting to be able to believe we're all that much smarter than our elected officials. (We'd never waste our time looking for Hippopotamus, NY, on a map, we say to ourselves smugly.) It's that little bit of barely suppressed self-satisfaction that makes such lists a hit with so many.", "Calos, Katherine.   \"Take It Easy.\"\r\n    The Richmond Times Dispatch.   11 April 1999   (p. J4).", "Carpenter, Richard.   \"Honest, People Did Ask These Questions.\"\r\n    The Boston Globe.   17 October 1999   (p. N12).", "Harrison, Eric.   \"Hollyweirdos Ensure the Strangeness Will Last Another Generation.\"\r\n    The Arkansas Democrat-Gazette.   31 July 1998   (p. E6).", "McDowell, Elsa.   \"Tales from Folks Who Should Have Stayed Home.\"\r\n    The [Charleston] Post and Courier.   27 May 2000   (p. C1).", "Molnar, Jim.   \"Trip-Witless? Travellers May Leave Brains Behind.\"\r\n    The Seattle Times.   21 June 1998   (p. K1).", "The Buffalo News.   \"The Edge.\"\r\n    2 August 1998   (p. M4).", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]