["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Flu season isn’t quite here yet, but myths about the vaccine are already starting to spread on social media like a, well, virus.", "A Facebook post, shared on Oct. 12, claims that for the two weeks after you receive a flu shot you’re an \"active, live walking virus:\"", "\"Folks who get flu shots please have some respect and courtesy and stay home for minimal [sic] of 2 weeks while you are an active live walking virus. Also don’t hug others and give kisses and please immediately tell others you were vaccinated so they don’t come close to you.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This is a common myth. So common, in fact, that a 2015 study published in Vaccine found that 43% of the public believed that getting the flu vaccine can give you the flu.", "But the shot does not contain an active virus and an inactivated virus cannot transmit infection.", "The myth is at the top of the Centers for Disease Control and Prevention’s \"Misconceptions about Seasonal Flu and Flu Vaccines\" list. The organization says:", "\"No, flu vaccines cannot cause flu illness. Flu vaccines given with a needle (i.e., flu shots) are currently made in two ways: the vaccine is made either with a) flu viruses that have been ‘inactivated’ (killed) and that therefore are not infectious, or b) using only a single gene from a flu virus (as opposed to the full virus) in order to produce an immune response without causing infection. This is the case for recombinant influenza vaccines.\"", "Another CDC flu fact sheet also notes that while the nasal spray flu vaccine does contain a live virus, \"the viruses are changed so that they cannot give you the flu.\" (More about this \"change\" below.)", "Harvard Medical School tackled the superstition in a breakdown of flu myths and says that since it takes around two weeks to get protection from the vaccine, people who get sick before then wrongly assume the shot gave them the flu.", "\"The flu shot is made from an inactivated virus that can't transmit infection. So people who get sick after receiving a flu vaccination were going to get sick anyway. It takes a week or two to get protection from the vaccine. But people assume that because they got sick after getting the vaccine, the flu shot caused their illness.\"", "William Schaffner, a professor and infectious disease specialist at Vanderbilt University, also confirmed to PolitiFact that the claim is a myth.", "\"The injectable flu vaccine is composed of selected parts of the influenza virus and cannot re-assemble itself into the complete virus in the human body. Thus, it is impossible for the flu vaccine to cause influenza,\" Schaffner wrote in an email. \"The nasal spray influenza vaccine is a ‘tamed’ flu virus. It can multiply in the nose where it stimulates the body to provide protection, but it is biologically incapable of multiplying down in the lungs or anywhere else in the body. It also cannot cause the person who has received the vaccine to experience influenza.\"", "Besides contracting the flu within the window before the vaccine takes effect, people may also experience other side effects such as pain, redness or swelling near the injection site; headache, fever, nausea and sore muscles.", "\"After receiving the injectable vaccine everyone experiences a sore arm for a few hours. In very few persons this can last a day. Some also have a bit of swelling or redness at the injection site,\" Schaffner wrote. \"Only 1% - 2% of persons experience a slight fever that can last a day or so. The nasal spray vaccine can be associated with a runny nose or a scratchy throat for a day or two. These brief symptoms are just minor reactions to the vaccine.\"", "The only viral thing about this claim is the claim itself. We rate it Pants on Fire!", "Facebook post, Oct. 12, 2019", "Centers for Disease Control and Prevention, Key Facts About Seasonal Flu Vaccine, Accessed Oct. 14, 2019", "Centers for Disease Control and Prevention, Misconceptions about Seasonal Flu and Flu Vaccines, Accessed Oct. 14, 2019", "PubMed.gov, Does correcting myths about the flu vaccine work? An experimental evaluation of the effects of corrective information, January 2015", "Harvard Medical School, 10 Flu Myths, Nov. 12, 2018", "Snopes, Why the Flu Shot Cannot Give You the Flu, Sept. 27, 2019", "Men’s Health, 11 Flu Shot Side Effects You Might Mistake for Being Sick, Oct. 15, 2019", "Email Interview, William Schaffner,  Professor of Medicine in the Division of Infectious Diseases at the Vanderbilt University School of Medicine, Oct. 16, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]