["House Speaker Nancy Pelosi, center, speaks about the Equality Act on Feb. 25, 2021, with Rep. Jerry Nadler, D-N.Y., and other lawmakers on Capitol Hill in Washington. (AP)", "Rep. Jerry Nadler, D-N.Y., didn’t say that. He said: “What any religious tradition describes as God’s will is no concern of this Congress,” a reference to the constitutional separation between church and state.", "Nadler was encouraging his colleagues in the House of Representatives to vote in favor of the Equality Act, which would prohibit discrimination based on sexual orientation and gender identity.", "A Facebook post misquotes a member of Congress who dismissed his colleague’s suggestion that passing federal protections for LGBTQ people would go against God’s design.", "The Feb. 26 Facebook post shows an image of Rep. Jerry Nadler, D-N.Y., with text around him.", "\"‘God has no authority in the House of Representatives,’\" the post quotes Nadler saying.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post gave a specific time that Nadler purportedly uttered the phrase — \"Thursday February 25, 2021 at approximately 345 PM EST in a hearing televised on C-span.\" So we checked the record.", "(Screenshot from Facebook)", "Nadler, who is Jewish and who represents one of the nation’s most heavily Jewish districts, didn’t say that. Rather, he pushed back against comments from a Republican colleague about the role of the government in prohibiting discrimination against LGBTQ people.", "On Feb. 25, the House passed the Equality Act. If signed into law, the legislation would amend the 1964 Civil Rights Act to explicitly prohibit discrimination based on sexual orientation and gender identity.", "During the debate proceeding the House vote, Nadler encouraged his colleagues to vote in favor of the Equality Act.", "\"This long overdue legislation will provide millions of LGBTQ Americans explcit protections from being denied medical care, fired from their jobs or thrown out of their homes simply because of who they are,\" he said.", "The Equality Act would supersede the 1993 Religious Freedom Restoration Act, which set a higher bar for the government to defend laws that Americans said abridged their right to freedom of religion. In effect, private businesses would not be permitted to deny service to LGBTQ people by claiming it violates their religious beliefs.", "Rep. Greg Steube, R-Fla., criticized the Equality Act during the House debate, saying it violates Christian beliefs.", "\"The gender confusion that exists in our culture today is a clear rejection of God’s good design,\" he said. \"Whenever a nation's laws no longer reflect the standards of God, that nation is in rebellion against him and will inevitably bear the consequences.\"", "Leaning into the constitutional separation of church and state, Nadler pushed back.", "\"Mr. Steube, what any religious tradition describes as God’s will is no concern of this Congress,\" he said.", "That’s similar to what’s in the Facebook post, but it’s not a direct quote. We rate the post False.", "Congress.gov, H.R.5 - Equality Act", "Congress.gov, H.R.1308 - Religious Freedom Restoration Act of 1993", "Cornell Legal Information Institute, Establishment Clause", "C-SPAN, House Session - February 25, 2021", "Facebook post, Feb. 26, 2021", "National Conference of State Legislatures, \"Religious Freedom Restoration Acts,\" May 2015", "NPR, \"House Passes The Equality Act: Here's What It Would Do,\" Feb. 24, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]