["“Unfortunately, the incredibly warm and sunny summer in Alaska has a dark face. This is how salmon died after the entering Tutka Lagoon in Kachemak Bay State Park near Homer,” a Czech tourist in Alaska wrote as a caption to a video uploaded on August 6, 2019. In the video, shot from a kayak, hundreds of salmon float lifelessly on the surface of the water as the raft paddles through the carcasses.", "The Czech man’s video was shared more than 115,000 times, and uploaded by other users in French, Spanish, and Portuguese, gaining traction in those languages as well.", "Although the video is real and the context is correct, these Pacific salmons were not killed by warm weather.", "According to a clarification post published by the Cook Inlet Aquaculture Association (CIAA), the salmon had been fished by purse seine, a large net that encircles schools of fish, in Tutka Bay Lagoon, in Kachemak Bay, four hours south of Anchorage by car. “The bottom of the net snagged on something and ripped,” the post described.", "Dean Day, executive director of CIAA, confirmed the post to AFP by email, adding, “This is not a regular occurence.”", "“Salmon that were caught in a purse seine that was being taken to a tender had the net hang up, this caused fish to spill out from the net and those fish (that were destined for the processor) did not survive,” Day explained.", "The salmon were raised and released in the ocean by CIAA, which licensed a contractor to harvest a portion of the fish once they returned to Kachemak Bay.", "July 2019 was the hottest month in Alaska since the National Oceanic and Atmospheric Administration (NOAA) began keeping records in 2005, the US government agency announced on August 15. The unprecedented heat wave killed many salmon in Alaska this summer, CNN reported.", "An article in the local newspaper of the nearby town of Homer related the events in Tutka Bay Lagoon as early as August 13, and the caption of the original video was edited on August 13 to include the CIAA explanation for the dead fish. Other uploaded versions of the video were not edited as of publication.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]