["The video was published on Twitter here on October 6, 2020. It has been viewed more than 15,200 times.", "The post’s caption, written in both simplified and traditional Chinese, translates to English as: “At this moment when Azerbaijan and Armenia are at war, it is said that some people in Azerbaijan who refused to be recruited by the military were forcibly arrested to join the army! This is a country where the president has been re-elected four times and his wife has been appointed as the vice president. / China will also come to this point!”", "The post circulated after military clashes erupted between Armenian and Azerbaijani in late September 2020 over the disputed Nagorno-Karabakh region, as AFP reported here.", "The video was also published alongside a similar claim on Twitter here. A longer version of the footage was shared beside the claim on Weibo here and on Twitter here.", "The claim, however, is false.", "A reverse image search based on keyframes extracted from the video found that the footage has circulated in reports since at least 2019.", "The video was published here on YouTube by Meydan TV, a Berlin-based Azerbaijani news network, on October 21, 2019. The footage shared in the Twitter posts begins at the YouTube video’s 13-second mark.", "The YouTube video’s Azerbaijani-language title translates as: “Images of police violence and insults to protesters”.", "The caption reads: “Authorities and YAP officials claim that police did not use violence during the October 19 rally. We have collected images of violence for you during the action. Follow, decide for yourself. Share it so that it reaches the official bodies, maybe they took measures.”", "YAP is an acronym for Azerbaijan's ruling New Azerbaijan Party.", "Below is a screenshot comparison of the misleading Twitter post (L) and the YouTube footage (R):", "The October 2019 arrests in Azerbaijan were also reported on here and here by US government-affiliated media organizations Radio Free Europe/Radio Liberty and Voice of America.", "AFP debunked a false claim about the same video showing coronavirus-related unrest in Spain here in April 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]