["The text graphic was shared on Facebook here, here and here. The image states 97% of black and 81% of white murder victims are “killed by blacks”, and just 16% of white murder vicitms are “killed by whites”.", "The post circulated as major US cities were put under curfew following large anti-racism protests over the police killing of 46-year-old African-American George Floyd.", "Other Facebook posts featuring the graphic can be seen here, here, here, here, and here.", "Another version of the graphic, which excludes the purported source, can be seen in Facebook posts here and here. A separate graphic displaying the same purported data was also published here, here, here, and here with a similar claim.", "The claims, however, are false.", "A spokesperson for the San Francisco Police Department told AFP by email on June 19, 2020 that they are “not familiar with any ‘Crime Statistics Bureau'\". The spokesperson noted legitimate sources of crime data include the FBI’s Uniform Crime Reporting program and the State of California’s Department of Justice.", "Justin Nix, an associate professor of Criminology and Criminal Justice at the University of Nebraska, Omaha, also told AFP via email on June 23, 2020 the statistics in the graphic were “completely bogus.”", "Nix pointed to the FBI’s known race/ethnicity homicide data for 2015, which show significantly different percentages than the misleading graphic. The percentages based on the FBI’s data are as follows:", "Nix added, however, that “many homicides involve an unknown perpetrator, making it impossible to estimate the percentages shown in that graphic.”", "“According to the FBI, there were 7,039 Black people and 5,854 White people murdered in 2015. But nevertheless, it’s well established in Criminology that most crime is intraracial,” Nix said.", "Regarding police killing statistics, Nix said US figures are “woefully inadequate” but pointed to The Washington Post’s database on fatal police shootings, which Nix said accounts for “~95% of all police killings”.", "According to the database, which categorised victims by race, there were 994 fatal police shootings in 2015. The victims included 258 black people and 497 white people.", "Nix added: “It’s far from perfect, but we could add those numbers into the FBI homicide figures above to get the following: \"", "Mapping Police Violence, an independent research group, recorded even more total police killings than The Washington Post, claiming that police killed at least 1,152 people in the US in 2015.", "The misleading graphic was also previously debunked in 2015 by Politifact and FactCheck.org after then presidential candidate Donald Trump retweeted the image.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]