["About this rating", "Tanya McDowell, an African American woman who was purportedly homeless, was given five years in prison for sending her son to the wrong school district as part of a plea deal involving the school incident and several other charges, while Felicity Huffman, a wealthy, white Hollywood celebrity, was given 14 days in prison in the U.S. college-admissions scandal.", "However, McDowell and Huffman's criminal cases make poor direct comparisons because they involve different criminal charges, different circumstances and different criminal jurisdictions.", "The criminal case of Tanya McDowell was resolved in 2012 when she was sentenced to five years in prison for a number of charges, including larceny relating to sending her child to the wrong school district. But McDowell's case continues to be re-litigated in the public eye in comparison to other cases involving schools and perceptions of privilege.", "McDowell's five-year sentence was recently raised in comparison to that of actress Felicity Huffman, who was sentenced to 14 days in federal prison for paying to have her daughter's SAT scores inflated in what has become known as the college-admissions cheating scandal. Many shared a meme sowing outrage over the notion that a wealthy, white woman was given preferential treatment over a homeless, African American woman.\n\nIt may be easy to see why the comparison is tempting. The fact that African Americans are disproportionately impacted by the criminal-justice system has been documented in scholarly research and by the efforts of civil rights advocates. The same goes for wealthy defendants versus economically disadvantaged ones.", "In many ways, McDowell and Huffman tick the right boxes. McDowell, who is African American, was purportedly homeless at the time of her arrest while Huffman, a Hollywood celebrity, is rich and white. And it's true that McDowell was sentenced to five years in prison while Huffman was sentenced only to 14 days. But enough differences exist in their respective cases to make juxtaposing them as individuals akin to an apples-to-oranges comparison.", "Huffman pleaded guilty to federal fraud charges in a scheme in which she paid $15,000 to have a fixer correct wrong answers on her daughter's SAT exam, giving the girl an inflated score on the college-admissions test. Her attorney requested that Huffman be spared prison time, citing the fact she is a first-time, non-violent offender. The judge, however, denied that request, saying that Huffman's actions attempted to skew a system to her advantage that is \"already distorted by wealth and privilege.\"", "McDowell in 2012 received five years in state prison in Connecticut in a plea agreement reached with prosecutors over numerous charges, one of which included felony larceny. The larceny charge resulted from sending her son to a school district in which she did not not live, and it drew a public outcry. But she was arrested again, after the school incident, on charges that she offered drugs and prostitutes to undercover police officers. Her attorney, Darnell Crosland, argued at the time that he believed police had entrapped McDowell in retaliation for the public support she received in the school case, but prosecutors stated police were following up on a complaint that McDowell was dealing drugs on the street.", "In all, McDowell faced seven counts for the school incident and drug charges, which were resolved together with a plea deal in which she was sentenced to a total of five years behind bars, five years' probation, and a 12-year suspended sentence. McDowell, unlike Huffman, also had a criminal record: a previous conviction for bank robbery and for having a weapon in a vehicle. McDowell's record may have influenced her sentencing: \"A person’s prior criminal history is taken into consideration in determining any subsequent plea agreement and the corresponding sentence,\" Mark Dupuis, spokesman for the Connecticut state division of criminal justice told us in an email.", "In sum, it's true that McDowell and Huffman faced drastically different punishments for their crimes, and it is also true that inequity in the criminal-justice system continues to be a pressing social issue. However, the two criminal cases serve as poor comparisons because they involve different types of crimes, circumstances, and jurisdictions. Therefore we rate this claim \"Mixture.\"", "Nickerson, John. \"Affidavit: Tanya McDowell Offered to Sell Drugs, Pimp Out Prostitutes to Undercover Cops.\"\r\n  Stanford Advocate. 14 June 2011.", "Tepfer, Daniel. \"Tanya McDowell Sentenced to 5 Years in Prison.\"\r\n  Connecticut Post. 27 March 2012.", "Starr, Sonjua B. and M. Marit Rehavi. \"Racial Disparity in Federal Criminal Sentences.\"\r\n  University of Michigan Law School. 2014.", "Walsh, Colleen. \"The Costs of Inequality: A Goal of Justice, a Reality of Unfairness.\"\r\n  The Harvard Gazette. 29 February 2016.", "Romo, Vanessa. \"Actress Felicity Huffman Sentenced to 14 Days in College Admissions Scandal.\"\r\n  NPR. 13 September 2019.", "Winton, Richard. \"Remorseful Felicity Huffman Could Get Home Confinement Over Prison Time.\"\r\n  Los Angeles Times. 20 April 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]