["By Angelo Fichera", "Posted on December 9, 2019", "A long-circulating headline on social media misleadingly tells users that Democrats chose to “vote down” a health records system for veterans while approving the same for immigrants who cross the border illegally. The bill in question did not affect veterans.", "The Democratic-controlled House in late September passed a bill largely along party lines that would create new requirements for the Department of Homeland Security regarding medical screenings of immigrants who cross the border illegally — including the implementation of an electronic health records system.", "In the more than two months since the House passed the bill, it hasn’t moved forward in the Republican-controlled Senate. But the prospect of the records system has continued to draw ire online thanks to a misleading headline that has ricocheted on social media.", "The headline, circulating on a YouTube video from an account called Top Stories Today, offers a grossly distorted take on what the bill does: “Dems Vote To Enhance Med Care for Illegals Now, Vote Down Vets Waiting 10 Years for Same Service.”", "In reality, the legislation at the center of the report that follows didn’t concern veterans’ medical care.", "The headline is lifted directly from an article on the conservative website the Western Journal, whose original story serves as the script for the YouTube video. The video has been posted on partisan Facebook pages in recent days — and has been shared by thousands of users from there — and its total views have climbed to more than 191,000.", "The bill, H.R. 3525, is known as the “U.S. Border Patrol Medical Screening Standards Act.” It was sponsored by Rep. Lauren Underwood, a Democrat from Illinois.", "Part of the bill requires DHS to research and recommend “innovative approaches” to improve the medical screening of immigrants who cross the border illegally — especially of children, pregnant women, the elderly and other “vulnerable populations.”", "The next portion covers the electronic records system requirement. It reads:", "H.R. 3525: Not later than 90 days after the date of the enactment of this Act, the Chief Information Officer of the Department of Homeland Security, in coordination with the Chief Medical Officer of the Department, shall establish within the Department an electronic health record system that can be accessed by all departmental components operating along the borders of the United States for individuals in the custody of such components.", "Underwood has described her legislation as one to “address the humanitarian crisis at the U.S.-Mexico border” and has said it “builds upon ongoing DHS efforts to improve electronic medical recordkeeping by directing the agency to establish an electronic health record system that can be accessed by all departmental components operating along U.S. borders.”", "U.S. Customs and Border Protection is reportedly already developing such an electronic health records system, but the bill would expedite that process by setting a 90-day deadline.", "The bill itself makes no mention of veterans — but House Republicans opposing the legislation connected the proposed electronic records system to an unrelated, existing project to overhaul the electronic health records system used for veterans.", "Here’s the background on that: In June 2017, then-Secretary of Veterans Affairs David Shulkin announced the agency would change its electronic health records system to the same system as the Department of Defense. The goal, according to the VA, is to create “a new system that will link in with the Department of Defense’s patient records and unify all VA facilities on one system.”", "The VA awarded a contract a year later to Cerner, a health IT company, and referred to the project as “one of the largest IT contracts in the federal government, with a ceiling of $10 billion over 10 years.” The total estimate is now more than $16 billion. The system will be “fully interoperable” — meaning that “patient information from different doctors, pharmacies, labs, etc. will be stored in the same language, in the same place, and in a format that is quickly accessible and easy to use,” the department notes. “This benefits Veterans by eliminating the cumbersome manual transfer of records when service members transition from their military careers and when Veterans see multiple providers both inside and outside the Department of Veterans Affairs (VA) system.”", "Before the final vote on Underwood’s bill to require the electronic records system at the border, Republican Rep. Mark Green of Tennessee introduced a “motion to recommit” the bill — a last-minute legislative maneuver to amend a bill — that called for pushing back the electronic records system’s implementation until September 2027. He cited the estimated completion date of the new VA system.", "“All this amendment does is ensure that our veterans get this service first,” Green said on the House floor.", "Democrats rejected the argument: House Majority Leader Steny Hoyer said that the motion was a delay tactic that wouldn’t do “a single thing” for veterans’ health care.", "Green’s motion to recommit the bill failed, and the bill ultimately passed. Some Republicans continued to muddy the waters: Rep. Tim Burchett tweeted a video and wrote “Amendment to give VETERANS same healthcare as ILLEGALS fails. Are you kidding me? We are so out of wack.”", "That’s grossly misleading since, as we said, the proposed amendment would not “give” veterans any type of “healthcare” — and the new records system for veterans was already underway.", "Two days after the House passed H.R. 3525, the Western Journal published its article under its misleading headline: “Dems Vote To Enhance Med Care for Illegals Now, Vote Down Vets Waiting 10 Years for Same Service.” The Top Stories Today video under the same headline appeared on YouTube a day after that, and both have festered online in the more than two months since.", "“The bill gives the DHS 90 days after the bill receives final approval to get the job done,” claims the speaker in the video, reading from the original Western Journal article. “In contrast, the Veterans Administration has been working for years to implement an EHR system for veterans.”", "That’s misleading — as an updated version of the Western Journal article now makes clear by noting that the VA does have an electronic health records system already (albeit with some limitations).", "Susan Carter, a VA spokeswoman, also confirmed in an email that the agency already uses an electronic health records system — known as Veterans Health Information Systems and Technology Architecture, or VISTA.", "Likewise, Genevieve Morris, who briefly served as chief health information officer for the VA’s Office of EHR Modernization, told FactCheck.org that “the claim that [the bill is] giving to illegal immigrants something that the veterans don’t have is not accurate at all.”", "Morris was previously the principal deputy national coordinator for the U.S. Department of Health and Human Services. In that role, before taking the formal position with the VA, she was detailed to the VA and helped finalize the contract with Cerner for the new records system. Morris said the 10-year timeline is necessitated by the scope of the project: “There is literally no way to do the VA implementation faster.”", "“When you are transitioning the largest health care system in our country … to a new system, it requires significant data mapping, significant data transferring, significant data training,” she said.", "Carter, the VA spokeswoman, also said that “[d]eployment of any new electronic health record system is a complex process that must be done carefully and deliberately to ensure continuity of care.”", "Morris — who resigned from her position at the VA in August 2018 and now owns a health IT consulting firm and is running for Congress as a Republican in Maryland’s 2nd District — said comparing the VA’s overhaul and the proposed system at the border “is not a fair comparison” due to the VA’s scale.", "While the proposed bill’s deadline for the electronic health records system at the border is “probably not very realistic” and lawmakers are right to want to know the costs and the return on investment, Morris said, such a system could benefit those working at the border, and taxpayers, since access to immigrants’ medical records across government facilities can prevent duplicate services.", "“You’re trying to enable the people who are working in those facilities to better do their job and ensure that we’re not adding to our own cost of taxpayer dollars,” she said. Immigrants “receive safer care and are less likely to have adverse effects” — and end up in costly emergency situations — “because their data is readable, findable, and shareable. It doesn’t change the actual healthcare services they get in those facilities.”", "In short, the text and video reports distort the facts in claiming that Democrats “vote[d] down vets waiting 10 years for same service.”", "As we said, the motion to recommit would not have had an effect on the project underway to implement the new electronic health records system for veterans — which has received continued funding from Congress. The department’s Office of Electronic Health Record Modernization received $1.1 billion for fiscal year 2019, which it said allows the “VA to maintain fidelity to the planned implementation schedule for the new electronic health record (EHR) system, beginning with the Initial Operating Capability (IOC) sites in the Pacific Northwest.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Boyd, Aaron. “Can CBP Stand Up an Electronic Health Records System in 90 Days?” Nextgov.com. 7 Nov 2019.", "Morris, Genevieve. Former chief health information officer for Veterans Affairs Office of EHR Modernization. Phone interview with FactCheck.org. 6 Dec 2019.", "U.S. House. “H.R. 3525, U.S. Border Patrol Medical Screening Standards Act.” (as approved by the House 26 Sep 2019)", "“VA Signs Contract with Cerner for an Electronic Health Record System.” Press release, U.S. Department of Veterans Affairs. 17 May 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]