["“Joe Biden was wearing a wire, he was being fed information through an earpiece,” claims a September 29, 2020 Facebook post on the night of the first presidential debate.", "Below, screenshots of the Cleveland, Ohio debate show dark areas on Biden’s left wrist and chest that the post identifies as microphone components. It claims these were used to feed responses to the Delaware politician, whom he considers too “incoherent” to be able to debate appropriately on his own.", "Other users uploaded low-resolution videos of the same segment on Facebook, making similar claims.", "The day of the debate, Trump’s communications director Tim Murtaugh published a statement in which he declared that Biden had refused to go through a pre-debate hearing device search.", "“Joe Biden’s handlers several days ago agreed to a pre-debate inspection for electronic earpieces but today abruptly reversed themselves and declined,” Murtaugh said in the statement, which also claimed that Biden’s team had asked for multiple breaks during the debate, and that Barack Obama’s vice president refused to undergo a drug test.", "“Of course he’s not wearing an earpiece and we never asked for breaks,” Biden deputy campaign manager Kate Bedingfield told a Washington Post reporter the same day in response to Murtaugh’s statement. Team Biden spokesman Andrew Bates confirmed Bedingfield’s statement in an email to AFP.", "The first image shows something peeking out of Biden’s left sleeve, as he raises his hand to cough, which posts identify as the microphone end of a wire.", "The moment can be found in CNN’s footage of the debate at 3 minutes and 40 seconds, or on this ABC News footage at 2 hours 8 minutes and 19 seconds.", "However, the black spot is not a mic, but part of a rosary that the former VP wears in memory of his son Beau Biden who died of brain cancer in 2015.", "“It’s Beau’s rosary,” Team Biden spokesman Bates said.", "Biden mentioned that his younger son Hunter bought rosaries for Beau and his dad in Mexico on the “Megyn Kelly Today” show in November 2017.", "“I have not taken off the rosary Beau was wearing when he passed, since then. It's my connection with him,” he said at the time, after the camera zoomed in on his left wrist.", "The second image shows a thin black line briefly appearing on Biden’s white shirt, on the right side of his chest, after the Democrat scratches his right shoulder.", "This segment can be found on CNN’s footage starting at 34 minutes and 40 seconds, and on CSPAN’s footage at one hour two minutes and 22 seconds.", "However, watching the entire segment instead of only the screenshot shows that the thin line is not a wire but a crease, caused by the movement of Biden’s shirt as he scratches his shoulder. It disappears once a movement causes the shirt to stretch again.", "Biden called Trump’s behavior during the debate a “national embarrassment,” while on the campaign trail in Ohio. He defended his family against attacks, particularly when Trump raised his son Hunter’s past drug abuse.", "Polls show Trump trailing Biden by 6.5 points. The president and his campaign team frequently attempt to portray Biden as too old and senile to serve, whether in ads or by using the nickname “Sleepy Joe.” Online disinformation has exploited that theme, for example when a viral doctored video allegedly showed the Democrat sleeping.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]