["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Greg Abbott warns in this April 2018 fundraising appeal that George Soros has unloaded money in Texas to lift Democrats to November wins. HALF TRUE, PolitiFact Texas found.", "In 2017, we found no evidence of George Soros, the internationally prominent pro-Democratic financier, investing in races for state office in Texas.", "More recently, Republican Gov. Greg Abbott warned afresh about Soros in a fundraising letter, opening: \"Every weapon in the national Democrat machine’s arsenal is aimed straight at Texas today.\"", "Abbott’s April 2, 2018, letter states next: \"Left-wing BILLIONAIRE George Soros has already unloaded a whopping $1 million to install his liberal puppets in positions of power this fall.\"", "The letter warns that Democrats are preparing an all-out assault and could seize control of the state at the ballot box. \"I know,\" the letter further says, that \"left-wing special interests and BILLIONAIRE liberals like George Soros are pouring outrageous sums of money into driving up Democrat turnout.\"", "After we didn’t hear back from Abbott about his basis for the \"puppets\" claim, we decided to check state, local and federal records for indications of Soros unpacking lucre to help Texas Democrats win election in 2018.", "Soros helped a Bexar County Democrat", "From the top, we knew that Soros invested significantly in a group that backed a successful challenger to the Bexar County district attorney. Attorney Joe Gonzales bested first-term incumbent Nicholas \"Nico\" LaHood in Bexar County’s Democratic primary after Soros contributions propelled a pro-Gonzales political committee.", "Of note: Soros boosted the pro-Gonzales committee a couple of years after Soros put more than $1.4 million into electing Democrat Kim Ogg as the district attorney of Harris County. An October 2016 Houston Chronicle news story pointed out that Soros had similarly put his money into district attorney races in Florida, Illinois, Mississippi and New Mexico, each time through state-specific PACs with variations on the name \"Safety and Justice.\" The story also said Soros had supported criminal justice reforms including reduced racial disparities in sentencing and relaxed marijuana restrictions.", "In San Antonio, LaHood chalked up his loss to Soros’s spending, the San Antonio Express-News reported. \"In my opinion, the voters were unfairly influenced by $1 million worth of lies,\" LaHood said. \"There's no other way to say it.\"", "Gonzales has yet to win the DA post; he’s set to face Republican Tylden Shaeffer on this November's ballot.", "For his part, Gonzales said after his primary win that Soros’ contributions came without strings attached. \"There was a clear understanding from the beginning that we would accept their contributions, but we were not going to be told how to run this office,\" Gonzales said.", "An Express-News spreadsheet tallies contributions by Soros to Texas Justice & Public Safety, the political committee supportive of Gonzales. According to the sheet, which was based on Gonzales’ campaign finance reports filed with the county elections department on Jan. 17, Feb. 5 and Feb. 26, 2018, the committee made $964,377 worth of in-kind contributions to Gonzales’ campaign from Dec. 18, 2017, through Feb. 23, 2018, mostly in TV ads and voter mailings but also in polling, research and palm cards.", "Gonzales’ campaign directly fielded no Soros contributions, the filings indicate.", "Multiple Democratic beneficiaries?", "Abbott’s fundraising letter warns of Soros spending money to install \"puppets.\"", "To gauge whether Soros chose multiple Texas Democrats to help, we conducted online searches of candidate and political committee finance reports filed with  the Texas Ethics Commission and Federal Election Commission.", "Previously, our 2017 search of campaign finance reports filed with the ethics commission from 2000 into 2017 indicated Soros hadn’t personally donated to candidates for state office--not once. Similarly, our fresh search of state records yielded no indication of Soros spending on races besides the Bexar County battle for the Democratic nomination for district attorney. In pre-primary reports, we found, the pro-Gonzales Texas Justice & Public Safety committee reported fielding $1.04 million in Soros contributions.", "According to our separate search of campaign reports filed with the FEC, Soros made 49 contributions nationally from February 2017 into March 2018, totaling $4,587,000.", "But, our search suggests, very little went to Texas Democrats. We identified a single Soros contribution to a Texas candidate. Soros gave $2,700 on Dec. 1, 2017 to Democratic U.S. Senate hopeful Beto O’Rourke, the El Paso congressman.", "Our ruling", "Abbott warned in his letter that Soros has spent $1 million to \"install his liberal puppets in positions of power\" in Texas this fall.", "We confirmed Soros spending in Texas, but he's yet to put a penny toward Democrats seeking state office. The New Yorker gave a little more than $1 million to a committee that helped a challenger win the Democratic nod for Bexar County district attorney. He gave $2,700 to O’Rourke, who went on to win the Democratic Senate nomination.", "All told, we rate this claim Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Story, \"Greg Abbott warns of George Soros--who has yet to put money into Texas state elections,\" PolitiFact Texas, Sept. 11, 2017", "News stories, San Antonio Express-News, \"Liberal billionaire George Soros backs Nico LaHood's Democratic opponent,\" Jan. 29, 2018; \"Soros contributions to LaHood DA challenger nears $1 million,\" Feb. 27, 2018;  \"LaHood out as Bexar County district attorney,\" March 6, 2018", "News story, \"Soros again pumps money into Harris County district attorney's race,\" Houston Chronicle, Oct. 13, 2016", "Spreadsheet of contributions by George Soros family members to Texas candidates for state office and political committees, 2000 into 2017 (downloaded by PolitiFact Texas from website, \"Search Campaign Finance Reports,\" Texas Ethics Commission, search date Aug. 25, 2017)", "Spreadsheet of spending by Texas Safety and Justice PAC, 2016 (downloaded by PolitiFact Texas from website, \"Search Campaign Finance Reports,\" Texas Ethics Commission, search date Aug. 25, 2017)", "Campaign finance reports filed by Texas Justice & Public Safety PAC, \"30th Day Before Election Report,\" filed Feb. 5, 2018;  \"Corrected 8th Day Before Election Report,\" filed Feb. 26, 2018 (downloaded April 25, 2018)", "Campaign finance reports filed by Joe Gonzales, \"Semi-Annual Report,\" filed Jan. 17, 2018; \"30th Day Before Election Report,\" filed Feb. 5, 2018; \"8th Day Before Election Report,\" filed Feb. 26, 2018", "Spreadsheet showing George Soros contributions to federal candidates and political committees, February 2017 into March 2018 based on search of website, \"Raising,\" Federal Election Commission (accessed April 26, 2018)", "Image, page from Beto O’Rourke campaign finance filing showing George Soros contribution, Dec. 1, 2017 (fetched from website, Federal Election Commission, April 26, 2018)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]