["About this rating", "In February 2016, an image purportedly showing an official \"Bernie Sanders Forever Stamp\" issued by the United States Postal Service started circulating on social media:", "The above-displayed image is neither an official item from the United States Postal Service, nor is it an actual stamp. This piece of political postage was created by a self-styled \"monthly journal of progressive cartoons\" called The Comic News, and while it was designed to look like a forever stamp (which can be used to mail first class letters forever without having to buy additional postage, no matter what the going rate might be), the above-displayed graphic is actually a portion of an envelope:\nThe deception is accomplished by means of incorporting a USPS Forever Stamp (a flag) into the design printed in the upper-right corner of the envelope. When the Forever Stamp is affixed in its designated place, the Bernie Sanders ‘stamp’ image has been completed.", "The ready-for-mailing envelope comes with a “Red, White, and Blue” Forever Stamp and requires no additional postage to be mailed first class anywhere in the U.S. (up to one ounce, like all Forever Stamps).", "An image of the actual envelope, which was posted to Facebook in February 2016, clearly shows the Bernie Sanders envelope with a blank space reserved for a stamp:\n\nWhile the above-displayed envelopes are real, they still need a real stamp before they can be mailed via the United States Postal Service.\nThis isn't the first time that The Comic News has issued stamp-ready envelopes with a political flavor.  According to founder and publisher Thom Zajac, they've also put out Reagan envelopes and Nixon ones:", "While the above-displayed envelopes are real, they still need a real stamp before they can be mailed via the United States Postal Service.", "This isn't the first time that The Comic News has issued stamp-ready envelopes with a political flavor.  According to founder and publisher Thom Zajac, they've also put out Reagan envelopes and Nixon ones:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]