["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The comic strip \"Doonesbury\" noted that the CIA outsourced the design and implementation of its torture program.", "With North Carolina Sen. Richard Burr, R-N.C., now in charge of Senate oversight of the Central Intelligence Agency, it’s unclear how much the CIA’s torture legacy will remain in the spotlight. But leave it to Doonesbury to pipe up with a reminder that enhanced interrogation came with an enhanced price tag.", "In Sunday’s Jan. 11 strip, the debauched character Duke, now a K Street lobbyist, looks up from his newspaper in surprise.", "\"It turns out that before 9/11, the CIA didn’t have any real torture experience,\" Duke says. \"So they hired these two psychologists, Dr. Jessen and Dr. Mitchell, to develop and run their torture program. For which they were paid $81 million!\"", "A reader asked us if that was accurate, and we can report that in large part, it is.", "When asked for his source, Doonesbury creator Garry Trudeau told PunditFact \"this one is an easy Google,\" and sent us a Wikipedia link.", "We looked at the report from the Senate Select Committee on Intelligence, and found the key details on page 18.", "\"The CIA contracted with two psychologists to develop, operate, and assess its interrogation operations,\" the report said. \"In 2005, the psychologists formed a company specifically for the purpose of conducting their work with the CIA. Shortly thereafter, the CIA outsourced virtually all aspects of the program. In 2006, the value of the CIA's base contract with the company formed by the psychologists with all options exercised was in excess of $180 million; the contractors received $81 million prior to the contract's termination in 2009. In 2007, the CIA provided a multi-year indemnification agreement to protect the company and its employees from legal liability arising out of the program. The CIA has since paid out more than $1 million pursuant to the agreement.\"", "The Senate report did not name the two psychologists, but many news reports did. The Los Angeles Times reached James Mitchell at his home in Land O’ Lakes, Fla. The paper reported that Mitchell rejected the committee’s description of his work.", "\"Go ahead and smear me if you want,\" Mitchell told the Los Angeles Times. ‘A lot of what's written in the Senate … report is just flat-out wrong. It's taken out of context.\" (We're attempting to reach Mitchell; if we hear from him, we'll let you know.)", "The Los Angeles Times described how Mitchell’s colleague Bruce Jessen was on hand in 2002 when an Afghan detainee was stripped and dragged down a hallway. The detainee was later found dead in an unheated cell and an autopsy concluded that he likely froze to death.", "There are some details the cartoon doesn't go into that are worth noting. First, Mitchell and Jessen’s company had a total of seven owners. So presumably the two men weren't the only people receiving money. Second, the $81 million isn't pure profit.", "According to the Los Angeles Times, the money covered a range of expenses. Mitchell and Jessen's company \"provided interrogators, operation psychologists, debriefers and security guards\" to CIA secret prisons. The final payments included $75 million for services and $5 million in case the company faced criminal prosecution or other legal liability, the Los Angeles Times said.", "Our ruling", "Doonesbury, aka Garry Trudeau, said that the CIA paid two psychologists $81 million to develop and run its torture program. The Senate Select Committee on Intelligence report confirms the amount of money spent on a variety of things. Other news organizations revealed the actual names of the two men -- though in reality seven people owned the company.", "The claim is accurate but needs additional information. We rate it Mostly True.", "Help fund PolitiFact’s Kickstarter to live fact-check the 2015 State of the Union and GOP response.", "Washington Post, Doonesbury, Jan. 11, 2015", "Senate Select Committee on Intelligence, Committee study of the Central Intelligence Agency’s detention and interrogation program, Dec. 3, 2014", "NBC News, CIA Paid Torture Teachers More Than $80 Million, Dec. 14, 2014", "Los Angeles Times, Two psychologists' role in CIA torture program comes into focus, Dec. 14, 2014", "Saturday Night Live, Torture interview, Dec. 13, 2014", "Email interview, Garry Trudeau, Jan. 12, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]