["By Saranac Hale Spencer", "Posted on November 4, 2020", "The falsehood that votes for President Donald Trump weren’t counted in Arizona because the ballots were filled out with Sharpie pens spread widely on the day after the election. But the county where the claim originated actually recommends that voters use fine tip Sharpies to fill out their ballots.", "The word “Sharpie” trended on Twitter as a bogus claim of voter fraud in Arizona spread online, while ballots in key states were counted following the Nov. 3 election.", "The claim appears to have begun with a viral video taken outside of a Maricopa County polling place on Election Day.", "The person recording the video is heard saying, “What they’re doing is they’re telling people to use the Sharpies, that way, those votes aren’t counted… They’re doing it because they’re trying to skew all of the votes in there… So, people are coming here to vote for Donald Trump and those votes are all getting invalidated.”", "But the video offers no evidence to support that claim. It shows one woman who repeats the same claim and another woman who appears to be hearing it for the first time.", "The person who posted the video on Facebook, Marko Trickovic, did not respond to our request for comment.", "County and state officials have been clear, though — all ballots will be counted.", "Secretary of State Katie Hobbs took to Twitter, saying: “IMPORTANT: If you voted a regular ballot in-person, your ballot will be counted, no matter what kind of pen you used (even a Sharpie)!”", "Hobbs also clarified on CNN, “I want to validate voters who have concerns about their ballots being counted. There is no concern about ballots being counted because of the pen that was used to mark the ballots. All of those ballots are being counted. And even if the machines can’t read them for some reason, a marker bled through to the other side, we have ways to count them. They’re going to be counted. There is absolutely no merit to saying that this was some conspiracy to invalidate Republican ballots. It just – there is no there there at all.”", "And, when it announced new voting equipment earlier this year, the Maricopa County Recorder’s Office said polling places would use fine tip Sharpies “because it’s the fastest drying ink and works best on the tabulation equipment.”", "The recorder’s office reminded voters of that fact on Election Day, tweeting: “Did you know we use Sharpies in the Vote Centers so the ink doesn’t smudge as ballots are counted onsite? New offset columns on the ballots means bleed through won’t impact your vote!”", "Despite those facts, some conservative activists have promoted the bogus claim, suggesting that it applies to the entire state of Arizona.", "Not only is it false in Maricopa County, it’s false in the rest of the state, too.", "Most counties in Arizona use voting machines manufactured by Election Systems & Software.", "Katina Granger, spokeswoman for the ES&S, told FactCheck.org by email that “black felt tip pens such as a Sharpie are fine” with their machines.", "Sometimes, though, a felt tip pen can bleed through and darken a selection on the other side of the ballot, she explained about how the system generally works. In that case, “the machine would kick out the ballot for further review.”", "Maricopa County, however, has machines that use Dominion Voting Systems software and ballots, which prevent one side from bleeding through and darkening a selection on the other side, Kay Stimson, spokeswoman for Dominion, explained in an email to FactCheck.org.", "“Election officials are well-accustomed to dealing with ballots marked with different types of writing utensils,” Stimson said. “Fine-tipped Sharpies have been found to provide the fastest-drying ink, which helps to prevent any smearing or stray marks on ballots being marked at the polls.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Hobbs, Katie (@SecretaryHobbs). “IMPORTANT: If you voted a regular ballot in-person, your ballot will be counted, no matter what kind of pen you used (even a Sharpie)!” Twitter. 4 Nov 2020.", "Frequently Asked Questions. Maricopa County Recorder’s Office. Accessed 4 Nov 2020.", "Maricopa County Elections Department. Press release. “Our Ballots Got a Makeover!” Accessed 4 Nov 2020.", "Maricopa County Elections Department (@MaricopaVote). “Did you know we use Sharpies in the Vote Centers so the ink doesn’t smudge as ballots are counted onsite? New offset columns on the ballots means bleed through won’t impact your vote!” Twitter. 3 Nov 2020.", "Granger, Katina. Spokeswoman, Election Systems & Software. Email to FactCheck.org.", "Stimson, Kay. spokeswoman, Dominion Voting Systems. Email to FactCheck.org.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]