["About this rating", "A Facebook video appeared to depict live worms on Little Debbie Cosmic Brownies.", "The creatures in the video were most likely pantry moth larvae developed at the supermarket or home storage stage.", "On 25 May 2017 Facebook user Jessica O'Hern shared a video which purportedly depicted live worms crawling out of a recently unwrapped Little Debbie Cosmic Brownies snack cake:", "O'Hern didn't include commentary with the video, leaving many viewers to presume that the worm crawled out from the snack cake. As typically happens when someone posts a gross-out video of a favorite snack, the clip spread rapidly across Facebook:", "In a separate post, O'Hern said:", "So my fiancé just grabbed a pack of the Cosmic Brownies out the box. Then he opened the packet and found a worm of some sort on one side of the brownie! Then, another worm started coming out the middle of the brownie... WILL NOT be eating these anymore ????", "That post was shared hundreds of thousands of times:", "In June 2016, a Facebook user said he had found \"worms\" in Little Debbie Oatmeal Pies. We contacted Little Debbie about the claim at the time, and a company representative told us that they had inspected the package in question and found signs of pantry moths. The life span of a pantry moth, the representative told us, made the idea that the insects had invaded the snack cakes during the manufacturing process implausible.", "After the Cosmic Brownies incident, we again spoke to a Little Debbie representative, who told us that the woman who posted the claim did not respond to the company's attempts to investigate. They told us that, once again, the insect in question appeared to be a pantry moth, a creature whose lifecycle is too short to survive manufacturing, shipping, point of sale, and home storage. Like the oatmeal pies, their brownies are rapidly sealed after being baked at temperatures too high for any insect to survive.", "The pantry moths likely found their way into the brownies at a grocery store or in the home, the representative told us.", "We contacted O'Hern via Facebook for further information, but have not yet received a reply.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]