["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Rick Scott had a \"terrible 2013,\" says the Florida Democratic Party in a year-end video bashing the Republican leader who faces voters next year.", "The Democrats unveiled a long list of attacks, most of which were recycled from earlier attacks or news articles. But this one in particular caught our eye:", "\"This fall Scott even backed the federal shutdown that cost Floridians millions each day and pushed America to the brink of default.\"", "We wanted to check if Scott, the self-described jobs governor, backed the October shutdown that furloughed hundreds of thousands of employees. Some House Republicans had hoped to use a shutdown to delay or defund the federal health care law, but that didn’t happen.", "What Scott said", "Scott didn’t get a vote on the federal shutdown so the only way to judge whether he \"backed\" it is by reading his words. We reviewed statements Scott made in news releases and to the media about the shutdown, which started Oct. 1 and ended Oct. 16.", "We found that Scott repeatedly bashed Obama and praised the way that Florida had handled its own finances, but he avoided taking a stance in favor or against the shutdown.", "On Sept. 30 Scott issued a news release that stated:", "\"The impending federal government shutdown represents a failure of leadership. One of the most basic functions of governing is budgeting. At the state level, we compromise and negotiate to create a balanced budget every year. But, President Obama has shown no interest in negotiating or compromising. We have paid down state debt in Florida by $3.5 billion and paid back another $3.5 billion federal loan over the last two and a half years while also cutting taxes.\" (We should note that state debt is a very different animal than federal debt, and states are prohibited from running annual budget deficits.)", "In addition to that news release, a Scott spokeswoman sent us a few tweets by Scott (\"The buck stops with the President. We need leadership now,\" and \"@BarackObama and Congress should not take pay for every day of shutdown\").", "But none of those tweets shed much light on whether he thought shutting down the government was a good idea or not.", "During a news conference Oct. 9, Scott refused to answer questions about whether he agreed with Republicans in Washington who tied the budget to delaying or defunding Obamacare:", "\"What I agree with is the fact that the buck stops with the president,\" Scott said. \"It's disappointing he doesn't know how to compromise and negotiate to get a budget done. I've done it for three sessions....\"", "The next day, Scott’s chief of staff announced that Florida would not use state funds to temporarily backfill federal programs. At the time, there was mounting criticism that the shutdown which closed federal parks was a blow to the fishing and tourism industry in the Keys.", "On Oct. 16, Obama signed a bill that ended the shutdown. Scott criticized the fact that it wasn't a long-term agreement on debt and said that \"our nation’s leaders have their heads in the sand about our economic future.\"", "A spokesman for the Florida Democratic Party pointed to two blog posts -- from the Tampa Bay Times and the Florida Times-Union -- that stated Scott’s position on the shutdown aligned him with congressional Republicans and pointed to Scott’s repeated criticism of Obama.", "While it’s true that Scott did put blame on Obama, a review of Scott’s actual statements shows that he appeared to dodge the question of whether he supported or opposed the shutdown as a political tactic. Instead, Scott used the shutdown as a chance to criticize Obama and call for reducing federal spending and debt.", "One final note: The Florida Democratic Party also said the shutdown would \"cost Floridians millions each day.\"", "Financial analysts at Moody’s estimated the shutdown cost the economy about $20 billion in direct and indirect effects, or roughly $4 per day for every man, woman and child in America. Based on Florida’s population of about 19 million, that translates to about $77 million per day in Florida.", "\"It’s fair to say that the shutdown cost Floridians as economic agents and as taxpayers millions per day,\" Moody’s economist Brian Kessler said.", "Our ruling", "The Florida Democratic Party said that Scott \"backed the federal shutdown.\"", "Scott used the October shutdown as an opportunity to tout the state’s fiscal management and wag his finger at Obama. But a review of Scott’s statements about the shutdown shows that he dodged taking a clear stand favoring or opposing the shutdown itself.", "We rate this claim Mostly False.", "Florida Democratic Party video, \"Rick Scott’s terrible 2013,\" December 2013", "Miami Herald, \"Gov. Scott’s mantra: bash and blame Obama,\" Oct. 5, 2013", "Tampa Bay Times The Buzz blog, \"Gov. Rick Scott bashes Obama’s leadership over likely government shutdown,\" Sept. 30, 2013", "Miami Herald Naked Politics blog, \"Scott won’t answer if he supports or opposes partial shutdown,\" Oct. 9, 2013", "Tampa Bay Times, \"Millions evaporate as shutdown forces delay of Tampa defense conference,\" Dec. 9, 2013", "Tampa Bay Times, \"Gov. Rick Scott orders state agencies not to keep federal programs afloat,\" Oct. 10, 2013", "Orlando Business Journal, \"Here’s what the government shutdown will cost central Florida’s economy,\" Oct. 1, 2013", "Gov. Rick Scott press release, \"Governor Rick Scott: Obama is failing Floridians with federal government shutdown,\" Sept. 30, 2013", "Gov. Rick Scott press release, \"Gov. Scott: Our nation’s leaders have their heads in the sand about our economic future,\" Oct. 17, 2013", "Gov. Rick Scott, Tweet and Tweet and Tweet, Oct. 2, 2013", "White House, \"Impacts and Costs of the October 2013 Federal Government Shutdown,\" November 2013", "PolitiFact, \"Rick Scott says state debt was up $5.2B under Charlie Crist and down $2B under Scott,\" Jan. 9, 2013", "PolitiFact, \"Did Obama shut down the ocean as part of the shutdown?\" Oct. 7, 2013", "Interview, Chris Lafakis, Moody’s senior economist, Dec. 12, 2013", "Interview, Brian Kessler, Moody’s economist, Dec. 12, 2013", "Interview, Joshua Karp, spokesman Florida Democratic Party, Dec. 11, 2013", "Interview, Sean Snaith, director of the University of Central Florida’s Institute for Economic Competitiveness within the College of Business Administration, Dec. 11, 2013", "Interview, Jackie Schutz, Gov. Rick Scott  spokeswoman, Dec. 16, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]