["About this rating", "A series of conspiracy theories circulated after the first presidential debate between Hillary Clinton and Donald Trump on 26 September 2016, holding that the Democratic nominee had somehow rigged the event. While we were certain that we had finished scraping the bottom of this conspiracy theory barrel after addressing claims that Clinton wore an earpiece, was given the questions in advance, that Lester Holt wore an earpiece, that a Democratic operative secretly removed Clinton's answers after the debate, and that Clinton and Holt communicated via secret  hand signals, we encountered yet another rumor claiming that Clinton had rigged the debate, this time by using a teleprompter hidden in her lectern:", "The video displayed was picked up by several alt-right conspiracy web sites, including EndTheFed.com,who summarized the claim thusly:", "There were just too many cameras out of their control for their little plan to work. The question is not only one of Clinton cheating, we all expected that, but of the greater conspiracy which included those responsible for holding the debate and construction of the podiums.", "One podium seems to have been outfitted with a special light that the other didn’t have and it appears that the light was functioning as a teleprompter to give Mrs. Clinton answers that she couldn’t keep in her addled old brain. It’s really hard to memorize things or have timely recall when you’re taking heavy medications for a mystery illness.", "Hillary Clinton did not have a teleprompter hidden in her lectern.", "EndTheFed.com claims that \"there were just too many cameras\" for this plan to work, yet none of those cameras captured this teleprompter in action. In fact, there are several photographs available of Clinton speaking during the first Presidential debate with this \"teleprompter\" in clear view, yet none of those images shows anything but light reflected off the wood of her lectern:", "The key component of this conspiracy theory is that Clinton's lectern had a digital display. However, a closeup of this strip of wood shows that it is, in actuality, just a piece of wood, evidenced by the fact that the shadow of the microphone cuts through this \"digital display\":", "Hillary Clinton did not use a teleprompter during the first presidential debate. The \"digital display\" on her lectern was merely an artifact of lights used to illuminate the stage reflecting off her lectern top.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]