["The image was published here on Facebook on July 2, 2020.", "The Facebook post’s caption reads: “Good old chums Boris Johnson and Ghislaine Maxwell, Epstein’s recently arrested sidekick… You could not make this shit up #epsteined”.", "Maxwell, daughter of late media tycoon Robert Maxwell, was arrested in the US on July 2. She was charged with sex trafficking minors for her former boyfriend, the disgraced financier Jeffrey Epstein. After pleading not guilty to the charges against her, Maxwell was subsequently denied bail on July 14. She will remain in custody while awaiting her trial set for July, 2021, AFP reported here.", "Epstein killed himself in prison last summer before his own trial.", "The image was shared alongside a similar claim here, here on Facebook and here, here, here, here, here, here on Twitter.", "It was also published with a similar claim here in Turkish, and here in Finnish on Facebook.", "The claim is, however, false.", "A reverse image search on Google found the original image was published here by photographer Dafydd Jones.", "The photo’s description states that the woman in the photo is Allegra Mostyn-Owen, Boris Johnson’s first wife. It states it was taken in Oxford Town Hall in 1986.", "The same photo was published in this report by UK newspaper The Guardian and this report by British magazine Tatler in 2019 alongside a caption that it shows Johnson with Mostyn-Owen.", "The misleading posts were also debunked by US fact-check site Snopes here on July 22, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]