["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Vice President Mike Pence, center, visits Dennis Nelson, a patient who survived the coronavirus and was going to give blood, during a tour of the Mayo Clinic in Rochester, Minn., on April 28, 2020. Pence chose not to wear a face mask. (AP)", "A Facebook post claims the federal Centers for Disease Control and Prevention does not recommend that people who are healthy wear face masks to protect themselves from respiratory diseases, including COVID-19.", "That was the CDC’s advice — until a change made April 3.", "Now, to guard against the spread of the coronavirus, the CDC recommends nearly everyone wear a face covering when out in public and where social distancing is more difficult.", "President Donald Trump has said he can’t see himself wearing one. Vice President Mike Pence didn’t when he visited the Mayo Clinic.", "But generally, when it comes to protecting against the coronavirus, who should wear a face mask?", "A widely shared Facebook post appears to offer direction from an authoritative source, the University of Pittsburgh Medical Center.", "\"Please note: The Centers for Disease Control and Prevention do not recommend that people who are healthy wear face masks to protect themselves from respiratory diseases, including COVID-19,\" says what looks like a partial screenshot from a UPMC web page. \"Face masks should be worn by people who show symptoms of COVID-19 to help prevent the spread of the disease to others.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This post, published April 27, is offering old advice.", "The CDC now recommends that nearly everyone wear a face covering when out in public and where social distancing is difficult.", "Early in the coronavirus outbreak, the CDC’s guidance did deter people from wearing face masks unless they had COVID-19 and were showing symptoms. \"This is to protect others from the risk of getting infected,\" the guidance stated.", "But that changed.", "Trump announced April 3, weeks before this Facebook post, that the CDC was revising its recommendations on face coverings.", "The CDC said it was making the change based on continuing studies that found that the virus can be transmitted by people who are asymptomatic and that even those who eventually develop symptoms can transmit the virus to others before showing symptoms.", "In a question-and-answer posting about cloth face coverings, the CDC broadly recommended their use in public settings where six-feet distancing is more difficult to maintain.", "The new guidance does not differentiate between people who are healthy and people who have symptoms, as the Facebook post did.", "The CDC said:", "People should \"wear a cloth face covering to cover their nose and mouth in the community setting,\" including grocery stores and pharmacies, and especially in public in areas of widespread COVID-19 illness.", "Cloth face coverings can be fashioned from household items or made at home from common materials. Surgical masks or N-95 respirators should be reserved for healthcare workers and other medical first responders.", "A cloth face covering \"is not intended to protect the wearer, but it may prevent the spread of virus from the wearer to others. This would be especially important if someone is infected, but does not have symptoms.\"", "Cloth face coverings should not be placed on children younger than 2 years of age, \"anyone who has trouble breathing, or is unconscious, incapacitated or otherwise unable to remove the cover without assistance.\"", "The most effective homemade masks are made of thick cloth and make a tight seal around the wearer’s face.", "\"Given the current crisis, and lacking an alternative, many layers of densely woven fabric would be the most effective, because it allows for lots of voids in the layers where particles can be trapped,\" Richard Peltier, an assistant professor of environmental health sciences at the University of Massachusetts-Amherst, previously told PolitiFact. \"The mask needs to seal as tightly as possible to the face to avoid leaks, though this may not be possible with different designs, fabrics, or face shapes. Thin or porous fabrics are the least likely to be effective.\"", "Cloth masks, he added, \"should be treated as contaminated materials that you bring in to your home — they need to be laundered in hot soapy water, and you’d need to consider sanitizing in bleach or hydrogen peroxide regularly.\"", "A Facebook post reflects outdated information in claiming that the federal Centers for Disease Control and Prevention does not recommend that people who are healthy wear face masks to protect themselves from respiratory diseases, including COVID-19.", "That was the CDC’s advice — until a change made April 3. Now, to guard against the spread of the coronavirus, the CDC recommends nearly everyone wear a cloth face covering when out in public and where social distancing is more difficult.", "We rate the post False.", "Facebook, post, April 27, 2020", "Centers for Disease Control and Prevention, \"Cloth Face Coverings: Questions and Answers,\" April 4, 2020", "Centers for Disease Control and Prevention, \"Recommendation Regarding the Use of Cloth Face Coverings, Especially in Areas of Significant Community-Based Transmission,\" April 3, 2020", "Wayback Machine, Centers for Disease Control and Prevention \"Frequently Asked Questions,\" April 2, 2020", "FactCheck.org, \"COVID-19 Face Mask Advice, Explained,\" April 6, 2020", "PolitiFact, \"Will homemade masks stop coronavirus from spreading? Fact-checking Sen. Pat Toomey’s claim,\" April 1, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]