["About this rating", "In June 2017, a persistent hoax involving a falsified quote, supposedly from Nazi leader Adolf Hitler about how he would start World War III even after his death, began to recirculate in meme form:", "This passage is frequently shared in defense of Hitler to bolster the argument that he was actually not racist, and, in fact, that he believed black people were the \"true Hebrews\".  The first iteration of this text we could uncover was published on a clickbait web site called FMLGoneViral.com on 7 July 2015:", "Hitler said even in his death he will start World War 3.", "One of his soliders asked how?", "Hitler replied, “The day mankind finds out what I was trying to defend this nation, Germany, from then thats the day World War 3 will start.", "For on that day, mankind will learn that I was trying to save my Nation from The Free Masons, the Illuminati, the jews. For if the Americans wins the war, then they will conquer the world and forever be a slave to the jews and they will try to conquer God. Do you know who America has in its posession?", "“NO,” the solider replied.", "The Americans has the jewels of God. The Americans have stolen God’s precious jewels.", "“What do you mean his precious jewels?” THE SOLIDER asked.", "Hitler said, “America has stolen the jews. The Jews of God. His jewelry. The negros. They are the true hebrews. What a foolish move and a direct challenge to God. And they plan on moving these false white jews into a state of Israel.", "America is desperate in its attempt to win this war using atom bombs on Japan. America will destroy the whole world in its attempt to conquer it.", "When America and its jewish slave masters conquer the world and the world realize I was right, then all nations will begin a third world war to dethrone America of its rule. Every nation will soon possess atom bombs of their own. It will be the end of most of the world as we know it.", "“Why will the jews control America?” the solider asked", "Hitler said, “because the white jews knows that the negros are the real children of Israel. And to keep Americas secret, the jews will blackmail America. The jews will extort America Their plan for world domination wont work if the negros knew who they were. The white citizens of America will be terrified to know that all this time they’ve been mistreating and discriminating and lynching the childen of Israel. They will fear God will destroy them as he destroyed Egypt for doing the same thing. So the elite, the Illuminati keeps this a secret at all cost.", "After I die, I will one day cause World War 3 just by this message which will be like planting a seed in people minds until it sprouts once they nurture that seed and seek more truth and learn Hitler was right. I did the world a favor by killing the false jews before they designated a false state of Israel.", "But I fear I have failed. The world will fall into the hands of Satan.", "Although the clickbait site provided no citation for when Hitler allegedly made these statements, commenters on the page directed those curious about the quote's authenticity to the book The Nazis World War II by Robert Edwin Herstein.", "Other dubious sites immediately picked up on this claim and uncritically re-shared the completely bogus Adolf Hitler quote along with its alleged source — clearly without doing even the barest minimum of research, such as opening the book in which the quote supposedly appears.", "Needless to say,, this passage does not appear in Herzstein's book. We could not find this passage in either the digital copy available via Google Books, nor the hard copy we examined. Page 132 of Herzstein's book The Nazis features a photograph of Hitler, Joseph Goebbels, and others watching a propaganda film, a description of what this film depicted, as well as a few stills from the production:", "The page, like the rest of the book, does not contain an argument suggesting that Adolf Hitler was not racist (given his actions in the historical record, a case for his lack of prejudice would be difficult to make indeed) or that he was kind toward black people. (The hoax quote also appears to miss that racism can exist toward different ethnic groups.) Instead, it describes a propaganda film that linked Jewish people to other groups — including black people:", "Goebbels and Hitler personally appraise a new German movie. When the Fuhrer complained that the films espousing the Nazi line were too scarce, Goebbels rushed a pair of anti-semitic pictures into production.", "In one segment of a Nazi \"Instructional\" film (right), the genetic heritage of the Jew is purportedly traced to Oriental, Negro, Near Asian and Hamitic peoples. Hence, the film concludes, \"the Jew is a bastard.\" Below, the villainous title character of Jud Suss, a violently anti-Semitic melodrama, spins chemes with his crony, Rabbi Loew.", "MOVIES HINTING AT HORRORS TO COME", "To Joseph Goebbels, films were \"one of the most modern and scientific means of influencing the masses\" Though the German film industry remained largely in private hands, every movie needed the imprimatur of the Propaganda Ministry before it reached the screen, and Goebbels became notorious for meddling with scripts, directors, and actors. In 1938, he set movie studios to work producing anti-Jewish films.", "In addition, a special team was assembled at the ministry itself to undertake a project called The Eternal Jew. The result, a virulent 45-minute harangue billed as a documentary, was shown to audiences throughout Europe. The film featured a lingering look at kosher animal slaughter, imputing sadism and bloodthirstiness to the \"Jewish race.\" Jews were likened to rats and other vermin: \"They carry disease,\" warned the narration.", "Such films, which depicted the Jews as a plague to be eradicated, hinted darkly at the real-life horrors to come.", "The propaganda film described in this book attempted to trace Jewish ancestry to other groups of people, most likely to demonize other cultures outside of the Aryan race — not to absolve any groups or make anti-racist arguments.", "An article published by the United States Holocaust Museum explained that although black people were not targeted in the same way as Jews, they were still persecuted, and Germany produced propaganda that painted black soldiers as chronic rapists and a threat to the \"purity\" of the German race:", "The fate of black people from 1933 to 1945 in Nazi Germany and in German-occupied territories ranged from isolation to persecution, sterilization, medical experimentation, incarceration, brutality, and murder. However, there was no systematic program for their elimination as there was for Jews and other groups.", "[...]", "Following World War I and the Treaty of Versailles (1919), the victorious Allies occupied the Rhineland in western Germany. The use of French colonial troops, some of whom were black, in these occupation forces exacerbated anti-black racism in Germany. Racist propaganda against black soldiers depicted them as rapists of German women and carriers of venereal and other diseases. The children of black soldiers and German women were called “Rhineland Bastards.” The Nazis, at the time a small political movement, viewed them as a threat to the purity of the Germanic race. In Mein Kampf (My Struggle), Hitler charged that “the Jews had brought the Negroes into the Rhineland with the clear aim of ruining the hated white race by the necessarily-resulting bastardization.”", "The rumor that Adolf Hitler said that World War III would begin when the United States realized that black people were the \"true Hebrews\" originated in an unsourced article published by a disreputable web site, and which appears to loosely string together an entire ecosystem of impossibly farfetched and completely unsourced conspiracy theories. Although the quote in the meme was attributed to a legitimate publication, the briefest and most cursory research shows that it appears nowhere in the book cited.", "The United States Holocaust Memorial Museum.\r\n     \"Blacks During the Holocaust.\"   Retrieved 29 June 2017.", "Herzstein, Robert.   \"The Nazis.\"\r\n Time Life Books.   1980.", "Update [June 24, 2022]: Updated SEO/Social.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]