["The video was published on Facebook here on March 4, 2020. It has been viewed more than 5,000 times.", "The footage includes multiple clips of shoppers taken inside and outside supermarkets. It is accompanied by a voiceover commentary, which includes cheers, boos and sound effects. Watermarks reading “AEW” and “TNT” can be seen at the bottom of the video.", "The video’s traditional Chinese caption translates to English as:\n\t“Everyone help American people\n\tCalm down \n\tAnyone hearing me(?)\n\tHong Kong has face masks and toilet paper that can fit your needs”.", "Below is a screenshot of the misleading Facebook post:", "The COVID-19 pandemic has killed more than 8,800 people worldwide and infected almost 210,000 others, as reported here by AFP on March 19. The pandemic has caused panic buying in the United States, AFP reported.", "The same video was shared alongside a similar claim in Chinese on YouTube here; in English on sites here and here; and in Thai on Facebook here and here.", "The video has been shared in a misleading context.", "A keyword search based on the AEW and TNT logos found that the video was originally published on Twitter here by All Elite Wrestling (AEW), a wrestling program produced by the US Turner Network Television (TNT).", "The video was tweeted on November 30, 2019, one day after an annual day of sales known as Black Friday took place across the US. The tweet is captioned: “#BlackFriday with commentary provided by @JRsBBQ, @ShutUpExcalibur, and @tonyschiavone24. Happy shopping, everyone!”", "#BlackFriday with commentary provided by @JRsBBQ, @ShutUpExcalibur, and @tonyschiavone24. Happy shopping, everyone! pic.twitter.com/KvCNMcYFFw", "Subsequent reverse image searches on Google for keyframes extracted from the video found the various clips in the misleading video dated back to at least 2014. Some of the clips were cited in reports that did not mention Black Friday.", "The store clerk seen at the video’s nine-second mark, for example, can be seen in this December 5, 2014 article by US broadcasting network ABC News.", "Below is a screenshot comparison of the misleading video at the nine-second mark (L) and the ABC News footage (R):", "From the 23-second to the 26-second mark and the 43-second to the 45-second mark, the video shows a scene from a Walmart store in the US state of Indiana. A report published here by the Australian news site news.com.au on June 17, 2015 is headlined: \"Amber Stephenson who fought another woman at Walmart store in Indiana charged.\"", "Below is a screenshot comparison of the misleading video at the 24-second mark (L) and the video from news.com.au (R):", "From the 39-second to the 42-second mark, the video shows a clip which was published on February 10, 2015 here by American newspaper New York Daily News in a report headlined “SEE IT: Texas woman headbutts tax worker in Walmart brawl”.", "Below is a screenshot comparison of the misleading video at the 38-second mark (L) and the video published by New York Daily News (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]