["The photo was published here on Facebook on March 17, 2020. The post, which has since been deleted, was shared more than 1900 times.", "Below is a screenshot of the misleading Facebook post:", "The caption reads: “Italy ?/ #covid19 / #Dont_take_it_easy”", "Italy has reported almost 5,500 deaths and some 60,000 infections of the novel coronavirus, COVID-19, as of March 23, 2020.", "The photo was also shared here, here, here, here, here and here on Facebook, alongside a similar claim.", "The claim is false.", "A reverse image search on Yandex and subsequent keyword search found this AFP photo published on October 5, 2013.", "The caption reads: \"Coffin of victims are seen in an hangar of Lampedusa airport on October 5, 2013 after a boat with migrants sank killing more than hundred people. Italy mourned today the 300 African asylum-seekers feared dead in the worst ever Mediterranean refugee disaster, as the government appealed for Europe to stem the influx of migrants. Italian emergency services hoped to resume the search for bodies on October 5, 2013 despite rough seas after the accident, in which 111 African asylum-seekers are confirmed dead and around 200 more are still missing. AFP PHOTO / ALBERTO PIZZOLI\n\tALBERTO PIZZOLI / AFP.\"", "Below is a screenshot comparison of the image in the misleading posts (L) and the AFP image (R):", "More than 300 people died after a fishing boat carrying almost 500 Eritrean and Somali migrants capsized and sank off the coast of Southern Italy on October 3, 2013, the UK's Daily Telegraph reported the same day.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]