["About this rating", "On 5 May 2018, Facebook user Dave Moore uploaded a video from a Pilot Flying J truck stop in Amarillo, Texas, claiming that a flagless Flying J location it displayed was the result of the company's attempt to placate \"foreigners\" who would otherwise be offended by the sight of an American flag in the United States (for reasons he did not explicate):", "Moore described (but did not film) a interaction with an unspecified employee who, according to him, openly stated that non-American customers requested that the flag be removed: \"I went inside the Pilot and I asked them ... they said they had an issue with foreigners coming here and complaining, and they didn't want to lose the foreigners' business so they took it down.\"\nIn fact the clip did not corroborate his claim, despite being made directly in front of the Pilot Flying J where he claimed the interaction took place. Although he shot a video directly after the purported conversation, he apparently didn't capture evidence that it happened as described (or at all).\nGas stations are frequently targeted for rumors of insufficient patriotism and various versions of the \"Shunned Serviceman\" urban legend. Modern (mostly invented) repetitions of the such rumors have circulated in Illinois, on Long Island, and in Holly, Michigan. \nIn some e-mailed variations of this rumor which we received, readers asked if Pilot Flying J had announced that they would be removing all American flags, everywhere:\nPilot and Flying J truck stops announced they were taking down the American Flag. They started the American Flag was offensive to the foreign truck drivers. Well screw them I will not stop or use these truck stops or gas stations ever again. I cut up my Pilot rewards gas card.\nAs is often the case with claims about \"offensive\" American flags or unpatriotic gas stations, Moore's story spread quickly, accruing nearly three million views in under a week. One day after it was posted, Pilot Flying J addressed the rumor on social media, stating that the store in question lacked a U.S. flag because a damaged flagpole there was in the process of being repaired:\n\n\nWe are proudly American. At store #436, we are in the process of repairing the flag pole, which was damaged. Our intent is to raise the flag as soon as the pole is repaired and proper flag protocols are in place to show it the respect it deserves.\n— Pilot Flying J (@PilotFlyingJ) May 6, 2018\n\nIn their Facebook post, Pilot Flying J reported that a \"team member was misinformed,\" but the company did not provide any more detail about the nature of that misinformation. \nA public relations firm representing Flying J sent us a response to our inquiry about the issue which stated that:\n\nI want to re-iterate that the current policy is that an American flag can only be displayed at our locations if it can be flown according to military protocol.  The flag at store #436 in Amarillo, TX was not being flown as the pole is broken and prevents the flag being flown according to protocol.\nWe apologize the store manager did not have this information. We are still investigating all the details behind this miscommunication, but what we can tell you is what the situation at hand truly is, and that we are working to fix the pole at this location and are currently surveying our locations with flag poles to review if they are in proper working condition.", "Moore described (but did not film) a interaction with an unspecified employee who, according to him, openly stated that non-American customers requested that the flag be removed: \"I went inside the Pilot and I asked them ... they said they had an issue with foreigners coming here and complaining, and they didn't want to lose the foreigners' business so they took it down.\"", "In fact the clip did not corroborate his claim, despite being made directly in front of the Pilot Flying J where he claimed the interaction took place. Although he shot a video directly after the purported conversation, he apparently didn't capture evidence that it happened as described (or at all).", "Gas stations are frequently targeted for rumors of insufficient patriotism and various versions of the \"Shunned Serviceman\" urban legend. Modern (mostly invented) repetitions of the such rumors have circulated in Illinois, on Long Island, and in Holly, Michigan.", "In some e-mailed variations of this rumor which we received, readers asked if Pilot Flying J had announced that they would be removing all American flags, everywhere:", "Pilot and Flying J truck stops announced they were taking down the American Flag. They started the American Flag was offensive to the foreign truck drivers. Well screw them I will not stop or use these truck stops or gas stations ever again. I cut up my Pilot rewards gas card.", "As is often the case with claims about \"offensive\" American flags or unpatriotic gas stations, Moore's story spread quickly, accruing nearly three million views in under a week. One day after it was posted, Pilot Flying J addressed the rumor on social media, stating that the store in question lacked a U.S. flag because a damaged flagpole there was in the process of being repaired:", "We are proudly American. At store #436, we are in the process of repairing the flag pole, which was damaged. Our intent is to raise the flag as soon as the pole is repaired and proper flag protocols are in place to show it the respect it deserves.", "— Pilot Flying J (@PilotFlyingJ) May 6, 2018", "In their Facebook post, Pilot Flying J reported that a \"team member was misinformed,\" but the company did not provide any more detail about the nature of that misinformation.", "A public relations firm representing Flying J sent us a response to our inquiry about the issue which stated that:", "I want to re-iterate that the current policy is that an American flag can only be displayed at our locations if it can be flown according to military protocol.  The flag at store #436 in Amarillo, TX was not being flown as the pole is broken and prevents the flag being flown according to protocol.", "We apologize the store manager did not have this information. We are still investigating all the details behind this miscommunication, but what we can tell you is what the situation at hand truly is, and that we are working to fix the pole at this location and are currently surveying our locations with flag poles to review if they are in proper working condition.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]