["About this rating", "Huck Finn's acknowledged the authenticity of the receipt; the server involved was immediately terminated.", "The incident took place in May 2015, not 2016.", "Whether the employee whose name appeared on the receipt was the son of the restaurant's general manager.", "In May 2016. a viral Facebook photograph of a receipt from Huck Finn's with a prominent racial epithet printed on it began to circulate:", "The image circulated long after the controversy had occurred and been addressed. More than a year before the image started to recirculate, the New Orleans Times-Picayune reported (on 21 May 2015) that the Huck Finn's employee had been fired the same day that the receipt was issued:", "A French Quarter restaurant said an employee who printed a racial slur on a customer's receipt Thursday (May 21) afternoon has been fired.", "An image of a receipt with the words \"N----- 100% Dislike\" from Huck Finn's Café on Decatur Street was circulated Thursday on social media.", "A woman who posted a picture of the receipt on Twitter said her friend was the customer. It was shared almost 400 times.", "The customer could not immediately be reached.", "Huck Finn's Café posted a statement on its website apologizing for the employee's actions. The restaurant said it was \"shocked and appalled.\"", "The New York Daily News later reported that the employee who printed the slur was the son of the cafe's general manager:", "Dakota Crochet, 23, was fired from the French Quarter sports bar this week after the phrase \"N----- 100% dislike\" appeared on a check he gave to a group of black customers Thursday ... 21-year-old former server, Melani, who declined to give her last name, said she was shocked when she saw Huck Finn's appear on her Instagram feed.", "She was more surprised to see \"Dakota C.\" at the top of the bill.", "\"When I saw it, I wanted to know who the hell printed it. When I saw it was Dakota, I was like you have to be f---- kidding me,\" she said. \"I never got that from him.\"", "Melani, who is black, said she never saw any signs of racism from Dakota in the three months they worked together before she was fired in April.", "Dakota, whose father is the restaurant's general manager, joined the staff this February, the former waitress said ... Dakota and his father did not return repeated calls for comment ... [a representative for Huck Finn's] told the News he couldn't disclose the name of the fired waiter or confirm the two restaurant workers were related.", "The receipt from Huck Finn's Cafe in New Orleans was genuine and unaltered.  The same day the receipt was printed, Huck Finn's confirmed that the employee involved was fired. Subsequent reports identified the employee as the general manager's son, but that detail was not confirmed by the restaurant.", "Chan, Melissa.   \"Waiter Fired Over Racist Receipt Should Have Known Slur Would Be Printed: Ex-Coworker.\"\r\n    New York Daily News.   23 May 2015.", "Nolan, Heather.   \"French Quarter Restaurant Employee Fired After Racial Slur Printed On Customer's Receipt.\"\r\n    New Orleans Times-Picayune.   21 May 2015.", "Huck Finn’s Cafe.   \"Statement Regarding Customer Receipt.\"\r\n    21 May 2015.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]