["A photograph of former UPA chairperson Sonia Gandhi seen seated in the lap of another person has been uploaded on Facebook. The public group WE SUPPORT NARENDRA MODI with a membership of close to three million, has posted this photograph, which has been shared over 800 times.", "The photograph has also been posted by the page Asaram Bapu, and by an individual user, whose post has been shared over 300 times. The message posted along with the photo is identical: लो बे चमचो सबूत…..😉कैसे बनी कैसे बनी……..!टमाटर बिना चटनी कैसे बनी .", "This photograph had been circulated on social media in 2018 as well. Facebook page Yogi Sarkar had posted it in May 2018, which was shared over 3500 times. It was also shared on Twitter. This photograph had been fact-checked by Alt News Hindi in May 2018, when it was shared widely. Alt News found that the origin of this photograph is Sonia Gandhi’s meeting with the then Maldives President Abdul Gayoom during the latter’s visit to India in 2005.", "The image was mischievously photoshopped and made to appear as if Ms. Gandhi is seated in the lap of Mr. Gayoom. Sonia Gandhi’s image from the above picture was cropped and placed together with that of Mr. Gayoom. The video posted below is a step-by-step illustration of how this was possibly achieved.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]