["By Lori Robertson, Robert Farley, Eugene Kiely, D'Angelo Gore and Sydney Schaedel", "Posted on July 27, 2016 | Updated on September 8, 2016", "Donald Trump made several false and misleading statements in an hour-long press conference — on Bernie Sanders, Vladimir Putin, Hillary Clinton’s emails and more.", "In the press conference, Trump was right about one top Democrat, Vice President Joe Biden. Trump pointed out that Biden was wrong to say that Trump wanted to “carpet-bomb” in the Middle East to fight the Islamic State. Sen. Ted Cruz said that.", "Trump claimed that Sanders “lied” in saying that Trump “wants the minimum wage to go below $7.” But Sanders got his facts right. He said Trump “believes that states should actually have the right to lower the minimum wage below $7.25.” And that’s what Trump said.", "Today, Trump said the minimum wage should go up to “at least $10,” the first time we could find that he has said that.", "First, here’s Trump today at his press conference:", "Trump, July 27: The minimum wage has to go up. … At least $10 but it has to go up. But I think that states … I think that states should really call the shots. … But it has to go up. Now, Bernie Sanders lied. Bernie Sanders said in his speech the other day that Donald Trump wants the minimum wage to go below $7. I said, where did he come up with that one?", "Trump went on to say, “In fact he was criticized by people that fact check for saying it because I never said it.” We at FactCheck.org did not criticize Sanders on this point. In fact, Trump did say he was in favor of having no federal minimum wage. He was asked by NBC News’ Chuck Todd on “Meet the Press” on May 8, “should the federal government set a floor?” And he responded: “No, I’d rather have the states go out and do what they have to do.”", "Here’s Sanders Monday night at the Democratic National Convention:", "Sanders, July 25: He does not support raising the federal minimum wage of $7.25 an hour, a starvation wage. While Trump believes in huge tax breaks, huge tax breaks for billionaires, he believes that states should actually have the right to lower the minimum wage below $7.25.", "It may be difficult to follow Trump’s shifting position on the minimum wage: As Todd noted in that NBC News interview, Trump said in one of the debates that he was against raising it — “I hate to say it, but we have to leave it the way it is,” he said in November — and then months later said he would be “open” to raising it.", "He even told Todd in May that he “would like to see an increase of some magnitude,” but added that “I’d rather leave it to the states.” However, there is no doubt that he said in that interview that the federal government should not set a floor, leaving states, as Sanders said, “the right to lower the minimum wage below $7.25.”", "Here’s the full exchange from that May 8 NBC News interview:", "NBC News’ Chuck Todd: Minimum wage. Minimum wage. At a debate, you know. You remember what you said. You thought you didn’t want to touch it. Now you’re open to it. What changed?", "Trump: Let me just tell you, I’ve been traveling the country for many months. Since June 16th. I’m all over. Today I’m in the state of Washington, where the arena right behind me, you probably hear, is packed with thousands and thousands of people. I’m doing that right after I finish you.", "I have seen what’s going on. And I don’t know how people make it on $7.25 an hour. Now, with that being said, I would like to see an increase of some magnitude. But I’d rather leave it to the states. Let the states decide. Because don’t forget, the states have to compete with each other. So you may have a governor —", "Todd: Right. You want the fed– but should the federal government set a floor, and then you let the states–", "Trump: No, I’d rather have the states go out and do what they have to do. And the states compete with each other, not only other countries, but they compete with each other, Chuck. So I like the idea of let the states decide. But I think people should get more. I think they’re out there. They’re working. It is a very low number. You know, with what’s happened to the economy, with what’s happened to the cost. I mean, it’s just– I don’t know how you live on $7.25 an hour. But I would say let the states decide.", "https://www.sharethefacts.co/share/895825b5-b083-4fed-bee5-16dd31de4222", "Trump continues to insist that Vladimir Putin called him a “genius,” even though Russian language experts told us Putin merely called Trump “colorful” or “bright” — depending on the translation — and even after Putin clarified just last month that he never called Trump a genius.", "Trump, July 27:  I never met Putin, I don’t know who Putin is. He said one nice thing about me. He said I’m a genius.", "Trump frequently claims that Putin called him a genius, but as we wrote on June 17, that relies on a faulty translation of the Russian president’s faint praise for Trump during a press scrum in December, after Putin was asked what he thought about the Republican candidate.", "According to a translation by Russia Insider, which uploaded the video, Putin responded, “He’s a very colorful person. Talented, without any doubt. But it’s not our affair to determine his worthiness — that’s up to the United States voters. But he is absolutely the leader in the presidential race. He wants to move to a different level of relations, to more solid, deeper relations with Russia. And how can Russia not welcome that — we welcome that. As for his internal political issues and the turn of speech which he uses to raise his popularity, I repeat, it’s not our affair to evaluate them.”", "It’s the word “colorful” in the first sentence of that translation that is at issue here. We reached out to several Russian language experts, and there was some disagreement about the precise meaning of Putin’s phrase, with some translating it as “colorful,” others “bold” or “bright.” But they all agreed that Trump was inflating Putin’s rather guarded praise, and that Putin most certainly did not go so far as to call Trump a “genius.”", "In a speech in St. Petersburg, Russia, on June 17, Putin set the record straight, explaining that he had only described Trump as “flamboyant.” According to Reuters, Putin added, with a smile, “He is, isn’t he? I did not give any other assessment of him.”", "https://www.sharethefacts.co/share/cc2e42ea-aa06-4a13-abf9-b63620602b6a", "We could find no evidence to corroborate Trump’s claim that Putin “mentioned the N-word one time,” in a sign of “a total lack of respect for President Obama.”", "Trump: Putin has said things over the last year that are really bad things. OK? He mentioned the N-word one time. I was shocked to hear him mention the N-word. You know what the ‘N’ word is, right? He mentioned it. I was shocked. He has a total lack of respect for President Obama. Number one, he doesn’t like him. And number two, he doesn’t respect him. I think he’s going to respect your president if I’m elected. And I hope he likes me.", "We scoured the internet and published reports archived by Lexis-Nexis and could not find where Putin ever used that racial epithet. Neither could the Washington Post or CNN, which wrote, “There are no published reports to back up Trump’s allegation about Putin’s use of the racially derogatory term, however.”", "Two experts on Russia told us via email that they had never heard of Putin using that term.", "“In Russian, the N-word does not begin with ‘N’ — and Putin’s English is pretty rudimentary,” said Stephen Sestanovich, an expert on Russia and the former Soviet Union at the Council on Foreign Relations.", "“I have no idea what [Trump] is talking about,” added Fiona Hill, an expert on Russian affairs and director of the Center on the United States and Europe and a senior fellow in the foreign policy program at the Brookings Institution. “Putin doesn’t really speak English. So perhaps Trump is referring to some speech in Russian–but again I have no idea what he is referring to.”", "Hill, who co-authored the second edition of “Mr. Putin: Operative in the Kremlin,” added, “If it were something in Russian, then the word ‘negr’ is used widely by Russians who grew up in the Soviet era. It is the literal translation of Negro. When I was a student in the USSR in the late 1980s I heard it many times, used by teachers and students at my institute when talking about Africans and oppressed black Americans, and it was written in textbooks. I have heard it used by Russians of Putin’s generation since, including a couple of Russian officials in conversations. It does sound pretty similar to the “N” word to an English speaker, so it would certainly be shocking out of context.”", "We did come across an article posted by the Conservative Tribune, which carried the headline “While Talking ISIS Strategy, Putin Just Dropped The “N” Word… This Could Change EVERYTHING.” But as the article quickly makes clear, the N-word in question there was “nuclear.”", "Conservative Tribune: Russian President Vladimir Putin has not ruled out the possibility of deploying nuclear warheads when dealing with the Islamic State group, but he hoped it would never come that.", "But the context of Trump’s comment makes clear that that’s not the N-word to which Trump was referring.", "https://www.sharethefacts.co/share/b2a73b7d-2cd0-4236-8e9e-e7210ffb8d49", "Trump claimed that Hillary Clinton deleted 33,000 emails from the private server she used as secretary of state after she received a congressional subpoena requesting her emails. But there is no evidence to support his claim. In fact, an FBI investigation found no evidence of a cover-up.", "Trump: That a person in our government, Katy, would delete or get rid of 33,000 emails. That gives me a big problem. After she gets a subpoena. She gets subpoenaed, and she gets rid of 33,000 emails? That gives me a problem.", "Trump, of course, is referring to Clinton’s use of a personal email system for government businesses. As we have written in “A Guide to Clinton’s Emails,” the State Department asked her in the summer of 2014 to turn over any work-related emails that she had in her possession after she had already left the department in February 2013. Her lawyers went through the emails stored on her server, and they identified 30,490 work-related emails and 31,830 private emails.", "In December 2014, Clinton gave the State Department the work-related emails, and the others were deleted. But when did she delete them? We don’t know — and neither does Trump.", "Clinton received a subpoena from the House Select Committee on Benghazi on March 4, 2015. The committee requested “any and all documents and communications in your possession.” The request came two days after the New York Times broke the story that she had been using a private email account exclusively for government business.", "Six days after receiving a subpoena, Clinton held a press conference on March 10, 2015, to answer questions raised by the Times article. At that press conference, she first disclosed that she deleted her personal emails. “I didn’t see any reason to keep them,” she said.", "Trump is assuming that the emails were deleted after March 4, when Clinton was subpoenaed, and perhaps before March 10, when she held her press conference. But her campaign told us for a previous article that the emails were deleted before March 4, although it did not provide us with a date.", "FBI Director Jim Comey at a July 5 press conference announced the results of the agency’s investigation into whether Clinton or anyone on her staff violated federal law in the handling of classified information on a private server. He criticized Clinton and her staff for being “extremely careless in their handling of very sensitive, highly classified information,” but cleared them of any criminal wrongdoing.", "In his press conference, Comey said the FBI “discovered several thousand work-related e-mails that were not in the group of 30,000 that were returned by Secretary Clinton” to the State Department. He also said Clinton’s lawyers cleaned her server “in such a way as to preclude complete forensic recovery,” but he also said the FBI “found no evidence that any of the additional work-related emails were intentionally deleted in an effort to conceal them.”", "Update, Sept. 8: Trump had no evidence at the time, but now he does. The FBI on Sept. 2 released a two-part summary of its investigation of Clinton that said the former secretary of state’s emails were deleted “sometime between March 25-31, 2015″ — three weeks after the congressional subpoena.", "Here’s what the FBI report said: By December 2014, Clinton’s lawyers had completed their review of her emails, and sent her work-related emails to the State Department. At that time, a Clinton lawyer told Platte River Networks – which was maintaining Clinton’s private server – that the former secretary no longer needed any emails that were more than 60 days old, and instructed an unnamed PRN employee “to modify the e-mail retention policy … to reflect this change.” The PRN employee told the FBI that “sometime between March 25-31, 2015″ he realized he did not make the change requested by Clinton’s office and he deleted her old emails at that time.", "Clinton campaign spokesman Josh Schwerin told us that Clinton and her attorneys had no knowledge of the email deletions in late March 2015 until the FBI released its report on Sept. 2.", "https://www.sharethefacts.co/share/6372a0b6-b6a6-4b1a-8551-74978597bbff", "Trump said Blue Cross Blue Shield in Texas had “announced a 60 percent increase” in health insurance premiums under Obamacare. To be clear, that’s a proposed increase for 2017 — it has to be approved by regulators — for certain plans purchased by those buying their own insurance.", "Trump:In Texas, going through BlueCross/BlueShield they just announced a 60 percent increase. On November 1st, you’re going to have new numbers come out for Obamacare, having to do with increases. President Obama is trying to get it moved to December. Because it is election-defying. It is going to be a massive number, the biggest number ever in our country’s history for health care.", "Trump has cherry-picked high rate increases for some plans on the Affordable Care Act’s insurance marketplaces before. As we wrote in April on this issue, there was wide variation in premium changes for plans that individuals purchase on the marketplaces — ranging from the high increases Trump has touted to double-digit decreases.", "In this case, Blue Cross Blue Shield in Texas has requested rate increases of 57 percent and 59 percent. Any increase above 10 percent has to be submitted and approved by government regulators. A 60 percent jump could well be an outlier. The nonpartisan Kaiser Family Foundation analyzed preliminary rates and estimated a 10 percent rise on average for the second-lowest-cost silver plan in 14 major metropolitan areas.", "That’s double what KFF found actually happened in those metro areas — a 5 percent increase — for 2016. Experts have said the marketplace premiums initially came in lower than expected, in 2014, and now are being adjusted based on insurers’ actual experience with consumers. The Urban Institute wrote in November 2015 that it could take a few years before premiums stabilize.", "Consumers can switch plans, and many do: The Department of Health and Human Services found 43 percent of returning customers chose a different plan for 2016. And 85 percent of customers qualified for tax credits, insulating them from higher rate hikes.", "We can’t predict whether the final increases for the 2017 marketplace plans will be “the biggest number ever in our country’s history,” as Trump claims. But we’ll note that increases on the individual market before the ACA was passed topped 10 percent on average.", "Those buying plans on the marketplaces totaled nearly 13 million in 2016. In contrast, more than 154 million people get health insurance through their employers. Those premiums rose an average of 4 percent for family plans in 2015, according to the latest employer survey by KFF.", "https://www.sharethefacts.co/share/c6ea494a-6a09-45e4-9dc5-75cba10a319d", "Trump repeated his claim that “many people” saw or knew there were “bombs lying all over the floor” of the San Bernardino shooters’ home and didn’t report it. There’s no evidence of that.", "Trump: I think that the people in the community know what’s going on. Whether it’s in a mosque or whether it’s in the community and they have to report these people. When you look at San Bernardino, people knew — many people knew what was going on. They had bombs lying all over the floor. … I mean, this isn’t — you walk into somebody’s house, there are bombs lying on the floor — I think there’s a problem there. You got to report it.", "Trump made a similar claim in mid-June about Muslims being complicit in the Dec. 2, 2015, shooting in San Bernardino, California. He said that “many people,” including neighbors of the shooters, saw “bombs all over the floor” of the couple’s apartment, but declined to report it because of concerns about racial profiling. As we wrote then, one friend of a neighbor said the neighbor noticed a lot of packages arriving at the house, and that the couple had been doing a lot of work in their garage — and the neighbor didn’t report it due to racial profiling concerns.", "During the fifth Republican debate in December, Trump accused the mother of the shooter of having advance knowledge of the attack. The FBI was investigating the matter, but officials have not brought any charges or made any accusation against the mother, whose lawyer says that his client didn’t know what her son was planning.", "https://www.sharethefacts.co/share/c40e0815-739d-4d42-bb76-a3e25ab3c949", "Trump said that Biden “lied” when Biden said Trump stated that he wanted to “carpet-bomb” in the Middle East to fight the Islamic State. Biden was incorrect. Sen. Ted Cruz, not Trump, said that the U.S. should use carpet-bombing as a strategy against the terrorist organization known as ISIS.", "Trump: Joe Biden lied today. He said that Donald Trump wants to carpet-bomb — he was on television — he said, Donald Trump wants to carpet-bomb the enemy in the Middle East. Now, that was Ted Cruz that said that. That was not Donald Trump.", "Here’s what Biden said about Trump during an interview on MSNBC’s “Morning Joe” on July 27 (at 7:10 in the video):", "Biden, July 27: And some of the things he says. Like, for example, I know he’s trying to be tough, but he’s gonna go out and carpet-bomb. You want to go out and make friends and influence people in the Middle East? You’re gonna go carpet-bomb innocent people and bad people at the same time and that’s going to help us fight against ISIS and Daesh?", "We can’t say whether Biden “lied,” as Trump said. That would mean that Biden knew what he was saying was false. But Biden did get it wrong.", "It was Cruz, the Texas senator and former Republican candidate for president, who talked about carpet-bombing ISIS.", "“We will have a president who will make clear we will utterly destroy ISIS. We will carpet-bomb them into oblivion. I don’t know if sand can glow in the dark, but we’re going to find out,” Cruz said during a campaign event in Iowa on Dec. 5, 2015.", "Carpet-bombing, generally, involves dropping many bombs over an area without a specific target. Such a tactic could result in unintended casualties since some ISIS fighters are embedded among civilian populations. That’s one of the reasons that former Defense Secretary Robert Gates said that Cruz’s plan would not work.", "“I think most rhetoric about carpet-bombing, about making the sand glow, about bombing them to death and so on is frankly just unrealistic,” Gates said in an interview on Fox Business Network in January.", "Gates added: “It’s not going to accomplish the military objective — it takes no account of civilian casualties. It’s a simplistic answer to what’s a complex and long term problem.”", "For his part, Trump has said multiple times that he would use bombs against ISIS. But he has said that he would specifically target oil fields that ISIS controls in Iraq, Syria and other areas.", "On June 17, 2015, a day after he announced that he was running for president, Trump told ABC News’ George Stephanopoulos that “I would bomb the hell out of them. I’d bomb the fields.”", "Nearly a month later, he told CNN’s Anderson Cooper the same thing. “If I win, I would attack those oil sites that are controlled … by ISIS,” Trump said.", "In mid-November, the Trump campaign released a radio ad in which Trump says, in a voice-over, “Yes, I will quickly and decisively bomb the hell out of ISIS.” That was after Trump, at a campaign rally in Iowa, on Nov. 12, said this:", "Trump, Nov. 12, 2015: ISIS is making a tremendous amount of money because they have certain oil camps, right? They have certain areas of oil that they took away. They have some in Syria, some in Iraq. I would bomb the s— out of them. I would just bomb those suckers. And that’s right, I’d blow up the pipes. I’d blow up the refinery. I’d blow up every single inch. There would be nothing left.", "So, Trump has called for specifically targeting ISIS-controlled oil fields. A strategy that some in the military have criticized. But that’s different from carpet-bombing, which is what Biden wrongly said Trump wants to do.", "https://www.sharethefacts.co/share/5afc9a99-fe85-448a-99d5-bb72824eb0dc", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]