["Democratic presidential candidate Cory Booker likes to quote statistics, particularly when he’s indicting what he sees as unfair treatment of marijuana offenders as compared to those commit violent crimes.", "\"We have people that have criminal convictions for doing things that two of the last three presidents admitted to doing. And so, we have a justice system that is not equal justice under the law,\" the U.S. senator from New Jersey said in a Las Vegas TV interview.", "\"We have people who can’t get jobs, can’t get business licenses because of nonviolent drug crimes. And especially at a time when we’re legalizing things like marijuana. In 2017, we had more marijuana possession arrests in our country than all other violent crimes combined. And so, I’m going to fight to end this.\"", "The arrests claim is one Booker has made before; and national news media have reported a similar statistic.", "What we found is that Booker is right for 2017  — and for 2016 and 2015, as well.", "As Booker indicated, legalizing marijuana is on the upswing.", "PolitiFact reported in 2018 that two in three Americans favor marijuana legalization, a record-high measure of public support, and a majority of states now permit legal use in some form. That’s despite the fact that, under federal law, pot is a Schedule I drug, with \"a high potential for abuse.\"", "As for Booker’s claim, according to the FBI’s Uniform Crime Reporting (UCR) database, law enforcement nationwide made an estimated 518,617 arrests for violent crimes in 2017. That includes murder and nonnegligent manslaughter, rape, robbery and aggravated assault.", "That figure is lower than the 599,282 arrests made for possession of marijuana.", "(In cases where a person is arrested for a violent crime and marijuana possession, it is recorded as a violent-crime arrest because that is the more serious offense, according to the UCR handbook.)", "An arrest means there was probable cause that a crime was committed. It doesn’t necessarily mean a criminal charge was filed, or that a person was convicted.", "Out of curiosity, we took a look back two more years of arrest numbers, as well:", "The FBI hasn’t yet produced a full UCR report for 2018.", "Nearly 18,000 city, university and college, county, state, tribal and federal law enforcement agencies participate in UCR. But the FBI notes that the UCR figures are estimates, because not all law enforcement agencies participate in the program.", "As for why arrests for marijuana possession exceed those for violent crimes, we asked Michael Collins, director of national affairs for the Drug Policy Alliance, which works to change marijuana laws across the country. He told us it’s because \"it’s the easiest type of arrest to make; the evidence is already there.\"", "\"They say marijuana is a gateway drug,\" Collins added. \"Marijuana is a gateway to the criminal justice system.\"", "Some police commanders say they have stepped up drug enforcement overall to tackle the opioid epidemic, and marijuana arrests are up accordingly, the Philadelphia Inquirer reported. Other commanders assert that as more jurisdictions such as Philadelphia have begun treating marijuana with leniency, people have become more flagrant in its use, leading to more arrests.", "Booker said, \"In 2017, we had more marijuana possession arrests in our country than all other violent crimes combined.\"", "FBI figures show 599,282 arrests nationwide for possession of marijuana and 518,617 arrests for violent crimes, which include murder and nonnegligent manslaughter, rape, robbery and aggravated assault.", "We rate Booker’s statement True.", "YouTube, Cory Booker interview (5:35), July 5, 2019", "Email, Cory Booker campaign national press secretary Sabrina Singh, July 8, 2019", "FBI Uniform Crime Reporting, \"2017 Crime in the United States  — Persons Arrested,\" accessed July 8, 2019", "FBI Uniform Crime Reporting, \"2016 Crime in the United States  — Persons Arrested,\" accessed July 8, 2019", "FBI Uniform Crime Reporting, \"2015 Crime in the United States  — Persons Arrested,\" accessed July 8, 2019", "Washington Post, \"Police arrest more people for marijuana use than for all violent crimes — combined,\" Oct. 12, 2016", "Washington Post, \"More people were arrested last year over pot than for murder, rape, aggravated assault and robbery — combined,\" Sept. 26, 2017", "American Civil Liberties Union and Human Rights Watch, \"Every 25 Seconds  — The Human Toll of Criminalizing Drug Use in the United States,\" Oct. 12, 2016", "NORML, \"FBI: Marijuana Arrests Decline Significantly In 2015,\" Sept. 26, 2016", "NORML, \"FBI: Marijuana Arrests Spike For Second Straight Year, Far Outpace Arrests For All Violent Crimes,\" Sept. 24, 2018", "Drug Policy Alliance, \"New FBI Report: Every 20 seconds, someone is arrested for a drug law violation in the U.S.,\" Sept. 24, 2018", "Drug Policy Alliance, \"Drug War Statistics,\" accessed July 8, 2019", "Email, Columbia University law school professor Jeffrey Fagan, July 9, 2019", "Interview, University of Missouri-St. Louis criminology and criminal justice founders professor Richard Rosenfeld, July 10, 2019", "New York Times, \"Marijuana Arrests Outnumber Those for Violent Crimes, Study Finds,\" Oct. 12, 2016", "Newsweek, \"Marijuana Arrests Were Up Last Year—and You're Paying Billions For It,\" Sept. 26, 2018", "Interview, Drug Policy Alliance director of national affairs Michael Collins, July 8, 2019", "Email, University of Chicago Crime Lab research director Max Kapustin, July 10, 2019", "FBI, \"Uniform Crime Reporting Handbook\" (pages 96-97), 2004", "Email, NORML deputy director Paul Armentano, July 10, 2019", "Email, Drug Policy Alliance researcher Sheila Vakharia, July 10, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]