["About this rating", "A plea for adopters to take in 52 thoroughbred horses destined for slaughter after the death of their owner, longtime Ohio horse breeder Daniel Stearns, began circulating on Facebook in January 2011:", "Do you have friends in Ohio? 52 thoroughbred horses need homes. Off to Sugarcreek Saturday for slaughter. Gentleman died and his son wants nothing to do with them. Most broodmares are broke and some are in foal weanling, yearlings, 2 yrs and 3 yrs old.. most are gelded. FREE and papered. Friend of the deceased trying to find homes 440-463-4288 Barnesville, OH. Please copy and paste this on your status.", "Horse lovers in OH: Please help!!!! Horses are going to slaughter on Saturday 2/5/11. FREE to good home, call now! Dr. Stearns, DVM passed away & his son wants everything liquidated immediately, horses go to slaughter this Sat. Currently of 52 horses there are still 23 mares some w/babies on board, stud is 16.3 TB Stud Conley Key. All free and papered. Call 440-463-4288, 57882 Wright Rd, Barnesville, OH.", "Posting from Porterdale Police Dept: FREE HORSES!!! 52 thoroughbred horses need homes. Will go to Sugarcreek this Sat. for slaughter. Gentleman died his son wants nothing to do with them. Most broodmares are broke and some are in foal weanling, yearlings, 2 yrs and 3 yrs old most are gelded. FREE and papered. Friend of the deceased is trying to find homes. 404-463-4288 Barnesville. Please copy and paste this!", "All the animals in question quickly found new homes within a few days:", "Lynn Boggs' close friend, Daniel C. Stearns, DVM, died on Jan. 27. Instantly, she faced the task of rehoming Stearns' 52 Thoroughbreds. Sterns was a longtime fixture in the Thoroughbred racing community, having worked as a track veterinarian before founding the Ohio Thoroughbred Breeders & Owners. He also served as president of Ohio Horsemen's Benevolent and Protection Association and was an active Thoroughbred breeder at the time of his death.", "After Stearns' son dismantled his father's breeding and racing farm, he gave Boggs and her boyfriend, Jerry Noss, a week to find homes for the 52 horses. He planned to send any unadopted animals to auction. Boggs, who owns 10 racehorses herself, posted a plea for help on her Facebook page, and within 10 minutes she had her first response.", "The impromptu Facebook campaign was more successful than Lynn Boggs could have imagined — she received more than 4,000 phone calls and hundreds of text messages about the horses. \"They were adopted out one here, and one there. A few people took three because they had room. The biggest lot was 11, and that was a personal friend.\"", "She said that she was cautious of adopting out large lots of horses for fear they would end up at auction, which is exactly what she'd set out to avoid.", "Four days later, on Feb. 1, the last horse left the farm around 10:30 p.m.", "Boggs maintained she never claimed the horses were headed for slaughter and said that possibility was added to her social media posts by others who passed them along:", "Although Boggs avoided mentioning \"slaughter\" in her original posting, subsequent posts by other concerned parties mentioned this as a possibility, should the horses not find new homes. \"I didn't want to say slaughter; I hate that word,\" she said, noting she didn't believe they would have that end. She thinks the post gained even more momentum when the word \"slaughter\" entered the description.", "A version of this message was recirculated in late 2012, apparently as a lure to entice readers into calling a premium-rate phone number based in the UK:", "URGENT - 52 Thoroughbred horses need homes. Will go to slaughter this sat. Gentleman died & his son wants nothing to do with the horses. Most broodmares, broken in & some in foaling/weaning, 2-3 yrs old, most geldings- free- Contact Chett Wallace 0842 748538. Please re-post -this message has come from a friend of mine in Cheshire - Sue Westwood-Ruttledge", "Larson, Erica.   \"52 Thoroughbreds Find Homes Via Facebook.\"\r\n    The Horse.   3 February 2011.", "Scaravilli, Tim.   \"Daniel Stearns, Ohio Racing Fixture, Dead.\"\r\n    Daily Racing Form.   28 January 2011.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]