["Several messages circulating on social media have made claims regarding the lifespan of the coronavirus outside the human body.", "1. If the coronavirus falls on a metal surface, it lives for 12 hours.", "2. If the coronavirus falls on fabric, it survives for 9 hours.", "3. The coronavirus lives on the hands for 10 minutes.", "#corona virus when it falls on a metal surface, it will live 12 hours, so washing hands with soap and water well enough.. Corona virus when it falls on the fabric remains 9 hours, so washing clothes or being exposed to the sun for two hours meets the purpose of killing it.", "— Irosha sandamali (@SandamaliIrosha) March 14, 2020", "4. Prolonged sun exposure for 12 hours kills the virus.", "False:", "Research (Doremalen et al 2020) published in the New England Journal of Medicine conducted by American scientists (preprint here) suggests that the new coronavirus (COVID-19) can live in the air for several hours and on some surfaces for as long as 2-3 days. They tested the virus by spraying into the air by a nebuliser mimicking the coughing action of an infected person. They found that it could be detected up to a minimum of 3 hours later in the air, up to 4 hours on copper surfaces, up to 24 hours on cardboard and up to 2-3 days on plastic and stainless steel surfaces.", "The longevity of the virus was determined by studying the decay time or half-life of the virus, which is the time it takes for it to reduce in 50% tissue-culture infectious dose (TCID50) per litre of air. It was determined that the virus stayed on cardboard, stainless steel and plastic for the longest period, in comparison to copper and aerosol droplets.", "On average, the half-life of the virus on plastic surface was the highest, with an average of 15.9 hours (high 19.2 hours), copper was lower 3.4 hours (high 5.11 hours), and stainless steel was 13.1 hours (high 16.1 hours). No research was conducted on fabric at all.", "Also, no research was conducted that exposure to the sun for two hors reduced the half-life.", "The study also suggests that the virus can spread through the air, from touching things that were contaminated by those who are infected, and through direct human contact. The virus was formerly known as HCoV-19, but is referred to as SARS-CoV2 in this study as the comparison of longevity was in comparison with the virus found in the previous coronavirus outbreaks, known as SARS-CoV or SARS-CoV1 in the study quoted above.", "This research estimated the decay rates of the coronavirus on surfaces using a Bayesian regression model (Methods linked here)- where the relationship between a dependent variable and an independent variable (surface) is elucidated using the Bayes’ theorem – a hypothesis based on prior knowledge and updates as more information is available.", "Thus, the coronavirus could be detected up to a minimum of 3 hours later in the air, up to 4 hours on copper surfaces, up to 24 hours on cardboard and up to 2-3 days on plastic and stainless steel surfaces.", "The results from this study indicate that the coronavirus can be transmitted through aerosols (clusters of the virus in the air) aerosol and fomites (objects such as plastic, steel, other metals contaminated with the virus) are plausible, as the virus can remain viable in aerosols for multiple hours and on surfaces up to days. No information was given on fabric in this study, but it is likely that the fabric remains contaminated hours after the exposure similar to cardboard. Furthermore, no study has been conducted that suggests sun exposure as a factor that reduces the virus.", "Finally, the inability to detect the virus (under the detection threshold) is not equivalent to the complete elimination of the virus. However, to acquire an infection, one needs a minimum threshold or level or viral exposure. Hence, the claim on the longevity of 12 hrs is false. The virus remains intact on the surface for much longer.", "Donate Now", "Alt News Science is no longer edited by Dr. Sumaiya Shaikh", "From 2017-2021, Dr. Shaikh was the Founding-Editor for Alt News Science. Her main role is as a neuroscientist researching violent extremism and psychiatry.", "Follow @Neurophsyik", "A video of a ladder moving on its own, purportedly from Jharkhand, is viral on…", "In a 2-minute video, a man recommends a “technique” to prevent infection from Omicron, the…", "A video of a set of iron nails that appear to melt after being placed…", "Several social media users have shared an image that shows two columns — ‘Cepa/variante’ (Spanish…", "A 90-second video of a man dissecting a banana has been shared on the internet…."]