["About this rating", "In a political spat leading up to the Utah state primary election in March 2016, Republican candidate Donald Trump took exception to the appearance of a negative campaign ad featuring his wife, Melania, that used a nude photograph of her taken during a January 2000 photo shoot for the British version of GQ magazine:", "Trump blamed rival GOP hopeful Ted Cruz for the ad (which was actually created by the anti-Trump super PAC \"Make America Awesome,\" not the Cruz campaign) and responded by threatening via Twitter to \"spill the beans\" on Cruz's wife, Heidi:", "On 23 March 2016, the web site Nevada County Scooper published an article reporting that Donald Trump had followed through on his threat and claimed that Heidi Cruz was a former call girl:", "Some are calling Donald Trump's recent revelation a low blow and dirty politics. Some are calling it fair play in a very dirty game. This morning via Twitter as promised, Donald Trump spilled the beans about his opponent, Lyin' Ted Cruz' wife, Heidi. In a Skype interview with Donald Trump this morning, The Scooper was able to get some clarification in this new aspect of the Trump, Cruz feud.", "\"Lyin' Ted Cruz is married to a former call girl. It's terrible. So terrible,\" stated the Donald. \"I mean, Lyin' Ted Cruz thinks that Americans want a call girl in the White House? It's terrible. Just terrible,\" rambled Mr. Trump.", "There was no truth to this report, however: Whatever beans Donald Trump may possess remain unspilled, as he has revealed no dark secrets about Heidi Cruz in a Skype interview (or anywhere else). This article was a fabrication of the Nevada County Scooper, whose disclaimer notes that it is a fake news web site that does not publish factual stories:", "This website is satirical in scope and intent. It provides fake news and social criticism in a satirical setting. If this offends you, you might want to consider doing something else with your time rather than looking at the Internet. Really, the quality of your life will improve dramatically. Our intention is not to fool anyone, but if you do get fooled,  don't sweat it. Please have fun and lighten up and watch out for Snopes.com. We're not sure they've had all their vaccinations.", "In the end, Trump retweeted a follower who had posted a unflattering picture of Heidi Cruz alongside a glamor shot of Melania Trump, adding that there was \"no need to 'spill the beans'; the images are worth a thousand words\":", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]