["“Obama’s handling of this whole pandemic has been terrible! As President, ALL responsibility becomes yours during a crisis like this, whether or not you’re entirely to blame. John McCain, and myself for that matter myself, would never let thousands of Americans die from a pandemic while in office,” reads the fake tweet, which has been circulating since at least April 16, 2020.", "A screenshot of the message appears on Facebook here and here, on Instagram here and on Twitter here. Some versions of the manufactured tweet show the date it was allegedly posted -- November 23, 2009 -- and a supposed “1.1K Retweets” and “6.2K Likes.” Some also include the caption “Well this didn’t age well.”", "At 297 characters, the content could not have been posted in 2009, when the Twitter limit was 140 characters, or even after 2017, when it was doubled to 280 characters.", "Searching the text on Factbase, a website with the goal “to make available, unedited, the entire corpus of an individual's public statements and recordings,” returns no results. Neither does the content appear on Trump Twitter Archive, a searchable database of Trump’s tweets created by coder Brendan Brown.", "The H1N1 virus (swine flu) emerged in the spring of 2009 -- shortly after which the tweet was purportedly posted. The Centers for Disease Control and Prevention estimate that there were more than 60 million cases and nearly 12,500 deaths from the disease in the US between April 2009 and April 2010.", "The novel coronavirus has spread from China around the world, killing more than 45,000 people in the US and infecting more than 830,000, according to Johns Hopkins University.", "AFP Fact Check has debunked more than 350 examples of false and misleading information about the novel coronavirus. You can find the complete list of our fact-checks on the topic in English here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]