["About this rating", "The Swedish parliament did reject two proposals calling for mandatory vaccinations.", "There were two proposals, not seven; and the country already has a voluntary vaccination programs so the parliament did not implement any \"ban.\"", "In March 2017, anti-vaccination blogs presented misleading reports concerning a pair of rejected motions that month by the Swedish parliament, also known as the Riksdagen.", "Frequent purveyors of conspiracy theories and fake news such as YourNewsWire.com reported variations of the following:", "The Swedish Riksdagen (parliament) rejected seven motions on May 10 that would have enshrined forced vaccinations into law, stating “It would violate our [Swedish Constitution] if we introduced compulsory vaccinations, or mandatory vaccinations.”", "Noting also the “massive resistance (by Swedes) to all forms of coercion with regard to vaccinations“, the Riksdag also made reference to “frequent serious adverse reactions” in children who receive vaccinations.", "A spokesperson for the Public Health Agency of Sweden, the Folkhalsomyndigheten, told us via email on 30 March 2018 that only two — not seven — motions proposing a mandatory vaccination program were rejected in 2017. They added that the proposals were not rejected because vaccinations would be \"harmful,\" but because \"all health care in Sweden, including vaccination programs, is voluntary.\"", "Conspiracy theory blogs also reported that the Riksdagen \"banned\" mandatory vaccinations. What it did not mention is that the country's voluntary vaccination program, which covers ten diseases, already dates back decades.", "While Sweden's program is voluntary, the vast majority of children are still vaccinated; the Folkhalsomyndigheten spokesperson told us, \"More than 97 percent of the 2 year olds have been vaccinated against measles, mumps and rubella, for example.\" Overall, however, the country experienced an increase in measles cases in 2017. The European Centers for Disease Control reported that Sweden was one of 18 nations where the number of cases reported during the first half of 2017 exceeded that of the same period a year earlier.", "YourNewsWire.com and similar blogs sourced their stories from a report from an \"alternative health\" group, the National Health Federation. However, this group has come under its share of scrutiny and criticism. For example, the American Cancer Society excoriated the group in a report concerning \"unproven methods\" of managing the disease, saying:", "After study of the literature and other available information, the American Cancer Society has found no evidence that methods of treatment promoted by the National Health Federation (NHF) result in objective benefit in the treatment of cancer in human beings. Lacking such evidence, the American Cancer Society strongly urges individuals with cancer not to seek treatment based on the recommendations of the NHF.", "Public Health Agency of Sweden. \"Previous Swedish Vaccination Programmes.\"", "European Centers for Disease Control. \"Bi-annual measles and rubella monitoring report.\"\r\n    October 2017.", "American Cancer Society. \"Unproven methods of cancer management. National Health Federation.\"", "Public Health Agency of Sweden. \"Vaccination Programmes.\"", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]