["About this rating", "Days after President Trump joined other world leaders to discuss international issues at the 43rd G7 summit in Taormina, Italy on 26 and 27 May 2017, an animated GIF image surfaced purporting to show Trump extending his middle finger in an obscene gesture targeted at Italian Prime Minister Paolo Gentiloni:", "Trump gave a PM the finger during the G7 Summit and then grins about it afterwards! We say give him one back!https://t.co/CWwBasxLfx pic.twitter.com/QR1ZpyuJGC", "— Give Him The Finger (@protestcards) May 29, 2017", "The GIF was extracted from a video showing Gentiloni making opening remarks on the second day of the summit:", "Keying off news reports that Trump sowed discord at the summit by criticizing NATO partners and refusing to affirm U.S. support of the Paris Agreement on climate change, partisan web sites such as Palmer Report, Left Scoop, and Occupy Democrats posted screeds insinuating that Trump purposely insulted Gentiloni — though they were quick to acknowledge that the \"gesture\" might not have meant anything at all. For example, Bill Palmer opined:", "Is Donald Trump randomly scratching an itch on his temple with is [sic] middle finger, without consciously realizing what it must look like to those watching? Or is Trump pretending to scratch his temple as an excuse to intentionally give Gentiloni the middle finger while he’s speaking? Immediately afterward, Trump catches someone in the audience looking at him, and he smiles.", "There have been notable historical instances in which someone very much looked like they were intentionally shooting someone the bird, when it turned out to have been something entirely different. For instance there’s an old video of Mr. Rogers giving the camera two middle fingers, but it was actually because he was counting on his fingers while singing with children. But when one considers that Donald Trump spent his overseas trip insulting, shoving, and shouting at foreign leaders, it’s not a stretch to interpret his middle finger moment as having been very much intentional.", "It's important to note that the video was truncated to exaggerate the impression that Trump gestured at Gentiloni. A longer clip showing the two apparently speaking cordially before Gentiloni's remarks contradicts that impression:", "We don't claim to be able to read Donald Trump's mind, but based on the evidence at hand we find little back up the claim that he aimed a middle-finger insult at the Prime Minister of Italy. Sometimes when you have an itch, you just have to scratch it.", "Barkin, Noah.   \"European Allies See the Two Sides of Trump.\"\r\n    Reuters.   28 May 2017.", "Cohen, Brian Tyler.   \"Did Trump Give the Middle Finger to the Italian Prime Minister?\"\r\n    Occupy Democrats.   29 May 2017.", "Palmer, Bill.   \"Donald Trump Literally Gave the Middle Finger to the Prime Minister of Italy During Press Conference.\"\r\n    Palmer Report.   29 May 2017.", "Lyman, Eric J.   \"Italy's Prime Minister Lobbies Trump to Open U.S. to More Migrants.\"\r\n    USA Today.   24 May 2017.", "Left Scoop.   \"Donald Trump Caught On Camera Giving The Finger To Italian Prime Minister, This Is UNREAL!\"\r\n    29 May 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]