["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Biden didn’t use the hand gesture to promote white supremacy, as President Donald Trump’s campaign claimed.", "Biden used the gesture to demonstrate his claim that, in the past, large corporations, and President Trump, have paid “zero” dollars in taxes. Biden has condemned white supremacy many times.", "After critics called out President Donald Trump for refusing to categorically denounce white supremacy during the first presidential debate (he attempted to clarify his comments the following day) the president’s reelection campaign is attempting to turn the tables on his opponent, Joe Biden.", "In an Oct. 1 tweet, @TrumpWarRoom, an official Twitter account run by the president’s campaign, displayed a still image of Biden appearing to make a hand gesture that traditionally signifies \"OK\" or \"zero,\" but has been used by some in recent years as a symbol of white supremacy.", "Trump’s campaign wrote in the tweet, \"Last week Joe Biden flashed the ‘white power’ sign. President Trump condemned white supremacists yesterday. Why hasn't Joe Biden?\"", "This is wrong.", "Biden used the hand gesture twice, once with each hand, to demonstrate his claim that, in the past, large corporations, and Trump, have paid \"zero\" dollars in taxes. He has also condemned white supremacy several times, including the day before this Tweet was made. Biden has cited Trump’s \"very fine people on both sides\" remarks in Charlottesville, Va., as his motivation for running for president.", "The still image used in the post was taken from a Sept. 21 interview that Biden had with Fox 11 WLUK-TV during a campaign stop in Wisconsin.", "At the end of the interview, reporter Kia Murray asked Biden to address viewers who are worried about socialism and the prospect that he could raise taxes, should he be elected.", "This is what he said (starting around the video’s five-minute mark):", "\"I’m not trying to punish anybody, but the idea that 19 corporations, making billions of dollars, pay zero (zero gesture with left hand) in taxes? The idea that you can be making a billion dollars, or millions of dollars like Donald Trump didn’t acknowledge, when he was trying to open up a casino in New Jersey, and they had to show his tax returns. He paid zero taxes (zero gesture with right hand) and what did he say when they asked, \"Well how do you feel about that?’ \"Well it just proves I’m smarter than everybody else.\" He knows — these guys know how to game the system. The gaming’s going to be over when I’m elected.\"", "We reached out to the Trump campaign but did not hear back.", "According to the Anti-Defamation League, the hand gesture’s meaning has evolved over time, and started to acquire a new significance in 2017 when members of the website 4chan, a fringe platform where users are known to create and spread misinformation, promoted the common gesture as if it were a hate symbol.", "\"The ‘okay’ gesture hoax was merely the latest in a series of similar 4chan hoaxes using various innocuous symbols,\" the ADL says on its website, \"in each case, the hoaxers hoped that the media and liberals would overreact by condemning a common image as white supremacist.\"", "Their campaign was successful, and while the gesture was first being used as ironic or satirical, by 2019 at least some white supremacists adopted it.", "\"The overwhelming usage of the ‘okay’ hand gesture today is still its traditional purpose as a gesture signifying assent or approval,\" the ADL site says. \"As a result, someone who uses the symbol cannot be assumed to be using the symbol in either a trolling or, especially, white supremacist context unless other contextual evidence exists to support the contention. Since 2017, many people have been falsely accused of being racist or white supremacist for using the ‘okay’ gesture in its traditional and innocuous sense.\"", "The context of Biden’s gesture was to illustrate \"zero.\" Biden has denounced white supremacy many, many times. We rate this Pants on Fire!", "Twitter, Trump War Room tweet, Oct. 1, 2020", "Fox11online.com, FOX 11's Kia Murray talks SCOTUS future, Ruth Bader Ginsburg in Joe Biden 1-on-1, Sept. 21, 2020", "Anti-Defamation League, Okay Hand Gesture, Accessed Oct. 1, 2020", "Snopes, Trump Campaign Falsely Suggests Biden Promoted ‘White Power’ Symbol, Sept. 22, 2020", "The Guardian, Joe Biden tells white supremacist groups to 'cease and desist', Sept. 30, 2020", "PolitiFact, In Context: Donald Trump’s ‘very fine people on both sides’ remarks (transcript), April 26, 2019", "NBC Washington 4, Biden: Charlottesville Was the ‘Moment I Knew I Had to Run', Aug. 21, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]