["About this rating", "On 26 June 2018, a rumor started in a sourceless tweet asserting that Harley Davidson's chief executive officer, Matthew Levatich, called President Donald Trump \"a moron\":", "Harley Davidson CEO Matthew S Levatich says:", "\"Our decision to move some of our operations is 100% based on President Trumps tariffs. Mr. Trump knows nothing about economics and even less about trade. The man is a moron.\"#MAGA @DailyCaller @realDonaldTrump @CNN @GOP pic.twitter.com/Q1wpjUaSx4", "— Judy Tinsleman (@tinsleman) June 26, 2018", "The tweet appeared to reference remarks made by President Donald Trump about Harley-Davidson's decision to move some manufacturing outside the United States:\n\nA Harley-Davidson should never be built in another country-never! Their employees and customers are already very angry at them. If they move, watch, it will be the beginning of the end - they surrendered, they quit! The Aura will be gone and they will be taxed like never before!\n— Donald J. Trump (@realDonaldTrump) June 26, 2018\n\nVersions of the claim circulated on Facebook, too, again without a source or link:\n\nIn some versions, users claimed Levatich used the word \"moron\" in a statement. No such statement exists. Not unlike a rumor claiming that Michelle Obama orchestrated Roseanne Barr's firing from her ABC sitcom, the rumor seemingly stemmed from a single tweet with no additional information and it was not substantiated.\nWe contacted Harley-Davidson to ask for more details. A media representative affirmed the claim was untrue:\nThanks for your message. That tweet is completely fake.", "The tweet appeared to reference remarks made by President Donald Trump about Harley-Davidson's decision to move some manufacturing outside the United States:", "A Harley-Davidson should never be built in another country-never! Their employees and customers are already very angry at them. If they move, watch, it will be the beginning of the end - they surrendered, they quit! The Aura will be gone and they will be taxed like never before!", "— Donald J. Trump (@realDonaldTrump) June 26, 2018", "Versions of the claim circulated on Facebook, too, again without a source or link:", "In some versions, users claimed Levatich used the word \"moron\" in a statement. No such statement exists. Not unlike a rumor claiming that Michelle Obama orchestrated Roseanne Barr's firing from her ABC sitcom, the rumor seemingly stemmed from a single tweet with no additional information and it was not substantiated.", "We contacted Harley-Davidson to ask for more details. A media representative affirmed the claim was untrue:", "Thanks for your message. That tweet is completely fake.", "Cheng, Evelyn.   \"Trump Threatens Harley-Davidson: If It Moves Operations Overseas, 'They Will Be Taxed Like Never Before!'\"\r\n    CNBC.   26 June 2018.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]