["Queen Elizabeth delivered a speech addressing the coronavirus on April 5, but she didn’t mention President Rodrigo Duterte.", "Philippine President Rodrigo Duterte warned that people who flout the country’s lockdown to slow the spread of the coronavirus could be shot. On April 5, Al Jazeera reported that police had killed a man for refusing to follow restrictions.", "Did Queen Elizabeth offer words of support for the president the following day?", "A Facebook post claims that during her \"message of hope amid the coronavirus pandemic,\" the queen called Duterte \"the kind of leader who knows the way.\"", "\"Filipinos are very fortunate to have him,\" the quote continues. \"Seriously, he looked so overworked. He may not be perfect, but he truly loves his country. Philippines doesn’t have the worst government. It actually has the worst citizens.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Queen Elizabeth did deliver a rare speech on April 5 (not April 6, like the Facebook post says), thanking United Kingdom residents for staying inside and vowing that they would succeed in the fight against the coronavirus pandemic.", "She didn’t mention Duterte or the Philippines.", "Searching for the quote online, we didn’t find any credible sources showing that she said it elsewhere, either.", "We rate this Facebook post Pants on Fire.", "Facebook post, April 6, 2020", "Reuters, ‘Shoot them dead’ - Phiippine leader says won’t tolerate lockdown violators, April 1, 2020", "Al Jazeera, Man shot dead in Philippines for flouting coronavirus rules, April 5, 2020", "BBC, Coronavirus: The Queen’s message seen by 24 million, April 6, 2020", "The Telegraph, The Queen’s coronavirus speech transcript: ‘We will succeed and better days will come,’ April 5, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]