["About this rating", "Joe Biden was planning on stopping in a cookie store while campaigning in Virginia in 2012, but the store owner refused, saying he didn't want to pose for a photograph with Biden due to differing political opinions.", "Biden was not refused service in person, and he was planning on visiting the store specifically for a political purpose rather than to eat there.", "In June 2018, much ado was made about a Virginia restaurant called the Red Hen which refused to serve White House Press Secretary Sarah Huckabee Sanders. Conservative pundits immediately chastised the Red Hen for their decision and criticized Democrats for a general loss of a civility in their political discourse. President Trump used his official Twitter account to attack the restaurant, and certain circles of the Internet immediately attempted to tie the Red Hen and its owner to those circles' favorite topics, pedophilia and Satanism.", "As the controversy churned, some brought up a Democratic politician's purportedly similar experience in 2012:", "Before y’all pearl clutch about the sudden unraveling of our society, I’ll note that the owner of a cookie store called “Crumb and Get It” refused service to Joe Biden in 2012 in Radford, also a smallish college town in VA— and then basked in GOP praise. They closed in 2016. https://t.co/MGpWbR2Y2V", "— Doug Landry (@dougblandry) June 23, 2018", "There is some truth to this claim, although it is hardly a direct parallel to the incident involving Sanders and the Red Hen. The biggest difference is that Sanders was attending the Red Hen to have dinner with her family, while Joe Biden's visit to Crumb and Get It was related to the his campaigning activities around Virginia.", "The story was widely reported by local outlets at the time, such as this 15 August 2012 story published by the Roanoke Times:", "Chris McMurray had just opened his bakery, Crumb and Get It, Wednesday morning when he received a visit from Biden’s advance team asking if he’d host the vice president for a media event on the way to his scheduled speech at Virginia Tech.", "McMurray politely declined out of a difference in politics, and Biden instead went up the street to the River Street Grill instead.", "Later that day, WDBJ (Channel 7) reporter Orlando Salinas received a tip about Crumb and Get It via text message. The resulting story was picked up by the Drudge Report and a series of conservative blogs, leading to an outpouring of support online and at the store on Thursday.", "WDBJ reported that McMurray's decision to turn Biden away came a few days after President Barack Obama made a statement that rankled some small business owners. (That statement was, \"If you've got a business — you didn't build that\" during a speech; however, many later argued that his line was taken out of context.)", "WDBJ also provided a rundown of the interaction. Unlike the situation with Sanders and the Red Hen, Biden was never actually inside the store; Biden's people came to the store in the morning to ask McMurray permission for the the Vice President to make a campaign stop at Crumb and Get It, but McMurray declined. Shortly after that Biden's Secret Service detail arrived, thanked McMurray for standing up for his opinion, and purchased several cookies and cupcakes.", "McMurray said that the main reason he refused Biden service was that he didn't want to pose for a photograph with a member of the Obama administration:", "McMurray said the exchange with the Biden advance team had taken place just after he opened the store at 10 a.m.", "“They said, ‘This is a place that we’ve identified for Mr. Biden’s stop,’ and they asked permission, if that would be OK,” McMurray said. “After much thought, I respectively declined. The exchange was very kind. It wasn’t at all heated. It was not at all hoarse. Even when she departed, it wasn’t at all ill-mannered. They were very nice. I told her no offense to the vice president, and she received that. We just had a difference of opinion politically.”", "[...]", "We’re told that shortly after Crumb and Get It told Biden’s advance people 'no' -- the secret service walked in and told Chris McMurray ''Thanks for standing up and saying 'no' -- then they bought a whole bunch of cookies and cupcakes.", "McMurray said he's hoping folks will understand he just didn't want to be part of a photo op for an administration whose policies he doesn’t agree with.", "Outlets such as the Drudge Report picked up on the story and soon McMurray became a sort of political hero. He was touted as the new \"Joe the Plumber\" and even attended a campaign event to introduce Paul Ryan. The store and its owner were praised by the GOP and conservatives urged a \"buycott\" of the store which briefly boosted sales of Crumb and Get It's \"freedom cookies\":", "We attempted to find a response from Biden or Obama about the incident. Other than the \"thank you\" delivered by Biden's secret service detail, it doesn't appear that either of the politicians commented on the incident at Crumb and Get It.", "Gabrial, Trip.   \"A Virginia Baker Is in the Spotlight at a Ryan Rally.\"\r\n    New York Times.   22 August 2012.", "Pilkington, Ed.   \"Extraordinary Joe: McCain, Obama and the Plumber Who is Suddenly a US Sensation.\"\r\n    The Guardian.   16 October 2008.", "Salinas, Orlando.   \"Radford Business Owner Declines Request from Joe Biden's Entourage to Stop in Store.\"\r\n    WBDJ7.   16 August 2012.", "Cohen, Michael.   \"They Built That: How a Republican Lie Turned Into an Alternate Universe.\"\r\n    The Guardian.   29 August 2012.", "Adams, Mason.   \"Radford Bakery That Turned Biden Away Sells Out of 'Freedom Cookies.'\"\r\n    The Roanoke Times.   15 August 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]