["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "House Speaker Nancy Pelosi of Calif., and Senate Majority Leader Chuck Schumer talk after signing the $1.9 trillion COVID-19 relief bill. (AP Photo/Alex Brandon)", "The American Rescue Plan Act sends $12.6 billion to New York State and $464 million to San Francisco as part of $350 billion in state and local aid.", "Billions of dollars are going to Republican states like Florida and Texas, and about $143 billion is going to Republican-led states.", "The funding wasn’t snuck in. It was one of the most publicly debated issues in the relief package.", "Once President Joe Biden signs the American Rescue Plan Act, more than $350 billion will start to flow to state, tribal and local governments. Democrats hail the massive infusion of cash as a much needed tonic to heal the broad damage of the pandemic. Republicans have opposed it at every turn.", "The conservative website Trending Politics tied that particular funding stream — which is going to local governments across the country — to the machinations of the top two congressional Democrats.", "The site’s headline called it \"pure corruption.\"", "\"Schumer and Pelosi sneak funding into COVID bill to save them from their own failures,\" the March 8 article said. \"The new stimulus package will be erasing San Francisco’s projected $650 million deficit which grew as a result to (sic) Democrats’, specifically Nancy Pelosi’s, poor management. The package will also be erasing Chuck Schumer’s deficit in New York.\"", "It’s a stretch to blame two federal elected officials for the financial woes of their home district or state. House Speaker Nancy Pelosi isn’t the mayor of San Francisco, nor is Senate Majority Leader Chuck Schumer the governor of New York.", "But beyond that, the article’s first flaw is that there was nothing secret about this effort.", "Aid to states and localities was the single biggest item that Democrats wanted and that Republicans rejected.", "Democrats clamored for it in the December COVID-19 relief bill, but with Republicans running the Senate, and then-Majority Leader Mitch McConnell firmly opposed, the idea was crushed.", "After the Senate switched hands, the $350 billion was back in play.", "The measure promised $220 billion for states, territories and tribal governments, and $130 billion for cities and counties in order \"to mitigate the fiscal effects stemming from the public health emergency.\"", "State and local leaders can spend the money pretty much any way they like, except for two things: It can’t go to fund pension plans, and it can’t be used to pay for tax cuts.", "Both San Francisco and New York state faced budget gaps. San Francisco expected a shortfall of $411 million (not the $650 million in the web article) and for New York, the amount was $15.1 billion. Without aid, both jurisdictions warned of service cuts and tax hikes.", "The new bill has $464 million for San Francisco and $12.6 billion for New York. That would more than fill the hole in San Francisco, and largely fill the one that New York projected.", "What the Trending Politics piece never mentions is that thanks to the formulas that drive how the money gets divvied up, Republicans also do well under the bill. Those formulas use a mix of unemployment rates, population, poverty and housing factors to set each state’s and locality’s allocation.", "We might not know how the money will be spent, but there’s little mystery about where its first stop will be after it leaves Washington. The House Government Oversight Committee has a spreadsheet with all the allocation details.", "The article singled out New York and the $12.6 billion the state government will get. But it could just have easily noted the $16.7 billion headed to Texas, home to Republican Sens. John Cornyn and Ted Cruz. Florida, with its Republican governor and two Republican senators Marco Rubio and Rick Scott is due to get $10.2 billion. (All totals rise if funds to counties, cities and tribal governments are folded in.)", "Pelosi was called out for the money going to San Francisco — about $464 million — but Republican House Minority Leader Kevin McCarthy’s California district will also benefit. About $270 million is headed to the city of Bakersfield and to Kern County. Part of his district sits in Los Angeles, which is due to get about $1.9 billion. And like Pelosi’s, McCarthy’s constituents will gain from the $26 billion going to the state of California.", "In the overall tally, Democratic-led states do better. About $190 billion goes to states with Democratic governors and $143 billion goes to states headed by Republicans. That’s due as much to demographics as politics. Republicans predominate among states that have smaller populations. If money follows people, more of it will flow to blue states.", "Funding pensions and paying for tax cuts are the only two big limits on the federal dollars. But money is money. If a state repairs a bridge with pandemic relief funds, it will free up money for other purposes — for example, funding pensions.", "The bill includes penalties for that.", "\"In theory, if money is used to shore up pension funds, or directly or indirectly funds a tax cut, then the Treasury Department could come back and make the state refund some money,\" said Kim Reuben, director of the state and local finance initiative at the Urban-Brookings Tax Policy Center, a Washington policy group.", "In practice, Reuben said, the connection between federal dollars and state and local finances might not be obvious. The state and local officials she talks to hope the Treasury Department makes things clear quickly.", "\"Governments are excited to get the money, but they are nervous about what Washington will say that might disqualify the money for the uses they have in mind,\" Reuben said.", "The bill’s intent, Reuben said, is for state and local leaders to spend the money on what they couldn’t otherwise afford. There could be considerable debate over how well state and local governments stick to that goal.", "Trending Politics said Schumer and Pelosi snuck money into the COVID-19 relief bill to solve their own problems back home.", "The bill sends billions to New York and millions to San Francisco.", "But that was never any secret. The legislation has $350 billion for state, tribal and local governments, and Republicans have vigorously opposed that for many months.", "The Trending Politics article failed to mention the billions flowing to Republican-led states and congressional districts.", "We rate this claim False.", "Trending Politics, PURE CORRUPTION: Schumer and Pelosi Sneak Funding Into COVID Bill to Save Them From Their Own Failures, March 9, 2021", "House Government Oversight and Reform Committee, Spreadsheet: Direct funding estimates, Feb. 12, 2021", "New York State Comptroller’s Office, New York's economy and finances in the COVID-19 era, Jan. 21, 2021", "New York State Comptroller’s Office, DiNapoli Issues Preliminary Analysis of 2021-22 Executive Budget, Jan. 27, 2021", "City of San Francisco, Five year financial plan, Jan. 15, 2021", "San Francisco Business Times, New S.F. report reveals $411 million budget gap next fiscal year, more to come, Jan. 19, 2021", "Tax Foundation, State Aid in American Rescue Plan Act Is 116 Times States’ Revenue Losses, March 9, 2021", "National Association of Counties, State and local coronavirus fiscal recovery funds, accessed March 10, 2021", "Ballotpedia, Governors by party, accessed March 10, 2021", "New York Post, Schumer spokesman: Federal pandemic relief eliminates NYS deficit, March 8, 2021", "Angelo Roefaro, tweet, March 8, 2021", "Office of Sen. Chuck Schumer, The American Rescue Plan New York State and local aid explainer, March 8, 2021", "New York Times, Cuomo Offers Doomsday Proposal to Attack a Possible $15 Billion Deficit, Jan. 19, 2021", "Interview, Kim Rueben, director, State and Local Finance Initiative, Urban-Brookings Tax Policy Center, March 10, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]