["About this rating", "Human trafficking affects millions of people worldwide, but it's also the frequent subject of viral scarelore — fictional tales intended to frighten audiences, often prompting them to share without questioning the story.", "One such story went viral in October 2018 and again in late July 2019 when social media users shared a meme stating that human traffickers were leaving zip ties (in some posts, black in color) on homes, mailboxes, and cars, of potential female victims to either mark them as targets or distract and abduct them for sex-trafficking purposes when the women try to remove the ties.", "The hoax initially centered on San Angelo, Texas, in October 2018 but police there quickly debunked it. The Twitter user's handle has been cropped out for privacy in this example:", "In response to questions raised about the social posts, San Angelo police released a statement noting they had \"not received any reports of human trafficking, kidnappings or attempted kidnappings relating to human trafficking nor have we received any reports of black zip ties being used as a means to mark a target of any type of crime.\"", "Additionally, police reported that one of the women who made the original social media post had simply \"copied and pasted the photograph and warning as a means to alert women about human trafficking.\" But that didn't stop the hoax from continuing to spread without a reference to location:", "Hoaxes purporting to warn about seemingly benign tactics of \"sex traffickers\" to abduct women and children are increasingly common and often go viral, as in this case. This particular hoax also makes no sense, given modern technology. There's no reason purported traffickers, working in teams, would need to use zip ties or any other item as a marker for a potential victim, considering if traffickers were working in teams, they could easily identify the  victim's location by communicating via cellphone.", "That's not to say human trafficking isn't a serious concern. Globally, an estimated 40 million people have been trafficked for what's been called \"modern slavery\" as of 2016.", "In response to the above hoax, San Angelo police reminded citizens to \"not spread rumors or unverified information through social media networks\" because doing so \"misrepresents dangers, warning signs and risks associated with sex trafficking.\" Police instead encouraged people to seek legitimate information from experts on the issue, like Shared Hope International.", "\"Although the recent claims proved to be a hoax,\" the police statement said, \"we want our citizens to remain aware of their surroundings at all times and if anyone is uncomfortable or in fear at any time, they should call 911 and report the situation.\"", "Edgin, Alana. \"Zip Ties on Cars Not Linked to Sex Trafficking, Police Said.\"\r\n  San Angelo Standard-Times. 15 October 2018.", "San Angelo Police Department. \"San Angelo Police Dispel Social Media Posts Regarding Local Attempted Abductions for Human Trafficking.\"\r\n  15 October 2018.", "International Labor Organization. \"40 Million in Modern Slavery and 152 Million in Child Labour Around the World.\"\r\n  19 September 2017.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]