["The image was published here on Facebook on November 4, 2018, by a page with more than 1.25 million followers.", "The post’s Malaysian-language caption translates to English as: “Special allowance for polygamy”.", "Below is a screenshot of the misleading Facebook post:", "The image shows the Minister of Finance Lim Guan Eng on the left and an infographic in a red box on the right.", "The Malay-language infographic translates to English as:", "“Special Payment for Polygamy\n\t“Payment aims to encourage polygamy in peace. \n\t“Payment will be paid in stages \n\t“The breakdown of the allowance\n\t“Two wives - RM1,500\n\t“Three wives - RM2,000\n\t“Four wives - RM2,500”.", "The infographic has an icon of three figures in ties and name tags at the bottom.", "The same image was published on Facebook here and here; and on Twitter here and here with a similar claim.", "The claim is false; no such allowance was announced in Malaysia’s 2019 budget here.", "The budget announcement was broadcast live on November 2, 2018, here by an official government Facebook account.", "At the one-hour, 44-minute mark, a similar graphic to the one in the misleading posts is shown.", "Below is a side-by-side comparison of the misleading Facebook post (L) and the video of the budget presentation at this point (R):", "The original government infographic translates to English as: “Special payment of RM500 for civil servants grade 54 and below will be paid by end of December. Special payment as much as RM250 to the government pensioners. Total = RM1.076 billion”.", "This is supported by the official 2019 budget document here.", "On page 44, it states in part under item 212: “In appreciation of the efforts and dedication of all civil servants, the Government would like to announce a bonus of RM500 for grades 54 civil servants and below. For government pensioners, a bonus of RM250 will be paid. These bonus payments will cost the Government RM1 billion. Unlike the previous government, who usually made bonus payments in the next year, these bonus payments will be made by the end of December 2018.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]