["About this rating", "On Nov. 16, 2020, The Atlanta Journal-Constitution (AJC) published a breaking news story that detailed how 2,600 votes in Georgia were not yet counted in the 2020 U.S. presidential election.", "\"It's very concerning,\" Luke Martin, chairman of the Floyd County Republican Party, told the AJC. \"But this doesn't appear to be a widespread issue. I'm glad the audit revealed it, and it's important that all votes are counted.\"", "The votes were found during a state audit due to be finalized on Nov. 20. The Associated Press reported that \"the post-election audit is being held under a new state law that required one to be conducted for the first time this year on a race of the secretary of state’s choosing.\" Secretary of State Brad Raffensperger said that the presidential election was chosen because of the \"national significance of this race and the closeness of this race.\"", "On Nov. 17, Heather Mullins from Real America's Voice (RAV-TV) posted a video and tweeted: \"Floyd County, GA: Officials look for a box with 10 more batches after they thought they were done rescanning...updates to come.\" President Donald Trump tweeted about the video on the following day:", "The Associated Press explained why this is considered an audit and not a recount:", "State election officials have said this is not a recount, but rather a post-election audit.", "The main difference between the two: A recount is typically tied to a close margin in an election, whereas post-election audits are routine and used by states to ensure that equipment and procedures counting the vote all worked properly.", "Washington Post reporter Amy Gardner tweeted that the discrepancy was already being investigated ahead of the audit.", "The AJC story said that \"Trump could gain about 800 net votes from the newly discovered ballots.\" However, some Twitter users appeared to believe this meant only 800 of the 2,600 votes were for Trump, which was not true.", "The majority of the 2,600 previously uncounted votes were cast for Trump, moving him 800 votes closer to Joe Biden's total Georgia tally. Trump was still around 13,000-14,000 votes behind when looking at the state's original totals, as was clarified in a tweet from the AJC:", "Despite numerous debunked conspiracy theories about companies with names like Dominion Voting Systems, and purported operations like \"Hammer\" and \"Scorecard,\" the issue in Floyd County appeared to come down not to a software problem, but to human error:", "The problem occurred because county election officials didn't upload votes from a memory card in an ballot scanning machine, said Gabriel Sterling, the state's voting system manager.", "He called it \"an amazing blunder\" and said the county's elections director should resign.", "\"It's not an equipment issue. It's a person not executing their job properly,\" Sterling said. This is the kind of situation that requires a change at the top of their management side.\"", "The previously uncounted votes were cast during in-person early voting at the Floyd County Administration Building, which includes the county's elections office, said Luke Martin, chairman of the Floyd County Republican Party.", "The AJC also reported that the issue took place on a machine that failed during early voting, and that \"county election officials were supposed to rescan all paper ballots cast on that machine, but roughly half of them weren’t recorded.\"", "Raffensperger said that \"other counties' recounted figures closely match their original numbers,\" meaning that, thus far, this was the most significant issue found by the state in its audit.", "UPDATE: The Associated Press reported on Nov. 17 that a second Georgia county had also found votes that had not yet been counted. However, it was not expected to change the outcome of the election.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]