["The video, published here to Facebook on October 15, 2019, has been viewed more than 171,000 times and shared over 2,400 times.", "The first 13 seconds of the one-minute video shows two men being beaten up; the rest of the video shows a child lying in a box filled with blocks of ice, while two women making adjustment next to it.", "The caption of the video, translated from Malay to English, reads: “children found frozen for ORGAN sale. Moms dads please take care of your children”.", "Below is a screenshot of the misleading Facebook post:", "The video was also posted to Facebook alongside a similar claim here, here and here.", "The claim is false; the video consists of two different clips from two unrelated incidents. The first part of the video shows men being beaten up, while the second part shows the body of a dead boy placed in an ice-filled Styrofoam box ahead of his burial.", "A combination of a reverse image and keyword search on Google found statements from Chinese law enforcement about the clips, which have been circulating online since at least 2017 alongside similar claims.", "This statement, posted on the official WeChat account of Sinan county Public Security Bureau (PSB) on December 16, 2017, said the first part of the video was filmed on December 14, 2017, at Sanjiaoba village in Sinan county, Guizhou province.", "Translated from simplified Chinese to English, the title of the PSB statement says: “Results of an investigation into child-kidnapping rumours in Sanjiaoba village, Shaojiaqiao town, Sinan county\".", "The statement states in part: “Police learned that four people -- Wang, Lu, Wang and Jing -- went to Sanjiaoba village, Shaojiaqiao town, to sell traditional medicine to middle-aged and elderly people, but were mistaken for fraudsters and thieves. They were subsequently assaulted by villagers.", "\"A video of the incident, filmed by people on the scene, has been shared online with a claim about child abduction. According to Sinan county police's investigation, the four people -- Wang, Lu, Wang and Jing -- went to Sanjiaoba to sell traditional medicine without any suspicion of fraud and theft, let alone the online claims about child abduction.”", "The same WeChat account posted another statement, along with screenshots of the two clips, on December 27, 2017, to dismiss false claims similar to those made in the misleading Facebook posts.", "The first three paragraphs of the statement say: “Recently, a one-minute 29-second video purported to show children being kidnapped from Sanjiaoba village in Shaojiaqiao town, Sinan county, has gone viral alongside a new claim that children's hearts were torn out and their eyes gouged out. Following investigations, police found the claim a pure rumour and called on the public to be rational, not to believe in or spread rumours.", "“The first 41 seconds of the video claims to show someone kidnapping a child in Sanjiaoba village, Shaojiaqiao town, Sinan county, on December 14, 2017. Police in Sinan county, Guizhou province, have deployed officers to investigate the video, and found there was no such incident. It was only a rumour.", "“The next 48 seconds of the video shows the widely shared clip of 'a child froze to death in a foam box' on July 13, 2017. This incident has been investigated by police in Taojiang county, Hunan province, who confirmed there was no such incident but just a rumour.”", "Sinan PBS also included screenshots from the two videos in their statement with indication that the first clip appeared to be taken in winter and the second in summer.", "Below are two sets of side-by-side comparison of screenshots of the misleading Facebook video (L) and the ones published in the police statement (R):", "Police at Yiyang city, Hunan province, on July 13, 2017, issued this statement on its verified Weibo account, saying the video of a boy lying in a white box in fact shows a child who had died from drowning.", "The statement reads, in part: “The child in the video is from Mingyueshan village, Xiushan town, Taojiang county, Yiyang city, Hunan province. The child drowned at his relatives' home in Guangzhou city. Due to the summer heat, his family placed his body in a Styrofoam box filled with ice cubes before transporting it home for burial.", "Below is a side-by-side screenshot comparison of the relevant clip in the misleading post (L) and the one included in the police statement (R):", "This July 18, 2017, report from Channel NewsAsia (CNA), a Singapore-based news site, debunked a similar claim that was being circulated on social media and WhatsApp.", "The headline of the CNA report reads: “Viral video of 'kidnapped child in ice box' shows drowned boy: Reports\".", "The first paragraph of the report states: “A viral video circulating on social media and WhatsApp, purportedly of a kidnapped child boxed in ice by organ sellers, actually shows a boy who drowned, according to reports.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]