["About this rating", "On 28 October 2016, the disreputable web site SuperStation 95 published an article reporting that President Obama had cancelled all upcoming appearances at Hillary Clinton campaign events due to the FBI's announcement that they were reviewing additional emails potentially connected to the Democratic presidential candidate's email server:", "Now, we know it's bad! The FBI Director's announcement that the Bureau had found more emails pertinent to its Hillary Clinton private e-mail server investigation, and was re-opening that investigation, sent shockwaves across the political spectrum this afternoon.", "\"DEVASTATING REVELATIONS\"", "And \"big\" might be an understatement.  Late Friday night, the White House very quietly CANCELED all of Barack Obama's scheduled campaign appearances on behalf of Hillary Clinton!  The scheduled events, confirmed for months, were all quietly DELETED from the official White House Presidential Schedule.  See the Before and After images below:", "But SuperStation 95 is not the online arm of any legitimate radio news outlet.  Rather, it's a site for the fabricated conspiracy-driven rantings of convicted felon Hal Turner, who was sentenced to prison for threatening to kill three federal judges.", "SuperStation 95 based their claim that President Obama had cancelled his campaign appearances on a purported screenshot from the web site HillarySpeeches.com, which is not affiliated with the Clinton campaign.  And that site dropped several campaign events — not just ones involving President Obama — from their listing for unknown reasons.", "Furthermore, while SuperStation 95 claimed that President Obama was removed from the list of Clinton campaign appearances late Friday night (28 October 2016), the President was still listed in a cached version of Hillaryspeeches.com from just after midnight the following morning. As of this writing, HillarySpeeches.com has President Obama slated for four campaign events before the 2016 presidential election on 8 November 2016:", "It's unclear whether Superstation 95 doctored the \"after Comey's announcement\" schedule or whether President Obama was briefly removed from the listing for some reason. Regardless, HillarySpeeches.com is not an official outlet of the Clinton campaign, and as of this writing President Obama is still scheduled to make multiple campaign appearances on Clinton's behalf before the 2016 presidential election on 8 November 2016.", "On 29 October 2016, the day after Superstation 95 falsely claimed that President Obama had removed himself from the campaign schedule, NPR also reported that the president was still scheduled to make multiple appearances in support of Hillary Clinton:", "President Obama has a very busy week ahead of him. According to a schedule released by the White House, the president plans to campaign Tuesday through Friday next week for Hillary Clinton. He is likely to keep up the vigorous campaign schedule in the days leading up to the election.", "The president is planning a sort of \"tour de swing state.\" On Tuesday — exactly one week before Election Day — he will head to Ohio to campaign for Clinton at a \"Get Out The Early Vote\" campaign in Columbus. The next day, he'll be in North Carolina for a similar event in Raleigh. And on Thursday, Obama will travel to Florida to campaign for Clinton in Miami and in Jacksonville. The president will also attend a Clinton event on Friday, though details on that one have not been released.", "Anderson, Meg.   \"Obama Ramps Up Appearances in Final Campaign Sprint.\"\r\n    NPR.   20 October 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]