["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As mayor of north suburban Highland Park, Nancy Rotering has been in the thick of the debate over gun control in recent years.", "Since 2013, her suburb has prohibited weapons like the semiautomatic rifle used to kill 17 Parkland, Florida, high school students and teachers on Valentine’s Day. The Illinois city’s gun ban has survived a court challenge, with the U.S. Supreme Court in 2015 refusing to hear an appeal of a ruling that upheld the Highland Park law. The practical effect of that decision was to signal other local governments that they could legally impose bans on certain types of military-style guns without violating the Second Amendment.", "But Rotering, one of eight Democrats vying in the March 20 primary for their party’s nomination for Attorney General, said there’s still a catch in state law that prevents other Illinois towns from following Highland Park’s example.", "Just days before the Parkland shooting, Rotering told the Sun-Times this: \"We in Highland Park banned assault weapons and were taken to the United States Supreme Court and we prevailed. It’s now constitutional to ban these weapons of war in Illinois. Yet, the Illinois General Assembly has failed to allow other cities to have that opportunity.\"", "Nothing is ever simple when it comes to inevitably bitter disputes over gun restrictions versus gun rights, and that clearly is the case with the fate of assault weapons bans in Illinois. If the Supreme Court says Rotering’s Highland Park can impose a ban, why then does she say that other communities are prevented from doing the same? We decided to take a look.", "In 2013, Illinois became the last state to allow the concealed carry of guns when the legislature approved it under pressure from a federal appellate court ruling. A few years prior to that the U.S. Supreme Court struck down a blanket handgun ban imposed by Chicago.", "When it comes to even more lethal firepower, the gun debate can get especially perplexing, with those for or against gun controls often sounding as if they speak different languages. While the term \"assault weapon\" is commonly used to describe firearms used in mass shootings, advocacy organizations like the Illinois State Rifle Association (an affiliate of the National Rifle Association) refuses to refer to semi-automatic rifles that fire a single round each time a trigger is pulled as assault weapons.", "Nonetheless, ordinances like that in Highland Park that ban semi-automatics often refer to them as assault weapons. Similarly, the package of Illinois laws that allowed concealed carry also included a clause designed to block imposition of piecemeal weapons bans from town to town.", "\"The regulation of the possession or ownership of assault weapons are exclusive powers and functions of this State,\" the statute reads.", "It was that language that stripped local governments of their authority to pass their restricting semi-automatic rifles, ammunition magazines and related weapons and devices.", "\"Local control of certain things are bad,\" said Richard Pearson, executive director of the Illinois State Rifle Association. \"If they want to tax someone to death, I don’t care. They can build roads, but the Second Amendment is a fundamental right.\"", "Two lawmakers instrumental in passing the concealed carry legislation, Sen. Don Harmon, D-Oak Park, and Rep. Lou Lang, D-Skokie, said the local restriction language was the price gun-rights advocates insisted on to reach a compromise.", "\"There was a constant battle between the pro-gun and gun-safety advocates,\" Lang said in an interview.", "The measures included a narrow loophole, however. They went into effect July 9, 2013, but gave local governments a 10-day window past that date to pass local assault weapons bans. Highland Park, Chicago, Evanston and Skokie were among the few local governments that took advantage of the opening. Cook County updated an existing ban, effectively extending it to all other suburbs in the county.", "Two years later, state Sen. Julie Morrison, D-Deerfield, introduced legislation to reinstate power to local governments to pass assault weapons, but it languished in committee and eventually died.", "Morrison said she is considering another try in the wake of the Florida shooting. Meanwhile, the Illinois House is expected this week to consider several different bills aimed at gun control, including a proposed state licensing system for gun dealers.", "Rotering says: \"It’s now constitutional to ban these weapons of war in Illinois. Yet, the Illinois General Assembly has failed to allow other cities to have that opportunity.\"", "While there’s much disagreement about how to respond to the problem of gun violence, Illinois’ law on banning powerful rifles, commonly referenced as assault weapons, is clear. Only the state of Illinois — and not local governments — can pass an assault weapons ban, although local governments like Rotering’s Highland Park were granted a narrow and long-since expired window to approve their own bans.", "Those provisions were included by lawmakers in a 2013 law that allowed the concealed carry of weapons in Illinois.", "In claiming that the \"Illinois General Assembly has failed\" to reopen the door to local weapons bans, Rotering resorts to language that to some lawmakers seems over the top because she appears to be equating inaction with failure. But the essence of her claim is correct.", "Lawmakers inclined to back Morrison’s proposal acknowledge it has lacked the votes to pass up to now. Even so, the Legislature has had the opportunity to revisit the issue and did not do so.", "From that perspective, Rotering is accurate, which is why we rate her statement True.", "Democratic candidate for attorney general: Nancy Rotering, Chicago Sun-Times, Feb. 11, 2018", "Interviews on phone and email with Nancy Rotering, Feb. 21-22", "Chapter 136 - ASSAULT WEAPONS, Highland Park, Illinois - Code of Ordinances", "Arie S. Friedman, et al. v. City of Highland Park, Illinois, U.S. Supreme Court", "Bill Status of SB 2130, Julie Morrison sponsor, 99th General Assembly", "Interview Illinois Sen. Julie Morrison, D-Deerfield, Feb. 22, 2018", "Interview, Illinois Sen. Don Harmon, D-Oak Park, Feb. 22, 2018", "Interview, Richard Pearson, Illinois State Rifle Association, Feb. 22, 2018", "Interview, Illinois Rep. Lou Lang, D-Skokie, Feb. 23, 2018", "Cook County Board Bans Assault Weapons, Toughens Penalties, press release, July 17, 2013", "City Council Passes Comprehensive Assault Weapons Ban, press release, July 17, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]