["Mitt Romney, who has been accused by Newt Gingrich's campaign of inconsistency, fired back Jan. 23, 2012, in Florida, calling the former House speaker \"erratic.\"\n\nOne example:\n\n\"(Gingrich) voted in favor of establishing the Department of Education, and yet he gets in a debate and says we should get rid of the Department of Education and send all the education issues back to the states,\" Romney told reporters in Tampa.\n\nWe wondered, did Gingrich vote under President Jimmy Carter to establish the Education Department, then advocate three decades later for its elimination?\n\nThe vote\n\nWe asked Romney's campaign for support for his statement. Spokesman Ryan Williams provided us with a record of Gingrich's vote for the Department of Education Organization Act of 1979, which established the federal Education Department.\n\nThe congressman from Georgia did vote, \"Aye,\" according to GovTrack.us, a website that relies on government sources.\n\nWe also reached out to Gingrich's campaign but didn't hear back.\n\nThe debate", "So, Gingrich voted in favor of establishing the federal department. Did he recently say we should get rid of it?", "Williams pointed us to the former lawmaker's comments at the Sept. 22, 2011, debate in Orlando.", "A voter named Stella Lohmann asked candidates a question via video clip, concluding, \"What as president would you seriously do about what I consider a massive overreach of big government into the classroom?\"", "Gingrich said:\n\n\"I think you need very profound reform of education at the state level. You need to dramatically shrink the federal Department of Education, get rid of virtually all of its regulations.\n\n\"And the truth is, I believe we'd be far better off if most states adopted a program of the equivalent of Pell Grants for K-through-12, so that parents could choose where their child went to school, whether it was public, or private, or home-schooling, and parents could be involved. Florida has a virtual school program that is worth the entire country studying as an example.\"\n\nHe didn't say he wanted to \"get rid of the Department of Education,\" as Romney claimed. He said the department needed to \"dramatically shrink.\" What did Gingrich say he would \"get rid of\"? \"Virtually all of its regulations,\" he said.\n\nNot the same thing.\n\nGingrich's campaign website expands on his debate response, saying that he would \"shrink the federal Department of Education and return power to states and communities. The Department's only role will be to collect research and data and help find new and innovative approaches to then be adopted voluntarily at the local level.\"\n\nSo he did advocate sending \"education issues back to the states,\" as Romney said, though not \"all.\" Gingrich would reserve some limited powers for the federal government.\n\nThat's not to say Gingrich's positions on education haven't shifted over time.\n\nFor example, a story this month in the nonprofit-funded Education Week pointed out that Gingrich backed a Republican effort in 1995 to get rid of the Education Department or merge it with the Labor Department. In 2009, he joined with Education Secretary Arne Duncan and civil rights activist Al Sharpton to \"call for raising academic standards, lifting state caps on high-quality charter schools and greater accountability.\"\n\nOur ruling", "Gingrich did vote to establish the Education Department. But he didn't say in a September debate that lawmakers should get rid of it.", "However, Gingrich's record includes some support for Romney's larger point, that the long-time Washington politician has adapted his positions on education and the Education Department.", "We rate Romney's statement Half True.", "CNN.com, \"Romney rips 'erratic' Gingrich,\" Jan. 23, 2012\n\nPolitiFact, \"Newt Gingrich ad says Mitt Romney 'runs away from Ronald Reagan,'\" Jan. 13, 2012\n\nEmail interview with Ryan Williams, spokesman for Mitt Romney, Jan. 23, 2012\n\nNewt Gingrich, \"Newt Gingrich Presidential Candidate on FOX News/Google Debate,\" uploaded to YouTube Sept. 23, 2011 (at 3:50) \n\nNewt Gingrich, comments at a Republican presidential debate in Orlando, Fla., Sept. 22, 2011 (transcript from CQ, subscribers only)\n\nGovTrack.us, \"House Vote #468 (Sep 27, 1979),\" accessed Jan. 23, 2011\n\nNewt 2012, \"The Gingrich Education Plan,\" accessed Jan. 23, 2011\n\nEducation Week, \"GOP Hopefuls Favor Scaled-Back K-12 Federal Role,\" Jan. 11, 2012\n\nEducation Next, \"The 2012 republican candidates; so far: what they've said and done on education in the past, and why they might do about our public schools if elected,\" Sept. 22, 2011, via Nexis\n\nPOLITICO.com, \"POLITICO Interview: Newt Gingrich,\" May 17, 2010\n\nPOLITICO.com, \"Gingrich calls for education overhaul,\" May 17, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]