["About this rating", "In December 2019, internet users began sharing a dated story about a blind girl who was told by her school in Bristol, England, that she could no longer use a cane to get around because it created a safety hazard for other students and school staff.", "The story about Lily-Grace Hooper, who was 7 years old at the time but reportedly has been blind since suffering a stroke when she was 4 days old, went viral when it was first reported in November 2015. For instance, The Telegraph, a British news outlet, reported:", "A blind girl has been banned from bringing her white walking stick to school because of \"health and safety\" reasons.", "Lily-Grace Hooper, seven, suffered a stroke when she was just four days old, leaving her with virtually no sight.", "But her school, Hambrook Primary School in Bristol, has told the youngster she can no longer use her cane because it could trip up teachers and other pupils.", "Although the incident did occur in 2015, Lily-Grace is no longer a student at Hambrook Primary School. Her mother, Kristy Hooper, announced in December 2015 that she was removing the girl from the school because the stories prompted school staff to write social media posts defending the ban of the walking cane, making the child feel unwelcome. Lily-Grace was set to start at her new school in January 2016.", "In October 2019, the mother told BristolLive that the girl was enrolled at Emersons Green Primary School, which is also in Bristol. But Kristy Hooper expressed fears that her daughter could soon face another hurdle: In light of funding cuts that targeted services for children with special needs, Lily-Grace may have to travel a long distance to attend a school with sufficient support to help her learn.", "Because the girl is no longer a student at the school, according to her mother's account, and because the story is four years old as of this writing, we are rating this claim \"Outdated.\"", "The Telegraph. \"Blind Girl, Seven, Banned from Using White Stick at School As It Is 'Health and Safety Risk.'\"\r\n  17 November 2015.", "Yahoo News. \"Blind Girl Who Was Banned from Using Cane at School 'Forced Out After Bullying Campaign.'\"\r\n  21 December 2015.", "Grimshaw, Emma. \"Mum's Anger as Girl With Visual Impairment Forced to Travel Miles to School.\"\r\n  BristolLive. 24 October 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]