["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Libertarian James Carr doesn’t agree that health care requires health insurance.", "Carr, who is facing Republican Dave Brat and Democrat Jack Trammell in the race for Virginia’s 7th District congressional seat, provided some historic perspective to highlight that point in an interview with the Richmond Times-Dispatch.", "\"Before World War II -- with wage freezes, when health care became attached to a job -- very few people actually had health insurance,\" said Carr, a community hospital administrator.", "What caught our attention here is Carr’s statement that \"very few\" people had health insurance prior to World War II. Currently, most Americans have some form of health insurance, so we wondered whether Carr was correct.", "So how does Carr justify his statement? His campaign manager, Jill Anderson, pointed us to a half-dozen documents about health care coverage in the U.S.", "One of them, a 1965 publication by the Social Security Administration, said that in 1930, there were probably 1.5 million to 2 million Americans who had some kind of private health insurance or pre-arranged payment plan for medical care. With a population of 123.2 million people then, that means that less than 2 percent of the population had private coverage. Private coverage was generally the only option. The federal government’s public insurance plans -- Medicare and Medicaid -- were created in the 1960s.", "Figures from the U.S. Census Bureau show that 12.3 million Americans (9.3 percent) had private health coverage for their hospital stays in 1940, a jump of 10 million from a decade earlier. In 1950, 76.6 million Americans, or 50.7 percent, had health insurance.", "What led to that jump? Topping the list would be the amazing advances in medicine in the past 75 years.", "The war itself played a major role in the growth of health insurance, according to a March 2002 history of health insurance benefits from the Employee Benefit Research Institute, a think tank that examines employment-based benefits. Wages had been frozen by the National War Labor Board amid a shortage of workers as many potential employees went off to fight in the war. Employers sought to get around the wage controls in order to attract scarce workers. Providing them health insurance was one way to do that, EBRI said.", "\"During this time, employers petitioned, and were granted to have benefits, particularly health benefits, not be considered part of wages,\" Stephen Blakely, the director of communications and managing editor at EBRI, told us. \"Congress agreed to exempt health insurance benefits from taxation.\"", "Blakely said Carr’s historic look at the prevalence of health insurance is correct.", "The growth in insurance was also spurred by a growth in surgeries and hospital stays.", "\"(A)s late as the 1920s, hospitals were viewed as dangerous places where people went to die,\" Robert Helms, a resident scholar at the American Enterprise Institute, wrote in a February 2008 paper. That perception changed gradually, Helms said, as hospitals improved management, boosted physician professional standards and developed drugs to control infections.", "Penicillin, an antibiotic, was used increasingly in the 1940s to control infections. This made surgeries and hospital stays safer, which led to increased demand for both surgeries and insurance to cover those procedures, Helms noted.", "Jonathan Oberlander, a professor of health care policy at the University of North Carolina at Chapel Hill, said Carr’s statement is generally accurate, but isn’t relevant to today.", "Back in 1940, medical care was relatively basic, he said. A victim of a heart attack, for example, would have been ordered to rest in bed, Oberlander said. With today’s advanced medical care the treatment would require surgeries and care that’s very expensive to pay for without insurance, he said.", "\"There is not a feasible medical care system without health insurance in 2014,\" Oberlander said.", "Roughly 85 percent of the 310 million people in the U.S. had some form of health care insurance in 2012 either through their job, public programs like Medicare and Medicaid, or individual private plans, according to figures compiled by the Kaiser Family Foundation. That leaves 15 percent of the population -- about 48 million Americans -- who lacked health care coverage.", "Our ruling", "Carr said before World War II, very few people had health insurance.", "While Carr doesn’t take into account the advances in medical care over the past 75 years, he’s right. Only about 10 percent of the U.S. population had private health insurance then, generally from an employer-based system.", "We rate his statement True.", "James Carr’s comments to the Richmond Times-Dispatch, Sept. 21, 2014.", "Richmond Times-Dispatch, \"Political outsider James Carr wants to shake up 7th district,\" Sept. 20, 2014.", "Email from Jill Anderson, campaign manager for James Carr, Sept. 23, 2014.", "Blue Cross Blue Shield, \"Health insurance from invention to innovation: A history of the Blue Cross and Blue Shield companies,\" accessed Sept. 25, 2014.", "Social Security Bulletin, \"Private Health Insurance in the United States: An overview,\" December, 1965.", "Social Security Administration Bulletin, \"Medical services under health insurance abroad,\" December, 1940.", "Interview with Jonathan Oberlander, professor of health care policy at the University of North Carolina at Chapel Hill, Sept. 25, 2014.", "Interview with Stephen Blakely, director of communications and managing editor at the Employee Benefit Research Institute, Sept. 24, 2014.", "Email from Paul Fronstin, director of health policy research at the Employee Benefit Research Institute, Sept. 25, 2014.", "Email from Martha Bobbino, director of library services at the Employee Benefit Research Institute, Sept. 25, 2014.", "The Census Bureau, \"Historical statistics of the United States: Colonial times to 1970,\" page 82, accessed Sept. 25, 2014.", "Employee Benefit Research Institute, \"History of Health Insurance Benefits,\" March, 2002.", "Kaiser Family Foundation, \"Health insurance coverage of the total population,\" accessed Sept. 25, 2014.", "U.S. Census Bureau, \"1930 fast facts,\" accessed Sept. 25, 2014.", "Kaiser Family Foundation, \"National Health Insurance -- a brief history of reform efforts in the U.S.,\" March, 2009.", "PBS, \"Healthcare crisis: Healthcare timeline,\" accessed Sept. 25, 2014.", "Houston Journal of Health Law & Policy, \"Private health insurance in the United States: A proposal for a more functional system,\" April 5, 2005.", "PolitiFact, \"Julian Castro says seven presidents before Barack Obama sought universal health care,\" Sept. 5, 2012.", "New England Journal of Medicine, \"Unfinished Journey -- a century of health care reform in the United States,\" Aug. 16, 2012.", "Zane Benefits, \"History of U.S. health insurance -- why most Americans get health benefits from employers,\" July 7, 2010.", "The American Enterprise Institute, \"Tax policy and the history of the health insurance industry,\" February 29, 2008.", "James Carr for Congress, \"Healthcare,\" accessed Sept. 26, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]