["The video -- titled “FLIP FLOP FAUCI” -- was posted multiple times in July 2020 by the Facebook page of Diamond and Silk, two well-known supporters of US President Donald Trump.", "It features Fauci at times discouraging mask use, and text that says: “If it wasn’t 100% Effective in March 2020, how is it 100% Effective now?”", "Similar posts with some of the same footage appear on Facebook here, here and here.", "The video is part of a trend of misleading social media posts about mask use and Fauci, the director of the National Institute of Allergy and Infectious Diseases, who has been increasingly drawn into conflict with Trump and is a popular target for disinformation.", "In the early days of the coronavirus pandemic -- which, as of July 22, 2020 has killed more than 617,000 people worldwide, nearly a quarter of them in the US -- health authorities recommended mask use for people who were sick or those caring for them.", "That recommendation has since been expanded to the general population due to the risk of asymptomatic carriers transmitting the virus, sparking a backlash from those who balk at the inconvenience of wearing masks or view them as an impingement on personal freedom.", "But illustrating the US government’s chaotic coronavirus response, Trump refused to wear a mask long after American health authorities were recommending their general use, only relenting and later recommending them this month.", "Contrary to what the text in the video says, two of the three clips of Fauci that it features were not from March. One, the very first short section, is from a June interview with TheStreet website.", "“Masks are not 100 percent protective,” Fauci says, but the video misleadingly cuts out his subsequent remark: “However, they certainly are better than not wearing a mask.”", "Another is from a May interview with CNN in which Fauci says of mask use: “I believe it is effective,” though not “100 percent effective.”", "The March footage -- which appears second in the video -- is from an interview of Fauci by CBS’s “60 Minutes” in which he says “there's no reason to be walking around with a mask.”", "At that time, Fauci’s remarks reflected the consensus among US health experts, including the Centers for Disease Control and Prevention (CDC) and the surgeon general, America’s leading public health spokesman.", "But that has since changed -- the CDC now emphasizes the danger of asymptomatic transmission and recommends cloth face coverings as a means to reduce risk.", "“You could spread COVID-19 to others even if you do not feel sick,” it says. “The cloth face cover is meant to protect other people in case you are infected.”", "US Surgeon General Jerome Adams tweeted in late June: “Originally most health experts thought those who were asymptomatic (e.g. no fever or cough), had low risk of having/spreading #coronavirus. @CDCgov now estimates 35% or more with #COVID19 DO NOT have symptoms.”", "Fauci made the same point during a July conversation with Facebook’s Mark Zuckerberg when describing the reason for the change in advice.", "“Early on, when we were in a situation in which there was a real concern about the lack of personal protective equipment on the part of the health providers… we were thinking we would run out of masks and other things for them. So the recommendation was not to wear a mask because of the shortage,” Fauci says.", "But it later “became clear that we had enough of the equipment, so there was no shortage. It became clear that cloth coverings that you didn’t have to buy in a store, that you could make yourself, were adequate,” he says.", "And it “became very clear that anywhere from 20 to 45 percent of people who were infected didn’t have any symptoms,” meaning that people could be spreading disease asymptomatically, says Fauci.", "In the interview with TheStreet, Fauci also cited concern about a shortage of protective equipment for health care workers as a reason for the previous recommendation against widespread face mask use, saying that “now, we have masks.”", "“Although there appear to be some contradiction of, ‘You were saying this then, then why are you saying this now?’ -- actually the circumstances have changed, that’s the reason why,” Fauci says.", "But he admitted in a July interview with NPR’s “All Things Considered” that the “mixed message in the beginning” on masks has been “detrimental in getting the message across.”", "AFP Fact Check has debunked more than 560 examples of false or misleading information about the novel coronavirus crisis. A complete list of our fact checks on the topic in English can be found here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]