["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Echoing President Donald Trump’s views on criminal activity in the United States, the top executive with the National Rifle Association recently said crime is going up in many American cities and raised concerns about the role Mexican criminal organizations play.", "\"According to the FBI, drug gangs are expanding their networks all across the country. The FBI also says gang members are infiltrating law enforcement and even the military,\" Wayne LaPierre, NRA executive vice president, said Feb. 24 at the Conservative Political Action Conference.", "He continued: \"On the outside, gangs are committing more and more cross-border crimes. According to the FBI, Mexican drug cartels are working with 100,000 street gang members in Chicago alone. Think about that.\"", "We were intrigued by LaPierre’s claim of Mexican drug cartels working with thousands of Chicago street gangs.", "An FBI report does offer this number, citing a media interview with a Drug Enforcement Agency special agent. But experts are skeptical about linking cartels to an estimated 100,000 street gang members in the city.", "National Gang Report", "The NRA referred us to a 2013 National Gang Report produced by the FBI’s National Gang Intelligence Center. It was compiled using surveys from the National Alliance of Gang Investigators Associations and U.S. Customs and Border Protection, open source reports and anecdotal information from gang investigators.", "The 2013 report affirmed that gangs in the United States have relationships with Mexican drug cartels and that they most commonly work with Los Zetas and the Sinaloa cartel.", "Specifically about Chicago: Mexican transnational criminal organizations \"partner with more than 100,000 documented street gang members in Chicago to advance their criminal activities,\" the report said.", "That statistic cites a September 2012 article from the conservative website The Blaze.", "The Blaze’s article centers on an interview with Jack Riley, then special agent in charge for the Chicago Field Division of the DEA. (The FBI referred our questions to the DEA.)", "Riley told the website the Sinaloa cartel likely had the strongest presence in Chicago out of all Mexican drug cartels. The cartels have made Chicago one of their main hubs due to its location, large Mexican population and high street gang activity, Riley told The Blaze. They also played a role in the city’s violent crime, he said.", "Regarding the 100,000 gang members figure, The Blaze reported:", "\"The drug cartels from Mexico have found willing business partners in more than 100,000 ‘documented’ street gang members in Chicago. The cartel operatives hide in plain sight, within the crowds of millions of hardworking Mexican citizens living in the city.", "\"It’s the perfect cover,\" Riley said.", "That number came up again in a November 2012 interview with the Washington Post.", "Attributing information to the DEA, the Washington Post reported that members of the Sinaloa cartel are selling record amounts of heroin and methamphetamine from Chicago’s Little Village neighborhood and that drugs then make their way to south and west Chicago in mostly African-American neighborhoods.", "\"Chicago, with 100,000 gang members to put the dope on the street, is a logistical winner for the Sinaloa cartel,\" Riley told the Washington Post.", "Experts weigh in", "John Hagedorn, a criminology professor at the University of Illinois at Chicago, raised questions about Mexican cartels partnering with 100,000 gang members in Chicago, as the 2013 report said.", "\"The cartels have organizations in Chicago that supply mainly Latino gangs largely through kinship connections. Black gangs here have largely shattered and are not major wholesalers in drugs,\" said Hagedorn, who has researched gangs for more than three decades. \"The statement that the cartels 'partner' with 100,000 gang members is untrue, to be charitable.\"", "DEA’s Riley has long linked the cartels to Chicago’s high rates of violence, Hagedorn said. While the cartels deal mainly with Latino gangs, the majority of homicide victims and offenders in Chicago are African-American, he said.", "Fulton T. Armstrong, a research fellow at the Center for Latin American and Latino Studies at American University, also had doubts about linking Mexican cartels to 100,000 gang members -- almost 4 percent of Chicago’s estimated 2.7 million population, he noted.", "\"I find the 100,000 figure very hard to believe. Law enforcement routinely exaggerates both the threats we face and their performance dealing with them,\" said Armstrong, who formerly was a national intelligence officer for Latin America, chief of staff of the CIA’s crime and narcotics center and career CIA officer.", "Armstrong said that when he also worked on the staff of the U.S. Senate Foreign Relations Committee, he repeatedly asked the DEA, the Office of National Drug Control Policy and other agencies for information on the flow of drugs within the country, but was told the data wasn’t available. His last unfulfilled request was in 2011, Armstrong said.", "Cartels' continued presence in Chicago", "The Sinaloa cartel exports and distributes wholesale amounts of methamphetamine, marijuana, cocaine, and heroin in the United States, James L. Jones, public information officer for the DEA’s Chicago field office told PolitiFact.", "\"It maintains the most expansive international footprint amongst Mexican cartels,\" Jones said.", "It also remains the largest supplier of drugs to the Chicago area and uses street gangs for distribution, Jones said.", "\"Chicago is home to an estimated 100,000 active gang members that are heavily involved in drug trafficking, violent crime, and other criminal activity,\" Jones said. \"These gangs operate as the primary mid-level and retail-level distributors of drugs in the city and are responsible for a significant portion of the city’s violent crime.\"", "But it is not clear whether the 100,000 active gang members are all linked to Mexican cartels, which is what is suggested in LaPierre's original citation of the FBI. We asked the DEA for clarification on an estimate of how many or what percentage of the 100,000 are working with the cartels.", "\"That’s tough to quantify,\" Jones said. \"However, we know that cartels are the source for the drugs that are being distributed by the street gangs in Chicago.\"", "The 2013 gang report cited by the NRA is not the latest version of the report.  The 2015 report no longer references the specific figure, but also notes that due to new survey methodology, the 2015 and 2013 reports do not compare.", "The 2013 report also offers an overall cautionary note: \"Due to inconclusive reporting and lack of confidence in estimates collected from the (National Gang Survey), the (National Gang Report) does not contain numbers or estimates of gang members in the United States.\" It recommends contacting local agencies for more information.", "We reached out to the Chicago Police Department for the estimated number of street gang members in Chicago and how many of them are believed to be working with Mexican drug cartels. The department’s office of news affairs said it did not have a way to immediately provide a count.", "(AP in January citing the Chicago Crime Commission reported that the city had more than 150,000 street gang members, but many are not active. In January 2012, the commission released a gang book estimating there were more than 68,000 gang members in the city.)", "Our ruling", "LaPierre said,  \"According to the FBI, Mexican drug cartels are working with 100,000 street gang members in Chicago alone.\"", "LaPierre cites data in a 2013 national gang report produced by the FBI’s National Gang Intelligence Center. But it’s hard to gauge how solid that figure is, and experts question its veracity. The figure tracks back to a 2012 interview of a DEA special agent in The Blaze.", "The DEA told PolitiFact there’s an estimated 100,000 gang members in Chicago heavily involved in drug trafficking. It’s hard to quantify exactly how many of them are working with cartels, though cartels are the source for the drugs distributed by street gangs in Chicago, the DEA said.", "Independent experts, meanwhile, are skeptical about generalizing that all 100,000 street gang members — Latino and non-Latino — are collaborating with cartels, since the cartels mainly collaborate with Latino street gangs.", "We rate LaPierre's statement Half True.", "Email exchange, Andrew Arulanandam, NRA, Feb. 27, 2017", "Email interview, James L. Jones, public information officer for the DEA’s Chicago field office, March 8, 2017", "Email interview, Fulton T. Armstrong, a research fellow at the Center for Latin American and Latino Studies at American University, March 9, 2017", "Email interview, John Hagedorn, a criminology professor at the University of Illinois at Chicago, March 8, 2017", "Email exchange, Chicago Police Department Office of News Affairs, March 8, 2017", "FBI, National Gang Report 2013, National Gang Report 2015", "The Blaze, DEA Boss: Mexican Drug Cartels Are So Deeply Embedded in Chicago, We Have to Operate Like We’re ‘On the Border’, Sept. 27, 2012", "The Washington Post, U.S. cities become hubs of Mexican drug cartels, Nov. 3, 2012", "AP, Chicago gang trial brings 6 convictions after deadly 2016, Jan. 4, 2017", "Chicago Tribune, 68,000 gang members counted by new Gang Book, Jan. 27, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]