["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In September 2020, several readers asked Snopes to look into the facts surrounding high-profile news reports that claimed U.S. House Speaker Nancy Pelosi had visited a hair salon in San Francisco, California, despite a city ordinance that required non-essential businesses to remain closed as part of broader efforts to contain the spread of the ongoing COVID-19 coronavirus pandemic.", "On Sept. 1, 2020, Fox News published an article with the headline \"Pelosi Used Shuttered San Francisco Hair Salon for Blow-Out, Owner Calls it 'Slap in the Face.'\" The network reported that:", "House Speaker Nancy Pelosi visited a San Francisco hair salon on Monday afternoon for a wash and blow-out, despite local ordinances keeping salons closed amid the coronavirus pandemic, Fox News has learned.", "In security footage obtained by Fox News, and timestamped Monday at 3:08 p.m. Pacific Time, the California powerhouse is seen walking through eSalon in San Francisco with wet hair, and without a mask over her mouth or nose ... Salons in San Francisco had been closed since March and were only notified they could reopen on Sept. 1 for outdoor hairstyling services only.", "... Salon owner Erica Kious, in a phone interview with Fox News on Tuesday, shared details of Pelosi’s visit. Kious explained she has independent stylists working for her who rent chairs in her salon. \"One of the stylists who rents a chair from me contacted me Sunday night,\" Kious said.", "A screengrab of the text message she received from one of her stylists, and obtained by Fox News, said: “I’ll be there at 2:45 tomorrow. Pelosi assistant just messaged me to do her hair.” Kious replied: “Pelosi?” “I was like, are you kidding me right now? Do I let this happen? What do I do?” Kious told Fox News, while noting that she \"can’t control” what her stylists do if they rent chairs from her, as “they’re not paying” at this time.", "Kious cast Pelosi’s visit as a double standard. “It was a slap in the face that she went in, you know, that she feels that she can just go and get her stuff done while no one else can go in, and I can’t work,” Kious told Fox News, adding that she “can’t believe” the speaker didn’t have a mask on. (From the footage, it appears Pelosi had some kind of covering around her neck.) “We’re supposed to look up to this woman, right?” Kious said. “It is just disturbing.”", "Other major news outlets, including CNN and USA Today, followed up on Fox News' reporting.", "Pelosi has claimed that she was the victim of a politically motivated \"setup,\" and the man who styled her hair has lashed out at the salon owner, claiming the latter authorized the appointment in advance, contrary to her assertion that she was outraged to hear about the visit. However, it is nonetheless true that Pelosi did visit the salon in San Francisco on Aug. 31, 2020, at a time when the city required non-essential businesses, including hair salons, to remain closed.", "On Sept. 1, 2020, the San Francisco Department of Public Health introduced a new set of orders (Order of the health officer No. C19-07h). Among many other provisions, the new rules relaxed existing restrictions on what the document categorized as \"personal service providers\" — hair salons, nail salons, barber shops, skin care, and so on (page 24).", "Beginning at 9 a.m. on that date, those businesses could operate outdoors, under certain conditions, and with certain exceptions. Until then, an earlier set of orders (issued on Aug. 14, 2020) meant that businesses like hair salons could not operate at all. Since Pelosi's visit to eSalon took place on Aug. 31, the earlier, stricter orders were still in place at that time.", "A spokesperson for Pelosi confirmed for Snopes that the visit had taken place, writing in an emailed statement that the business (that is, eSalon) had told her local rules allowed it:", "\"The Speaker always wears a mask and complies with local COVID requirements. This business offered for the Speaker to come in on Monday and told her they were allowed by the city to have one customer at a time in the business. The Speaker complied with the rules as presented to her by this establishment.\"", "As we have shown, any understanding that local rules allowed a hair salon at that time to operate with even one customer in the building was mistaken. The spokesperson later clarified for Snopes that Pelosi's staff had not had any contact with Kious herself and confirmed CNN's earlier reporting that the Aug. 31 salon visit came about because another stylist, who usually goes to Pelosi's home, was not available on that date but recommended a colleague from eSalon. Therefore, the appointment was arranged with that \"substitute\" stylist, and not Kious, but Kious did know about it in advance.", "Although Pelosi's spokesperson asserted that \"the Speaker always wears a mask,\" the security footage from the salon, provided to Fox News, clearly shows her walking between two rooms without a mask over her mouth or nose for at least a few seconds.", "Pelosi addressed that discrepancy in a combative exchange with reporters at an event in San Francisco on Sept. 2, 2020, which can be viewed in full here. She explained:", "I just had my hair washed. I don't wear a mask when I'm washing my hair. Do you wear a mask when you're washing your hair? I always have a mask. I always have a mask. For me, for the people I'm encountering, but for my family as well. But I don't wear it when I'm getting my hair washed, and that picture was when I just came out of the bowl, of getting my hair washed.", "Pelosi was asked if she thought she should apologize to service industry workers for her actions. She replied: \"Well I don't. I think that this salon owes me an apology for setting [me] up.\" She added:", "\"I take responsibility for trusting the word of a neighborhood salon that I've been to, over the years, many times, and that when they said 'We're able to accommodate people one person at a time' and that 'We can set up that time,' I trusted that. As it turns out, it was a setup. So I take responsibility for falling for a setup. And that's all I'm going to say on that.\"", "Kious appeared as a guest on Tucker Carlson's Fox News show later that evening and denied having \"set up\" Pelosi. However, around the same time, an attorney representing the stylist in question, Jonathan DeNardo, provided an explosive statement to several news outlets, including Snopes. In it, attorney Matthew Soleimanpour claimed that Kious had in fact authorized the appointment with Pelosi in advance, contrary to her assertions, and had made \"vitriolic and incendiary comments\" about the lawmaker in a phone call with DeNardo:", "Mr. DeNardo has worked at eSalon for approximately six (6) years and regularly communicates with the salon owner, Erica Kious. In fact, Mr. DeNardo received advance approval from Ms. Kious the day prior to the appointment during a telephone discussion on August 30, 2020 at 9:26 pm, wherein Mr. DeNardo advised Ms. Kious that he would not proceed with Speaker Pelosi’s appointment without Ms. Kious’ authorization.", "Ms. Kious took special interest in the appointment during this telephone call, wherein she made several vitriolic and incendiary comments about Speaker Pelosi and her purported responsibility for temporarily suspending operations of Ms. Kious’ business, despite such orders actually being put into place not by Speaker Pelosi, but by Governor Gavin Newsome and San Francisco Mayor London Breed. Ultimately, Ms. Kious authorized Mr. DeNardo to proceed with Speaker Pelosi’s appointment.", "[...] The fact that Ms. Kious is now objecting to Speaker Pelosi’s presence at eSalon, and from a simple surface-level review of Ms. Kious’ political leanings, it appears Ms. Kious is furthering a set-up of Speaker Pelosi for her own vain aspirations. Mr. DeNardo’s name has now been dragged through the mud for simply following Ms. Kious’ recommendations [...].", "Snopes invited Kious to respond to the allegations made in DeNardo's statement, but we did not receive a response in time for publication.", "Even though the restrictions on hair salons were relaxed on Sep. 1, 2020, one day after Pelosi's appointment at eSalon, it is not the case that the visit would have been allowed if she had simply waited 24 hours.", "The new orders, implemented on Sep. 1, 2020, allow hair salons to operate only on the condition that they provide services outdoors, and the document (page 24) emphasizes the requirement for both service provider and customer to \"wear a face covering at all times, including during the entire service\" — something Pelosi failed to do because she removed her mask for a brief period.", "Furthermore, Pelosi had her hair washed during the visit. If that involved the use of shampoo, it would also have contravened the new rules that stipulate \"shampooing, chemical hair services, and services that require the customers to remove their face coverings are not permitted at this time.\" Her spokesperson's explanation that Pelosi usually has her hair styled at her home also appears to go against the San Francisco orders. Both the version published on Aug. 14 (on page 18) and on Sept. 1 (on page 17) explicitly forbid hair dressers to \"provide in-home services.\"", "It's not clear whether, technically speaking, Pelosi herself violated the Aug. 14 orders or if only business owners or service providers can be regarded as being in breach. We asked San Francisco's COVID Command Center for clarification on that legal question, but we received a non-specific response to the effect that city officials \"emphasize compliance over punishment\" when it comes to violations of the COVID-19 orders.", "Pelosi claimed she was \"set up\" by Kious, the owner of eSalon, after being advised by DeNardo, the stylist, that her visit was allowed under local rules. DeNardo's attorney has claimed, on his behalf, that Kious actually authorized the appointment in advance and expressed antipathy towards the speaker of the House.", "Nonetheless, it remains the case that on Aug. 31, 2020, Pelosi visited the salon at a time when San Francisco barred hair salons from operating. While there, she briefly removed her face mask, something that would be prohibited even under more relaxed rules that have since been introduced. If she herself did not personally violate the rules, she undoubtedly participated in a violation of them.", "Singman, Brooke.   \"Pelosi Used Shuttered San Francisco Hair Salon for Blow-Out, Owner Calls it 'Slap in the Face.'\"\r\n    Fox News.  1 September 2020.", "Barrett, Ted.   \"Pelosi's Office Acknowledges Indoor Hair Appointment, Violating San Francisco COVID-19 Restrictions.\"\r\n    CNN.  2 September 2020.", "Santucci, Jeanine.  \"Nancy Pelosi Criticized for Visiting San Francisco Hair Salon Despite Coronavirus Restrictions.\"\r\n    USA Today.  1 September 2020.", "Department of Public Health, City and County of San Francisco.  \"Order of the Health Officer No. C19-07g.\"\r\n    14 August 2020.", "Department of Public Health, City and County of San Francisco.  \"Order of the Health Officer No. C19-07h.\"\r\n    1 September 2020.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]