["A photo has been shared in multiple Facebook posts alongside claims that it shows deforestation in Sinharaja, a protected forest reserve in Sri Lanka. The claim, however, is misleading; the photo in fact shows deforestation in the Amazon.", "The photo was published on Facebook here on August 24, 2020. The post has been shared more than 500 times.", "The Sinhala language text superimposed on the image reads:", "“The Sinharaja that is being murdered by them", "\"She who saved the breath of air to over 22 million Sri Lankans is now breathing her last because of the actions of those sinful people.”", "The claim circulated after environmentalists criticised the construction of a road through the Sinharaja forest -- a designated UNESCO heritage site.", "The photo was also shared alongside similar claims on Facebook here, here and here.", "However, the claim is misleading.", "A reverse image search found that the photo in fact shows deforestation in the Amazon forest in South America.", "The photo was published by Getty Images here and is captioned: “Deforestation in the Amazon”.", "Below is a screenshot comparison of the misleading posts’ image (L) and the Getty Images photo (R):", "The image was also featured in this AFP article about global forest loss that was published by The Guardian in 2015.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]