["By Eugene Kiely", "Posted on March 6, 2017 | Updated on March 20, 2017", "With no evidence, President Donald Trump called it a “fact” that “President Obama was tapping my phones in October, just prior to Election!” He compared the alleged surveillance to the criminal acts of “Nixon/Watergate.”", "It was a startling and serious allegation about a former president, made in a series of four tweets on March 4. Yet, Trump provided no support for it, and the White House remained silent for a day. When the White House press office finally got around to explaining the president’s tweets, it undercut Trump’s baseless claim:", "We will break this down into two parts: What Trump claimed, and the evidence that the White House provided that failed to support his claim.", "It began with a tweet at 6:35 a.m. from Mar-a-Lago, the so-called winter White House that Trump owns in Florida:", "Terrible! Just found out that Obama had my \"wires tapped\" in Trump Tower just before the victory. Nothing found. This is McCarthyism!", "— Donald J. Trump (@realDonaldTrump) March 4, 2017", "Trump continued in this fashion for three more tweets for about a half hour:", "Is it legal for a sitting President to be \"wire tapping\" a race for president prior to an election? Turned down by court earlier. A NEW LOW!", "— Donald J. Trump (@realDonaldTrump) March 4, 2017", "I'd bet a good lawyer could make a great case out of the fact that President Obama was tapping my phones in October, just prior to Election!", "— Donald J. Trump (@realDonaldTrump) March 4, 2017", "How low has President Obama gone to tapp my phones during the very sacred election process. This is Nixon/Watergate. Bad (or sick) guy!", "— Donald J. Trump (@realDonaldTrump) March 4, 2017", "What is Trump talking about? The White House didn’t respond for more than 24 hours. When it did, the press secretary issued a brief statement, which we run here in its entirety:", "Spicer, March 5: Reports concerning potentially politically motivated investigations immediately ahead of the 2016 election are very troubling.", "President Donald J. Trump is requesting that as part of their investigation into Russian activity, the congressional intelligence committees exercise their oversight authority to determine whether executive branch investigative powers were abused in 2016.", "Neither the White House nor the President will comment further until such oversight is conducted.", "The “Russian activity” is a reference to the U.S. intelligence community’s finding in January that “Russian President Vladimir Putin ordered an influence campaign in 2016 aimed at the US presidential election.” The FBI and several congressional committees are continuing to investigate Russia’s role and possible connections between Russia and Trump associates.", "Spicer didn’t say much in his brief statement, but we learned the president’s claim of Watergate-style criminal abuse of power was not based on U.S. intelligence briefings, but on “reports.”", "Later that day, Sanders went on ABC’s “This Week,” where she reiterated the White House’s call for an investigation and cited news organizations that “reported on the potential of this having had happened.”", "In essence, Spicer and Huckabee aren’t saying the president’s statement is accurate; they are saying it may be accurate — without providing any evidence to support even that possibility.", "Sanders went even further by claiming that Trump was only citing what “multiple news outlets” have already reported.", "Sanders, March 5: Everybody acts like President Trump is the one that came up with this idea and just threw it out there. There are multiple news outlets that have reported this.", "That is false, as we explain next as we look at the news stories cited by the White House as evidence.", "When we asked for the news articles referenced by Sanders, the White House provided us with a timeline of events from five news stories written by four news organizations. Only two of the stories were relevant to Trump’s accusations, and none of them claimed that Obama ordered illegal wiretaps.", "Trump’s claim rests primarily on the reporting of Heat Street, a conservative website owned by Rupert Murdoch’s News Corp and started by Louise Mensch, a former Conservative Party member of the British Parliament.", "In a Nov. 7, 2016, article, Heat Street wrote that the FBI on two occasions sought a warrant from the Foreign Intelligence Surveillance Court, or FISA court, as part of its investigation of Russia’s interference in the U.S. presidential election, and Trump associates who were suspected of contacts with Russian officials.", "Heat Street reported that the FBI failed in June to obtain a warrant, but it was successful in October after the request was narrowed to focus on possible “financial and banking offenses” involving two Russian banks:", "Heat Street, Nov. 7, 2016: The first request, which, sources say, named Trump, was denied back in June, but the second was drawn more narrowly and was granted in October after evidence was presented of a server, possibly related to the Trump campaign, and its alleged links to two banks; SVB Bank and Russia’s Alfa Bank.", "The administration also referred us to a Jan. 12, 2017, report on the BBC website, which also cited anonymous sources who said that the FBI received a FISA court warrant in October.", "The BBC report said the warrant targeted two Russian banks suspected of sending “money to Mr Trump’s organisation or his election campaign.” However, the BBC report said that “neither Mr. Trump nor his associates are named in the FISA order”:", "BBC, Jan. 12, 2017: On 15 October, the US secret intelligence court issued a warrant to investigate two Russian banks. This news was given to me by several sources and corroborated by someone I will identify only as a senior member of the US intelligence community. He would never volunteer anything – giving up classified information would be illegal – but he would confirm or deny what I had heard from other sources. …", "Neither Mr Trump nor his associates are named in the Fisa order, which would only cover foreign citizens or foreign entities – in this case the Russian banks. But ultimately, the investigation is looking for transfers of money from Russia to the United States, each one, if proved, a felony offence.", "These stories, which were based on anonymous sources and have not been confirmed, do not support Trump’s claims that “President Obama was tapping my phones in October,” or that the alleged wiretapping was illegal.", "First, the president has no role in the FBI’s decision to seek a warrant or the FISA court’s approval for one, as explained in a 2006 story by the New York Times on how the FISA application process works. The warrant application would be initiated by the FBI and presented to the FISA court by Justice Department attorneys.", "Second, the FBI must prove to the court that there is “probable cause” that the target of the warrant is “an agent of a foreign power” and engaged in criminal activity, as explained in a joint statement last year to Congress by the intelligence community officials.", "Neither Heat Street nor the BBC alleged any wrongdoing by Obama or the FBI in allegedly obtaining a FISA court warrant in October.", "On the same day that the White House provided us with these stories, James Clapper, the former director of national intelligence under Obama, appeared on NBC’s “Meet the Press” and denied that a FISA court warrant was issued to monitor Trump Tower.", "“For the part of the national security apparatus that I oversaw as DNI, there was no such wiretap activity mounted against the president, the president-elect at the time, or as a candidate, or against his campaign,” Clapper said.", "Clapper said he would have known whether the FBI had a court order for surveillance, and he was not aware of one.", "Obama’s spokesman, Kevin Lewis, also denied Trump’s allegation, calling it “simply false” in a statement issued on Twitter.", "“A cardinal rule of the Obama Administration was that no White House official ever interfered with any independent investigation led by the Department of Justice,” the statement said. “As part of that practice, neither President Obama nor any White House official ever ordered surveillance on any U.S. citizen.”", "The three other stories cited by the White House:", "It is the responsibility of the politician making a claim to provide information to support it. But Trump has failed to do so.", "First, there is no evidence that the FBI wiretapped Trump’s phone or his campaign offices in Trump Tower. Indeed, the director of national intelligence flatly denied it.", "Second, the claim is loosely based on two reports — a conservative blog and a BBC report — that cited anonymous sources who claimed that the FBI obtained a warrant in October to investigate two Russian banks. Neither report alleged any wrongdoing by Obama or even evidence that the warrant was obtained illegally. In fact, Heat Street and the BBC claimed that the FBI obtained a legal warrant from the FISA court.", "Finally, there is no evidence Obama ordered any wiretapping, as Trump alleged. That would be handled by the FBI and Justice Department independently of the White House.", "Update, March 16: In a March 15 interview, Fox News’ Tucker Carlson asked Trump why he made his accusation without providing evidence. Trump said that the New York Times “wrote about it … on January 20 using the word wiretap.” That is the New York Times story we mention earlier. It was posted to the paper’s website on Jan. 19 and published Jan. 20 in the paper under the headline, “Wiretapped Data Used in Inquiry of Trump Aides.” However, that story made no mention of Obama ordering a wiretap of Trump’s phones, and, as we wrote, the paper said it “was not clear whether the intercepted communications had anything to do with Mr. Trump’s campaign.”", "Update, March 20: At a March 20 hearing of the House Permanent Select Committee on Intelligence, FBI Director James Comey testified that the Department of Justice and the FBI have no information to support Trump’s tweets that the Obama administration wiretapped his phones at Trump Tower. “With respect to the president’s tweets about alleged wiretapping directed at him by the prior administration, I have no information that supports those tweets and we have looked carefully inside the FBI,” Comey said. “The Department of Justice has asked me to share with you that the answer is the same for the Department of Justice and all its components. The department has no information that supports those tweets.”", "Update, Sept. 25: CNN reported on Sept. 19 that federal investigators “wiretapped former Trump campaign chairman Paul Manafort under secret court orders before and after the election,” citing unnamed sources. Some have cited the CNN story as evidence that Trump was right. It isn’t. We explain why in our item, “Revisiting Trump’s Wiretap Tweets.”", "FactCheck.org Rating:", "Read More", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]