["“चुनावी रुझानों के बाद चमचो का पहला वीडियो जारी हुआ (After election trends, this is the first video of sycophants -translated)”, reads the message posted along with a video of an individual, who is breaking a TV set. The video and message have been posted by a Facebook user named Raj Choudhary. It has been shared close to 3,500 times. It is being suggested that these are opposition supporters who broke their TV sets in frustration over the Lok Sabha election result in which the BJP won a clear majority.", "चुनावी रुझानों के बाद चमचो का पहला वीडियो जारी हुआ 😂😂", "Posted by Raj Choudhary on Thursday, 23 May 2019", "Many other individuals on Facebook and Twitter have shared the video with an identical narrative.", "Alt News broke the video into multiple keyframes by using InVID, a digital verification tool. Upon reverse searching the extracted keyframes on Google, it was found that the video existed on the internet as early as 2015. “باكستاني يكسر التلفاز عندما شاهد عبد الملك الحوثي (A Pakistani breaks the television when he saw Abdul Malik al – Houthi – Google translated)”, reads the caption of the video uploaded on YouTube on April 9, 2015. Abdul Malik al-Houthi is a leader of the Houthi Ansarullah revolutionary movement in Yemen.", "This video was also relayed by Aaj Tak in 2017 with a false narrative that Pakistanis were breaking their TV sets after Pakistan’s abysmal performance in a group stage match against India in the ICC Champions trophy. Mango News, a YouTube channel had also posted the video with an identical narrative.", "Alt News couldn’t independently establish the exact context of the video. However, suffice to say, a video available on the internet at least four years ago cannot be representative of an event which took place on May 23, 2019. An old video was circulated on social media to falsely portray the frustration of opposition supporters after NDA was voted back to power with a thumping majority in 2019.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]