["About this rating", "On 25 October 2016, the Empire News web site published an article detailing the supposed arrest of a Nebraska man who had engaged in a vigilante killing spree during which he murdered more than 30 registered sex offenders over a span of 15 years:", "Man Arrested After Going On Murder Spree, Killing Over 30 Registered Sex Offenders", "A Nebraska man was arrested after he was caught in the act of strangling someone to death in an alley outside of a Omaha McDonald’s, police say. According to reports, Joel Miller, 42, was arrested for assault and attempted murder, and during questioning admitted that he had killed more than 30 people already, all of them registered sex offenders.", "“I’ve been killing pedos and perverts for, damn, close to 15 years now,” said Miller. “Started when I was 26 or so, after a girl I was dating was raped and murdered. I tracked the guy down myself, slit his throat. I realized I had a real knack for it after that, so I kept going.”", "There was no truth to this story, which originated with (and was solely reported by) Empire News, a fake news web site whose disclaimer identifies its contents as \"entertainment\":", "Empire News is intended for entertainment purposes only. Our website and social media content uses only fictional names, except in cases of public figure and celebrity parody or satirization. Any other use of real names is accidental and coincidental.", "The very same fictional story was republished on 15 December 2017 by sister sites YourNewsWire and NeonNettle under the headlines \"Local Hero Arrested After Killing 30 Pedophiles in Murder Spree\" and \"Vigilante Arrested for Killing 30 Pedophiles in Mass Murder Spree,\" respectively.  Both of these sites are also well known fake news sites that traffic in clickbait and fabricated \"news.\"", "Adl-Tabatabai, Sean.   \"Local Hero Arrested After Killing 30 Pedophiles in Murder Spree.\"\r\n    YourNewsWire.   15 December 2017.", "Empire News.   \"Man Arrested After Going on Murder Spree, Killing Over 30 Registered Sex Offenders.\"\r\n    25 October 2016.", "Greenberg, Jay.   \"Vigilante Arrested for Killing 30 Pedophiles in Mass Murder Spree.\"\r\n      Neon Nettle.   15 December 2017.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]