["“TWO STAMPS NEEDED FOR MAIL-IN BALLOTS MAKE SURE THIS GETS PASSED ON!!!!!” reads an October 5, 2020 Facebook post.", "More examples are available here and here.", "This claim also circulated in multiple pro-Democrat Facebook groups with thousands of followers.", "USPS spokeswoman Martha Johnson told AFP in an email that the Postal Service “requires election officials to inform voters of the amount of postage required since ballot mail is variable in content and weight,” which impacts postage.", "Each state, or local board of election, if authorized, can also opt to provide voters with prepaid postage, she said.", "The National Conference of State Legislatures, a body that compiles legislation from across the country, found that 17 states require local election authorities to provide return postage for mailed ballots.", "“If a return ballot is nevertheless entered into the mailstream with insufficient or unpaid postage, it is the Postal Service’s policy not to delay the delivery of completed mail-in ballots.”", "“In cases where a ballot enters the mailstream without the proper amount of postage, the Postal Service will deliver the ballot and thereafter attempt to collect postage from the appropriate Board of Elections.”", "The Postal Service has published more information about voting by mail here.", "Baseless distrust of the mail-in voting system and misinformation about the USPS -- much of it driven by US President Donald Trump himself -- has targeted the agency as the presidential election approaches, with  tens of millions of voters opting for mail-in ballots as an alternative to in-person voting during the coronavirus pandemic.", "The president continues to claim mail-in voting carries a major risk of fraud. Officials and experts dispute this.", "AFP Fact Check has debunked other claims about mail-in voting and the USPS here, here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]