["About this rating", "On May 15, 2020, Ringsssss published an article claiming that Keurig Dr Pepper announced it would discontinue production of 7UP due to “slow sales” beginning on Dec. 1.", "Kuerig Dr Pepper Has Announced That They Will Be Discontinuing Production Of 7 UP Due To Slow Sales. December 1st Will Be The Last Day Of Production. 2020 Strikes Again.", "Burlington, MA- Kuerig Dr Pepper has announced that the company will no longer produce the long running citrus drink 7 UP. CEO Robert Gamgort made the announcement early May 11th regarding the long running beverage. Sales have been at an all time low.", "“7 UP has meant so much to all of us over the years. All of us over 50 that is. The youth in America have no use for the drink. Long ago are the days where one would ask for some 7 UP to ease an upset stomach. No one is ordering 7 and 7’s anymore. Quite frankly it’s been long overdue to put this soft drink out to pasture. Kuerig Dr Pepper will use the rest of 2020 to sell off what is left and to finish promotions already under contract”, [sic] said Gamgort.", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Ringssss described itself as a “fabricated satirical newspaper and comedy site” that uses “invented names in all of its stories, except in cases when public figures are being satirized.”", "In the case of this article, Gamgort is a real figure and began serving as the role of executive chairman of the board, president, and CEO of Keurig Dr Pepper since 2018.", "For background, here is why we sometimes write about satire/humor.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]