["Despite calls from Democrats to delay the process until after the election, President Donald Trump has said he will announce a nominee to the Supreme Court on Saturday.", "Some who appear to oppose that have shared a tweet on Facebook and Instagram that attempts to levy the president's own words against him.", "The tweet claims to be from April 2016, the midst of a battle between President Barack Obama and Senate Republicans over confirming nominee Judge Merrick Garland to the high court in the months leading up to the presidential election.", "\"Obama should wait until he leaves office to pick another Justice! If he doesn't, he should be fired,\" the tweet reads.", "The only issue? It isn't real.", "Users who posted the tweet did not respond to requests from USA TODAY for comment.", "Fact check:No guarantee Obama would've replaced Ginsburg with a progressive justice", "Searches for the text of the tweet reveal there is no record of it in the Trump Twitter Archive. It also does not appear under a search of tweets on the day it purports to have been sent — April 3, 2016.", "In fact, beyond a tweet about his death, Trump never took to Twitter to address the contentious fight to replace Justice Antonin Scalia.", "The only tweet that comes up under the search \"Garland,\" for example, is about Judy Garland, not Merrick Garland.", "However, Trump did address the fight to fill Scalia's vacancy on Good Morning America in March 2016.", "“I think they should wait until the next president and let the next president pick,” he said at the time, according to Politico.", "Fact check:False claim suggesting Trump nominated Biden to the Supreme Court started out as satire", "Based on our research, the claim that President Donald Trump tweeted that Barack Obama \"should wait until he leaves office to pick another Justice\" is FALSE. Trump never tweeted that.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]