["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former Secretary of State and National Security Adviser Henry Kissinger, who influenced U.S. foreign policy from 1969 to 1976 under Presidents Richard Nixon and Gerald Ford, has delivered his fair share of speeches over the years.", "But now a post recently shared on Facebook shares an alarming excerpt of a speech Kissinger allegedly gave about mandatory forcible vaccination, sterilization and extermination services.", "Here is the full quote attributed to Kissinger:", "\"Once the herd accepts mandatory forcible vaccination, it’s game over! They will accept anything – forcible blood or organ donation – for the \"greater good.\" We can genetically modify children and sterilize them – for the \"greater good.\" Control sheep minds and you control the herd. Vaccine makers stand to make billions, and many of you in this room today are investors. It’s a big win-win! We thin out the herd and the herd pays us for providing extermination services. Now, what’s for lunch, huh?\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Let’s cut to the chase: This is misinformation. There is no evidence that Kissinger ever said or wrote this.", "We found other versions of the quote also include the time and place Kissinger supposedly gave the address — \"to the World Health Organization Council on Eugenics Feb 25, 2009.\"", "But when we contacted Christian Lindmeier, a spokesperson for the World Health Organization, he told us that not only are there no records in WHO’s archives of the speech, but a \"World Health Organization Council on Eugenics\" does not exist.", "\"We have no records of any such speech,\" Lindmeier wrote PolitiFact in an email. \"Please also note that there is no such ‘Council’ as claimed in the statement, respectively a related meme.\"", "We also search Kissinger’s website, which lists many of his speeches and interviews, and could not find any portion of the quote.", "Kissinger did give a speech to the 45th Munich Security Conference on Feb. 6, 2009, but the discussion did not cover vaccinations.", "This fake quote is Pants on Fire!", "Facebook post, June 20, 2019", "Britannica, Henry A. Kissinger, Accessed June 24, 2019", "HenryAKissinger.com, Speeches, Interviews, Accessed June 25, 2019", "American Rhetoric, Henry Kissinger Speech to the 45th Munich Security Conference, Feb. 6, 2009", "Email interview, Christian Lindmeier spokesperson at the World Health Organization, June 25, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]