["About this rating", "Editor’s note: Snopes initially published an overview of this claim on 12 February 2002. Renewed interest in the claim following Russia’s expulsion from the 2018 Olympics drove us to dig deeper. While our rating remains unchanged from 2002, we present new research and renewed skepticism in this updated version of the post.", "For years, internet users have wrung their hands over “abortion doping” — the alleged practice of conceiving and terminating a pregnancy for the sole purpose of improving athletic performance — despite little to no evidence that anyone has ever done it.", "Prior to the dissolution of the Soviet Union in 1991, the Russians and their satellite states, including East Germany, were notorious for doping-related Olympic controversies—typically the use and abuse of performance-enhancing drugs and steroids. The athletic event was considered a time when adversaries in the Cold War could openly compete for dominance on the world stage. Though global borders and economies have been redrawn in the decades since, the Russians still face allegations of doping in the 2018 Olympics.", "Rumors that girls as young as 14 and women athletes were intentionally impregnated by coaches or trainers with the intent of terminating those pregnancies for a physical gain have their origins in these Cold War politics, and therefore come with an air of believability that appears to have lent them undue credit.", "Cold War Rumors", "Since at least 1956, Western media outlets have leveled accusations against Soviet bloc countries that female Olympic athletes sometimes use a terminated pregnancy to reap hormonal and physiological benefits, according to a 1994 report in UK’s Sunday Times:", "Suspicion that women athletes from the former Soviet Union planned abortions to coincide with important competitions first surfaced in 1956 at the Melbourne Olympics, then [arose again] eight years later in Tokyo. One estimate at the time suggested that as many as 10 of 26 medal winners may have manipulated their pregnancy. According to [Sports medicine doctor Jean-Pierre de] Mondenard, no conclusive proof of abuse was ever produced.", "Sunday Times (London, England), 27 November 1994, p. 23.", "Media reports leveled similar charges at other communist nations as well, most notably East Germany. A 1988 Los Angeles Times article, reported on from East Berlin, described these rumors as “fueled by the Western European press.”", "In 1994, German media provided what they billed as a confirmation of both this practice’s existence and its sponsorship by a governmental organization. In a story that garnered widespread Western coverage, the German television station RTL aired what they presented as an interview with a Soviet gymnast named Olga Kovalenko:", "Olga Kovalenko, a gold medal winner at the 1968 Olympic games in Mexico, confessed to German television that she had become pregnant and had an abortion shortly before the competition to toughen her body and profit from hormonal changes that enhanced her physical performance.", "Kovalenko, who competed under her maiden name, Karaseva, claimed that the practice was widespread among champion Soviet athletes during the 1970s. She said girls as young as 14 were ordered to have sex with their coaches if they had no steady boyfriend. In her own case, she added, \"I was told that if I refused I would not have been sent to the Games.\"", "Sunday Times (London, England), 27 November 1994, p. 23.", "In a perplexing twist, however, Kovalenko disputes that she was the person who appeared in that interview, claiming the network interviewed an imposter. She additionally disputes an interview attributed to her in a Russian newspaper where she allegedly confirmed details of abortion doping to a reporter there. With regard to the latter, Kovalenko won a defamation lawsuit against the newspaper in Russian court in 1998, and she threatened a lawsuit against the German television outlet as well, as reported by Agence France Presse on 10 December 1998:", "Former Soviet Olympic star Olga Karasyova has won damages over bizarre allegations that Soviet athletes had been forced to get pregnant and then have abortions to boost their performance.", "A Moscow court ruled that the Russian monthly SPEED Info had libelled Karasyova by quoting her as saying the ruling body of Soviet sport forced women stars to have sex with their trainers to become pregnant. [...] An outraged Karasyova denied she ever made any such allegation against Goskomsport, which ran sport during the communist era.", "The court awarded Karasyova, who won gold at the 1968 Mexico City Olympics, 35,000 rubles (1,750 dollars) in damages. She is now considering legal action against the German television station RTL, which broadcast similar charges.", "Agence France Presse (English), 10 December 1998", "Karasyova’s disputed testimony remains the only “confirmation” of the practice of abortion doping. Despite her legal victory, the interviews attributed to her have been repeated as fact long after Karasyova won her court battle. It’s unclear whether she attempted to make similar claims against the German television show.", "Karsyova’s alleged 1994 interview carried additional weight when it was first reported because many reporters suggested, during the 1968 Olympics, the only way silver medalist gymnast Vera Caslavska—a Czech with anti-Soviet views and a favorite of Western media—could have lost was if Karasyova had cheated.", "Caslavska’s coach is actually the source of a quote often presented to support the notion that “abortion doping” is a real practice. Responding to the 1994 RTL interview, her coach says “In any other country it would have been called rape.” This quote, while still used as independent proof of the practice, refers the same disputed incident.", "Pro-Life Talking Point", "In the internet era, the most heavily cited source in support of the existence of abortion doping can be traced to a February 2002 article published in the now-defunct Canadian independent newspaper The Report. The author, Celeste McGovern, is well-known for pushing medical conspiracies and is occasionally featured on fringe websites like InfoWars. Her sparsely sourced story ran with this shocking headline:", "“Going for Gold: It Takes Blood, Sweat and an Abortion to Be a Winner”", "This story, written in the run-up to the 2002 Winter Olympics, raised anew the spectre of this supposedly hushed form of performance enhancement, suggesting it has been a common practice. The article’s most significant claims have been cited or referenced in myriad pro-life websites, a legal review, and at least one scientific paper:", "One [doping] scheme that's virtually impossible to ban is pregnancy. Early on, pregnancy has the effect of boosting a woman's blood volume tremendously to fuel her unborn baby's growth. Getting pregnant two or three months before an event and having an abortion days prior to it can grant as much as a 10 percent performance enhancement.", "North American athletes have never been implicated in the scheme, says [Mona Passignano, director of research at the Texas pro-life group Life Dynamics reports], but athletes from countries they compete with certainly have.", "[Passignano] quotes a[n unnamed] Finnish sports medicine expert: \"Now that drug testing is routine, pregnancy is becoming the favourite way of getting an edge on competition.\" One Russian athlete told a reporter that as long ago as the '70s, gymnasts as young as 14 were ordered to sleep with their coaches to get pregnant—and then abort. U.S Olympic regulations ban the \"pregnancy/abortion\" doping scheme, though it's basically an unenforceable law.", "The first source McGovern cites is the director of an anti-abortion group in Texas who then, in turn, cites an unnamed “Finnish sports medicine expert” about its widespread use.", "The expert, based on his “favourite way of getting an edge” quote, is a doctor named Risto Erkola, who expressed both his disgust at the practice and the claim that it was widespread in a 22 May 1988 article in the British tabloid Sunday Mirror. His quote has been repeated ad infinitum in various sources.", "Media reports following this tabloid claim were skeptical of it, and it is not clear if Erkola would have had any first-hand knowledge of Soviet doping practices in the first place. Responding to the Mirror’s claims in a report that appeared in numerous papers including a 25 May 1988 article in Australian paper The Age [pg 6, “Pregnancy Improves Performance, Says Doctor”], Peter Larkins, then an official of the Australian Sports Medicine Association raised both scientific skepticism and an eagerness to believe the rumors in spite of that skepticism:", "An Australian sports medicine specialist said yesterday that he would not be surprised if women athletes in the Eastern bloc were getting pregnant to enhance their athletic performance, and then having abortions. [...]", "“Nothing surprises me any more about what athletes will now to try to gain an advantage,\" Dr. Larkins said. But although pregnancy could theoretically improve performance, he believed that the advantage were far outweighed by the drawbacks-of morning sickness and fatigue; which are common in early pregnancy.", "The latter source in McGovern’s Record story, a second-hand report of a “Russian athlete” about gymnasts “as young as 14” being ordered to sleep with their coaches is a nearly word-for-word description of news reports concerning the disputed 1994 interview with a potential imposter. As such it almost certainly refers to the same dubious case.", "McGovern omits the fact that this later testimony was refuted by its alleged source, and suggests a man quoted in a 1988 Sunday Mirror article with no clear connection to the Soviet Union as an authority of its widespread use. Despite these factual problems, McGovern’s Record report has been, and continues to be, cited as evidence of the practice.", "Dubious Science", "The scientific rationale in favor of abortion doping is similarly self-referential, circumstantial, and problematic. In a post promoting McGovern’s 2002 report on abortion doping, anti-abortion website LifeSiteNews.com added their own bit of research, which is repeated verbatim on many other similar sites:", "The procedure is so well known it has made it to the textbooks. LifeSite found the method described in an online textbook in physiology by Dr. Poul-Erik Paulev of the Department of Medical Physiology, University of Copenhagen.", "However, this so-called textbook is an online, self-published document that contains no references for its claims regarding abortion doping, and largely repeats information contained in the aforementioned press accounts attributed to a potential imposter of Karasyova.", "Another oft-repeated bit of supporting data has its origins in another Times report — this one from 2003. In a story about cheating in sports, the Times cites a Michigan State University professor as lending credibility to the scientific basis of abortion doping:", "In the first three months it is known that a woman’s body produces a natural surplus of red blood cells, the type that are rich in oxygen-carrying haemoglobin, to support the growing foetus. James Pivarnik, a professor of kinesiology and epidemiology at Michigan State University, has studied athletes during and after pregnancy at his Human Energy Research laboratory and found there is a 60 per cent increase in blood volume and that this could improve the body’s ability to carry oxygen to the muscles by up to 30 per cent.", "We reached out to Pivarnik for verification. He told us via email that he does not remember conveying the stats cited to the Times, and that the numbers were “nothing new.” But the numbers were not targeted toward a discussion about athletic performance enhancement. Pivarnik told us he had “no idea” which study of his the Times was referring to.", "No published studies have specifically tested a performance benefit following terminated pregnancies.", "That does not mean there is nothing to the claim. It is well known, as Pivarnik stated, that a woman’s blood volume increases dramatically to support a fetus. The notion that hormonal changes could lead to benefits, while theoretical, is not completely without biological basis. The basic concept, as reported in New Scientist, is rooted in principles about how pregnancy works:", "Changing hormones may be another way pregnancy could affect endurance performance. The surges in oestrogen and progesterone that pregnant women experience can change metabolism – encouraging the body to break down fats for energy instead of carbohydrates. This would allow pregnant women to hold onto their carbohydrate energy stores for longer, enabling them to push themselves further as competitors hit a wall.", "“This is just a theory,” Pivarnik cautioned in that New Scientist piece.", "On top of these theories, media reports also frequently conflate elite athletes’ success after giving birth—documented in the case of some elite athletes and a popular topic on the web—to the the theoretical benefits of abortion-doping. The role of giving birth and finding success as an Olympian is disputed. Regardless, giving birth is significantly different than terminating a pregnancy after 3 months.", "“Abortion doping” claims, specifically, have their roots in Cold War era rumors, are confirmed only by a single dubious case, are buttressed by speculative science, and are largely amplified in recent years by anti-abortion groups.", "We cannot, however, conclusively prove or disprove the existence of covert athletic research or practices allegedly performed by countries behind the Iron Curtain. As such, we rank the allegation of widespread use and employment of “abortion doping” as unproven.", "McGovern, Celeste.   \"Abortion Can Be Used to Boost Athletic Performance.\"\r\n    Report News Magazine.   4 February 2002.", "Life Site News   \"Olympic Athletes Getting Pregnant and Aborting to Boost Performance.\"\r\n    1 February 2002.", "Jarvis, Lisa.   \"Should the International Olympic Committee Be Policing Motherhood?\"\r\n    Seton Hall J. Sport L..   2003.", "Hamilton, Mark.   \"Elective Performance Enhancement Surgery for Athletes: Should it Be Resisted?\"\r\n    Acta Univ. Palacki. Olomuc., Gymn.   2006.", "Dorman, Larry.   \"Creating the Perfect Athlete\"\r\n    The Rotarian.   September 1988.", "Harvey, Randy.   \"East Germans Credit Success to Application of Knowledge.\"\r\n    Los Angeles Times.   30 August 1988.", "The Age (Australia).   \"Court Win for Soviet.\"\r\n    12 December 1998.", "Langer, Emily.   \"Vera Caslavska, Olympic Gymnast and National Heroine to Czechs, Dies at 74.\"\r\n    The Washington Post.   31 August 2016.", "Oliver, Brian.   \"Sports Cheats Have Been at it for Years: It’s Always About Greed and Politics.\"\r\n    The Guardian.   15 November 2015.", "Paulev, Poul-Erik and Zubieta-Calleja, Gustavo.   Textbook in Medical Physiology and Pathophysiology.\r\n     University of Copenhagen, August 2004", "Bee, Peta.   \"Sportswomen Benefit from Pregnancy.\"\r\n    Times Online.   14 September 2009.", "Hytten, F.   \"Blood Volume Changes in Normal Pregnancy.\"\r\n    Clin. Haematol..   October 1985.", "Hamzelou, Jessica.   \"How Pregnancy Could Affect an Elite Athlete Like Serena Williams.\"\r\n    New Scientist.   22 April 2017.", "McDonagh, Eileen, and Pappano, Laura.   \"Might Pregnancy be a Boon to Female Athletes?\"\r\n    Huffington Post.   8 November 2007.", "Clarey, Christopher.   \"Russian Doping: The Case for Barring Russia Entirely\"\r\n    New York Times.   4 December 2017.", "Mcintosh, Phillip.   “Pregnancy Improves Performance, Says Doctor”\r\n    The Age.   25 May 1988.", "Agence France Presse (English).   “Abortion Allegations”\r\n    10 December 1998.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]