["About this rating", "On 26 April 2016, the Science Channel premiered an episode of their show “What on Earth?” that (in part) purported to explain the disappearances of ships and planes in the area known as the Bermuda Triangle through a natural meteorological phenomenon known as microbursts.", "Though the Science Channel has heavily promoted an online video of that segment on social media since May 2016, it became a viral news story when the news outlets such as the UK's Daily Mail and Mirror Online picked it up as a new “finding” on 21 October 2016:", "The mystery behind the Bermuda Triangle may have finally been cracked. The 500,000 km square stretch in the North Atlantic Ocean has been blamed for the disappearance of at least 75 planes and hundreds of ships over the centuries. But scientists claim the truth behind the “deadly triangle” is all down to hexagonal clouds that create terrifying 170 mph winds[sic] air bombs. It is believed these deadly blasts of air can flip over ships and bring planes crashing into the ocean.", "The logic behind the actual Science Channel segment that this claim is based on, if it is a cohesive argument at all, can be summarized as follows:", "When both the Daily Mail and the Mirror Online reported this story in October 2016, they used quotes from the  Science Channel segment in a way that suggested they had performed original reporting to verify the claims made in the video. One quote, from Arizona State University climatologist Randall Cerveny, explained the mechanics of a downburst while putting the term \"air bomb\" into play:", "These types of hexagonal shapes over the ocean are in essence air bombs. They are formed by what are called microbursts and they’re blasts of air that come down out of the bottom of a cloud and then hit the ocean and then create waves that can sometimes be massive in size as they start to interact with each other.", "Another quote, from Colorado State University satellite meteorologist Steve Miller, turned a mundane scientific statement into a tantalizing mystery:", "You don’t typically see straight edges with clouds. Most of the time, clouds are random in their distribution.", "Both statements are factual. However, neither scientist claimed that the mechanism they were describing had any explanatory power for the purported anomalous number of disappearances of ships and planes in the area. In a 21 October 2016 USA Today article, both scientists suggested their comments had been misrepresented by the Science Channel:", "Steven Miller, who appeared on the Science Channel report, said this weather pattern can't be blamed for Bermuda Triangle disappearances, because it happens everywhere.", "\"It is a common phenomenon occurring globally—most generally found at mid- to high latitude locations over the oceans, and usually during the cold season,\" the scientist at the Cooperative Institute for Research in the Atmosphere of Colorado State University said.", "Randy Cerveny, who also appeared in the report, said he was surprised with the piece because he hasn't done any original work on this topic and was speculating the weather pattern might be explained by concentrated downbursts of air from decaying thunderstorms.", "\"They made it appear as if I was making a big breakthrough or something,\" Cerveny, a professor of geographical sciences at Arizona State University, said. \"Sadly [that's] not the case.\"", "Any physical explanation for an anomalous number of disappearances in a specific area should have, as a defining characteristic, something that makes it unique to that area. The hexagonal cloud explanation fails to meet this low bar, a point made by Miller and reinforced by the same USA Today story:", "Satellite weather images showing honeycomb cloud patterns, like those above the Bermuda Triangle, are strange to see, but not uncommon. These open and closed cells occur when cold, dry air mixes over warm water.", "The patterns are usually spotted over the mid-North Atlantic and the North Pacific during late fall to early spring. A Science Channel report linking the weather phenomenon to the Bermuda Triangle speculates the cloud patterns, which can create updrafts and downdrafts, could be responsible for unusual activity there.", "Finally, the existence of the Bermuda Triangle as a mysterious place where ships and planes frequently disappear without explanation is far from an accepted fact. A deeply researched 1975 book by Lawrence Kusche looked at the records of many of the so-called disappearances and found them to be questionable, inaccurately reported, or embellished.", "In 2013, the World Wide Fund for Nature (WWF) issued an exhaustive  study of the most dangerous shipping regions in the world’s oceans. The Bermuda triangle didn't even make the cut.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]