["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As Republican Gov. Rick Scott and his rival, Democrat Charlie Crist, battle for the support of Hispanic voters, they have attacked each other over everything from in-state tuition for young people who came to the United States illegally to the longstanding embargo of Cuba to what was, or wasn’t, said by certain Scott campaign staffers en route to a Chipotle.", "Such politicking shows how important both candidates believe Hispanics to be in this year’s campaign for Florida’s governor. One key battleground is Miami-Dade County, home to the largest number of Hispanic voters in the state, as well as Scott’s running mate, Lt. Gov. Carlos Lopez-Cantera.", "Miami-Dade Democratic chair Annette Taddeo-Goldstein, who was born in Colombia, boasted about the size of the Hispanic vote in Florida in an April 21 interview with MSNBC Ed Schultz.", "Taddeo-Goldstein: \"I’m not surprised (Scott is) trying to pander to the Hispanic community, because our vote is actually, in my opinion, going to decide this election.\"", "Schultz: \"You believe that the Latino vote will decide the gubernatorial election here in Florida?\"", "Taddeo-Goldstein: \"Now the Hispanics in Florida account for one in four of every resident in Florida. It is actually the largest in the country when it comes to the percentages. Over 20 percent of the electorate is Hispanic. So it’s going to be decided by Hispanics.\"", "We can’t fact-check her prediction that Hispanic voters will decide the race, but we can fact-check her claim about the size of the Hispanic electorate.", "First, we’ll offer some background about why the Hispanic vote in Florida is in play.", "According to party registration statistics, Hispanics lean Democratic, but in actual voting patterns, the Hispanic vote is more competitive between the parties. While President Barack Obama overwhelmingly won the state’s Hispanic vote in 2012, Hispanics narrowly backed Scott in 2010, according to exit polls, though there was a large margin of error. Even Miami-Dade’s Cuban-American vote, historically a reliable base for GOP candidates, is becoming more competitive over time.", "Florida’s Hispanic electorate", "Taddeo-Goldstein was correct in her recitation of statistics about the Hispanic population in Florida and nationally.", "However, she was wrong on the percentage of registered voters who are Hispanic in Florida.", "As of October 2012, there were about 1.66 million registered Hispanic voters out of 11.9 million voters total, or 13.9 percent, according to the Florida Division of Elections.", "Susan MacManus, a University of South Florida political science professor, obtained more recent data from the state and shared the totals with PolitiFact Florida. As of the end of 2013, she said, about 14.2 percent of the state’s electorate was Hispanic.", "This data comes with some caveats. The state added \"Hispanic\" to voter registration in 1995, so it doesn’t reflect Hispanic voters who registered before that date. And the field is optional on voter registration forms.", "Such factors do raise uncertainties, said Dario Moreno, a pollster and Florida International University political science professor. Moreno said he’s not convinced that the state’s data fully captures the Hispanic share of the electorate.  He said that since voters have to self-report their heritage on the forms, some may be reluctant to share the information or be confused about race versus ethnicity. He thinks it could be at least 15 percent.", "Political organizations, campaigns and other entities purchase data from firms that collect voter registration data also found higher figures for Florida’s Hispanic electorate, though still less than 20 percent.", "Univision reports that 18 percent of Florida’s electorate is Hispanic as of November 2013, based on data from the firm Aristotle, which compiles data from elections offices.", "Meanwhile, a spokeswoman for the National Association of Latino Elected and Appointed Officials said their information shows Florida’s Hispanic electorate at 15 percent of the state's voters as of November 2013.", "When PolitiFact Florida contacted Taddeo-Goldstein for this fact check, she acknowledged that she should have said \"residents,\" rather than \"electorate.\"", "\"Thanks for checking on this and for correcting me,\" she said.", "Our ruling", "Taddeo-Goldstein said that \"over 20 percent of the (Florida) electorate is Hispanic.\"", "While more than 20 percent of the state’s population is Hispanic -- 23 percent to be exact -- the percentage of Hispanic registered voters is lower. State data shows that 13.9 percent of the state’s registered voters were Hispanic as of October 2012, a number that had climbed to 14.2 percent by the end of 2013. If adjustments are made for the fact that the data is self-reported and doesn't include some voter registrations made years ago, the figure likely approaches 20 percent, but doesn't necessarily get all the way there.", "We rate this claim Half True.", "MSNBC, \"Rick Scott’s attempt to win the Latino vote,\" April 21, 2014", "Annette Taddeo-Goldstein, About Annette, Accessed April 24, 2014", "U.S. Census Quickfacts, Nationally and Florida, 2013", "Florida Department of State Division of Elections, General election county voter registration by race, Oct. 9, 2012", "PewResearch Hispanic Trends Project, \"Latino voters in the 2012 election,\" Nov. 7, 2012", "Univision, Florida Hispanic electorate data, November 2013", "Aristotle, Voter data lists, Accessed April 24, 2014", "NPG VAN, About us, Accessed April 25, 2014", "PolitiFact, \"Charlie Crist opposed in-state tuition for Dreamers in 2006, Republican Party of Florida says,\" April 11, 2014", "PolitiFact, \"Charlie Crist flip flops on the embargo,\" Feb. 11, 2014", "PolitiFact, \"Jeb Bush says Rick Scott won Florida Hispanic vote, bucking national trend,\" Feb. 15, 2010", "Miami Herald Naked Politics blog, \"Fernandez’s private email ripped Scott’s advisers,\" March 25, 2014", "Miami Herald Naked Politics blog, \"Who really won Florida’s Cuban vote? Analysts have conflicting results,\" Nov. 13, 2012", "Interview, Annette Taddeo-Goldstein, Miami-Dade Democratic chair, April 24, 2014", "Interview, Mark Hugo Lopez, director of Hispanic Research, April 24, 2014", "Interview, Susan MacManus, University of South Florida political science professor, April 24, 2014", "Interview, Dario Moreno, FIU political science professor and pollster, April 24, 2014", "Interview, Brittany Lesser, Florida Division of Elections spokeswoman, April 24, 2014", "Interview, Rosemary Mercedes, Univision spokeswoman, April 24, 2014", "Interview, Brandi Travis, Aristotle spokeswoman, April 24, 2014", "Interview, Amanda Bosquez, National Association of Latino Elected and Appointed Officials spokeswoman, April 24, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]