["About this rating", "Many social media users have expressed disbelief and dismay at a graphic indicating that the United States had been deemed \"one of the ten worst countries in the world to be a woman,\" rounding out a list headed by India, Afghanistan, Syria, Somalia, Saudi Arabia, Pakistan, Democratic Republic of Congo, Yemen, and Nigeria:", "The basis of the graphic was a 2018 survey compiled by the Thomson Reuters Foundation, the \"charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience.\"", "This item is therefore superficially \"true\" in the sense that it reflects the results of a genuine poll, but of course the significance of any particular survey or poll depends upon its methodology. In this case, Thomson Reuters polled 548 experts on women's issues by phone and in person between March 26 and May 4, 2018. The respondents were evenly spread across Europe, Africa, the Americas, South East Asia, South Asia, and the Pacific, and included \"aid professionals, academics, healthcare staff, non-government organisation workers, policy-makers, development specialists and social commentators.\"", "According to Thomson Reuters, \"the survey asked respondents which five of the 193 United Nations member states they thought were most dangerous for women and which country was worst in terms of healthcare, economic resources, cultural or traditional practices, sexual violence and harassment, non-sexual violence and human trafficking.\"", "Still, Americans (and others) were left puzzled by how the United States could rank so highly in such a survey, given that many of the phenomena that contributed to the other countries' being declared dangerous and unhealthy places for women — female infanticide, forced marriages, sex slavery, domestic servitude, death by stoning, civil war, restricted access to health care — have little to no prevalence in the U.S.", "The explanation offered by Thomson Reuters was that the influence of the #MeToo movement and the Time's Up campaign, which were running concurrently with the poll, influenced the results sufficiently to push the U.S. into the top 10:", "Experts said the surprise addition of the United States in the top 10 most dangerous countries for women came down to the #MeToo and Time's Up campaigns against sexual harassment and violence that have dominated headlines for months.", "\"People want to think income means you're protected from misogyny, and sadly that's not the case,\" said Cindy Southworth, executive vice president of the Washington-based National Network to End Domestic Violence.", "\"We are going to look back and see this as a very powerful tipping point ... We're blowing the lid off and saying '#Metoo and Time's Up'.\"", "Reuters.   \"Factbox: Which Are the World's 10 Most Dangerous Countries for Women?\"\r\n    25 June 2018.", "Goldsmith, Belinda and Meka Beresford.   \"India Most Dangerous Country for Women with Sexual Violence Rife.\"\r\n    Thomson Reuters Foundation.   26 June 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]