["By Saranac Hale Spencer", "Posted on November 14, 2017", "Q: Is the newly elected mayor of Hoboken, New Jersey, a Muslim and did he cancel “government involvement” in Christmas?", "A: No. Ravinder Bhalla is a Sikh, not a Muslim, and he hasn’t instituted such a ban. He won’t even take office until Jan. 1, 2018.", "Democratic Hoboken Councilman-at-Large Ravinder Bhalla is not Muslim. He actually became the first Sikh to win a mayoral election in New Jersey on Nov. 7", "But several websites have posted a fabricated story with the headline: “Muslim New Jersey Mayor Just Abolished Christmas ‘To Respect Other Religions.’”", "“Bhalla will officially take office on November 29, just in time for Christmas,” the story wrongly says. “But the wreath will not be hung nor will the carolers be singing with joy because Bhalla has cancelled all ‘government involvement in the Christian holiday Christmas’ out of respect for ‘other religions.’ ”", "Facebook users rightly flagged it as a potentially false story.", "There have been no attempts to change any of Hoboken’s planned Christmas activities, Juan Melli, the city’s spokesman, told FactCheck.org. As Bhalla won’t be sworn in as mayor until Jan. 1, 2018,  it’s not possible for him to enact changes for this holiday season.", "Christmas continues to be a holiday observed by the city, which is still holding its annual Christmas tree lighting ceremony and Holiday Crafts Fair at City Hall in early December. Santa Claus and Mrs. Claus will make appearances, too.", "The bogus story originated on a self-described satirical website called Reagan Was Right, which says in an “about” section on each page that “nothing on this site is real.”", "The picture of Bhalla that ran with the story on reaganwasright.com came from his Facebook page, where it was posted on Election Day with a message encouraging people to vote.", "However, the same article was posted a day later on beforeitsnews.com, which allows “contributors” to upload stories to its site as long as they are “factually true.” It was not labeled as satire on that site.", "The made-up story exploits a common misperception about Sikh men by referring to American-born Bhalla, who wears a peaked turban, as a Muslim.", "Sikhism is a monotheistic religion that was founded by Guru Nanak in the late 15th century in the Punjab region of India. It is not the same as the much older religion of Islam, followed by Muslims, that shares roots with Christianity and Judaism. For example, Sikhs believe in reincarnation, and Muslims believe in heaven and hell.", "Many Muslim men wear turbans, but not all men who wear them are Muslims.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Otterman, Sharon. “In a City of Firsts, Hoboken Elects a Sikh as Mayor.” New York Times. 8 Nov 2017.", "Bhalla, Ravinder. Law firm biography. FPSFlawfirm.com. Accessed 13 Nov 2017.", "Bhalla, Ravinder. City council biography. Hobokennj.gov. Accessed 13 Nov 2017.", "“Muslim New Jersey Mayor Just Abolished Christmas ‘To Respect Other Religions.'” Reaganwasright.com. 9 Nov 2017.", "“Muslim Sikh NJ Mayor Just Abolished Christmas ‘to Respect Other Religions’ (Video).” Beforeitsnews.com. 10 Nov 2017.", "Seattle Times. “Understanding Turbans.” Accessed 13 Nov 2017.", "Sanders, Eli. “Understanding turbans: Don’t link them to terrorism.” Seattle Times. 27 Sep 2001.", "McLeod, William Hewat. Sikhism. Encyclopaedia Britannica. Accessed 13 Nov 2017.", "Schimmel, Annemarie. Islam. Encyclopaedia Britannica. Accessed 13 Nov 2017.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]