["“JUST IN: Policeman Caught Red-handed Raping COVID-19 Patient In Quarantine Centre,” reads the caption in this Facebook post published by NG News Reporters alongside the image. Almost 400,000 people have seen the post since July 18, 2020, according to data provided by the social network.", "NG News Reporters has a history of sharing misinformation. AFP Fact Check recently debunked one of its posts here.", "The rape claim does not state where the incident took place. The comments below the post suggest some Facebook users actually believe the image depicts a police officer who raped a COVID-19 patient at a quarantine centre in Nigeria. Others were sceptical or even dismissive.", "Using online monitoring tool CrowdTangle, AFP Fact Check found that the claim was first published in this article by Nigerian news site IgbereTV, which states the incident happened in Kenya but is unclear on whether it was rape or consensual intercourse", "The image was also shared elsewhere on Facebook alongside a similar claim.", "Photo from 2014", "The photo has been used in the wrong context and is unrelated to the novel coronavirus pandemic.", "A reverse image search for the image led to numerous online articles, including this earliest version published on October 14, 2014. “Woman caught by Husband in Hotel Room with Young Lover,” reads the headline.", "It alleges that a woman and her student lover were discovered in a hotel room by her husband.", "While the claim is false, there have been reports of a rape incident in Kenya involving a prison warder.", "Kenyan daily newspaper Daily Nation reported that the prison guard was arrested for allegedly raping a female COVID-19 patient at an isolation centre in Busia, the capital city of Busia county.", "More than 15 million people have been infected with COVID-19 since the first case of the disease caused by novel coronavirus was reported in the Chinese city of Wuhan in late 2019. Since then, the death toll of the highly infectious disease has risen to more than 626,000 as of July 23, 2020, according to an AFP tally.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]