["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President-elect Joe Biden participates in a meeting with the National Governors Association's executive committee Nov. 19, 2020, in Wilmington, Del. (AP)", "• Biden said in August that he would “listen to the scientists” and enact a lockdown if advised, but he later said he didn’t think a nationwide economic shutdown would be necessary.", "• Since the election, two members of Biden’s newly formed COVID-19 task force said the group does not support nationwide lockdowns.", "• After Paul’s statement, Biden said more definitively on Nov. 19 that there would be “no national shutdown.”", "With coronavirus cases surging again in the United States, all eyes are on President-elect Joe Biden, who vowed to change the course of the country’s pandemic response.", "Biden has promised more vigorous steps than the Trump administration took to mandate wearing masks, improve access to testing and heed scientists’ advice on preventing infection. But former U.S. Rep. Ron Paul declared that Biden’s plans also include a nationwide lockdown, despite recent statements from Biden and his team that it’s not his preferred plan.", "In a Nov. 5 Tweet that became a viral Instagram post, Paul said, \"20 million Americans are collecting unemployment, and Biden wants a nationwide lockdown to combat a virus that has a 99%+ survival rate?\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Paul is a libertarian and former physician who represented a Houston-area district in Congress. His tweet mostly gets the numbers right regarding unemployment aid and the COVID-19 survival rate, with the caveat that the survival rate does not include those over age 70. But for this check, we focus on the claim about Biden’s view on a national lockdown similar to the stay-at-home orders and business closures that many local and state governments have enacted.", "Recent statements from Biden and his advisers have created some confusion about his position on a U.S. lockdown:", "In an August interview with ABC’s David Muir, Biden was asked whether he would shut the country down to stop the spread of COVID-19 if scientists recommended it. Biden said, \"I would shut it down; I would listen to the scientists.\"", "In early September, Biden said, \"There's going to be no need, in my view, to be able to shut down the whole economy. I got asked by David Muir a question, if I was asked to shut everything down. I took that as a generic question if — ‘Am I going to follow the science?’\"", "On Oct. 31, Biden tweeted: \"I'm not going to shut down the country. I'm not going to shut down the economy. I'm going to shut down the virus.\"", "On Nov. 12, as cases began surging nationwide, Michael Osterholm, a member of Biden’s newly formed COVID-19 task force, said he believed locking down the country for four to six weeks could help to slow the spread. Osterholm later clarified that his comments did not represent the views of Biden’s advisory team and had not been vetted by them.", "After Osterholm’s clarification, a Biden transition official said Nov. 13 that a shutdown \"is not in line with the president-elect’s thinking,\" according to NBC News.", "The same day, Dr. Celine Gounder, another member of Biden’s COVID-19 task force, said that it is \"not the opinion\" of the group to enact a nationwide lockdown, according to CNBC. She said the task force would prefer a geographically targeted approach to closures and shutdowns.", "Misinformation also muddied the waters: Viral posts circulated in October that falsely claimed Biden pledged to lock down the nation until a vaccine is available. Reuters and other fact-checkers found no evidence that Biden said that.", "Daniel McAdams, executive director of the Ron Paul Institute for Peace and Prosperity, said the basis for Paul’s tweet was Biden’s response to Muir in the August ABC interview, when Biden said, \"I would shut it down; I would listen to the scientists.\"", "But Biden qualified his answer by saying he would take the advice of scientists — he did not explicitly say in that interview that he \"wanted\" a shutdown, as Paul claimed. And by the time of Paul’s Nov. 15 tweet, Biden and his advisers had provided more context on their current views about a national lockdown.", "Biden’s most definitive statement came on Nov. 19, a few days after Paul’s claim. \"I am not going to shut down the economy, period,\" he said in a news conference after a meeting with governors. \"I’m going to shut down the virus, that’s what I’m going to shut down. I’ll say it again: No national shutdown. No national shutdown. Because every region, every area, every community can be different. And so there’s no circumstance which I can see that would require a total national shutdown. I think that would be counterproductive.\"", "In a tweet that became a viral Instagram post, Paul said, \"Biden wants a nationwide lockdown to combat a virus that has a 99%+ survival rate?\"", "Paul’s post mischaracterized Biden’s position at that time, and Biden has further clarified it since.", "Biden said in August that he would support a national lockdown if scientists determined it was necessary to curb the disease.", "In October, he said he would not shut down the country or economy. And after the election —  before Paul made his claim — Biden and members of his COVID-19 task force indicated again that a nationwide shutdown is not part of their plans. Biden has come out even more forcefully against the prospect of a nationwide shutdown since Paul published his tweet.", "While Biden’s earlier comments suggest he is open to seeking a lockdown if it’s warranted, he and his team have made it clear that they neither intend nor want to impose a national shutdown, as Paul claims.", "We rate this claim False.", "ABC News, Twitter post, Aug. 22, 2020", "Associated Press, \"Biden faces tough choice of whether to back virus lockdowns,\" Nov. 15, 2020", "CNBC, \"President-elect Joe Biden’s COVID advisors nix idea of U.S. lockdown to curb pandemic,\" Nov. 13, 2020", "CNN, \"CDC says Covid-19 death rate is under 1% for everyone but people over 70,\" Sept. 16, 2020", "CNN, \"How Biden plans to change the US pandemic response,\" Nov. 9, 2020", "Department of Labor, \"Unemployment insurance weekly claims,\" Nov. 19, 2020", "Instagram post, Nov. 16, 2020", "Joe Biden, YouTube (minute 30:54), Sept. 2, 2020", "Reuters, \"Fact check: Biden did not say that if elected he will lock down the country until everyone is vaccinated against COVID-19,\" Oct. 22, 2020", "Twitter post, Oct. 31, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]