["By D'Angelo Gore", "Posted on September 2, 2020", "Q: Does a video shared on social media show Joe Biden sleeping during a live television interview?", "A: No. The video was manipulated to make it appear that he had fallen asleep.", "Is the video of Joe Biden falling asleep during an interview manipulated or did it really happen?", "A doctored video of Democratic presidential nominee Joe Biden appearing to fall asleep during a TV interview has been viewed millions of times online. It was even shared on Twitter Aug. 30 by Dan Scavino, the White House deputy chief of staff for communications.", "In the manipulated video, Biden’s eyes appear to be closed as a news anchor says, “Wake up. Wake up. Wake up.” The sound of snoring also was added to the clip.", "But the video was created by splicing together two separate videos. The chyron that says “ON AIR: JOE BIDEN | THE IMPORTANCE OF THIS ELECTION” was made-up too.", "The video of the news anchor, Leyla Santiago, comes from a 2011 segment during a local news show in California. She was trying to interview entertainer and activist Harry Belafonte, who was reportedly meditating and couldn’t hear her due to audio issues. That’s why she can be heard saying in the manipulated video, “This is your wake-up call, Harry.”", "The video of Biden comes from a virtual town hall he did with former Secretary of State Hillary Clinton in April. The manipulated version uses a moment from that event when Biden appears to be looking down.", "Snopes.com found that Twitter user @damonimani took credit for mixing the two videos together and adding the sound effects.", "Twitter later labeled the altered interview video as “manipulated media,” and has since removed it in response to a claim filed by a copyright holder. The version that Scavino shared from his personal Twitter account was watched 2.4 million times.", "Trump campaign Communications Director Tim Murtaugh told the Washington Post Fact Checker: “This was a retweet of someone else’s video, and it was quite obviously a parody. It is sad that there is actual concern that people could mistake it for the real thing, though.”", "People did mistake it or question whether it could be real, as evidenced by the multiple questions we received about the video from our readers.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Twitter. “A 2011 video of Harry Belafonte apparently falling asleep was doctored to falsely depict Joe Biden.” 31 Aug 2020.", "KBAK- KBFX – Eyewitness News -BakersfieldNow. “Official Station Video: Is Harry Belafonte asleep during live TV interview?” YouTube Video. 18 Oct 2011.", "Castillo, Michelle. “Harry Belafonte: I wasn’t sleeping during interview.” CBS News. 18 Oct 2011.", "Joe Biden. “Women’s Town Hall on COVID-19 ft. Hillary Clinton | Joe Biden For President.” YouTube video. 28 Apr 2020.", "Evon, Dan. “Does This Video Show Biden Falling Asleep in an Interview?” Snopes.com. 31 Aug 2020.", "Samuels, Elyse. “White House social media director tweets manipulated video of Biden.” Washington Post Fact Checker. 2 Sep 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]