["About this rating", "Economists and policy makers have argued that a \"balanced budget amendment” to the United States Constitution, like the one representatives voted on in April 2018, could serve to deplete a Social Security surplus that was generated during the 1990s and early 2000s (or hasten its depletion).", "The vote concerned one attempt to pass a \"balanced budget\" amendment; the bill did not expressly open the Social Security trust money for other government spending and fell well short of the two-thirds majority it needed to pass.", "For years, politicians and economists have debated the merits of a theoretical legal requirement that the U.S. federal government “spend within its means.” The idea, championed by groups like the conservative Heritage Foundation, has been a part of the nation’s public discourse since its founding.", "The issue was raised during a 12 April 2018 vote on a bill introduced by Rep. Robert Goodlatte, a Republican from Virginia who argued:", "The only way to ensure that Congress acts with fiscal restraint over the long term is to pass a balanced budget amendment.  Experience has proved time and again that Congress cannot for any significant length of time rein in excessive spending.  Annual deficits and the resulting debt continue to grow due to political pressures that the Constitution’s structure no longer serves to restrain.", "Politicians from both sides of the aisle have argued that this specific move was a cynical attempt at presenting an appearance of concern over the national debt, following a disastrous report from the Congressional Budget Office revealing that the tax cuts signed into law by President Donald Trump could add as much as $1.9 trillion to the national deficit by 2028.", "Mo Brooks, a Republican from Alabama who voted in favor of the amendment, told the New York Times that despite his vote, the act was \"an effort to fool the American people into believing that this Congress is financially responsible when quite clearly, based on the votes of the past year, it is wholly and completely irresponsible.\" The bill received 233 votes, short of the two-thirds majority it required.", "In response to this failed vote, a group named \"Social Security Works\" published a press release (\"Legislation That Would Surreptitiously Steal Social Security’s $2.9 Trillion Surplus Has Been Defeated – But 97% of Republicans Voted For It\") framing the vote as evidence of Republican (and some Democratic) willingness to endanger a surplus of money reserved for future Social Security beneficiaries:", "Social Security currently has a $2.9 trillion accumulated surplus, which was intentionally built up over decades to cover the retirement of the Baby Boom generation. In the guise of a so-called balanced budget amendment, 233 members of the House of Representatives just voted to pretend that the accumulated surplus does not exist.", "That’s because the so-called Balanced Budget Amendment would ignore the past Social Security contributions and instead require all federal spending – including Social Security spending – to be offset by revenues collected in that same year. That means that Social Security would not be allowed to use its own $2.9 trillion surplus to pay out benefits.", "Though this statement was released on 12 April 2018 — the day of the vote —  prominent liberal Facebook pages have periodically reshared the release as \"new,\"  causing additional waves of web virality — most recently in June 2018. The argument that a balanced budget amendment could endanger Social Security stems from its overarching goal of having expenditures match revenues each year, as argued by the progressive think tank the Center on Budget and Policy Priorities:", "A balanced budget amendment would [require] that federal expenditures in any year [...] be offset by revenues collected in that same year. Social Security could not draw down the balances it has accumulated in previous years to pay benefits in a later year but, instead, could be forced to cut benefits even if it had ample balances in its trust funds; currently, those balances approach $2.9 trillion.", "Marc Goldwein, a senior vice president and senior policy director for the nonpartisan Committee for a Responsible Federal Budget, another Washington, D.C. think tank dedicated to budgetary issues, told us that he understands why one would make Social Security Works' argument, but that it is largely sensationalized and ignores the bigger problems facing Social Security and the federal deficit:", "The point that Social Security Works is making is that Social Security ran a surplus in 90s and early 2000s so they are sort of owed money from the rest of government. [...] The balanced budget framework that doesn’t mean that Social Security would need to be cut per se, it could just as easily mean that the rest of the government would have to run surplus to basically pay back the borrowing it did from Social Security. [...]", "\"If you were to have a balanced budget amendment pass, that means we effectively would have to cut deficits pretty quickly by a trillion dollars, and Social Security is the largest government spending program so it’s not unlikely that policymakers would look to [it] for some of those savings,\" Goldwein told us. But, he said, that argument misses the larger point that the Social Security trust is currently projected to be insolvent by the year 2034, regardless of any amendment:", "In some ways [the Social Security issue] is immaterial for a long-term balanced budget act because Social Security has its own sort of balanced budget rule: Social Security can not spend more than it brings in plus whatever is in the trust fund.  So by 2034, according to the [Social Security] trustees, it will have to cut its benefits.", "The Center on Budget and Policy Priorities argues that the Goodlatte bill, if it had passed, would have limited the government’s ability to restore solvency to Social Security, as well:", "Banning tax increases means that taxes can be cut whenever the budget is in surplus but can’t be raised even when the budget falls into deficit.  [This] could also lead to a constant ratcheting down of revenues, even though it will be advisable to raise revenues in the years ahead to help cover the increasing costs of an aging population.", "Consider, for example, a proposal to restore 75-year solvency to the Social Security trust fund in part by raising the Social Security payroll tax cap.  Such a proposal would also reduce overall federal deficits.  But such a bill would be unconstitutional under [Goodlatte’s BBA]  simply because it raised revenues.  Instead, Social Security benefits would have to be cut substantially (with no revenue increases) to make the trust fund whole; over 75 years, benefits would have to be cut by an average of 17 percent, according to the program’s trustees.", "Both the CBPP and the CRFB regard balanced budget amendments as a poor solution to the complex and growing problem of the United States debt, even if they view the potential ramifications of such an amendment about to Social Security in different ways.", "However, claims made by Social Security Works that politicians voted on the balanced budget amendment with the express intent to use Social Security to cover the national debt are largely false, as this was not the intent of the amendment; the amendment’s effect on Social Security is not as clearly defined as the press release states. It is true, however, that 233 representatives in Congress voted in favor of the most recent attempt at a balanced budget amendment.", "The Heritage Foundation.   \"Blueprint for Balance: A Federal Budget for FY 2019.\"\r\n    19 June 2018.", "Congress.gov.   \"H.J.Res.2 - Proposing a Balanced Budget Amendment to the Constitution of the United States.\"\r\n    Accessed 25 June 2018.", "Bob Goodlatte (House Website).   \"Goodlatte Speaks in Support of Balanced Budget Amendment.\"\r\n    12 April 2018.", "Kogan, Richard.   “Constitutional Balanced Budget Amendment Poses Serious Risks.”\r\n    Center on Budget and Policy Priorities.   16 March 2018.", "Kaplan, Thomas.   “As Deficits Mount, Amendment to Require Balanced Budgets Fails in House.”\r\n    New York Times.   12 April 2018.", "Social Security Works.   \"Legislation That Would Surreptitiously Steal Social Security’s $2.9 Trillion Surplus Has Been Defeated – But 97% of Republicans Voted For It.\"\r\n    12 April 2018.", "Social Security Administration.   \"Status Of The Social Security And Medicare Programs: A Summary of the 2018 Annual Reports.\"\r\n    2018.", "Committee for a Responsible Federal Budget..   \"Letter to Members of Congress on Statutory Budget Deadline.\"\r\n    12 April 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]