["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This Nov. 6, 2008 file photo shows a customer entering a Payroll Advance location in Cincinnati, Ohio. (AP)", "Though consumer advocates have long called for changing the payday lending law in Ohio, a criminal investigation has resulted in the resignation of the state House speaker.", "Republican Cliff Rosenberger resigned in April as the FBI was investigating his foreign travel sponsored by payday-lending lobbyists. He denied wrongdoing.", "Rosenberger’s resignation brought votes on legislation screeching to a halt, including a proposed bill to strengthen consumer protections for payday loans. Consumer advocates are collecting signatures to put similar language before voters on the ballot, likely in 2019. The Ohio Consumer Lenders Association, which represents the industry, opposes the measures.", "Richard Cordray, the Democrat running for governor against Republican Mike DeWine, has criticized the state law.", "\"The current shutdown of the State House has delayed legislation addressing payday lending, where Ohio's laws are now the worst in the nation,\" Cordray tweeted May 17. \"Things have gotten so bad that it is legal to charge 594 percent interest on loans that end up ruining people’s lives. Unconscionable.\"", "Cordray’s statement comparing Ohio’s payday industry to the nation comes from a 2014 report by Pew Charitable Trusts.", "Cordray worked on changing rules on payday lending on a national level when he was the first director of the federal Consumer Finance Protection Bureau. The bureau finalized rules on payday lending in October 2017, several weeks before he resigned to run for governor. Cordray has attacked his successor, Mick Mulvaney, for attempting to roll back the rules.", "Payday loans are small, short-term loans that borrowers promise to repay out of their next paycheck at a high rate of interest. About three dozen states have their own payday laws, including Ohio.", "Proponents argue that the working poor need payday loans to cover their bills, while opponents argue that they trap borrowers in a cycle of debt. About one in 10 adults in Ohio have taken out a payday loan.", "In 2008, Ohio lawmakers approved the Short Term Loan Act. The law, opposed by the industry, included protections for borrowers, such as capping the loan at $500 and the annual interest rates for payday loans at 28 percent.", "However, payday lenders found a loophole: They registered as mortgage lenders instead. The Ohio Supreme Court upheld the law in 2014, prompting one concurring judge to ask, \"Were the lobbyists smarter than the legislators? Did the legislators realize that the bill was smoke and mirrors and would accomplish nothing?\"", "Ohio is the only state where lenders operate under such a statute that was not intended for payday loans, said Alex Horowitz, senior research officer for Pew Charitable Trust's consumer finance project, which has researched payday laws in the states for many years.", "In a 2014 analysis of states’ payday lending laws, Pew didn’t flat-out label Ohio as the worst in the nation for payday lending. But it did find that borrowers were charged much more than their peers in many other states.", "By examining payday loan prices in each state from the four largest lenders, Pew found that over five months a $300 payday loan would cost an Ohio borrower $680 in interest and fees, which equals an average annual percentage rate of 591 percent (which is close to the 594 percent figure cited by Cordray.) No other state had a higher rate, according to the Pew analysis. The interest and fees amount in Ohio was slightly exceeded by Texas, but Texas has more protections for consumers, including a 180-day loan limit that Ohio doesn’t have.", "While the typical loan is technically two weeks, in the majority of cases the borrower ends up in a cycle of loans for several months.", "While most states that allow payday lending cap loans at $500, Ohio lenders don’t operate under the Short Term Loan Act, so they can make loans that are double or even triple the amount of conventional payday loans.", "The Center for Responsible Lending, an organization that calls for more safeguards for consumers, found in 2015 that payday loan storefronts in Ohio advertised rates of more than 600 percent annual percentage rate. Diane Standaert, director of state policy, said that since that time some storefronts now reflect rates between 300 and 400 percent for some loans.", "\"But this is basically comparing the differences between (1) a very bad loan, and (2) another very bad loan,\" she said.", "The effort to change Ohio’s payday lending law gained steam in March 2017 when House Bill 123 was introduced by State Reps. Kyle Koehler, a Republican of Springfield, and Michael Ashford, a Toledo Democrat. The bill is similar to Colorado’s payday lending law which consumer advocates have upheld as a model example.", "After languishing for a year, it passed a House committee in April 2018 about a week after Rosenberger resigned, but a full vote was placed on hold while lawmakers deadlocked over picking a new speaker. On June 7, the House passed the bill and it now heads to the Senate. The bill would cap the interest rate at 28 percent and a fee of up to $20 a month, which would mean that a borrower of $300 would pay $96 in interest and fees.", "Cordray said, \"Ohio's (payday lending) laws are now the worst in the nation. Things have gotten so bad that it is legal to charge 594 percent interest on loans.\"", "Pew Charitable Trusts found in 2014 that over five months a $300 payday loan would cost an Ohio borrower $680 in interest and fees, which equals an average annual percentage rate of 591 percent. While the report didn’t call out Ohio as the \"worst in the nation,\" no other state had a rate that was higher, according to the report.", "The difference between the 591 percent cited in the report and the 594 percent tweeted by Cordray is negligible.", "We rate this statement True.", "'", "Richard Cordray, Tweet, May 17, 2018", "Ohio Legislature, House Bill 123, Introduced March 2017", "Pew Charitable Trusts, \"How State Rate Limits Affect Payday Loan Prices,\" April 2014", "Pew Charitable Trusts, \"Ohio Has the Highest Payday Loan Prices in the Nation,\" Dec. 16, 2016", "Center for Responsible Lending, \"The Buckeye Burden: An Analysis of Payday and Car Title Lending in Ohio,\" November 2015", "Ohio Supreme Court, OHIO NEIGHBORHOOD FINANCE, INC., D.B.A. CASHLAND, APPELLANT, v. SCOTT, APPELLEE. 2014", "Cleveland Plain Dealer op ed by State Rep. Kyle Koehler, \"Payday lenders spread misleading information so they can keep profits,\" June 3, 2018", "Dayton Daily News, \"Payday lending crackdown stalls in Ohio House,\" April 19, 2018", "Cleveland Plain Dealer, \"Groups gear up for a fight as agency tries to apply brakes to payday loans,\" (Accessed in Nexis) April 3, 2016", "Cleveland Plain Dealer, \"Payday lending bill clears House panel after stalling a year Ohio legislature,\" April 19, 2018", "Cleveland Plain Dealer, \"Lawmaker disputes payday lenders’ claim on bill Legislature,\" (Accessed in Nexis) May 26, 2018", "Cleveland Plain Dealer, \"Ohio payday loan amendment supporters get OK to collect signatures,\" May 29, 2018", "Columbus Dispatch, \"STATEHOUSE; Payday-loan law changes slow to gel,\" (Accessed in Nexis) Nov. 30, 2017", "Dayton Daily News, \"Cordray clamps down on payday lenders,\" (Accessed in Nexis) Oct. 9, 2017", "Columbus Dispatch, \"After law fails, new bill hopes to limit rates,\" March 19, 2017", "PolitiFact Florida, \"Patrick Murphy praises Florida's payday law as 'stronger than almost any other state,\" April 6, 2016", "Interview, Lacey Rose, Richard Cordray spokeswoman, May 29, 2018", "Interview, Alex Horowitz, senior research officer for Pew's consumer finance project, May 31, 2018", "Interview, Benny Martinez, Pew charitable trusts spokesman, May 31, 2018", "Interview, Patrick Crowley, Partner, Strategic Advisers, LLC on behalf of Ohio Consumer Lenders Association, May 30, 2018", "Interview, Diane Standaert, Center for Responsible Lending director of state policy, May 31, 2018", "Interview, Katherine M. Caprez Legislative Aide, Rep. Kyle Koehler Ohio House of Representatives, District 79, June 1, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]