["About this rating", "A village just north of Chicago, Illinois, began garnering media attention in April 2018 for an ordinance passed by local leaders banning high-capacity firearms and magazines, with hefty fines for violators.", "The ban, which was passed by the Deerfield village board on 2 April 2018, applies to assault weapons only, which are defined in the ordinance as \"a semiautomatic rifle, pistol, or shotgun that has the capacity to accept more than ten rounds of ammunition plus another feature(s) defined in the ordinance.\"", "The list of weapons covered under the ordinance includes AR-15 rifles, which have been used to commit several mass shootings around the United States, including the February 2018 mass shooting in Parkland, Florida in which a gunman killed seventeen people,  spurring a series of protests around the world.", "However, a Lake County Circuit Court judge issued a temporary restraining order on 12 June 2018 preventing the measure from being enforced, a day before it was slated to take effect.", "The measure includes fines of \"no less than $250 and not more than $1,000\" per day for people found to be in violation of the ordinance. However, village employees as well as law enforcement officers and \"the organized militia of this or any other state\" are exempt from having to abide by it. Owners of \"antique firearms manufactured in or before 1898\" are also exempt if their weapons are safely stored or displayed.", "The village, which is located around 25 miles from Chicago, also released a statement addressing questions about the ordinance, including how it will be enforced:", "Weapons being illegally possessed will be confiscated as authorized by the ordinance. Any other enforcement of this ordinance, including search or seizure to effect this ordinance, must comply with the requirements of State and Federal law. Members of the Department will not go \"door to door\" to ensure compliance.", "The ban was passed unanimously by the village's board of trustees. Two days later, the Institute for Legislative Action — the lobbying arm of the National Rifle Association — announced that they would support a lawsuit filed by another group, Guns Save Life, challenging the ordinance.", "At this moment a court hearing is scheduled for 8 June 2018, with gun advocacy groups seeking a temporary restraining order to halt enforcement of the ban:", "Gun-rights advocacy groups are asking a Lake County Circuit Court judge to bar the village of Deerfield from enforcing its ban on assault weapons that is set to kick in June 13.", "The ordinance enacted April 2 by the Deerfield Village Board gives residents until June 13 to turn in any guns that fit the village’s definition of assault weapons, remove them from the village or modify the guns so they’re no longer considered assault weapons. The ordinance empowers the town’s police chief to confiscate the assault weapons of anyone charged under the ordinance.", "Two lawsuits were filed in April challenging the ordinance on various grounds, including a claim that the ordinance deprives gun owners of property they are legally entitled to possess. The plaintiffs in both lawsuits are asking for a temporary restraining order to block Deerfield from enforcing the ban until the court can hear their arguments for a permanent injunction.", "A hearing to consider the restraining order motions is set for June 8, just days before the ban is set to take effect.", "The Deerville measure was reportedly based on a similar ordinance passed in another suburb, Highland Park, in 2013. That ordinance was upheld by the 7th U.S. Circuit Court of Appeals, and in December 2015 the Supreme Court opted not to take up a case challenging the appeals court's decision.", "Drabold, Will and Fitzpatrick, Alex. \"The Florida School Shooter Used An AR-15 Rifle. Here's What to Know About the Gun.\"\r\n    Time. 15 February 2018.", "Village of Deerfield. \"Village Board Passes Assault Weapons Ban.\"\r\n    2 April 2018.", "Village of Deerfield. \"Village of Deerfield Assault Weapons Ban FAQ – Frequently Asked Questions.\"", "Meadows, Jonah. \"Deerfield Bans Assault Weapons, High-Capacity Magazines.\"\r\n    Deerfield Patch. 3 April 2018.", "National Rifle Association Institute for Legislative Action. \"NRA to support Guns Save Life in Illinois Lawsuit.\"\r\n    4 April 2018.", "Sadin, Steve. \"Deerfield Bans Assault Weapons and High-Capacity Magazines.\"\r\n    Pioneer Press, accessed via chicagotribune.com. 3 April 2018.", "Glanton, Dahleen and Berkowitz, Karen. \"Supreme Court Rejection of Gun Case Considered a Victory by Highland Park.\"\r\n    Chicago Tribune. 7 December 2015.", "Berkowitz, Karen.   \"Gun Groups Want a Restraining Order Against Deerfield's Assault Weapons Ban Before It Takes Effect in 2 Weeks.\"\r\n    Chicago Tribune.   1 June 2018.", "Berkowitz, Karen. \"Judge Temporarily Blocks Deerfield Assault Weapons Ban, Which Was to Take Effect Today.\"\r\n    Deerfield Review. 13 June 2018.", "13 June 2018, 1:48 P.M.: Updated by noting a temporary restraining order issued by a judge preventing the measure to take effect.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]