["About this rating", "Gas prices have long been a subject of fake photos, old email forwards, and even political discussion. In October 2020, just as Election Day was approaching with the contest between U.S. President Donald Trump and former Vice President Joe Biden, memes showing photographs of Exxon gas station signs were shared thousands of times on Facebook. Pricing on the signs showed figures of $5.39 and $5.49 per gallon for regular, unleaded gasoline.", "A post sharing one of the memes read: \"Remember the good old days when Barrack and Joe were in charge??? Let me refresh your memory.\" It also included the words: \"Just a reminder of what things looked like the last time Biden was in the White House.\"", "One commenter responded: \"Yes I remember!!\"", "Another had similar wording: \"Just a friendly reminder of how things were, the last time Biden held office.\"", "These memes were grossly misleading.", "Both photos appeared to show prices in the spring of 2012 at one gas station in Washington D.C., located at 2708 Virginia Ave. NW, an area normally congested with both foot and vehicle traffic. The gas station is less than a mile from the National Mall, Lincoln Memorial, and Vietnam Veterans Memorial. In fact, the gas station (now a Valero) is located right next to the Watergate buildings. A Getty Images caption for one of the images reads: \"According to AAA the average price of gas has climbed three tenths of a cent nationwide as a result of high oil prices and tensions tied to Iran's nuclear program.\"", "In March 2012, the same month the second image was photographed, The Washington Post reported: \"According to AAA’s national survey of gas prices, a gallon of regular-grade fuel is averaging $4.15 in the District. The average price was about $3.85 a gallon a month ago.\" The Washington Post also wrote: \"The District is topped by only four states where gas averages more than $4 a gallon. Its prices are surpassed by those in Illinois, Alaska, California and Hawaii, where the average is $4.54 a gallon.\"", "However, according to the U.S. Energy Information Administration, the national gas price average over the eight years that Obama and Biden were in office was $2.96 per gallon for regular, unleaded gasoline. By comparison, the same data showed that the previous eight years under President George W. Bush saw an average of $2.13 per gallon. Under Trump's first term through October 2020, the comparative price was $2.53.", "The memes contain the words \"the last time Biden held office\" and \"the last time Biden was in the White House.\" In December 2016 —  the last full month that Obama and Biden were in office — regular, unleaded gasoline prices averaged $2.25 per gallon nationally.", "In the same March 2012 story from The Washington Post, more information about \"uncertainty\" in the Middle East was reported:", "There may be hope on the horizon: The price of crude oil, a major driver of gas prices, has held steady this month after escalating over the winter because of uncertainty in the Middle East.", "According to a survey published by Lundberg, an independent market research group, this could help steady U.S. gas prices later this spring and summer.", "But other oil analysts caution that further price rises are possible if turbulence grows in the Middle East or if the economy heats up and oil supplies fall.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]