["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Mitt Romney may have hit a rough patch on the campaign trail, but Gov. Chris Christie recently suggested a winning debate performance this week could propel the Republican presidential candidate to victory in November.", "Just like the 1980 debate took Ronald Reagan from trailing in the polls to winning 40 states on Election Day, the governor said.", "The New Jersey governor offered that history lesson last week as Romney and President Barack Obama gear up for their first debate Wednesday. Obama has been leading Romney in most national polls.", "\"Ask Ronald Reagan if he were around, you know, who was behind in the polls in 1980 going into the debate with Jimmy Carter and then turned around 10 days later and won 40 states,\" Christie, a Republican, said at a Sept. 24 news conference. \"These debates matter. They’re very important.\"\n\nIt’s true that Reagan won 44 states in the 1980 election, but it’s not entirely accurate for Christie to say Reagan \"was behind in the polls\" going into the debate with Carter.\n\nLeading up to that Oct. 28, 1980 debate -- a week before Election Day -- some polls showed Carter with a slight advantage over Reagan, but other polls had Reagan ahead of the president. Still, given the margins of error attached to the polls, the race appeared too close to call, according to various news articles.\n\nThe governor’s office did not respond to two e-mails seeking comment.\n\nLet’s review some of those poll results.\n\nIn a Gallup poll released the day before the debate, Carter was leading Reagan by three percentage points, 45 percent to 42 percent. That poll was based on a sample of 1,100 registered voters, including 800 likely voters.\n\nAnother poll done for ABC News and released around the same time offered the exact opposite results: Reagan stood at 45 percent and Carter at 42 percent among likely voters.\n\nBut news articles said that because of the margins of error for those two polls, the \"race is essentially even\" and a \"virtual dead heat.\"\n\nAn Associated Press-NBC News poll around the same time showed Reagan with a greater lead over Carter. Among likely voters, 42 percent supported Reagan and 36 percent backed Carter. That poll still had a margin of error of three percent.\n\n\"Generally, comparable results from all these polls fall within the error margins of such surveys, meaning the race is really too close to call,\" the Associated Press wrote.\n\nThe week before the debate, a CBS News/New York Times poll showed Carter leading Reagan, 43 percent to 41 percent among undecided voters. But given that poll’s sampling error, \"Mr. Carter’s lead thus was highly uncertain, and it is quite possible that Mr. Reagan may actually be somewhat ahead,\" according to a New York Times article.\n\nStill, Reagan’s debate performance has been considered a deciding factor in his ultimate victory.\n\n\"It is my contention that there was significant change in presidential preference by the public starting with the Carter/Reagan debate that accelerated through election day,\" Warren J. Mitofsky, a pollster for CBS News, later wrote.\n\nHowever, leading up to Election Day, polls failed to capture the scope of Reagan's landslide win. As Mitofsky noted, all of the major published polls \"seriously understated\" Reagan’s margin of victory over Carter.\n\nIn terms of the popular vote, Reagan received about 51.6 percent, beating Carter’s roughly 41.7 percent. The 1980 presidential race also included Independent candidate John B. Anderson, who received about 6.7 percent of the popular vote.\n\nOur ruling\n\nAt a news conference, Christie claimed Ronald Reagan \"was behind in the polls in 1980 going into the debate with Jimmy Carter and then turned around 10 days later and won 40 states.\"\n\nReagan went on to win 44 states, but it was not necessarily the comeback victory described by Christie. Reagan was behind in some polls and ahead of Carter in others. Given the margins of error for the polls, the race was \"too close to call\" and a \"virtual dead heat,\" articles show.\n\nWe rate the statement Half True.", "https://www.sharethefacts.co/share/d6c098aa-df49-433a-b170-7f608ecd3b96", "To comment on this ruling, go to NJ.com.", "The Star-Ledger, Mitt Romney 'had a bad week,' Gov. Christie says in wake of 'victims' comments, Sept. 24, 2012\n\nThe Washington Post, Reagan's \"Comeback\", Oct. 13, 2008\n\nThe New York Times, History Suggests McCain Faces an Uphill Battle, Oct. 12, 2008\n\nAmerican Statistical Association, The 1980 pre-election polls: A review of disparate methods and results, 1981\n\nThe Monkey Cage, What Really Happened in the 1980 Presidential Campaign, Aug. 9, 2012\n\nSlate, The Myth of Jimmy Carter's \"Eight-Point Lead\" Over Reagan, Sept. 24, 2012\n\nThe New Republic, Exploding the Reagan 1980 Comeback Myth, Sept. 12, 2012\n\nGallup, U.S. Presidential Election Center, accessed Sept. 24, 2012\n\nUnited Press International, Preview story on Reagan-Carter debate, Oct. 28, 1980\n\nThe Washington Post, Carter Goes Into Debate With Lead in New Poll, Oct. 28, 1980\n\nAssociated Press, Carter, Reagan: Face-to-Face at Last, Oct. 28, 1980\n\nAssociated Press, Election Poll Says Quarter of Likely Voters Haven't Made Up Their Minds, Oct. 28, 1980\n\nAssociated Press, New Polls Show Tight Race; Debate Site Is Readied, Oct. 27, 1980\n\nAssociated Press, Poll Shows Carter and Reagan in Virtual Dead Heat, Oct. 25, 1980\n\nAssociated Press, Story on Associated Press-NBC News poll, Oct. 27, 1980\n\nAssociated Press, ABC News-Lou Harris Poll Says Presidential Race Dead Heat, Oct. 27, 1980\n\nAssociated Press, Story on Reagan-Carter polls, Oct. 22, 1980\n\nU.S. National Archives and Records Administration, Historical Election Results: Electoral Votes, by State, accessed Sept. 26-27, 2012\n\nThe New York Times, Poll shows President has pulled to even position with Reagan, Oct. 23, 1980\n\nThe Washington Post, Candidate Reagan: Always Underrated By His Opposition; Reagan's Races: Jokes in the Bar, Votes in the Booth, Nov. 6, 1980\n\nThe New York Times, Carter Post-Mortem: Debate Hurt But Wasn’t Only Cause For Defeat, Nov. 9, 1980\n\nReal Clear Politics, General Election: Romney vs. Obama, polling data, accessed Sept. 27, 2012\n\nHuffington Post, 2012 General Election: Romney vs. Obama, polling data, accessed Sept. 27, 2012\n\nThe American Presidency Project, 1980 Presidential Election Results, accessed Sept. 27, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]