["Members of the Assembly and advocates rally for state funding for refugee resettlement agencies in New York on Mar. 1, 2017.", "A group of state lawmakers wants Gov. Andrew M. Cuomo to include $12 million for refugee resettlement agencies in the next state budget.", "Federal funding for those agencies could be at risk if the U.S. places a temporary ban on refugees entering the country.", "President Donald Trump, in his January executive order on immigration, placed a temporary 120-day suspension on refugees entering the United States as well as a travel ban on seven mostly Muslim countries. That order has been halted by a federal judge. Trump also ordered limiting to 50,000 the number of refugees allowed into the U.S. in 2017. The number allowed into the U.S. was 110,000 under former President Barack Obama.", "The federal money goes to resettlement agencies when they receive new refugees. That funding could dry up with a refugee ban in place and if fewer refugees are placed in New York state. The state does not provide funding to these agencies.", "Assemblyman Sean Ryan, D-Buffalo, called the funding especially important for upstate communities, where most refugees are placed.", "\"We know that refugees are a great economic driver in the communities we represent,\" Ryan said at a press conference. \"Just last year, over 5,000 refugees came to New York state, and 94 percent settled outside of New York City.\"", "That number does not include the number of immigrants who entered New York last year. Immigrants are typically people who move somewhere by choice to improve their lives while refugees are trying to escape from persecution or armed conflict, like in Syria.", "Is Ryan right about how many refugees resettled in New York state last year?", "Federal fiscal year data", "New York state accepted 5,026 refugees in the federal fiscal year that ran from October 2015 through September 2016, the third most in the country, according to the Department of State.", "Upstate New York accepted 4,722, or 94 percent, of the refugees. New York City accepted 5.6 percent of them. The few remaining refugees went to Long Island or the New York City suburbs.", "Thirty-six percent of the refugees went to Erie County. Onondaga County took in the second-highest percentage of refugees, almost 25 percent.", "Calendar year data", "Ryan did not say if he was talking about the 2016 federal fiscal year or the 2016 calendar year. The data is typically reported by federal fiscal year. We checked both.", "During the 2016 calendar year, 5,830 refugees were resettled in New York state. Upstate New York accepted 5,430, or 93 percent, of them. Downstate New York accepted the rest.", "Erie and Onondaga counties also accepted the most refugees. Erie County took 1,966 of the state’s refugees. Onondaga accepted 1,092 refugees.", "Our ruling", "Ryan said, \"Just last year, over 5,000 refugees came to New York State, and 94 percent settled outside of New York City.\"", "Department of State figures, collected during the refugee vetting process, support Ryan’s point. The numbers closely match data from both the federal fiscal year and the calendar year.", "We rate his claim as True.", "Email conversation with Assemblyman Sean Ryan", "Data obtained from the Department of State’s Refugee Processing Data Interactive Data tool, Feb. 21, 2017", "Email and phone conversation with the Department of State Communications Office", "Email and phone conversation with Timothy Ruffinen from the Office of Temporary and Disability Assistance", "Information on the refugee admittance process from the Department of State, Accessed Feb. 21, 2017", "Pres. Donald J. Trump's Executive Order on Immigration, Jan. 27, 2017", "'Refugee or Migrant - Which is Right?' From the UN Refugee Agency", "\"President Obama to Increase Refugees Admitted to U.S. by 30%\", Wall Street Journal, Sept. 14, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]