["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Two weeks away from the Nov. 8 election, Donald Trump is behind in the polls.", "According to him, it’s because the Hillary Clinton campaign tampered with them.", "\"Wikileaks also shows how (Clinton campaign chairman) John Podesta rigged the polls by oversampling Democrats, a voter suppression technique,\" Trump said at a Oct. 24 rally in St. Augustine, Fla. \"And that’s happening to me all the time. When the polls are even, when they leave them alone and do them properly, I’m leading. But you see these polls, where they’re polling Democrats -- ‘how’s Trump doing’ ‘oh he’s down’ -- they’re polling Democrats!\"", "We were curious about Trump’s charge of bogus polling.", "Trump is wrong that Wikileaks shows Podesta rigging the polls against him. He’s referring to an email obtained by the hacker group from Clinton’s 2008 (not 2016) campaign on what appears to be internal polling (not public ones published by media organizations). And oversampling in this instance means polling more people in a specific demographic group for analysis -- not ignoring Republican voters to suppress their votes.", "In short, oversampling is a common polling technique and not, as Trump says, one of \"voter suppression.\"", "The email, one of thousands of Podesta emails released by Wikileaks, is a January 2008 exchange between Democratic strategists and employees of the Atlas Project, a political polling and data firm.", "Atlas sent over 98 pages of polling and media recommendations that includes several recommendations to oversample minorities, independent voters and Democrats in certain states.", "Experts told us the technical term for this is \"stratified disproportionate sampling,\" but most pollsters use \"oversample\" as a shorthand. It’s done not to skew the polls, but to gauge the attitudes of specific demographic groups, who would not be a statistically large enough group to analyze if sampled randomly.", "For example, in a national sample of 1,000 eligible voters, only 12.5 percent, or 125, would be black. To accurately gauge black attitudes on certain issues, a pollster may oversample 500 black eligible voters (four times more than the random sample). Then, in analyzing the full sample, the sample of blacks would be assigned a weight of 0.25 to represent the overall population.", "\"If the analysis of the group is done separately, it is simply a large sample of that group. If combined with all respondents the oversample is weighted down proportionately so that the overall sample is representative of the population as a whole,\" said Charles Franklin, the director of Marquette Law School Poll. \"This is a standard procedure and does not mean the weighted sample gives disproportionate weight to the oversampled group.\"", "The Pew Research Center explained that it, for example, oversampled Hispanics for an in-depth look at the U.S. Hispanic population in June 2016. Analysts then weighted Hispanics when looking at the overall population to have both \"more precise estimates when looking at Hispanics specifically\" and also \"the correct distribution when looking at the sample as a whole.\"", "Roger Tourangeau, president of the American Association for Public Opinion Research, pointed out that monthly federal surveys on unemployment do the same. To get an accurate understanding of joblessness in Wyoming, pollsters would need to call a number of Wyoming residents disportionate to the number of people in the entire country.", "Trump’s overall charges of skewed polls is \"nonsense,\" Tourangeau said, \"Nobody wants to produce a biased assessment and look like an idiot (on Election Day). Why would people deliberately get it wrong? It’s business suicide.\"", "Our ruling", "Trump said, \"Wikileaks also shows how John Podesta rigged the polls by oversampling Democrats, a voter suppression technique.\"", "A leaked email shows the Clinton campaign of 2008 consulted data firm that suggest oversampling in what is likely internal polling. The term refers to a common technique used by pollsters to analyze demographics groups more precisely than possible in a random sample.", "We rate Trump’s claim Pants on Fire.", "https://www.sharethefacts.co/share/a2406c00-0c22-4ea9-80cf-47ef7e301b30", "Wikileaks, \"Atlas polling recommendations,\" Jan. 16, 2008", "Pew Research Center, \"Oversampling is used to study small groups, not bias poll results,\" Oct. 25, 2016", "Washington Post, \"Very bad analysis of a 2008 email is Donald Trump’s new excuse for why he’s losing,\" Oct. 24, 2016", "Email interview with Charles Franklin, Director of Marquette Law School Poll, Oct. 24, 2016", "Email interview with Bill McInturff, partner at Public Opinion Strategies, Oct. 24, 2016", "Email interview with Scott Keeter, analyst at Pew Research Center, Oct. 25, 2016", "Phone interview with Roger Tourangeau, president of the American Association for Public Opinion Research, Oct 25, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]