["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "For years, the lofty pay of college football and basketball coaches has been the subject of controversy. And that has drawn the attention of the popular sports website Deadspin.", "Deadspin claims, based on news media reports and state salary databases, that the large majority of the highest-paid state employees in each state are football and basketball coaches, some of whom have multimillion-dollar compensation packages. And the website says that this calls into question our priorities as a society.", "The highest-paid employee in Rhode Island, according to Deadspin, is the men’s basketball coach at the University of Rhode Island. We know that has been true in the past, but we decided to dig into the numbers to see whether it remains true.", "A quick trip to the state’s \"Transparency Portal\" website confirmed what we suspected -- URI basketball coach Daniel Hurley is the highest-paid, at $597,500 per year. Hurley actually can bank a lot more money than that -- but we’ll address that later.", "The second highest-paid -- but well behind Hurley -- is URI President David M. Dooley, at $320,000.", "After Hurley and Dooley, according to the Transparency Portal, the top five include Stella Adeniyi, a registered nurse in the Department of Behavioral Healthcare, Developmental Disabilities and Hospitals, at $276,335 (she exceeds her base pay in overtime alone); Ray M. DiPasquale, president of the Community College of Rhode Island, $265,000; and Donald DeHayes, URI provost and vice president for academic affairs, $245,923.", "By comparison, Governor Chafee earns a salary of $129,210.", "We asked URI spokeswoman Linda Acciardo to provide a detailed account of Hurley’s compensation. She provided his contract.", "The sources and total of Hurley’s compensation, under his six-year employment contract, which expires April 7, 2018, may come as a revelation to some Rhode Islanders. He begins with a base salary of $300,000 and adds another $297,500 in bonuses and incentives -- all payable with university money -- but that’s not all.", "In our examination, we won’t cover non-cash benefits because those are excluded from Deadspin’s report.", "But as an aside, we note that Hurley’s benefits include the receipt of 20 VIP tickets for each men’s basketball home game and two parking passes for all URI athletic events. If his Rams team qualifies for the Atlantic 10 conference, National Collegiate Athletic Association or National Invitation Tournament playoffs, he would receive 12 tickets for each game in which the Rams appear. If his team makes it to the NCAA \"Final 4,\" he would receive four tickets.", "Also not counted in his annual cash compensation of $597,500, but potentially lucrative, is his contractual entitlement to operate a summer youth basketball camp and to keep the proceeds, minus the cost of using URI facilities.", "But let’s return to those cash bonuses and incentives above and beyond his $300,000 base salary. They include a guaranteed $175,000 of the gate receipts for home games, escalating by $15,000 on Oct. 1 of each year of the contract. So, this Oct. 1 he is scheduled to begin receiving $190,000, paid in quarterly installments.", "He is also guaranteed $65,000 for one away game. That money comes from a guarantee fee paid by the hosting school.", "Major programs routinely offer guarantee fees to attract non-conference opponents to their arenas, without having to later visit those schools as in a traditional home-and-home arrangement. In recent years, URI has been paid varying fees to visit Auburn, Syracuse and Duke; this year, it will make a visit to Louisiana State.", "Other guaranteed payments are $50,000 to participate in the men’s basketball radio and TV programs; $10,000 to participate in athletic events and other university functions; and a $12,000 \"motor vehicle stipend\" paid with donations raised by the Fast Break Basketball Booster Club.", "In addition, if the booster club generates gross revenue of at least $150,000, Hurley would be paid $5,000 by the club; if the gross ticket revenue for home games exceeds $1 million, he would be paid $25,000; and if his team members achieve a 2.5 grade point average or a 2.75 grade point average, he would be paid $7,500 or $10,000, respectively.", "Hurley also receives a maximum $8,000 annually, from booster club donations, to pay dues and other costs arising from his membership in a beach or country club.", "Then there are a series of potential, but much less likely, payments by URI -- none of which he has achieved in the one full season since he was hired -- depending on how the team finishes and whether he wins a coaching honor.", "If the team finishes first or tied for first in its conference, or if it wins the conference tournament  championship, he gets another $20,000.", "If URI plays in a first, second and third-round NCAA post-season tournament game, Hurley gets $20,000 per game. And if the team reaches the \"Sweet 16,\" \"Elite 8,\" \"Final 4,\" and national championship post-season rounds, he gets an additional $25,000 for each game played in those rounds.", "It is worthwhile to remember that the Rams have not qualified for the NCAA Tournament since 1999, have gone to the Sweet 16 only twice in history, to the Elite 8, once, and to the Final 4 or national championship game, never.", "If URI goes to the lesser post-season tournament, the NIT, he gets $5,000.", "If he wins Coach of the Year from the Atlantic 10 or a successor conference, he scores a $5,000 bonus, and NCAA National Coach of the Year, $10,000.", "The total of the guaranteed cash sums to be paid directly with university money is $600,000, which is $2,500 more than the $597,500 listed for Hurley in the Transparency Portal. Acciardo said the slight discrepancy probably is attributable to payments due but actually disbursed outside the 2012-2013 fiscal year.", "Our ruling", "The sports website Deadspin says the University of Rhode Island men’s basketball coach is the highest paid state employee. It’s a slam dunk. The judges rate the claim True.", "RI.gov,  State of Rhode Island Transparency Portal, accessed Sept. 19, 2013", "Deadspin.com, Infographic: Is Your State’s Highest-Paid Employee A Coach? (Probably), accessed Sept. 18, 2013", "Twistedsifter.com, US Map of the Highest Paid Public Employees by State, Map No. 17, accessed Sept. 18, 2013", "Interview and e-mails, Linda A. Acciardo, spokeswoman, University of Rhode Island, Sept. 19-20, 2013; Anthony A. Bucci, State of Rhode Island director of personnel, Sept. 19-25, 2013.", "Employment agreement between the University of Rhode Island and Daniel Hurley", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]