["Student activist and Marjory Stoneman Douglas High School mass shooting survivor speaking at the \"March for Our Lives\" rally in support of gun control in Washington D.C. on March 24, 2018.", "Online rumors suggest Parkland shooting survivor and gun control activist Emma Gonzalez bullied the shooter and blamed white male entitlement as the cause of all school shootings.", "\"Emma Gonzalez bullied school shooter, isn’t sorry; then retweets message blaming ‘white boys’ entitlement’ as cause of all school shootings,\" read the headline on Project Republic, a website that claims to provide \"relevant, thought-provoking, and factual news coverage.\"", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat online hoaxes.", "The article falsely claims that Gonzalez is on video admitting to bullying and ostracizing the Parkland shooter and saying she was justified in doing so. The website includes a video clip of a speech Gonzalez gave at a rally in Fort Lauderdale, Fla. She says:", "\"Since he was in middle school, it was no surprise to anyone who knew him to hear that he was the shooter. Those talking about how we should not have ostracized him, you didn’t know this kid. Okay? We did.\"", "In reality, Gonzalez was responding to a tweet from President Donald Trump that implied people should have been more active in reporting the shooter’s disturbing behavior before people died. The full video clip showed Gonzalez talking about the shooter being mentally disturbed, but she never made any claims about bullying him.", "Here is Gonzalez’s comment in full context:", "\"There is one tweet I would like to call attention to. ‘So many signs that the Florida shooter was mentally disturbed, even expelled for bad and erratic behavior. Neighbors and classmates knew he was a big problem. Must always report such instances to authorities again and again.’ We did, time and time again. Since he was in middle school, it was no surprise to anyone who knew him to hear that he was the shooter. Those talking about how we should have not ostracized him, you didn't know this kid. Okay, we did. We know that they are claiming mental health issues, and I am not a psychologist, but we need to pay attention to the fact that this was not just a mental health issue. He would not have harmed that many students with a knife.\"", "We found no other evidence to suggest that Gonzalez bullied Cruz.", "The article then refers to a tweet Gonzalez retweeted on March 27. The tweet from user @edennnnnn said:", "\"If bullying caused school shootings, you would see trans shooters, queer shooters, female shooters, POC shooters. Bullying does not cause school shootings; entitlement does. And white boys are the most entitled demographic by far.\"", "Project Republic described Gonzalez’s retweet as sentiment to blaming \"white boys’ entitlement\" as the cause of all school shootings. But the tweet isn’t that specific in blaming all school shootings on entitlement.", "Project Republic has no evidence to show that Gonzalez bullied Cruz; she didn’t admit; and the retweet doesn’t say what Project Republic said.", "We rate the statement False.", "Project Republic, Emma Gonzalez bullied school shooter, isn’t sorry; then retweets message blaming \"white boys’ entitlement\" as cause of all school shootings, March 28, 2018", "CNN, Florida student Emma Gonzalez to lawmakers and gun advocates: ‘We call BS’, fEB. 17, 2018", "Twitter, Emma Gonzalez", "Twitter, Eden Cheung", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]