["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "Following U.S. President Donald Trump's projected loss in the 2020 election, several vague claims asserting a sting operation aimed at catching Democrats in the act of voter fraud have gone viral. As we explained in an earlier, more general debunker, such claims — including this one — rely on a series of deeply flawed assumptions about the role of the federal government in ballot production and the mechanics of the American electoral process.", "At issue in this fact check is one of the most pervasive claims within this genre of disinformation: The notion that all the \"official\" mail-in ballots in the election had a secret watermark making them identifiable to \"elite units\" of the National Guard who are currently undertaking a secret recount made possible by \"quantum blockchain\" technology. A representative formulation of this claim can actually be found, according to Reuters reporter Brad Heath, on the Facebook page of one of the people cited in a Trump campaign lawsuit purporting to be a witness to voter fraud in Michigan:", "On Sunday, November 8, 2020, a recount of ballots nationwide was being done by elite units of the National Guards [sic]. To prevent fraud, official ballots had been printed with an invisible, unbreakable code watermark and registered on a Quantum Blockchain System. As of writing, in five states, 14 million ballots had been put through a laser scanner - 78% of which failed because there was no watermark to verify the ballot. Of those ballots that failed, 100% had checked for Biden.", "Nothing in the above statement is factually defensible or logically consistent. In fact, the claim originates with a regular InfoWars guest named Steve Pieczenik. While Pieczenik was once a fairly high-level government employee during the Carter administration, he is more famous now for pushing vile conspiracy theories including those that suggest the Sandy Hook mass shooting was staged. (It wasn't.) \"Every one of these paid [Sandy Hook] parents, whoever they may be, are totally, totally disingenuous,” he once argued alongside Alex Jones.", "On a Nov. 5, 2020, episode of the InfoWars program \"War Room with Owen Shroyer,\" Pieczenik first laid out the alleged ballot fraud sting scheme, citing unnamed sources within the government:", "Now I do not work for the federal government. I'm not paid by them. Let me just say again. What I said in 2016, there are honorable members of our intelligence, military, and civilian community in the government who understood exactly how corrupt Biden and the democratic machine is, was, and will be. This is really a sting operation, contrary to what everybody else said. Trump knew this was happening. ... What happened was we marked watermark every ballot with what's called the QFS blockchain encryption code. In other words, we know pretty well where every ballot is where it went, and who has it. So this is not a stolen election. … All of this was expected. All of this was part of the sting operation we're running.", "Early iterations of this conspiracy theory, as reported by other pseudoscientific or conspiracy-focused websites, interpret QFS as \"quantum financial system\" — a wholly imaginary concept. This purported financial system has its origins in a longstanding conspiracy theory known as NESARA, adherents of which assert that a series of financial reforms (proposed in the 1990s by Harvey Francis Barnard and named the \"National Economic Security and Recovery Act\") were secretly passed and suppressed by the government, but will one day usher in \"an era of debt forgiveness and monetary reform.\"", "Perhaps because Bernard's self-published 1996 book is titled \"Draining the Swamp,\" the possibility of Trump being the leader to usher in that new era became a popular part of the QAnon ecosystem of pro-Trump conspiracy theories. As Logical.ly reported in September 2020, QAnon \"co-opted the global reset narrative\" of NESARA \"to announce that a new era of debt forgiveness and monetary reform — where cash would be replaced with a gold-backed cryptocurrency — would imminently be ushered in by none other than Trump.\" This new financial future is powered, in theory, by what some claim is a \"quantum financial system.\"", "Believing that a \"QFS blockchain encryption code,\" as Pieczenik called it, is hidden on mail-in ballots also requires a broader belief that an \"imminent global reset\" is about to forgive all of your debt.", "Later iterations of the claim, like the example from the Facebook page of the Trump voter fraud lawsuit presented earlier, drop the \"QFS\" terminology. These claims retain only the \"quantum\" portion of the concept. \"Official ballots had been printed with an invisible, unbreakable code watermark and registered on a Quantum Blockchain System,\" that person claimed. Terms like \"blockchain\" and \"quantum\" sound impressive and scientific — which is likely one of the reasons for their use here — but the way in which these terms are employed in this conspiracy theory is nonsensical.", "In extremely simplistic terms, blockchain refers to a cryptologic method of preserving and securing digital information. Blockchains are essentially records of transactions stored in a decentralized network in a way that makes them virtually impossible to alter and accessible only to individuals with a mathematically unbreakable cryptographic key. The technology currently exists and underlies, in some form, all cryptocurrency transactions.", "In relation to cryptography, \"quantum\" almost always refers to quantum computing. Quantum computing is a real thing. Though still in its infancy and largely theoretical, it is a form of computing that is not based, like all traditional computers, on bits of binary code (i.e. ones and zeros). It has the theoretical potential to offer computational power far greater than anything currently possible. Blockchain systems do not require quantum computers. In fact, quantum computing is a threat to blockchain systems, as they may one day potentially offer enough power to break the previously unbreakable encryption keys underlying such systems.", "A \"quantum blockchain system\" is like the \"quantum financial system\" —  an imaginary notion.", "Several of the same bits of evidence allegedly supporting the watermark-based DHS sting are repeatedly cited in message board forums, conspiracy websites, and on social media. These include the existence of a United States Postal Service patent application for a blockchain-based system to secure mail-in voting during elections and purported images of watermarks on ballots. Neither of these items, in fact, support that narrative.", "The patent is real, but the Postal Service applied for it in Feb. 2019, it wasn't granted until Aug. 2020, and it is an extremely broad document that does not suggest the development of any specific new technology. David Jefferson, a computer scientist at the Center for Applied Scientific Computing at Lawrence Livermore National Laboratory, told the outlet Decrypt that the patent \"strikes me as a quick attempt to grab a big swath of patent rights rather than to actually invent anything original.\" Whatever its aims, nothing in the patent would have been, or was, ready for the November 2020 election.", "Additionally, it has been public knowledge since well before the 2020 election or its associated push for mail-in voting that blockchain-based systems are of interest to election officials. They have, in fact, been both proposed and tested for limited use in previous American elections. In 2018, for example, West Virginia tested a blockchain-based voting app named Voatz in that mid-term election, giving the option to service members and their families serving abroad to vote digitally. (It was not used in the 2020 election). In other words, the patent doesn't reveal some new truth about U.S. election officials' interest in blockchain security.", "It is similarly unnewsworthy to point out the existence of a watermark on a ballot, even though several such images have been shared as evidence of the veracity or plausibility of the so-called DHS sting. It is public knowledge that most mail-in ballots have watermarks, QR codes, or other security devices included. Like the patent application, the purported existence of a watermark does not confirm any DHS plot, it merely suggests that the mail-in ballot used in your jurisdiction, like thousands of others around the country, employ watermarks as one of their security features.", "As we explained in our broader debunker about this genre of claim, the idea that Democrats could, on a mass scale, merely toss out Trump ballots and replace them with Biden votes betrays a fundamental ignorance of how elections are administered in the United States. Neither the Department of Homeland Security (DHS) nor any other federal agency is \"in charge\" of elections or responsible in any way for ballot production, recounts, or auditing.", "While states are in charge of their own elections, the entities responsible for designing, printing, and distributing the actual ballots are private contractors selected by the officials or boards of local election jurisdictions. These companies do not receive their raw paper material from the federal government, and there are over 10,000 different election jurisdictions in the United States. Each of these jurisdictions would have their own ballot design and security features, separate local races, and their own unique identifiers tying specific ballots to specific registered voters.", "One can not simply print new votes for Biden even if \"quantum blockchain systems\" or \"quantum financial systems\" were real things. As they are not, the claim is \"False.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]