["The president revises history, exaggerates accomplishments and makes false claims.", "By Eugene Kiely, Lori Robertson, Brooks Jackson, D'Angelo Gore and Vanessa Schipani", "Posted on August 23, 2017", "President Donald Trump delivered a raucous, error-filled speech in Arizona on Aug. 22, just days after he was uniformly criticized for blaming “both sides” for the deadly violence at a white nationalist rally in Charlottesville, Virginia.", "The president gave a revisionist account of his remarks about Charlottesville, exaggerated his accomplishments, and made a series of false and misleading claims:", "The president spoke to supporters in Phoenix, Arizona — one in a series of rallies staged by his campaign since he became president. Trump also has held campaign rallies in West Virginia, Pennsylvania and Ohio — states that he won and needs to maintain if he wants to win reelection more than three years from now.", "The Arizona speech came just days after the president was criticized by members of both parties for blaming “both sides” for violence at a white nationalist rally in Charlottesville, Virginia. Trump blamed the “dishonest” news media for cherry-picking his words to distort his statements on Charlottesville, when, in fact, the president cherry-picked his words from his past statements to put a positive spin on his much-criticized remarks.", "Trump first spoke about Charlottesville on Aug. 12, the day of the white nationalist rally, and then again on Aug. 14 and 15. He read excerpts from each of his remarks to his Arizona audience, but he omitted key phrases that caused a political backlash.", "First, Trump spoke of his remarks on Aug. 12, a Saturday.", "Trump, Aug. 22: So here’s what I said, really fast, here’s what I said on Saturday: “We’re closely following the terrible events unfolding in Charlottesville, Virginia” — this is me speaking. “We condemn in the strongest, possible terms this egregious display of hatred, bigotry and violence.” That’s me speaking on Saturday.", "Actually, Trump said, “We condemn in the strongest possible terms this egregious display of hatred, bigotry and violence, on many sides. On many sides.” In his retelling, Trump left out the words in bold. His Aug. 12 remarks were criticized at the time even by members of his own party, who faulted the president for blaming both sides and not singling out by name the hate groups that organized the rally.", "Republican Sen. Cory Gardner of Colorado tweeted, “Mr. President – we must call evil by its name. These were white supremacists and this was domestic terrorism.” Sen. Orrin Hatch, a Republican from Utah, tweeted, “We should call evil by its name. My brother didn’t give his life fighting Hitler for Nazi ideas to go unchallenged here at home.”", "It wasn’t until two days later that Trump condemned “the KKK, neo-Nazis, white supremacists, and other hate groups” by name. But Trump followed that with remarks on Aug. 15 that again blamed both sides.", "On Aug. 15, Trump said this of the rally organizers and others who protested the planned removal of the Robert E. Lee statue in Charlottesville: “[Y]ou had some very bad people in that group, but you also had people that were very fine people, on both sides.”", "Sen. Marco Rubio, a Republican from Florida, responded to Trump’s remarks with a six-part tweetstorm that began, “The organizers of events which inspired & led to #charlottesvilleterroristattack are 100% to blame for a number of reasons.” Rubio went on to say, “Mr. President,you can’t allow #WhiteSupremacists to share only part of blame.They support idea which cost nation & world so much pain.”", "In his retelling of his Aug. 15 remarks, Trump focused on selected excerpts and again ignored key phrases — such as “both sides” and “very fine people” — that caused another round of political criticism.", "Trump, Aug. 22: So it should have been — so then the last one, on Tuesday — Tuesday I did another one: “We condemn in the strongest possible terms this egregious display of hatred, bigotry and violence. It has no place in America.”", "That quote was actually from his second set of remarks, on Aug. 14, which he repeated on Aug. 15 before blaming both sides.", "Trump explained his point in reading excerpts from his past statements on Charlottesville: “But the point is, that those were three different — there were two statements and one news conference. The words were perfect. They [media outlets] only take out anything they can think of, and for the most part, all they do is complain. But they don’t put on those words. And they don’t put on me saying those words.”", "It’s his opinion, of course, that his “words were perfect.” But he distorts the facts by omitting key phrases that caused a political backlash and by claiming that media outlets “take out” his words, when in fact he is guilty of exactly that.", "Trump also wrongly suggested that the media didn’t report that he had said “racism is evil,” a quote from his second statement — on Monday, Aug. 14 — on the white nationalist rally in Charlottesville, Virginia.", "Trump: Then I said, racism is evil. Do they report that I said that racism is evil? You know why? Because they are very dishonest people. So I said, racism is evil. Now they only choose, you know, like a half a sentence here or there and then they just go on this long rampage, or they put on these real lightweights all around a table that nobody ever heard of, and they all say what a bad guy I am.", "The “racism is evil” quote from the president’s remarks was, in fact, the headline on many news stories that day, including articles from the Washington Post, Politico, the Los Angeles Times, NPR, Time magazine, the Hill and NBC News.", "The media were apparently in widespread agreement that the quote was important and newsworthy. USA Today included the quote in the first paragraph of a story headlined “President Trump condemns white supremacists after Charlottesville violence“; the Wall Street Journal included the quote in the second paragraph of a story headlined “Trump Denounces White Supremacist Groups by Name“; and FoxNews.com included it in the fifth paragraph under the headline “Trump condemns ‘white supremacists,’ vows ‘justice will be delivered’ in Charlottesville attack.”", "On CNN, Wolf Blitzer, during the 5 o’clock hour of “The Situation Room” on Aug. 14, quoted Trump’s phrase “racism is evil” three times and showed a clip of Trump saying the phrase three times.", "Several news organizations posted video of Trump’s remarks, including CNN.com, which posted a video of Trump’s full statement, with the headline: “Trump: Racism is evil (full statement).” That quote was also the headline of the New York Times’ video of the statement, and the Times posted a full transcript.", "Even before Trump delivered his statement on Aug. 14, CNN senior White House correspondent Jeff Zeleny said on air that this would be the type of language the president would use, according to a White House official.", "“What we hear specifically is coming is a direct and forceful and full-throated condemnation of the acts of violence in Charlottesville on Saturday,” Zeleny said. “I am told by a White House official that the president will directly say what happened in Charlottesville was evil. I am told that he will directly talk about the neo-Nazi groups, the white supremacists, the Ku Klux Klan, he will mention those groups by name.”", "Trump, who singled out several news organizations by name for criticism, also wrongly claimed CNN’s ratings “are going down.” In fact, they’ve gone up.", "Trump: Or CNN, which is so bad and so pathetic, and their ratings are going down.", "The president made a similar claim in late June on Twitter, saying CNN’s ratings were “way down.” Our fact-checking colleagues at PolitiFact.com gave that a “pants-on-fire” rating. Data from Nielsen showed CNN was at a five-year high in total viewers for primetime, total day, and those two categories for 25- to 54-year-olds. CNN said in a June 27 press release that its 2017 second quarter was the “most-watched second quarter on record in total viewers.”", "Trump also said that the New York Times “essentially apologized” for “bad” and “wrong” coverage of the 2016 presidential election.", "Trump: The New York Times essentially apologized after I won the election, because their coverage was so bad, and it was so wrong, and they were losing so many subscribers that they practically apologized.", "The Times did not issue an apology to Trump or its readers or describe its coverage as “bad.”", "In a Nov. 13, 2016, letter “To Our Readers, From the Publisher and Executive Editor,” the Times, which had projected that Hillary Clinton would win the 2016 presidential election, asked, among other questions: “Did Donald Trump’s sheer unconventionality lead us and other news outlets to underestimate his support among American voters?” From there, the paper, in a moment of reflection, pledged to “rededicate ourselves to the fundamental mission of Times journalism,” and thanked its readers for their “loyalty.”", "Trump falsely claimed that wages “haven’t gone up for a long time.”", "Trump: I believe wages will start going up, because we now have the lowest unemployment rate we’ve had in 17 years, so you’re going to see wages go up, right? They haven’t gone up for a long time.", "Actually, wages have been rising for a while now.", "For all private workers, average weekly earnings (adjusted for inflation) rose 4 percent during Obama’s last four years in office. And they rose another 1.6 percent during Trump’s first six months.", "Those figures include managers and supervisors. For rank-and-file, nonsupervisory workers, the gains have been even larger. Their inflation-adjusted weekly earnings rose 4.7 percent during Obama’s last term, and another 1.8 percent during Trump’s first six months.", "As for the unemployment rate, it’s true that the 4.3 percent rate in July was the lowest since 2001.", "Trump inherited a rate that was already below the historical median and falling. It was 4.8 percent in January when he took office, well below the median 5.6 percent rate for all months since 1948. It has dropped another half a percentage point since he was sworn in.", "Trump also — again — exaggerated his record on job creation and economic growth.", "Twice, Trump took credit for creating more than 1 million jobs “since I’ve been in office” — adding for emphasis “way over 1 million.” He has not created “way over 1 million” jobs. The economy has added a little more than 1 million since Trump took office — a little less than the number of jobs that were added at this same time a year ago.", "The economy has added nearly 1.1 million jobs from January, when Trump took office, through July, which is the most recent data, according to the Bureau of Labor Statistics. The actual increase is 1,074,000 jobs, or an increase of 0.74 percent.", "By contrast, the economy added 1,246,000 jobs from January 2016 to July 2016, an increase of 0.87 percent. So, the economy is adding jobs at a slightly lower rate than it was under President Barack Obama a year ago.", "Trump also described the estimated 2.6 percent growth in the nation’s real gross domestic product for the second quarter as “shocking” — in a good way. He said “economic growth has surged to 2.6 percent.” But, as we’ve already written, the GDP grew by more than 2.6 percent in eight of the last 18 quarters, according to the Bureau of Economic Analysis.", "Trump, Aug. 22: So we have a GDP, it was shocking, about two weeks ago it was announced for the quarter: 2.6 percent. Remember, I said we’re going to try and hit 3 percent? We’re already at 2.6. Maybe I’ll have to increase my offer.", "A growth rate that Trump now describes as shockingly good is below the 2.9 percent estimated growth in the third quarter of 2016, which the Trump campaign dismissed at the time as “modest.” In a statement on Oct. 28, 2016, Dan Kowalski, Trump’s deputy policy director, said: “America can do better than the modest growth of 2.9 percent recorded for the 3rd quarter.”", "The 2.6 percent growth rate also wasn’t “shocking” to economists.", "The Federal Reserve Bank of Atlanta’s GDPNow model initially forecast a 4.3 percent increase for the second quarter on May 1. The bank gradually decreased that prediction over time, down to a 2.8 percent growth rate on the day before the BEA’s announcement of its advance estimate.", "Similarly, on March 3, the Federal Reserve Bank of New York initially forecast a 2.91 percent GDP growth for the second quarter of 2017, but the projection dropped to roughly 2 percent during the last month of the quarter.", "Also, the March 15 Blue Chip Consensus prediction for the second quarter almost hit the BEA’s “advance” estimate on the nose at 2.5 percent. However, the group of 50 economists, who all contribute to this forecast, predicted 3 percent growth for the quarter on June 13.", "The BEA’s estimate for the second quarter may change though. The bureau emphasized that this “advance” estimate is “subject to further revision” because it’s based on “incomplete” data. It said it will release a second estimate for the second quarter, which will be “based on more complete data” on Aug. 30.", "The president claimed that “we were one vote away from repealing” Obamacare, but that’s not the case.", "Trump: Obamacare is a disaster and think — think, we were just one vote away from victory after seven years of everybody proclaiming repeal and replace. One vote away. One, one vote. One vote away. We were one vote away. Think of it, seven years the Republicans — and again, you have some great senators, but we were one vote away from repealing it.", "Senate Republicans fell one vote short of passing a bill that was seen as a placeholder — the so-called “skinny repeal” option, which could have then enabled the Senate and House to work on a final bill in a conference committee. In introducing the “skinny repeal” on July 27, Senate Majority Leader Mitch McConnell said: “Passing this legislation will allow us to work with our colleagues in the House toward a final bill that could go to the president, repeal Obamacare, and undo its damage.”", "Republicans were one vote away from continuing the process; they weren’t “one vote away from repealing” the law, as Trump claimed.", "The Senate had failed to pass its more comprehensive effort to repeal and replace the Affordable Care Act. The “skinny” legislation would have made only a few changes to the ACA, including repealing the individual and employer mandates to buy or provide health insurance, eliminating Planned Parenthood funding for a year and giving the money to community health centers, and delaying a medical device tax.", "Several Republican senators were concerned that if the “skinny” option passed the Senate, the House would simply pass that, sending just the shell of a repeal bill to the president’s desk.", "“We’ve been asked by our leadership for days now to vote on the least common denominator — the skinny bill — because, the pitch is if you vote for the skinny bill then we can go to conference,” Republican Sen. Lindsey Graham said at a press conference, hours before the Senate voted, with Sens. John McCain, Ron Johnson and Bill Cassidy. “There’s increasing concern on my part and others that what the House will do is take whatever we pass, the so-called skinny bill, not take it to conference, go directly to the House floor, vote on it, and that goes to the president’s desk.”", "Graham did vote for the “skinny bill,” but three Republican senators opposed it: Sens. Susan Collins, Lisa Murkowski and McCain. One more Republican yes vote would have created a tie, which Vice President Mike Pence could have broken.", "Trump also claimed that by allowing insurance companies to sell insurance across state lines, “your prices go way down.” But experts dispute that idea.", "Trump: So even when you say we’re voting on healthcare, like across state lines, purchase across state lines. One of the most important things, I’ve been talking about it for two years during debates. It gives competition. Insurance companies come in, your prices go way down.", "We looked into this issue last month, when the president said “your premiums will be down 60 and 70 percent” under such a policy. We couldn’t find any study supporting that kind of decrease.", "The National Association of Insurance Commissioners, a group established by the country’s state insurance regulators, said it was a “myth” that selling insurance across state lines would bring about lower premiums.", "“Interstate sales will start a race to the bottom by allowing companies to choose their regulator,” allowing insurers to target the healthiest consumers, the NAIC wrote in a fact sheet. “While those individuals in pristine health may be able to find cheaper policies, everyone else would face steep premium hikes if they can find coverage at all.”", "In an interview with FactCheck.org, Linda J. Blumberg, a senior fellow at the Urban Institute’s Health Policy Center, echoed the NAIC’s remarks. And Joseph Antos, the Wilson H. Taylor Scholar in Health Care and Retirement Policy at the American Enterprise Institute, told us that more regulatory flexibility “could reduce premiums to some extent,” but insurers would still have to price plans based on the health costs in a given geographic area. He wrote in a February 2016 post on the think tank’s website that “one should not expect interstate sales to significantly reduce the cost of health insurance.”", "Trump made a false boast about U.S. energy exports.", "Trump: American energy will power this future. We have become an energy exporter for the first time ever just recently.", "In fact, the U.S. still imports more energy than it exports. It’s true that U.S. imports have been falling, and exports have been rising. But that trend didn’t start “recently.” Net imports peaked in 2005, and have been falling nearly every year for well over a decade.", "The U.S. imported 2.9 quadrillion British thermal units more than it exported during the first four months of this year, which is nearly 26 percent less than in the same period last year, according to the U.S. Energy Information Administration. (This counts “primary” forms of energy including oil, gas, coal and electricity, including renewables but not nuclear fuel.)", "Trump would have been correct to say that the U.S. is on the path to becoming a net energy exporter in the future. The EIA projects that, if current trends continue under its “reference case” assumptions, the U.S. will become a net exporter of energy — but not until 2026.", "That could come sooner if oil prices shoot up, or if the economy grows more slowly than expected, or if energy technology advances faster than expected, the EIA predicts. Or it might not happen at all — and the U.S. would remain a net energy importer — if oil prices are lower than expected or production technology stalls.", "Trump also made a false boast when he said, “We’ve also obtained [a] historic increase in defense spending.” In fact, Congress has yet to pass Trump’s budget for fiscal year 2018, which starts Oct. 1. And as we’ve repeatedly written, his proposal for defense spending isn’t “historic.”", "The nonpartisan Congressional Budget Office said in a July analysis that Trump’s proposed budget for fiscal year 2018 would increase defense spending by 5 percent — from $634 billion in 2017 to $668 billion in 2018.", "The $668 billion comprises $603 billion in base defense spending and $65 billion for overseas contingency operations, or OCO, which goes toward ongoing military operations in the Middle East. According to CBO, OCO spending would drop by 22 percent under the president’s budget and base defense spending would increase by 9 percent.", "But even with the 5 percent increase, Trump’s proposed defense budget would be less than the amounts spent under President Barack Obama in 2012 ($670.5 billion), 2011 ($699.4 billion) and 2010 ($688.9 billion), according to the CBO.", "The 9 percent increase in base defense funding is not “historic” either, as we wrote back in March. That budget saw double-digit percentage increases under Presidents George W. Bush, Ronald Reagan and Jimmy Carter.", "Trump did secure more defense funding for fiscal year 2017 in a bill that he signed in May. The Consolidated Appropriations Act of 2017 provided funding for the rest of 2017, including an extra $21 billion for the military. But even with the increased funding, the fiscal 2017 defense spending was below the funding levels of earlier this decade.", "Trump said that he doesn’t get credit for the number of bills that he has signed into law.", "Trump: We’ve accomplished historic amounts in a short period of time. We’ve signed more than 50 pieces of legislation. They said we’ve signed none — none.", "As of Aug. 22, Trump had signed 54 pieces of legislation into law, according to GovTrack.us. But no one has said that he has “signed none.”", "What some have pointed out, however, is that Trump has not signed many, if any, significant pieces of legislation into law. For example, Trump has not fulfilled some of his biggest campaign promises. Efforts to repeal and replace the Affordable Care Act stalled in the Senate. And Trump has yet to sign a bill funding the construction of a border wall with Mexico, nor has he signed legislation overhauling the U.S. tax code or following through on his promise of $1 trillion in infrastructure programs.", "And while Trump also told the crowd that he doesn’t “believe that any president has accomplished as much as this president in the first six or seven months,” at least one president had more legislative accomplishments than Trump.", "President Franklin D. Roosevelt signed 76 bills into law and 99 executive orders in just his first 100 days in office, according to an analysis by FiveThirtyEight.com. That includes at least “15 major bills,” like the National Industrial Recovery Act, which created programs to provide relief following the Great Depression. It also includes the Banking Act of 1933, which established the Federal Bank Deposit Insurance Corporation, and the Tennessee Valley Act, which established the Tennessee Valley Authority. Those two programs still exist today.", "Trump also returned to the issue of trade deals and the impact on U.S. workers, a popular theme during his successful campaign.", "In criticizing the North American Free Trade Agreement, or NAFTA, Trump said of Mexico and Canada: “They have made such great deals, both of the countries, but in particular, Mexico, that I don’t think we can make a deal.”", "The U.S. routinely runs a trade deficit with Mexico — but that has not been the case in recent years with Canada, despite Trump’s claim about “both of the countries” having “such great deals” under NAFTA.", "According to the Bureau of Economic Analysis, the U.S. has had a trade deficit in goods and services with Mexico in each of the last 18 years, from 1999 to 2016, totaling more than $800 billion.", "However, for the second year in a row, the U.S. had a trade surplus with Canada. In 2016, the U.S. had a $7.7 billion trade surplus in goods and services with Canada, up 85 percent from the $4.2 billion surplus in 2015, according to the latest revised BEA figures.", "That may change in 2017, although it is still too early to tell. In the first quarter, the U.S. had a trade deficit in goods and services of $1.2 billion with Canada, according to the BEA.", "Kiely, Eugene et al. “FactChecking Trump’s West Virginia Rally.” FactCheck.org. 4 Aug 2017.", "Kiely, Eugene et al. “Trump’s 100-day Boasts.” FactCheck.org. 1 May 2017.", "Kiely, Eugene et al. “FactChecking Trump’s Rally in Ohio.” FactCheck.org. 27 Jul 2017.", "White House. “Remarks by President Trump at Signing of the VA Choice and Quality Employment Act.” 12 Aug 2017.", "White House. “Statement by President Trump.” 14 Aug 2017.", "White House. “Remarks by President Trump on Infrastructure.” 15 Aug 2017.", "@SenCoryGarner. “Mr. President – we must call evil by its name. These were white supremacists and this was domestic terrorism.” Twitter. 12 Aug 2017.", "@senorrinhatch. “We should call evil by its name. My brother didn’t give his life fighting Hitler for Nazi ideas to go unchallenged here at home. -OGH.” Twitter. 12 Aug 2017.", "@marcorubio. “The organizers of events which inspired & led to #charlottesvilleterroristattack are 100% to blame for a number of reasons. 1/6.” Twitter. 15 Aug 2017.", "@marcorubio. “Mr. President,you can’t allow #WhiteSupremacists to share only part of blame.They support idea which cost nation & world so much pain 5/6.” Twitter. 15 Aug 2017.", "Bureau of Labor Statistics. “Employment, Hours, and Earnings from the Current Employment Statistic survey (National), “Total Nonfarm Employment, Seasonally Adjusted.” Accessed 23 Aug 2017.", "Bureau of Economic Analysis. “Table 3. U.S. International Trade by Selected Countries and Areas. Balance on Goods and Services.” Accessed 23 Aug 2017.", "Census Bureau. “Exhibit 20. U.S. Trade in Goods and Services by Selected Countries and Areas – BOP Basis.” Jun 2017.", "Roll Call Vote 115th Congress – 1st Session. Senate.gov. 28 Jul 2017.", "Congressional Record. Pages S4399-S4400. 27 Jul 2017.", "CNN.com. GOP senators’ full remarks on “skinny bill.” 27 Jul 2017.", "McAuliff, Michael. “McCain Votes No, Derails ‘Skinny Repeal’ In Marathon Session.” Kaiser Health News. 28 Jul 2017.", "Robertson, Lori. “Selling Insurance Across State Lines.” FactCheck.org. 21 Jul 2017.", "Kruzel, John. “Trump’s Pants on Fire claim that CNN ratings are ‘way down.’” PolitiFact.com. 3 Jul 2017.", "CNN.com. “CNN has most-watched second quarter on record.” Press release. 27 Jun 2017.", "Taylor, Jessica. “Trump Calls Out KKK, White Supremacists After Charlottesville: ‘Racism Is Evil.'” NPR.com. 14 Aug 2017.", "CNN.com. “Trump: Racism is evil (full statement).” Video. 14 Aug 2017.", "Nakamura, David and Horwitz, Sari. “‘Racism is evil,’ Trump says, condemning ‘white supremacists’ and hate groups.” Washington Post. 14 Aug 2017.", "Nelson, Louis. “Trump declares ‘racism is evil’ amid pressure over Charlottesville.” Politico. 14 Aug 2017.", "Bierman, Noah. “Trump: ‘Racism is evil … including the KKK, neo-Nazis and white supremacists.'” Los Angeles Times. 14 Aug 2017.", "Miller, Zeke J. “‘Racism Is Evil.’ Trump Condemns White Supremacists 2 Days After Charlottesville Violence.” Time magazine. 14 Aug 2017.", "Fabian, Jordan. “Trump declares ‘racism is evil’ after firestorm.” The Hill. 14 Aug 2017.", "Rafferty, Andrew. “Trump Condemns Hate Groups, Calls Racism ‘Evil’ Days After Charlottesville Violence.” NBC News. 14 Aug 2017.", "Jackson, David and Estepa, Jessica. “President Trump condemns white supremacists after Charlottesville violence.” USA Today. 14 Aug 2017.", "Nichols, Peter, et. al. “Trump Denounces White Supremacist Groups by Name.” Wall Street Journal. 14 Aug 2017.", "Fox News. “Trump condemns ‘white supremacists,’ vows ‘justice will be delivered’ in Charlottesville attack.” 14 Aug 2017.", "New York Times. “Trump on Charlottesville: ‘Racism Is Evil.'” Video. 14 Aug 2017.", "CNN. “Insider Politics.” Transcript. 14 Aug 2017.", "CNN. “The Situation Room.” Transcript. 14 Aug 2017.", "Farley, Rob. “Trump’s GDP Puffery.” FactCheck.org. 1 Aug 2017.", "Trump Campaign. “Dismal Growth Numbers Underscore Need For Change.” DonaldJTrump.com 28 Oct 2016.", "Federal Reserve Bank of New York. New York Fed Staff Nowcast. NewYorkFed.org. 28 Jul 2017.", "Appropriations for Fiscal Year 2018. Congress.gov. Accessed 23 Aug 2017.", "Kiely, Eugene et al. “FactChecking Trump’s Rally in Ohio.” FactCheck.org. 27 Jul 2017.", "Kiely, Eugene. “Trump’s Defense Increase ‘Historic’?” FactCheck.org. 1 Mar 2017.", "CBO. An Analysis of the President’s 2018 Budget. Jul 2017.", "CBO. Historical Budget Data. Accessed 23 Aug 2017.", "White House. “Statement by President Donald J. Trump on Signing H.R. 244 into Law.” 5 May 2017.", "H.R.244. Consolidated Appropriations Act, 2017. 5 May 2017.", "White House. “H.R. 244 — Consolidated Appropriations Act, 2017.” 2 May 2017.", "New York Times. “To Our Readers, From the Publisher and Executive Editor.” 13 Nov 2016.", "Katz, Josh. “Who Will Be President?” New York Times. 8 Nov 2016.", "Krieg, Gregory. “President Trump’s first six months: by the numbers.” CNN. 20 Jul 2017.", "Keith, Tamara. “Despite Claims To Contrary, Trump Has Signed No Major Laws 5 Months In.” NPR. 23 Jun 2017.", "CBS News. “What are the bills Donald Trump has signed?” 3 Jul 2017.", "Lee, MJ, et al. “GOP Obamacare repeal bill fails in dramatic late-night vote.” CNN. 28 Jul 2017.", "Azari, Julie. “A President’s First 100 Days Really Do Matter.” FiveThirtyEight.com. 17 Jan 2017.", "Walsh, Kenneth. “The First 100 Days: Franklin Roosevelt Pioneered the 100-Day Concept.” U.S. News and World Report. 12 Feb 2009.", "Cohen, Adam. “Franklin D. Roosevelt: The First 100 Days.” Time. 24 Jun 2009.", "Miller Center. “Franklin D. Roosevelt – Key Events.” University of Virginia. Accessed 23 Aug 2017.", "Wolters Kluwer. “Wolters Kluwer’s Blue Chip Economic Indicators Panelists Now Anticipate Softer-Than-Previously Predicted Real GDP Growth This Quarter, but Leave Consensus Forecast of Annual Growth Unchanged.” Cision News Wire. 15 Mar 2017.", "Wolters Kluwer. “Wolters Kluwer’s Blue Chip Economic Indicators Panelists Anticipate a Rebound in Real GDP Growth and a Rise in Interest Rates at FOMC June Meeting.” Cision News Wire. 13 Jun 2017.", "Federal Reserve Bank of Atlanta. GDPNow RSS feed. Accessed 23 Aug 2017.", "Bureau of Labor Statistics. “Employment, Hours, and Earnings from the Current Employment Statistics survey (National); Average Weekly Earnings of All Employees, 1982-1984 Dollars.” Data extracted 23 Aug 2017.", "Bureau of Labor Statistics. “Employment, Hours, and Earnings from the Current Employment Statistics survey (National); Average Weekly Earnings of production and nonsupervisory employees, 1982-1984 Dollars.” Data extracted 7 Oct 2016.", "Bureau of Labor Statistics. “Labor Force Statistics from the Current Population Survey; Unemployment Rate, Seasonally Adjusted.” Data extracted 23 Aug 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]