["By Lori Robertson", "Posted on August 11, 2017", "TV ads from a Democratic group warn seniors that “right now, your Medicare coverage is in danger,” claiming “deep, automatic cuts” could be made by “unelected Washington bureaucrats.” But those cuts, according to current estimates, wouldn’t be implemented until 2023, and they would amount to .002 percentage points of Medicare growth that year.", "It’s true that more automatic cuts to the growth of spending are expected in future years. But like many political messages about Medicare, these ads feature scare tactics — warning of cuts that could “restrict access to doctors” and “deny care” — when we don’t yet know what any cost-cutting would entail.", "The ads, from Majority Forward, a 501(c)(4) formed to support Democratic candidates and affiliated with the Senate Majority PAC, are airing in Montana and North Dakota, in support of Democratic Sens. Jon Tester and Heidi Heitkamp. Another ad on this topic — featuring circling sharks to represent the “bureaucrats” who “want to take a bite out of your Medicare” — is airing in Indiana, in support of Democratic Sen. Joe Donnelly. All three ads say these senators are working to stop these cuts, and they have co-sponsored legislation that would do so.", "What the ads don’t say is that these reductions to Medicare growth are now several years away.", "The TV ads are referring to the Independent Payment Advisory Board, or IPAB, which was created by the Affordable Care Act as a way to slow the growth in Medicare spending. The ACA, signed into law in March 2010, called for a 15-member panel that would be tasked with cutting the growth of Medicare if spending on the program exceeded certain targets.", "The IPAB has been the target of criticism. Two months ago, we saw a $2 million ad buy from a group called Healthcare Leadership Council, a coalition of insurers, health clinics, pharmaceutical companies and others, urging a repeal of the board.", "The idea was controversial from the start — former Republican vice presidential nominee Sarah Palin called the board a “death panel” in 2010, while Republicans, including House Speaker Paul Ryan, repeatedly said it was made up of “unelected, unaccountable bureaucrats,” language that’s echoed in the ads supporting Democratic senators.", "Fiscal groups such as The Concord Coalition and the Committee for a Responsible Federal Budget have supported IPAB, saying that it’s necessary to find ways to control growing health care costs and that the board can operate without the political pressure rampant in Congress. “Ultimately, in a country struggling mightily with unaffordable health care costs now, and destined to struggle even more in the future, IPAB is one of the institutions that gives some hope that if we figure out how to control costs, we just might be able to put that knowledge to use,” Joshua Gordon, policy director at The Concord Coalition, wrote in a guest column for CNN Money in 2011.", "But so far, there is no board: It doesn’t have any members and hasn’t done anything. The supposed “bureaucrats” who “want to take a bite out of your Medicare,” as the Majority Forward ad in Indiana says, don’t even exist yet.", "If the board is created in the future, the law stipulates that the president must consult with congressional leadership and appoint members with the “advice and consent of the Senate,” a March 2017 Congressional Research Service report on the IPAB says. The IPAB members must “possess recognized expertise in health finance and economics, actuarial science, health facility management, health plans and integrated delivery systems, and reimbursement of health facilities,” the CRS report explains, and include representatives of consumers and the elderly.", "The board hasn’t been needed because Medicare spending growth has remained below targets set by the ACA that would trigger IPAB action. And the latest report by the Medicare trustees says the IPAB isn’t expected to be triggered until 2021, with any required cuts implemented two years later.", "Here’s how the trigger works: The actuary for the Centers for Medicare & Medicaid Services estimates per capita Medicare growth, and each year those estimates are published in a report from the Medicare trustees. The IPAB determination looks at a five-year projected average — the per capita growth for two years prior, the current year and two years later. Cuts would be required under the law if that rolling average exceeded the target. That target has been tied to inflation and medical care inflation, but next year, the target changes to the growth of per capita gross domestic product plus 1 percentage point.", "Once triggered, the IPAB must issue recommendations the following year on how to cut spending to keep growth below the savings target established by the actuary. And if there’s no board, the secretary of health and human services instead would make the recommendations for cuts.", "The cuts would then be implemented the year after that, though Congress can choose to implement its own changes to keep spending below the target. Congress can’t change the fiscal targets in other legislation, either, unless a three-fifths majority in the Senate waives that requirement.", "Last year, the Medicare trustees report estimated that the IPAB would be triggered in 2017 for the first time, requiring a 0.2 percentage point cut in Medicare spending growth, “a relatively small difference,” CMS Chief Actuary Paul Spitalnic said at a Brookings Institution event last June in explaining that the projection could change. And it did with the 2017 report, released July 13. The IPAB wasn’t triggered, and now isn’t expected to be until 2021, with savings implemented two years later.", "The estimated difference between Medicare growth and the IPAB target is even smaller — 0.002 percentage points.", "Medicare trustees report, July 13, 2017: As a result of the other savings provisions incorporated into current law, the Trustees estimate that the IPAB provision will reduce Medicare growth rates for the first time in 2023, and by only 0.002 percent in that year. In addition, the Trustees project that rates will be reduced by similar small amounts in 2026, 2027, 2028, 2030, 2033, and 2035", "It’s certainly possible that that gap could widen, or go away, or that the IPAB could be triggered sooner.", "How “deep” could these cuts be? And could they “restrict access to doctors … deny care and cost you and your family more,” as the TV ads say? We can’t predict what action the IPAB provision could spark in the future, but the board is limited in what it can do. It can’t increase beneficiaries’ premiums or cost-sharing, or restrict benefits, but it could reduce payments to health care providers.", "Medicare spending totaled $678.7 billion in 2016 — about 15 percent of the total federal budget — and the health care program covered 56.8 million people, 84 percent of them age 65 and older and 16 percent people with disabilities. The current projections for IPAB cuts would involve well under 1 percent of Medicare spending. Of course, the cuts could be larger in the future, and accumulate over time. But the IPAB is limiting to cutting no more than 1.5 percent of total Medicare payments in a given year, even if the gap between spending growth and the target is larger, a 2011 analysis by the Kaiser Family Foundation explains.", "The Affordable Care Act stipulates that the board “shall not include any recommendation to ration health care, raise revenues or Medicare beneficiary premiums” or “increase Medicare beneficiary costsharing (including deductibles, coinsurance, and copayments), or otherwise restrict benefits or modify eligibility criteria” (page 490).", "The Kaiser Family Foundation analysis says that any recommended reductions would then come from “Medicare Advantage, the Part D prescription drug program, skilled nursing facility, home health, dialysis, ambulance and ambulatory surgical center services, and durable medical equipment.” Payments to health care providers, including hospitals could also be cut, starting in 2020.", "Juliette Cubanski, associate director of KFF’s Program on Medicare Policy, told us in a phone interview that beyond “basic guidelines,” the ACA “left a lot of latitude” for the board.", "She said it was “a bit of a stretch” to draw conclusions about how any cuts could affect access to doctors and medical care without knowing more specifically what the board or HHS secretary might have in mind. Even small spending reductions can lead to big battles, however, when it comes to Medicare.", "“Depending on where those cuts are made, it could affect some providers more than others, if indeed they go for provider cuts to achieve the savings,” said Cubanski, who holds a Ph.D. in health policy from Harvard.", "Majority Forward’s support for the ad points to a February letter to Congress from the Healthcare Leadership Council, signed by many health care organizations across the country, warning that cuts to provider payments “would be devastating for patients, affecting access to care and innovative therapies,” as some physicians wouldn’t accept new patients under lower rates.", "The 2011 KFF analysis, which Cubanski co-authored, said there was “ambiguity” in the law that could lead to IPAB proposals that could affect Medicare beneficiaries.", "Kaiser Family Foundation, “The Independent Payment Advisory Board: A New Approach to Controlling Medicare Spending”: Despite efforts to limit the reach of IPAB with respect to beneficiaries, there is some ambiguity in the ACA that could leave room for proposals that could directly or indirectly affect beneficiaries. The statute explicitly takes benefits, premiums, cost sharing, and “rationing” out of the scope of IPAB’s general authority, which appears to remove beneficiary issues from consideration. Yet, it is not entirely clear which proposals would be outside the scope of IPAB’s authority. …", "If IPAB recommends policies that squeeze Medicare payment rates without equal pressure being placed on private payment rates, there is some concern that Medicare beneficiaries would be at greater risk of having access problems, as providers become more inclined to serve other patients. While the ACA requires that proposals achieve the savings target “…while maintaining or enhancing beneficiary access to quality care…” there is no further clarification of how this is to be determined.", "The law allowed for a joint resolution to abolish the IPAB this year — and such resolutions were introduced in the House and Senate. But they needed to be approved by three-fifths of each House by Aug. 15. There are other pieces of legislation, two in the Senate and one in the House, that would repeal IPAB provisions from the Affordable Care Act. All of these measures were introduced in February and referred to committee.", "Tester and Heitkamp are co-sponsors of the Democratic Senate bill and, along with Donnelly, co-sponsors on the joint resolution.", "These TV ads warn that “right now, your Medicare coverage is in danger.” Actually, “right now,” we don’t know what will happen if IPAB is triggered and we could be several years away from finding out.", "Interestingly, to support that line about Medicare being in “danger,” Majority Forward pointed to the Medicare trustees’ estimate that the trust fund for Part A, which pays hospital expenses, would be depleted in 2029. If Congress doesn’t act to shore up financing, the tax revenue for Part A would cover only 88 percent of costs, the trustees said. But the “automatic cuts” the ad warns about would improve Medicare’s finances.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]