["“Aap jante hai DNA mein research par sabse zyada zor diya ja sakta…diya jaata hai (You know that DNA can give…gives research the most importance),” said Sudhir Chaudhary a few minutes into the July 3 broadcast of his flagship show, Daily News and Analysis or more popularly, DNA.", "During the length of the 7:50-minute program, Chaudhary claimed to have discerned the ‘truth’ behind newly-elected TMC MP Mahua Moitra’s recent speech, which he termed as ‘hateful’. To give context, Moitra had warned of seven “early signs of fascism” rising in India during her maiden speech in the Parliament on June 25.", "Chaudhary tweeted images of the article from where, he claimed, words were “stolen” for Moitra’s speech. “The Parliament’s dignity is in danger,” he wrote.", "यही है अमेरिकी वेब्सायट का वो लेख जिसे तृणमूल कांग्रेस की सांसद महुआ मोइत्रा ने चुराकर लोक सभा में अपने भाषण में इस्तेमाल कर लिया।हुबहू बिलकुल वही शब्द लेख से सीधे उठा लिए और बोल दिए।संसद की गरिमा ख़तरे में है। https://t.co/4iP3YieHXA pic.twitter.com/HxaHqqdxKS", "— Sudhir Chaudhary (@sudhirchaudhary) July 2, 2019", "Chaudhary alleged that the MP’s speech was plagiarised from a 2017 article which spoke about “12 early warning signs of fascism” in Donald Trump’s America. “Her speech replaced ‘Trump’ with ‘Modi’,” asserted the journalist while holding a printout of the said article to the camera.", "The name of the article’s author – Martin Longman – is faintly visible upon a close look at the piece of paper in Chaudhary’s hands. On January 31, 2017, such an article was indeed penned by Longman, published in Washington Monthly. The author claimed that the signs stood hung on a poster in the US Holocaust Museum.", "Many other prominent individuals – Shobha De, Makarand Paranjape, Kanchan Gupta – had claimed Moitra’s speech was plagiarised before Zee News ran an entire show on the assertion. Vivek Agnihotri also made the same allegation.", "Is Mahua Moitra a plagiarist? Compare https://t.co/XdRr0rDDW7 & https://t.co/LeVeOEIFnA The words aren’t identical but the basic structure (using the Holocaust memorial poster) & ideas have been lifted; instead of @realDonaldTrump she’s lambasting @narendramodi on similar lines.", "— Makarand R Paranjape (@MakrandParanspe) July 1, 2019", "The ‘truth’ about Moitra’s speech which Chaudhary claimed to have investigated, was a misreport. Towards the end of her Parliamentary address, the MP had mentioned the source of her inspiration behind the address.", "At 9:12 minutes in the video below, she can be heard saying, “In 2017, the United States Holocaust Memorial Museum put up a poster in its main lobby and it contained a list of all the signs of early fascism. Each of the seven signs I have pointed to you, features on that poster.”", "Longman, in his 2017 article, had referenced the same poster/sign that Moitra talked about. It is noteworthy that a 2017 fact-check by American website Snopes had found that the poster was not on display at the museum but was available in its gift shop.", "After a controversy was sparked by Zee News and several others, Longman tweeted that Moitra is being “falsely accused” of plagiarism.", "I’m internet famous in India because a politician is being falsely accused of plagiarizing me. It’s kind of funny, but right-wing assholes seem to be similar in every country.", "— Martin Longman (@BooMan23) July 2, 2019", "He reiterated the same in another tweet.", "Whether they reach out to me or not, this is ridiculous. She didn’t steal or plagiarize anything.", "— Martin Longman (@BooMan23) July 3, 2019", "In a press statement, Moitra clarified that her speech was inspired by “the poster from the Holocaust Museum created by Sr Lawrence W Brit pointing out the 14 signs of early fascism.” She wrote, “I found seven signs relevant to India and spoke at length about each of them” and further added that she mentioned her source during the address and “plagiarism is when one does not disclose one’s source.”", "pic.twitter.com/hq6ao57Hc7", "— Mahua Moitra (@MahuaMoitra) July 3, 2019", "Alt News found a copy of an excerpt where Dr Britt spoke about the 14 signs. It was published in the Free Inquiry Magazine, Vol 22 no 2, on July 15, 2003.", "A speech was reported to be plagiarised by Zee News when, in fact, TMC MP Mahua Moitra had used a piece of literature as a reference and had mentioned the same during her address. After the same was pointed out to Sudhir Chaudhary by several people, including the author of the article, he wrote in a tweet, “the #TukdeTukdeGang has been demolished and is crying foul again,” instead of rectifying the misreport.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]