["Democratic presidential candidates, former New York City Mayor Mike Bloomberg speaks during a Democratic presidential primary debate on Feb. 19, 2020, in Las Vegas, hosted by NBC News and MSNBC. (AP)", "The video makes it look like Bloomberg left the other presidential candidates speechless for 20 seconds after claiming he was the only one who had started a business.", "In fact, there was a two-second pause. The video was selectively edited to splice together unrelated moments of expressive faces from his rivals.", "Democratic presidential candidates jumped over each other to land rhetorical punches against Mike Bloomberg at the Las Vegas debate, hitting the billionaire former mayor over redlining, stop and frisk, and his past critiques of Barack Obama.", "Bloomberg selected a different highlight to share on Twitter the next day.", "The video starts with Bloomberg on stage saying, \"I’m the only one here I think that’s ever started a business. Is that fair?\"", "In the video, Bloomberg’s question is met with silence and blank stares from the other Democrats on stage. The sound of crickets plays in the background.", "\"OK,\" he says at the end of the 25-second clip.", "Anyone? pic.twitter.com/xqhq5qFYVk", "Bloomberg’s video makes it look like he left the other presidential candidates speechless for 20 seconds. But that’s not what actually happened. In fact, there was a two-second pause between when the former mayor said \"Is that fair?\" and \"OK.\"", "Here are Bloomberg’s full remarks, which came in response to a question about his stance on redlining:", "\"I've been well on the record against red-lining since I worked on Wall Street. I was against it during the financial crisis. I've been against it since.", "\"The financial crisis came about because the people that took the mortgages, packaged them, and other people bought them, those were — that's where all the disaster was. Red-lining is still a practice some places, and we've got to cut it out. But it's just not true.", "\"What I was going to say, maybe we want to talk about businesses. I'm the only one here that I think that's ever started a business. Is that fair? OK.\"", "His last comment was met with laughter from the audience.", "The video was selectively edited to make Bloomberg’s debate performance look better than it was — splicing together unrelated moments of expressive faces from his rivals.", "RELATED: Bloomberg on the defensive, fact-checking the Las Vegas Democratic debate", "On Twitter, some users took it a step further, saying the clip is a \"deepfake\" and a violation of the platform’s new policy against manipulated videos.", "According to Twitter’s policy on \"synthetic and manipulated media,\" the company is only likely to remove videos that have been \"significantly and deceptively altered or fabricated,\" \"shared in a deceptive manner\" and are \"likely to impact public safety or cause serious harm.\"", "As of now, Bloomberg’s video does not appear to meet those standards. Twitter may label clips that meet just one of the criteria, but it has not yet done so for Bloomberg’s tweet.", "A deepfake video is one that uses artificial intelligence to make it look like someone is doing or saying something that never occurred. In contrast, the clip that Bloomberg shared is an example of what the Washington Post calls \"splicing,\" or \"editing together disparate videos\" that \"fundamentally alters the story that is being told.\"", "Bloomberg’s video is the latest example of deceptive video editing techniques being used in the 2020 election.", "On Feb. 6, President Donald Trump tweeted an edited video of his State of the Union address. The clip makes it look like House Speaker Nancy Pelosi ripped up her copy of the speech after Trump introduced each of his guests, which included military families and a young woman receiving a scholarship.", "In fact, Pelosi waited until the end of the address to rip up her copy. And she stood and clapped for many guests.", "PolitiFact reached out to Twitter and the Bloomberg campaign for comment, but we haven’t heard back.", "Bloomberg tweeted a video that purports to show a 20-second pause from Democratic candidates at the Las Vegas debate after he claimed he was the only one who had started a business.", "The video was selectively edited to splice together unrelated moments of expressive faces from his rivals. In fact, there was a two-second pause after Bloomberg brought up his business experience.", "Bloomberg’s video contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "NBC News, \"Full transcript: Ninth Democratic debate in Las Vegas,\" Feb. 20, 2020", "PolitiFact, \"Trump tweeted a video of Pelosi ripping his State of the Union speech. Here’s what you need to know,\" Feb. 11, 2020", "PolitiFact, \"10 most aired political ads, fact-checked,\" Nov. 3, 2016", "Poynter, \"The future of the deepfake — and what it means for fact-checkers,\" Dec. 17, 2018", "TV Eyes, accessed Feb. 20, 2020", "Tweet from Michael Bloomberg, Feb. 20, 2020", "Twitter, \"Building rules in public: Our approach to synthetic & manipulated media,\" Feb. 4, 2020", "The Washington Post, \"The Fact Checker’s guide to manipulated video,\" accessed Feb. 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]