["About this rating", "The summer of 2018 marked another significant chapter in the ongoing debate over religious freedom and discrimination in the U.S., when the Supreme Court issued a narrow ruling that favored Colorado baker Jack Phillips, who had refused to accept a commission to create a wedding cake for a gay couple.", "The following month, the Facebook page of the prolific junk news site \"America's Last Line of Defense\" posted a meme positing that a major restaurant chain had followed suit, citing the owners' Christian faith as a reason for barring supporters of President Donald Trump from their outlets:\n\nThe claim in the meme was fabricated, as was the quotation: The Outback Steakhouse chain has not banned Trump supporters from their restaurants, nor has any company official made a statement even remotely similar to the one included in the meme. Both elements were fictions invented by America's Last Line of Defense, which is part of a network of fake news sites dedicated to spreading political misinformation under the guise of proffering “satire.\"  \nDue to its ubiquity in the U.S., Outback Steakhouse has been the subject of several reports and rumors that have gone viral on social media over the years:\no In 2016, Facebook users shared an anecdote about an Outback franchise manager's angrily refusing to admit a supporter of presidential candidate Donald Trump, despite scant details and little corroboration.  \no In February 2018, a Tennessee Wildlife Resources Agency officer was asked to leave an Outback Steakhouse franchise after another customer, frightened by the firearm he was carrying, reported it to management. Many news reports incorrectly stated that the agent was a state trooper or police officer, and the company was forced to correct claims that their restaurants were gun-free zones.\no In the early 2000s Outback Steakhouse became the subject of an old (and false) rumor about unwitting diners' being served urine-covered steaks", "The following month, the Facebook page of the prolific junk news site \"America's Last Line of Defense\" posted a meme positing that a major restaurant chain had followed suit, citing the owners' Christian faith as a reason for barring supporters of President Donald Trump from their outlets:", "The claim in the meme was fabricated, as was the quotation: The Outback Steakhouse chain has not banned Trump supporters from their restaurants, nor has any company official made a statement even remotely similar to the one included in the meme. Both elements were fictions invented by America's Last Line of Defense, which is part of a network of fake news sites dedicated to spreading political misinformation under the guise of proffering “satire.\"", "Due to its ubiquity in the U.S., Outback Steakhouse has been the subject of several reports and rumors that have gone viral on social media over the years:", "o In 2016, Facebook users shared an anecdote about an Outback franchise manager's angrily refusing to admit a supporter of presidential candidate Donald Trump, despite scant details and little corroboration.", "o In February 2018, a Tennessee Wildlife Resources Agency officer was asked to leave an Outback Steakhouse franchise after another customer, frightened by the firearm he was carrying, reported it to management. Many news reports incorrectly stated that the agent was a state trooper or police officer, and the company was forced to correct claims that their restaurants were gun-free zones.", "o In the early 2000s Outback Steakhouse became the subject of an old (and false) rumor about unwitting diners' being served urine-covered steaks", "Liptak, Adam.   \"In Narrow Decision, Supreme Court Sides eith Baker Who Turned Away Gay Couple.\"\r\n    The New York Times.   4 June 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]