["The two-minute 20-second footage appeared here on Facebook on June 10, 2020. It has been watched more than 500 times.", "The Indonesian-language post translates to English as: “The Governor of Jakarta (Anies Baswedan) received an international award as the best governor in handling the Covid -19 Pandemic.”", "Anies Baswedan is the governor of Indonesia’s capital Jakarta.", "As of June 14, 2020, Indonesia has recorded more than 38,000 confirmed cases of COVID-19 and more than 2,100 deaths, according to the Health Ministry data here. The number of confirmed infected patients in Jakarta has reached more than 8,800 – the highest in the country.", "The footage has been viewed more than 4,900 times after it was posted with a similar claim on Facebook here, here, here and here; as well as on YouTube here.", "The claim is misleading; the footage shows the governor taking part in a global online summit with other city leaders from around the world about responses to the COVID-19 crisis.", "A reverse image search on Google followed by a subsequent keyword search found the original clip was uploaded on here on the YouTube channel of the Seoul city government on June 2, 2020, titled: “CAC2020 | Mayoral Meeting | CAC(Cities Against COVID-19) Global Summit”.", "The video’s caption reads, in part: “CAC Global Summit DAY 2: Mayoral Meeting In this time of pandemic, cities need global cooperation and solidarity to overcome the crisis. Mayors/officials from 40 cities around the world gather to respond to the COVID-19 crisis together!”", "CAC (City Against COVID-19) Global Summit was an online event that invited experts and leaders from around the world to share their expertise and experience in handling the pandemic, according to the official website here.", "The scene in the misleading video starts at the 49:01 mark of the original video.", "Below is a screenshot comparison of the scenes in the misleading footage (L) and in the original video (R):", "In the original video, Anies Baswedan can be seen speaking alongside other city leaders from around the world, including Seoul Mayor Park Woon-soon; London Mayor Sadiq Khan; Moscow Mayor Sergei Sobyanin; Colombo Mayor Rosy Senanayake and others.", "The programme of the Mayoral Meeting on June 2, 2020, matches the event seen in the video; neither the video nor the programme mentions any award ceremony.", "Anies also posted a video of the CAC 2020 meeting, which includes the Indonesian subtitle seen in the misleading video, on his Instagram account here on June 6, 2020. He also did not mention any award ceremony in the Instagram post.", "A post shared by Anies Baswedan (@aniesbaswedan) on Jun 6, 2020 at 7:26am PDT", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]