["This Facebook post from November 29, 2020 shared the image showing a large bronze statue in front of a well-lit building.", "“South Africa erects a statue of Raila Odinga,” reads the caption, referring to Kenya’s former prime minister. “To signify respect in common for Raila Odinga and Nelson Mandela for fighting democracy.”", "The Facebook page that shared the photo, called Marigiri, is categorised as a public figure. It has more than 30,000 followers and predominantly posts news about Kenyan politics.", "The post about the statue sparked a lively debate about democracy in the comments section.", "Similar posts have been circulating here and here on Facebook.", "The statue, however, is not of Odinga but former South African president Nelson Mandela.", "It stands 6m tall and weighs 2.5 tons, and is located at the entrance to Nelson Mandela Square, an upmarket shopping centre in the affluent suburb of Sandton in Johannesburg.", "Part of the mall’s name can be seen in the misleading post, with the letters “NDELA” visible behind the statue’s left shoulder.", "Cast in bronze, the statue was unveiled on the centre’s 10-year anniversary in March 2003. The unveiling also served as a celebration of 10 years of democracy in South Africa and saw the shopping centre’s name change from Sandton Square to Nelson Mandela Square.", "Mandela was elected in 1994 after almost three decades in jail for leading a political struggle against the apartheid regime, which officially ended that year.", "The Nobel Peace Prize winner is widely hailed as a hero of South Africa's liberation movement. Mandela stepped down after five years in office and later retired from political life.", "He died in December 2013 aged 95.", "As reported by AFP, Odinga, a 75-year-old opposition politician and erstwhile prime minister, is now emerging as the likely successor to President Uhuru Kenyatta, who cannot run for a third term.", "Kenyatta stunned the nation in 2017 by striking an unexpected deal with his longtime rival Odinga, pledging to work together to promote unity after a drawn-out election battle between the two had left dozens dead.", "Known universally as \"the handshake\", the March 2018 pact between Kenyatta and Odinga eased the political violence.", "The next Kenyan general election is due to take place on August 9, 2022.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]