["COVID-19 cases are on the rise in the national caption. On November 26, Hindustan Times reported that the AAP government told the Delhi High Court that it is considering imposing a night curfew or weekend restrictions to contain the situation.", "In the backdrop of this, several Twitter users have posted a video with the text, “Without mask 10 hours jail in Delhi and soon to be followed on Mumbai, Bangalore, Hyderabad and other States.”", "Without mask 10 hours jail in Delhi and soon to be followed on Mumbai, Bangalore, Hyderabad and other States@hvgoenka pic.twitter.com/BsWiZgpP7U", "— @Girish Parundekar (@G_Parundekar) November 24, 2020", "Similarly, several Facebook users shared the two-minute video with the similar claim.", "Four seconds into the video, Alt News noticed the number plate of the police vehicle — MP037578. As per Ministry of Road Transport and Highway portal e-Vahan, the vehicle is registered at the Bhopal RTO in Madhya Pradesh.", "This slideshow requires JavaScript.", "This led us to the same clip uploaded by Zee News on November 22. As per the report, the incident took place in Ujjain where people who weren’t wearing masks were detained by the police.", "The same was also reported by News18 on November 23. Ujjain’s additional SP Amarendra Singh told News18 that as per the magistrate’s order, those who didn’t wear a mask would be arrested and imprisoned for 10 hours. As per Singh, this is a joint operation by Ujjain police and the municipal corporation to prevent coronavirus from spreading.", "Thus, a video from Ujjain that shows policemen detaining people for not wearing masks was shared as Delhi on social media.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]