["About this rating", "On or around 31 March 2016, Facebook users began sharing links to what looked like a link to news reports that department store Kohl's had declared bankruptcy, and was closing soon 818 stores across the United States.", "Shares of the Kohl's claim looked like this:", "It didn't take a lot of sleuthing to spot two major red flags in the Facebook posts. First, the name Kohl's was rendered \"Khol's\" in the headline. That would be a large error for a major outlet such as Reuters (to whom the link appeared to be attributed), except that \"Reuters,\" too was misspelled as \"Routers.\"", "Unsurprisingly, the claim wasn't credible. Anyone who clicked through before sharing the link viewed what appeared for a split-second to be a business article (nothing in appearance like content hosted by Reuters):", "Almost immediately, the dummy article was replaced by the following text and images:", "The fabricated news link was created with PunkShare (a prank generator similar to FeedNewz), which enabled social media users to generate shocking false headlines for sharing on social media. The user-generated pranks tended to get away from their intended audiences and into the wilds of social media rather quickly, and often involved rumors claiming popular chain stores or restaurants were closing nationwide. In March 2016, a spate of similar sites created constellations of false rumors about celebrities moving to small towns.", "As the hoax itself indicated, Kohl's confirmed on 22 March 2016 that 18 stores were closing, or less than two percent of the approximately 1,162 locations (not 818) currently open for business across the United States.", "Peterson, Hayley.   \"See Whether Your Local Kohl's Is Shutting Down.\"\r\nBusiness Insider.   22 March 2016.", "Wikpedia.   \"Kohl's.\"", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]