["This Facebook post was published on January 28, 2020.", "The screenshot of the purported 7News Facebook post has a caption that reads: “Warning: There have been reports that the Coronavirus has made its way into the Macarthur Area. What we know is that a 18 yearold male has presented himself to the Campbelltown Hospital showing the symptoms and testing positive for the virus. officials are urging everyone to wear facemask and be cautious and reduce travel until it is contained.”", "The headline of the purported linked article reads: “Macarthur Region: Man test positive for coronaVirus”.", "Below is a screenshot of the misleading post:", "As of February 3, 2020, Australia’s Department of Health had confirmed 12 cases of the novel coronavirus. The virus has killed at least 360 people in China and infected more than 17,000 people since its outbreak in December 2019, as reported here by AFP on February 3, 2020.", "Other instances of the purported screenshot were also published on Facebook here, here, here and here with a similar claim.", "The claim is false; 7News’ social media manager Brenden Wood said the Facebook post was never published by the organisation.", "“The Facebook content was never published by our news outlet,” Wood told AFP via Twitter direct message on January 30, 2020.", "The New South Wales health authority stated that there were no confirmed novel coronavirus cases in the Macarthur region, which is situated southwest of Sydney and comprises the townships of Campbelltown and Camden.", "“There are four confirmed cases of the novel coronavirus in NSW. None of these are in South Western Sydney,” a spokesperson for New South Wales Health told AFP via email on January 30, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]