["In this February 10, 2019 Facebook post, which has been shared more than 32,000 times, the doctored picture of Enrile is part of a four-picture montage of images showing well-known Philippine politicians in wheelchairs.", "The writing above the images, when translated to English, says: “This is the life of a politician in the Philippines. When it’s election time, they RUN. When they have a case, they become CRIPPLED”.", "Below is a screenshot of the post:", "The photograph in the bottom left corner shows Enrile apparently sitting in a wheelchair with his arm in a sling.", "Enrile, who is 95, has been charged with plunder but a 2015 Supreme Court ruling allowed him to post bail on health grounds. Here is a transcript of the court decision.", "Enrile has previously served in the Philippines legislature and is running in May’s elections for a seat in the upper house Senate.", "A reverse image search traced the image of Enrile, who has previously expressed support for Philippine President Rodrigo Duterte, back to a royalty free stock image posted on the website of Shutterstock, an American stock photography provider.", "Below is a screenshot of the photo on the Shutterstock website:", "The caption of the image says: “Photo of a mature male with various injuries in a wheelchair, he’s wearing a neck brace, arm sling and leg cast and has a black eye, isolated on a white background”.", "Key details in the doctored photo and the original image are the same -- for example, the man is wearing blue checkered pants, a neck brace and has one leg in a white cast.", "An additional reverse image search traced the photo of Enrile’s face, which has been added on top of the original stock image of a man in a wheelchair, back to this photo tweeted by local news organization ABS-CBN in 2018.", "Former senate president Juan Ponce Enrile has this to say to those who are doubting whether he is still capable of doing the job of a senator. #Halalan2019 https://t.co/DNzDwnRvH2 pic.twitter.com/IsBDuHD6wY", "Comments such as the one below indicate that some Facebook users believed that Enrile was actually in the doctored photo:", "This comment, when translated to English, says: “That’s Enrile, the one with the cast on his foot and arm. When he got out, he suddenly became strong. The one who started the gimmick of being sick and weak/old supposedly is none other than the Patroness of Plunderers, imelda”.", "The other three images in the misleading photo montage show three well-known Philippine politicians, all of whom have faced corruption charges, in wheelchairs.", "The image in the top left shows former Philippine president Gloria Macapagal Arroyo, who was charged with plunder but acquitted by the Supreme Court in 2016.", "The photo was taken in 2011 at Manila airport, when Arroyo, who was then facing election fraud charges, was trying to fly to Hong Kong for medical treatment but was blocked from leaving the country by the Department of Justice, which issued a hold departure order against her.", "Below is a screenshot of the photograph which was used in media reports in 2011:", "Arroyo is currently the House Speaker and can be seen in this 21 February, 2019 post on the official House of Representatives website at a ribbon cutting event, where she is not using a wheelchair.", "The top right image in the misleading Facebook post is a 2004 AFP photograph of former president Joseph Estrada, who was convicted of plunder in September 2007 but pardoned by then-president Arroyo less than a month later.", "The photograph’s caption says: “Deposed former Philippines president Joseph Estrada waves to the press upon his arrival at the Hong Kong Adventist Hospital for his knee surgery, 27th December 2004. Estrada, who is being tried on corruption charges, forcefully denied speculation that he intended to flee to a third country after being treated for arthritis in his legs in Hong Kong hospital.”", "Below is a screenshot of the AFP photograph:", "Estrada is currently Manila mayor.", "The bottom right is a 2017 AFP photograph of Imelda Marcos, the wife of deceased Philippine dictator Ferdinand Marcos. She was convicted in 2018 of graft for funneling $200 million USD through Swiss foundations in the 1970s, but has said she will appeal the decision.", "The caption of the image says: “Former Philippine first lady and now congresswoman Imelda Marcos is assisted to her car after visiting the tomb of former Philippine president and late dictator Ferdinand Marcos on National Heroes' Day at the Heroes Cemetery in Manila on August 28, 2017.”", "Below is a screenshot of the AFP image:", "Imelda Marcos is now congresswoman for the second district of the northern province of Ilocos Norte.", "The misleading photo montage was also posted on the Facebook account of Bagong Alyansang Makabayan Quezon City (New Patriotic Alliance), a left-leaning political party.", "The photo has been shared by different Facebook groups and pages, most of whom oppose President Rodrigo Duterte, and have nearly 650,000 followers between them.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]