["By Angelo Fichera", "Posted on August 18, 2020", "A photo taken at a Black Lives Matter protest in June is now being shared on social media, including by President Donald Trump, with the false claim that it shows a recent rally in Seattle to “demand mail-in voting.”", "President Donald Trump shared a tweet on Aug. 17 falsely claiming that a photo of a sea of protesters shows “thousands of Seattle Democrats” gathered “to demand mail-in voting because it’s too dangerous to vote in-person.”", "The tweet shared by the president was posted the day before on an account called “Walter Cronkite,” a reference to the late broadcast journalist known for his credibility and reliability. The account’s biography includes the hashtag “#fakenews.”", "Facebook posts also amplified the falsehood, gaining thousands of shares in a number of hours.", "The photo was indeed taken in Seattle — but it actually shows a Black Lives Matter protest from early June.", "A reverse image search of the picture brought us to a post on the website westseattleblog.com. The June 6 post identified the photo as a protest in West Seattle and credited the image to Paul Weatherman.", "Weatherman, who identifies on Twitter as a Seattle-based aerial photographer, posted the image and others the same day on Twitter.", "So the image doesn’t show a protest “to demand mail-in voting.”", "Mail-in voting is nothing new for Washington, which is one of five states that already conducts “all-mail elections,” according to the National Conference of State Legislatures.", "Another 29 states and Washington, D.C., have “no excuse” absentee or mail-in voting, according to NCSL, meaning anyone can choose to vote by mail without specifying a reason. And about a quarter of ballots cast in the 2018 general elections nationwide were by mail, as we’ve explained before.", "But amid a push for mail-in voting in response to the COVID-19 pandemic, there are concerns that Trump’s opposition to additional funding for the cash-strapped U.S. Postal Service and operational changes made by the new postmaster general, Louis DeJoy, would prevent the Postal Service from handling the increase in mail-in ballots.", "On Aug. 18, the postmaster general announced that he would be “suspending” such “operational initiatives” until after the election is concluded — “[t]o avoid even the appearance of any impact on election mail.”", "There have been some protests in recent days targeted at DeJoy, including in North Carolina and Washington, D.C.", "Trump and his reelection campaign have attempted to undermine the process of mail-in voting — drawing false distinctions between mail-in and absentee ballots, for example, and advancing the specter of potential fraud by using faulty premises.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Kiely, Eugene. “Trump Proves Biden Right on USPS Funding, Mail-In Ballots.” FactCheck.org. 14 Aug 2020.", "Kiely, Eugene, et. al. “The President’s Trumped-Up Claims of Voter Fraud.” FactCheck.org. 30 Jul 2020.", "Farley, Robert. “Trump Campaign Exaggerates Potential for Mail-In Voting Fraud After Election.” FactCheck.org. 14 Aug 2020.", "“Postmaster General Louis DeJoy Statement.” Press release, U.S. Postal Service. 18 Aug 2020.", "Record, Tracy. “PHOTOS/VIDEO: West Seattle Junction fills with sea of protesters affirming ‘Black Lives Matter!’” West Seattle Blog. 6 Jun 2020.", "Rieder, Rem. “Voting by Mail in the Swing States.” FactCheck.org. 7 Aug 2020.", "Teo, Armus. “As the House demands an interview with Postal Service chief Louis DeJoy, protesters picket his homes.” Washington Post. 17 Aug 2020.", "“VOPP: Table 1: States with No-Excuse Absentee Voting.” National Conference of State Legislatures. 1 May 2020.", "Weartherman, Paul (@paulweatherman). “@westseattleblog  some aerial shots from the #westseattleprotest #Seattle.” Twitter. 6 Jun 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]