["About this rating", "Among much partisan chatter that U.S. president Donald Trump's behavior at a July 2018 meeting with Russian president Vladimir Putin in Helsinki constituted \"treason,\" many social media users began sharing memes and text asserting the U.S. Constitution specified that if the President of the United States were impeached for treason, the Vice President and all other officers would automatically be removed from office as well:", "Article II Section 4: If the president is impeached for treason, the vice president and all civil officers shall be removed.", "— amrigg (@amrigg) July 17, 2018", "Such claims were erroneous on two counts.", "First of all, impeachment and removal from office are two separate procedures, and the latter does not necessarily follow from the former.", "Impeachment is the process by which a legislative body formally brings charges against a government official, similar to an indictment.  For high government officials such as the President of the United States, that process is undertaken by the U.S. House of Representatives, who must pass articles of impeachment formally stating the allegation(s) against the President.   However, only after the U.S. Senate has conducted a trial and found the defendant guilty (by a two-thirds vote) would the accused be removed from office.", "U.S. Presidents Andrew Johnson and Bill Clinton were impeached, but since both were later acquitted by the Senate, neither was removed from office.", "More important is that the wording of Article II, Section 4 of the U.S. Constitution has been misrepresented here.  It actually reads as follows:", "\"The President, Vice President and all civil Officers of the United States, shall be removed from Office on Impeachment for, and Conviction of, Treason, Bribery, or other high Crimes and Misdemeanors.\"", "This passage merely sets out that the process for removing a President, Vice President, or other high civil officer from government office is through their being impeached and convicted of crimes, including offenses such as treason or bribery.  (The phrase \"high crimes and misdemeanors\" generally means crimes committed by those holding high office, not specifically \"crimes large in scope.\")", "Section 4 of Article II does not state -- or mean -- that if any President, Vice President, or other civil officer is impeached (with or without subsequent conviction), all such persons are also removed from office.  The procedure for impeachment and potential removal from office would apply only to the persons specifically named in the articles of impeachment passed by the House.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]