["About this rating", "A photograph supposedly showing Brad Pitt costumed as Bob Marley was circulated on social media in April 2019 along with the claim that the actor was set to play the Jamaican reggae musician in an upcoming biopic:", "The photograph of Brad Pitt dressed as Bob Marley is genuine. However, this image was already several years old when it circulated in April 2019 and was not connected to any upcoming film projects.", "The photograph was taken by Steve Klein and published in \"Interview\" magazine in 2012. Klein and stylist Ludivine Poiblanc worked to create a number of different looks for Pitt, inspired by entertainment icons such as Bob Marley, Clark Gable, and James Dean:", "Actor Brad Pitt poses for an editorial spread in the most recent issue of Interview Magazine. The 48-year-old takes on several personas for the shoot, transforming into a different character for each black and white frame of the spread, aided by the expert visual skills of photographer Steven Klein and stylist Ludivine Poiblanc. We get to see the handsome star’s range as both a mellow Rastafarian and a glammed up Las Vegas-type hitman. Pitt even echoes the classic look and style of an early Hollywood era leading man similar to Clark Gable, right down to the facial hair.", "Here are a few other images from the series:", "This isn't the first time that online pranksters have used this image of Pitt in dreadlocks to spread false rumors about his supposed involvement in a Bob Marley biopic. A nearly identical jape circulated on social media back in 2014.", "Black Westchester.   \"NO, Brad Pitt Is NOT, Playing Bob Marley in Upcoming Film!\"\r\n    4 October 2014.", "Pinar.   \"The Versatile Brad Pitt Transforms for Interview Magazine.\"\r\n    MyModern.net.   10 October 2012.", "Ritchie, Guy.   \"Brad Pitt.\" \r\n    Interview.   6 October 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]