["About this rating", "Sky New Zealand, a private satellite television provider, temporarily removed Sky News Australia's coverage of the aftermath of the Christchurch mosque attacks from their platform. According to both companies, the decision was mutual.", "The government of New Zealand took no action against Sky News Australia.", "In the aftermath of the March 2019 Christchurch, New Zealand, massacre, in which a white supremacist fatally shot 50 people at two mosques, some observers turned their attention to the role of right-wing and xenophobic commentary in radicalizing violent white supremacists.", "In a manifesto posted online before the attack, alleged shooter Brenton Tarrant singled out conservative American commentator Candace Owens as being \"the person that has influenced me above all,\" adding that she had \"helped push me further and further into the belief of violence over meekness.\"", "Others criticized the role of social media and video-sharing platforms such as Facebook, YouTube, and Twitter in facilitating the spread of far-right propaganda and allegedly not acting quickly enough to remove copies of the shooter's live video of his rampage from their platforms.", "Against that backlash, a report emerged on 16 March that New Zealand had taken the right-leaning Fox News television network off the airwaves in response to their coverage of the mosque shootings.", "The left-leaning website Think Progress published an article with the headline \"New Zealand pulls Murdoch's Sky News Australia off the air over mosque massacre coverage.\"", "In reality, the government of New Zealand took no action against Sky News Australia in the aftermath of the massacre. The attention-grabbing and highly misleading headline in the Think Progress article contrasted sharply with the more nuanced reporting in the body of that article, which read:", "Rupert Murdoch’s 24-hour Sky News Australia has been pulled off the air by independently-owned Sky New Zealand. The decision was made after Murdoch’s channel refused to stop showing graphic video footage shot by the man who killed 49 people at two mosques in Christchurch, New Zealand.", "This was despite calls from the police urging anyone broadcasting the disturbing footage to stop circulating it. 'Police are aware there is extremely distressing footage relating to the incident in Christchurch circulating online,' the New Zealand police said in a statement. 'We would strongly urge that the link not be shared. We are working to have any footage removed.'", "So in the body of their article, Think Progress clearly stated that an independent satellite television provider called Sky New Zealand, and not the New Zealand government or state, had temporarily removed a television network called Sky News Australia from their platform.", "Sky New Zealand is a private company and is not run by the government. There is no connection between it and Sky News Australia, apart from their similar names.", "Sky New Zealand announced their decision on 16 March in a tweet: \"We stand in support of our fellow New Zealanders and have made the decision to remove Sky News Australia from our platform until we are confident that the distressing footage from yesterday's events will not be shared ...\":", "However, as Think Progress correctly reported, Sky New Zealand deleted that tweet and subsequently replaced it with another, which removed the reference to \"distressing footage\" and re-framed the decision as being a collaborative one involving Sky News Australia itself:", "\"We stand in support of our fellow New Zealanders and are working with our colleagues at @SkyNewsAust to ensure coverage doesn’t compromise ongoing investigations in [New Zealand]. We made the decision on Friday with Sky News Australia to replace their live news with sport\":", "We stand in support of our fellow New Zealanders and are working with our colleagues at @SkyNewsAust to ensure coverage doesn’t compromise ongoing investigations in NZ. We made the decision on Friday with Sky News Australia to replace their live news with sport.", "— SKY New Zealand (@SKYNZ) March 16, 2019", "The following day, Sky News Australia's Chief Executive Officer Paul Whittaker reinforced the claim that the decision to temporarily stop showing the channel on Sky New Zealand had been a joint one, as the Guardian reported:", "On Sunday [17 March] the Sky Australia chief executive, Paul Whittaker, said the decision had been taken jointly by the two stations “to ensure any live coverage or commentary taking place in Australia, outside of the NZ jurisdiction, does not impact the unfolding events in NZ”.", "Sky NZ initially declined to confirm why the feed had been changed. But on Wednesday evening, in response to repeated requests from Guardian Australia, it said in a statement the decision was taken “in consultation” with Sky News Australia, and the feed had subsequently been restored.", "“The decision to replace the channel on Sky NZ was done in consultation with Sky News Australia on Friday night to ensure any live coverage or commentary taking place in Australia, outside of the NZ jurisdiction, did not compromise the NZ investigations and legal process,” the statement said.", "“We amended our public statements on Saturday when we realised our comments were being interpreted as SKY [NZ] having acted unilaterally, and we clarified that the reason for the removal was to not compromise police investigations and the legal process in NZ.", "“We have been working closely with Sky News Australia to address these matters, and we were pleased to be in a position to put the channel back up today.”", "In the days following the controversy, some social media posts further distorted the reality by conflating Sky News Australia with Fox News, due to their common connection to Rupert Murdoch, and falsely claiming that \"New Zealand\" had taken Fox News off the air:", "New Zealand pulls Fox News off the air, we should have done this years ago. https://t.co/9oc1crqcwv", "— Stone ? (@stonecold2050) March 23, 2019", "Sky News Australia is owned by News Corp Australia, a subsidiary of Murdoch's News Corp, and is part of the Murdoch family's global media \"empire,\" which in the U.S. includes Fox News, the network Rupert Murdoch created in the 1990s.", "Finally, some social media users were also misled into thinking that not only had the New Zealand government intervened against Sky News Australia (or Fox News), but that the decision had been indefinite or even permanent, as implied by posts such as those shown above, which declared \"We should have done this years ago.\" In fact, Sky News Australia was restored to the Sky New Zealand platform just a day after it was removed, according to Sky New Zealand.", "Gilchrist, Karen.   \"Australia's Prime Minister Calls for Global Social Media Restrictions After Christchurch Shootings.\"\r\n    CNBC.   19 March 2019.", "Mandel, Kyla.   \"New Zealand Pulls Murdoch's Sky News Australia Off the Air Over Mosque Massacre Coverage.\"\r\n    ThinkProgress.   16 March 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]