["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In December 2020, as a vaccination for COVID-19 started rolling out across the U.S., a photograph supposedly showing a Pfizer vape cartridge containing a single dose of the vaccine started to circulate on social media:", "This is not a genuine picture of a vape cartridge filled with a single dose of the COVID-19 vaccine.", "According to the CDC, the COVID-19 vaccine is currently only available via an intramuscular (IM) injection. Neither Pfizer nor any other pharmaceutical company has produced a vape-version of this vaccine.", "There are a few other hints that this picture is bogus. For instance, while Pfizer does make Viagra, a pill that treats erectile dysfunction, the company does not refer to itself as \"makers of the boner pill\" on packaging. This fake vaccine photo also claims that it was \"made in China,\" but the real COVID-19 vaccine is being manufactured in Germany, Belgium, and the United States.", "A spokesperson for Pfizer confirmed to Reuters that this COVID-19 vape vaccine was indeed fake:", "The real vaccine is being made using Pfizer and BioNTech’s combined manufacturing network in Germany, Belgium and the United States.", "Reuters contacted Pfizer who confirmed by email the vaporiser cartridge was fake. The real Pfizer vaccine is injected into the upper arm and given as two doses 21 days apart.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]