["The screenshot of the purported tweet was published on February 7, 2021, by a Twitter user called “@DeeOneAyekooto”.", "The account is known for promoting the activities of Nigeria’s governing party and arch PDP rival, the All Progressives Congress (APC).", "The tweet appears to be from the authentic, verified account of the PDP. “If given the opportunity to serve in 2023, we won’t steal again,” it reads.", "The same image was also shared by this Facebook page with more than 110,000 followers, alongside a similar claim.", "The election of Nigerian President Muhammadu Buhari in 2015 ended 16 years of PDP rule. Buhari and the APC came to power on the back of promises to tackle corruption, including theft from public coffers.", "This AFP report captures the scale of corruption in Nigeria in the years before the 2015 elections.", "But while the PDP previously apologised for its “past mistakes”, it did not publish the tweet, which was digitally doctored to give the impression it came from the party’s official Twitter account.", "AFP Fact Check searched the PDPs Twitter timeline and found no sign of the tweet.", "Several visual clues give away the fact that the tweet has been fabricated — for instance, only one version has circulated online, evident from the static number of retweets (624) and likes (1,900).", "It is also customary for tweets to have the user’s information in the top left-hand corner and an ellipsis indicating a drop-down menu opposite.", "An example is Buhari’s tweet congratulating his US counterpart, Joe Biden, on his election victory.", "The tweet in the screenshot, however, has an unusual configuration. Besides the fact that it contains a punctuation error untypical of the PDP, it replaces the ellipsis with a wheel symbol where user settings can be accessed.", "The time displayed in the image is also inconsistent.", "The purported tweet was supposedly published at “09:04 PM” on “07 Feb 21”. Yet the screenshot had already been circulating online by that time.", "Earlier versions of the claim from February 6, 2021, were first published as quotes in social media posts (here and here), according to data provided by online monitoring tool CrowdTangle.", "A day later, the claim was fashioned into a tweet and a screenshot published online from at least 3:50 pm in Nigeria, more than five hours before the tweet’s purported publication time.", "Also, the viral screenshot alleges that the PDPs user interface was “Twitter for Web”. But when AFP Fact Check analysed the last 1,000 tweets from the party’s Twitter handle on Account Analysis, a third-party platform for analysing Twitter accounts, we found that they were all tweeted from an iPhone device.", "PDP spokesman Kola Ologbondiyan has also dismissed the image as false and tagged the official account of the APC in a responding tweet.", "“@OfficialAPCNg Shenanigans.... Frustrated by Nigerians rejection, our fizzling neighbours contrived the message below,” tweeted Ologbondiyan, alongside the viral image with red crosses. “This is another act of political terrorism!”", "@OfficialAPCNg Shenanigans.... Frustrated by Nigerians rejection, our fizzling neighbours contrived the message below.\n\t\tThis is another act of political terrorism! pic.twitter.com/bWnluYeJav", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]