["Multiple posts shared on Facebook link to articles claiming that Jonathan “made this known while speaking with journalists in Abuja”. One version of the report published by the website iReporteronline has been shared more than 1,900 times by multiple Facebook pages, according to data from social media tracking tool CrowdTangle.", "Another Facebook page, News Across The Nation, posted the same claim -- published on a different website -- with a caption that states that the ex-president revealed this to “Nigeria news agency” in Abuja.", "There’s no news organisation by that name in Nigeria, and the fake name appears intended to sound like the state-run News Agency of Nigeria (NAN). News of Jonathan’s supposed exit from frontline politics was not carried in any reputable mainstream publication.", "The websites that did carry the false claim about Jonathan quitting the PDP -- Mystatenews and NaijaLiveTv along with iReporteronline -- publish a mixture of factual news and inaccurate reports.", "But on Sunday Jonathan’s media advisor Ikechukwu Eze confirmed that the former president remains a member of the PDP, calling the claim that he had quit “a fabrication borne out of mischief”.", "“There is absolutely no way the former President could have spoken to a non-existent news agency, as none in the country goes by that name,” Eze added in a post on Jonathan’s verified Facebook Page.", "Jonathan was Nigeria’s president from 2010 to 2015, representing the PDP. Before that, he was deputy to president Umaru Musa Yar’Adua, who died in 2010 after a protracted illness.", "The false reports about Jonathan quitting politics bear a resemblance to those last weekend about Gbenga Daniel, a former governor of Ogun state in southwest Nigeria and director-general of the PDP presidential campaign organisation for the just-concluded 2019 election.", "Daniel announced that he was quitting the PDP and withdrawing from active politics after 18 years in the party.", "But his move had nothing to do with Jonathan, who has now made it clear that he remains a member of the PDP.", "Jonathan has been on the receiving end of misinformation in Nigeria. A few days after he launched his book, My Transition Hours, which detailed his last days in government, fake copies of the book containing stories different from the original were already online and in stores. Also, a few days before the presidential elections, posts circulated on social media claiming Jonathan had told journalists that his party’s choice for vice-president in the 2019 election “was a monumental disaster”. AFP checked, and found Jonathan said no such thing.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]