["The photos were published on Facebook here on August 6, 2020. The post has been shared more than 400 times.", "The post’s Sinhala-language caption translates to English as: “The rare sight of a white elephant”.", "Some Facebook users appeared to believe that the elephant was a real albino elephant, posting comments such as \"beautiful\" and \"look at what a vision it is!\"", "Another Facebook user noted that “such animals belong in the jungle,” as seen in the comment below:", "The photos were published alongside a similar claim on Facebook here, here, here, here and here.", "The claim, however, is false.", "A reverse image search on Google found the elephant in the photos was covered in white ash to resemble a white elephant that is featured in Hindu mythology.", "The images were published here on the Facebook page of Tenkasi Times, a provincial Indian magazine, on July 29, 2020. The post states: \"White Elephant was roaming in the inner light of Thiruchendur Sri Arulmigu Subramaniya Swamy Temple on the occasion of Aadi Swathi.\"", "The post’s Tamil-language caption states the elephant was covered in white ash on Aadi Swathi, a Hindu religious commemorative day, to recreate a scene in Hindu mythology that features a white elephant.", "A further keyword search on Google found that the photos were also published on Twitter here by an Indian travel blogger on July 29, 2020. The tweet notes that the elephant appears white due to the application of vibhuti, a sacred ash applied by Hindu devotees.", "According to mythology, lord Siva appeared today in the form of Airavat (the heavenly white elephant). So they decided to smear vibuthi (bhasma, ash) all over the elephant and parade around the temple ??‍♀️??‍♀️??‍♀️\n\t\tPls don't @ me tht it is culture, hindu, temple, etc.. Poor thing!! pic.twitter.com/rcPpxQkG7Y", "A closer analysis of the images also reveals the men standing next to the elephant appear to have white coloured ash on their hands.", "Although not a distinct species, albino elephants have been reported from several parts of Africa. Their skin, however, is not white but a brownish, pink as seen on this travel blog.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]