["Georgia’s economy has been hotly debated in this year’s governor’s race.", "And in a new television ad, Democratic nominee Jason Carter says power brokers at the state Capitol need to do more for the middle class.", "\"In the last 10 years, Georgia’s middle-class income has dropped $6,500,\" he says. \"We have to change that.\"", "The two-term state senator from Atlanta who is hoping to unseat Republican incumbent Gov. Nathan Deal in the Nov. 4 general election has previously voiced concern about the shrinking income of the middle class.", "At a press conference in January, when 2012 figures were the most recent available, Carter said the income of an average Georgia family, adjusted for inflation, is about $6,000 less than it was 10 years ago.", "PolitiFact Georgia rated that statement True, albeit on the conservative side.", "Carter was relying on historical data from the U.S. Census Bureau.", "The data showed that the median household income in Georgia fell by an estimated $6,682, from $54,803 in 2002 to $48,121 in 2012, when adjusted for inflation.", "Nationally, in that same period, the median household income dropped from $54,127 to $51,017, or $3,110, according to the Census Bureau’s data.", "Carter’s new ad cites a $6,500, 10-year drop in household income. That’s even more on target with the Census Bureau data.", "Still, we decided to go a little further since, after Carter’s ad aired, the Census Bureau came out with new data for 2013.", "The middle-class income number also provides one more measure for trying to assess what’s going on with Georgia’s economy. It can be a cloudy picture.", "Deal says nearly 300,000 jobs have been created in his tenure. Meanwhile, the Bureau of Labor Statistics says Georgia’s unemployment rate jumped from 6.9 percent in April to 8.1 percent in August.", "So what’s the latest info on median household income?", "In the U.S. Census Bureau’s just-released 2013 American Community Survey, Georgia had a median household income of $47,829 in 2013, inflation-adjusted dollars.", "The state ranked 34th out of 50 states and the District of Columbia, with Maryland the highest at $72,483, Mississippi the lowest at $37,963.", "The survey said the median household income for the nation was $52,250 — $4,421 higher than Georgia’s.", "The numbers, however, showed metro Atlanta’s median household income at $55,733. That is above the national average. And more than half of all Georgians live in or near metro Atlanta.", "Median household income is down for metro Atlanta and Georgia since 2010, the first year after the government says the recession ended and the year Deal was elected governor.", "Metro Atlanta’s median household income was $56,850 for 2010, and in inflation-adjusted dollars, Georgia’s was $49,412, according to the survey. (Note: Some estimates in the American Community Survey differ from prior estimates.)", "In inflation-adjusted dollars, Georgia’s median household income was $47,536 in 2011 and $47,811 in 2012.", "Wesley Tharpe, a policy analyst with the left-leaning Georgia Budget & Policy Institute, said income and wages have been basically stagnant in the state for the past two to three years.", "\"What we saw with the Great Recession, starting around 2007, was employment and income just really fell through the floor due to the collapse of the housing market, the collapse of the stock market,\" Tharpe said. \"Those really hurt Georgia because of our reliance on the housing industry and construction jobs.\"", "Since that crash, the economy has been gradually moving in the right direction, he said.", "\"But incomes and the ability for families to make a living and make ends meet is really lagging behind,\" Tharpe said. \"We haven’t really seen that much growth since we hit that floor.\"", "In summary, Carter’s ad says middle-class income has dropped $6,500 in 10 years.", "He bases this on historical data from the U.S. Census Bureau. That shows Georgia’s median household income, in inflation-adjusted dollars, fell by $6,682, from $54,803 in 2002 to $48,121 to 2012.", "We rate Carter’s ad claim as True.", "The television ad", "American Community Survey, median household income", "American Community Survey, Atlanta info", "Interview with Wesley Tharpe, policy analyst for the Georgia Budget & Policy Institute", "Interview with Robert Bernstein, public information officer, U.S. Census Bureau", "Interview with Bryan Thomas, spokesman for Jason Carter", "_________________________________________________________", "Georgia Median household income *", "2013  ---    $47,829", "2012 --    $47,811", "2011 --    $47,536", "2010 --    $49,412", "Source: U.S. Census Bureau’s 2013 American Community Survey", "in 2013 inflation adjusted dollars", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]