["About this rating", "Shortly after NFL quarterback Colin Kaepernick made national headlines in August 2016 by refusing to stand for the playing of the U.S. national anthem, explaining that he would not honor the flag of a country that oppresses black people, several fringe web sites published articles claiming that the actual reason behind his protest was that the San Francisco 49ers QB had recently converted to Islam:", "The entire country has been shocked and outraged over San Francisco 49ers quarterback Colin Kaepernick’s refusal to stand for the National Anthem. Kaepernick claimed that he remained seated because of “racism” that causes “oppression” in the United States. But new details about Kaepernick’s personal life may shed some light on this ridiculous new attitude of his.", "It turns out that Kaepernick has been dating a Muslim girl, and is apparently converting to Islam for her.", "Messages claiming that Kaepernick had converted to Islam were frequently attached to one of two photographs:", "Both of the above-displayed images are fake. The image on the right was created by adding Kaepernick's face over a photograph of Osama bin Laden, while the image on the left was created by adding an Islamic symbol to a photograph of Kaepernick. The original, unaltered images can be seen below:", "Dozens of fringe web sites maintained in August 2016 that Kaepernick had converted to Islam, but all of these reports stemmed back to an anonymous tip posted by the sports gossip site Terez Owens in July 2015:", "Now we’re hearing he’s transitioning to become a Muslim, according to people close to the player. We received this in our tipbox, Colin’s girlfriend, Hot 97 DJ Nessa, introduced him to the teachings of Islam, and he’s ready to embrace it fully. Our tipster tells us Kaep and Nessa are going to have a traditional Muslim wedding. Colin seems to be all over the place lately.", "However, the controversial NFL quarterback did not make any announcements about his alleged conversion while addressing this rumor, nor did he mention religion while discussing his decision to remain seated during the playing of the national anthem:", "“I have great respect for the religion, know a lot of people that are Muslim and are phenomenal people,\" Kaepernick, the San Francisco 49ers' backup quarterback, said. “But I think that (rumor of conversion) comes along with people’s fear of this protest, as well as Islamophobia in this country. People are terrified of them to the point where Trump wants to ban all Muslims from coming here, which is ridiculous.”", "Kaepernick also addressed reports that he’s been heavily influenced by girlfriend Nessa Diab, a radio host.", "“The impact is just conversations that we constantly have,\" he said. “This is an open discussion that I have with many people, not just my woman. She is Muslim, her family is Muslim, I have great respect for them. I have great respect for people’s right to believe what they want to believe. And I don’t think anybody should be prosecuted for judged based on what their beliefs all.\"", "Branch, Eric.   \"49ers’ Colin Kaepernick Transcript: ‘I’ll Continue to Sit.’\"\r\n    San Francisco Chronicle.   28 August 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]