["शहीद के शव के पास बेठ कर बिलक बिलक कर रोते हुए😢 देखो योगी आदित्य नाथ को (Look at Yogi Adityanath crying buckets near the body of martyr- translated). Along with this message, a video of UP Chief Minister Yogi Adityanath aka Ajay Singh Bisht is being shared profusely on social media platforms. The video shows Adityanath sharing a light moment with Bihar governor Lalji Tandon.", "शहीद के शव के पास बेठ कर बिलक-बिलक कर रोते हुए😢 देखो योगी आदित्य नाथ को 👇🏼👇🏼😡😡👇🏼👇🏼 @myogiadityanath pic.twitter.com/l4uyrdEoic", "— Purnchandra Padhi/Coco (@Cocopadhi) February 20, 2019", "The above tweet is by a Youth Congress leader, tweeted in the morning of February 20. On Facebook, several individual users have shared the video with identical text, indicating that the same is viral on WhatsApp. It has been posted by the page Bluffmaster Modi which has a following of over 450,000 and by the page Bhakton Ke Papa.", "शहीद के शव के पास बेठ कर बिलक बिलक कर रोते हुए😢 देखो योगी आदित्य नाथ को…!", "Posted by Bluffmaster Modi on Tuesday, February 19, 2019", "The story is the same on Twitter.", "The 16-second long video clip in which UP CM Yogi Adityanath, seen chuckling along with Bihar governor Lalji Tandon, is not related to the Pulwama attack. Adityanath was not paying homage to Pulwama martyrs as claimed. The video was shot in October 2018 during the final rites of N D Tiwari, who had passed away on October 18.", "The video had caused controversy back in October 2018 and had left the BJP embarrassed. Earlier, an old photo of PM Narendra Modi and Bihar CM Nitish Kumar sharing a laugh, was circulated as a recent photo taken after the Pulwama attack.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]