["About this rating", "In August 2020, a photograph supposedly showing a huge crowd of QAnon supporters in Berlin, Germany, protesting against mask regulations and COVID-19 vaccinations was widely shared on social media:", "This is not a photograph of a QAnon protest in Berlin, Germany. This image was actually taken at a music festival in 1997.", "This image was circulated on social media in August 2020 as anti-lockdown protests were truly taking place in Berlin and other European cities. These protests attracted thousands of people, but they were nowhere near as large as the crowd pictured in the above-displayed image.", "The BBC reported that one of the largest protests took place in Berlin, and numbered close to 40,000 people:", "Some 38,000 people took to the streets in the city for mostly peaceful demonstrations.", "Later hundreds of protesters, many from the far right, tried to storm the Reichstag, the home of Germany's federal parliament.", "A number of people were arrested and German politicians condemned the attack as \"shameful\" and \"unacceptable\".\nSome of those involved had insignia from the far-right Reichsbürger (Reich Citizens) movement. Vice Chancellor Olaf Scholz said: \"Nazi symbols as well as Reichsbürger and Imperial German flags have no place in the German Bundestag.\"", "[...]", "Rallies protesting against coronavirus restrictions took place in other European cities with some demonstrators calling the virus a hoax.", "Thousands gathered in London's Trafalgar Square to protest against issues including coronavirus restrictions and 5G. Signs reading \"masks are muzzles\" and \"new normal = new fascism\" were held up.", "A video from DW, a German news outlet, provides a glimpse at the actual size of these protests:", "While these anti-mask protests were sizable, some social media users started to spread images in an apparent attempt to show that they were bigger than they actually were. The miscaptioned image, for instance, actually shows a bird's-eye view of \"The Love Parade,\" an annual music festival, in the Charlottenburg district of Berlin in 1997. The original photograph was taken by Robert Grahn and is viewable here.", "Another similar concert photo was mislabeled and shared as if it showed an anti-mask protest.", "The following image was shared on Facebook as if it showed \"yesterday's protest in Berlin,\" where \"over 1 million people marched against quarantine restrictions.\" An investigation by Reuters, however, found that this image was actually taken in Zurich, Switzerland, during \"Street Parade,\" an annual techno music festival.", "In turn, the Zurich photo was shared with a false caption yet again in October 2020, when it was claimed that it shows a Trump rally in Miami:", "Schmmidt, Axel.   \"Fact check: Photo Shows 2019 Music Event in Zurich, Not Coronavirus Protest in Berlin.\"\r\n    Reuters.   3 August 2020.", "BBC.   \"Germany Coronavirus: Hundreds Arrested in German 'Anti-Corona' Protests.\"  \r\n  31 August 2020.", "Pleitgen, Fred.   \"Thousands of Covid-Deniers Protest in Berlin and London.\"\r\n    CNN.   30 August 2020.", "Chazan, Guy.   \"Berlin Virus Protests Show Far-Right Seizing on Restrictions Fatigue.\"\r\n    Financial Times.   30 August 2020.", "Update [Oct. 20, 2020]: Added variant labeled \"Trump rally in Miami.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]