["About this rating", "In January 2020, a photograph supposedly showing an official sticker from the environmental group Extinction Rebellion circulated on social media:", "This sticker was not made or endorsed by Extinction Rebellion. It appears it was created as part of a smear campaign against the environmentalist group.", "A spokesperson for the group told us:", "This is not an official Extinction Rebellion sticker. Our graphics are available for everyone to use so this has clearly been used in a way to create controversy around XR. It's completely contrary to our principles and values: we don't blame and shame, we believe in system change not individual change, we don't take positions on specific issues (preferring to leave it to a Citizens Assembly to say what must be done to address the Emergency) and we welcome everybody, young and old, rich and poor, meat-eating and vegan, car-owners and cyclists alike - all are needed to stand together if we are to avert the calamity which faces us all.", "We have been unable to determine who specifically created this photograph. However, on Jan. 21, 2020, a thread on the internet forum 4chan asked users to \"hijack\" Extinction Rebellion by sharing a series of fake slogans:", "Another thread that same day on the forum encouraged users to spread the viral \"Nazi\" image:", "extinction rebellion made this great slogan. It’s so catchy I think we should help them out and spread it around a bit more, just to get the word out.", "More than a week prior, a 4chan user shared a link to an \"Extinction Rebellion Poster Generator\" allowing users to easily create Extinction Rebellion-branded messages without the consent, knowledge, or endorsement of the environmental organization.", "The Argus reported that another batch of fake Extinction Rebellion posters were spread around Brighton, England, in January 2020. Those posters, which bore fraudulent slogans such as \"Only White People Care About the Environment\" and \"Save the Environment End Mass Migration,\" also drew condemnation from the environmentalist group.", "Extinction Rebellion Brighton said in a statement, \"Extinction Rebellion, in Brighton and any other location, are not associated with these racist posters in any way and do not wish to give any more air time to their abhorrent messages.\"", "The \"Drive a Car? You Are a Nazi\" sticker campaign is reminiscent of other stunts deployed on 4chan.", "When Nike endorsed politically outspoken former quarterback Colin Kaepernick in September 2018, for instance, online trolls on the 4chan forum started spreading a series of racist ads as if they were created by the apparel company. The 4chan forum was also responsible for spreading fake posters bearing the slogan \"Pedophiles are People Too\" in order to smear the LGBTQ community, fake Starbucks coupons in an attempt to stir up racial controversy, and a fake flyer calling for the murder of children in order to paint the group Antifa as extremist.", "AFP Australia.   \"This Image Was Doctored – Australian Officials Say The Bushfire was Caused by Lightning, Not Arson.\"\r\n    16 January 2020.", "BBC.   \"'What is Extinction Rebellion and What Does it Want?\"\r\n    7 October 2019.", "Lock, Rose.   \"'Vile' - Fake Posters With Extinction Rebellion Logo Spotted in Brighton.\"\r\n    The Argus.   12 January 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]