["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "After U.S. President Donald Trump made a tarmac speech at Tampa International Airport in Florida on July 31, 2020, social media posts claimed that White House officials doctored photos to make it appear as if there were far more people in attendance than there actually were:", "This claim is false.", "Trump held the campaign-like rally in front of Air Force One, with dozens of people in attendance. Steve Contorno, an editor for the Tampa Bay Times, shared an image of the sparsely attended rally that was then altered and posted by a social media user using the name “Ludger,” who claimed that it was the “official video released by the White House.”", "Twitter users retweeted the fake images, claiming they were doctored by the White House to “make the crowd bigger.” In a comment on the original post, Ludger confirmed that the altered image was meant as a joke.", "\"I figured that by using Paint (no Photoshop was harmed in the production) the resulting edits would be so obvious that EVERYONE would immediately recognize it as a joke, chuckle and move on,\" Ludger wrote. \"But this has been eye-opening.\"", "The photo was reportedly flagged and removed for violating Facebook’s community standards as being fake, but remained on Twitter at the time of publication.", "Trump also caused a riffle in the Twitter community on Aug. 3 when he mistyped \"Florida\" in a tweet referring to his rallies in \"Texas and Frorida\":", "Snopes received a number of queries regarding the authenticity of the misspelled presidential tweet after it was widely shared on social media. An archived version showed that the tweet had been posted in the morning and remained online for nearly six hours before being deleted and replaced with a similar tweet, sans typo.", "Samuels, Brett.   \"Trump Holds Mini-Rally At Florida Airport.\"\r\n    The Hill.   31 July 2020. &nbsp", "Contorno, Steve and Snipe, Margo.   \"Trump Lands in Tampa Amid a Pandemic and Finds a Way to Hold a Rally.\"\r\n    Tampa Bay Times.   31 July 2020 &nbsp", "Kertscher, Tom.   \"The White House Doctored a Photo of a Donald Trump Event to ‘Make the Crowd Look bigger.’\"\r\n    PolitiFact.   1 Aug 2020 &nbsp", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]