["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A blog post insinuates that House Speaker Nancy Pelosi tried to take 93 family members on a canceled overseas trip. There is no evidence to back that up.", "\"Pelosi’s Secret Overseas Mission Included 93 Family Members? Why?\" the headline reads on The Marshall Report, a website known for peddling fake news.", "\"Why did Pelosis have all of her children and grandchildren – 93 family members going with her on her trip to Egypt, Afghanistan and Brussells? And 7 congress members? Who takes 93 family members (mostly children) on a secret government business trip on military aircraft, paid for by tax payer dollars?\" the story reads.", "The post goes on to speculate that Pelosi was paving the way for her own elevation to the White House by plotting a terrorist attack on President Donald Trump and Vice President Mike Pence.", "There are no declarative sentences claiming Pelosi actually planned to take 93 family members along on her trip -- nor is there any evidence.", "Drew Hammill, Pelosi’s deputy chief of staff, said, \"No spouses were on the trip that was postponed.\" When asked about other family members, he declined to comment on \"every fabrication.\"", "The details of the trip had not been previously announced. But credible news outlets reported the trip would consist of seven lawmakers, along with top staffers, not their families. These include House Speaker Pelosi and U.S. Reps. Adam Schiff, Susan Davis, Eliot Engel, Elaine Luria, Stephen Lynch and Mark Takano. They were headed to Brussels to meet with North Atlantic Treaty Organization allies and military leaders, and then to Afghanistan to visit U.S. troops.", "Trump announced to Pelosi the trip would not take place on Jan. 17, 2019, in the form of a letter, which Press Secretary Sarah Huckabee Sanders posted to Twitter. It was a response to an earlier letter by Pelosi, in which she urged Trump to either reschedule his upcoming State of the Union address or to deliver it in writing, in light of the continued partial government shutdown.", "The only source the story cites is @BLUEPRINT_Q, a Twitter user who frequently posts conspiracy theories like this one. One tweet claimed \"All Pelosi’s children and grandchildren were also booked, totaling 7 congressman and 93 family members grounded.\" But the link attached leads back to a Trump's letter to Pelosi, which did not mention her family.", "On Twitter, @BLUEPRINT_Q linked to tweets by another conspiracy theory peddler, @5Strat. According to that user, the 93 family members were not only Pelosi’s own children and grandchildren, but her colleagues’ family members.", "There are no credible sources to back this claim. We rate it Pants on Fire!", "Email interview with Drew Hammill, deputy chief of staff for Pelosi, Jan. 23, 2019", "The Marshall Report, Pelosi’s Secret Overseas Mission Included 93 Family Members? Why?", "Snopes, Did a Planned Congressional Delegation to Afghanistan Include 93 Family Members?", "Vox, Trump postpones Pelosi’s official trip to Afghanistan — unless she wants to \"fly commercial\", Jan. 17, 2019", "Twitter, BLUEPRINT_Q, Jan. 18, 2019", "Twitter, 5Strat, Jan. 18, 2019", "Politico, Chasing Nancy Pelosi’s bus to nowhere, Jan. 17, 2019", "White House.gov, Letter from President Donald J. Trump to Speaker of the House of Representatives Nancy Pelosi, Jan. 17, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]