["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "If there was one success story to emerge from the International AIDS Conference in Durban, South Africa, it was that more people are getting treated for HIV/AIDS than ever before -- about 17 million by the latest United Nations estimate.", "Falling drug prices played a key role in helping providers reach this point. But the international health group Doctors Without Borders (Médecins Sans Frontières) warned at a press conference that trade negotiations around the world put future gains at risk.", "The group said its latest report \"examines multiple global threats to access to affordable treatment, including trade deals which threaten India’s role as the ‘pharmacy of the developing world.’\"", "Trade is at the center of the U.S. presidential election for its effect on the American work force. But is there more at play? We wondered if it’s true that the next round of agreements, both those that involve the United States and those that don’t, would undermine some large drug makers in India.", "Why India", "India matters because thanks to the country’s patent laws, India and generics go together like toast and jam. The rules there make it easier than other places for companies to churn out generic drugs once the patent on the original version runs out. Generics are cheaper than their brand name cousins and if you want to stretch a dollar, you take the generic option.", "Doctors Without Borders said 97 percent of the drugs it uses to treat people with HIV are generics made in India. That includes medicines for HIV itself, as well as for diseases like pneumonia and tuberculosis that hit people with suppressed immune systems.", "Doctors Without Borders is worried less about the drugs it uses today and more about the ones it’s counting on in the future. As the number of people coming in for treatment rises, doctors are finding more who don’t respond to the most common, or first-line, medications. Doctors Without Borders is focused on making second-and-third-line drugs more affordable to keep pace with a growing need, and they see India as the place to make that happen.", "Impact of trade deals", "Although the Trans-Pacific Partnership gets a lot of attention in the United States, India is not part of it. But it is part of discussions involving the Regional Comprehensive Economic Partnership, a mega-regional pact that aims to tie together 16 countries including China, India, Australia, Japan, South Korea and many other Asian nations. The European Union is also seeking a regional trade agreement with India and other Asian countries.", "Both of those trade negotiations have sought to get India to tighten its patent laws. The United States has too, through a one-on-one process overseen by the Office of the U.S. Trade Representative. The issues that office has raised mirror ones in the big trade deals.", "The USTR’s latest report criticizes India’s patent laws, saying \"the pharmaceutical industry in particular faces a host of challenges related to intellectual property rights.\"", "What do U.S. trade negotiators not like in particular?", "For one, India is reluctant to grant new patents for a drug or blend of drugs built around medications that already enjoy patent protection. These so-called secondary patents extend the time for the drug maker to enjoy exclusive production rights. That translates into a chance to charge higher prices.", "American officials also don’t care for India’s rules on clinical trial information. When someone invents a drug, they have to prove it’s safe and effective. That proof is in the trial reports. India lets generic drug makers rely on the original clinical trials. One way to extend the exclusive right to make a drug is to bar generic drug makers from using that data for a number of years.", "Would these sorts of changes make life easier for the makers of new drugs and harder for the generic manufacturers?", "We found no dispute that they would.", "We talked with independent experts who think India should stand its ground and those who thought it ought to bend, but either way, they agreed on who wins and who loses.", "There are good arguments on both sides for protecting the profits of companies that invent new drugs, versus making drugs more affordable. We take no position on the larger question of where the right balance point falls.  We're focused only on the claim that large trading partners want to move Indian law in favor of the inventors of new drugs.", "Lee Branstetter is a professor and trade specialist at Carnegie Mellon University. He thinks Indian law ought to change at the expense of the generic companies.", "\"In the short run, this will constrain the profit opportunities for the generic producers,\" he told us.", "Srividhya  Ragavan, a professor of law at Texas A&M, thinks India’s laws strike the right balance as they are. She told us she sees the U.S. position as \"an effort to weaken India’s generic drug industry.\"", "We found any number of articles that reached the same conclusion.", "But just because Branstetter and Ragavan see eye to eye on how these policy shifts would undermine generic drug makers, that doesn't mean they agree on what this means for the availability of low-cost drugs.", "Ragavan told us \"the Trans-Pacific Partnership, the Regional Comprehensive Economic Partnership and EU’s trade negotiations, are all targeting India’s generic drug industry much to the detriment of access to medication to the poor people.\"", "Branstetter said that’s unlikely and highlights an important feature in the overarching trade rules of the World Trade Organization.", "The escape hatch", "Branstetter said based on what he’s seen in other countries (he cited Peru as an example) he doubts that would happen. But even if it did, he said, a part of the WTO code -- the Doha Declaration on Trade-Related Aspects of Intellectual Property Agreement -- gives countries the chance to override a patent that limits a drug’s availability. Branstetter calls it an escape hatch.", "\"Any member state could declare we have a public health emergency,\" Branstetter said. \"Then, they can force the company that holds the patent to licence the manufacture of that drug to a domestic or foreign drug producer, who would provide it at an agreed price.\"", "Branstetter notes that the Trans-Pacific Partnership specifically requires any country that signs it to accept that Doha declaration.", "Countries have taken this step before. At the height of the AIDS crisis in the mid 2000s, Indonesia, Malaysia, Ghana, Mozambique and many others issued what are called compulsory licenses to get affordable HIV/AIDS drugs to their citizens.", "Still, Rohit Malpani, director of policy of the Doctors Without Borders- Access Campaign, told us that in recent years, the number of compulsory licenses has fallen off.", "\"Even if countries have the right to use the safeguard and can use them they do not,\" Malpani said.", "He suggested several reasons, including a lack of political will and pressure from the United States, the EU and the drug companies.", "Our ruling", "Doctors Without Borders said that trade deals threaten the capacity of Indian generic drug makers to produce the next round of HIV drugs. We found that trade negotiations, whether part of large regional trade agreements or unilateral discussions between the United States and India, have language that work against India generic drug makers.", "They push India to be more ready to grant patents for drugs that are extensions of  drugs that already enjoy patent protection. And they want India to bar generic drug makers from relying on the clinical trial data produced by the inventor of the drug.", "Both measures would make patents last longer and give the drug companies more time to charge higher prices.", "None of the articles we read or experts we reached doubted this result or that this would undermine the generic drug makers.", "Our experts disagreed on whether this would reduce access to critical drugs.", "The trade deals do no favors for India’s generic drug makers. With a caveat about future access to drugs, we rate this claim Mostly True.", "Doctors Without Borders, Trade agreements and pressure on India’s ‘pharmacy of the developing world’ pose major threats to access, July 21, 2016", "Intellectual Asset Management, Pressure intensifies on India over software and pharma patent protection in key Asian trade negotiations, June 22, 2015", "Economic Times, India to resist Japan and South Korea's push for patent legislation at RCEP, June 12, 2015", "Indian Institute for Foreign Trade, Trans-Pacific Partnership Agreement (TPPA): Implications for India’s Trade and Investments, October 2015", "Doctors Without Borders, Untangling The Web of Antiretroviral Price Reductions - 18th ed., July 2016", "Asian Trade Center, Regional Comprehensive Economic Partnership (RCEP): An Asian Trade Agreement For A Value Chain World, Feb. 10, 2015", "Economic Times, RCEP may turn into a reality soon: MEA Secretary Anil Wadhwa, Feb. 17, 2016", "Trans-Pacific Partnership, Intellectual property, accessed Aug. 2, 2016", "World Trade Organization, Agreement on trade-related aspects of intellectual property rights, accessed Aug. 2, 2016", "The Conversation, RCEP: the trade agreement you’ve never heard of but should be concerned about, June 7, 2015", "Knowledge Ecology International, Recent examples of the use of compulsory licenses on patents, March 31, 2007", "American Economic Review, The Market Impacts of Pharmaceutical Product Patents in Developing Countries: Evidence from India, January 2016", "Live Mint, India’s patent law may face legal hurdle at WTO, June 12, 2015", "Interview, Lee Branstetter, professor of economics and public policy, Carnegie Mellon University, Aug. 2, 2016", "Interview, Srividhya  Ragavan, professor of law, Texas A&M School of Law, Aug. 1, 2016", "Interview, Rohit Malpani, director of policy & analysis, Médecins Sans Frontières - Access Campaign, July 27, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]