["The misleading video and claim have been posted repeatedly on social media, for example here, where it has been shared more than 11,000 times on Facebook since it was uploaded May 2, 2019.", "The one-minute 55-second video claims to show men and women in Pakistan’s western Balochistan province dancing, singing folk songs and waving the BJP flag -- which bears the party’s lotus flower symbol and acronym on a saffron and green background.", "The Hindi-language caption translates as: “The Bharatiya Janata Party flag was waved in Pakistan’s Balochistan. If the Modi government comes back, Balochistan will be independent. With Modi at the helm, it is possible.”", "Below is a screenshot of the misleading post:", "India is currently holding its election, which lasts for six weeks and ends on May 19.", "Balochistan is a province in Pakistan.", "The exact same footage as is used in the misleading posts was originally posted online by Sofi Yousuf, a BJP member of the Jammu and Kashmir legislative council, and a candidate in the Anantnag constituency of Indian-administered Kashmir, according to his Facebook page here and as reported here.", "Yousuf uploaded the original video to his verified Twitter account on March 30, 2019 with the caption: “While going to file nomination papers”.", "While going to file nomination papers.#PhirEkBaarModiSarkar #LokSabhaElection2019 #NamoNamo @narendramodi @AmitShah @rammadhavbjp @Ramlal @ImAvinashKhanna @AshokKoul59 @RavinderBJPJK @BJP4JnK @BJP4India pic.twitter.com/l1cUMiUzIZ", "A Google reverse image search found that the exact same footage was also posted on Facebook here by online portal ‘Fast Kashmir’ on March 30, 2019.", "The caption on the Fast Kashmir post says: “Video, BJP Candidate Sofi Yousuf files nomination form for Parliamentary polls in South Kashmir’s Anantnag.”", "The video in the misleading Facebook post (L) and the original video put up by Yousuf on Twitter (R) are placed side by side below for comparison. Note in both there is a man in a mask in the foreground and a BJP flag behind:", "Local media covered Yousuf filing his candidate nomination papers, for example here, here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]