["About this rating", "In October 2018, many social media users encountered a meme spread online apparently aimed an generating interest in voting in the upcoming midterm elections.  The meme featured a photograph of a woman being attacked on a street, along with a caption identifying the victim as Susan B. Anthony, the American women's rights activist who played a key role in the women's suffrage movement, being \"beaten and arrested for trying to vote\":", "This photograph was snapped at the scene of a voting rights protest, but it's not a picture of Susan B. Anthony, its setting is not the United States, and it was not taken in 1872.", "The picture was originally published in the English newspaper The Daily Mirror on 19 November 1910 as part of their coverage of the \"Black Friday\" suffragette protest a day earlier in which 300 women marched to the Houses of Parliament as part of an effort to secure voting rights for women.", "The woman being attacked was not identified by the the newspaper, and the Mirror downplayed the incident, demeaningly captioning the photograph as follows:", "While forcibly endeavouring yesterday to enter the Houses of Parliament, great numbers of suffragettes used more frantic methods than ever before. Above is illustrated one of yesterday's incidents. A woman has fallen down while struggling, and she is in a fainting condition. The photograph shows how far women will go for the vote.", "The attacked woman was later identified as Ada Wright, who had already been part of the suffragette movement for years when she and other activists marched to the House of Commons on Black Friday to protest the blocking of a bill that would have granted around a million women the right to vote.", "In an August 2004 historical study published by the European Journal of Women's Studies, researcher Katherine E. Kelly reported that Wright and her comrades were \"beaten, punched and groped with unusual ferocity.\"  But the publication of the photograph taken by Victor Consolé of London News Agency, Kelly wrote, led to a turnaround in public perception despite officials' best efforts:", "This began a frantic attempt on the part of police authorities first to suppress the photograph, and then, failing its suppression, to purchase all 750,000 copies of the paper before their distribution. When this, too, failed, the published image produced a shift in public sentiment, helping to redirect criticism for the Black Friday confrontation from the suffragettes to the Home Secretary, Winston Churchill.", "Churchill would later reject calls for a public inquiry into the protest, which led to the arrests of 115 women and four men, as well as statements from 29 protesters saying that they had been sexually assaulted during the violence. The charges against all 116 arrestees were quickly dropped.", "A year later, Wright was arrested and imprisoned for 14 days after she broke a window during another suffragette demonstration.", "The right to vote in England was not expanded until 1918, when women over the age of 30 were allowed at the polls provided they were college graduates, householders, married to householders, or \"occupied\" property and paid at least five pounds in rent per month. Ten years later, the passing of the Representation of the People Act (also known as the Equal Franchise Act) provided women electoral equality with men and extended the vote to all women of age 21 or older (regardless of property ownership).  An updated version of the law enacted in 1969 set the minimum voting age at 18 for both men and women.", "Kelly, Katherine E. \"Seeing Through Spectacles: The Woman Suffrage Movement and London Newspapers, 1906–13\"\r\n    European Journal of Women's Studies   1 August 2004.", "Crawford, Elizabeth.   The Women's Suffrage Movement: A Reference Guide 1866-1928.\r\n    Routledge, 1999.   ISBN 184142031X.", "The Statutes Project.    \"1928: 18 & 19 George 5 c.12: Equal Franchise Act.\"\r\n    Accessed 18 October 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]