["While fans watched former President Barack Obama land a 3-pointer, critics tried to draw attention to another video from the campaign trail.", "“A confused Barack Obama yells Joe Biden’s name several times,” according to a video posted Oct. 31 on Instagram by The Gateway Pundit, a conservative outlet.", "In the video, Obama shouts, “Joe Biden” three times as he looks offstage and crickets chirp in the background. Distant cheering and music can be heard in choppy moments between Obama’s words and the crickets.", "“Barack Obama introduced Joe Biden to the nonexistent crowd and it didn’t go well,” The Gateway Pundit captioned the video.", "These choppy moments reveal the video’s audio has been altered to make Obama appear puzzled. This came in the campaign's 11th hour after Biden's Republican opponents spent months pushing the narrative that he is \"sleepy\" and \"senile.\"", "The Gateway Pundit did not respond to USA TODAY’s request for comment. The video received more than 5,00 likes and dozens of comments.", "Fact check:False Kamala Harris claim uses image from 2019 trip to Iowa", "C-SPAN footage of the drive-in campaign event Oct. 31 in Flint, Michigan, shows the video was altered to give the impression that Obama was confused while waiting for Biden to take the stage.", "“We will elect a man who loves this country and who cares about you and who will fight for every single one of us and look out, not just for folks who support him but even the folks who don’t,” Obama said. \"My friend, the next president of the United States of America, Joe Biden! Joe Biden!”", "At the 45:38 timestamp of the clip, Stevie Wonder’s “Sir Duke” begins to play, and Biden emerges out of the building behind the stage and jogs to the stage. Obama called, “Joe Biden! Honk if you’re fired up! Honk if you are ready to go! Joe Biden!”", "He put the mic down and exited the stage as Biden stepped up to the podium and removed his mask.", "“Hello, Flint!” Biden said. “Mr. President, thank you, thank you, thank you! Kind of reminds you of how good it can be listening to him, doesn’t it?”", "As “Sir Duke” fades, honks and cheers are audible behind Biden’s speech.", "Fact check:False claim that Joe and Hunter Biden pictured golfing with Burisma CEO", "According to USA TODAY, 179 cars attended the drive-in event at Flint Northwestern High School.", "Associated Pressimages of the event show the crowd was socially distanced rather than “nonexistent,” as The Gateway Pundit claims.", "USA TODAY has debunked several claims about Biden's small crowds. Despite President Donald Trump’s repeated claims otherwise, USA TODAY found Biden’s small campaign events reflected his campaign’s adherence to social distancing guidelines rather than a lack of popularity.", "Fact check:12 of 28 comments deemed racist on viral list are Trump's direct speech", "C-SPAN footage reveals that a video of a Biden campaign event was altered to make Obama appear confused as he waits for Biden to take the stage. Though some viewers may be of the opinion that the moment was awkward, the alterations make it appear much differently from how it occurred. We rate this video ALTERED because archived footage shows the event did not play out as portrayed in the edited clip.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]