["Nigerian channel TVC News first ran the story on September 10, 2020. It also shared its report on YouTube, with the caption “Nigeria Emerges Most Terrorised Country In Africa, Ranks Worse Than Syria, Yemen, Somalia”.", "The report has since popped up in Facebook and Twitter posts, and in various blogs and articles. The Daily Times newspaper shared a screenshot from TVC News's report on Facebook on September 13, 2020, with the caption “Nigeria now above Syria, Somalia, Yemen in terrorism index as the country climbs to third position”.", "Chidi Odinkalu, a professor and former chairman of the country’s National Human Rights Commission, also shared the screenshot with his 76,000 followers on Twitter.", "Meanwhile, one Facebook page posted a doctored image of the screenshot with President Muhamadu Buhari, claiming he was “celebrating” the report.", "In reality, the picture showed Buhari unveiling the logo for Nigeria’s 60th independence anniversary celebration on 16 September, 2020.", "The Institute for Economics and Peace, which publishes the Global Terrorism Index, confirmed has not yet released this year's ranking. The last report dates back to  November 2019, and can be found here.", "The institute said on Twitter that the viral screenshot in fact shows data from 2019, when Nigeria genuinely ranked third in the Global Terrorism Index.", "According to the index, Africa's most populous nation saw 562 attacks that killed more than 2,000 people in 2018. It blamed the increase on a spike in deadly clashes over land.", "CLARIFICATION: This is data from the 2019 Global Terrorism Index.\n\n\t\tThe 2020 Global Terrorism Index has NOT yet been released and is due for launch in November 2020.", "Contacted AFP Fact Check, a spokesman from TVC News said the channel made a mistake.", "“It was an error and it's been corrected to reflect the correct date,” programme producer Festus Alabi said.", "The Global Terrorism Index “provides a comprehensive summary of the key global trends and patterns in terrorism over the last 50 years.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]