["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Employees leaving the Ford Motor Co. factory in Detroit, circa 1916. (Library of Congress)", "On Labor Day weekend, it’s not unusual to see claims about unions circulating on social media -- both favorable and unfavorable.", "A shareable graphic critical of organized labor caught the eye of a PolitiFact reader, who decided to forward it to us for a fact-check. The viral image said:", "Unions did not create:", "--Weekends", "--8-hour work days", "--A \"living wage\" (doubled worker's pay from $2.34/hr to $5/hr)", "--Five-day, 40-hour work weeks", "Henry Ford did in 1926 to attract better workers from his competitors for his automobile plant. Capitalism & competition creates higher wages & better working conditions. #HappyLaborDay.", "We wondered whether it was correct that Henry Ford, rather than unions, should get credit for creating the eight-hour work day and the 40-hour work week.", "A long struggle", "In the United States, a few limited eight-hour-day laws were on the books shortly after the Civil War. One, in Illinois, was passed in 1867, followed in 1868 by a law covering certain classes of federal workers. But neither law was well-enforced, and in most sectors, working hours of 10 to 12 hours were common. So a reduction in the work week became a leading issue for the nascent labor movement.", "The issue came to a head in 1884, after the Federation of Organized Trades and Labor Unions -- a predecessor of today’s AFL-CIO -- called for all workers to have eight-hour days by May 1, 1886. When that deadline wasn’t met, labor leaders upped the ante by calling for demonstrations. In Chicago, peaceful marches morphed into violence, with an explosion marring a rally at Haymarket Square on May 4, 1886, leaving seven police officers and four workers dead. Subsequent trials, executions and clemencies for the accused made the eight-hour week a top issue nationally and internationally.", "All of this occurred decades before Ford founded his company in 1903.", "Ford’s move", "In 1914, at a time when most workers still lacked a guarantee of eight-hour days, the Ford Motor Co. attracted notice for instituting eight-hour shifts and raising wages in the manner the graphic indicates. (For many Ford workers, the work week remained six days.)", "The company’s move -- made a dozen years earlier than the graphic said -- was significant, labor historians say. But they add that it’s worth noting some caveats. For instance, Ford’s \" ‘sociological department’ had to inspect a worker’s home to make sure they ‘deserved’ the $5 first,\" said Ileen A. DeVault, a professor of labor relations, law and history at Cornell University.", "In addition, Ford’s policy wasn’t law, so it wasn’t guaranteed to last indefinitely, even for those who qualified for it.", "\"It was a unilaterally provided benefit at the discretion of the employer and could be yanked away whenever the cost exceeded profits,\" said Robert Bruno, a professor with the University of Illinois School of Labor and Employment Relations. Companies that operated this way, Bruno said, often revoked these policies when the Great Depression hit.", "The endgame", "Ford’s initiative was not widely copied overnight. In 1916, the federal government passed an act to require an eight-hour day and overtime pay for railroad workers, but most workers still didn’t have those protections, and working hours remained a hotly contested issue. \"Demands for the five-day week began to proliferate in 1919, a year in which 4 million American workers went out on strike,\" said Priscilla Murolo, a professor of history at Sarah Lawrence College. \"That was about 20 percent of the industrial labor force.\"", "It took President Franklin D. Roosevelt’s signing of the Fair Labor Standards Act in 1938 for all workers to see limits on working hours -- initially 44 hours a week, then phased to 42 and eventually 40 by 1940. \"When the FLSA was passed in 1938, Saturday working hours were still common,\" DeVault said. \"Saturday noon was the most frequent ‘payday’ time.\"", "Given this history, Ford is best described as an early adopter of today’s familiar working hours, experts said.", "\"That happened more than 60 years after workers, through their unions, began organizing for an eight-hour day in the 1860s,\" said David Bensman, a professor at Rutgers University's School of Management and Labor Relations. \"When Ford adopted the eight-hour day for his factory, he was responding to a working force that had been demanding the eight-hour day for a long time.\"", "Other experts agreed that labor unions, rather than Ford, deserve the primary credit for today’s working-hour schedule -- including Matt Anderson, curator of transportation at the Henry Ford museum in Dearborn, Mich.", "\"Henry Ford was an early proponent of the five-day week, but the American Federation of Labor fought for it to be adopted more widely via contract negotiations,\" Anderson said. \"Unions absolutely deserve much credit for the reform.\"", "Our ruling", "A viral image said that Henry Ford, not unions, created the eight-hour work day and the five-day work week.", "Ford does deserve credit for adopting shorter working shifts, but he was hardly the first employer to do this, and the now-standard working schedule did not become federal law -- and thus a right for all workers -- until almost a quarter-century after Ford’s move. Meanwhile, experts said, unions do deserve credit for keeping the working-hours issue alive, at significant personal sacrifice, for 70 years.", "The claim contains some element of truth but ignores critical facts that would give a different impression, so we rate it Mostly False.", "Shareable graphic, received by PolitiFact Sept. 6, 2015", "U.S. Department of Labor, \"Fair Labor Standards Act of 1938: Maximum Struggle for a Minimum Wage,\" accessed Sept. 8, 2015", "NBC News, \"Where Did the 40-Hour Workweek Come From?\" Sept. 1, 2014", "Illinois Labor History Society, \"The Haymarket Affair,\" accessed Sept. 8, 2015", "History.com, \"Ford factory workers get 40-hour week,\" accessed Sept. 8, 2015", "Email interview with Nelson Lichtenstein, director of the Center for the Study of Work, Labor and Democracy at the University of California-Santa Barbara, Sept. 8, 2015", "Email interview with David Bensman, professor at Rutgers University's School of Management and Labor Relations, Sept. 8, 2015", "Email interview with Robert Bruno, professor with the University of Illinois School of Labor and Employment Relations, Sept. 8, 2015", "Email interview with Priscilla Murolo, professor of history at Sarah Lawrence College, Sept. 8, 2015", "Email interview with Ileen A. DeVault, professor of labor relations, law and history at Cornell University, Sept. 8, 2015", "Email interview with Matt Anderson, curator of transportation at the Henry Ford museum in Dearborn, Mich., Sept. 8, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]