["On August 22, the Bharatiya Janta Party (BJP) tweeted an infographic listing the projected Gross Domestic Product (GDP) growth percentages in 2020 of nine countries—India, China, United States, Germany, France, Italy, Spain, Japan, United Kingdom and Canada. The International Monetary Fund (IMF) is cited as the source of the data. “While the world continues to grapple with economic bloodbath with major economies projected to register negative growth in the aftermath of #COVID pandemic, India will be a shining spot with positive growth in 2020. It will also retain its status of the fastest growing economy,” read the BJP’s tweet. This was retweeted over 2,500 times.", "While the world continues to grapple with economic bloodbath with major economies projected to register negative growth in the aftermath of #COVID pandemic, India will be a shining spot with positive growth in 2020. It will also retain its status of the fastest growing economy. pic.twitter.com/lELEbZaDl3", "— BJP (@BJP4India) August 22, 2020", "This infographic was also shared by BJP Nagaland, BJP Delhi and BJP Odisha.", "This slideshow requires JavaScript.", "Several BJP MPs tweeted it as well—Manoj Rajoria, Subhash Bhamre, Rajesh Verma, Parshottam Sabariya, Nityanand Rai and Arjun Munda.", "This slideshow requires JavaScript.", "BJP’s tweet raises two questions that this fact-check will answer.", "The short answer to both the questions is NO.", "The BJP had tweeted a similar infographic in April which compared IMF’s projection of GDP growth rates for 2020 and 2021. The tweet said, “Indian economy is strong enough to withstand the impact of #Corona pandemic. While most of major economies are staring at economic mayhem and severe recession with projections of negative growth in 2020, IMF projects a positive growth for India in 2020 and 7.4% in 2021.”", "The data for 2020 in both the April and August infographics is identical.", "Readers should note that the IMF releases World Economic Outlook Reports twice a year—April and September/ October—followed by two updates. While the BJP’s April infographic was rightly based on the IMF data released in April, its August infographic was also based on the same data. ‘World Economic Outlook: The Great Lockdown’ was published in April which indeed projected 1.9% and 7.4% growth for India in 2020 and 2021 respectively.", "However, in June, the IMF released an update on the report—‘World Economic Outlook Update’. According to this report, “Economic data available at the time of the April 2020 WEO forecast indicated an unprecedented decline in global activity due to the COVID-19 pandemic. Data releases [released] since then suggest even deeper downturns than previously projected for several economies.”", "In its June report, the IMF revised its April estimates and projected a contraction of -4.5% in 2020. “India’s economy is projected to contract by 4.5 percent following a longer period of lockdown and slower recovery than anticipated in April,” the report stated.", "Therefore, the BJP’s tweet claiming “India will be a shining spot with positive growth in 2020” is false. The ruling party used four-month-old data to reflect positive growth. According to the IMF’s updated report released in June, India is projected to experience a negative growth rate by 4.5%.", "While the BJP attempted to portray that India is projected to “retain its spot as the fastest growing economy in the world”, the IMF data forecasts better growth rates for China and ASEAN-5. In fact, China’s estimated growth rate for 2020 is 1%. It is evidently misleading to suggest that India will be at the top when the country is predicted to have negative growth while China is the only country predicted to experience positive growth.", "It is to be noted that the IMF’s projections in June may alter in the next report as the pandemic continues to evolve. Nonetheless, the BJP’s claim that the international organisation predicted positive growth for India in 2020 and suggested that the country will “retain” its spot as the fastest-growing economy is false.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "On August 16, while responding to queries by the media on the ongoing issue of…", "Several social media users have shared a purported break-up of fuel prices that claims state…", "On February 26, Uttar-Pradesh Chief Minister Yogi Adityanath tweeted in Hindi, “Despite the global economic…", "After the fifth increase in LPG refill prices since December 2020, except for a meagre…", "Did the Modi government clandestinely transfer over 200 tonnes of gold overseas, from the Reserve…"]