["About this rating", "On 2 January 2016, an event known as the \"Malheur Occupation\" or \"Oregon Standoff\" began at the headquarters of the Malheur National Wildlife Refuge in Harney County, Oregon. The armed militia that occupied the building on the reserve said they were doing so in order to protest overreach by the federal government after two ranchers were sentenced to prison for arson on public lands. The standoff mostly ended on 26 January 2016, when one occupier was shot and killed by police at a traffic stop, and eleven more were arrested.", "One of the discussions that ensued as a result of this was government ownership of land. Social media users focused a number of posts and tweets at policies and practices relating to the Bureau of Land Management, particularly a common assertion about the legality of federally-managed lands when considered in light of a portion of the U.S. Constitution that supposedly states:", "The Federal Government shall never own title to any real property which is not specifically authorized by this Constitution such as parks, forests, dams, waterways, and grazing areas without the consent of the State where same is located.", "However, these words do not appear anywhere in the U.S. Constitution, so an argument that the Constitution specifically prohibits the federal government from \"owning title\" to \"grazing areas\" (without the permission of the states in which those areas are located) fails on that basis.", "Some online pundits have asserted that the specific wording at issue here is found in Article I, Section 8 of the Constitution (at \"Clause 17,\" although it is not numbered as such), which reads:", "The Congress shall have Power:", "To exercise exclusive Legislation in all Cases whatsoever, over such District (not exceeding ten Miles square) as may, by Cession of particular States, and the Acceptance of Congress, become the Seat of the Government of the United States, and to exercise like Authority over all Places purchased by the Consent of the Legislature of the State in which the Same shall be, for the Erection of Forts, Magazines, Arsenals, dock-Yards, and other needful Buildings.", "Some background is necessary to understand this clause in its proper context.  Since the legislative branch (i.e., Congress) was the only branch of federal government that existed at the time the Constitution was written, that document's framers expected it to be the most important branch of government and took care to list its powers in considerable detail right up front in Article I.  Hence that article contains \"the laundry list of federal powers,\" including Section 8, which sets forth the enumerated powers of Congress (i.e., powers that are specifically listed as belonging to the national government).  Those  enumerated powers include the power to tax, the power to spend revenues for the \"common defense and general welfare of the United States,\" to regulate commerce, to coin money, to establish post offices and roads, to declare war, to raise and support an army and navy.", "The so-called \"Clause 17\" of Article I, Section 8 deals with the issue that the Constitution's framers had agreed that the new nation's capital should be located in a district that was independent any particular state government and subject only to federal control.  Thus the plan was to create a federal district no more than ten miles square from land ceded by one or more states to house the U.S. national capital, which was accomplished when the Compromise of 1790 ended with agreement to form the District of Columbia from landed ceded by Maryland and Virginia.  The national capital was temporarily relocated from New York to Philadelphia while construction began on homes for the president and Congress, and in 1800 the United States' capital was moved again (for the final time) to Washington, D.C., in December 1800.", "\"Clause 17\" merely allows Congress to exercise exclusive control over that federal district, and over any structures constructed there deemed necessary for carrying on the business of the national government (such as forts, arsenals, and post offices).  It does not preclude the federal government from purchasing or holding title to other land within the various states, or from using public land for purposes such as establishing and managing parks, forests, dams, waterways, and grazing areas without the consent of the states in which those facilities are located.", "In fact, the following clause (commonly known as the \"Necessary and Proper Clause\" or the \"Elastic Clause\") grants Congress the authority to carry out its enumerated powers, and that clause has since been broadly interpreted to allow the national government management over areas designated as national parks, federal public works projects such as dams and waterways, and livestock grazing on public rangelands.", "It's possible that some advocates of the \"no title to any real property\" viewpoint might be confusing the actual U.S. Constitution with language found in the so-called \"Texas Constitution 2000\" (which was not an actual piece of legislation, but rather an unofficial proposed revision of the existing Texas state constitution), which contained a clause stating that \"Government shall never own title to any real property which is not specifically authorized by this constitution.\"", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]