["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This Feb. 27, 2020, file photo, shows the Idaho House of Representatives in the Idaho Statehouse in Boise, Idaho. (AP)", "Congress and at least 17 states are considering legislation that would prohibit transgender students from being part of teams that don’t match their sex assigned at birth.", "None of those bills would force teachers to examine students’ genitalia.", "Some would allow for the possibility of doctors examining students before they can participate in sports.", "In a video seen by tens of thousands of people, someone sketches in pencil as a computerized voice speaks over a recording of the song \"Michelle\" by the indie band Sir Chloe.", "\"This is f---ing disgusting,\" the voice says. \"Schools are trying to make a law that teachers can see girls' private parts to make sure they're not trans.\"", "The sound in the clip has been used in more than 13,000 other posts on the video-sharing platform TikTok, which is popular with teenagers and young adults.", "The posts came days after President Joe Biden signed an executive order that said Title IX of the Education Amendments of 1972, a federal civil rights law, prevents discrimination based on sex and gender identity.", "\"Every person should be treated with respect and dignity and should be able to live without fear, no matter who they are or whom they love,\" the order says. \"Children should be able to learn without worrying about whether they will be denied access to the restroom, the locker room, or school sports.\"", "While the order itself did not change policies for public school districts, it signaled a departure from the Trump administration’s position that schools may exclude students from athletic teams based on their identities. In response, several state legislatures introduced bills that would prohibit transgender students from being part of teams that don’t match their sex assigned at birth.", "(Screenshot from TikTok)", "The viral TikTok posts contain a hint of truth about this legislation, but their primary claim is misleading.", "Congress and state legislatures — not schools — have introduced bills targeting transgender student-athletes. None of the pending legislation would force teachers to examine students’ genitalia. Some bills would open up the possibility for doctors to examine students before they can participate in sports.", "Lawmakers in at least 17 states are considering legislation that would limit opportunities for transgender student-athletes, according to a tally from the Human Rights Campaign, an LGBTQ advocacy organization.", "Cathryn Oakley, state legislative director and senior counsel for the HRC, has been tracking those bills. She said the TikTok posts leave out some key details.", "\"None of them require a teacher to do a physical examination for a student,\" Oakley said. \"However, several of them would require that a student would undergo a physical examination by a doctor — and that doctor would have to attest that they've done a variety of different things. In some of the states, it’s really invasive, gruesome testing.\"", "As an example, Oakley pointed to a passed Idaho law that banned transgender women and girls from participating in women’s sports. (The law is currently not being enforced as it undergoes a legal challenge.)", "\"If disputed, a student may establish sex by presenting a signed physician's statement that shall indicate the student's sex based solely on: (a) The student's internal and external reproductive anatomy; (b) The student's normal endogenously produced levels of testosterone; and (c) An analysis of the student's genetic makeup,\" the March 2020 law said.", "In an April 2020 lawsuit, the American Civil Liberties Union argued that the Idaho law \"discriminates on the basis of sex and transgender status\" and the doctor’s examinations would \"intrude upon the privacy and bodily autonomy of all women and girls engaged in student athletics.\" The lawsuit was filed on behalf of Lindsay Hecox, a transgender woman who wanted to run cross-country at Boise State University.", "In August, a federal judge blocked the law, saying the ACLU was \"likely to succeed in establishing the Act is unconstitutional as currently written.\" The law now awaits legal review in the Ninth Circuit Court of Appeals.", "Meanwhile, several other states — including neighboring Montana and Utah — are trying to pass their own versions of the Idaho law.", "RELATED: Biden signs executive order banning discrimination against transgender service members", "And in Congress, Rep. Greg Steube, R-Fla., recently reintroduced a bill that would require schools to interpret Title IX to recognize student-athletes based on their sex assigned at birth.", "\"The bill does not say anything about physical exams — it is based on what was determined at birth,\" said Carson Steelman, Steube’s communications director. \"Genetics at birth is shown on an original birth certificate.\" (Some states, however, allow transgender individuals to change the sex listed on their birth certificate.)", "While some proposals, including legislation in Iowa and Georgia, contain specific provisions about doctors’ exams, we could find no evidence that lawmakers are pushing for teachers to examine transgender students. Utah state Rep. Kera Birkeland, a Republican, said \"the physical required for sports participation will not change at all\" under her bill.", "Several TikTok posts say \"schools are trying to make a law that teachers can see girls' private parts to make sure they're not trans.\"", "That claim is a misunderstanding of how some states are trying to legislate against transgender students.", "Congress and at least 17 states are considering legislation that would prohibit transgender students from being part of teams that don’t match their sex assigned at birth. Some of those bills would require doctor’s exams, but none of them say teachers would examine students’ genitalia.", "The TikTok posts contain an element of truth about legislation that could compel the examination of transgender students. But the posts ignore critical facts that would give a different impression about how that legislation would be implemented.", "We rate the TikTok posts Mostly False.", "American Civil Liberties Union, HECOX V. LITTLE - COMPLAINT", "American Civil Liberties Union, HECOX V. LITTLE - DECISION GRANTING PRELIMINARY INJUNCTION", "Boise State Public Radio, \"Lawmakers In 19 States Cloning Idaho's Transgender Athlete Bill,\" Feb. 8, 2021", "CNBC, \"TikTok passes Instagram as second-most popular social app for U.S. teens,\" Oct. 6, 2020", "CNN, \"Federal judge says Idaho cannot ban transgender athletes from women's sports teams,\" Aug. 18, 2020", "Congress.gov, H.R.426 - Protection of Women and Girls in Sports Act of 2021", "Email interview with Carson Steelman, communications director for Rep. Greg Steube, Feb. 16, 2021", "Email interview with Utah state Rep. Kera Birkeland, Feb. 16, 2021", "Federal Register, \"Preventing and Combating Discrimination on the Basis of Gender Identity or Sexual Orientation,\" Jan. 25, 2021", "Florida Politics, \"Greg Steube seeks to disqualify transgender students from women’s sports,\" Jan. 22, 2021", "Georgia General Assembly, HB 372", "Human Rights Campaign, \"These Are The States Trying To Stop Trans Kids from Playing Sports,\" Feb. 10, 2021", "Human Rights Campaign, \"VICTORY: U.S District Court Grants Injunction Against Enforcement of Idaho’s Discriminatory, Anti-Transgender HB 500,\" Aug. 17, 2020", "Idaho Legislature, HOUSE BILL 500", "Interview with Cathryn Oakley, state legislative director and senior counsel at the Human Rights Campaign, Feb. 16, 2021", "Iowa Legislature, HouseFile184-Introduced", "Lambda Legal, CHANGING BIRTH CERTIFICATE SEX DESIGNATIONS: STATE-BY-STATE GUIDELINES", "Montana Legislature, 1 HOUSE BILL NO. 112", "National Law Review, \"Transgender Students and Title IX: Biden Administration Signals Shift,\" Jan. 29, 2021", "Politico, \"States challenge Biden on rights for transgender students,\" Jan. 28, 2021", "TikTok, accessed Feb. 16, 2021", "TikTok video, Jan. 30, 2021", "TikTok video, Jan. 30, 2021", "Utah Legislature, H.B. 302 Preserving Sports for Female Students", "The Washington Post, \"As transgender rights debate spills into sports, one runner finds herself at the center of a pivotal case,\" July 27, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]