["“If the Africans think that all that is foreign and English is good... they will become what we want them, a truly dominated nation,” reads the extract of a speech purportedly given by Lord Macaulay to Britain's parliament on February 2, 1835.", "It calls on Britain to “break the very backbone of this nation” and “replace her old and ancient education system, her culture”.", "A screenshot of the speech has been widely shared since at least 2015 on social media in Africa, including in Nigeria, Kenya and Uganda.", "A similar version of the speech with the word “Africa” replaced with “India” has also circulated online in India.", "The speech has been widely cited, including by the Indian government in a report on employment and education published in 2002.", "Britain ruled much of Africa and the Indian subcontinent from the 18th until the late 20th century. Macaulay played a key role in establishing a Western education system and criminal code in India in the 1830s.", "However, the speech he apparently gave to Britain's parliament on creating “a truly dominated nation” does not exist in the Hansard archives, which document parliamentary records from the early 19th century to the present.", "There are 789 results for the word “Macaulay” from 1800 to 1859 -- the period he was alive -- in parliamentary archives, but none of them features the speech.", "It is also nowhere to be found in Columbia University's records of Macaulay's life and work.", "Social media posts claim that Macaulay gave the speech to parliament on February 2, 1835. However, not only was parliament closed on this date, but Macaulay was in India.", "Contacted by AFP, a spokesman for Britain's House of Lords said that parliament was prorogued between August 15, 1834, and February 19, 1835. The speech “could not have been said during this period”, he said.", "Between 1834 and 1838, Macaulay held various posts in India under British rule, serving on the Supreme Council of India and presiding a commission on Indian jurisprudence.", "“He could not have made (the speech, editor's note) as he was firmly in Calcutta at the time,” said Dr Zareer Masani, historian and author of “Macaulay: Britain's Liberal Imperialist”.", "Several historians told AFP they did not think the man in the photograph accompanying the quote was Lord Macaulay. “It's definitely not Macaulay although it's been wrongly attributed to him,” Masani said.", "One historian, who didn't want to be quoted, pointed out that the man presented in social media posts as Macaulay (below left) resembled a portrait of British army officer Sir Henry John William Bentick (below right) on the National Portrait Gallery's website.", "Authorship of the speech has also been attributed to Lord William Bentick -- not to be confused with Sir Henry John William Bentick -- who was a contemporary of Macaulay's and served as Governor-General of British India.", "Macaulay's “Minute on Education” in 1835, which promoted the superiority of Western education, was supported by Lord William Bentick. In the document, Macaulay talks of creating “a class of persons Indian in blood and colour, but English in tastes, in opinions, in morals and in intellect”.", "Macaulay's parliament speech was previously debunked by Indian news site The Wire.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]