["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As the country was slogging into the third week of a government shutdown, a claim about federal paralysis caught fire on social media.", "Over an image of leafy vegetables growing in a field, a meme posted on Jan. 9 said, \"Lettuce killed more Americans this year than undocumented immigrants.\" (The accompanying comment on the Facebook post was, \"lettuce prey.\")", "The shutdown stemmed from President Donald Trump’s desire to build a wall on the U.S.-Mexico border and Democrats’ opposition to funding it at levels Trump considers sufficient. The resulting lapse in federal appropriations has shuttered many parts of the government, including some food-safety inspections handled by the Food and Drug Administration.", "The assertion was amplified when a Hollywood writer tweeted it the following day.", "\"Last year lettuce killed more Americans than undocumented immigrants so it's a good thing we're halting food inspections over a wall that won't work,\" tweeted Ally Maynard, a television producer with 80,500 followers. It inspired at least 67,000 retweets and 209,000 likes through Jan. 15.", "Last year lettuce killed more Americans than undocumented immigrants so it's a good thing we're halting food inspections over a wall that won't work.", "Social media users wondered if what she wrote was accurate. Some searched the Centers for Disease Control looking for more information.", "We decided to help everyone out.", "The number appears to be at least five.", "There were two high-profile E. Coli outbreaks from romaine lettuce in 2018. The first, in May 2018, resulted in five deaths and at least 210 illnesses, about half of which resulted in hospitalizations. The second, in November, resulted in a few dozen illnesses but no reported deaths.", "Don’t assume that the nonfatal illnesses were minor, however.", "E. coli O157:H7, the pathogen involved in these outbreaks, \"can cause a life-threatening complication called hemolytic uremic syndrome among the very young or elderly,\" said Craig Hedberg, a University of Minnesota epidemiologist. There were 27 such cases in the first outbreak, and two in the second.", "As for undocumented immigrants and crime, let’s start with the big picture: They have been found to be no more likely than U.S.-born individuals to take part in crime.", "One study published earlier this year by sociologists from the University of Wisconsin and Purdue University, for instance, concluded that \"undocumented immigration does not increase violence.\"", "And there’s a bigger body of academic research that suggests that immigrants, regardless of legal status, are no more likely to commit criminal acts than native-born Americans, said Christopher P. Salas-Wright, an assistant professor at Boston University’s School of Social Work.", "\"We continue to find that areas with higher concentrations of immigrants have lower violent crime rates,\" said Charis E. Kubrin, a University of California-Irvine criminologist, citing a recent paper she wrote.\n\nKubrin added that for the most part, studies find that people who migrate are a self-selecting group who want to better their lives, provide for their families back in their home countries and don’t want to risk getting in trouble with the law.", "There were some high-profile examples in 2018 of undocumented immigrants being charged with homicide. One was Cristhian Bahena Rivera, a farmhand who was charged with murdering 20-year-old University of Iowa student Mollie Tibbetts. Another was Gustavo Perez Arriaga, who was charged with killing police officer Ronil Singh in Newman, Calif. Neither case has been adjudicated yet.", "But while anecdotes exist, hard data about killings by undocumented immigrants is hard to find. As we’ve noted previously, it is not a statistic that is calculated on a national basis. So the best we can manage is guesswork.", "We know that there have recently been about 19,000 homicides every year in the United States, and presumably some fraction of them have been committed by undocumented immigrants.", "Comparing the estimated size of the undocumented immigrant population (10.7 million) and the full U.S. population (327 million), the roughest possible calculation would suggest that about 600 of those homicides would have been committed by undocumented immigrants per year.", "That’s not far off another data point we have — the number of convictions of illegal immigrants for homicides in Texas.", "Cato Institute senior immigration policy analyst Alex Nowrasteh pointed to a Texas Department of Public Safety website that reported 238 homicide convictions of undocumented immigrants between June 1, 2011, and Dec. 31, 2018. Based on his communications with the agency, Nowrasteh was able to pinpoint 39 convictions that occurred in Texas in 2018. These are convictions for homicides that occurred in a variety of years, so it’s not perfectly comparable, but it’s a rough estimate.", "If you prorate Texas’s 39 homicide convictions to the country as a whole — simply using population — it works out to 445 nationally.", "As we’ve emphasized, these are back-of-the-envelope calculations. But even if these estimates — a couple hundred homicides by undocumented immigrants — are high by a factor of 10, they almost certainly outpaced the five lettuce deaths in 2018.", "So the statement that rocketed around social media is wrong. But a small change in wording could have made a big difference.", "If the statement had used the word \"food\" rather than \"lettuce,\" it might well have been correct. (This is also a fuller description of what the FDA inspects anyway.)", "A 2011 study by the Centers for Disease Control and Prevention used models to estimate the annual number of deaths due to 31 pathogens to be 2,612, or 1,351 if you include only domestically acquired foodborne illnesses.", "Either figure would be larger than the estimate of couple hundred deaths every year at the hands of undocumented immigrants. (These numbers are also larger than the number of confirmed deaths from foodborne illness in recent years, but that is generally chalked up to gaps in reporting and medical uncertainties about what actually led to a person’s death.)", "For her part, Maynard told PolitiFact that her comparison \"was definitely meant in jest,\" and that finding hard data on the question was difficult.", "The meme said, \"Lettuce killed more Americans this year than undocumented immigrants.\"", "To the best we can tell from imperfect data, that’s incorrect. However a small tweak -- changing the term to \"food,\" which is the FDA’s full responsibility -- would likely have supported the meme’s point. On its own, we rate the statement False.", "Politicked, meme, Jan. 9, 2019", "Ally Maynard, tweet, Jan. 10, 2019", "Centers for Disease Control and Prevention, \"Estimates of Foodborne Illness in the United States,\" accessed Jan. 15, 2019", "Centers for Disease Control and Prevention, \"Table 3. Estimated annual number of hospitalizations and deaths caused by 31 pathogens transmitted commonly by food, United States,* accessed Jan. 15, 2019", "Centers for Disease Control and Prevention, \"Foodborne Disease Active Surveillance Network 2015 Surveillance Report (Final Data),\" accessed Jan. 15, 2019", "Centers for Disease Control and Prevention, \"Attribution of Foodborne Illnesses, Hospitalizations, and Deaths to Food Commodities by using Outbreak Data, United States, 1998–2008,\" Table 1", "Centers for Disease Control and Prevention, all homicides, accessed Jan. 15, 2019", "Centers for Disease Control and Prevention, \"Outbreak of E. coli Infections Linked to Romaine,\" Jan. 9, 2019", "Texas Department of Public Safety, \"Texas Criminal Illegal Alien Data,\" accessed Jan. 15, 2019", "Michael T. Light and Ty Miller, \"Does Undocumented Immigration Increase Violent Crime?\" March 25, 2018", "Graham C. Ousey and Charis E. Kubrin, \"Immigration and Crime: Assessing a Contentious Issue,\" January 2018", "Christopher P. Salas-Wright, Michael G. Vaughn, and Trenette Clark Goings, \"Immigrants from Mexico experience serious behavioral and psychiatric problems at far lower rates than US-born Americans,\" Aug. 12, 2017", "Christopher P. Salas-Wright, Michael G. Vaughn, Seth J. Schwartz, and David Córdova, \"An ‘immigrant paradox’ for adolescent externalizing behavior? Evidence from a national sample,\" Sept. 2, 2015", "Michael G. Vaughn, Christopher P. Salas-Wright, Zhengmin Qian, \"Evidence of a ‘refugee paradox’ for antisocial behavior and violence in the United States,\" June 3, 2015", "Michael G. Vaughn, Christopher P. Salas-Wright, Matt DeLisi, and Brandy R. Maynard, \"The immigrant paradox: immigrants are less antisocial than native-born Americans,\" July 2, 2014", "Michael G.Vaughn, Christopher P.Salas-Wright, \"Immigrants commit crime and violence at lower rates than the US-born Americans,\" January 2018", "Cato Institute, \"Immigration Myths - Crime and the Number of Illegal Immigrants,\" March 20, 2017", "U.S. Census Bureau, \"Annual Estimates of the Resident Population for the United States, Regions, States, and Puerto Rico: April 1, 2010 to July 1, 2018,\" accessed Jan. 15, 2018", "Pew Research Center, \"5 facts about illegal immigration in the U.S.,\" Nov. 28, 2018", "New York Times, \"F.D.A. Says It Will Resume Inspections of Some High-Risk Foods,\" Jan. 14, 2019", "USA Today, \"Tainted romaine lettuce deaths hit 5, cases encompass 35 states,\" June 1, 2018", "Eater.com, \"Why Does It Seem Like Everyone Is Getting Sick from Salad?\" Nov. 20, 2018", "PolitiFact, \"Trump leaves out context in claim about immigrants and crime,\" Nov. 3, 2016", "PolitiFact, \"Claim about 63,000 Americans being killed by illegal immigrants is still wrong,\" Jan. 9, 2019", "Email interview with Charis E. Kubrin, University of California-Irvine criminologist, Jan. 14, 2019", "Email interview with Christopher P. Salas-Wright, assistant professor at Boston University’s School of Social Work, Jan. 14, 2019", "Email interview with Craig Hedberg, University of Minnesota epidemiologist, Jan. 15, 2019", "Email interview with Jeff Passel, immigration specialist with the Pew Research Center, Jan. 14, 2019", "Email interview with Alex Nowrasteh, senior immigration policy analyst at the Cato Institute, Jan. 14, 2019", "Email interview with Ally Maynard, writer, Jan. 14, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]