["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ed Gillespie says he’s convinced that the Republican philosophy of \"limited, effective\" government is just what Virginia needs.", "But there’s a hitch.", "\"To enact those policies, we must first win elections because for the first time in over 40 years, Republicans don’t hold a single statewide office,\" Gillespie, who plans to run for governor next year, said in an April 30 speech at the GOP state convention.", "We wondered if this really is the first time in more than four decades that no Republican holds any of Virginia’s five statewide offices.", "The 2013 sweep in statewide elections for governor, lieutenant governor and attorney general by Terry McAuliffe, Ralph Northam and Mark Herring, respectively, left Democrats in full control of Virginia’s executive posts. Democrats Mark Warner and Tim Kaine, meanwhile, hold Virginia’s two U.S. Senate seats.", "If you’re a political junkie, stop here for a minute. Try to figure out the last full year - before 2014 - that Democrats had such a lock.", "Now, let’s go back in time together.", "From 2010 through 2013, Gov. Bob McDonnell, Lt. Gov. Bill Bolling and Attorney General Ken Cuccinelli - all of them Republicans - held the state’s top three positions. Actually, the GOP had at least one of those three offices every year since the early 1990s, when Democrats held them all under Gov. L. Douglas Wilder, Lt. Gov. Don Beyer and Attorney General Mary Sue Terry.", "But even with no Republicans holding an executive post in state government, the GOP back then had John Warner, who served in the U.S. Senate from 1979 until 2009.", "You have to go back to 1969 to find the last full year when Democrats held all five statewide posts. That year, Gov. Mills Godwin, Lt. Gov. Fred Pollard and Attorney General Robert Button were in office along with U.S. Sens. Harry F. Byrd Jr. and William B. Spong Jr.", "Later that year, Linwood Holton became the first Republican elected governor in Virginia. He was inaugurated Jan. 17, 1970. Byrd and Godwin, like many Southerners, abandoned the Democratic Party in the early 1970s as it moved to the left. Byrd became an independent in 1971 and, two years later, Godwin was re-elected governor as a Republican.", "Why is the GOP now frozen out of statewide seats?  A key reason is demographics, said Larry Sabato, a political scientist at the University of Virginia.", "Much of Virginia’s population growth in recent decades has been in urban and suburban areas that tend to vote Democratic, such as Northern Virginia, Hampton Roads and greater Richmond, as well as in university towns, Sabato said.", "\"This really started in the 1960s, in a big way,\" he said.", "Voters in rural parts of the state remain receptive to socially conservative ideas that Republicans embrace, but \"that’s not where the people are,\" Sabato said.", "Our ruling", "Gillespie said this is the first time in more than 40 years that a Republican doesn’t hold a single statewide office.", "Actually, you have to go back almost 47 years to find the last time the GOP didn’t hold at least one statewide seat.", "We rate Gillespie’s claim True.", "Ed Gillespie’s comments at Virginia GOP state convention, April 30, 2016.", "Emails from Chris Leavitt, campaign manager for Ed Gillespie, May 4, 2016.", "Encyclopedia Virginia, \"Members of the United States Senate from Virginia,\" accessed May, 5, 2016.", "Encyclopedia Virginia, \"Governors of Virginia,\" accessed May 5, 2016.", "Encyclopedia Virginia, \"Attorneys General of Virginia,\" accessed May 5, 2016.", "Encyclopedia Virginia, \"Lieutenant Governors of Virginia,\" accessed May 5, 2016.", "Interview with Larry Sabato, political scientist at the University of Virginia, May 10, 2016.", "Biographical Guide of the United State’s Congress, entry for William Spong Jr., accessed May 5, 2016.", "Biographical Guide of the United State’s Congress, entry for John Warner, accessed May 5, 2016.", "The Washington Post, \"Mark Herring’s victory in Virginia confirms Democrats’ advantage in statewide races,\" Dec. 18, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]