["The collage was shared in this Facebook post on July 3, 2020.", "The first photo, which shows a rubbish-filled body of water, bears a Tagalog-language text overlay that translates to English as: “DURING THE TIME OF DECENT PEOPLE / PASIG RIVER / Aquino Term”.", "The second photo, which shows the same body of water without noticeable pollutants, is overlaid with text that reads: “PASIG RIVER / Duterte Term / DURING THE TIME OF INDECENT PEOPLE”.", "Duterte was elected president in May 2016, replacing former President Benigno Aquino III.", "Identical photo collages were shared alongside a similar claim on Facebook here, here, here, here and here.", "The claim is false.", "Combined reverse image and keyword searches on Google found that both photos were published online in May 2011, more than five years before Duterte took office.", "They were published in this report by the Asian Development Bank (ADB) about cleanup operations in a Pasig River tributary.", "The ADB report states: “A massive cleanup in Estero de Paco, an estuary (sic) of Manila's Pasig River, was conducted. Concrete embankments have been built and running water and septic tanks installed.”", "Below is a set of screenshot comparisons showing the photos in the misleading posts (L) and the photos in the ADB report (R):", "The photos were also published in this September 2012 report by Philippine news organisation Rappler.", "The location of the Estero de Paco estuary in relation to the Pasig River can be viewed on Google Maps here.", "The misleading use of the photos has also been debunked by FactRakers, a Philippines-based fact-checking initiative.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]