["About this rating", "On 26 May 2016, the image reproduced above was shared on Twitter by National Review writer Charles C.W. Cooke. The purported Hillary Clinton campaign ad showed a male model and the hashtag #ManEnough4Hillary:", "#ManEnoughforJohnson pic.twitter.com/3uskgF0Azg", "— Charles C. W. Cooke (@charlescwcooke) May 26, 2016", "The image from the purported campaign ad appeared to be a stock photo that was also used for a public service announcement about syphilis:", "@adamjohnsonNYC He's a fake just like most of Hillary's supporters. #ManEnough4Hillary pic.twitter.com/SY4hxxHVF2 — #SeeYouInPhilly (@MalyndaNyc) May 26, 2016", "The ad was apparently accepted as legitimate, and the web sites Daily Caller and the Daily Wire both published articles mocking the campaign for its lack of due diligence. In the latter, Ben Shapiro wrote:", "On Thursday, the Hillary Clinton campaign released one of the worst ads in political history. A stock photo male model smoldering into camera, a tattoo sleeve down his arm, his face bearded nearly as much as Hillary’s marriage, with the caption “I am man enough to vote for a woman…Are you?” This is everything wrong with the Hillary campaign. First off, grabbing a stock photo of popular male models comes with some problematic search results [image of bus ad.] Hillary, like syphilis, is the gift that keeps on giving.", "Social media users appeared to be amused by what they perceived to be either poor vetting of campaign imagery, or simply a humorous juxtaposition showing what appeared to be the same male model. Most took the images at face value, presuming that the Clinton campaign selected the same male model (or a very similar looking one) for a male-targeted ad as was featured in a PSA regarding sexually transmitted infections:", "The hashtag #ManEnough4Hillary first appeared in late March 2016. The user who tweeted the hashtag added an Instagram photograph to the first tweet:", "#ManEnough4Hillary #imwithher #dem4life #hrc #hillaryclinton", "A photo posted by Craig Robert Young (@craigyoung26) on Mar 26, 2016 at 9:32pm PDT", "That version appeared to involve one social media user who applied it to himself, and there was no indication that the Clinton campaign had either created or adopted it as a social media tool at any time. The hashtag didn't begin popping up again until early May 2016, when the initial image was mocked by a Twitter user:", "Yeah, it takes real courage to support a gyno-socialist and her man hating ilk#ManEnough4Hillary #CorruptHillary pic.twitter.com/amLKDSl7VL — Un' Ardrito (@volksgenosse) May 11, 2016", "no, the #ManEnough4Hillary lumbersexual syphilis stock-photo man is not from Team Hillary smh", "— Asawin Suebsaeng (@swin24) May 26, 2016", "Whether the image was used for a standalone joke or specifically arranged to fit in with the \"syphilis\" quips, the #ManEnough4Hillary ad was not an authentic Clinton campaign effort, which was confirmed by a spokesperson from the Hillary Clinton campaign.", "Merlan, Anna.   \"No, That 'Man Enough For Hillary' Ad Featuring a Tattooed Beefcake Is Not Real.\"\r\n    Jezebel.   26 May 2016.", "Shapiro, Ben.   \"Hillary’s Beardy McHipster Ad Is PRECISELY Why Men Can't Stand Her.\"\r\n    The Daily Wire.   26 May 2016.", "Treacher, Jim.   \"Are You #ManEnough4Hillary?\"\r\n    Daily Caller.   26 May 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]