["About this rating", "At several times in the lead-up to the Jan. 5, 2021, Georgia Senate runoff election, Biden, Ossoff, and Warnock promised that the latter's election would result in $2,000 per person stimulus checks. On Jan. 20, Biden unveiled a plan that included $1,400 checks. Biden's plan took longer to reveal than promised during the campaign, and has yet to be signed into law.", "However, these promises were always made in the context of legislation blocked by the Senate in late December that attempted to raise the per person payment from $600 to $2,000. Because $600 checks were already being distributed by the time Biden and the others entered office, the addition of $1,400 would fulfill the campaign promise of $2,000 per person COVID-19 stimulus payments.", "In late December and early January 2021, increasing COVID-19 stimulus payments from $600 to $2,000 per person became a major issue in the Georgia Senate run-off elections. The campaign pitch, made in some form by Jon Ossoff, Raphael Warnock, and Joe Biden leading up to that Jan. 5, 2021 election, was that a blue (Democrat-controlled) U.S. Senate would ensure passage of those $2,000 checks.", "On Jan. 20, Biden unveiled his $1.9 trillion COVID stimulus plan. It proposed issuing $1,400 checks to each person. Some have interpreted the $1,400 as a broken promise, despite the fact that the goal, since December, had always been to achieve a total per person payment of $2,000. The $600 checks already approved by Congress began disbursement starting on Dec. 29, 2020. Here, Snopes takes a granular look at the issue.", "On Dec. 22, 2020, President Donald Trump shocked congressional leaders on both sides of the aisle by threatening to block passage of a third COVID-19 stimulus package that had been negotiated for months and that his administration played a crucial role in shaping. The problem, Trump stated in a video Tweeted out that night, was that the $600 per person cap was not enough. \"I am asking Congress to amend this bill and increase the ridiculously low $600 to $2,000 or $4,000 for a couple,\" he said.", "In a confusing moment of limited bipartisanship, Democratic members of Congress agreed with Trump and launched a last-minute campaign to amend the relief bill to include the $2,000 checks requested by Trump. Congressional Republicans, for the most part, opposed the increase. An attempt to raise the amount, pushed by Rep. Alexandria Ocasio-Cortez and others, to the level Trump had requested failed on Dec. 24. Ultimately, Trump signed the originally negotiated bill — which included the $600 per person cap — on Dec. 27.", "In response, on Dec. 28, Democrats in the House passed a stand-alone bill designed to make Trump's vision of $2,000 per person a reality. The text of the bill proposed, in part, to amend the portion of the recently passed relief package \"by striking '$600' each place it appears and inserting '$2,000', and by striking '$1,200' each place it appears and inserting '$4,000.' The move was described by The Associated Press at the time as \"all but dar[ing] Republicans to break with Trump.\"", "That \"dare\" came at a complicated political moment. The two run-off elections for Georgia would determine the balance of power in the Senate. Both Ossoff and Warnock capitalized on the moment, immediately pushing both their GOP rivals in Georgia to support the House bill upping the payment to $2,000.", "On Dec. 28, the same day that the House passed its proposed increase to COVID relief checks, Warnock tweeted that, \"Georgians could have gotten $2,000 relief checks. You're only getting $600 — because [opponent Kelly Loeffler] refused to fight for more.\" That same day, Ossoff tweeted that his opponent \"David Perdue didn’t even want the first round of stimulus checks.\" On election day, Ossoff's final pitch to voters included the statement, \"We will be able to pass $2,000 stimulus checks for the people next week.\"", "https://streamable.com/tehygd", "President-elect Biden had made the same general point a day earlier at a rally for Ossoff and Warnock.", "\"By electing Jon and the reverend, you can make an immediate difference in your own lives,\" Biden said on Jan. 4, \"because their election will put an end to the block in Washington of that $2,000 stimulus check. That money that will go out the door immediately.\"", "https://streamable.com/jckvga", "On Jan. 20, Biden revealed his COVID relief plan in an executive order calling for additional payments of $1,400 per person. This led some to interpret Biden, Warnock, and Ossoff's pre-election discussion as a disingenuous bait-and-switch, promising a certain amount of money for votes and then refusing to deliver on that promise.", "\"$2,000 means $2,000,\" Ocasio-Cortez told The Washington Post following the release of the plan, \"$2,000 does not mean $1,400.\" Other critics accused Biden and Ossoff of \"purchasing\" peoples' votes and then refusing to \"pay up.\"", "Those arguing that Biden et al. broke a political promise by proposing $1,400 checks on top of the already approved $600 ones misrepresent the political debate surrounding COVID-19 relief efforts. Until the \"broken promise\" talking point emerged, the two political \"camps\" were the $600 advocates (most congressional Republicans) and the $2,000 advocates (Trump and most congressional Democrats). At no point was there ever a \"$2,600 camp.\"", "Before the end of December, it appeared logistically possible to modify the amount of money mandated in the previous COVID-relief package through that House bill passed on Dec. 28. According to reporting in The New York Times, however, the Treasury Department \"started making direct deposit payments\" on Dec. 29, and started mailing checks the next day.", "Ocasio-Cortez, who suggested Biden's plan did not fulfill the campaign promise of $2,000 checks, explicitly advocated the same solution on Dec. 23, proposing an amendment that would increase payments in the Trump package by $1,400 per person:", "Looking back at the statements made by Biden and others, references to \"$2,000 checks\" must be to these legislative efforts — including those advocated for and voted on by Ocasio-Cortez. Because the Senate cannot \"block\" legislation that has not yet been proposed, Biden's reference to \"the block in Washington of that $2,000 stimulus check\" clearly refers to the Senate's unwillingness to take up the House amendment upping the $600 checks to $2,000.", "The end result of the solution Ocasio-Cortez, Biden, Ossoff and Warnock proposed or advocated for in late December would have been a total of $2,000 per person. The end result of the Biden package, if passed, would be a total of $2,000 per person. Indeed, the claim that any politician was arguing for a total of $2,600 per person in late December is completely untenable, and belied by Ocasio-Cortez's support for the $2,000 solutions advocated for by herself and other Democrats at that time.", "The central issue is this: As the debate about the inadequacy of $600 checks versus $2,000 checks was raging in Congress, the $600 plan had already become law. Money was already being dispersed. To achieve the total of $2,000 advocated for by Trump and Democrats in late December, an additional payment of $1,400 passed through new legislation would be required. Biden's plan, the specifics of which are currently being worked through in the House at the time of this reporting, would achieve that same end result.", "There is a plausible argument, however, that Biden and Ossoff over-promised regarding the rapidity with which a Biden administration and a blue Senate could bring about rapid disbursement of these funds. As the House has yet to approve the legislative package proposed by Biden, the money did not \"go out the door immediately,\" as Biden promised on Jan 4. Nor would that legislative package be passed, as Ossoff claimed it would, \"the next week\" after his election. The first $600 payments already approved have yet to reach many Americans.", "In late December 2020, Democrats united with Trump to push Congressional Republicans to increase COVID-19 stimulus payments from $600 to $2,000 per person. The universal call by those on the Left, at the time, was for a total of $2,000 per person. Ultimately, the $600 plan passed while the viability of $2,000 payments was still gaining traction. References to \"$2,000 checks\" made in January by Biden and by Georgia's Democratic Senate candidates were to increase existing payments up to $2,000 — not to issue a new check for $2,000 in addition to the amount already approved.", "Because Biden and Ossoff's statements are consistent with the package Democrats ultimately proposed, but because their timeline for getting those payments out the door was too optimistic, we rank the claim that Biden's proposed $1,400 checks are a broken promise as \"Mostly False.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]