["The front of the campaign brochure has a mug shot of a grimacing, heavyset man in a undershirt. He’s holding a prisoner identification tag that says, \"There are 1,268 convicted sex offenders in the Richmond area.\"", "Under the photo, Mark Obenshain, the Republican nominee for attorney general, asks, \"Which candidate for attorney general will protect your family?\"", "Open the glossy brochure and you get this answer: \"Mark Herring voted to allow sex offenders, including rapists, to serve shorter sentences.\"", "Obenshain made the same charge against Herring, the Democratic nominee for attorney general, in a TV ad that began airing Oct. 7.", "So we checked whether Herring really did vote to ease prison sentences for sex offenders.", "Paul Logan, a spokesman for Obenshain’s campaign, said the claim centers on a bill that came up in the General Assembly earlier this year. Both Obenshain and Herring are state senators.", "The bill concerned about 155 crimes that, under Virginia law, must be punished with mandatory minimum sentences in prison. As introduced by Del. Robert Bell, R-Albemarle, the measure would have required that each count of a mandatory-sentence conviction be fully served in prison -- as opposed to allowing an inmate to serve several terms concurrently.", "Lets say, for example, a person is convicted on three counts that each carry a mandatory-minimum sentence of 10 years. Bell’s legislation would have required the criminal to serve at least 30 years.", "The bill grew out of a criminal case concerning Charles Lordell Jefferson Jr., who in 2011 was convicted in Fauquier County on six counts of production of child pornography, each carrying a mandatory minimum of of five years. Circuit Court Judge Jeffrey W. Parker imposed a six-year sentence for each count, but allowed allowed the prison terms to be served concurrently. So Jefferson faced only six years behind bars for child pornography crimes.", "Attorney General Ken Cuccinelli contested the result, arguing it was the legislature’s intent in passing mandatory minimum sentence laws that prison time would be tacked on for each count.", "The Court of Appeals of Virginia rejected Cuccinelli’s argument. A three-judge panel noted that state laws specified consecutive prison terms for some mandatory-minimum crimes but not for others, including production of child pornography. The panel said that it must assume the General Assembly had a reason for setting the condition for some mandatory-minimum offenses and not for others.", "Bell introduced his bill to end the controversy, but the Senate stripped out the blanket provision that sentences for all mandatory-minimum counts be served sequentially. Instead, the Senate simply added a specification to child pornography laws that perpetrators would serve consecutive sentences for each violation. The House agreed to the change.", "But Gov. Bob McDonnell was unhappy with the amended bill. He sent it back to the General Assembly with a recommendation that consecutive-sentencing stipulations be added to laws of the nine mandatory-minimum crimes that were not covered, including rape and production of child pornography. Also on that list were various offenses involving gang activity, violating protective orders, shooting or throwing missiles at vehicles, transferring firearms, forcible sodomy and object penetration.", "McDonnell’s version of the bill flew through the House on a 95-3 vote, but narrowly passed the Senate on a 23-17 vote. Obenshain voted for the bill and Herring voted against it.", "\"Sen. Herring did not support the Governor's recommendation because it deprived judges of too much of their existing discretion and made the justice system less flexible,\" Kevin O’Holleran, a Herring spokesman, said in an email. \"Sen. Herring has supported mandatory minimums and strong penalties for crimes against children in the past (including life sentences) and this bill did not affect the length of any sentence for any crime.\"", "A study by the Virginia Criminal Sentencing Commission suggests the new law will cause little change in the actual time offenders spend in prison. The research examined 130,531 criminal sentences imposed in the state between mid 2005 and mid 2010.", "Of those crimes, only 18,659, or 14.3 percent, involved mandatory-minimum offenses.", "Only 3,225, or 2.5 percent, involved convictions on multiple counts of mandatory-minimum offenses. And of those 3,225 cases, the report says judges imposed sentences below consecutive-term standards only 3.1 percent of the time. That breaks down to about 100 cases over five years, or 20 cases annually.", "Now, keep in mind that those 20 annual cases in which judges used sentencing discretion could have involved nine different offenses -- not all of them sex crimes.", "Meredith Farrar-Owens, director of the sentencing commission, said her agency lacks data to break down by each offense the  instances when judges used discretion in passing out sentences on multiple count, mandatory-minimum convictions. \"It’s a small percentage of a small percentage of cases where judges elected not to give consecutive sentences,\" she said.", "Our ruling", "Obenshain said Herring voted to allow sex offenders to \"serve shorter sentences.\"", "Herring voted against a bill that ended the sentencing discretion judges had in rare cases when some sex offenders and a few other types of criminals were convicted on multiple counts. Because judges occasionally invoked their option to allow inmates to serve multiple prison terms concurrently, there’s a slight basis for the claim that Herring’s vote would allow some offenders to serve shorter terms than they would have if the judges had no choice.", "But for the most part, Obenshain’s claim is misleading. Herring’s vote would not have shortened the prison time faced by sex offenders, it merely would have continued the the sentencing procedures in place.", "And Obenshain, in his broad reference to sex offenders, omits the fact that only a tiny percentage of them had circumstances in their cases that allowed for discretion in sentencing.", "We rate Obenshain’s claim Mostly False.", "Mark Obenshain, \"Protecting\" ad, Oct. 7, 2013.", "Email from Paul Logan, Obenshain spokesman, Oct. 8, 2013.", "Email from Kevin O’Holleran, Herring spokesman, Oct. 9, 2013.", "Legislative Information System, 2013 H.B. 2269, accessed Oct. 9, 2013.", "LIS, HB 2269 Fiscal Impact Statement, accessed Oct. 14, 2013.", "Interview with Del. Rob Bell, Oct. 14, 2013.", "Court of Appeals of Virginia, Commonwealth of Virginia v. Charles Lordell Jefferson Jr., Oct. 16, 2012.", "Richmond Times-Dispatch, Virginia Politics Blog, \"Obenshain targets Herring in new television ad,\" Oct. 7, 2013.", "LIS, \"2012 SB 436,\" accessed Oct. 14, 2013.", "LIS, \"2007 SB 1071,\" accessed Oct. 14, 2013.", "Fauquier.com, \"Child molester gets 35 years in prison,\" Nov. 19, 2011.", "Interview with Meredith Farrar-Owens, director of the Virginia Criminal Sentencing Commission, Oct. 18, 2013.", "Virginia Criminal Sentencing Commission, \"2010 Annual Report,\" pages 67-70, assessed Oct. 18, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]