["A purported newspaper clipping from 2001 that has the headline ‘Indian Politician Arrested’ is circulating widely on social media.", "As per the clipping, an Indian politician was arrested at the Boston airport for possession of drugs. The politician was the son of a former Prime Minister, claimed the report dated September 30, 2001. It is implied that the politician arrested was Congress leader Rahul Gandhi.", "Sharing this clipping, Twitter user Sanjay Fadnavis wrote on February 28, 2023 “Who is he?”.", "Twitter user Dhruven Patel wrote an entire post narrating how Rahul Gandhi was released after the intervention of former Prime Minister Atal Bihari Vajpayee. This newspaper clipping is circulating widely on Twitter.", "Viral since 2019", "In 2019, RBI director S Gurumurthy tweeted this newspaper clipping. He wrote, “Pl read this news item. Who’s is this son of former Prime Minister?” Gurumurthy later deleted his tweet but its archived version can be accessed here.", "After a few users pointed out that the clipping was manufactured, Gurumurthy took it down and tweeted that it was “fair to delete” the clipping as a few users expressed doubts about the veracity of the report. However, he removed his clarification within an hour of posting it on Twitter.", "The alleged newspaper clipping tweeted by Gurumurthy was created on the website fodey.com which gives one an option to write a story, give it a headline, name the newspaper and change the date.", "The video below shows how a newspaper clipping can be generated on the website.", "Such manufactured newspaper clippings have been circulated on social media in the past as well. Rahul Gandhi, Amit Shah, Arvind Kejriwal, Sonia Gandhi, and Yogi Adithanath, among others, have been targeted similarly.", "It is important to note that the clipping also says that as per AFP, Gandhi was released after the intervention of the Indian Ambassador. Like Alt News, AFP, too, fact-checked this claim in the past and concluded the same.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]