["On the presidential campaign trail, Joe Biden pledged to act on federal student loan debt forgiveness and wipe out $10,000 for all borrowers. One student loan borrower claimed on Facebook that the president has already acted on that promise.", "\"My student loans are gone,\" reads a Feb. 2 Facebook post with hundreds of shares. \"I love you Biden!\" Many users expressed skepticism and commented, \"Mine still showing.\"", "USA TODAY was unable to reach the Facebook user for comment.", "Fact check: Comparison of refugee payments, Social Security is old hoax", "On his first day in office, Biden signed an executive order extending a payment pause on federal student loans through at least September. At the beginning of the pandemic, President Donald Trump suspended student loan payments, froze interest and told loan servicers to stop collection efforts as part of the COVID-19 relief effort. That was set to expire Jan. 31.", "Biden has avoided any promise of canceling student debt via executive action and said he supports Congress forgiving up to $10,000 in debt. Senate Majority Leader Chuck Schumer, D-N.Y., and Sen. Elizabeth Warren, D-Mass., want Biden to wipe out $50,000 per borrower, a plan they unveiled in September 2020.", "In an interview with The Washington Post in December, Biden said it was \"pretty questionable\" that he would have the power as president to cancel large amounts of student loan debt. “I’m unsure of that. I’d be unlikely to do that,\" he said.", "It is unresolved whether debt cancellation would be done through executive action by Biden or through legislation passed by Congress.", "White House press secretary Jen Psaki tweeted Feb. 4 that the Biden administration is \"reviewing whether there are any steps he can take through executive action and he would welcome the opportunity to sign a bill sent to him by Congress.”", "Biden wants to forgive loans for students attending two-year and four-year public colleges and extend loan forgiveness to students who attend private historically Black colleges and universities or minority-serving institutions, according to his campaign website. His plan includes forgiving all undergraduate tuition related to federal student debt for borrowers earning up to $125,000 a year.", "\"Biden will create a new, simple program which offers $10,000 of undergraduate or graduate student debt relief for every year of national or community service, up to five years,\" his campaign website reads. Those working in schools, government and other nonprofit settings would be automatically enrolled in the program.", "Fact check: False claim that President Joe Biden signed executive order legalizing incest", "Though federal student loan payments have been paused, there has been no action by Congress or Biden to cancel student loan debt.", "Biden's outline for a $1.9 trillion coronavirus relief package excluded student loan debt cancellation. The package would include $1,400 checks for Americans, investing $20 billion in a national vaccination program and $400 per week in unemployment insurance benefits.", "None of Biden's executive orders refers to student debt cancellation.", "Details of the coronavirus relief plan continue to be negotiated in Congress. In a news briefing Feb. 4, Psaki said the White House was reviewing whether it could provide debt relief through executive order while calling on Congress to pass legislation.", "\"The president has and continues to support canceling $10,000 of federal student loan debt per person as a result of the COVID crisis,\" Psaki said. \"If it is passed and sent to his desk, he will look forward to signing it.\"", "Fact check: Posts about Biden's executive orders, quote about dictators need context", "The claim that Joe Biden has canceled student loan debt is FALSE, based on our research. The president extended a pause on federal student loan payments but has not signed any executive orders canceling student debt. Congress has not passed any legislation that cancels student debt.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]