["About this rating", "Louis is believed to have enjoyed watching women give birth and was likely present in the room when his wife gave birth. However, it was the famed 17th-century French doctor François Mariceau who is generally credited with the practice of having women lie flat on their backs during birth.", "Louis did not require that women give birth lying flat on their back, nor did he inspire the practice.", "In late 2020, rumors once again circled the internet about the womanizing 17th-century ruler of France King Louis XIV who was thought to have had a fetish for watching women give birth. But standard practices at the time — which included kneeling, squatting, or sitting upright — obstructed the Sun King’s view, prompting him to supposedly require that all women give birth lying flat on their backs.", "As with most internet legends, kernels of truth are sprinkled within this claim, but it is largely false.", "The claim is based on a 1987 review published in the American Journal of Public Health. It went viral in March 2018 when British tabloid The Sun detailed the review’s finding in an article titled, \"This is the Creepy Reason Women Give Birth Lying Down — and it’s all Down to One Man and his Fetish.\"", "The story picked up steam again in October 2019 when historian and author Greg Jenner shared a tweet claiming that the findings were presented out of context by media outlets.", "While it is accurate to say that Louis took an interest in and preferred to view his wife's birthing in a supine position, it was physician François Mariceau who was considered to have greatly influenced the change in the birthing position. It appeared that media publications that covered the story at the time embellished the role Louis played in transition birthing protocol. To fully understand the claim, we’ll take a dive through history.", "In her 1987 paper, author Lauren Dundes described the historical roots of two birthing positions, the dorsal, which is when a woman lies flat on her back, and lihotomy, where a woman lies on her back with her legs in the stirrups. But before either became the norm, many cultures were known to require women giving birth to sit, kneel, or squat in an upright position — and sometimes even standing during labor and delivery. Notably, a relief in the Temple of Esneh in Egypt shows Cleopatra in a kneeling position surrounded by five women, one of whom delivers her child.", "Screenshot/American Journal of Public Health", "Scholars argue that the shift from upright to horizontal happened for a variety of reasons, from the “promotion of men’s power over women,” to the facilitation of forceps and anesthesia. By and large, most agree that the change was influenced by the French nearly 300 years ago.", "Until the mid-1500s, midwives were among the primary people in attendance during births. But around this same time, barber-physicians who, as their name suggests, served as both barbers and physicians, began to compete with midwives in caring for pregnant women. Trained with little obstetric experience, these early barber-physicians often threatened the lives of their patients.", "Dubbed the father of modern surgery, Ambroise Paré was a famous French surgeon who practiced medicine around the same time as the barber-physicians and is known for his influence in obstetrics. Namely, a perspective shift occurred in the 16th-century, when pregnancy was treated as a sickness and not a normal part of a life cycle that required medical intervention. One of Paré’s students, Jacques Guillemeau, advocated for a reclining birth in 1598, arguing that it would best allow surgeons to perform childbirth. By the end of the 17th century, Parisian women most commonly delivered in a special reclined bed while women in England began to deliver birth while on their side.", "According to the author of the 1987 review, Guillemeau may have advocated for the reclining position, but it is Mariceau who is generally credited with influencing the change. In his 1668 book, “The Diseases of Women With Child and in Child-Bed,” Mariceau argued that the reclined position would be more comfortable and more convenient for the physician:", "[…] all women are not accustomed to be delivered in the same posture; some will be on their knees, as man in country villages; others standing upright, leaning with the elbows on a pillow upon a table, or on the side of a bed… but the best and surest is to deliver in their bed, to shun the inconvenience and trouble of being carried thither afterwards;", "The bed must be made so, that the woman is ready to be delivered, should lie on her back upon it, having her body in a convenient figure, that is, her head and breast a little raised so that she be neither lying nor sitting; for in this manner she breaths best, and will have more strength to help her pains than if she were otherwise, or sunk down in her bed… and have her feet stayed against some firm thing…", "Portrait of Louis when he was 63, painted by Hyacinthe Riguard in 1701. Creative Commons", "Serving as the king of France from the age of 4 in 1643 to 76 in 1715, some scholars argue that the womanizing king had a fetish for watching women give birth, which led to the prominence of the supine birthing position. While it may be true that he promoted the reclined position so that he could have an unobstructed view of the birth, it does not appear that Louis and his supposed “perverted caprice” can be fully credited with the transition.", "“The influence of the King’s policy is unknown, although the behavior of royalty must have affected the populace to some degree,” wrote Dundes. “Louis XIV’s purported demand for change did coincide with the changing of the position and may well have been a contributing influence.”", "In the U.S. in 2020, women are still giving birth while flat on their backs — a practice that research largely goes against. An article published in The Journal of Perinatal Education recommended women to “avoid giving birth on your back” and while the Mayo Clinic notes that there is no perfect position for labor, it recommends at least nine postures to help with a birth — none of which shows a woman flat on her back.", "But modern leading health experts say that, ultimately, the person giving birth should be given the choice of position.", "\"It is important that any particular position is not forced on the woman and that she is encouraged and supported to adopt any position that she finds most comfortable,” noted the World Health Organization in a 2018 update to recommendations on birth positions for women without epidural analgesia.", "“The health care professional should ensure that the well-being of the baby is adequately monitored in the woman’s chosen position. Should a change in position be necessary to ensure adequate fetal monitoring, the reason should be clearly communicated to the woman.\"", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]