["About this rating", "The White House was illuminated in rainbow colors in celebration of the Supreme Court ruling that legalized same-sex marriage.", "The White House was not illuminated purple the night singer Prince died, and the White House flags were lowered to half-staff to honor the victims of the Dallas police shooting.", "On 7 July 2016, an ambush shooting at a Dallas protest prompted by police shootings in Louisiana and Minnesota left five officers dead, seven wounded, and two civilians injured.  A few days later, the above-displayed image hit social media, insinuating that the White House had failed to appropriately honor the five Dallas police officers who were killed in that ambush but paid respect to lesser events.", "That image was substantially wrong in its details and its inference.", "A lighting system has been used to illuminate the White House in symbolically appropriate colors on a few occasions in recent years, such as when the edifice was bathed in pink in October 2013 in honor of Breast Cancer Awareness Month, and in rainbow colors in June 2015 as a nod to the landmark Supreme Court ruling that allowed same-sex couples nationwide the right to marry:", "However, although a number of monuments and landmarks in the United States and around the world were lit up purple in April 2016 to memorialize the sudden passing of musician Prince, the White House was not among them.  (The purple White House image shown above is just a color-tinted version of the rainbow-lit White House photograph.)", "The White House honored the memories of the five slain Dallas police officers in a more traditional and appropriate manner, with President Obama issuing a proclamation ordering the flag of the United States to be flown at half-staff at the White House, upon all public buildings and grounds, at all military posts and naval stations, and on all naval vessel:", "To honor victims of the attack in Dallas, @POTUS ordered the U.S. flag flown at half-staff: https://t.co/BIJFsuATPk pic.twitter.com/TiE62vk8pP", "— The White House (@WhiteHouse) July 8, 2016", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]