["About this rating", "As Democrats in the U.S. House of Representatives voted to pass a voting rights and anti-corruption bill, former Vice President Mike Pence expressed his opposition to the bill through an op-ed in The Daily Signal, a website run by the conservative think tank Heritage Foundation. In the March 3, 2021, article he echoed a number of misleading claims that have been used by conservatives to criticize the bill in the past.", "Since the mob violence of Jan. 6 at the U.S. Capitol, where rioters called for Pence’s hanging for not trying to overturn the results of the election, Pence had been relatively quiet. Now in this essay, titled “Election Integrity Is a National Imperative,” Pence proclaimed: \"After an election marked by significant voting irregularities and numerous instances of officials setting aside state election law, I share the concerns of millions of Americans about the integrity of the 2020 election.\" We should note that top government officials called the November 2020 elections the \"most secure in American history.\"", "Among many assertions that prompted swift criticism and fact-checking was Pence's claim that the bill would ensure \"millions of illegal immigrants are quickly registered to vote\":", "The bill would force states to adopt universal mail-in ballots, early voting, same-day voter registration, online voter registration, and automatic voter registration for any individual listed in state and federal government databases, such as the Department of Motor Vehicles and welfare offices, ensuring duplicate registrations and that millions of illegal immigrants are quickly registered to vote.", "This is not a new claim. It came up before in 2019 when the bill, titled H.R. 1 or the For the People Act, first worked its way through Congress. We previously covered variations of this claim (also false).", "The 2021 bill continuously asserts the requirement that people registering to vote must affirm their citizenship, and it does not change the law that prohibits non-citizens from voting. Contributing agencies in each state that are assisting the state election officials by registering all eligible individuals who are served by that agency are required to submit specific information about each individual, including, \"information showing that the individual is a citizen of the United States\" (see page 54 of the bill). Contributing agencies defined in the bill are wide-ranging and include the state's motor vehicle authority, the Social Security Administration, and even \"The Bureau of Citizenship and Immigration Services, but only with respect to individuals who have completed the naturalization process.\" The bill also says that agencies are required to inform only U.S. citizens that they are being registered to vote (see page 52).", "Federal law still says it is unlawful for non-citizens to vote in a federal election, and any violations of this law could result in a fine or imprisonment.", "The bill requires states to allow any eligible voters to vote by mail in federal elections, and to use Automatic Voter Registration (AVR) for federal elections nationwide. This is different from \"forcing\" states to adopt \"universal mail-in ballots,\" in that states are not expected to send out ballots that voters have not requested, but only that voters should have the option to submit their ballots through the mail. We fact-checked in 2020 how mail-in ballots have little to no risk of voter fraud. For the 2020 elections, many states already had universal mail-in ballots (while several expanded its use as a result of the coronavirus pandemic), and as of December 2020, 18 states and the District of Columbia had already enacted AVR. According to the Brennan Center for Justice, implementing AVR universally could help register up to 50 million new eligible voters, make registration rolls more accurate, save money, and cut down on confusion at the polls.", "There have been instances of errors in states with AVR, like California, where people were wrongly registered to vote, but those registrations were immediately canceled. Evidence shows that these non-citizen registrations were by accident and the numbers of non-citizens who ended up on the voter rolls were relatively small. These issues also took place in Pennsylvania, a state without AVR.", "In general, claims that \"illegal immigrants\" can vote in the U.S. elections in large discernable numbers are rarely, if ever, true. Nor is the claim that implementing the above measures would make it easier for such immigrants to vote, particularly when experts say such measures are intended to make registration easier and more accurate. As such, we rate Pence's claims on the whole as \"False.\"", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]