["The claim was published in this post on Facebook on June 13, 2020.", "The post states: “Home Ministry sources confirming Delhi NCR complete lockdown from 18th June for 4 week.s This time it’s going to be very strict. No one will be allowed out. President’s rule in Delhi...”", "Delhi NCR is a reference to India’s National Capital Region, which includes the capital city of New Delhi and several other districts from neighbouring states.", "The post circulated just days after Delhi and states across India re-opened after a 10-week lockdown due to the COVID-19 pandemic, as reported by AFP here.", "The same claim was also shared on Facebook here, here and here; and on Twitter here and here.", "However claim is false; as of June 19, 2020 India has not announced a new lockdown and several government officials issued statements denying the claim.", "The Indian government’s official Press Information Bureau (PIB) publised this tweet on June 14, 2020, calling the purported message “fake”.", "It reads, in part: “There is no such plan under consideration. Please beware of rumour mongers.”", "Claim: A message on Facebook claiming strict #Lockdown from 18th June. #PIBFactCheck: It's #Fake. There is no such plan under consideration. Please beware of rumour mongers. pic.twitter.com/NqSXOpy9n9", "Delhi Chief Minister Arvind Kejriwal also took to Twitter to deny plans of a new four-week lockdown.", "“There are no such plans,” he said in a tweet on June 15, 2020.", "Many people are speculating whether another lockdown in Delhi in being planned. There are no such plans.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]