["About this rating", "The internet is the ultimate archive, including when it comes to old movie websites. The original website for the 1996 basketball movie \"Space Jam\" is still up and running, a bit of information that gained more traction in March 2021 as promotional photos were released for the second movie in the franchise, “Space Jam: A New Legacy.”", "The original film featured basketball superstar Michael Jordan teaming up with Looney Tunes cartoon characters, including Bugs Bunny, to take on a team of aliens in a game of basketball. The latest iteration, “Space Jam: A New Legacy,” features Lebron James.", "Ten years ago, Reddit users posted a link to the original promotional website for the film, a link that is still live. The website redirects from the Warner Bros. Pictures site to spacejam.com.", "And the site is basically everything you might imagine a website created in the '90s would be:", "We clicked through the site and it appears to still have all of its old promotional content, including videos from behind the scenes, trivia and games, and the site even redirects back to Warner Bros. merchandise. The site does appear to be dormant, however, and Warner Bros. doesn't appear to have been active on it in recent years.", "According to a 2018 Rolling Stone article, the site's creators said that when they developed it, \"Nobody gave a shit\" at Warner Bros. The site changed a bit over the years, and at some point in 2003, it was briefly redirected to a scaled-down version that only sold DVDs of the film. At the time the site went viral again in 2010, Warner Bros. even shut it down for a few hours before internal requests to bring it back. The site persisted largely because some of the original developers behind it told executives to keep it alive.", "And if you enjoyed this website, wait till you see SpaceJam2.com.", "Since the April 2021 trailer release for \"Space Jam: A New Legacy,\" the website has been updated to show the trailer, and promote the new film. Everything that made the website, a 90s-era relic has gone.", "Given that the original \"Space Jam\" website was up and running until the recent change, and was redirected from an old Warner Bros. link, we rate this claim as “True.”", "April 6, 2021: The old url has been updated to promote the second \"Space Jam: A New Legacy\" film.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]