["About this rating", "In the wake of public criticism of the Trump administration's response to the devastation wrought by Hurricane Maria in Puerto Rico in late 2017 as \"inadequate\" (among other things), a post widely shared via social media endeavored to make the opposite case, namely that President Trump deployed a massive amount of government assets to address the disaster:", "President Trump has dispatched 140 helicopters, 28 ships, 6 Army field hospitals, 3 Navy Seabee Battalions, 5 US Army Combat Engineer Battalions, 3 Civil Affairs battalions, 2 Nuclear Submarines capable of generating 2.8 Gigawatts of Power, released 300,000 tons of food, medical supplies and water from Military stocks.", "We were unable to trace the figures to any official source, nor do we know who compiled them. We can say, however, based on actual facts and figures shared by FEMA and the Department of Defense (DoD), that the stated numbers range from inflated to downright fictional.", "140 Helicopters", "Mixture. Based on United States Department of Defense statements, dozens of helicopters have been deployed to Puerto Rico, though the actual number is far less than 140.", "On 27 September (the same day the meme began circulating), DoD announced an \"acceleration\" of Puerto Rico relief efforts including the deployment of the amphibious assault ship USS Wasp, whose complement of rotary-wing aircraft would bring the total number of helicopters in use there to 52.", "28 Ships", "Mixture. By our count, using figures released by the DoD and U.S. Coast Guard, the total number of U.S. Navy and Coast Guard ships deployed to Puerto Rico is 18 (though an unknown number of non-military ships are also in use).", "Counting the USNS Comfort, a 1,000 bed hospital ship scheduled to dock in the disaster zone on 4 October, the arrival of the USS Wasp will bring the total number of U.S. Navy ships deployed to five (including the USS Kearsage and USS Oak Hill, both conducting search and rescue flights, aerial damage assessments, logistics support and route clearance on and around the island, and the SS Wright, tasked with delivering 1.1 million meals and one million liters of water). According to the U.S. Coast Guard, 13 of its cutters have been performing search and rescue missions and delivering supplies. An unspecified number of commercial ships are also participating in the aid effort.", "6 Army Field Hospitals", "Mostly false. We've found no evidence, either in press reports or statements from DoD or FEMA, that Army field hospitals are in use in Puerto Rico, though that doesn't mean no medical help is being supplied.", "Emergency medical services are being provided not by Army field hospitals, but by U.S. Department of Health and Human Services (HHS) personnel assigned to support the efforts of doctors at fully or partially functional hospitals around Puerto Rico, as well as five \"federal medical stations\" set up near those facilities.", "3 Navy Seabee Battalions, 5 US Army Combat Engineer Battalions, 3 Civil Affairs battalions", "Mostly true. According to press reports there are Seabees and members of the Army Corps of Engineers now on the ground in Puerto Rico, but we've seen no announcements supporting the numbers specified above.", "Although DoD officials have not released a breakdown of the various military forces thus far deployed to Puerto Rico, Gov. Ricardo Rossello said there were roughly 7,200 U.S. military personnel on the ground as of 2 October, according to a DoD press release, in addition to an estimated 3,000 non-military federal employees, for a total of more than 10,000 government workers involved in relief efforts.", "2 Nuclear Submarines", "False. It is not the case that two nuclear submarines were sent to provide emergency electricity to Puerto Ricans.", "A reported 95 percent of the island's 3.4 million inhabitants were still without power as of 2 October, according to local officials. FEMA reported distributing and setting up more than 300 emergency generators since the disaster, but most of that effort was devoted to restoring power to hospitals and other critical facilities.", "Using nuclear submarines to supply emergency power in disaster areas has been proposed, but never tried. In 1982, the USS Indianapolis was deployed to Kauai, Hawaii in the aftermath of Hurricane Iwa, a solution both Navy and civilian officials said would have been technically feasible, though the plan was ultimately abandoned in favor of using a portable generator to \"jump start\" the island's main power plant. No such \"nuclear option\" has been proposed in the case of Puerto Rico.", "300,000 Tons of Food, Medical supplies and Water", "Mostly true. We have not found the above (or any) overall total tonnage stated in any official sources, but vast amounts of food and supplies have either arrived or are on their way to Puerto Rico. According to FEMA, more than two million meals and 2.5 million litres of water have reached the island and been distributed, plus medical equipment, generators, gasoline, and other supplies, with more coming.", "For more information, see FEMA's daily-updated overview of federal government efforts on behalf of the citizens of Puerto Rico.", "Davis, Aaron, Lamothe, Dan and O'Keefe, Ed.   \"U.S. Response in Puerto Rico Pales Next to Actions After Haiti Quake.\"\r\n   The Washington Post.   28 September 2017.", "Dickstein, Corey.   \"Pentagon Adding USS Wasp to Puerto Rico Response, USNS Comfort Departs for Island.\"\r\n   Stars and Stripes.   29 September 2017.", "Garamone, Jim.   \"Unified Coordination Group Addressing Puerto Rico Recovery, Governor Says.\"\r\n   U.S. Dept. of Defense.   2 October 2017.", "Hernandez, Arelis R., Lamothe, Dan, O'Keefe, Ed and Achenbach, Joel.   \"Trump Administration Rushes Military Assets to Puerto Rico Amid Growing Crisis.\"\r\n   The Washington Post.   27 September 2017.", "Starr, Barbara, Cohen, Zachary and Browne, Ryan.   \"U.S. Military Sends Ships, Aircraft to Puerto Rico.\"\r\n   CNN.   26 September 2017.", "Werner, Ben.   \"Pentagon: Hospital Ship USNS Comfort Prepares to Depart for Puerto Rico.\"\r\n   USNI News.   26 September 2017.", "FEMA.   \"Overview of Federal Efforts to Prepare for and Respond to Hurricane Maria.\"\r\n   2 October 2017.", "Reuters.   \"Factbox: Relief Efforts in Puerto Rico After Hurricane Maria.\"\r\n   29 September 2017.", "UPI.   \"Navy Seeks to Return Power to Stricken Hawaii Island.\"\r\n   29 November 1982.", "U.S. Dept. of Health and Human Services.   \"HHS Augments Medical Care at Hospitals in Puerto Rico Impacted by Hurricane Maria.\"\r\n   30 September 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]