["BJP MP RK Sinha tweeted a video of Rahul Gandhi’s speech on India TV with the text, “राहुल ने ढूँढ़ लिया साल में ५२ बच्चे देने वाली महिलाओं को! अब चुनाव हारकर ऐसी ही महिला से शादी कर हर साल ५२ बच्चे पैदा करेंगे श्रीमान जी! (Rahul has found the women who give birth to 52 children every year. After he loses the election, he’ll marry one of these women and make 52 children every year -translation)“.", "In the video, Rahul Gandhi can be heard saying, “UP mein aisi mahilae hai ho har saptah ek bachcha paida kar sakti hai, aisi mahilae hai jo saal mein 52 bachhe de rahi hai (UP has such women who are giving birth to a child every week, there are such women who are giving birth to 52 children per year)”", "This video is viral on all platforms including Facebook, Twitter and WhatsApp.", "Renuka Jain, who is followed by PM Modi on Twitter, and has shared misinformation many times in the past also posted the video.", "💥💥💥💥💥 Mega Breaking News : UP में ऐसी महिलाएं है जो हर सप्ताह एक बच्चा पैदा कर सकती है और साल में 52 बच्चे पैदा कर रही है – राहुल गांधी pic.twitter.com/ylJTyIEzDs", "— #RenukaJain Chowkidar 🇮🇳 (@RenukaJain6) April 24, 2019", "OneIndia reported that BJP Candidate from Khandwa in Madhya Pradesh, Nandkumar Singh Chouhan, also made a similar claim.", "In one of the frames in the above video, Rahul Gandhi talks about the issue of corruption in Uttar Pradesh. Searching for the keywords ‘rahul gandhi up corruption’ on India TV’s YouTube channel, we came across a 7 year old video of Rahul Gandhi’s speech in Phoolpur, Uttar Pradesh on November 14, 2011.", "At 5:25 in the video below, Rahul Gandhi talks about Janani Surakha Yojna under National Rural Health Mission, where pregnant women get an incentive of Rs 1400 for institutional delivery. In that context, he claims that according to a RTI response, there is corruption in this scheme and that women with the same name were getting the incentive every week.", "His exact words were, “Humne RTI manga, RTI mein jo hamein report mili, UP mein aisi mahilae hai, jo har saptah ek bacha paida kar sakti hai, aisi mahilae hai jo saal mein 52 bachha de rahi hai, ek hi naam hai, 1400 rupay har saptah uske jeb mein, aur ek hi ek mahila nahin hai, hazaro mahilae hai (We filed an RTI, according to the RTI response, UP has such women who are giving birth to a child every week, there are such women who are giving birth to 52 children per year, all have one name, 1400 rupees in their pocket every week, and there are thousands of such women. -translation)”", "The relevant portion of the video can be seen below.", "From his speech, the part where he says, “UP mein aisi mahilae hai ho har saptah ek bachcha paida kar sakti hai, aisi mahilae hai jo saal mein 52 bachhe de rahi hai (UP has such women who are giving birth to a child every week, there are such women who are giving birth to 52 children per year)“, was clipped and circulated thus leading to a false impression.", "This claim was earlier debunked by Dainik Bhaskar. Even though the pattern of clipping videos and circulating them on social media sans context is very common, two senior BJP functionaries fell for the same video. Rahul Gandhi’s ‘Aloo-Sona Machine’ video and more recently, Narendra Modi’s ‘I am son of Pathan‘ video are examples of this category of misinformation.", "Donate Now", "Co-Founder Alt News, I can be reached via E-mail at [email protected] and on Facebook at https://fb.com/freethinker.", "Follow @free_thinker", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]