["About this rating", "Editor's note: This article covers historical material involving the use of offensive racial epithets.", "The history of the United States is both scarred and partly defined by racial subjugation and violence, a legacy with an almost endless litany of horrific incidents and phenomena.  In February 2018, many thousands of Americans were confronted -- some for the first time -- with images of a once-popular fairground game with the extremely offensive name shown below:", "<!--", "-->", "This image is authentic and shows a 1942 YMCA brochure for Camp Minikani, a children's summer camp in Wisconsin. \"Hit the Nigger Baby\" (also known as \"The Black Dodger\" or \"Hit the Coon\") was a common fairground game in which players hurled objects (usually eggs or baseballs) at African-American people serving as human targets. According to the Jim Crow Museum at Ferris State University, \"It sounds like a common carnival target game, but there was one unsettling part of the game, namely, the game's target was a real live human being, a 'negro' human being.\"", "In our research of newspaper archives, we found evidence of the game's being staged as early as the 1880s, and as recently as the 1950s. In several instances, the stand received top billing in newspaper bulletins promoting upcoming carnivals and fairs, along with the shooting gallery and fish pond. In July 1948, a \"soldiers reunion and homecoming\" held in the public square in Brownstown, Indiana, was advertised in the Jackson County Banner with the exhortation \"Make this big week your vacation time -- Bring the family -- meet old friends -- Hit the 'Nigger Babies' -- Eat Hot Dogs -- Join the Fun.\"", "In November 1935, the Iowa newspaper Lake Park News recounted a recent successful high school carnival which featured a musical show and a \"thrilling athletic event,\" touting that \"After this show, the crowd enjoyed themselves in visiting the various booths or trying to ring a duck's neck in a tank of water or hit the nigger baby.\"", "One vignette from the St. Petersburg Times gives a particularly disturbing sense of the popularity of the game, describing how some residents of St. Petersburg, Florida, celebrated Labor Day in 1925:", "\"Who can hit the nigger? Buy three chances to hit the nigger.\" With all the vigor of a professional ballyhoo man, the laborer drew the crowd to the side attraction at the Labor Day celebration at Waterfront park Monday afternoon. A grinning negro boy, his head stuck through the opening of a sheet, awaited the battery of eggs thrown at him by the majority of St. Petersburg's star pitchers. From the width of his grin, he enjoyed it almost as much as the crowd -- one time where the goat wasn't a goat, for only a few of the eggs found their mark.", "\"Take it easy, go slow, take your time. One, two gone, three -- try again?\" Thus the man in charge, as contestant after contestant tried his luck -- \"his,\" as the women only looked on and laughed at the men's attempts. One boy was determined, and amid the jeers of the crowd, took three tries, missing them all until his last. The crowd grew larger and larger until the ball game started, when it rapidly dwindled, the Tampa-St.Petersburg game being more of an attraction than even \"hit the nigger baby.\"", "As could be expected, injuries resulting from this \"game\" were common, especially when baseballs were used instead of eggs. In 1887, the New York Sun recounted a bad day at the Westchester County Fair by noting that \"Everything seemed to go wrong. The African Dodger was disabled. A very hard ball had explored a very soft region of his cranium and he was laid up for repairs.\" The Sun also reported, with no apparent concern for the injured man, that \"another negro was procured to do the African Dodger's act.\"", "Based on newspaper reports, it appears that some African-American men may have been killed during the course of these games. In 1908, for example, an \"African Dodger\" named William White was the target of carnival-goers in Hanover, Pennsylvania, where a squad of baseball players took turns throwing hard balls at his head. White, according to the Philadelphia Record, was \"subjected to a fusilade of balls\" but \"took the punishment courageously.\" Almost as an afterthought, the Record observed later in the piece that \"He was compelled to retire soon afterward with internal injuries which may prove fatal.\"", "Notwithstanding the horrific brutality of the game, we did not find any evidence of actual infants being used as targets, despite what the name of the game suggests.", "We asked Franklin Hughes, a digital media specialist who works with the Jim Crow Museum, about whether toddlers were subjected to being human targets, and he told us that \"In many cases, the 'dodger' would holler things out to the carnival attendees trying to bait them into playing; I can’t really see how a toddler could do this on the same level ... However, I would not put it out of the question.\"", "While we did find some references to \"boys\" playing the role of \"African dodger,\" Hughes pointed out that \"In Jim Crow times, many black men were called 'boys,' so it would be hard to determine the age of most of the 'dodgers.'\"", "Similarly, not every game billed as such involved real human beings. At times, wooden \"heads\" or effigies stood in for real African-Americans. It's unclear whether the Camp Minikani version of the game shown in the viral Facebook post above used inanimate objects or people as targets.", "Hughes told us that choosing an artificial target over a human one was not necessarily a sign that a particular carnival operator was especially progressive-minded. \"Sometimes it was easier just to have a wooden target,\" he said.", "And as Hughes documented in his 2012 article, some carnival owners came up with a less physically dangerous (but no less racist and demeaning) alternative to the African Dodger: the \"African Dip,\" which appears to have made its debut during the summer of 1910 and involved black men being dunked in water every time a target was hit.", "The New Jersey paper Trenton True American described this form of carnival attraction in 1911 as follows:", "It used to be just five cents a throw at the colored gentleman's head, and every time you hit it a cigar was your reward. But it is changed now, along with the progressive era. Here's the way it's played, according to the printed rules:", "\"The lip\" is so arranged that every time a baseball hits the target a colored man, seated upon a bar, is thrown into a large pool of water.", "It's said to be lots of fun for the man who pays the nickel but it didn't prove enjoyable for the fellow who fell into the pool. Yesterday he was put out of commission. According to the management of the carnival [in Flemington, New Jersey], the cool weather and repeated baths gave him the swimmer's cramps.", "The popularity of the game meant that it had significant cultural impact, appearing in movies, newspaper \"funny pages,\" and in cartoons, including Popeye. At times in the early 20th Century, the idiom \"playing African Dodger\" was used as shorthand for \"avoiding uncomfortable questions,\" especially in the context of political debate and journalism.", "This video collage, produced by Hughes for the Jim Crow Museum, provides good insight into the disturbing popularity and prevalence of this terrible tradition:", "Hughes, Franklin.   \"The African Dodger.\"\r\n    Jim Crow Museum/Ferris State University.   October 2012.", "The Lake Park News.   \"Harris School Notes.\"\r\n    14 November 1935.", "St. Petersburg Times.   \"Negro's Head Is Target of Ball Tossers.\"\r\n    8 September 1925.", "The [New York] Sun.   \"Fun at Two County Fairs.\"\r\n    30 September 1887.", "The Philadelphia Record.   \"'Coon Hitting' Peril.\"\r\n    22 September 1908.", "Trenton True American.  \"It's Called the 'African Dip' and It's a New One Out at Flemington.\"\r\n    Trenton True American.   28 July 1911.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]