["Recently, two images have been going viral on Twitter and Facebook. The photos feature a structure with scaffolding around it, purportedly showing the construction of a temple. The accompanying Hindi caption reads, “This is the first picture from the construction of the Ram Temple at Ayodhya. Shout Jai Shri Ram if this filled you with joy.” The tweet, posted by Sadhvi Priya Mishra, was liked more than 1000 times and had received over 240 retweets at the time of writing. (archive link)", "(Translated from: अयोध्या प्रभु श्री राम जी की मंदिर निर्माण का पहला तस्वीर है। जिन को देखकर ख़ुशी हुई, तो एक बार सच्चे दिल से “जय श्री राम” बोल दे।)", "अयोध्या प्रभु श्री राम जी की मंदिर निर्माण का पहला तस्वीर है। जिन को देखकर ख़ुशी हुई, तो एक बार सच्चे दिल से “जय श्री राम” बोल दे। pic.twitter.com/1o3Mi7lmaY", "— Sadhvi priya Mishra (@PriyaSadhvi) November 1, 2020", "A verified Facebook page called ‘Gomata Gau Seva Trust’ also shared one of the images with the same caption, drawing over 6,000 likes. (archive link)", "अयोध्या प्रभु श्री राम जी की मंदिर निर्माण का पहला तस्वीर है। जिन भाईयों को देखकर ख़ुशी हुई, तो एक बार सच्चे दिल से आप #जय_श्री_राम बोल दे।।।", "Posted by Gomata Gau Seva Trust on Saturday, 31 October 2020", "It was also posted to the Facebook group ‘करणी सेना के साथ है तो इस ग्रुप को अभी join करे (Join Now if You Support the Karni Sena) where it received 200 shares (archive link). The photo made its way to a group called ‘अगले मुख्यमंत्री हनुमान जी बेनीवाल RLP’ (Next Chief Minister Hanuman Ji Beniwal RLP) (archive link).", "This slideshow requires JavaScript.", "Alt News also received a request to fact-check the image on our Whatsapp number (+91 76000 11160).", "We performed a reverse image search and found a Hindustan Times report from October 30. It states that the construction shown here is taking place at Varanasi’s Kashi Vishwanath Corridor. The Prime Minister laid the foundation for the project on March 8, 2019. This expansion and beautification effort is slated to be completed by August 2021. The report mentions that a total of 24 buildings are to be built near the Kashi Vishwanath Ghat, out of which nine have been constructed. Dainik Jagran had also covered this in an October 27 story.", "This slideshow requires JavaScript.", "Therefore, online claims linking these viral images to Ayodhya’s Ram Temple are false. However, this is not the first time that fake news about the temple’s construction has been shared. For example, a clip of a Mumbai band performing at a folk music festival in Spain was falsely shared as a video of the India diaspora in the country celebrating the construction of Ram Mandir. In September, a picture of a temple in Hyderabad went viral as scenes from the Ram Mandir Bhoomi Pujan.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]