["“Buffet at Charles de Gaulle airport - PARIS FRANCE”, reads the caption on the Facebook post, which was published on December 13, 2020. The viral video shows rodents nibbling on food in a takeout window. The claim also appeared here on Facebook and on Reddit here.", "The same claim was also made in French back in June 2020; AFP Fact Check debunked it in French here.", "Overheard in the video are a man and woman speaking Portugese: “Look, look at the little rat eating pizza.” “This isn’t a joke.” “Look at the little rat.” “Where is the other one?” (The woman laughs.) “He is eating pizza.” “Incredible. In-cred-i-ble.”", "The video has thousands of comments in multiple languages -- some mocking, referring to Remi, the rat from Ratatouille, and some indignant: “That's why Paris had higher COVID Cases..No precautions or hygiene measures.. (sic)”.", "One commenter on the earlier French post noted that there’s a moment in the video where you can see a car reflected in the window.", "On Twitter, Paris Aéroport, the official account for the main Paris-region airports, denied that the video was taken at Charles de Gaulle.", "@Sifaoui @dgccrf Bjr, cette vidéo n'a pas été prise à l'aéroport où aucun point de vente ne ressemble à celui-ci. De plus, la majorité des enseignes de restauration sont actuellement fermées dans nos terminaux. Celles qui sont ouvertes ne proposent pas ce type de prestation. 1/2", "“Hello. This video was not taken at the airport. None of the stores look like this. Furthermore, most food courts in our terminals are currently closed. Those that are open do not offer this type of service”, reads the tweet from June 19, 2020, translated into English.", "By conducting a reverse image search with InVid-WeVerify, AFP Fact Check was able to find dozens of earlier posts featuring  the same video, including several in Brazilian Portugese. One of posts is from Brazilian artist Zézé Motta’s Facebook account, which was shared more than 419,000 times (with 22 million views, according to the Facebook view counter).", "Motta’s caption simply reads, \"shocked\". The singer does not mention Charles de Gaulle airport or France. In the comments, one Facebook user notes that the scene was filmed in France, not Brazil, and that the person who filmed it posted a second video contextualizing the scene.", "By digging through the comments of the French post, AFP Fact Check found a link to a video of a man claiming to be the author of the viral video. Speaking directly to the camera, the man says he has returned to the scene of his first video. In this second video, it is quickly apparent that the man is in the street, not an airport. He films the exact same shop window as in the first viral video.", "The man attempts to refute the rumors that the video was taken in Brazil. His speech, translated, says: \"Hello everyone. Today is January 30, 2020. My name is Claudio. I want to show you this because people are saying nonsense. They’re not right. I took the video of the little rat on the pizza. I'm in Paris today; the video was made the day before yesterday at this place. It was here. (...). But I'd like to make one thing clear: the video has nothing to do with the bakery they're talking about in Penha. Please don't spread that. It's wrong; it's not right, and it can harm the establishment and cost people jobs. This happened in Paris, France, and it has nothing to do with the ‘O requinte’ bakery in Penha. Okay? Thank you!\"", "The man passes in front of several signs that allow us to pinpoint that he was filming from the touristic part of Paris’s 6th arrondissement.", "When the claim first started circulating in French in June 2020, AFP Fact Check went to the site and spoke with employees from the restaurant in question, who confirmed that the video was filmed there.", "\"This story has done us a lot of harm. It's already very complicated at the moment (due to the effects of the pandemic, editor's note)”, the manager told AFP. The manager added that she brings in a pest-control team every two months to keep critters from infiltrating the premises again.", "\"There are a lot of construction projects in this neighborhood, and they have unearthed many things. We also realized that there was a small hole on one side of the store, which we blocked immediately. We took advantage of the lockdown to do this, and to apply anti-pest products. We also called in a specialised company to prevent this from happening again. And we haven't had any problems since,\" she said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]