["About this rating", "In June 2015, a photograph purportedly showing the \"world's darkest baby\" began circulating on the internet.", "Social Trends PH, one of the first web sites to post the image, didn't provide any information about the photograph other than claiming that it was taken in South Africa:", "An alleged darkest baby in the world that was recently born in South Africa is making buzz in social media. Many netizens however are asking if this photo is real or fake.", "By quick research, the photo has no origin or nobody claims it. There is also no report from the mainstream media about this news. Guinness World Records doesn't have this information also from their online database. Here is the photo.", "The earliest online appearance of this picture we could uncover dated from on 10 June 2015, when it was posted by Twitter user @NaimHumphrey, in a tweet that was also void of information other than the oft repeated \"South Africa\" claim.", "So where did this photograph come from? Was the world's \"darkest baby\" really born in South Africa?", "While we were not able to uncover the specific origins of the photograph, we were able to determine that the figure shown in the image is not a baby at all, but a doll:", "The doll was created by \"Breath of Heaven\" artist Lilah Pearsons:", "I began sculpting in 2005 drawing my inspiration from my love of animals.  In 2006 I began selling my art online and have enjoyed a fulfilling career making dolls ever since.  Each and every doll that I make starts from a lump of polymer clay and forms into something that comes from where, I don't really know.  Every time I sit down to sculpt is a new experience and I get lost in what I am creating.  At times frustrating, and always a learning and growing experience.", "I love Monkeys!!!! They are some of the most enjoyable little faces to sculpt. All my primates are partial sculptures with soft bodies for lots of pose-ability options.  They are made with quality doe suede bodies filled with tiny pellets.  All their clothing is handmade by me.", "Pearson's website and her eBay store show several examples of similar small dolls.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]