["President Joe Biden struck a contrast with his predecessor, former President Donald Trump, when he spoke at last week’s virtual Munich Security Conference about the importance of global alliances", "But a claim circulating on social media suggests that Biden had a stronger rebuke for the country he represents, calling it “an embarrassment.”", "The claim shared on Facebook uses a photo of Biden in front of a Munich Security Conference backdrop, with the text “Joe Biden tells Europeans in Munich that America is ‘an embarrassment.’”", "While Biden has used the word “embarrassment” about U.S. border policy and the separation of migrant children from their parents during a past address at the conference, he didn’t during remarks he delivered virtually on Feb. 19.", "A user who shared the post did not respond to request seeking comment.", "More:Fact check: Posts falsely claim Biden gave China control of U.S. power grid", "During the 2021 Munich Security Conference, Biden said that Democracy was “under assault” and reiterated that the U.S. supported NATO while calling out Russia and China.", "A search of his official remarks, though, shows he did not use the word “embarrassment” or “embarrassing” during the 2021 conference.", "But Biden did make news at the conference in February 2019, months before announcing his run for president, when he spoke about U.S. border policy.", "The image used in the Facebook post came from that 2019 speech.", "“The America I see values basic human decency, not snatching children from their parents or turning our back on refugees at our border. Americans know that’s not right. The American people understand plainly that it makes us an embarrassment. The American people know overwhelmingly that’s not right, that’s not who we are,” Biden said at the time.", "More:Biden seeks to 'reinvigorate' US-Canada relations in first bilateral meeting with Trudeau", "The comment came in a portion of Biden’s 20-minute speech, in which he said he wanted to give insight into his country “as a citizen” because he did not hold elected office at the time. He said there was a perception that the U.S. was “pulling away from the world and our leadership responsibilities.”", "While Biden said then that there was “anxiety about what the future holds” among the American people, he said, “I can assure you that the American people, the ultimate wellspring of power in the United States of America, remain committed to engaging the world with decency and respect. That is the prevailing view of the American people.”", "The claim that Biden said America is \"an embarrassment\" while in Munich is MISSING CONTEXT. While Biden did use the word “embarrassment,” it was during a 2019 speech at the Munich Security Conference, not when he delivered remarks last week as president during the 2021 virtual conference. Biden also was speaking specifically about U.S. border policies at the time and the separation of migrant children from their parents.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook"]