["About this rating", "An image purportedly showing an anti-fascist (antifa) protestor hitting a police officer was circulated on social media shortly after a white nationalist rally in Charlottesville, Virginia, left one woman dead and dozens injured on 12 August 2017. The photograph was frequently accompanied by the claim that both sides (white nationalists and counter-protesters) had contributed to the violence, and that while Republicans had denounced racists, Democrats had not denounced antifa protestors:", "The real image was taken in Athens, Greece in December 2009 during a demonstration on the one-year anniversary of the death of Alexandros Grigoropoulos, a 15-year-old who was killed by a police officer. Photographer Milos Bicanski took the photograph, which is available on Getty Images with the following caption:\nGreek youths clash with riot police during a demonstration commemorating the fatal shooting of 15-year-old Alexandros Grigoropoulos' by police a year ago, on December 6, 2009 in central Athens, Greece. Two police officers will go on trial in the new year for the murder of Grigoropoulos.\nThe protester's jacket in the original image was blank. The antifa logo was digitally added to this image, which was then reshared as if it depicted a recent incident in an attempt to show that \"both sides\" contributed to the violence in Charlottesville:\n\nSeveral politicians denounced both violence and white supremacy -- which culminated in Charlottesville with a white supremacist driving his car into a crowd of counter-protestors, killing 32-year-old Heather Heyer and injuring dozens more. However, more controversially, President Trump initially refused to condemn racism and instead blamed \"many sides\" for the violence:\nSome Republican lawmakers also chastised Trump’s response in implicit and explicit terms. “Mr. President—we must call evil by its name,” Colorado Senator Cory Gardner wrote on Twitter. “These were white supremacists and this was domestic terrorism.” Florida Representative Ileana Ros-Lehtinen said “there are no other ‘sides’ to hatred and bigotry.” Florida Senator Marco Rubio also noted it would be “very important for the nation to hear [President Trump] describe events in #Charlottesville for what they are, a terror attack by [white supremacists].”", "The real image was taken in Athens, Greece in December 2009 during a demonstration on the one-year anniversary of the death of Alexandros Grigoropoulos, a 15-year-old who was killed by a police officer. Photographer Milos Bicanski took the photograph, which is available on Getty Images with the following caption:", "Greek youths clash with riot police during a demonstration commemorating the fatal shooting of 15-year-old Alexandros Grigoropoulos' by police a year ago, on December 6, 2009 in central Athens, Greece. Two police officers will go on trial in the new year for the murder of Grigoropoulos.", "The protester's jacket in the original image was blank. The antifa logo was digitally added to this image, which was then reshared as if it depicted a recent incident in an attempt to show that \"both sides\" contributed to the violence in Charlottesville:", "Several politicians denounced both violence and white supremacy -- which culminated in Charlottesville with a white supremacist driving his car into a crowd of counter-protestors, killing 32-year-old Heather Heyer and injuring dozens more. However, more controversially, President Trump initially refused to condemn racism and instead blamed \"many sides\" for the violence:", "Some Republican lawmakers also chastised Trump’s response in implicit and explicit terms. “Mr. President—we must call evil by its name,” Colorado Senator Cory Gardner wrote on Twitter. “These were white supremacists and this was domestic terrorism.” Florida Representative Ileana Ros-Lehtinen said “there are no other ‘sides’ to hatred and bigotry.” Florida Senator Marco Rubio also noted it would be “very important for the nation to hear [President Trump] describe events in #Charlottesville for what they are, a terror attack by [white supremacists].”", "The Guardian.   \"Protesters Clash with Police in Athens.\"\r\n    6 December 2009.", "Ford, Matt.   \"We Must Reject Hate'.\"\r\n  The Atlantic.   12 August 2017.", "Merica, Dan.   \"Trump Condemns 'Hatred, Bigotry and Violence on Many Sides' in Charlottesville.\"\r\n  CNN.   13 August 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]