["The photo was published here on Facebook on June 10, 2020.", "It shows a bikini-clad woman standing between two seated men.", "The post’s Hindi caption translates to English as: “Look Congressmen, that’s your queen mother Sonia Gandhi.”", "Sonia Gandhi is the incumbent president of the Indian National Congress, one of the two major political parties in India.", "Comments on the misleading post in Hindi-lanuage suggested some Facebook users may have believed it was genuine.", "One user posted: \"This is Sonia Gandhi, this image of hers has been shared in American and European magazines\".", "Another user posted: \"Thanks for finding this photo of hers, Congressmen will now the reality of their leader\".", "The photo has also been shared here and here on Facebook, and here and here on Twitter, alongside a similar claim.", "The claim is false; the woman in the photo is Swiss film and television star Ursula Andress.", "A reverse Google image search found an identical photo published here on the US entertainment website IMDb.", "The photo caption states: “Sean Connery, Ursula Andress, and Terence Young in Dr. No (1962)”.", "“Dr. No” is the title of the 1962 James Bond film directed by Terence Young, which featured Sean Connery and Ursula Andress as lead actors.", "Below is a screenshot comparison of the image in the misleading posts (L) and the IMDb photo (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]