["By Robert Farley", "Posted on September 14, 2018", "A TV ad attacking Democratic Sen. Heidi Heitkamp stretches some facts to paint the incumbent North Dakota senator as a “rubber stamp” for the “Washington liberal agenda.”", "The ad says Heitkamp supported “amnesty for 11 million illegal immigrants, including domestic violence perpetrators and child abusers.” The bipartisan immigration bill Heitkamp supported would have toughened green card requirements, barring those convicted of domestic or child abuse who served a year or more in jail or who had two or more convictions for those offenses. She did oppose a proposed amendment that included a provision that would have gone even further, blocking those with only one misdemeanor conviction for domestic or child abuse.", "According to the Congressional Budget Office, the bill Heitkamp supported, the so-called Gang of Eight immigration bill, would have resulted in 8 million getting on a path to citizenship, not 11 million as the ad claimed.", "The phrase “amnesty” is also misleading. The bill — which was also supported by North Dakota’s Republican senator, John Hoeven — would have provided an earned path to citizenship, not automatic and immediate citizenship, as amnesty implies.", "The ad makes the broader claim that Heitkamp “rubber-stamps the Washington liberal agenda.” But, according to the statistical website FiveThirtyEight, which is owned by ABC News, Heitkamp voted along with Trump’s agenda 55 percent of the time, the second highest percentage among Senate Democrats.", "The ad comes from the Senate Leadership Fund, a Republican super PAC that was established by allies of Senate Majority Leader Mitch McConnell. The group seeks to expand the Republican majority in the Senate. Heitkamp faces a challenge to her seat from Republican Rep. Kevin Cramer.", "The Senate Leadership Fund ad claims that Heitkamp “rubber-stamped her approval of amnesty for 11 million illegal immigrants, including domestic violence perpetrators and child abusers.” (Another ad from the affiliated One Nation makes a similar claim against incumbent Democratic Sen. Joe Donnelly of Indiana, saying he “voted to grant amnesty to millions of illegal immigrants, including criminals, drunk drivers, domestic violence and worse.”)", "This claim involves two votes related to a Senate immigration bill in 2013. Heitkamp supported S. 744, the so-called Gang of Eight immigration bill that was cosponsored by four Democrats and four Republicans. The bill would have provided an earned path to citizenship for certain immigrants in the country illegally and would have added a number of border security measures.", "During the floor debate, Sen. John Cornyn proposed an amendment to the bill that set “triggers” — including a 90 percent border apprehension rate and full operational control of the border — that would have to be met before eligible immigrants could pursue a path to citizenship. Then-Senate Majority Leader Harry Reid called the amendment a “poison pill” designed to kill the compromise bill. Heitkamp was among those who voted successfully to kill the amendment.", "A week later, the Gang of Eight bill passed the Senate 68-32, and Heitkamp was among those who voted for it, along with Donnelly and Hoeven. It was never brought up for a vote in the House.", "The backing for the ad’s claim that she supported “amnesty” including for “domestic violence perpetrators and child abusers” is Heitkamp’s vote against the Cornyn amendment and her vote for the Gang of Eight bill.", "That’s because the Cornyn amendment also included provisions that would have added some misdemeanor offenses to the felonies that would prevent an immigrant from being eligible to pursue citizenship. Among them were domestic violence and child abuse or neglect.", "The Gang of Eight bill that passed, and that Heitkamp voted for, also toughened the law with regard to domestic violence and child abuse, though it didn’t go as far as the Cornyn amendment. The bill made inadmissible anyone who had served at least one year in jail or who had been convicted twice for either of those crimes.", "S. 744: Any alien who has been convicted of a crime of domestic violence, a crime of stalking, or a crime of child abuse, child neglect, or child abandonment, provided the alien served at least 1 year imprisonment for the crime, or provided the alien was convicted of offenses constituting more than 1 such crime, not arising out of a single scheme of criminal misconduct, is inadmissible.", "“Under current law you’re inadmissible (i.e. ineligible for a green card or even admission to the United States) if you committed a crime involving moral turpitude, a drug crime, or have multiple criminal convictions for which the aggregate sentence was 5 or more years. Domestic violence and child abuse don’t necessarily fall under any of those categories,” Sarah Pierce, a policy analyst at the Migration Policy Institute, told us via email.", "“Under Cornyn’s amendment applicants would be ineligible if they were convicted once of domestic violence or child abuse, even if it only qualified as a misdemeanor in the convicting jurisdiction,” Pierce said. “744 [the Gang of Eight bill] would have had more criminal inadmissibilities than we have currently, but not to the extent that Cornyn’s amendment proposed.”", "It’s fair to say that some immigrants convicted of domestic violence or child abuse would have been eligible for a path to citizenship under the Gang of Eight bill who would not have been eligible if Cornyn’s amendment had passed. But that provision did not come up for a stand-alone vote; it was just one small piece of a larger amendment that Heitkamp and other supporters of the Gang of Eight bill believed was designed to kill the bill.", "“As a former Attorney General, Heidi has always been tough on border security – that’s why she joined three lead Republicans in the Gang of Eight to vote against this poison pill amendment that they knew would have sunk a bipartisan bill that already addressed the amendment’s underlying goals,” Sean Higgins, a spokesman for the Heitkamp campaign, told us via email.", "Although several media outlets reported at the time the bill was introduced that it would provide a path to citizenship for 11 million immigrants then in the country illegally, the Congressional Budget Office later explained that not all of them would gain legal status.", "As we wrote back in 2013, the nonpartisan CBO said in a June 2013 report that there were “about 11.5 million unauthorized residents living in the United States at the end of 2011.” But not all of them would have become legal under the Border Security, Economic Opportunity, and Immigration Modernization Act. The CBO said “approximately 8 million of the unauthorized residents already in the country would obtain legal status” under the bill.", "So the ad overestimates the number of people who would have gained legal status under the bill by 3 million.", "It also misleadingly says they would have been granted “amnesty.” Those seeking citizenship under the bill would have been required to pay fines and back taxes, prove gainful employment, complete criminal background checks, learn English and civics, and go to the back of the line behind legal immigrants who had already applied for citizenship.", "As we have written, such an earned path to citizenship does not meet the strict definition of amnesty, which implies that immigrants currently in the U.S. illegally would be granted immediate, permanent residency without any of the requirements listed above.", "It’s also a curious charge given that the ad faults Heitkamp for opposing the Cornyn amendment, which also would have ultimately allowed a similar path to citizenship for most of those who would have been eligible under the final Gang of Eight bill.", "Also notable is that Heitkamp was one of only three Democrats who earlier this year voted in support of the Broader Options for Americans Act proposed by Sen. Chuck Grassley, a bill that sought to incorporate President Donald Trump’s framework for an immigration bill. In addition to providing $25 billion for border security and new limits on legal immigration, the bill would have provided a path to citizenship for 1.8 million so-called Dreamers, who were brought to the U.S. illegally as children and meet other requirements. Most of them would have been among those eligible for a path to citizenship under the Gang of Eight bill, and so are part of the millions the ad says would have been granted “amnesty.” The bill failed in the Senate.", "The ad says that “Heidi even supported sanctuary cities like San Francisco that harbor illegal immigrant criminals.”", "Heitkamp did vote against bills that would have cut off some federal funding, including law enforcement assistance, to cities deemed to be sanctuary cities — including these four bills, none of which passed after votes mostly along party lines.", "With its mention of “cities like San Francisco that harbor illegal immigrant criminals,” the ad appears to be referencing Kate Steinle, who was shot and killed in San Francisco by a Mexican national with a felony criminal record who had been deported several times. (The man, Jose Ines Garcia Zarate, was later acquitted of murder and involuntary manslaughter charges, as well as assault with a deadly weapon, though he was guilty of being a felon in possession of a firearm.)", "The case ignited a national debate over sanctuary cities and was frequently referenced by Trump on the campaign trail. The case also spurred legislation in Congress, dubbed Kate’s Law, which sought to ramp up penalties for immigrants who return to the United States after having been previously deported. The bill failed, with votes largely along party lines. But Heitkamp was one of three Democrats who voted for it.", "After noting some of Heitkamp’s votes on immigration, the Iran nuclear deal and sanctuary cities, the ad concludes, “Heidi Heitkamp: She rubber stamps the Washington liberal agenda.” But that isn’t borne out by a full review of Heitkamp’s voting record.", "According to a FiveThirtyEight.com analysis last updated Aug. 27, Heitkamp has voted in sync with Trump’s position 55.3 percent of the time. That’s the second highest percentage for a Democrat, behind only Sen. Joe Manchin of West Virginia, though it’s lower than the percentage for any Republican.", "A GovTrack analysis found Heitkamp votes well to the right of most Democrats on its ideology chart, and its 2017 report card ranked Heitkamp the fourth most conservative Democrat in the Senate.", "A Roll Call analysis released in March concluded, “Heidi Heitkamp of North Dakota, which Trump carried by 36 points, voted the president’s way two-thirds of the time and went against the partisan grain 30 percent of the time.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]