["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Not everyone is thrilled that former President Barack Obama and the former first lady, Michelle Obama, have signed a deal to produce shows and movies for Netflix. Namely, some of the commenters on a May 14 Facebook post highlight the Dancing Queen series on the streaming service.", "\"Netflix calls this s---; entertainment!\" reads the oddly punctuated post above a photo of child dancers and drag queen Alyssa Edwards. \"New Netflix show to make little boys into ‘sexy’ little girls!\"", "\"If this is true we are cancelling!!!\" one commenter said.", "\"The OBAMAS,\" another explained. \"ENOUGH SAID.\"", "This post, which had been shared more than 1,500 times as of May 16, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "But the poster included a link to back up the claim: the Netflix page for the show.", "\"Snatching trophies. Getting gorgeous. Turning it up,\" the show description says. \"Alyssa Edwards rules the dance studio by day — and the drag world by night.\"", "The series is produced by RuPaul, and it’s not exactly \"new.\" It debuted in October 2018 — about five months after Barack Obama announced his Netflix production deal. And while the reality show stars a drag queen, the children in it — both boys and girls — are students at the Beyond Belief Dance Company. The photo in the Facebook post is a promo for the show, but, if you watch the show, you know that most of the children in the shot are girls, not boys in drag.", "Justin Dwayne Lee Johnson is the owner of the dance company and a popular contestant on RuPaul’s Drag Race where his alter-ego, Alyssa Edwards, first became famous. Before that, the parents of his students didn’t know their children’s teacher was a gay man who does drag.", "The Dancing Queen reality show followed and, as Vanity Fair recalled in this October 2018 article, the first two episodes show Johnson officiating a wedding of friends in full Alyssa Edwards drag, him buying his first home, and him visiting his childhood home in Mesquite, Texas. The series also has plenty of drama, sniping among the dance moms (think pageant moms) and dancing as the children practice and perform in competitions.", "We rate this Facebook post Pants on Fire!", "Facebook post, May 14, 2019", "The New York Times, \"Coming soon to Netflix: The Obamas sign deal to produce shows,\" May 21, 2018", "Netflix, Dancing Queen, visited May 16, 2019", "Vanity Fair, \"Dancing Queen goes behind the mask of drag superstar Alyssa Edwards,\" Oct. 4, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]