["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Amy Klobuchar, D-Minn., is interviewed after a Democratic presidential primary debate hosted by NBC News and MSNBC on Feb. 19, 2020, in Las Vegas. (AP/York)", "Two polls conducted in 2019 show a heavy majority of Trump voters and supporters in favor of universal background checks.", "A 2013 poll commissioned by a hunting advocacy group found that 77% of hunters support universal background checks.", "Those findings line up with other polls that have shown majority support among Republicans, NRA members and gun owners.", "On the heels of a fiesty Democratic debate that touched on everything from health care to former New York City Mayor Mike Bloomberg’s past comments and positions, Minnesota Sen. Amy Klobuchar joined MSNBC’s \"Morning Joe\" to talk about an issue that didn’t come up: Guns.", "Klobuchar said she was \"sad\" that gun violence wasn’t talked about during the debate in Las Vegas, the location of the deadliest mass shooting in U.S. history in 2017. She also lamented the lack of progress in Congress on universal background checks.", "\"The majority of hunters now want universal background checks, the majority of Trump voters,\" Klobuchar said. \"There’s absolutely no reason we shouldn’t be moving on it.\"", "We’ve fact-checked a number of related claims from Democrats about support for universal background checks among groups such as NRA members, gun owners and Republicans.", "But what about hunters? And what about supporters of President Donald Trump?", "Klobuchar has made the same claim a few times before, including on ABC’s \"The View,\" so we decided to check it out. We found that her statement lines up with the available polls.", "RELATED: Do gun background checks work? What the research shows", "Many Democrats have called for universal background checks, which would require background checks on nearly all gun purchases, including private sales made at events such as gun shows.", "The Democrat-led House passed a bill in 2019 to ban the private transfer of firearms unless a licensed gun dealer or manufacturer takes possession of the firearm to conduct a background check. But the GOP-led Senate has refused to take it up.", "Trump, meanwhile, has made inconsistent statements about background checks, often touting the need to strengthen them in the wake of mass shootings only to walk back his support later.", "When we examined a previous claim about GOP support for universal background checks, we found a number of polls that showed Republican approval floating between 82% and 95%.", "Not all registered Republicans necessarily voted or are planning to vote for Trump, whose approval rating within the party has generally held within the mid-to-high 80s. But a few polls that have narrowed the scope to Trump voters lend credence to Klobuchar’s claim.", "The Klobuchar campaign specifically cited an Aug. 14 Fox News poll that asked 1,013 randomly sampled registered voters if they \"favor or oppose\" proposals \"requiring criminal background checks on all gun buyers, including those buying at gun shows and private sales.\"", "That poll — conducted shortly after mass shootings in Dayton, Ohio, and El Paso, Texas — found support for such proposals from 90% of \"Trump voters,\" with 8% signaling opposition and 2% saying they didn’t know.", "Similarly, a mid July Marist poll conducted in partnership with NPR and PBS NewsHour asked 1,346 respondents about \"background checks for gun purchases at gun shows or other private sales.\" And 82% of \"2016 Trump supporters\" said the checks were a \"good idea.\"", "Still, it’s worth noting that support for background checks doesn’t always line up with voting for specific pieces of legislation. The National Rifle Association has pointed to 2016 referendums in Maine and Nevada that showed lower support for background checks than the national polls.", "It’s also not clear how many people surveyed as part of the Fox News and Marist polls identified as Trump voters or supporters, although the Marist poll only reported results for subgroups of at least 100 people. Small sample sizes could be misleading, even if a larger number of polls shows high support for background checks among Republicans more generally.", "But Klobuchar claimed only that a majority of Trump voters want background checks, leaving her wiggle room to account for margins of error or changes in public opinion over time.", "We follow the facts and share what we learn so you can make your own decisions. Support our mission today. Membership.politifact.com", "As for hunters, the Klobuchar campaign cited a 2013 Politico article about a poll commissioned by Bull Moose Sportsmen’s Alliance, an advocacy group representing hunters and sportsmen.", "That poll surveyed 800 hunters and found that 77% support \"requiring anyone who wants to purchase a firearm to pass a criminal background check before each potential gun purchase.\"", "It also found that 72% of hunters support criminal background checks that allow for exemptions for \"gun exchanges between family members, sharing guns on hunting trips and shooting ranges, or sales to those who have concealed carry permits from state government.\"", "By now, the poll is almost seven years old. Liam Sullivan, press secretary for Brady United Against Gun Violence, a gun control advocacy group, said the organization was not aware of any other surveys measuring hunters’ support for background checks.", "We couldn’t find other related polls via Google and Nexis. Neither could Everytown for Gun Safety, another gun control advocacy organization.", "But Sullivan noted that pollsters — including the Pew Research Center  — have found majority support for background checks among gun owners more generally.", "Klobuchar said, \"The majority of hunters now want universal background checks, the majority of Trump voters.\"", "The claim about Trump voters is backed by two national polls from the summer of 2019, while the claim about hunters matches a 2013 poll commissioned by a hunting advocacy group. Polls don’t necessarily reflect support for specific pieces of legislation, however.", "We rate this statement True.", "MSNBC, \"Morning Joe,\" Feb. 20, 2020", "The View on YouTube, \"Sen. Amy Klobuchar Discusses Her 2020 Campaign | The View,\" Dec. 2, 2019", "ABC News, \"Campaign says new gun control measures may pose political problem for Trump: Sources,\" Sept. 6, 2019", "The New York Times, \"Trump Aides’ Poll Finds Gun Control Politically Problematic for the President,\" Sept. 6, 2019", "The Washington Post, \"The surprising support for gun control among Trump voters, in three charts,\" Aug. 15, 2019", "Fox News, \"Fox News Poll, August 14,\" Aug. 14, 2019", "NPR/PBS NewsHour/Marist national poll, July 17, 2019", "NRA, \"Background Checks for Guns,\", Jan. 7, 2019", "The New York Times, \"Inside the Power of the NRA,\" Dec. 12, 2013", "PR Newswire, \"Hunters Show Strong Support for Conservation, Background Checks, Strong Opposition to Assault Weapons Ban,\" May 27, 2013", "Politico, \"Hunters chart middle ground on guns,\" April 4, 2013", "Politico, \"Hunting org is for background checks,\" April 3, 2013", "Bull Moose Sportsmen’s Alliance, \"National Survey of Hunters,\" accessed via the Internet Archive on Feb. 20, 2020", "PolitiFact, \"Buttigieg on point that majority of Republicans support background checks,\" Jan. 29, 2020", "PolitiFact, \"What is Congress doing besides impeachment?\" Nov. 14, 2019", "PolitiFact, \"Donald Trump’s shifts on gun background checks after mass shootings,\" Aug. 23, 2019", "PolitiFact, \"Republicans support Donald Trump, but not as much as he said,\" June 6, 2019", "PolitiFact, \"A mostly on target claim: 97 percent of gun owners support universal background checks,\" March 2, 2018", "PolitiFact, \"Do majority of NRA members support background checks for guns?\" Feb. 27, 2018", "PolitiFact, \"Do 90% of Americans support background checks for all gun sales?\" Oct. 3, 2017", "Email interview with Liam Sullivan, press secretary for Brady United Against Gun Violence, Feb. 20, 2020", "Email interview with Adam Farina, press secretary for Everytown for Gun Safety, Feb. 20, 2020", "Email interview with Max Steele, spokesman for the Klobuchar campaign, Feb. 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]