["By D'Angelo Gore", "Posted on February 6, 2018", "President Donald Trump claimed that “Apple is investing $350 billion in the United States” over the next five years all because of the Tax Cuts and Jobs Act. That’s contradicted by Apple’s chief executive officer, who said that “there’s large parts of this that we would have done in any situation.”", "Not all of the money is exactly new spending. Apple said that a portion of its contribution would come from continuing its “current pace of spending with domestic suppliers and manufacturers,” which is expected to be $55 billion in 2018. If it spent that amount each year for five years, it would total $275 billion.", "Apple said another $75 billion consists of capital expenditures, new manufacturing investments and taxes paid on overseas profits transferred back to the U.S.", "But the president credited the Republican tax bill he signed into law in late December for the full amount during remarks he made to members of Congress at a GOP retreat in West Virginia.", "Trump, Feb. 1: Because of our tax cuts, Apple is investing $350 billion in the United States. They’re bringing $240 billion back — $240 billion. They’re going to pay a tax of $38 billion, Mitch — $38 billion. But they’re going to invest a total of $350 billion. … for $350 billion, they’re going to build a lot of plants. And this would have never happened without us and the work you’ve done. And they’re hiring 20,000 workers, by the way.", "Apple did announce that it will be creating 20,000 jobs as part of a $350 billion contribution to the U.S. economy over the next five years. But the company did not attribute all it has planned to the new tax law.", "A Jan. 17 press release said: “Combining new investments and Apple’s current pace of spending with domestic suppliers and manufacturers — an estimated $55 billion for 2018 — Apple’s direct contribution to the US economy will be more than $350 billion over the next five years, not including Apple’s ongoing tax payments, the tax revenues generated from employees’ wages and the sale of Apple products.”", "As for new investments, the press release stated: “Planned capital expenditures in the US, investments in American manufacturing over five years and a record tax payment upon repatriation of overseas profits will account for approximately $75 billion of Apple’s direct contribution.”", "Of that amount, the tech giant said $38 billion would come from taxes it will pay on about $250 billion in foreign profits it plans to bring back to the U.S. That was the only explicit mention of the tax law, which lowered the tax rate from 35 percent to 15.5 percent on overseas cash that companies repatriate to the U.S.", "In addition, Apple said it plans to spend $30 billion on capital expenditures, including $10 billion on investments in data centers across the country. The company also plans to increase its Advanced Manufacturing Fund by $4 billion “to support innovation among American manufacturers and help others establish a presence in the US.”", "And though Trump said that “they’re going to build a lot of plants” with the $350 billion, Apple’s release only mentioned the construction of one new corporate campus in an unspecified location, “which will initially house technical support for customers.”", "We asked Apple representatives how much of the $350 billion contribution was directly related to the tax law, but didn’t get a response.", "That said, Apple CEO Tim Cook previously indicated that not all of it is. He told ABC News reporter Rebecca Jarvis in an interview in January that “there are large parts of this that are the result of tax reform, and there’s large parts of this that we would have done in any situation.”", "Cook said he “hasn’t spent a lot of time categorizing the two,” but his statement means that Trump can’t attribute everything that Apple has planned to the Republican tax legislation that he signed into law.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]