["About this rating", "A large number of articles falsely declaring that Congress has started impeachment proceedings against President Obama have circulated widely on the Internet since Barack Obama took office in January 2009, most of them spoofs from well known fake news web site.  A similar item from February 2014 (quoted above) is not a spoof, but it's just as false.", "In December 2013, Representative Tom Rice of South Carolina introduced H.Res. 442, also known as the STOP (Stop This Overreaching Presidency) resolution, to Congress.  That resolution was not, as claimed above, one which initiated impeachment proceedings against President Obama, nor did it state that the President \"should be impeached.\"  Rep. Rice's STOP resolution was a non-binding one (essentially an expression of opinion with no legal force behind it) declaring that Congress should file a lawsuit against President Obama in U.S. District Court in order to challenge various actions he has undertaken via executive order:", "A group of House Republicans is pushing a resolution to bring legal action against President Barack Obama for overstepping his authority in executive orders.", "The STOP (Stop This Overreaching Presidency) resolution, sponsored by Rep. Tom Rice, targets Obama for allowing a year extension health care policies that were ended because of Obamacare; delaying the employer mandate for one year; deferring the deportation of illegal immigrants brought to the country as children and waiving part of the welfare work requirement.", "Rice said he's spoken with the House GOP leadership about the resolution — which would be non-binding if it ever advanced, and wouldn't need Senate approval — and a hearing is being scheduled in both the Judiciary and Administration Committees.", "The resolution has 74 Republican cosponsors, ranging from the more conservative to moderate members. Rice held a press conference to announce it with 12 other Republicans.", "Other than in the general sense of expressing disapproval of the President's actions, nothing about this resolution had anything to do with the constitutional impeachment process: it did seek to initiate formal impeachment hearings against President Obama, nor was it a step towards removing him from office.", "Although 119 cosponsors (all of them Republicans) ultimately signed onto the STOP resolution, no action was ever taken on it by Congress after it was introduced to the House: it was not passed, voted upon, or even put up for a vote.  It was immediately referred to the Committee on Rules and the Committee on House Administration, and it languished there until the end of the 113th Congress in January 2015.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]