["About this rating", "On 1 April 2017, Back2Stonewall.com reported that Sen. Tom Cotton (R-Arkansas) vouched for the benefits of \"gay conversion therapy\" in an interview.", "The story stated in part:", "“I gave it shot, and boy am I glad I did,” Cotton told Tony Perkins, leader of the Family Research Council hate group. “I know it may not help everyone but it worked for me, [you] just need to find the right program that works for you.” Cotton continued, “I am now the man I always knew I could be, fully dedicated to God, my wife, and the good people of Arkansas, without all the urges to have sex with hot guys 24 hours a day.”", "Will Kohler, who wrote the story, confirmed to us via e-mail on 4 April 2017 that the story was intended as a joke. Not only is it tagged \"April Fools,\" but the use of \"semi-real\" news sites as \"sources\" marks it as a prank.", "However, the site also ran the same story in May 2016. While the link to that post does not work, it is still visible on its Facebook page:", "Kohler told us that the original post (then tagged as satire) ran alongside the first appearance of the \"semi real\" story, and that he recycled it for use on April Fool's Day.", "Cotton has not issued any statements about \"gay conversion\" therapy. He did, however, suggest support in April 2015 for two bills in both his state and Indiana that were criticized for allegedly opening the door for businesses to reject LGBTQ customers on the basis of \"religious freedom.\"", "When asked about the opposition to the measures, the senator said, \"I think it's important we have a sense of perspective about our priorities. In Iran they hang you for the crime of being gay.\"", "\"Congressman Says Critics Of Indiana Law Should 'Get Perspective.'\" YouTube, uploaded by TP Clips 8. 2 April 2015. https://www.youtube.com/watch?v=XJfO1k6hHNw", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]