["According to short text shared on various social media platforms in meme format, pretending to order a pepperoni pizza could save your life. “If you need to call 911 but are scared to because of someone in the room, dial and ask for a pepperoni pizza,” advises the text box. It claims that 911 dispatchers are trained to know that this code means someone might be listening to the call and send help.", "However, this is not true. Dispatchers are not trained to respond in a particular way when a caller pretends to order a pepperoni pizza.", "The text has been shared for several years, and may have taken root after the airing of this advertisement during the 2015 National Football League Super Bowl by NoMore.org, a non-profit that combats domestic violence.", "“I am not aware of any 911 organization promoting the use of code words when dialing 911,” April Heinze, operations director for the National Emergency Number Association, an industry organization for 911 centers in North America, told AFP in an email.", "Since 911 is a national number in Canada and the US, any code word would need to be massively promoted and publicized, which would educate potential victims as well as would-be aggressors, Heinze pointed out. If an aggressor recognized that someone was trying to call for help using a code word, this could in turn elicit a violent response.", "“Unfortunately, often times social media posts are not accurate,” she lamented. “The best thing we can do is to remind folks that they can’t believe everything they read or hear in social forums.”", "Several police departments in the United States have debunked this myth in the past, including the LAPD in California or the Bremer County Sheriff’s Office, in Iowa.", "#LAPD Communications has seen this graphic circulating on various social media channels. This is false. Text to 911 is a much better option. Your exact location & the nature of your emergency is what’s needed to send the right resources. pic.twitter.com/MMBkjHPMNV", "Although 911 organizations do not promote the use of code words, Heinze mentioned that instances where someone “dialed 911 and asked for a pizza or something similar,” have occurred and have been highly publicized.", "In Great Britain, BuzzFeed UK reported on a  nearly identical story in 2014, although the 911 respondent had to guess that the caller ordering pizza was in distress and then sent help.", "“911 professionals are able to catch on that the caller is not actually free to speak,” Heinze said, because they are trained in the art of active listening and thus can pick up on the unspoken.", "If you are in a dangerous situation but are unable to call the authorities, the Los Angeles Police Department recommended texting 911. Texting for 911 is also available in most areas of Canada.", "This Canadian government website provides resources to stay safe from abuse. The Assaulted Women’s Helpline at 1-866-863-0511 offers 24-hour telephone assistance.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]