["By Saranac Hale Spencer", "Posted on February 25, 2021", "The Biden administration has made no changes to COVID-19 testing policies for either U.S. Immigration and Customs Enforcement or Customs and Border Patrol. But a claim circulating online falsely suggests that the administration has stopped testing detained immigrants before they are released.", "A Texas sheriff told Fox News host Tucker Carlson on Feb. 9, “it’s absolutely true” that immigrants detained after crossing the border have been released into the U.S. without being tested for COVID-19.", "The sheriff, A.J. Louderback, then cited and misrepresented a memo issued by David Pekoske, acting secretary of the Department of Homeland Security, on the first day of President Joe Biden’s term.", "That exchange was highlighted in a story on a conservative website, The Political Insider, with the headline: “Texas Sheriff Claims Biden Admin Releasing Illegal Immigrants Into U.S. Without COVID Testing.”", "It’s true that Louderback made the claim — but the claim itself is false.", "Despite that, the headline still garnered comments on Facebook calling for Biden to be impeached or charged with either murder or attempted murder.", "In reality, the Biden administration has maintained the same procedures for COVID-19 testing in detention facilities that were in effect during the previous administration.", "Nothing in the Biden administration’s policy indicates a break from the standing policy on COVID-19 testing, Josiah Heyman, director of the Center for Interamerican and Border Studies at the University of Texas at El Paso, told us in a phone interview.", "Both U.S. Immigration and Customs Enforcement and Customs and Border Patrol confirmed to us that no such policies had changed.", "Louderback didn’t specify on Carlson’s show which agency was no longer conducting testing, but he did say that the effect of the memo was to “defund ICE,” so he left the impression that he was talking about ICE.", "It’s worth noting, though, that Louderback doesn’t work for either ICE or CBP — he’s the sheriff in Jackson County on the gulf coast of Texas. Louderback told us in an interview that he became vocal about immigration issues while former President Barack Obama was in office. He was invited to the White House at least twice for immigration-related appearances under former President Donald Trump.", "Both ICE and CBP are part of the Department of Homeland Security, and the memo that Louderback referenced called for a review of policies in each agency.", "“The United States faces significant operational challenges at the southwest border as it is confronting the most serious global public health crisis in a century,” Pekoske’s memo said. “In light of those unique circumstances, the Department must surge resources to the border in order to ensure safe, legal and orderly processing, to rebuild fair and effective asylum procedures that respect human rights and due process, to adopt appropriate public health guidelines and protocols, and to prioritize responding to threats to national security, public safety, and border security.”", "It also specified that “all enforcement and detention decisions shall be guided by DHS’s ability to conduct operations and maintain custody consistent with applicable COVID-19 protocols.”", "For ICE, those protocols, which were in effect when Biden took office, include testing all detainees upon arrival and then keeping them quarantined for 14 days while monitoring for COVID-19 symptoms. “New arrivals who have negative test results and remain symptom free can join the general detained population after the 14-day intake period. Detainees who test positive for COVID-19 receive appropriate medical care to manage the disease,” according to the agency’s guidance, which was last updated Aug. 12, 2020.", "Also, the ICE manual for dealing with COVID-19 says that high-risk detainees must be tested before being released into the community.", "CBP is supposed to limit its detentions to 72 hours and, according to a spokeswoman who answered our questions by email, officers “conduct initial inspections for symptoms or risk factors associated with COVID-19 and consult with onsite medical personnel, the U.S. Centers for Disease Control and Prevention (CDC), or local health systems as appropriate. Onsite medical personnel can provide basic assessment and supportive treatment, but suspected COVID-19 cases are referred to local health systems for appropriate testing, diagnosis, and treatment.”", "Again, this was the existing protocol when Biden took office.", "When we asked Louderback to clarify his claim, he didn’t directly address the suggestion he had made on the show. Instead, he focused on the recent change to the Migrant Protection Protocols, better known as the “remain in Mexico” policy that was introduced by the Trump administration in 2019. Under that policy, asylum seekers were sent to Mexico to await their court appearances in the U.S.", "The Biden administration has stopped enrolling people in the program and started processing the roughly 25,000 people currently waiting in Mexico.", "The policy for processing them includes testing each individual in Mexico before they enter the U.S.", "Louderback also suggested in the phone interview that another Trump-era policy was no longer in effect. “Title 42 was left out,” he said, referring to an order from the CDC that permits border patrol officers to send back immigrants in order to slow the spread of COVID-19. Louderback suggested that the order provided testing related to the MPP and, since it wasn’t mentioned in the memo from Pekoske, it was no longer in effect.", "None of that is true.", "Title 42 doesn’t address testing and it’s still in effect. Biden directed the CDC to review and evaluate the necessity of the order in his Feb. 2 executive order on immigration policy, but he didn’t end its use. Some Democrats have called on him to do so, while some Republicans have called on him to leave it intact. In January, the month Biden took office, more than 60,000 people were rejected at the Mexican border under the order, which is roughly the same number that were rejected in each of the previous three months, according to the most recent numbers from CBP.", "Acknowledging that reduced testing isn’t mentioned in the memo, Louderback said in the phone interview, “Reality is, whether or not it’s mentioned in there, there is no testing being done.”", "But Heyman, of the University of Texas at El Paso, said, “If there are people who haven’t been tested, it’s a breakdown on the behavior of ICE, not Biden administration policy.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Texas sheriff claims Biden has ‘defunded ICE by memorandum.’” Foxnews.com. 9 Feb 2021.", "Noble, Becky. “Texas Sheriff Claims Biden Admin Releasing Illegal Immigrants Into U.S. Without COVID Testing.” Thepoliticalinsider.com. 9 Feb 2021.", "Heyman, Josiah. Director, Center for Interamerican and Border Studies at the University of Texas at El Paso. Telephone interview. 15 Feb 2021.", "Spokesperson, U.S. Immigration and Customs Enforcement. Email exchange. 12 Feb 2021.", "Spokesperson, U.S. Customs and Border Patrol. Email exchange. 23 Feb 2021.", "Louderback, A.J. Sheriff, Jackson County, Texas. Telephone interview. 16 Feb 2021.", "Pekoske, David. Memorandum — Review of and Interim Revision to Civil Immigration Enforcement and Removal Policies and Priorities. U.S. Department of Homeland Security. 20 Jan 2021.", "U.S. Department of Homeland Security. ICE Guidance on COVID-19. Accessed 23 Feb 2021.", "U.S. Department of Homeland Security. “COVID-19 Pandemic Response Requirements.” 27 Oct 2020.", "U.S. Department of Homeland Security. Migrant Protection Protocols. 24 Jan 2019.", "U.S. Department of Homeland Security. DHS Statement on the Suspension of New Enrollments in the Migrant Protection Protocols Program. 20 Jan 2021.", "Biden, Joe. Executive Order on Creating a Comprehensive Regional Framework to Address the Causes of Migration, to Manage Migration Throughout North and Central America, and to Provide Safe and Orderly Processing of Asylum Seekers at the United States Border. 2 Feb 2021.", "U.S. Department of Homeland Security. Press release. “DHS Announces Process to Address Individuals in Mexico with Active MPP Cases.” 11 Feb 2021.", "U.S. Department of Homeland Security. DHS Begins to Process Individuals in MPP Into the United States to Complete their Immigration Proceedings. Accessed 23 Feb 2021.", "Lavandera, Ed, Ashley Killough and Kim Berryman. “There’s an uptick in migrants crossing into the US, driven by economic woes and hopes for change under Biden.” CNN.com. 19 Feb 2021.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]