["This combination of file photos shows Republican candidates for governor in Ohio's Tuesday, May 8, 2018, primary including Attorney General Mike DeWine and Lt. Gov. Mary Taylor. (AP)", "A TV ad portrays Ohio Attorney General Mike DeWine, a Republican candidate for governor, as out of step with President Donald Trump on immigration.", "Onward Ohio, a political action committee, launched a statewide TV ad on March 20.", "\"If you like President Trump then you won’t like Mike DeWine,\" states the narrator. \"In the Senate, DeWine voted with Hillary Clinton to let illegal immigrants receive Social Security. And in Ohio, DeWine allowed illegal immigrants to receive driver's licenses.\"", "DeWine’s May 8 primary opponent, Lt. Gov. Mary Taylor, is a former chair of the PAC and echoed the attack on Twitter.", "The ad attacks DeWine’s position on other topics including his grade from the NRA, which we have previously fact-checked.", "We found that the ad doesn’t accurately explain DeWine’s Senate vote related to Social Security and requires some context to explain why as Attorney General he concluded that some undocumented immigrants should receive driver’s licenses.", "We emailed Onward Ohio and did not get a reply.", "The ad makes it sound as if DeWine wanted to provide a new entitlement for undocumented immigrants by allowing them to qualify for Social Security -- an attack we have seen before against Sen. Mark Pryor, D-Ark., and Harry Reid, D-Nev.", "In reality, the 2006 vote concerned a much narrower issue -- the treatment of past payroll taxes paid by former undocumented immigrants who would have become legal under an immigration overhaul bill that included border security, a new temporary worker visa and a path to legal status.", "At the time, undocumented immigrants had a right to receive credit in their benefits calculation for Social Security payments they had made while working illegally, typically while using an unauthorized Social Security number. They received such credit only after they had received legal working papers and a genuine Social Security number.", "During a Senate debate over the broader bill, then-Sen. John Ensign, R-Nev., offered an amendment to prevent anyone from earning credit for Social Security payments made using an unauthorized Social Security number.", "On May 18, 2006, the Senate voted 50-49 to table the amendment, effectively killing it. DeWine and Clinton, then a New York senator, were among those who voted in favor of tabling it.", "DeWine’s campaign spokesman Ryan Stubenrauch said that DeWine \"voted to table the amendment because he believed that people should keep what they had earned if they could meet the steep requirements to become legal residents.\"", "DeWine had expressed support for the overall bill because it included border security and also addressed the 12 million undocumented immigrants.", "\"It's a dangerous thing to have them in the underground. We have to put some paper on them and document them,\" he said several weeks before the bill passed.", "The House passed its own version, and the two chambers didn’t work out a compromise, so the bills died.", "This part of the ad could leave viewers with the misleading impression that DeWine took actions to allow all undocumented immigrants to get drivers’ licenses.", "DeWine’s recommendation while he was Ohio attorney general pertained only to a narrow slice of immigrants.", "In 2013, Ohio lacked a uniform policy regarding whether to grant driver’s licenses to immigrants who had temporary status through the 2012 program Deferred Action for Childhood Arrivals, which began under President Barack Obama.", "Some state officials issued driver’s licenses, while others refused.", "On March 29, 2013, the Ohio Bureau of Motor Vehicles announced that Ohio would allow the issuance of temporary licenses to qualified participants in DACA.", "The bureau reached a decision after reviewing guidance by DeWine \"that DACA grantees are eligible for temporary driver licenses under Ohio law.\"", "DeWine wrote in a March 19 letter to the Ohio Latino Affairs Commission that DACA recipients could get a Social Security number and work permit.", "\"With these documents and any other documents normally required by the BMV, an individual can provide the BMV with the information necessary to receive a driver’s license,\" he wrote. \"I encourage any citizen who is concerned about the law or policy to contact their legislators and voice that concern. As Attorney General, I do not have the authority to introduce or vote on legislation.\"", "DeWine’s campaign said he didn’t issue a formal advisory opinion -- he only expressed his view in a letter, and then it was up to the Bureau of Motor Vehicles to issue driver’s licenses.", "The TV ad cites a Cleveland Plain Dealer article that mentioned DeWine’s conclusion.", "David Leopold, an immigration lawyer at Ulmer & Berne in Ohio and former president of the American Immigration Lawyers Association, worked in an advocacy capacity closely with Jose Mendez, a DACA recipient who pushed the issue at the time in Ohio.", "Leopold told PolitiFact that it wasn’t a case of DeWine allowing undocumented immigrants to receive driver’s licenses. He was simply interpreting the DACA policy under Ohio law. Since DACA holders were considered \"lawfully present,\" they were able to provide the necessary information to apply for a driver’s license.", "There were around 1,900 immigrants with DACA status in Ohio by the end of May 2013 when U.S. Citizenship and Immigration Service first started tracking state data. Overall, there were 95,000 undocumented immigrants in Ohio.", "As of 2013, the majority of states already gave driver’s licenses to DACA recipients. Two states, Arizona and Nebraska, implemented policies that excluded DACA grantees from driver’s license eligibility, but as a result of litigation or legislative action, both states later issued driver’s licenses, according to the National Immigration Law Center.", "Trump announced in 2017 he would rescind DACA. While a federal judge ordered his administration to continue renewals they are not required to process new applications. The U.S. Supreme Court declined to take it up and Congress hasn’t been able to reach any agreement on DACA.", "Onward Ohio said in a TV ad that \"in the Senate, DeWine voted with Hillary Clinton to let illegal immigrants receive Social Security. And in Ohio, DeWine allowed illegal immigrants to receive driver's licenses.\"", "On both of these attacks, the ad makes a sweeping statement without filling in viewers about the scope of what a bill and a policy actually said.", "The Social Security provision was more narrow than the ad suggests, because it addressed the treatment of past payroll taxes paid by people who at one time had been undocumented immigrants.", "While attorney general, DeWine concluded that undocumented immigrants who had temporary status through the federal DACA program were entitled to driver’s licenses, but that didn’t apply to all undocumented immigrants. There are kernels of truth here, but the ad fails to provide a complete picture of DeWine’s actions.", "We rate this claim Mostly False.", "Medium Buying, Twitter, March 20, 2018", "Onward Ohio, Website, Accessed March 22, 2018", "Lt. Gov. Mary Taylor, Tweet, March 22, 2018", "U.S. Senate, roll call vote on the motion to table Ensign amendment 3985, May 18, 2006", "U.S. Senate, text of amendment 3985, May 18, 2006", "Attorney General Mike DeWine, Letter to Nolan Stevens, Latino Affairs Commission, March 19, 2013", "Ohio Bureau of Motor Vehicles, Press release, March 29, 2013", "Cincinnati Enquirer, \"The Race for U.S. Senate,\" (Accessed in Nexis) April 21, 2006", "Copley News Service, \"Lawmakers clash on immigration proposals,\"  (Accessed in Nexis) April 5, 2006", "CQ, Senate Votes to Declare English the 'National Language,'\" (Accessed in Nexis) May 18, 2006", "U.S. Sen. John Ensign, Press release, (Accessed in Nexis) May 18, 2006", "Cleveland Plain Dealer, \"Some immigrants in new program are being denied driver's licenses Ohio hasn't issued uniform policy for registrars,\" (Accessed in Nexis) Feb. 23, 2013", "Cleveland Plain Dealer, \"Ohio compliance sought on immigrant drivers,\" (Accessed in Nexis) March 6, 2013", "Cleveland Plain Dealer, \"Ohio to grant driver's licenses to some undocumented immigrants,\" March 29, 2006", "Columbus Dispatch, \"Immigration; Federal-state conflict holds up driver's licenses,\" Feb. 24, 2013", "Dayton Daily News, \"Bill would block Ohio driver’s licenses for immigrants,\" May 28, 2013", "Politico, \"Trump criticizes DOJ for not pushing SCOTUS on Arizona driver’s license case,\" March 21, 2018", "Center for Responsive Politics, Onward Ohio, Accessed March 21, 2018", "Pew Research Center, Unauthorized immigrant population trends for states, birth countries and regions, Nov. 13, 2016", "National Immigration Law Center, \"Are Individuals Granted Deferred Action under the Deferred Action for Childhood Arrivals (DACA) Policy Eligible for State Driver’s Licenses?\" June 19, 2013", "National Immigration Law Center, \"Access to Driver’s Licenses for Immigrant Youth Granted DACA,\" May 31, 2015", "PolitiFact, \"Did Senate pass immigration bills in 2006, 2013 and House failed to vote on them?\" Jan. 26, 2018", "PolitiFact, \"Did Mark Pryor vote 'to give Social Security benefits to illegal immigrants'?\" Sept. 4, 2014", "PolitiFact, \"Sharron Angle says Harry Reid wants to give illegals Social Security benefits,\" Sept. 17, 2010", "PolitiFact, \"In GOP Ohio primary for governor, Mary Taylor said Mike DeWine flip-flopped on guns,\" March 6, 2018", "FactCheck.org, \"Social Security for Illegal Immigrants?\" March 1, 2009", "Snopes, \"Social security for illegal aliens?\" Last updated March 10, 2015", "Interview, Dan Tierney, Attorney General Mike DeWine spokesman, March 21, 2018", "Interview, Steve Blando, U.S. Citizenship and Immigration Services spokesman, March 21, 2018", "Interview, Ryan Stubenrauch, Mike DeWine campaign spokesman, March 22, 2018", "Interview, David Leopold, Partner and Chair in Immigration Law at Ulmer & Berne LLP and past president of the American Immigration Lawyers Association, March 22, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]