["A CCTV video clip of a skull-capped man attacking another person with a rod is viral with a caption that says, “This is how Hindus are killed and their deaths are made to look like an accident.”", "A Twitter user called Munna Yadav, whose bio says ‘मोदी योगी भक्त जय भाजपा हमेशा भाजपा’, shared the video with a caption in Hindi that said the same. He said the incident was from Kerala.", "इस तरह से जेहादियों द्वारा हिन्दुओं को मार कर एक्सीडेंट (Accident) का रूप दे दिया जाता है केरला मे…", "अगर CCTV ना होता तो इसके खिलाफ सबूत भी नहीं होता…", "सावधान रहें ⚠ सतर्क रहें😡🖐️ pic.twitter.com/RkVk7MnSV4", "— Munna_Yadav (@MY961) May 15, 2023", "Alt News has received requests on its WhatsApp helpline (7600011160) to verify the video.", "The video had gone viral in June 2021 and then also, we received requests for a fact check.", "This slideshow requires JavaScript.", "The same clip was circulating in February 2021 as well.", "कुछ इस तरह हिंदुओं को मार कर एक्सीडेंट साबित कर दिया जाता है केरल में इस जेहादी की उस हिन्दू से कोई परिचय या दुश्मनी नहीं थी केवल अकेले में मौका मिला तो उसने एक और हिन्दू कम कर दिया, यही कुरान इनको सिखाती है। अगर CCTV न होता तो ये जेहादी कभी न पकड़ में आता।सावधान रहें सतर्क रहें। pic.twitter.com/ik8nhLwwgI", "— 🚩🇮🇳उमा शंकर राजपूत 🇮🇳🚩7k (@UmaShankar2054) April 5, 2021", "Back then, it was also shared with a differently-worded message – “We lack killer instinct, including me. We worry abt the consequences later. They are like “Jo hoga dekha jayega”. @narendramodi this is increasing their power! Please take some strict action (sic),” wrote Twitter user @TheMehtaji while another suggested that the Muslim community in India should be economically boycotted.", "BJP Delhi social media head Naveen Kumar also shared the video. He wrote, “कपड़ों से पहचाना जा सकता है” referring to Prime Minister Modi’s statement during anti-CAA protests that those inciting violence “can be identified by their clothes”. His tweet was quote-tweeted by @seriousfunnyguy who is followed by PM Modi and BJP leaders Piyush Goyal, Smriti Irani and Kapil Mishra.", "कपड़ों से पहचाना जा सकता है pic.twitter.com/qFxVIoiAV4", "— Naveen Kumar (@naveenjindalbjp) February 26, 2021", "BJP supporter Sonam Mahajan tweeted, “Miyan bhai ki darin in true sense.” Several people in her comments believe that a Hindu man was attacked in India.", "Another user @thakkar_sameet who is followed by PM Modi also shared the clip. It has also been circulated with Tamil captions.", "தொப்புள் கொடி உறவின் செயல் இந்தியர்களே பத்திரமா இருங்க… pic.twitter.com/CrsGB2Y6Dv", "— 🔱🇮🇳Sri.Sri.Yadav🇮🇳🔱 ஓம் சிவாய நம🚩 (@iamSri_Sri) February 25, 2021", "In the background, people can be heard talking in Sinhalese. This was the first clue that suggested the video could be from Sri Lanka.", "Fact Crescendo Sri Lanka contacted Galaha police station in the central province of Sri Lanka. Acting OIC Rodrigo told the outlet that the attack was not religiously motivated. “The Muslim person is mentally ill. He suddenly engaged in the attack. We arrested him immediately and kept him in police custody. At present, the injured person is being treated at the hospital,” he said.", "According to Fact Crescendo, the incident took place in the Galaha area of Kandy.", "The attack has not been reported in Sri Lankan media but it is circulating in the country’s social media ecosystem.", "To sum up, a video of a Muslim man attacking a person in Sri Lanka was shared to malign the Indian Muslim community. As confirmed by the police, the the perpetrator was arrested and he was mentally unstable.", "Donate Now", "Follow @free_thinker", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]