["This photo was published on Facebook on August 8, 2019 and shared more than 1,000 times.", "The Urdu-language text across the top of the image reads: “The person who placed anti-Pakistan banner in Islamabad, turns out to be president of the youth wing of Noon League in Gujranwala, Saqib Bajwa and he did it because Maryam Safdar asked him. Suspect has confessed.”", "Noon League refers to the Pakistan Muslim League-Nawaz (PML-N), the country’s main opposition party. Maryam Safdar is the daughter of former Prime Minister Nawaz Sharif. Gujranwala is city in eastern Pakistan.", "The caption references current Prime Minister Imran Khan, Sharif’s political opponent. It reads in part: “Nawaz League, you will be screwed badly, it’s beyond your imagination. @ImranKhanPTI we are with you. Bhutto may be pardon, but @MaryamNSharif people should not be forgiven.”", "Below is a screenshot of the Facebook post:", "The same photo appears alongside similar claims in other Facebook posts here, here and here, on Twitter here, and on Urdu-language news websites here and here.", "On August 6, 2019, posters appeared in Islamabad carrying a quote from Indian lawmaker Sanjay Raut advocating a policy of “Akhand Bharat”  -- or “Undivided India” -- a political philosophy that calls for neighbouring countries including Pakistan to be incorporated into Indian rule.", "Images of the banners spread on social media, for example this post on Twitter.", "The posters carried a screenshot of this tweet in romanised Hindi by Indian news agency ANI.", "Translated from romanised Hindi, the quote from Raut reads in part: \"Today we have taken Jammu and Kashmir. Tomorrow will take Balochistan and PoK\" it says, referring to Pakistani occupied Kashmir.", "Raut’s comments advocate for the Indian annexation of the portion of Kashmir administered by Pakistan, as well as the southern Pakistani province of Balochistan.", "Here is a screenshot of the poster taken from Twitter:", "Later on August 6, Islamabad deputy commissioner Muhammed Hamza Shafqaat tweeted in Urdu that authorities had arrested men for putting up the posters in the Pakistani capital.", "Translated from Urdu, his tweet says: “The banners were taken down about seven hours ago. The men have also been arrested. The printing press has also been sealed. Further investigation is underway.”", "But the two men in the photograph shared in the misleading social media posts were not arrested for erecting the posters.", "The same photo appeared in the Urdu-language daily Khabrain on August 7, 2019. It identifies the men as a clerk and a facilitator next to two officials from the Anti-Corruption Department in Punjab province.", "The men were accused of taking a 10,000 Pakistani rupee ($62) bribe and arrested in Dera Ghazi Khan, according to the report.", "Below is a screenshot of the article published in Daily Khabrain.", "Translated, the Urdu headline reads: “Clerk and facilitator arrested taking 10,000 rupees bribe. Money recovered, suspects sent to lockup.”", "Punjab Anti-Corruption Department inspector Malik Majeed confirmed to AFP by phone on August 9, 2019 that the two men were arrested on corruption charges.", "“I know the photo was misused and was taken out of context but I can confirm that the men in the picture are the clerk and his facilitator whom we have arrested after a raid in Dera Ghazi Khan.” he said.", "Below is a screenshot comparison of the photo carried in the Daily Khabrain article (L) and the misleading post (R).", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]