["On March 27, Shilpa Bodke, who describes herself as the Maharashtra Pradesh Mahila Congress Committee Social Media State Coordinator, tweeted two images with the message, “जितना आज दिहाड़ी,रेहड़ी,हाइवे पर चलते लोगो को मारकर सख्ती करी जा रही है”. She further wrote, “Had the government shown even 10% of the strict action [they unleashed upon workers] and closed airports, as warned by Rahul Gandhi, India would have been in a better state.”", "In the images, one can see two individuals with wounds on the back. The tweet has garnered more than 1,200 retweets at the time of writing the article. An archived version of this tweet can be accessed here. Bodhke has shared the post in the backdrop of the 21-day lockdown announced to tackle coronavirus infection which has left thousands of migrant labourers on the streets without modes of transportation to get home.", "Many other people on Facebook and Twitter shared the images with an identical claim.", "Fact-check", "Alt News found that these images are old and unrelated to the recent nationwide lockdown. With the help of reverse image search on Google and Yandex, we were able to trace the earliest instances of these images.", "Image 1", "The first image was published along with an article on the website “matinews.com” on December 18, 2017. This opinion piece carried a collage of photos which includes the image now viral on social media.", "Furthermore, we found a tweet by a user from March 2018. The tweet claimed that traffic police in Dhaka’s Shantinagar beat up an ordinary rickshaw puller. “The poor are being abused. Share if you have a conscience,” reads the tweet.", "The second image is close to nine months old. It was posted by a Facebook page on July 17, 2019. Hence, it is unrelated to the recent lockdown in India.", "West Bengal police had also called out this old image via its official Twitter handle on March 27, 2020. “Some pictures and video are being deliberately circulated on social media against the West Bengal administration,” said the police.", "pic.twitter.com/hsLmNhxAIZ", "— West Bengal Police (@WBPolice) March 27, 2020", "Alt News was unable to independently verify the origin and context of these mages. However, it is can be ascertained that these are unrelated to the recent nationwide lockdown because they predate the coronavirus pandemic.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]