["The screenshot was shared in this Facebook post on January 12, 2021.", "The post features an image of a purported tweet from US congresswoman Alexandria Ocasio-Cortez.", "It reads: “Congrats to President Joe Biden. Now let’s begin “The Purge” to roundup all Conservative traitors! Democrats, let’s make Auschwitz look like a picnic!”", "The image was shared in Facebook posts here, here, and here alongside a similar claim.", "The claim is false.", "A search of the text in the purported tweet on Ocasio-Cortez’s Twitter account did not locate any corresponding tweets on January 15, 2021.", "A search of Ocasio-Cortez’s record on Politwoops, a database of deleted tweets from politicians maintained by investigative journalism project ProPublica, also produced no results that matched the misleading image.", "In response to the misleading posts, Ocasio-Cortez tweeted on January 14, 2021 that she did not call for a “purge”.", "She wrote in a tweet: \"FYI there is (yet another) viral misinformation campaign going on, this time a false tweet that’s been photoshopped to look like I sent out a call for a 'purge.'", "“Unsurprisingly it’s circulating like wildfire on FB & Twitter. This is one way death threats & targeting ramp up.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]