["About this rating", "Are BANG brand energy drinks flammable? In December 2018, internet hoaxers fostered that notion by spreading videos supposedly showing people lighting the beverage on fire. Although we haven't been able to determine the exact source of these videos, a few examples of these clips can be glimpsed below:", "Y’all keep drinking them #Bang energy drinks pic.twitter.com/BKEQrc7qaa", "— ??COME SEE US ?? (@SeahawkValdez) December 17, 2018", "Although the videos may appear at first glance to show the drinks are flammable, a few red flags contained within them indicate the fiery displays are merely a hoax.", "In the first video, the clip starts with the camera focused on a can of BANG energy drink. The viewer witnesses the can being opened, but before its contents are poured onto the ground, the can disappears from view for seconds. It's likely that a second can pre-filled with a flammable liquid such as gasoline or lighter fluid was swapped in for the original can during this brief interlude.", "The second video uses an even lazier (but equally deceptive) trick. Instead of showing the viewer an unopened can of BANG before swapping it out with a second can, this clip starts with a can that was already opened before the camera even started rolling. Again, it's likely this can was filled with a flammable liquid and not BANG energy drink.", "A number of the brand's fans have posted their own \"experiments\" to YouTube in order to debunk this rumor. YouTubers Pleeka, Lil' Bones Leo, Brooke Curtis, Growing Pains, Angrytexan Green, Jesse Walker, and Dustin Orman all posted videos documenting their unsuccessful attempts to light a BANG energy drink on fire.", "We've chosen to highlight the following video from Toby Dunnagan because it shows a can of BANG energy drink being opened, poured, and held to a flame all in one continuous shot without any aspect of the claim leaving the frame:", "BANG told us in response to our query that: \"It was a hoax. The user who made the video poured lighter fluid in the can. There are multiple videos online debunking that one video.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]