["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "A white Toyota Tacoma with a bumper sticker expressing support for President-elect Joe Biden was photographed in November 2020 showing a truck bed filled with what appeared to be baskets of U.S. Postal Service mail.", "Snopes readers sent us the below image — which had been shared extensively on social media platforms like Parler, Twitter, and Facebook — and asked our team to clarify whether or not it is legal for service employees to transport federal mail in a privately-owned vehicle.", "It appeared that the photograph was initially posted by Sidney Powell, an American attorney who was distanced from the U.S. President Donald Trump's legal team in 2020 for sharing outlandish conspiracy theories related to the presidential election in an attempt to overthrow the victory of Biden.", "While it is unclear where the image originated, our team was able to determine that it is legal for some rural service deliverers to use their own vehicles when delivering mail. A guide published by the service in October 2007 required that some rural deliverers use their own vehicles. A job description for a rural carrier associate (RCA), a part-time job responsible for the delivery of all U.S. mail notably when regular carriers have scheduled days off or take vacation days. Among physically strenuous work and variable hours, the job also generally requires RCAs also have their own vehicles.", "“Generally, RCAs are required to use their own vehicles for mail delivery, and they receive an equipment allowance in addition to regular pay,” noted the guide. “The vehicle needs to be insured, dependable, and in good working condition.”", "In short, it is not illegal to transport federal mail in a privately owned vehicle. What’s more, it is not clear whether the baskets in the back of the truck contain mail at all — in particular, ballots.", "Election mail includes any item mailed to or from authorized election officials for the purpose of enabling American citizens to vote. These items can include ballots, voter registration cards, absentee voting applications, and polling place notifications. Official election mail will include the registered trademark pictured below:", "A close examination of the image allegedly capturing service mail in the back of the truck does not clearly show the official election trademark. In addition to the official logo, the service noted ballots are transported in a green container known as Tag 191, which identifies trays and sacks of ballot mail. Both of these safety mechanisms are used by election officials to help improve the visibility of ballots.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]