["The article, published here on a site called “News Break Updates”, states students walked out on Senator Risa Hontiveros after she promoted a book criticising the late Philippine dictator Ferdinand Marcos.", "Hontiveros is an opposition politician in the Philippines.", "Marcos ruled the country for 20 years before he was ousted in a 1986 “People Power” revolt; here is an encyclopedia entry about him.", "Below is a screenshot of the online report:", "The article contains three images: a photo of young people in black-and-yellow T-shirts walking along a street, one holding a megaphone; a photo of Hontiveros; and a photo of students dancing overlaid with yellow text that says: “BYE BYE RISA!”", "It has been shared in multiple Facebook posts that repeat the claims in the article, for example this one published June 25, 2019, which has been shared more than 600 times.", "This Facebook post, dated April 27, 2018, contains the same three photos and text as in the article, but does not contain a link to the web page.", "The photos are being used in a misleading context.", "Hontiveros was elected to the Senate in 2016; here is a report about her victory published at the time by Philippine news organisation ABS-CBN.", "A reverse image search on Google found the first image in the misleading article, which shows young men dressed in black, has been circulating online since 2013 – three years before Hontiveros became a senator.", "It appears in this gallery of photos from a rally against corruption, published on September 12, 2013, on the official website of the Ateneo de Manila University.", "The web page does not mention Hontiveros or Marcos. Below is a screenshot of the photo, which is the sixth image in the gallery:", "Below is a screenshot comparison of the photo in the misleading article (L) with the Ateneo website image (R):", "The other image in the misleading article appears to show a group of students dancing.", "Another reverse search on Google found the image in this September 2012 video of students from National University in Manila taking part in a dance competition.", "The YouTube video is embedded below; the same scene of students dancing appears at around the 1:26 mark:", "The YouTube video is titled “MAGNITUDE 14.0 - NATIONAL UNIVERSITY - MANILA”.", "A keyword search on Facebook found the YouTube video relates to a dance competition in 2012 called Magnitude 14.0, which was organized by backpack company Jansport and the Philippine Institute for Civil Engineers.", "Here is the competition’s Facebook page. This post, dated September 23, 2012, and this post published two days earlier, refer to the National University and contain similar photos of students in blue shirts dancing.", "The image below compares screenshots of the image in the misleading report (L) and a the screengrab from the 2012 YouTube video (R):", "National University also wrote in this Facebook post dated March 16, 2018 that the claim in the report was misleading.", "The post, embedded below, says in part: “In reference to the article that came out on social media, where National University students allegedly walked out in the middle of Sen. Risa Hontiveros’ speech, allow us to set the record straight: Sen. Hontiveros was not present and did not deliver any speech in National University last Thursday morning.", "“Furthermore, pictures that were posted related to this article were taken more than 4 years ago and were not in any way connected to any protest on any issue.”", "Hontiveros’s media relations officer Lui Belmonte told AFP over Facebook messenger on July 1, 2019:", "\"That's a recycled claim. NU also already came out with a statement about that. She has not given a speech at NU in June, not even 2019.\" NU refers to National University.", "A third reverse image search on Google traced the photo of Hontiveros in the misleading article to this report by local news site Politiko dated June 8, 2017.", "Its caption states the image was taken from Hontiveros’s Facebook account. AFP found the same photo in this post published to Facebook by Hontiveros, also on June 8, 2017.", "That post refutes a separate piece of misinformation. It is embedded below:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]