["By Angelo Fichera", "Posted on March 1, 2019", "A viral hoax claims that Sen. Bernie Sanders was arrested in 1963 for “throwing eggs” at black civil rights protesters. He was arrested while protesting on behalf of civil rights.", "A black-and-white photograph from 1963 shows a young Bernie Sanders being arrested by Chicago police officers. Wearing thick frame glasses and hunching over in apparent resistance, the future senator appears to be escorted away from a throng of people by two officers.", "That photo emerged in 2016, when the Chicago Tribune located a negative of the picture in its archives and Sanders’ 2016 presidential campaign positively identified the individual as the Vermont senator, who graduated from the University of Chicago in 1964.", "In the days since Sanders announced another run for the presidency, however, viral Facebook posts have shared the photo with a false narrative about the circumstances surrounding the arrest.", "“In 1963 Bernie Sanders was arrested for throwing eggs at black civil rights protestors,” the posts read. “This is the side of Bernie Sanders that CNN and the Fake News Media don’t want you to know.”", "That’s not what happened.", "When the Tribune reported on the photo in 2016, it also cross-referenced the known details about the photo (when and where it was shot) with a January 1964 article that reported on the dispositions of 159 people “arrested during demonstrations at four locations during which they protested alleged segregation in the city’s public schools.”", "That article identified a “Bernard Sanders, 21” who was “arrested Aug. 12 at 74th and Lowe and charged with resisting arrest.” He was found guilty and fined $25. In other words, Sanders was not arrested for harassing the demonstrators, as the Facebook posts claim. He was one of the civil rights demonstrators.", "At the university, Sanders for a time led the campus chapter of Congress of Racial Equality, or CORE. Under Sanders, according to the campus newspaper the Chicago Maroon, the organization participated in a nationwide protest of Howard Johnson restaurants for its “refusal to adopt a non-discriminatory policy in the south.”", "The arrest photo’s emergence was welcomed by Sanders’ 2016 campaign. Some had previously questioned whether another picture, from a 1962 sit-in over discrimination in the university’s housing policies, was actually of him — or of another student. But the photographer Danny Lyon, who took that photo and others of Sanders, confirmed it was the senator.", "Sanders’ college activism is something he still cites today. In a recent tweet promoting a rally in Chicago, he wrote, “My time at the University of Chicago, at the height of the Civil Rights Movement, changed my life and helped shape me into the person I am today.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Lyon, Danny. “Bernie Sanders Leads 1962 Sit-in.” BleakBeauty.com. 30 Jan 2016.", "Lyon, Danny. “More Bernie Civil Rights Photos Found!” BleakBeauty.com. 11 Feb 2016.", "Murphy, Tim. “Here’s What Bernie Sanders Actually Did in the Civil Rights Movement.” Mother Jones. 11 Feb 2016.", "Skiba, Katherine. “Arrest photo of young activist Bernie Sanders emerges from Tribune archives.” Chicago Tribune. 22 Feb 2016.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]