["Amidst the extensive media coverage of the coronavirus outbreak, two videos (viewer discretion is advised) have gone viral on social media. One of them is a 90-second video which shows pigs being torched alive and the other is a 30-second clip which shows hundreds of pig buried alive in a pit. The viral videos are shared with the claim that the Chinese government is doing this to control the coronavirus.", "On Facebook, several users have posted the 90-second video of pigs being torched with the text, “Pigs been destroyed by Chinese government to control the sickness may be Corona or any other sickness.”", "On February 4, @Promise86191693 tweeted the 30-second viral video of pigs buried alive and said, “The China government is doing everything within its power to control and totally eliminate the corona virus, millions of infected pigs were buried @realDonaldTrump @charliekirk11 @RealCandaceO @RyanAFournier @carrieksada”", "The china government is doing everything within its power to control and totally eliminate the corona virus, millions of infected pigs were buried @realDonaldTrump @charliekirk11 @RealCandaceO @RyanAFournier @carrieksada pic.twitter.com/cBWjTkVsaO", "— Promise. O , (@Promise86191693) February 4, 2020", "Alt News has received several requests to fact-check the images on WhatsApp (+91 76000 11160) and on our official mobile app.", "Alt News performed a keyword search on YouTube and found both the videos. They were uploaded last year. We did a keyframe analysis of the videos and performed a reverse image search on Yandex. This led us to news reports which included stills from the viral video. The videos have not been embedded due to their violent nature of the videos however, they have been hyperlinked for readers who wish to watch.", "The 30-second video which shows pigs being flamed was uploaded by YouTube channel ‘DK – The Seeker’ on March 31, 2019. The description reads, “After the pigs got the plague, the Chinese people are burning them all.” After a reverse-image search, Alt News found the screenshot from the viral video in a report by Amur News Service, a Russia-based news website.", "According to the report, the video was shot in China and it is linked with African Swine Fever (ASF) which was rampant in January 2019. The report added 100 cases of ASF were detected in 24 provinces.", "Video 2: Pigs being buried", "The 90-second viral video which shows pigs being buried was uploaded by YouTube channel ‘lightning TV’ on January 21, 2019. After a reverse image search, Alt News found a February 3, 2019 report by SET News, a Taiwan-based news channel. The article reports about the impact of ASF epidemic on the pork industry in China.", "Alt News performed another keyword search on Google found a fact-check report by Farmers Weekly, a UK-based magazine and website. The Farmers Weekly report verified the viral video which shows pigs being buried. According to the report, the video has been recorded as China battled an outbreak of African swine fever (ASF). The report added, “ASF was first detected in China on 3 August last year. Since then, more than 100 cases have been confirmed, resulting in the slaughter of more than 916,000 pigs, China’s ministry of agriculture and rural affairs said.”", "The two videos which have gone viral claim are indeed from China but the claim that the Chinese government is doing this to control coronavirus is false. Both videos are from 2019 when African Swine Fever was rampant in China.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]