["The issue of funding Medicare -- and specifically the viability of a voucher-like plan proposed by Rep. Paul Ryan, R-Wis. -- was front and center at the Republican debate in New Hampshire on June 14, 2011.\n\nFormer Minnesota Gov. Tim Pawlenty said he will offer a plan that differs from Ryan's.\n\n\"It will feature performance pay rather than just volume pay to hospitals and clinics and providers,\" Pawlenty said. \"It will allow Medicare to continue as an option, but it'll be priced against various other options that we're going to offer people, as well, and some other things.\"\n\nAlthough he has not released the particulars of his plan, Pawlenty said doing nothing was not an option.\n\n\"There was a recent report out that the premiums for Medicare and the payroll withholdings are only paying about half the program,\" Pawlenty said during the debate. \"So it is not financially solvent.\"\n\nLast month, we checked a similar statement from Pawlenty, who said on ABC's This Week that Medicare \"only has about 50 percent of it paid for by either premiums or payroll taxes, and the rest is deficit spending ... or debt spending.\"", "Medicare, which provides health care to about 50 million elderly or disabled Americans, is financed through a combination of funding streams: a Medicare payroll tax; general revenue (mostly from federal income taxes); premiums paid by Medicare users; and a tax on Social Security benefits and state payments toward the prescription drug benefit.", "ABC News, Video: Tim Pawlenty interviewed on This Week, May 29, 2011\n\nCenters for Medicare and Medicaid Services, 2011 Annual report of the Boards of Trustees of the Federal Hospital Insurance and Federal Supplementary Medical Insurance Trust Funds\n\nKaiser Family Foundation, \"A Primer on Medicare Financing,\" by Lisa Potetz of Health  Policy Alternatives Inc. and Juliette Cubanski of the Henry J. Kaiser Family Foundation, July 2009\n\nNPR, \"Medicare Key To Conquering Deficit Dilemma,\" by Julie Rovner, Dec. 1, 2010\n\nSocial Security Online, Status of the Social Security and Medicare Programs\n\nGovernment Accountability Office, A Citizens Guide to the 2008 Financial Report of the United States Government\n\nInterview with Lisa Potetz of the Health Policy Alternatives Inc., May 31, 2011\n\nInterview with Marilyn Moon of the American Institutes for Research, May 31, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]