["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Jaime Chase writes a personal note thanking customers on a carry out lunch box at Chase's Diner Thursday, April 23, 2020, in Chandler, Ariz. (AP/Matt York)", "Congress created the Paycheck Protection Program to help small businesses affected by the pandemic.", "Kelly criticized how the program has been administered, not the existence of the program.", "A company Kelly co-founded and in which he has investments received up to $2 million in loans from the program. Kelly’s campaign and the company say he was not involved in the application process.", "In the competitive Arizona Senate race, Republican Sen. Martha McSally is taking aim at Democratic opponent Mark Kelly, claiming that he’s a hypocrite who attacked a loan program to help businesses during the pandemic and then took money from the program for his own company.", "\"Small businesses were hit hard by the pandemic, which is why I fought\" for the Paycheck Protection Program, McSally tweeted July 31. \"Mark Kelly criticized the program, then turned around and took money for his own multi-million dollar company.\"", "Is McSally right about Kelly? Not really.", "An Arizona company that Kelly co-founded and in which he has investments did receive a loan under the Paycheck Protection Program. But Kelly’s campaign said he left the company more than a year ago and had no role in the company’s application for the coronavirus pandemic relief.", "Moreover, Kelly’s criticism of the program centered on Congress and the red tape that he said was preventing deserving small businesses in Arizona from getting aid. His public statements show that he wasn’t against the program itself.", "McSally, a former U.S. House member and retired Air Force pilot, is vying to hold on to a Senate seat she was appointed to after the resignation of Sen. John Kyl. Kelly is a retired U.S. Navy pilot and astronaut. Both easily won primary elections on Aug. 4.", "Congress created the Paycheck Protection Program to help small businesses affected by the pandemic. The program was established by the Coronavirus Aid, Relief, and Economic Security Act, or CARES Act, signed into law in March by President Donald Trump.", "The law allows businesses to get loans to pay their employees and to cover certain other expenses, such as rent and utilities. The loans are forgiven if businesses meet specified terms.", "While the federal government created and administers the program, banks, credit unions and other lending institutions handle the loan applications and disbursement of funds.", "McSally’s campaign said Kelly criticized the program in an April 10 statement and a June 9 tweet. In his messages, Kelly directed his criticism at Congress — saying it should hold banks accountable for ensuring that small businesses can get aid. His criticism centered on how the program was being administered.", "\"I’ve heard over and over from small businesses across Arizona that the clock is ticking for them, and now it’s clear many of them are running into a wall of red tape blocking them from the aid they desperately need,\" Kelly’s statement said. \"Congress created this program and put much of the application process in the hands of big banks, and they have to provide accountability and make sure this money is getting to those small business owners and their employees who need it.\"", "In an April 16 statement, not flagged by McSally’s campaign, Kelly said the program was running out of money, that only 10% of Arizona small businesses were approved for relief and that the Senate was adjourning without addressing the issue.", "\"Washington needs to get out of its own way, immediately put more resources into this program, and fix some of the issues that have made it harder for Arizona small businesses to get this relief,\" Kelly said.", "Big banks, Kelly said, had the power to choose which applications got priority \"and that’s not how this should work. This money should go where it’s needed most. Congress needs to get this done.\"", "McSally on April 21 tweeted a similar grievance. \"Dear big banks: PPP is NOT your money. It is the taxpayers’ money intended to be a lifeline for small businesses & to keep them from going under due to coronavirus. We expected everyone in America, including you, to act with grace & speed to rescue those most hurt by this crisis.\"", "In a follow-up tweet, McSally said she was troubled by reports of publicly traded companies with \"capital & bank relationships\" getting funds, \"while many ma & pa shops can't even get a call back or $1.\" The next round of funds had to focus on small businesses, with better oversight and transparency, she said.", "McSally’s attack on Kelly refers to a loan received by a company Kelly co-founded.", "World View Enterprises, of Tucson, says it provides aerial data and analytics from sensors deployed to the stratosphere. Kelly’s stake in the company is valued at between $115,000 and $300,000, Kelly’s campaign told PolitiFact. But he left his role as strategic adviser in February 2019 and has never been a member of the company’s board of directors, said Jacob Peters, a spokesperson for Kelly.", "World View also told PolitiFact in a statement that Kelly was an investor but had no day-to-day involvement with the company.", "In late April, World View was approved for a loan to retain 38 employees. The loan was for an amount between $1 million and $2 million, according to Small Business Administration data.", "Kelly was not informed about World View’s loan application, \"nor was he involved in the decision process to decide to pursue a PPP loan,\" the company said.", "McSally’s campaign did not provide information to dispute the Kelly campaign’s explanation. PolitiFact did not find information showing Kelly was involved in the application process.", "McSally said Kelly, \"criticized the (Paycheck Protection Program), then turned around and took money for his own multi-million dollar company.\"", "Kelly has criticized the way the program has been administered, but not the existence of the program itself. He’s argued that red tape is preventing small businesses from getting funds and that Congress needs to do more to help businesses get the funds and to hold banks accountable.", "A company that Kelly co-founded and in which he has investments received up to $2 million in a loan from the program. But Kelly’s campaign and the company say he was not involved in the application process. McSally’s campaign did not provide information disputing that statement and we didn’t find any either.", "McSally’s statement contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Email interview, Caroline Anderegg, a spokesperson for Sen. Martha McSally’s campaign, Aug. 3, 2020", "Email interview, Jacob Peters, a spokesperson for Mark Kelly’s campaign, Aug. 3-4, 2020", "Email interview, World View Enterprises press office, Aug. 3, 2020", "Twitter, @MarthaMcSally tweet, July 31, 2020", "Twitter, @SenMcSally tweet, tweet, April 21, 2020", "Twitter, @CaptMarkKelly tweet, June 9, 2020", "U.S. Treasury Department, The CARES Act Provides Assistance to Small Businesses", "U.S. Treasury Department, Frequently Asked Questions (FAQs) on PPP Loan Forgiveness, as of Aug. 4, 2020", "MarkKelly.com, Mark Kelly Statement on Issues with Small Business Loans, April 10, 2020; Mark Kelly on Paycheck Protection Program running out of money, April 16, 2020", "U.S. Small Business Administration, SBA and Treasury Announce Release of PPP Loan Data, July 6, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]