["By D'Angelo Gore", "Posted on April 27, 2018", "West Virginia Attorney General Patrick Morrisey, a Republican candidate for the U.S. Senate, voted for Donald Trump at the Republican National Convention in 2016. He voted for Trump in the Electoral College, too.", "Still, a TV ad attacking Morrisey falsely says that he “betrayed Donald Trump,” “denying” West Virginians “our choice for president,” and “refused to support Trump over Hillary.”", "Morrisey has admitted that Trump was not his first choice to be the Republican nominee for president. He also went into the convention as one of three delegates from West Virginia who were not committed to any of the Republican candidates. In the end, Morrisey cast his vote for Trump to be the nominee, as did the rest of the state’s delegation.", "Also, contrary to what the ad claims, Morrisey did back Trump in the general election against Hillary Clinton, the Democratic presidential nominee. In at least one radio interview, he said he was “very comfortable” choosing Trump “because I think Hillary Clinton would mean bad things for the country, disastrous things for West Virginia.”", "The 15-second attack ad is sponsored by the U.S. Senate campaign of Rep. Evan Jenkins. He and Morrisey are competing against four other Republicans in the May 8 primary. The victor will face the winner of the Democratic primary, where Paula Jean Swearengin is challenging incumbent Sen. Joe Manchin.", "The ad’s narrator starts by saying “Pat Morrisey betrayed Donald Trump, scheming against Trump’s campaign in West Virginia” and “denying our choice for president.”", "A graphic shown on the screen says this about Morrisey: “Said he would not … support the Republican … candidate who gets the most votes.” That’s attributed to an April 14, 2016, article by West Virginia’s MetroNews.", "The quote is not accurate, though. What the article really said was: “If elected, Morrisey said he — as a delegate — would not necessarily support the Republican presidential candidate who gets the most votes in West Virginia automatically.”", "The MetroNews then quoted Morrisey saying that both Trump and Sen. Ted Cruz, who also competed for the GOP nomination, had messages that appealed to voters in West Virginia.", "And the same article noted that Morrisey said: “When you run unaffiliated, you have the ability to make a seasoned judgment choice. … But I certainly care deeply about how West Virginians think about these issues.”", "Those statements were all made before Trump won West Virginia’s GOP primary on May 10, 2016, with 77 percent of the vote.", "The Jenkins campaign has emphasized that Morrisey neglected to publicly support Trump by name before casting his vote at the convention in July 2016.", "“Morrisey repeatedly and explicitly reiterated that if elected as an RNC delegate, he would make his own ‘judgment choice’ about whom to vote for at the convention, rather than vote for the candidate who won West Virginia’s primary,” Jenkins spokesman Andre Seré wrote in an email to FactCheck.org.", "“He said this as late as mid-April when Trump was considered a shoo-in to win West Virginia’s primary,” Seré said. “This was a clear denial of the will of WV primary voters.”", "Morrisey may not have pledged his support to Trump before the convention, but he cast his vote for him to be the nominee nonetheless. That means that West Virginia Republicans weren’t denied their choice.", "The ad is also wrong when it says “Morrisey refused to support Trump over Hillary.”", "Graphics that appear on screen say that “Morrisey chose not to endorse Trump,” and “opposed Trump’s candidacy.” But neither quote refers to the general election.", "The first quote is attributed to a March 5, 2017, Washington Examiner article that refers to the primary election, and the second quote comes from a “fact check” on a website paid for by the campaign of former coal executive Don Blakenship, who is also running against Morrisey and Jenkins in West Virginia’s Republican Senate primary. The post on that site claims that Morrisey “opposed Trump’s candidacy” because he “refused to endorse Trump” during the run-up to the GOP convention.", "In addition, the ad’s image of Morrisey and Clinton seemingly shaking hands appears to be a fake. We couldn’t find it by doing an internet search, and Seré, the Jenkins campaign spokesman, said that he “couldn’t confirm the original sources” of the image, either.", "“[J]ust as Morrisey’s campaign and his super PAC do in each of their ads portraying Evan with Hillary, Obama, Pelosi, etc., we sometimes take creative license while arranging images in order to help make a substantive point,” he admitted. The Morrisey campaign has used side-by-side images of high-profile Democrats and Jenkins in digital ads.", "But the reality is that Morrisey said prior to Election Day that he was committed to supporting Trump against Clinton.", "At the start of the Republican convention, a July 17, 2017, article in The Journal of Martinsburg, West Virginia, quoted Morrisey saying: “I intend to support the nominee, because electing Hillary Clinton would be devastating for West Virginia. I look forward to supporting the team to defeat Hillary Clinton in November.”", "And on the next-to-last day of the convention, a July 20, 2016, MetroNews article quoted Morrisey saying that he would back Trump over Clinton and could not understand “how any public official in West Virginia can strongly get behind Hillary Clinton if they care about the West Virginia economy.”", "“[Trump] was not my first choice in the primary,” Morrisey told MetroNews. “But I am very comfortable with that choice between Hillary Clinton and Trump because I think Hillary Clinton would mean bad things for the country, disastrous things for West Virginia.”", "Furthermore, Morrisey told the Associated Press in December 2016 that he voted for Trump in the general election. He was also one of West Virginia’s five electors who voted for Trump in the Electoral College, as well.", "As Morrisey said, Trump was not his first choice in the Republican presidential primary — so Jenkins is fair to pursue that line of attack. But it’s inaccurate to say that Morrisey “refused to support Trump over Hillary.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]