["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Income disparity is a big deal in Nevada. State unemployment remains higher than the national average at 6.4 percent, and new income growth goes almost entirely to the top 1 percent of Nevadans.", "So maybe it’s no surprise that Hillary Clinton is blanketing Nevada with numerous television ads ahead of the Feb. 20 primaries.", "One ad promises to tackle the \"wage gap\" and has aired more than 650 times in the state, according to the Political TV Ad Archive.", "\"On average it takes 300 Americans working for a solid year to make as much money as one top CEO,\" the ad’s narrator says. \"It’s called the ‘wage gap,’ and the Republicans will make it worse by lowering taxes for those at the top and letting corporations write their own rules.\"", "The opening statement of the ad is similar to other statements we’ve fact-checked on the vast chasm in pay between the average worker and top executives. We thought it merited a fresh look.", "Reports from left-leaning think tanks reaffirm Clinton’s claim. A 2015 study from the Economic Policy Institute found that CEOs from 350 top firms make an average of $16.3 million a year, including stock options and other forms of compensation.", "That averages out to about 303 times the pay of an \"average worker,\" which matches up with Clinton’s ad.", "Other pro-worker sources support this claim. Labor giant AFL-CIO issues an annual \"Executive Paywatch\" report, which highlights the disparity between low-income workers and well-compensated CEOs. Its 2014 report says the CEO-to-worker pay ratio was 373 to 1.", "University of Nevada, Reno economics professor Elliott Parker agreed with the studies and said in an email that the number cited by Clinton was \"in the ballpark.\"", "It’s worth noting that variances in the studies are due to the fact that different groups use different metrics and methods to crunch the numbers. PolitiFact Virginia previously addressed this issue and found that there’s no standard formula for determining salary and compensation for both average workers and CEOs. This makes it hard to accurately compare the data.", "Right-leaning groups have poked holes in the numbers. American Enterprise Institute economist Mark Perry takes issue with the methodology behind the AFL-CIO study and called it \"bogus/exaggerated/distorted\" in an email.", "He says the AFL-CIO analysis makes misleading comparisons and cherry-picks data in order to make the wage gap look as high as possible. Perry says limiting the data to the top 350 companies isn’t representative for the majority of workers, and that CEOs at those highly-valued companies should be duly compensated.", "\"The value of Apple stock ($521 billion) is more than the value of the entire stock market in Brazil,\" he wrote in an email. \"If Tim Cook makes 300 times more than a plumber in Kansas, so what?\"", "Part of the difficulty is that there’s no way to accurately gauge the average salary for workers at the companies headed by the 350 \"top CEOs.\"", "These variances in crunching the numbers may soon be resolved. Part of the 2010 Dodd-Frank financial reform bill requires public companies to disclose CEO and median worker compensation, and takes effect in 2017.", "Our ruling", "Clinton’s ad states that \"it takes 300 Americans working for a solid year to make as much money as one top CEO.\"", "There’s no standard metric used to measure income disparity, but Clinton’s ad seems to land on the safe side of many recent studies. Clinton hedges by sticking to a smaller number, but there are still imperfections in the methodology.", "We rate her statement Mostly True.", "Email interview, Mark Perry, University of Michigan, Flint, Feb. 10", "Email interview, Elliott Parker, University of Nevada Economics Professor, Feb. 3", "AFL-CIO website, \"Executive Paywatch: High-Paid CEOs and the Low-Wage Economy,\" Accessed Feb. 9", "Blog post, \"Top CEOs Make 300 Times More than Typical Workers,\" Lawrence Mishel and Alyssa Davis, Economic Policy Institute, June 21, 2015", "Blog post, \"Lots of problems with AFL-CIO’s ‘CEO-to-worker pay’ analysis including small sample size and using part-time worker pay,\" Mark J. Perry, American Enterprise Institute, May 16, 2015.", "PolitiFact, \"Jim Webb says CEOs make 350 times more than workers,\" Oct. 19, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]