["The photograph shows a barefoot man surrounded by a group in uniform. It was published in this Facebook post on March 23, 2020, and has since been viewed nearly 350,000 times in Liberia and Nigeria, according to data provided by Facebook.", "The post alleges that pastors were beaten in Liberia’s capital Monrovia and their churches shut as part of restrictions to contain the spread of coronavirus.", "“This was a clear diabolical, satanic, demonic, and Antichrist attempt. It's also a highest degree of treachery, conspiracy and betrayal (like Juda Iscarot did to our Lord) of the local grassroot churches by our so-called spiritual leaders and some members of the council of churches of Liberia (sic),” the post reads.", "“Despite of the 5000 deaths, threats, fears, and truma caused by Ebola in 2014, President Sirleaf did not closed any worship center, but she asked them for persistent prayers because she knew better (sic).”", "Ellen Johnson Sirleaf is Liberia’s former president and Africa’s first woman elected head of state who presided over the 2014-16 Ebola crisis during which more than 4,000 Liberians died. Since the outbreak of the coronavirus pandemic late last year, Liberia has recorded 10 cases of the virus as of April 5, 2020.", "Although no agreement on suspending church activities was reached when Liberian President George Weah met with members of the Liberia Council Churches (LCC) on March 20, 2020, the country's health ministry declared a national health emergency the next day as part of the measures to contain the spread of coronavirus.", "Health Minister Wilhelmina Jallah said several rules would apply in Liberia's infected areas -- Montserrado and Margibi counties -- including the closure of churches, mosques, and other religious centres, for a period of at least 21 days from March 21, 2020.", "“On Sunday morning, March 22, 2020, armed police were seen at many churches enforcing a mandate from the Minister of Health ordering the immediate closure of churches. As a result of the police action, many services were disrupted. This was amazing and shocking!” LCC said in a statement.", "While the claim about police enforcement appears to have some merit, the picture used in the post has nothing to do with COVID-19 nor does it depict a pastor. It was snapped by AFP photographer Zoom Dosso on September 7, 2006, and shows Liberia's national police force arresting a former combatant in the capital Monrovia.", "A reverse image search on Yandex found that the AFP photo was published on the website of photo news agency Getty Images.", "“Armed robberies, hijackings, killings and rapes by Liberia's former combatants -- notorious for their brutality during a 14-year civil war -- have rekindled old memories, terrorising residents here under the eyes of the government and thousands of UN peacekeepers,” the caption of the original photo partly reads. “For several months armed gangs have raided homes at night robbing residents around Monrovia of cash, food and other valuables.”", "COVID-19 was first confirmed in the Chinese city of Wuhan in December 2019, but the virus has spread globally, infecting more than 1.3 million worldwide and killing more than 75,000 people.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]