["On Wednesday, supporters of President Donald Trump stormed the U.S. Capitol while members of the House and Senate met inside to certify the results of the presidential contest.", "Vice President Mike Pence was also at the Capitol to preside over theelectoral vote proceedings. Shortly after rioters breached the building, Phil Godlewski took to Facebook to claim that Pence had been arrested.", "\"Multiple reports of Mike Pence being arrested,\" he wrote. Godlewski has not responded to a request from USA TODAY for comment.", "Fact check:Images falsely claim to show this week's pro-Trump demonstrations", "In reality, Pence was not arrested amid the chaos Wednesday.", "Around 2 p.m., the first rioters entered the Capitol. Soon after, Pence and other officials were moved out of the Senate chamber and taken to a secure location, per USA TODAY.", "At 3:35 p.m., Pence took to Twitter to call on rioters to leave the Capitol.", "Around 6 p.m., the Capitol sergeant at arms announced that the building was secure.", "At 7:12 p.m., Devin O’Malley, a spokesperson for Pence, provided an update on the vice president on Twitter, noting that he had returned to the Senate chamber and \"never left the Capitol.\"", "Around 8 p.m., Pence resumed his role presiding over the joint session, calling it \"a dark day in the history of the United States Capitol.\"", "\"We condemn the violence that took place here in the strongest possible terms. We grieve the loss of life in these hallowed halls as well as those injured in our Capitol today,\" he said.", "Fact check:San Francisco pro-Trump rally photo passed off as DC protest image", "Based on our research, the claim that Vice President Mike Pence was arrested on Wednesday is FALSE. In reality, around 2 p.m., he was moved from the Senate chamber to a secure location, and returned to the Senate around 7 p.m. He was on Twitter in the interim.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]