["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Protesters gather outside the Wisconsin state Capitol in Madison on April 24, 2020, demanding Gov. Tony Evers reopen the state amid the coronavirus pandemic. (Photo by Rick Wood/MJS)", "Lawmakers in Minnesota, Michigan and Illinois have passed more COVID-19 legislation than Wisconsin’s GOP-controlled legislature.", "That said, some safety precautions in those states came about through executive orders by the governors.", "Wisconsin’s response to the coronavirus outbreak is under a microscope as cases surge and Republicans and Democrats continue to clash over what -- if anything -- to do about the increase.", "Tensions boiled over July 30, 2020 after Democratic Gov. Tony Evers issued a statewide face mask mandate, despite opposition from Republicans who contend the move amounts to government overreach.", "In the days before that, though, the state Senate’s Democratic Committee turned its frustration toward Republican lawmakers.", "\"While neighboring states like Minnesota, Illinois and Michigan have already implemented safety precautions like requiring individuals to wear masks, similar pleas in Wisconsin have fallen on deaf ears of Republican legislators,\" stated a July 24 news release.", "Lawmakers in those states have passed more COVID-19-related bills than Wisconsin’s Republican-controlled Legislature since the pandemic began. But some precautions, like a mask mandate, came from executive orders and not legislation.", "How does the committee’s claim stack up?", "Eric LaGesse, executive director of the Senate’s Democratic committee, did not respond to PolitiFact Wisconsin’s request for evidence to back up their claim. But the claim is pretty straightforward, and there has been a lot of news coverage of the state’s response to the pandemic. Here’s a recap:", "In March, Evers and Health Services Secretary Andrea Palm issued a series of orders to curb large gatherings as COVID-19 began to emerge in Wisconsin. Those actions culminated in a stay-at-home order on March 24, 2020, which shut down the state to help contain the virus’ spread.", "In April, lawmakers passed a coronavirus relief package that allowed the state to tap into extra federal Medicaid dollars and suspended a one-week waiting period for collecting unemployment benefits, among other provisions. However, the state lost $25 million in federal funding for unemployment because Republican leaders waited too long to schedule a floor session on the relief package.", "Evers’ administration extended the stay-at-home order on April 16 and four days later unveiled the Badger Bounce Back plan, which provided a phased approach for reopening based on testing and other public health criteria. In May, acting on a lawsuit from state GOP leaders, the state Supreme Court struck down much of the order and allowed the state to reopen without any protocols in place.", "After that, not much happened at the state level until the mask mandate despite a recent surge in infections and multiple daily increases of over 1,000 cases.", "Lawmakers have introduced 10 bills related to the pandemic in recent months, the Milwaukee Journal Sentinel reported. The relief package we mentioned earlier is the only one that’s passed.", "The Democratic committee argued neighboring states -- specifically Illinois, Minnesota and Michigan -- have implemented more safety precautions for their residents.", "According to a database maintained by the National Conference of State Legislatures, Minnesota enacted 25 pieces of legislation related to COVID-19 through July 23 after lawmakers introduced over 200 measures. Illinois has passed 18, and Michigan approved 19. The bills touch on a wide range of issues, from COVID-19 testing to election procedures.", "The differences between Wisconsin and its neighbors can’t be blamed on partisan gridlock, either. While Democrats control Illinois’ state government, Minnesota’s legislature is split between both parties with a Democrat in the governor’s office. Michigan, like Wisconsin, has a Democratic governor and a Republican-controlled legislature.", "It’s worth noting, though, that some of the precautions in other states came about through executive orders by their governors, not action by the legislature. Illinois Gov. J.B. Pritzer, for example, issued an order on June 26 requiring residents to wear face coverings -- over a month before Evers enacted a mask mandate in Wisconsin.", "Governors in other states also enacted stay-at-home orders similar to what Evers implemented.", "Wisconsin’s state Senate Democratic Committee claimed Republican lawmakers have failed to act while \"neighboring states like Minnesota, Illinois and Michigan have already implemented safety precautions like requiring individuals to wear masks.\"", "It’s clear that Wisconsin lawmakers are behind the curve on COVID-19 compared to neighboring legislatures. Legislative bodies in Minnesota, Illinois and Michigan have introduced and passed more bills since the pandemic began.", "But they didn’t act alone, and safety precautions like mask mandates were ordered by their governors.", "That leaves us with a statement that’s accurate but needs clarification or additional information.", "We rate this claim Mostly True.", "Governor Tony Evers, executive orders, accessed July 29, 2020.", "Milwaukee Journal Sentinel, Gov. Tony Evers signs Wisconsin coronavirus relief bill, though there is criticism of how it treats first responders, April 15, 2020.", "Milwaukee Journal Sentinel, Wisconsin lost out on $25M in federal funding because GOP lawmakers waited to pass coronavirus relief bill, May 7, 2020.", "Milwaukee Journal Sentinel, Wisconsin Supreme Court strikes down Wisconsin's stay-at-home order that closed businesses to limit spread of coronavirus, May 13, 2020.", "Milwaukee Journal Sentinel, Some Wisconsin counties and cities have continued or started new stay-at-home orders, but others have been rescinded, May 13, 2020.", "Milwaukee Journal Sentinel, Past Wisconsin governors see government leaders absent in pandemic, July 28, 2020.", "Milwaukee Journal Sentinel, Here are the cities and counties in Wisconsin that have issued policies requiring people to wear a mask in public spaces, July 15, 2020.", "National Conference of State Legislatures, COVID-19 legislation, accessed July 30, 2020.", "State of Illinois, Executive Order 2020-43, June 26, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]