["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump’s sexually explicit remarks on the Access Hollywood tape that surfaced during the 2016 election have received fresh scrutiny as the country reckons with a tidal wave of high-profile sexual assault allegations.", "With recent misconduct allegations leading a number of prominent men in Hollywood, the media and politics to step down, some Democratic lawmakers have pointed to Trump’s remarks and multiple allegations against him as grounds for his resignation.", "But in calling for Trump’s White House exit, Sen. Bernie Sanders, I-Vt., misstated Trump’s response to the controversial recording.", "\"We have the absurdity now of a president of the United States who basically says, on a tape that everybody in this country has seen, his pride in a sense, in assaulting women,\" Sanders said Dec. 10 on NBC’s Meet the Press. \"And he has not apologized for that and he has not offered his resignation.\"", "As anybody who closely followed this chapter of the 2016 election recalls, Trump did apologize after the tape came to light.", "Trump’s campaign initially issued a one-paragraph press release that made reference to former President Bill Clinton, before apologizing \"if anyone was offended.\"", "\"This was locker room banter, a private conversation that took place many years ago,\" the Oct. 7, 2016, press release reads. \"Bill Clinton has said far worse to me on the golf course - not even close. I apologize if anyone was offended.\"", "Trump issued a more expansive video response the next day, expressing regret for the his comments.", "\"I’ve never said I’m a perfect person, nor pretended to be someone that I’m not. I’ve said and done things I regret, and the words released today on this more than a decade-old video are one of them. Anyone who knows me, know these words don’t reflect who I am. I said it, I was wrong, and I apologize,\" Trump said, before making another reference to former president Clinton.", "Finally, Trump again apologized during his Oct. 9 debate with Democratic presidential nominee Hillary Clinton.", "\"This was locker room talk. I am not proud of it. I apologize to my family, I apologize to the American people,\" Trump said. \"Certainly, I am not proud of it. But this is locker room talk.\"", "Sanders said Trump he \"has not apologized\" for his comments on the Access Hollywood tape.", "Trump in fact apologized multiple times for what he characterized as \"locker room talk.\"", "We rate this claim False.", "Donald Trump campaign press release, Oct. 7, 2016", "Donald Trump’s videotaped apology, Oct. 8, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]