["Wisconsin Gov. Scott Walker addresses conservatives at the CPAC conference on March 16, 2013", "In his March 16, 2013 speech at the Conservative Political Action Conference, Gov. Scott Walker criticized the way Wisconsin cut education funding before he took office.", "In blaming union rules and former Democratic Gov. Jim Doyle for the layoff of an award-winning young English teacher in Milwaukee Public Schools, Walker explained:", "\"You see, under my predecessor, they cut funding for education, but they didn't give them anything in return to make up for that. So what happened? When you have less money in those situations, even though she was named one of the best teachers in the state in her profession, what happened to her?\"", "Walker answered his own question:", "\"She was one of the first to be laid off. Why? Because under the old system of collective bargaining, one of the last hires is the first fired.\"", "We wondered about Walker’s claim that under Doyle, Democrats cut school funding but didn’t give districts \"anything in return to make up for that,\" resulting in \"less money\" for local districts such as MPS.", "Some background first.", "It may not have been well known to Walker’s audience, but as PolitiFact Wisconsin found, Walker and legislative Republicans enacted the biggest cuts to education in state history in his first budget.", "But Walker’s 2011-’13 budget also allowed many, but not all, school districts to at least partially offset the impact of those cuts by taking advantage of the union limits in his budget.", "Specifically, they could impose -- rather than attempt to negotiate -- greater cost-sharing from school employees for health insurance and pension benefits. The collective-bargaining curbs also ended protection for seniority, which partly explains the MPS layoff story Walker related.", "That freedom to cut costs is the something \"in return\" that Walker’s speech said Doyle did not provide.", "So let’s look at both the cost and revenue side of the equation as we judge Walker’s claim that Doyle cut school funding and did it in a way that didn’t give local school districts any way to make up for the lost aid.", "Reductions in state aid", "Let’s take the easy part first.", "It’s less well known, but still a fact, that Doyle -- facing a budget shortfall during the Great Recession -- cut state aid to schools in his final budget (2009-’11). The cut was about 3 percent in the first year of that Doyle plan, while in the second year school aids were basically flat.", "For the record, Walker’s cut was deeper, about 8 percent in year one of his 2011-’13 budget, followed by a 1 percent increase in year two.", "But state aid is just one of the big revenue streams for schools. The other is local property taxes. The state regulates how much state aid and property tax school districts can raise, in combination, by limiting the annual increase in the \"revenue limit\" for each district.", "That brings us to the guts of Walker’s claim.", "Doyle, while cutting state school aid, let the \"revenue limit\" rise.", "\"Districts were allowed to replace the lost aid with additional property taxes,\" noted Dale Knapp, research director at the Wisconsin Taxpayers Alliance.", "So Doyle, contrary to Walker’s claim, did offer something \"in return\" to districts -- though not every district might have been able or willing to levy enough new taxes to cover the difference.", "To be sure, Walker doesn’t think much of that approach.", "Walker took the opposite tack. He not only declined to raise the revenue limits, he actually reduced the amount districts could take in between taxes and state aid combined.", "The effect was property tax relief -- there was a small decline statewide in property taxes levied for schools in Walker’s first two years, compared with annual increases of 6 percent and 3 percent in Doyle’s last two years, state figures show.", "Less money for districts?", "The second major element of Walker’s claim was his suggestion that Doyle’s approach resulted in \"less money\" for districts, thereby forcing teacher layoffs.", "That’s off base on the revenue side, because while districts got less state money under Doyle, they could raise more local funds. Some even increased their spending because Doyle allowed them to raise more in property taxes.", "But there’s some truth to Walker’s phrasing if you look at the cost side of the money equation.", "Doyle’s last budget actually throttled back how large a property tax increase local districts could approve.", "So the effect was that districts could not raise taxes as much as they may have planned. And lacking the freedom that Walker would later give them, districts couldn’t cut benefits unilaterally to cover the difference because labor contracts were still in place.", "In some districts, MPS being one of them, they had to turn to staff cuts in the final year of the Doyle budget. The revenue cap, as well as growing costs and declining enrollment, contributed to the need for layoffs, MPS spokesman Tony Tagliavia said.", "We should note that Walker’s approach also led to staff reductions, including layoffs, and the cumulative reductions statewide were steeper in Walker’s first year than in Doyle’s last.", "Our rating", "Walker contended that under his Democratic predecessor, school funding was cut but the state didn’t give school districts \"anything in return to make up for that.\" That, he said, resulted in \"less money\" for local districts.", "This is a mixed bag. Aid was cut by Doyle, and Doyle’s slowing of overall revenue growth by districts did squeeze some and force layoffs. But it’s not true that Doyle gave districts no way to address shortfalls; unlike Walker he allowed local property taxes to rise.", "On balance, we rate Walker’s statement Half True.", "Gov. Scott Walker, speech at CPAC, partial transcript and video, March 16, 2013", "Milwaukee Journal Sentinel, \"DPI releases school staffing data,\"April 18, 2012", "Wisconsin Legislative Fiscal Bureau, Informational Paper #24, \"State Aid to School Districts,\" January 2013", "Interview with Dale Knapp, research director, Wisconsin Taxpayers Alliance, March 19, 2013", "Data on school revenue limit changes, 2009-2013, Wisconsin Department of Public Instruction, prepared March 20, 2013", "PolitiFact Wisconsin, \"Behind the Rhetoric: How Walker’s union limits affected school budgets,\"May 19, 2012", "Milwaukee Journal Sentinel, \"Seniority system cuts fresh MPS teachers amid budget crunch,\"June 14, 2010", "Milwaukee Journal Sentinel, \"MPS budget would eliminate 260 teaching positions,\"April 29, 2010", "Wisconsin Taxpayers Alliance, reportson school budget cuts, accessed March 19, 2013", "Interview with Dan Rossmiller, Wisconsin Association of School Boards, government relations director, March 20, 2013", "Interview with John Johnson, director, Education Information Services, Wisconsin Department of Public Instruction, March 20, 2013", "Email exchange with Nicole Tieman, Walker 2014 campaign spokeswoman, March 20, 2013", "Interview with Tony Tagliavia, media manager, Milwaukee Public Schools, March 20, 2013", "Interview with Miles Turner, executive director, Wisconsin Association of School District Administrators, March 20, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]