["When The Globe and Mail, one of Canada’s top newspapers, was late to reach certain kiosks in Ottawa and Quebec on Saturday, October 5, several online sources began to attribute the cause of the delay to a gag order from Trudeau’s office aimed at suppressing a sex scandal involving the prime minister and a former student.", "The Buffalo Chronicle, a US based online media known to peddle fabricated stories involving Canadian politics, went on to assert that The Globe story on the hypothetical Trudeau scandal never made it to press because of pressure on the investigation’s main source.", "Together, the two articles were shared more than 10,000 times, according to CrowdTangle, a social media monitering tool.", "The claim that an injunction prevented The Globe from going to press on Saturday is false. Lanna Crucefix, communications manager for the newspaper, told AFP in an email that “there is no injunction against The Globe.”", "She specified that “the Globe had technical press delays in the Montreal area plant,” which prints The Globe for the Ottawa and Quebec markets.", "Patricia Lemoine, a spokesperson for Transcontinental, the company in charge of printing The Globe in those areas, confirmed to AFP in an email that “there was indeed technical breakage in our Transcontinental Transmag plant in Anjou,” a Montreal borough on the city’s eastern end.", "Lemoine confirmed that the technical failure occurred during the night of Friday October 4 to Saturday October 5, and that it was the cause of The Globe’s publication delay in the areas it services on October 5.", "On Twitter, several photos show that The Globe did reach newsstands on time in other parts of the country. Some readers called out the rumour of an injunction as false, posting piles of newspaper as proof.", "No evidence supports claims of a sex scandal involving Trudeau during his time as a teacher at West Point Grey Academy, a private school in Vancouver where the prime minister worked in the early 2000-2001.", "At a campaign meeting on the morning of October 4 in Quebec City, Globe journalist Marieke Walsh asked Trudeau about “unfounded rumours” regarding his departure from his teaching position in 2001. Trudeau, who is seeking re-election on October 21, replied that he had simply “moved on” from the teaching job. Pressed by Walsh about whether he signed a non-disclosure agreement with the school, Trudeau said no.", "Later that day, Warren Kinsella, a columnist at the Toronto Sun, a tabloid newspaper, began to indirectly suggest on Twitter that the Globe’s October 5 edition may reveal the reason of Trudeau’s departure from his teaching position. A few hours later, blogger James DiFiore suggested that Trudeau was fired from West Point Grey Academy for sleeping with a student, without mentioning sources or proof.", "When The Globe’s Saturday edition did not reveal anything related to Trudeau’s time as a teacher, several Twitter accounts and Facebook pages suggested the absence of a sex scandal in the paper’s pages was due to an injunction from the government, inferences which Kinsella encouraged on Twitter. These social media posts were shared thousands of times.", "The still-unfounded rumour culminated with a press release sent to journalist on Monday, October 7 by the Conservative Party of Canada, in which the party demands to know the reasons of Trudeau’s departure from the school in 2001, without mentioning any scandal.", "An October 4 tweet revealing an email from Clive Austin, the West Point Grey Academy principal the year Trudeau left the school, states that Trudeau left the private school in order to eventually return to Montreal to pursue his university studies, and parted on good terms with the school administration.", "For at least two weeks on the campaign, we’ve been hearing murmurs about this, culminating in colleague @MariekeWalsh asking Justin Trudeau a question today. Now, a statement from the former headmaster at the Vancouver private school where Trudeau taught. #elxn43 pic.twitter.com/oi5zvtrBvA", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]