["“The Dominion Voting System is intentionally and purposefully designed with inherent errors to create systemic fraud and influence election results,” says the December 13, 2020 report filed as part of the case.", "Outlets Newsmax, Epoch Times and Gateway Pundit legitimized and spread the false claims, and social media users shared the report findings as fact here and here.", "The report cites a “significant and fatal error rate” of more than 68 percent, claiming that Dominion Voting Systems “intentionally generates an enormously high number of ballot errors,” leading to “bulk adjudication of ballots with no oversight, no transparency, and no audit trail.”", "In November, articles shared thousands of times on social media claimed that an Antrim County reporting mistake -- which temporarily misattributed Donald Trump votes to president-elect Joe Biden -- posed a systemic risk to dozens of counties in the battleground state.", "The Michigan secretary of state’s office published a notice explaining that the glitch resulted from a user error, not a software problem, and that it did not affect the election results or other counties or states.", "Michigan went blue in 2020, adding its 16 electoral votes to Biden’s total, but Trump overwhelmingly won Antrim county.", "Michigan Secretary of State Jocelyn Benson and Attorney General Dana Nessel released a joint statement addressing the claims in the December report.", "They agreed to release the audit “in order to demonstrate the ‘report’ is actually another in a long stream of misguided, vague and dubious assertions designed to erode public confidence in the November presidential election,” their statement said.", "Benson said: “There continues to be no evidence of widespread fraud, as affirmed by state and federal agencies including Attorney General William Barr, the Federal Bureau of Investigation, and the Cybersecurity and Infrastructure Security Agency.", "“If the Trump campaign had any actual evidence of wrongdoing -- or genuine suspicion thereof -- they could have requested a hand recount of every ballot in the state. They did not, instead choosing to allow shadowy organizations claiming expertise to throw around baseless claims of fraud in an effort to mislead American voters and undermine the integrity of the election,” she said.", "“Their actions are a corruption of the courts and the rule of law, as the release of today’s report clearly demonstrates.”", "Nessel added: “Oftentimes, a party will hire an expert witness to support the conclusion that the party wants or needs to reach. It’s why we give the other parties in a lawsuit a chance to depose the expert and challenge their qualifications in court.", "“Anyone can have an opinion, but it doesn’t necessarily mean the opinion is based on fact or science.”", "Dominion Voting Systems also rejected the claims, calling the firm that conducted the report a “biased, non-independent organization” and the audit itself “severely flawed.”", "“The claims made in the report are technologically impossible. Dominion machines did not --- and could not have -- ‘switched’ or enabled the ‘switching’ of any votes. A hand count of the paper ballots as well as a review by any independent, federally accredited Voting System Test Laboratory (VSTL) will confirm this fact,” the company’s website says.", "And “Dominion Voting Systems CEO John Poulos refuted the report's findings under oath before the Michigan Senate Oversight Committee,” it says.", "AFP Fact Check has debunked other false or misleading claims about the US 2020 presidential election here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]