["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A spam website republished satire as genuine news in an effort to spread misinformation about former President Barack Obama and Abu Bakr al-Baghdadi.", "The hoax story was posted Jan. 14 to AJUANews.com, a website with a long track record of republishing false, satirical stories without their original context.", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The story falsely claims that Obama freed al-Baghdadi, who died in a raid by U.S. forces in October 2019, from U.S. custody. Its headline: \"‘He’s low risk,’ said Obama before freeing ISIS leader al Baghdadi.\"", "But that allegation about Obama is False. We’ve fact-checked it several times before.", "The AJUANews.com story seems to have been lifted word-for-word from a November article with the same headline on ObamaWatcher, a site that says it posts conservative satire.", "That ObamaWatcher story is tagged as \"Barack Obama Fan Fiction\" on the site. It says Obama was responsible for al-Baghdadi’s release from U.S. custody in 2004.", "Obama, however, was first elected president in 2008.", "When we first looked into al-Baghdadi’s release, the Defense Department told us the future ISIS leader was held at a U.S. detention facility in Iraq known as Camp Bucca from early February 2004 until early December 2004. There’s no record of him being held at any other time.", "Baghdadi was not freed by the United States, either. Rather, the United States handed him over to the Iraqis, who released him some time later.", "Some politicians, pundits and news outlets have inaccurately claimed Obama let al-Baghdadi go in 2009. That misconception tracks back to a Daily Beast interview with Army Col. Kenneth King, the former commander of Camp Bucca.", "King said he recalled al-Baghdadi leaving in 2009 and saying, \"I’ll see you guys in New York.\" King later told ABC News he \"could be mistaken\" and that al-Baghdadi’s \"face is very familiar.\"", "A U.S.-Iraq agreement did drive the transfer of many detainees to Iraq in 2009, but that framework was set up by President George W. Bush in 2008.", "The Defense Department said al-Baghdadi was not in U.S. custody in 2009. And an article in the Guardian quoted another ISIS commander talking about meeting al-Baghdadi at Camp Bucca in 2004. The article said he was transferred because officials saw nothing of concern.", "We also found no evidence that Obama, then an Illinois state senator who had just won election to the Senate, said al-Baghdadi was \"low risk\" when he was released in 2004 — or ever.", "The Obama administration designated al-Baghdadi a global terrorist in a 2011 federal notice.", "AJUANews.com said, \"‘He’s low risk,’ said Obama before freeing ISIS leader al Baghdadi.\"", "The ISIS leader was removed from U.S. custody and handed over to Iraq in 2004, before Obama was president. There’s no evidence Obama played any role in that transfer.", "We rate this statement False.", "AJUANews.com, \"‘He’s Low Risk,’ Said Obama Before Freeing ISIS Leader Al Baghdadi,\" Jan. 14, 2020", "ObamaWatcher, \"‘He’s Low Risk,’ Said Obama Before Freeing ISIS Leader Al Baghdadi,\" Nov. 15, 2019", "Federal Register, Notice by the State Department, Oct. 7, 2011", "PolitiFact, \"Fact-checking Donald Trump's misleading claim about the release of 'dangerous terrorists,'\" Jan. 31, 2018", "PolitiFact, \"Setting the record straight: When did the U.S. free Islamic State leader?\" Dec. 31, 2014", "PolitiFact, \"Fox's Pirro: Obama set ISIS leader free in 2009,\" June 19, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]