["In this 2016 file photo, Democratic presidential candidate Hillary Clinton speaks in New York on Nov. 9, 2016, where she conceded her defeat to Donald Trump after the hard-fought presidential election. (AP)", "Media organizations have called the 2020 presidential election for Joe Biden.", "But they didn’t call the 2016 election for former Secretary of State Hillary Clinton, who lost to President Donald Trump.", "\"The media got it wrong in 1948, 2000, 2016… and they are wrong in 2020,\" one Facebook post says. \"They do NOT pick the winner.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "First, it’s true that the media doesn’t pick the winner in presidential elections — voters do, and the candidate with the most electoral college votes prevails. As of Nov. 11, the Associated Press reported that Biden had 290 electoral votes to Trump’s 214 with the election outcome in three states still outstanding.", "The media \"calls\" races for candidates, but it’s a projection based on available information about the ballots cast for each candidate. We wrote about what happens next, and you can read about it here.", "Now for some history.", "In 1948, the first edition of the Chicago Daily Tribune — now known as the Chicago Tribune — wrongly (and infamously) called the election for presidential candidate Thomas Dewey. The headline read: \"Dewey defeats Truman,\" and there’s a photo of former President Harry Truman holding up the paper and laughing.", "Recalling the error in a 2007 story, the Tribune reported that the paper had been \"lulled into a false sense of security by polls that repeatedly predicted a Dewey victory\" and a printers’ strike forced the Tribune to go to press hours before it normally would.", "The paper changed the headline for the second edition after radio bulletins said that the race was close, according to the Tribune. The headline in the second edition said: \"Democrats make sweep of state offices.\"", "In 2000, some news outlets called Florida for then-Vice President Al Gore. They withdrew it later that night and by early morning the state was still too close to call. On Nov. 8, the Florida secretary of state announced that George W. Bush had won Florida by a narrow margin, which meant he also won the presidency. The Democrats sued to force a recount in several counties and lost at the Supreme Court.", "In 2016, leading up to Election Day, national and state polls consistently showed Clinton beating Trump and forecasters guessed her chance of winning ranged from 70% to 99%. But media organizations didn’t call the election for Clinton, who lost. The Associated Press called the race for Trump at 2:29 a.m. Eastern Time on Nov. 9, and a few minutes later, TV networks started to report that Clinton had called Trump to concede.", "We rate claims that the media called the election for Clinton False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Nov. 7, 2020", "The Associated Press, AP Explains: Election’s validity intact despite Trump claims, Nov. 11, 2020", "PolitiFact, The media have called the presidential race for Joe Biden. Here’s what’s next, Nov. 7, 2020", "The Chicago Tribune, Dewey defeats Truman: The most famous wrong call in electoral history, originally published Dec. 19, 2007", "The New York Times, The 2000 elections: The media; a flawed call adds to high drama, Nov. 8, 2000", "NPR, The Florida recount of 2000: The nightmare that goes on haunting, Nov. 23, 2018", "Pew Research Center, Why 2016 election polls missed their mark, Nov. 9, 2016", "The Associated Press, Calling the presidential race state by state, Nov. 9, 2016", "The Guardian, US election 2016 results timeline: how the night unfolded, Nov. 9, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]