["The photo was published here on Facebook on November 29, 2020. It has been shared more than 750 times.", "The caption of the post reads: “Hello Everyone. There are 96 Thousand Tractors and 12 million Farmers protesting on the border of Capital of India \" New Delhi\". Dear World, it's the Longest March in the history of Planet Earth by farmers for roll back of three laws imposed on them by present \"Government of India\". Please Support Us, as the \"#Farmers #Produces\" are daily three times on your Dining Tables. Indian Media is paid by Agencies and are fabricating the protest. Support Us, in writing the \"Most Beautiful Chapter in the History of this Planet Earth\". Just forward this text to everyone in your friend circle, this is the only contribution we need from you. Let it be the repayment of everything a farmer has given to you & your Family directly or indirectly. #FarmersProtest Just one forward Please”.", "Tens of thousands of Indian farmers joined a rally in New Delhi after the government passed new agriculture laws earlier this year. The new laws mean farmers are now free to sell their produce to anyone at any price, instead of to state-controlled markets at assured rates, as AFP reported here on November 27, 2020.", "The photo was also shared alongside a similar claim on Facebook here, here and here, and on Twitter here and here.", "The claim, however, is misleading.", "A closer examination of the photo found a watermark of “Mumbailive.com”, a local news outlet, in the centre of the photo. A subsequent keyword search on Google has found a similar photo published here on Mumbai Live’s Twitter account on March 11, 2018.", "The tweet reads: “About 25,000 farmers have been marching to towards #Mumbai to protest against the anti-farmer policies. They have gathered at the Eastern Expressway Highway, opposite Viviana mall in #Thane.”", "Below is a screenshot comparison of the photo in the misleading post (L) and the photo from Mumbai Live’s tweet (R):", "Tens of thousands of Indian farmers wore red caps and carried red flags to protest in Mumbai after walking more than a hundred kilometres to demand better crop prices and land rights, as reported here by AFP on March 12, 2018.", "Mumbai is India’s largest city and is located in the West coast.", "The misleading post was also debunked by Indian fact-check organisation BOOM Live here on December 1, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]