["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Bernie Sanders speaks during a Capitol Hill news conference on Sept. 10, 2015. (AP/Susan Walsh)", "As the Democratic primary race between former Secretary of State Hillary Clinton and Sen. Bernie Sanders of Vermont heats up, supporters of each candidate have aggressively gone after the other.", "We recently looked at a graphic circulating on social media, presumably assembled by backers of Sanders, that contrasted the two candidates’ views on a variety of issues. We found that the descriptions were Mostly True about the candidates’ stances on the death penalty and Mostly True about their positions on trade policy.", "This time we’ll look at a graphic -- this one presumably put together by Clinton backers -- that compares them on a different set of issues.", "Here, we’ll check the line in the graphic that says, \"supports requiring all children to have a K-12 education.\" The chart says \"yes\" for Clinton and \"no\" for Sanders. (We asked the Clinton campaign if they wanted to comment, but they declined, saying that they had not produced the graphic.)", "We had no difficulty tracking down the source of this claim, since the chart cites an article in the liberal magazine Mother Jones. Recently, the magazine has published a few articles reviewing Sanders’ early history in politics and activism.", "In one, Mother Jones tracked down some of Sanders’ writings from a now-defunct newspaper called the Vermont Freeman. \"Some of his rants bordered on libertarian,\" wrote Mother Jones’ Tim Murphy. In August 1969 in a column titled \"Reflections on a Dying Society,\" Sanders wrote this:", "It is obvious that in the name of \"public safety\" the State is usurping the rights of free choice in many domains of life. To get (a Federal Housing Authority) loan, one MUST build with specified lumber and materials; to drive an automobile, one MUST have insurance and a car which has no rust going through; to run a farm and sell milk one MUST have a bulk tank; to drive a motorcycle one MUST have a helmet, to cite a few examples. The idea that ALL children MUST attend school until 16 years of age, even if some would rather do other things, is now treated as as given a fact of life as the sunrise.", "Another Mother Jones article pointed to an article from Seven Days, an alternative weekly in Burlington, Vt., in 1981, shortly after Sanders was elected mayor of Burlington for the first time. The weekly recapped Sanders’ political development and his four statewide races as the nominee of the left-wing Liberty Union Party between 1972 and 1976.", "\"During his four races for state office as a Liberty Unionist, Sanders called for public takeover of utilities, a guaranteed minimum wage, the abolition of compulsory education, and a radical revision of the nation's tax structure,\" the 1981 article said.", "In other words, the chart pegs Sanders’ current view on compulsory K-12 education to a column he wrote 46 years ago and to campaigns he ran in the early-to-mid 1970s.", "That’s pretty weak support. Is there any evidence that Sanders still has the same stance today? His office declined repeated requests to supply an answer, but we found some evidence on our own in Sanders’ legislative record in the Senate.", "In the previous Congress, Sanders introduced the DIPLOMA Act, which would have authorized grants for disadvantaged youth. The grants would be designed to ensure that \"youth are ready for school,\" \"are engaged and achieving in school,\" and that \"students are ready for postsecondary education at institutions of higher education and 21st century careers.\"", "He also introduced the Supporting Community Schools Act of 2013, which would give local educational agencies tools to transform under-performing schools. The goals of these efforts would be to improve student achievement, to close achievement gaps between groups of students, and to increase student attendance and graduation rates. (Neither measure advanced through committee.)", "We couldn’t find any recent comments of Sanders opposing compulsory education.", "Our ruling", "A chart on the Internet said that Sanders does not support \"requiring all children to have a K-12 education.\" However, it bases this claim on writings and campaigns from more than 40 years ago, and more recent legislative evidence indicates that Sanders supports a traditional view of K-12 education. We rate the claim False.", "Viral chart, received by PolitiFact, Sept. 8, 2015", "Mother Jones, \"How Bernie Sanders Learned to Be a Real Politician: A portrait of the candidate as a young radical,\" Tue May 26, 2015", "Mother Jones, \" 'You Might Very Well Be the Cause of Cancer: Read Bernie Sanders' 1970s-Era Essays,\" July 6, 2015", "Seven Days, \"Sanders on Sanders: Meet the Mayor,\" March 13, 1981", "Bernard Sanders, \"Reflections on a Dying Society\" (in the Vermont Freeman), Aug. 1-3, 1969", "Congress.gov, DIPLOMA Act, accessed Sept. 10, 2015", "Congress.gov, Supporting Community Schools Act of 2013, accessed Sept. 10, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]