["More Florida school districts may soon have millions of reasons to start requiring students to wear uniforms, thanks to a bill that just passed the House.", "Rep. Janet Adkins, R-Fernandina Beach, sponsored a bill that would give districts $10 per child to adopt standard attire policies in kindergarten through eighth grade. The state would set aside $10 million in all from the general revenue fund. Similar provisions have been amended to a school bill in the Senate, although without the cash incentive.", "Adkins said that school uniforms help create a positive learning environment, because it removes distractions. She cited testimony from officials from five Florida school districts that raved about their uniform policies.", "\"They were all saying the same thing, and that is when they implemented a school uniform policy in their schools, the climate, the culture at their schools improved,\" Adkins said. \"It's an issue of school safety, helps with school truancy.\"", "The House passed the bill 102-8 on March 27, but we were curious whether requiring students to dress the same really did improve school safety and truancy records. Turns out the research is anything but uniform.", "Dressing up stats", "Adkins’ bill would not make uniforms mandatory in any district, although there are already five counties that do have at least a district-wide K-8 standard student attire policy, according to a House analysis. Those five are Alachua, Bay, Madison, Osceola and Polk counties. Otherwise the decision to require uniforms filters down to varying degrees at the local level, even school by school.", "Whether or not the practice makes students safer or fosters better attendance really comes down to what study you read.", "A 1996 study of Long Beach, Calif., schools found a marked decrease in fights, sexual violence and weapons possession two years after adopting school uniforms. A different take on the issue from 2007 using national data found average assaults had actually gone up by an average of 14 incidents in violent schools that required standard attire.", "One researcher we spoke with said that a big part of uniform policies is the perception they make schools safer. Jafeth Sanchez, a research assistant professor at the University of Nevada, Reno, said surveys she gave students at three middle schools showed the kids felt like uniforms curbed violence, although that feeling dropped in the second year students were asked. (Adkins’ office directed us to this study as proof of her statement, but said she used a couple of others, as well.)", "Those results could be because the students got used to wearing uniforms. Or, it could be because the initial answers weren’t honest, but Sanchez thought that was unlikely.", "\"Generally, students do respond honestly to such things – particularly considering that the majority indicated they didn’t like wearing uniforms, even though they actually agreed or strongly agreed with their various benefits,\" she said.", "Other experts we interviewed said there was a kind of \"halo effect\" in which students and teachers felt things had improved, even if they hadn’t.", "Research into attendance is another matter, and often the two subjects aren’t studied at the same time. A Youngstown State University study from 2006 looked at Ohio secondary schools and found attendance and graduation rates clearly went up. University of Houston researchers checked into attendance in 2010 and found the difference was slight.", "\"Specifically attendance rates in middle and high schools increased by approximately ½ to 1 day per year. There was no impact on elementary attendance,\" according to Scott Imberman, who worked on the University of Houston research and now teaches economics at Michigan State.", "He added it is difficult to measure discipline stats along with uniform implementation because discipline standards may have changed along with the dress code.", "And some argue school uniforms are an all-around boondoggle. David Brunsma, a sociology professor at Virginia Tech, has studied the issue and wrote a 2004 book called The School Uniform Movement and What It Tells Us about American Education: A Symbolic Crusade. His research from national samples found no significant effects on behavior, absenteeism or student attitudes.", "\"This is classic,\" he told PolitiFact Florida via email. \"However, it is based on misinformation, common (non)sense, and, of course, pressure from the children’s clothier industry.\"", "Our ruling", "Adkins said school uniforms improve school safety and truancy.", "There are some studies that say there are changes for the better and worse for both school violence and attendance statistics once uniforms are adopted, but there’s hardly a consensus. Even if there is improvement, research suggests the positives are slight -- not exactly the evidence Adkins says overwhelmingly supports the benefits of these policies. Some experts think the actual impact on students is negligible or even negative.", "The statement is partially accurate but leaves out important details. We rate it Half True.", "WJXT/Capitol News Service, \"Florida legislation encourages school uniforms,\" March 26, 2015", "California State University, Long Beach, \"School Uniforms and Safety,\" 1996", "Youngstown State University, \"School Uniforms in Urban Public High Schools,\" November 2005", "Southwest Journal of Criminal Justice, \"Do School Violence Policies Matter? An Empirical Analysis of Four Approaches to Reduce School Violence,\" 2007", "Journal of Ethnographic and Qualitative Research, \"The Role of School Uniforms in Creating an Academically Motivating Climate: do Uniforms Influence Teacher Expectations?,\" 2007", "University of Houston/University of Texas, Dallas, \"Dressed for Success? The Effect of School Uniforms on Student Achievement and Behavior,\" Jan. 15, 2010", "Journal of School Violence, \"Uniforms in the Middle School: Student Opinions, Discipline Data, and School Police Data,\" September 2012", "University of Nevada, Reno, \"College of Education researchers conduct study on impacts of school uniforms,\" April 23, 2013", "Tampa Bay Times Gradebook blog, \"Like school uniforms? A bill encouraging them moves in Florida House,\" March 4, 2015", "South Florida Sun Sentinel, \"State may pay school districts to require uniforms,\" March 7, 2015", "Tampa Bay Times, \"New school uniform policies would pay off for Florida school districts under bill,\" March 12, 2015", "The Florida Channel, \"3/26/15 House Session,\" March 25, 2015", "Tampa Tribune, \"Bill encourages school uniforms by providing state cash,\" March 26, 2015", "The Lakeland Ledger, \"School Uniforms, Class Size Bills Pass,\" March 27, 2015", "Tampa Bay Times Gradebook blog, \"Should Florida schools require uniforms?,\" March 31, 2015", "Florida House of Representatives, \"HB 7043,\" accessed March 31, 2015", "Florida House of Representatives, HB 7043 staff analysis, accessed March 31, 2015", "Interview with Jafeth Sanchez, University of Nevada Reno College of Education research assistant professor, March 31, 2015", "Interview with Scott Imberman, Michigan State University economics professor, March 31, 2015", "Interview with Cheryl Etters, Florida Department of Education spokeswoman, March 31, 2015", "Interview with David Brunsma, Virginia Tech University sociology professor, April 1, 2014", "Interview with John Huss, Northern Kentucky University College of Education and Health Services associate professor, April 1, 2015", "Interview with Michael Williams, House Speaker Steve Crisafulli communications director, April 1, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]