["The narrative around coronavirus pandemic has taken a turn for the worse in India with a majority of social media users and mainstream media outlets not only pinning the blame on the Muslim community but also accusing it of intentionally spreading the infection. Since Nizamuddin Markaz was identified as a COVID-19 hotspot, Alt News has been inundated with random ‘spitting’ and ‘sneezing’ videos shared with a false Muslim angle.", "In an April 11 broadcast, India TV praised the government for working “24×7” to fight the virus outbreak. However, the channel claimed that the efforts are being derailed because of the weakest link i.e., Tablighi Jamaat. “There is another big accusation against the Jamaat – of spitting. Where did they catch the disease of spitting? Which Mulana gave them the symptoms of the virus, India TV has investigated,” said the anchor during the show.", "The channel subsequently played a video of an Islamic preacher saying – “To save yourself from the clutches of demons, read the Surah Al-Ikhlas and spit thrice on the left-hand side” – and paused before he was finished. The music playing in the background would put even directors of Hindi soap operas to shame. “If you do not believe what you saw and heard, watch again and hear with your ears wide open so that no confusion is left.” The video is played for a second time and the anchor goes on the ask questions that would sound ridiculous to the sane mind – “Why do Jamaatis spit?” He further says that there have been reports of Jamaatis spitting on doctors and nurses in isolation wards. The anchor introduces the preacher as Faiz Syed and asks, “Does religion teaches to spit on doctors and nurses?”", "Throughout the show, the channel attempt to blame a certain ‘maulana’ for the spread of coronavirus. Below is one example of the many obnoxious questions flashed by India TV – “Which maulana’s brainchild is Jamaat’s coronavirus symptoms?”", "The video played by India TV is three years old. It was shared by the YouTube channel IRC TV on October 25, 2017. Faiz Syed is an Islamic preacher and the founder of Islamic Research Centre (IRC).", "The video is titled, “Agar Kisi Ko Allah Ki Zaat Par Waswasa – Whispers Aaye To Kya Kare By Adv. Faiz Syed”. This translates to – “What should one do when they get whispers (evil or negative thoughts) about the existence of Allah.”", "In his speech, Faiz Syed first quotes a hadith (sayings of Prophet Mohammad) and advises on what to do if their minds are riddled with evil thoughts on the existence of Allah. He asks people to recite from the Surah Al-Ikhlas (112th chapter of the Quran) – “He is Allah, [who is] One, Allah, the Eternal Refuge. He neither begets nor is born, nor is there to Him any equivalent” – and spit three times on the left-hand side.", "Syed then refers to another hadith which talks about warding off evil thoughts (Shaitan) during prayers. The book ‘Waswasah: The Whispering of the Shaitan’ says that the Prophet was once asked by his companion: “O Messenger of Allah, Satan intervenes between me and my prayer and he confounds me,” to which the Prophet replied, “That is the doing of the Satan who is known as khinzab; when you perceive its effect, seek refuge with Allah from it, and spit three times to your left.”", "Alt News spoke with an Islamic scholar who explained that the ‘spitting’ is not literal ejection of saliva but a gesture. “When evil thoughts come to one’s mind during prayers or meditation, they recite the Surah Al-Ikhlas and make a gesture of spitting on the left side – either say thoo thrice or spit out air. This is a psychological way of believing that after taking Allah’s name, the act of ‘spitting’ ejects the Shaitan out of the body.”", "Therefore, Syed quoted hadith and portions from the Quran in his speech to give advice on how to rid one’s mind of negative thoughts that may either cause one to question Allah’s origin or obstruct one from remembering God. At no point in his speech did he ask people to spit on others.", "India TV dug up a three-year-old video of the Islamic preacher and falsely claimed that he was advocating the spread of coronavirus by spitting. The channel did not inform its users that a day before its broadcast was aired, Syed had uploaded another video where he is saying that intentional spitting to spread the virus is a sin. He also advises people to follow government guidelines and maintain social distancing.", "Nizamuddin Markaz in Delhi was identified as a coronavirus hotspot on March 31. Soon after, reports came pouring in that members of Tablighi Jamaat are spitting and misbehaving with medical workers in quarantine wards. Several reports also claimed that they defecated in the open after being refused non-vegetarian food. Despite no visual evidence and the claims debunked by local authorities, channels have continually been promoting the anti-Muslim narrative. Belgavi Commission of Police clarified that no person quarantined in the district facility has either spat or misbehaved with health workers. AIIMS Raipur also tweeted that rumours about a patient form Tablighi Jamaat spitting on doctors are untrue. Saharanpur police took to Twitter to call-out false reports by Amar Ujala and Patrika that Markaz attendees defecated in the open.", "Alt News has also been debunking several old and unrelated videos widely shared on social media to claim that members of the Muslim community have been intentionally spitting to spread the virus. However, mainstream media has now emerged as the main promoter of this dangerous piece of misinformation. The visibly hateful broadcasts and reports have manifested into common people hounding and assaulting Muslim vendors on the road. There have also been calls to boycott the community and not purchase any items from their shops.", "[Update: India TV deleted its broadcast after this fact-check was published. A link of the downloaded broadcast has been added.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…"]