["The video was published here on Facebook on August 28, 2019. It has been viewed more than 9,800 times.", "The simplified Chinese-language caption translates to English as: \n\t“Johor Bahru Mega Mall, JB\n\tMale administrator stabbed a female manager!!!\n\tAfter the government was changed, many people went mad because of the stress!!!”", "Johor Bahru is a city in Malaysia.", "The 20-second video shows blood splattered across a large section of the floor of a shopping mall. A crowd can be seen gathering around a person lying on the floor who appears to be the victim of an attack.", "Below is a screenshot of the misleading Facebook post:", "The same video was published here on Facebook with a similar claim.", "Another Facebook post here claims the incident happened in Singapore.", "The claim is false; the video shows an incident which happened at a shopping centre in Indonesia's capital, Jakarta.", "A reverse image search on Google using screenshots from the video found the same video published in this tweet on August 26, 2019. The tweet states that a stabbing incident occurred in Pluit Village Mall, Jakarta, Indonesia.", "Kejadian di Pluit Village. Infonya pekerja berantem. Pekerja supervisor cowo nusuk managernya yg cewe. Serem yah jaman sekarang. pic.twitter.com/PnDsA37G1e", "The Indonesian language caption translates to English as: \n\t“Incident at Pluit Village. The information: employees had a fight. A male supervisor stabbed a female manager. It’s so scary nowadays.”", "A screenshot comparison of the video from the misleading post (L) and the video in the tweet (R) is shown below:", "The video corresponds with Google user images tagged at the Pluit Village mall's location on Google Maps, including this photo and this photo.", "The incident was also captured in a video published by Indonesian news site Okezone here on its official YouTube channel on August 27, 2019. The video spliced together footage of the incident from different angles. The video in the misleading post corresponds with the Okezone video from the nine-second mark to the 28-second mark.", "The Indonesian language caption translates to English as: “A restaurant manager in Pluit Village Mall, Asela Rumapea (46) was stabbed by her own subordinate, Yogi Dawamul Hidayat (22). The stabbing was allegedly triggered by work problems.”", "The incident was also reported in this article published on August 26, 2019 by Indonesian news outlet Suara.com.", "The first two paragraphs of the Indonesian language report translates to English as:  “The argument ending with a stabbing occurred in a mall in Penjaringan, North Jakarta on Monday, August 25, 2019, at 7:30 pm Indonesian Western Time. A restaurant employee named Yogi Dawamul Hidayat, 22, has been arrested by police after he stabbed his co-worker named Asela Rumapea, 46.", "“The head of the crime detective unit at Metro Penjaringan police sector, Police Commissioner Mustakim, said they both work for the Banainai Restaurant. From 3:30 pm on, Yogi and Asela argued over work issues.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]