["About this rating", "A third-party organization is running a \"text COUNT ME to 89800\" campaign and maintains that all information will be turned over to march organizers.", "The \"text 89800\" campaign was neither started nor endorsed by the Women's March organizers.", "The Women's March on Washington event that took place on 21 January 2017 far exceeded the expectations of its organizers, drawing approximately 500,000 participants in Washington, D.C., and perhaps two million more in other cities across the U.S. and around the world.", "Not long after the marches concluded, word spread that march organizers were asking attendees to text \"COUNT ME\" to 89800 in order for their presence at that event to be tallied:", "If you participated in a #WomensMarch in any city anywhere, or even virtually, text COUNT ME to 89800! pic.twitter.com/ZY32GWU5Ru", "— Sriya Sarkar (@sriyasarkar7) January 23, 2017", "Various versions of the exhortation were shared by celebrities as well as satellite Women's March events, some of them subsequently deleted:", "Adding to the confusing the matter was a tweet published and then deleted by the official Women's March account, disavowing the \"text 89800\" message:", "The Seattle Privacy Coalition took note of the viral message and expressed reservations about its legitimacy:", "Please don't text to 89800 or any other number to confirm your participation in Womxn's March or any other: https://t.co/0oQq6cODox — Seattle Privacy (@SeattlePrivacy) January 23, 2017", "That tweet linked to marketing communications company TxtWire's \"89800 Mobile Terms & Conditions\" page, which is the most detailed information we've been able to locate about the texting 89800 program so far:", "Program Description\nThe program sends subscribers alerts regarding promotions, coupons, and time sensitive deals from local businesses.", "To opt-in, Text DEALMEIN to 89800. 8 msgs/mo. Msg&data rates may apply. To opt-out, Text STOP to 89800. An opt-out confirmation message will be sent back to you. To request support, Text HELP to 89800 or email us at support@txtwire.com.", "The effort appears to be spearheaded by the It's Time Network, a group professing to be an \"inclusive community of people and organizations working collaboratively to accelerate the full empowerment of women and girls in order to achieve gender equity, evolve democracy and build fair economies that regenerate the Earth.\" That organization began promoting the \"text 89800\" initiative on 21 January 2017:", "Calling all marchers! Text COUNT ME to 89800 to be counted as a #WomensMarch participant & share with friends. @womensmarch pic.twitter.com/HJTMyWbFke", "— It's Time Network (@ItsTimeNetwork) January 21, 2017", "In a subsequent series of tweets, the group acknowledged that the effort was undertaken independently by the It's Time Network and not specifically by Women's March organizers:", "@DoNotGoGently We organized the count in support of march organizers. Please find more information here: https://t.co/QiEqejncJD — It's Time Network (@ItsTimeNetwork) January 22, 2017", "@ptexpat All data will be given to march organizers -- we set the count up as a service to support their efforts: https://t.co/QiEqejncJD", "— It's Time Network (@ItsTimeNetwork) January 22, 2017", "@gotagirlcrush That was not our intention & we apologize for the confusion. We set up the count in support of march organizers' efforts. — It's Time Network (@ItsTimeNetwork) January 22, 2017", "We have been unable to locate any march organizers officially endorsing the \"text COUNT ME to 89800\" message campaign. Although some satellite marches retweeted information about the program, details such as who was attempting to collect a headcount and for what purposes remained unclear.", "We have contacted the official Women's March via e-mail and social media to inquire about the text campaign but have not yet received a response.", "It's Time Network.   \"Women's March on Washington.\"\r\n    Accessed 23 January 2017.", "TxtWire.   \"89800 Mobile Terms & Conditions.\"\r\n    Accessed 23 January 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]