["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Singing \"solidarity forever,\" opponents of Gov. Scott Walker's Act 10 collective bargaining law protested in the State Capitol in Madison in June 2011.", "During a radio interview on April 1, 2014, Gov. Scott Walker claimed that a poll taken \"a few months ago\" showed \"70 percent approval or higher\" for Act 10, the collective bargaining reform law that spurred massive protests in Madison and an attempt to remove him from office.", "Statewide polls typically get widespread news coverage. But we don’t recall any recent headlines about 70 percent support for Act 10, which sharply curbs collective bargaining for most public employees and makes the employees pay more for their pensions and health care.", "Walker's claim is important because he is counting on support for the law in his effort to win re-election in November 2014.", "So let's see what the governor is talking about.", "Act 10", "Walker largely credits Act 10 for shoring up state and local government finances.", "The measure has been vilified for repealing most collective bargaining for public employee unions, both at the state and local government levels.", "But even Walker’s Democratic challenger, Mary Burke, who thinks Act 10 went too far on that score, is among critics who say the law nevertheless took a necessary step in requiring most public employees to pay more for their benefits.", "Walker signed the bill two months after taking office, in March 2011. Because of reaction to it, he faced a recall election in June 2012.", "The timing is important in assessing Walker's claim.", "It has been more than three years since Act 10 became law and nearly two years since it was the focus of the recall.", "In other words, it hasn't been a hot topic for pollsters for some time. And public opinion can change.", "The claim", "Walker made his statement about support for Act 10 to Jay Weber, a conservative radio talk show host at WISN-AM (1130) in Milwaukee. Weber began the interview by praising a number of Walker’s tax cuts, including a trim to property taxes. Then he alluded to Walker’s race with Burke.", "Weber cited results from a statewide Marquette Law School poll released on March 26, 2014, six days before the interview, and asked Walker about his approval rating.", "The poll had shown 47 percent of registered Wisconsin voters approved of how Walker handled his job. That was down from 51 percent in the previous Marquette survey, done two months earlier.", "The new poll, Weber said, \"showed that there was strong approval for the tax cut -- who wouldn’t want their taxes cut? -- but it didn’t translate into a bump in your approval ratings. So, what does that tell you -- you need to sell this before fall?\"", "\"Yeah, I think so. I think a combination,\" Walker said before citing another poll result, albeit with a number of qualifiers.", "\"If you look at that, the previous poll that was taken a few months ago also showed, I think, there was something like -- if I remember right -- something like 70 percent approval or higher for our reforms, the reforms that are commonly called Act 10, the budgetary reforms which allowed not just the state but local governments to balance their budgets as well.\"", "Cleaned up, here’s the claim we’re checking:", "A poll taken \"a few months ago\" -- so, roughly early 2014, or perhaps late 2013 -- found \"70 percent approval or higher\" for Act 10.", "The evidence", "Neither the March 2014 Marquette Law School poll cited by Weber, nor the January 2014 version Walker seemed to allude to, included any questions about Act 10. So we wondered which survey Walker was relying on to back his claim.", "Walker press secretary Laurel Patrick told us the governor was referring to a question in the Marquette poll from late May 2012.", "That's nearly two years ago.", "That question asked: \"As you know, last year a number of changes were made concerning state employees, state spending and policies. For each, please tell me if this is something you favor or oppose -- requiring public employees to contribute to their own pensions and pay more for health insurance?\"", "The results were: Favor – 75%; Oppose – 22%; Don't Know – 3%.", "On other questions, however, support was not that high: 55% said they favored limiting collective-bargaining for most public employees and 50% said they preferred the change to collective bargaining rather than going back to the old law.", "(Another school that does regular statewide polling in Wisconsin is St. Norbert College near Green Bay. Like Marquette, it has not polled on Act 10 since May 2012. The results at that time: 59 percent favored allowing public employees to collectively bargain for wages and 60 percent favored bargaining for health and retirement benefits.)", "In any case, the Marquette results Walker cites are from nearly two years ago, not a few months ago. And no publicly released poll has asked Wisconsinites about Act 10 since then, according to Marquette Law School poll director Charles Franklin and St. Norbert College political science professor Wendy Scattergood, an associate with the St. Norbert College Survey Center Wisconsin.", "As for what the level of support for Act 10 there may have been a few months ago, Franklin told us the results could be the same, but: \"We simply don't know.\"", "Our rating", "Walker said a poll \"taken a few months ago\" found \"70 percent approval or higher\" for his Act 10 collective bargaining law.", "No known poll has asked Wisconsinites about Act 10 in the months leading up to Walker's statement on April 1, 2014, and his staff did not cite one. One poll question from May 2012 found 75 percent support for one part of the law, but what the level of support for Act 10’s various provisions might have been a few months ago is strictly speculation.", "We rate Walker's statement False.", "WISN-AM, Jay Weber interview of Gov. Scott Walker (quote at 2:10), April 1, 2014", "Interview, Marquette Law School poll director Charles Franklin, April 1 and 3, 2014", "PolitiFact Wisconsin, \"Gov. Scott Walker says 94 percent of Wisconsin think the state is heading in the right direction,\" March 11, 2012", "Marquette Law School poll results, May 23-26, 2012", "Email interview, Gov. Scott Walker press secretary Laurel Patrick, April 2, 2014", "Interview, St. Norbert College Strategic Research Institute associate and assistant politifact science professor Wendy Scattergood, April 4, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]