["By Eugene Kiely", "Posted on May 3, 2017", "Hillary Clinton, who declared that she is “now back to being an activist citizen and part of the resistance,” falsely claimed that no debate moderator ever asked Donald Trump, “so exactly how are you going to create more jobs”? It was asked in two of the three presidential debates.", "In the first debate at Hofstra University, NBC News’ Lester Holt devoted a segment to what he called “Achieving prosperity.” Holt opened by generally asking both candidates how they would create jobs, and then he followed up twice by pressing Trump to specifically explain how he planned to bring back manufacturing jobs.", "Fox News’ Chris Wallace also asked both candidates about their jobs plans in the final debate at the University of Nevada, Las Vegas. He asked Trump “why will your plan create more jobs and growth than Secretary Clinton’s?” Wallace also pressed Trump to defend his promise that he would create 25 million jobs and grow the energy industry at a time of low oil prices.", "Clinton made her remarks at the 2017 Women for Women International annual luncheon on May 2 during an interview with CNN’s Christiane Amanpour. The former Democratic presidential nominee talked about the 2016 campaign. She boasted about winning the popular vote, although she exaggerated a bit when she said: “And remember, I did win more than three million [more] votes than my opponent.”  In fact, she received nearly 2.9 million more votes than Trump. She also discussed the reasons for her Electoral College defeat and, at one point, criticized the debate moderators for letting Trump off easy.", "Clinton, May 2: So I was very proud of the policies we put forth. You know, I kept waiting for the moment — I, you know, I’ve watched a million presidential debates in my life and I was waiting for the moment when one of the people asking the questions would have said, well, so exactly how are you going to create more jobs, right? … I thought at some moment that would happen.", "But it did happen. Twice. Both Holt and Wallace devoted an extensive part of their debates to job creation and the economy. Trump told both moderators that he would create jobs by renegotiating trade deals, cutting regulations, reducing business taxes, and repatriating corporate cash held overseas.", "Clinton may not have liked Trump’s answers, but the debate moderators asked the questions and Trump responded.", "In the first of three debates between Clinton and Trump, the moderator divided the 90-minute event into six segments that covered three topics: Achieving prosperity, America’s direction and securing America.", "Holt started with achieving prosperity and the first question was about jobs, asking both candidates, “Why are you a better choice than your opponent to create [jobs]”?", "For the sake of brevity, we will provide some relevant excerpts from that debate here. An annotated transcript of the full debate (where we note instances when the candidates gave false or misleading answers) can be found on our transcript page.", "Holt, Sept. 26, 2016: We’re calling this opening segment “Achieving Prosperity.” And central to that is jobs. There are two economic realities in America today. There’s been a record six straight years of job growth, and new census numbers show incomes have increased at a record rate after years of stagnation. However, income inequality remains significant, and nearly half of Americans are living paycheck to paycheck.", "Beginning with you, Secretary Clinton, why are you a better choice than your opponent to create the kinds of jobs that will put more money into the pockets of American works?", "Clinton: Well, thank you, Lester, and thanks to Hofstra for hosting us.", "The central question in this election is really what kind of country we want to be and what kind of future we’ll build together. Today is my granddaughter’s second birthday, so I think about this a lot. First, we have to build an economy that works for everyone, not just those at the top. That means we need new jobs, good jobs, with rising incomes.", "I want us to invest in you. I want us to invest in your future. That means jobs in infrastructure, in advanced manufacturing, innovation and technology, clean, renewable energy, and small business, because most of the new jobs will come from small business. We also have to make the economy fairer. That starts with raising the national minimum wage and also guarantee, finally, equal pay for women’s work.", "I also want to see more companies do profit-sharing. If you help create the profits, you should be able to share in them, not just the executives at the top.", "And I want us to do more to support people who are struggling to balance family and work. I’ve heard from so many of you about the difficult choices you face and the stresses that you’re under. So let’s have paid family leave, earned sick days. Let’s be sure we have affordable child care and debt-free college.", "How are we going to do it? We’re going to do it by having the wealthy pay their fair share and close the corporate loopholes.", "Finally, we tonight are on the stage together, Donald Trump and I. Donald, it’s good to be with you. We’re going to have a debate where we are talking about the important issues facing our country. You have to judge us, who can shoulder the immense, awesome responsibilities of the presidency, who can put into action the plans that will make your life better. I hope that I will be able to earn your vote on November 8th.", "Holt: Secretary Clinton, thank you. Mr. Trump, the same question to you. It’s about putting money—more money into the pockets of American workers. You have up to two minutes.", "Trump: Thank you, Lester. Our jobs are fleeing the country. They’re going to Mexico. They’re going to many other countries. You look at what China is doing to our country in terms of making our product. They’re devaluing their currency, and there’s nobody in our government to fight them. And we have a very good fight. And we have a winning fight. Because they’re using our country as a piggy bank to rebuild China, and many other countries are doing the same thing.", "So we’re losing our good jobs, so many of them. When you look at what’s happening in Mexico, a friend of mine who builds plants said it’s the eighth wonder of the world. They’re building some of the biggest plants anywhere in the world, some of the most sophisticated, some of the best plants. With the United States, as he said, not so much.", "So Ford is leaving. You see that, their small car division leaving. Thousands of jobs leaving Michigan, leaving Ohio. They’re all leaving. And we can’t allow it to happen anymore. As far as child care is concerned and so many other things, I think Hillary and I agree on that. We probably disagree a little bit as to numbers and amounts and what we’re going to do, but perhaps we’ll be talking about that later.", "But we have to stop our jobs from being stolen from us. We have to stop our companies from leaving the United States and, with it, firing all of their people. All you have to do is take a look at Carrier air conditioning in Indianapolis. They left—fired 1,400 people. They’re going to Mexico. So many hundreds and hundreds of companies are doing this.", "We cannot let it happen. Under my plan, I’ll be reducing taxes tremendously, from 35 percent to 15 percent for companies, small and big businesses. That’s going to be a job creator like we haven’t seen since Ronald Reagan. It’s going to be a beautiful thing to watch.", "Companies will come. They will build. They will expand. New companies will start. And I look very, very much forward to doing it. We have to renegotiate our trade deals, and we have to stop these countries from stealing our companies and our jobs.", "…", "Holt: Let me follow up with Mr. Trump, if you can. You’ve talked about creating 25 million jobs, and you’ve promised to bring back millions of jobs for Americans. How are you going to bring back the industries that have left this country for cheaper labor overseas? How, specifically, are you going to tell American manufacturers that you have to come back?", "Trump: Well, for one thing—and before we start on that—my father gave me a very small loan in 1975, and I built it into a company that’s worth many, many billions of dollars, with some of the greatest assets in the world, and I say that only because that’s the kind of thinking that our country needs.", "Our country’s in deep trouble. We don’t know what we’re doing when it comes to devaluations and all of these countries all over the world, especially China. They’re the best, the best ever at it. What they’re doing to us is a very, very sad thing.", "So we have to do that. We have to renegotiate our trade deals. And, Lester, they’re taking our jobs, they’re giving incentives, they’re doing things that, frankly, we don’t do.", "Let me give you the example of Mexico. They have a VAT tax. We’re on a different system. When we sell into Mexico, there’s a tax. When they sell in—automatic, 16 percent, approximately. When they sell into us, there’s no tax. It’s a defective agreement. It’s been defective for a long time, many years, but the politicians haven’t done anything about it.", "Now, in all fairness to Secretary Clinton—yes, is that OK? Good. I want you to be very happy. It’s very important to me.", "But in all fairness to Secretary Clinton, when she started talking about this, it was really very recently. She’s been doing this for 30 years. And why hasn’t she made the agreements better? The NAFTA agreement is defective. Just because of the tax and many other reasons, but just because of the fact…", "Holt: Let me interrupt just a moment, but…", "Trump: Secretary Clinton and others, politicians, should have been doing this for years, not right now, because of the fact that we’ve created a movement. They should have been doing this for years. What’s happened to our jobs and our country and our economy generally is—look, we owe $20 trillion. We cannot do it any longer, Lester.", "Holt: Back to the question, though. How do you bring back — specifically bring back jobs, American manufacturers? How do you make them bring the jobs back?", "Trump: Well, the first thing you do is don’t let the jobs leave. The companies are leaving. I could name, I mean, there are thousands of them. They’re leaving, and they’re leaving in bigger numbers than ever.", "And what you do is you say, fine, you want to go to Mexico or some other country, good luck. We wish you a lot of luck. But if you think you’re going to make your air conditioners or your cars or your cookies or whatever you make and bring them into our country without a tax, you’re wrong.", "And once you say you’re going to have to tax them coming in, and our politicians never do this, because they have special interests and the special interests want those companies to leave, because in many cases, they own the companies. So what I’m saying is, we can stop them from leaving. We have to stop them from leaving. And that’s a big, big factor.", "…", "Holt: We’re going to move to…", "Clinton: But it’s because I see this — we need to have strong growth, fair growth, sustained growth. We also have to look at how we help families balance the responsibilities at home and the responsibilities at business.", "So we have a very robust set of plans. And people have looked at both of our plans, have concluded that mine would create 10 million jobs and yours would lose us 3.5 million jobs, and explode the debt which would have a recession.", "Trump: You are going to approve one of the biggest tax cuts in history. You are going to approve one of the biggest tax increases in history. You are going to drive business out. Your regulations are a disaster, and you’re going to increase regulations all over the place.", "And by the way, my tax cut is the biggest since Ronald Reagan. I’m very proud of it. It will create tremendous numbers of new jobs. But regulations, you are going to regulate these businesses out of existence.", "When I go around — Lester, I tell you this, I’ve been all over. And when I go around, despite the tax cut, the thing—the things that business as in people like the most is the fact that I’m cutting regulation. You have regulations on top of regulations, and new companies cannot form and old companies are going out of business. And you want to increase the regulations and make them even worse.", "I’m going to cut regulations. I’m going to cut taxes big league, and you’re going to raise taxes big league, end of story.", "Holt: Let me get you to pause right there, because we’re going to move into — we’re going to move into the next segment.", "Wallace began the third debate by asking the candidates about their views on the Constitution and how the Supreme Court should interpret it — leading to other questions about the Second Amendment, gun laws, and abortion. He then asked about immigration and the Russian hacking of the Democratic National Committee before pivoting to the economy.", "Wallace asked Trump “why will your plan create more jobs and growth than Secretary Clinton’s?”", "The moderator also pressed Trump to defend his job-creation promises, telling the GOP nominee that “even conservative economists” believe it’s unrealistic for Trump to expect that he can grow the economy at an annual rate of 4 percent, create 25 million jobs and grow the energy industry at a time of low oil prices.", "Here are relevant excerpts taken from our annotated transcript of the full debate:", "Wallace, Oct. 19, 2016: We’re going to — no, we are going to move on to the next topic, which is the economy. And I hope we handle that as well as we did immigration. You also have very different ideas about how to get the economy growing faster. Secretary Clinton, in your plan, government plays a big role. You see more government spending, more entitlements, more tax credits, more tax penalties. Mr. Trump, you want to get government out with lower taxes and less regulation.", "Trump: Yes.", "Wallace: We’re going to drill down into this a little bit more. But in this overview, please explain to me why you believe that your plan will create more jobs and growth for this country and your opponent’s plan will not. In this round, you go first, Secretary Clinton.", "Clinton: Well, I think when the middle class thrives, America thrives. And so my plan is based on growing the economy, giving middle-class families many more opportunities. I want us to have the biggest jobs program since World War II, jobs in infrastructure and advanced manufacturing. I think we can compete with high-wage countries, and I believe we should. New jobs and clean energy, not only to fight climate change, which is a serious problem, but to create new opportunities and new businesses.", "I want us to do more to help small business. That’s where two- thirds of the new jobs are going to come from. I want us to raise the national minimum wage, because people who live in poverty should not—who work full-time should not still be in poverty. And I sure do want to make sure women get equal pay for the work we do.", "I feel strongly that we have to have an education system that starts with preschool and goes through college. That’s why I want more technical education in high schools and in community colleges, real apprenticeships to prepare young people for the jobs of the future. I want to make college debt-free and for families making less than $125,000, you will not get a tuition bill from a public college or university if the plan that I worked on with Bernie Sanders is enacted.", "And we’re going to work hard to make sure that it is, because we are going to go where the money is. Most of the gains in the last years since the Great Recession have gone to the very top. So we are going to have the wealthy pay their fair share. We’re going to have corporations make a contribution greater than they are now to our country.", "That is a plan that has been analyzed by independent experts which said that it could produce 10 million new jobs. By contrast, Donald’s plan has been analyzed to conclude it might lose 3.5 million jobs. Why? Because his whole plan is to cut taxes, to give the biggest tax breaks ever to the wealthy and to corporations, adding $20 trillion to our debt, and causing the kind of dislocation that we have seen before, because it truly will be trickle-down economics on steroids.", "So the plan I have I think will actually produce greater opportunities. The plan he has will cost us jobs and possibly lead to another Great Recession.", "Wallace: Secretary, thank you. Mr. Trump, why will your plan create more jobs and growth than Secretary Clinton’s?", "Trump: Well, first of all, before I start on my plan, her plan is going to raise taxes and even double your taxes. Her tax plan is a disaster. And she can say all she wants about college tuition. And I’m a big proponent. We’re going to do a lot of things for college tuition. But the rest of the public’s going to be paying for it. We will have a massive, massive tax increase under Hillary Clinton’s plan.", "But I’d like to start off where we left, because when I said Japan and Germany, and I’m—not to single them out, but South Korea, these are very rich, powerful countries. Saudi Arabia, nothing but money. We protect Saudi Arabia. Why aren’t they paying?", "She immediately—when she heard this, I questioned it, and I questioned NATO. Why aren’t the NATO questioned—why aren’t they paying? Because they weren’t paying.", "Since I did this—this was a year ago—all of a sudden, they’re paying. And I’ve been given a lot—a lot of credit for it. All of a sudden, they’re starting to pay up. They have to pay up. We’re protecting people, they have to pay up. And I’m a big fan of NATO. But they have to pay up.", "She comes out and said, we love our allies, we think our allies are great. Well, it’s awfully hard to get them to pay up when you have somebody saying we think how great they are.", "We have to tell Japan in a very nice way, we have to tell Germany, all of these countries, South Korea, we have to say, you have to help us out. We have, during his regime, during President Obama’s regime, we’ve doubled our national debt. We’re up to $20 trillion.", "So my plan—we’re going to renegotiate trade deals. We’re going to have a lot of free trade. We’re going to have free trade, more free trade than we have right now. But we have horrible deals. Our jobs are being taken out by the deal that her husband signed, NAFTA, one of the worst deals ever. Our jobs are being sucked out of our economy.", "You look at all of the places that I just left, you go to Pennsylvania, you go to Ohio, you go to Florida, you go to any of them. You go upstate New York. Our jobs have fled to Mexico and other places. We’re bringing our jobs back.", "I am going to renegotiate NAFTA. And if I can’t make a great deal—then we’re going to terminate NAFTA and we’re going to create new deals. We’re going to have trade, but we’re going—we’re going to terminate it, we’re going to make a great trade deal.", "And if we can’t, we’re going to do it—we’re going to go a separate way, because it has been a disaster. We are going to cut taxes massively. We’re going to cut business taxes massively. They’re going to start hiring people. We’re going to bring the $2.5 trillion…", "Wallace: Time, Mr. Trump.", "Trump: … that’s offshore back into the country. We are going to start the engine rolling again, because…", "Wallace: Mr. Trump?", "Trump: … right now, our country is dying at 1 percent GDP.", "Clinton: Well, let me translate that, if I can, Chris, because…", "Trump: You can’t.", "Trump: … the fact is, he’s going to advocate for the largest tax cuts we’ve ever seen, three times more than the tax cuts under the Bush administration. I have said repeatedly throughout this campaign: I will not raise taxes on anyone making $250,000 or less.", "I also will not add a penny to the debt. I have costed out what I’m going to do. He will, through his massive tax cuts, add $20 trillion to the debt.", "Well, he mentioned the debt. We know how to get control of the debt. When my husband was president, we went from a $300 billion deficit to a $200 billion surplus and we were actually on the path to eliminating the national debt. When President Obama came into office, he inherited the worst economic disaster since the Great Depression. He has cut the deficit by two-thirds.", "So, yes, one of the ways you go after the debt, one of the ways you create jobs is by investing in people. So I do have investments, investments in new jobs, investments in education, skill training, and the opportunities for people to get ahead and stay ahead. That’s the kind of approach that will work.", "Wallace: Secretary…", "Clinton: Cutting taxes on the wealthy, we’ve tried that. It has not worked the way that it has been promised.", "…", "Wallace: Mr. Trump, even conservative economists who have looked at your plan say that the numbers don’t add up, that your idea, and you’ve talked about 25 million jobs created, 4 percent…", "Trump: Over a 10-year period.", "Wallace: … growth is unrealistic. And they say—you talk a lot about growing the energy industry. They say with oil prices as low as they are right now, that’s unrealistic, as well. Your response, sir?", "Trump: So I just left some high representatives of India. They’re growing at 8 percent. China is growing at 7 percent. And that for them is a catastrophically low number.", "We are growing—our last report came out—and it’s right around the 1 percent level. And I think it’s going down. Last week, as you know, the end of last week, they came out with an anemic jobs report. A terrible jobs report. In fact I said, is that the last jobs report before the election? Because if it is, I should win easily, it was so bad. The report was so bad.", "Look, our country is stagnant. We’ve lost our jobs. We’ve lost our businesses. We’re not making things anymore, relatively speaking. Our product is pouring in from China, pouring in from Vietnam, pouring in from all over the world.", "I’ve visited so many communities. This has been such an incredible education for me, Chris. I’ve gotten to know so many—I’ve developed so many friends over the last year. And they cry when they see what’s happened. I pass factories that were thriving 20, 25 years ago, and because of the bill that her husband signed and she blessed 100 percent, it is just horrible what’s happened to these people in these communities.", "Now, she can say that her husband did well, but, boy, did they suffer as NAFTA kicked in, because it didn’t really kick in very much, but it kicked in after they left. Boy, did they suffer. That was one of the worst things that’s ever been signed by our country.", "Now she wants to sign Trans-Pacific Partnership. And she wants it. She lied when she said she didn’t call it the gold standard in one of the debates. She totally lied. She did call it the gold standard. And they actually fact checked, and they said I was right. I was so honored.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]