["By Sydney Schaedel", "Posted on August 30, 2017", "Q: Did President Donald Trump fire 14 Muslim federal judges?", "A: No. The satirical website that originally published the story describes itself as “your beacon of something you can kinda rely on sometimes but not really.”", "President Donald Trump did not fire 14 Muslim federal judges, as a story circulating on the internet claims. Skeptical Facebook users flagged the story posted on several websites as potentially fake news.", "The original post was published Aug. 16 on asamericanasapplepie.org. On its “about” page, As American as Apple Pie says it is “here to be your beacon of something you can kinda rely on sometimes but not really.” It rates itself as “S” for satire at the bottom of each page. In other words, it’s a satirical website.", "But there are tip-offs that the story is a fake.", "“Today, President Trump very quietly ended the tenure of the Moslem 14 — as they have named their little group of Allah worshippers — with an executive order eliminating their benches altogether,” the story says. “White House Propaganda Director Emmanuel Goldstein told Fox News: President Trump doesn’t have the authority to remove a federal judge appointed and confirmed by the Senate, but he does have the authority to determine the number of benches in the judiciary per the Evacuation Clause. He reduced that number today by 14.”", "There is no “White House Propaganda Director.” And the link on “Fox News” doesn’t lead to an interview with someone from the cable news organization. Instead, the link sends readers to a webpage that sings, “You are an idiot.”", "There aren’t even 14 Muslim federal judges to fire. In September 2016, former President Barack Obama nominated attorney Abid Riaz Qureshi to serve on the U.S. District Court for the District of Columbia. He reportedly would have been the first American Muslim to become a federal judge, but his nomination was never confirmed by the Senate.", "The bogus story also says: “President Trump had no choice but to fire one of [the judges] last month when he ruled that Sharia Law was OK if the defendant is Moslem and reasonably expected to follow his faith or face eternity in hell.”", "That’s a reference to another satirical story that we wrote about. It said Trump fired a federal judge by the (fake) name of Mahal al Alallaha-Smith, who ruled that “two ‘critical issues for Muslims’ in Sharia Law had to be abided by in the United States court system because of the systematic infusion clause and because the 14th Amendment guarantees them the rights guaranteed by other states.”", "If one story cites another fake story as fact, then there’s a good chance it is also fake.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "“President Trump Fires All 14 Muslim Federal Judges.” Americanprides.com. 22 Aug 2017.", "“President Trump Fires All 14 Muslim Federal Judges.” Thefreedomsfinalstand.com. 25 Aug 2017.", "Eagleton, Flagg. “President Trump Fires All 14 Muslim Federal Judges.” Asamericanasapplepie.org. 16 Aug 2017.", "Schaedel, Sydney. “No Legalization of Sharia Law.” FactCheck.org. 28 Jul 2017.", "White House. “President Obama Nominates Abid Riaz Qureshi to Serve on the United States District Court for the District of Columbia.” Press release. 6 Sep 2016.", "Johnson, Carrie. “Lawyer Nominated By Obama Would Be First Muslim Federal Judge.” NPR. 7 Sep 2016.", "Khan, Fatima. “Muslim Advocates Heralds President Obama’s Historic Judicial Nomination.” MuslimAdvocates.org. 6 Sep 2016.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]