["By Angelo Fichera", "Posted on September 17, 2020 | Updated on September 17, 2020", "Social media posts are using an image of a CBS News report to accuse the network of misrepresenting a campaign event for President Donald Trump as one for former Vice President Joe Biden. That’s false. The report’s voiceover was discussing the Trump campaign while the photo was on the screen.", "A viral claim on Facebook and Twitter is accusing CBS News of being “Fake News Media,” but it’s the social media posts — not CBS — spreading misinformation.", "On Sept. 16, Jonathan Gilliam, a former Navy SEAL and supporter of President Donald Trump, shared an image on Twitter of a CBS News report whose chyron reads: “Biden Pitches Crucial Latino Voters During Florida Campaign Stop.” A photo in the report shows a crowd of Trump supporters, not his election rival, former Vice President Joe Biden.", "Gilliam wrote: “I’m 100% positive I was in Arizona on Monday supporting @realDonaldTrump with #LatinosForTrump despite @CBS claiming I was at a @JoeBiden rally in Florida. 👉🏻#FakeNewsMedia👈🏻”", "His tweet was shared nearly 14,000 times. The claim made its way to Facebook, too, where a user pointed out obvious signs that the photo was from a Trump event — including hats and signs — and suggested the network was misleading viewers with its chyron.", "But while the image of the CBS News report is authentic, the report did not suggest it was from a Biden rally. The CBS News reporter was discussing the Trump campaign when the photo was used.", "The picture was taken of a Sept. 15 segment on “CBS Evening News with Norah O’Donnell” (seen above). In the report, CBS News political correspondent Ed O’Keefe reported on a Biden campaign stop in Florida and the need for the Democrat to improve support within the Latino community. A recent NBC News/Marist poll showed Trump slightly ahead with Latino voters in the state.", "The report featured Chuck Rocha, identified as a former adviser for Sen. Bernie Sanders’ campaign and the founder of a Latino-focused super PAC, who said Biden needs to spend more time courting Latino voters in the state. That’s when the report began discussing the Trump campaign’s strategy toward Latino voters and featured the photo in question.", "“The president has cut into Biden’s advantage by wooing conservative Latinos with ominous warnings about a Biden presidency,” O’Keefe said in a voiceover as the photo is shown.", "The photo was taken by an Associated Press photographer on Sept. 14 at a “Latinos for Trump Coalition” roundtable event in Arizona, as Gilliam correctly noted.", "The next photo and footage seen in the report also show Trump supporters and the president himself.", "So in short, the viral posts are using a snapshot of a CBS News report out of context to falsely claim that the network was misrepresenting a Trump campaign event as one for Biden. The report itself easily disproves that.", "Update, Sept. 17: After we published this story, Gilliam responded to our request for a comment. In an email, he accused the network of “subtle yet effective persuasion” to make “it look like Biden was packing the room in Florida.” But as we said, the news report was discussing the Trump campaign’s efforts when it showed that image.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "“Biden visits Florida to meet Latino voters.” CBS News. 15 Sep 2020.", "Murray, Mark. “Poll: Trump and Biden are tied in battleground Florida.” NBC News. 8 Sep 2020.", "“What We Do.” Nuestro PAC. Accessed 17 Sep 2020.", "“Supporters react as President Donald Trump speaks at a Latinos for Trump Coalition roundtable at Arizona Grand Resort & Spa, Monday, Sept. 14, 2020, in Phoenix (AP Photo/Andrew Harnik).” AP Images. Associated Press. 14 Sep 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]