["Several photos were published on Facebook here on July 22, 2020. The post has since been shared 395 times.", "The post’s Burmese-language caption translates in English as: “22.07.2020. Some damage after a 7.8 magnitude earthquake shook under the sea floor south of Alaska”.", "The photos were also published on Facebook here and here with a similar claim.", "The claim is false.", "A reverse Google image search found the same photos were published here in a BBC report about an earthquake in Alaska in December 2018. The report’s title reads: “Alaska earthquake: Anchorage rocked by aftershocks”.", "Below are screenshot comparisons of the photos in the misleading post (L) and the photos in the BBC report (R):", "Drone footage", "Two photos were also published here on July 22, 2020, alongsidealongside a report about the Alaska earthquake that occurred on the same day. The post has been shared 110 times.", "The headline of the Burmese-language post translates to English as: “7.8 magnitude earthquake shakes off Alaska”.", "Part of the post translates as: “United States of America , A 7.8 magnitude earthquake shook the region of Alaska in the morning of the 22nd this morning. The epicenter was reported 60 miles southeast of Perryville, according to the US Geological Survey. The quake caused extensive damage.”", "The photos were also published here on Facebook and here on a website with the same claim.", "The claim is false.", "A reverse Google image search found the first picture is a screenshot from drone footage that shows damage in the US state of California caused by an earthquake in 2014. The video was published on YouTube here and featured in an NBC News report on the quake here on August 26, 2014.", "Below is a screenshot comparison of the photo in the misleading post (L) and the screenshot in the YouTube video (R):", "Another reverse Google image search found the second photo shows a screenshot from footage of damage following an earthquake in the US state of Delaware in 2017. The original video was published by CNN here on December 1, 2017.", "Below is a screenshot comparison of the photo in the misleading post (L) and the screenshot in the CNN video (R):", "Tsunami video", "Footage of waves lashing a bridge was published on Facebook here alongside a claim it shows a tsunami caused by the earthquake in Alaska on July 22.", "The post’s Burmese caption translates in English as: “Alaska, USA. 22/7/2020. A magnitude 7.8 earthquake shakes the coast of Ville, causing a tsunami #credit video”", "The post was also shared here and here in Facebook groups.", "The claim is false.", "A reverse image search using the keyframe of the video found the footage has circulated online since at least 2017. It was published on YouTube here on August 24, 2017, in a post headlined: “Minicoy Eastern Jetty ROUGH SEAS.”", "Minicoy Island is situated in the tropical archipelago of Lakshadweep in southwest India.", "Below is a screenshot comparison of the photo in the misleading post (L) and the YouTube video (R):", "Other misleading posts with the same video were debunked here by Indian fact-checking organisation BOOM in December 2017.", "Interior footage of a room shaking was published on Facebook here on July 22, 2020, alongside a claim it shows damage after the Alaska earthquake. The post has been shared 227 times.", "The post’s Burmese-language caption translates as: “22.07.2020. Terrible video of a 7.8 magnitude  earthquake off the southern coast of Alaska. #Credit video ..”", "The video was also published on Facebook here and here.", "The claim is false.", "A reverse image search using video keyframes found the video shows an earthquake in Alaska in 2018. The footage was featured in a report here by CBS19, a local TV news affiliate, on November 30, 2018.", "Below is a screenshot comparison of the video in the misleading post (L) and the video in the CBS19 report (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]