["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Dave Brat, R-Va., said Deferred Action for Childhood Arrivals (DACA) can lead to chain migration. (Photo by the Richmond Times-Dispatch)", "Rep. Dave Brat, R-Va. said that a program that protects young immigrants from deportation needs to be looked at in a broader context and that a bipartisan deal to protect the program is misguided.", "NBC’s Chuck Todd asked Brat if he was open to granting legal status to DACA beneficiaries if Democrats supported funding Trump’s promised border wall.", "\"I don't like these little pieces, as I was just saying,\" Brat said Sept. 7. \"That's not the problem. If you want to know if people are going in good faith on immigration reform, first you've got to do e-Verify and then you've got to take a look at chain migration, right? So the number on DACA is 800,000, but every one person can bring in their entire extended family once they reach a certain status. So it's 3 or 4 million, right?\"", "Brat went on to say that \"8 billion people would love to come here\" but that such migration \"ain't going to work.\"", "Todd interjected that the number at issue was not 8 billion, \"we're talking about 800,000.\"", "The 800,000 is the approximate number of young people who are part of the Obama-era Deferred Action for Childhood Arrivals, DACA program. DACA spares from deportation immigrants in the country illegally who came to the United States as children. President Donald Trump gave Congress six months to pass a bill that would deal with the hundreds of thousands of people protected by the program.", "Brat said the 800,000 number was deceptive.", "\"The DACA problem is the immigration problem. And once you put up a green light, it's a green light. Once you legalize and say, hey, once you make it in here, the American people are generous, always have been. We're a country of immigrants. But once you put up that green light, kwoom, right? Surges come every time.\"", "Brat left us wondering if in fact DACA recipients could bring in extended family members \"once they reach a certain status\" and if that could add up to 4 million additional immigrants. His office said this could happen once they got green cards. But green card recipients can only petition for spouses and unmarried children. On average, DACA recipients came to the United States before they were 7 years old.", "DACA gave individuals temporary deportation relief, but did not grant them legal status. Having DACA does not allow them to petition a family member to come to the United States.", "What \"certain status\" was Brat referring to?", "\"Currently a loophole exists for DACA recipients to become eligible for green cards,\" said Juliana Heerschap, Brat’s communications director. \"Individuals with a green card status can petition to bring their immediate and extended family into the United States.\"", "Heerschap pointed us to a Sept. 1 press release from Sen. Chuck Grassley, R-Iowa, that said \"the Obama administration allowed thousands of DACA recipients to exploit an immigration law loophole to obtain green cards,\" and that some of them had become U.S. citizens.", "Grassley said U.S. Citizenship and Immigration Services preliminary data showed that as of Aug. 1, 2017:", "• 45,447 DACA recipients were approved for advance parole (3,993 applications denied);", "• 59,778 DACA recipients had applied for green cards and 39,514 were approved;", "• of those who received green cards, 2,181 had applied for U.S. citizenship, and 1,056 had become U.S. citizens.", "Advance parole is issued at the discretion of the Department of Homeland Security, and DACA recipients can request it for humanitarian, education or employment purposes. It allows them to travel outside the United States and re-enter lawfully. (Individuals with other immigration statuses or protections can also request advance parole.)", "Simply re-entering lawfully thanks to an advance parole does not lead to legal permanent residence. A DACA recipient would still need to be eligible for a green card under established categories. However, coming in with advance parole can make the green card process easier and faster for immigrants who initially entered the country illegally.", "Brat’s office told us people who have green cards could petition for their immediate and extended family. But per U.S. Citizenship and Immigration Services, green card holders can only petition for spouses and unmarried children. Only U.S. citizens can petition for extended family members, such as parents and siblings, and in those cases the petitioner must be at least 21 years old.", "While the majority of DACA recipients are now adults, it’s worth noting that to be approved they had to be in the United States before they were 16 years old.", "Also, DACA recipients on average were 6.5 years old when they came to the United States, according to an August survey of 3,063 program beneficiaries, fielded by Tom K. Wong, an associate professor of political science at the University of California-San Diego.", "The median age of arrival was 6, according to the survey.", "How did Brat determine that DACA beneficiaries could bring in 3 or 4 million people?", "\"Rep. Brat calculated the 3 or 4 million number based on a rough estimate of total immediate and extended family members potentially eligible for chain migration if DACA recipients receive green card status. This is a very back of the envelope estimate and conservative at best,\" said Heerschap said, his communications director.", "Heerschap referred us to a paper on chain migration published by Negative Population Growth, which studies overpopulation and advocates for gradual population reduction and reversal, including through an 80 percent decrease in legal immigration.", "Contemporary studies found that in recent years each new immigrant sponsored an average of 3.45 additional immigrants, the paper said.", "Federal data up to March 31, 2017, show that 787,580 people had been approved for DACA.", "If each of the 787,580 people approved brought in 3.45 family members, that would be 2.71 million more immigrants.", "But green card holders cannot petition for extended family members and it’d be unlikely that the nearly 800,000 DACA recipients have spouses and unmarried children back in their home country, because many came to the United States after they were 6 years old. DACA beneficiaries also must have continuously lived in the United States since June 15, 2007.", "Brat’s office also linked us to data from Migration Policy Institute that estimated the number of people who may benefit under House and Senate bills introduced in 2017 to help so-called \"Dreamers.\"", "Under the Senate bill, about 1.5 million immigrants would be eligible for a green card, compared to an estimated 938,000 under the House proposal, MPI reported.", "Brat said, \"So the number on DACA is 800,000, but every one person can bring in their entire extended family once they reach a certain status. So it's 3 or 4 million, right?\"", "Brat’s office said the status he meant was lawful permanent residence. However, even if DACA recipients were to become lawful permanent residents, as green card holders they cannot petition for extended family members to enter the United States, only spouses and unmarried children. DACA recipients were on average 6.5 years old when they arrived, making it less likely that they all have children and spouses back in their home country.", "Brat’s statement is not accurate, we rate it False.", "MSNBC, 'The Swamp Is Winning,' GOP Rep. Says on Trump's Agenda, Sept. 7, 2017", "Email exchange, Juliana Heerschap, Brat’s communications director, Sept. 13, 2017", "Department of Homeland Security, Memorandum on Rescission Of Deferred Action For Childhood Arrivals (DACA), Sept. 5, 2017", "Migration Policy Institute, MPI Estimates of Who Might Benefit under 2017 DREAM Act Bills in Congress, July 2017", "PolitiFact, Trump-O-Meter: Terminate Barack Obama's immigration executive orders 'immediately', last updated Sept. 5, 2017", "PolitiFact, Fact-checking Attorney General Jeff Sessions on the DACA immigration program, Sept. 5, 2017", "PolitiFact, Trump-O-Meter: Build a wall, and make Mexico pay for it, last updated Aug. 25, 2017", "DACA survey: Results from Tom K. Wong et al., 2017 National DACA Study", "Sen. Chuck Grassley’s website, Data Indicate Unauthorized Immigrants Exploited Loophole to Gain Legal Status, Pathway to Citizenship, Sept. 1, 2017", "Immigrant Legal Resource Center, Travel for DACA Applicants (Advance Parole)", "U.S. Citizenship and Immigration Services, Temporary Protected Status, Last Reviewed/Updated: May 24, 2017", "U.S. Citizenship and Immigration Services, Green Card Eligibility Categories, Last Reviewed/Updated: Sept. 12, 2017", "U.S. Customs and Border Protection, When is Advance Parole Required For Travel, updated Aug. 29, 2017", "U.S. Citizenship and Immigration Services, 40.9 Section 212(a)(9) of the Act - Aliens Unlawfully Present after Previous Immigration Violations [Chapter 40.9 added May 6, 2009]", "U.S. Citizenship and Immigration Services, Adjustment of Status, Last Reviewed/Updated: June 29, 2017", "U.S. Citizenship and Immigration Services, Family of Green Card Holders (Permanent Residents), July 14, 2015", "U.S. Citizenship and Immigration Services, Family of U.S. Citizens, Last Reviewed/Updated: March 15, 2017", "Negative Population Growth, About Us page, Chain Migration: How immigration begets more immigration, 2017", "U.S. Citizenship and Immigration Services, DACA approvals up to March 31, 2017", "Phone interview, Julia Gelatt, a senior policy analyst at Migration Policy Institute, March 13, 2017", "Email interview, Stephen W. Yale-Loehr, an immigration law practice professor at Cornell Law School, Sept. 13, 2017", "Email interview, Michael A. Olivas, William B. Bates Distinguished Chair in Law at the University of Houston Law Center and Director of the Institute for Higher Education Law and Governance at University of Houston, Sept. 13, 2017", "Email interview, Jill E. Family, an immigration law expert and professor at Widener University Commonwealth Law School, Sept. 13, 2017", "Email interview, Ediberto Roman, professor of Law and Director of Immigration and Citizenship Initiatives at Florida International University, Sept. 13, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]