["The 32-second video was published here on Facebook on February 19, 2021. It has been viewed more than 910,000 times and shared more than 43,000 times.", "The video's Burmese-language caption translates to English as: “18-2-2021 MRTV made an official announcement that civil servants and pensioners will not receive payments. Have you watched it?", "\"For those who don't want to join #CDM, you can go to work as you wish.\"", "\"CDM\" refers to the Civil Disobedience Movement (CDM), an anti-government protest group that was established after the military coup on February 1, 2021.", "The narrator in the video can be heard saying: “The State Administration Council had made an announcement article no. 73/2021 on February 18, 2021. The article announced that the government will no longer be giving salaries and pensions to the civil servants and pensioners from now on.”", "Myanmar Radio and Television, MRTV is a state-owned radio and television channel.", "Facebook recently removed the MRTV Facebook page from its platform after the tech giant determined it had violated their community standards policy, Reuters reported here.", "The video circulated online as many of Myanmar's civil servants went on strike following a military coup on February 1, 2021. AFP reported on the strikes here.", "The same video has been shared here, here and here on Facebook alongside a similar claim.", "The claim, however, is false: the video has been manipulated.", "A closer analysis of the doctored video found it had been created using three separate clips.", "Keyword searches found the first 13 seconds of the doctored video published here on MRTV’s YouTube Channel on February 18, 2021. The television presenter can be heard giving an introduction from the 27-second mark to the 40-second mark.", "From the 13-second mark to 22-second mark, the doctored video corresponds with another clip on MRTV’s YouTube channel published here on February 18, 2021. The clip relates to the announcement of Article No.73/2021 -- the appointment of Myanmar Central Bank members.", "It does not relate to the payments to civil servants and pensioners, as was falsely stated in the doctored video.", "The Myanmar military announced the formation of the State Administration Council on February 2, 2021, one day after a military coup.", "In the video below from the one-second mark to 10-second mark, the presenter can be heard saying the Myanmar State Administration Council issued Article No.73/2021.", "In the third section of the doctored video (from its 22-second mark), the presenter's mouth does not match the words heard in the clip's audio.", "The audio repeats that the state administration council announced Article No.73/2021. Part of this MRTV clip can be seen again at this point.", "Below are three screenshot comparisons showing the doctored video (L) and the original clips on MRTV’s YouTube channel (R):", "MRTV reported here and here in February 2021 that pensioners can withdraw their pensions from Mobile Money service or ATM machines.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]