["About this rating", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "In late June 2020, social media users shared an article written by anti-Muslim propagandist Robert Spencer in which he claimed — without evidence — that \"Antifa and Muslim organizations plan to 'police Minneapolis under Muslim rule.'\"", "Spencer's article, which was published to the far-right website FrontPageMag, was sourced from a quote by State Rep. Steve Green, a Republican who represents a district in northwest Minnesota.", "Green made the comment among many other grievances he aired during a meeting with the Hubbard County Board of Commissioners on June 16, 2020. The remark was initially documented in a Park Rapids Enterprise post written by another politician, State Rep. Matt Grossell, a Republican representative for a district in northwest Minnesota who was also present at the meeting.", "Grossell's post reads like a partial transcript of the two men's remarks at the meeting, and contains no corroborating evidence or reporting to support Green's claims. At one point Green indicates that in his \"humble opinion,\" they're seeing \"communism moving into Minneapolis and St. Paul.\" Despite a lack of evidence to support it, Green's sensational quote was picked up by a number of websites.", "We reached out to Green by email to ask where he got this information and whether he had any evidence for his claims, but got no reply.", "We also reached out to Minneapolis Police Sgt. John Elder, who confirmed that while the City Council did state its intent to \"reimagine\" policing, the Minneapolis Police Department is still operating. \"We absolutely are here and will not abandon our communities!\" Elder stated in an email.", "Not only is there no apparent evidence for Green's claim that antifa and Muslim groups are policing Minneapolis, but the Council on American-Islamic Relations (CAIR), a Muslim civil rights and advocacy organization, has called on GOP leaders to repudiate Green's statement, calling it hate-filled.", "As the Minneapolis-based alternate newspaper CityPages reported, the Twin Cities are no stranger to Islamophobic rhetoric and violence:", "It should go without saying that, no, people are not trying to impose “Muslim rule” on Minneapolis, but we kind of end up having to say it a lot. Back in April, as false rumors of mosques staying open during quarantine bounced around Facebook, Council on American-Islamic Relations executive director Jaylani Hussein called the spread of such conspiracies “hate-bating.”", "They might seem harlmess [sic], even laughable, until someone gets hurt. And if watching a group of Illinois men blow up a Bloomington mosque in the summer of 2017 has taught Twin Cities’ Muslim communities anything, it’s that they very well can.", "Green's comments came in the aftermath of nationwide protests against structural racism and police violence after video of the in-custody death of George Floyd, a Black man, went viral in May 2020. The video showed Floyd begging for his life as former Minneapolis police officer Derek Chauvin kneeled on his neck.", "In the wake of sustained, international protests, Chauvin was charged with second-degree murder in Floyd's death, and three other officers at the scene were charged with aiding and abetting murder. The Minneapolis City Council also voted to dismantle the Minneapolis Police Department, stating it could not be reformed.", "However, that doesn't mean the police department disappeared overnight. Members of the City Council stated that the change would be gradual, and that they are still in the process of laying the groundwork for what the future holds for public safety in Minneapolis.", "As some of the earlier protests had turned violent, U.S. President Donald Trump and his allies had sought to blame \"antifa\" without evidence. As The New York Times noted, \"antifa, a contraction of the phrase 'anti-fascist,' is not an organization with a leader, a defined structure or membership roles\" but rather \"antifa is more of a movement of activists whose followers share a philosophy and tactics.\"", "Because there's no evidence for Green's comments and because the Minneapolis Police Department continues to patrol the city and respond to emergencies as city leaders hash out the future for public safety, we rate this claim \"False.\"", "Grossell, Matt.   \"Reps. Green, Grossell Criticize Police Reform, Mail-In Ballots, More.\"\r\n    Park Rapids Enterprise.   20 June 2020.", "Jones, Hannah. \"Rep. Steve Green Says Antifa Wants to 'Police Minneapolis Under Muslim Rule.'\"\r\n  CityPages. 24 June 2020.", "Hooper, Ibrahim. \"CAIR-Minnesota Calls on GOP Leaders to Repudiate Lawmaker’s Anti-Muslim Comments.\"\r\n  CAIR. 23 June 2020.", "Searcey, Dionne and John Eligon. \"Minneapolis Will Dismantle Its Police Force, Council Members Pledge.\"\r\n  The New York Times. 7 June 2020.", "Bogel-Burroughs, Nicholas and Sandra E. Garcia. \"What Is Antifa, the Movement Trump Wants to Declare a Terror Group?\"\r\n  The New York Times. 2 June 2020.", "Schuman, David. \"Minneapolis City Council to Take First Official Step in Ending Police Department.\"\r\n  WCCO. 25 June 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]