["A video of a group of men moral policing and harassing a burqa-clad woman on a roadside has been shared on social media with the claim that the men belong to the Rashtriya Swayamsevak Sangh (RSS).", "Twitter handle ‘@RoflSaba_saikh’ tweeted the video and wrote, “इन @#$यों , @#$ की वजह से देश मे बेटिया Safe नही है ये वही संघी है जो बेटी बचाओ बेटी पढ़ाओ का नारा लगाते है असल मे इनकी औकात ये है। रिट्वीट रुकना नही चाहिए आपका एक रिट्वीट इन सुअरो को गिरफ्तार करवा सकता है।”", "Another user @shahjhan_malikk shared the video and wrote that India is the most dangerous country for women.", "This is one of the reasons why poll ranks #India the world’s most dangerous country for #women. pic.twitter.com/mLmI6kETKq", "— Shahjhan Malik | #StayHomeSaveLives (@shahjhan_malikk) July 7, 2020", "A Facebook page Nagma Khan-Humanity First had posted the video via Facebook Live on May 12, 2020. The clip is viral on Facebook with the ‘RSS’ angle.", "A reverse-image search of one of the keyframes of the video revealed that it was uploaded by a Bangladeshi channel on YouTube in 2018. While the channel did not provide details, the men in the video are conversing in Bengali in a Bangladeshi dialect.", "One of the men in the clip can be heard asking the woman, “বাসা কোথায়? টেকেরহাটে? কোন জায়গায় টেকেরহাটে? (Where is your home? In Teherkat? Which place in Tekerhat?)” Tekerhat is an area in Madaripur District, Dhaka Division, Bangladesh. This was earlier fact-check by Boomlive.", "Therefore, an old video of a group of men moral policing and harassing a woman in Bangladesh has been shared with the false claim that the incident took place in India and RSS members were behind the harassment.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…"]