["This Facebook post was published on February 11, 2020. It has been shared 282 times.", "It shows a photo of two people wearing gowns in a laboratory with the text: “Thailand ‘cures’ coronavirus with an anti-HIV drug in 48 hours. The doctors combined the anti-flu drug oseltamivir with lopinavir and ritonavir, antivirals used to treat HIV.”", "Below is the screenshot of the misleading post:", "The novel coronavirus has killed nearly 1,800 people and infected more than 70,000 others in China after it was discovered in Wuhan in late 2019, AFP reported here on February 17, 2020.", "A similar claim was published here, here and here on Twitter; here on a Ghanaian website and here on a Ugandan news site.", "The claim is misleading; Thai doctors said that whilst they successfully treated one coronavirus patient with a cocktail of drugs, they did not “cure” her of the viral infection.", "On February 2, 2020, Thailand’s Ministry of Public Health announced that a Chinese national infected with novel coronavirus has shown “dramatic improvement” some 48 hours after being treated with a cocktail of the anti-flu drug oseltamivir and anti-HIV drugs lopinavir and ritonavir. Here is an AFP report on the press briefing.", "“I have experience treating patients with severe conditions. I treated the patients and the result was satisfying. The patient got better fast within 48 hours,\" Dr. Kriengsak Attipornwanich said during the briefing.", "“Ten days before arriving in my hospital, the patient’s condition was worsening and the inflammatory marker was becoming higher and higher every day. The patient had a tendency to need a respirator. But when she was given the cocktail drugs, the patient got better significantly. Her fever reduced, the patient had a better appetite.”", "The Ministry of Public Health also published this article titled “Anutin reveals good news. Thai doctors treat patients with COVID-2019. Symptoms improved in 48 hours after treatment.”", "Anutin Charnvirakul is Thailand’s Deputy Prime Minister and Minister of Public Health.", "The article reads, in part: “The Deputy Prime Minister and Minister of Public Health reveals that doctors from Rajavithi hospital treated a patient with inflammatory lungs, infected with novel coronavirus 2019, showing severe symptoms, got better in 48 hours.”", "As of February 14, the WHO’s guidelines state there is “no specific medicine” to prevent or treat novel coronavirus.", "The guidelines states, in part: “To date, there is no specific medicine recommended to prevent or treat the novel coronavirus. However, those infected should receive appropriate care to relieve and treat symptoms, and those with severe illness should receive optimized supportive care. Some specific treatments are under investigation and will be tested through clinical trials. WHO is helping to coordinate efforts to develop medicines to treat nCoV with a range of partners.”", "The US-based Centers for Disease Control and Prevention also states here that “there is no specific antiviral treatment recommended” for the COVID-2019 infection.", "“People infected with [COVID-2019] should receive supportive care to help relieve symptoms,” the agency said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]