["About this rating", "On 24 March 2017, David “Avocado” Wolfe, prolific pseudoscience media mogul, purveyor of life-extending USB-chargeable “longevity zappers”, and self-described “wealthiest hippie on Earth”, published a post that went viral on Facebook titled “3 Reasons Why You Should Stop Eating Peanut Butter Cups!”", "This post, though essentially a word-for-word rip-off of a 2015 post from a website named “Living Traditionally,” is still somehow classic Wolfe: a highly shareable story crafted at the expense of a beloved childhood candy through the willful misrepresentation of the science surrounding its ingredients.", "In this case, Wolfe (or whoever wrote the article) points to three chemicals which, as a matter of fact, are present in Reese’s Peanut Butter cups:", "Soy Lecithin", "Research has shown that as much as 93% of soy is genetically modified. Soy lecithin has been found to have detrimental effects on fertility and reproduction. It can cause behavioral and cerebral abnormalities. It has also been linked to breast cancer.", "PGPR", "PGPR is short for polyglycerol polyricinoleate. The manufacturer of this popular candy replaced cocoa butter with PGPR to lower the cost of production. PGPR comes from castor beans and it’s used to reduce the viscosity of chocolate. It has been connected to gastrointestinal problems and allergic reactions in children.", "TBHQ", "TBHQ stands for tertiary butylhdroquinone. It’s derived from petroleum and can be extremely toxic. Side effects of ingesting TBHQ include nausea, vomiting, ringing in the ears, delirium and collapse. Research has shown that TBHQ can damage the lungs and umbilical cells in humans. It can also cause stomach cancer. Children who are exposed to this chemical may show anxiety, restlessness and intensified ADHD symptoms.", "Soy Lecithin", "Lecithin is a mixture of naturally organic compounds separated from their source by way of their shared chemical properties and added to a variety of foods to improve texture and aid in the mixing of ingredients. As defined by the United States Code of Federal Regulations:", "Commercial lecithin is a naturally occurring mixture of the phosphatides [derivatives of a specific chemical] of choline, ethanolamine, and inositol, with smaller amounts of other lipids. It is isolated as a gum following hydration of solvent-extracted soy, safflower, or corn oils.", "In terms of the soy-GMO link, this issue is somewhat moot because If GMO’s aren’t a person’s jam, then that individual probably wouldn’t be purchasing Reese’s Peanut Butter Cups anyway, as the Hershey's Company discloses the possibility of GMO ingredients, broadly, in this line of products. The remaining claims are either misleading or factually impoverished.", "To support the notion that soy lecithin has “detrimental effects on fertility and reproduction”, causes “behavioral and cerebral abnormalities” and has been “linked to breast cancer”, the author of the post links to a different post by “Dr. Axe”, a naturopathic doctor, chiropractor, and nutritionist.", "In this post, Axe briefly mentions a largely irrelevant 1985 study that looked at the effects of feeding pregnant laboratory rats and their offspring with an absurdly high soy lecithin diet. In that study, rats were given 10 grams of standardized of food per day with either 2 percent or 5 percent of the mass of that food replaced by soy lecithin. This study, which had a narrow and specific aim of investigating a proposed mechanism behind a number of neurologic conditions, found that:", "The results indicate that dietary soy lecithin preparation enrichment during development leads to behavioral and neurochemical abnormalities in the exposed offspring.", "However, the amount of lecithin used in this experiment are multiple orders of magnitude more than any human could reasonably expect to be exposed to, even on a daily basis. Using the rough estimate 1800 grams of food consumed per day by the average human, a 5 percent lecithin diet would represent 90 grams of soy lecithin per day, which is roughly 1000 times more soy lecithin than the FDA estimates Americans get in their daily diet through additives (96 milligrams per day).", "Using an over 30 year old study of pregnant and developing rats fed absurdly unrealistic doses of a chemical to say that peanut butter cups are dangerous is a reach, even by Wolfe standards. By FDA “Generally Recognized as Safe (GRAS)” standards:", "There is no evidence in the available information on lecithin and lecithin bleached with hydrogen peroxide that demonstrates or suggests reasonable grounds to suspect a hazard to the public when they are used at levels that are now current or that might reasonably be expected in the future.", "The remaining claims regarding breast cancer, fertility, and reproduction are made by conflating soy protein and soy lecithin. Soy protein is chemically similarity to estrogen, a point that has been the subject of much scientific and internet debate about its potential adverse affects. While the mechanisms linking soy to any hormone-derived maladies have yet to be demonstrated, it is another moot point, as at most only trace amounts of soy protein, if any, remain in soy lecithin.", "PGPR", "Polyglycerol polyricinoleate (PGPR), per Food and Industrial Bioproducts and Bioprocessing, is a common additive that is used:", "For improved texture and enhanced volume of bakery products, in salad dressings, and in chocolate to decrease the occurrence of fat bloom [a visual separation of fat from the rest of the chocolate].", "While not hesitating to use its scary scientific name, the only allegation of note the Wolfe post makes is that PGPR has been “connected” to gastrointestinal problems and allergic reactions in children.  Ignoring the fact that the same could be said about the ingredients in the natural version of peanut butter cups presented below Wolfe's article, it is also a broad misrepresentation of PGPR’s risk, which is, at best, negligible.", "The most recent review of its safety, performed by the European Food Safety Authority (EFSA) and adopted on 3 March 2017, reaffirmed its safety:", "PGPR [...] is not of concern with regard to genotoxicity or carcinogenicity. The single reproductive toxicity study with PGPR was limited and was not an appropriate study for deriving a health-based guidance value. Human studies with PGPR demonstrated that there is no indication of significant adverse effect.", "TBHQ", "TBHQ, used as an antioxidant preservative in many food items, is indeed a petroleum derivative (as are almost all carbon containing compounds not produced by living organisms), but that doesn’t mean it carries the same risks as ingesting raw petroleum sludge — it’s a specific, singular, isolated, and modified chemical.", "There have, in fact, been animal studies that report harmful effects after extremely large doses of TBHQ as well as other cases of extremely high or chronic exposure resulting in harm. As we wrote in a similar Wolfe debunker about the dangers of Pop Tarts, however, while the long-term health effects in humans exposed to high or chronic doses of TBQH (i.e. industrial or laboratory workers handing pure TBHQ occupationally) is not a settled issue, the long-term effects of humans exposed to it in doses legally allowed by USA and European regulatory agencies is settled. EFSA reevaluated its earlier (similar) conclusion regarding TBQH in 2004, finding that it is “not carcinogenic and that further genotoxicity studies are unnecessary.”", "The Wolfe post also claims that children exposed to TBHQ “may show anxiety, restlessness and intensified ADHD symptoms” despite the fact that no peer-reviewed studies link TBHQ specifically to ADHD, restlessness, or anxiety.", "This notion stems from the controversial ideas of Dr. Benjamin Feingold, who advocates the removal of myriad food additives, including TBHQ, as a cure for attention deficit and hyperactivity disorder and other behavioral issues. Despite his claims, however, no research specifically focused on TBHQ has documented any connection, and those diets he promotes generally treat a broad collection of additives as the same, despite clear chemical differences.", "Ultimately, the claims presented in Wolfe’s post rely on outdated, irrelevant, or factually incomplete information. Reese’s Peanut Butter Cups do, along with many other foods, contain the listed ingredients. This point, however, is close to the only factual one made by the author of the post.", "V, Anya.   \"The Candies That Most Kids Eat Daily Nausea, Vomiting, Ringing in the Ear, Delirium and Collapse.\"\r\n    Living Traditionally.   17 November 2015.", "Amazon.com.   \"REESE'S Peanut Butter Cups (1.5-Ounce Packages, Pack of 36)\"\r\n    Accessed 31 March 2017.", "U.S. Government Publishing Office.   \"e-CFR Title 21, Chapter 1, Subchapter B, 184.1400 Lecithin.\"\r\n    Current as of 29 March 2017.", "Smart Label.   \"REESE'S Peanut Butter Cups\"\r\n    Accessed 31 March 2017.", "Bell, Joanne M. and Paula K. Lundberg.   \"Effects of a Commercial Soy Lecithin Preparation on Development of Sensorimotor Behavior and Brain Biochemistry in the Rat.\"\r\n    Developmental Psychobiology.   January 1985.", "National Geographic.   \"What The World Eats - World Daily Diet\"\r\n    Accessed 31 March 2017.", "U.S. Food and Drug Administration.   \"Select Committee on GRAS Substances (SCOGS) Opinion: Lecithin.\"\r\n    1979.", "Chen, Meinan, et al.   Association between Soy Isoflavone Intake and Breast Cancer Risk for Pre- and Post-Menopausal Women: A Meta-Analysis of Epidemiological Studies\"\r\n    Developmental Psychobiology.   20 February 2014.", "Messina, Mark.   “Soybean Isoflavone Exposure Does Not Have Feminizing Effects on Men: A Critical Examination of the Clinical Evidence.\"\r\n    Fertility and Sterility.   1 May 2010.", "Kim, Jennifer S., and Sicher, Scott, H.   “Living with Food Allergy: Allergen Avoidance.\"\r\n    Pediatric Clinics of North America.   April 2011.", "Dunford, Nurhan, T. (ed).   Food and Industrial Bioproducts and Bioprocessing.\r\n    Wiley-Blackwell, 2012.   9780813821054   (p. 254).", "National Center for Biotechnology Information, PubChem.   \"Compound Summary for CID 16043.\"", "U.S. National Library of Medicine, TOXNET.   \"HSDB: T-BUTYLHYDROQUINONE.\"", "European Food Safety Authority Scientific Panel.   \"Opinion of the Scientific Panel on Food Additives, Flavourings, Processing Aids and Materials in Contact With Food (AFC) on a Request from the Commission Related to Tertiary-butylhydroquinone (TBHQ).\"\r\n    11 October 2002.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]