["A new ad depicts Trenton officials as a group of rowdy children who have marred their house with gummy carpets and chalk-strewn walls.\n\nBut then Gov. Chris Christie arrives and straightens the place up in the 30-second spot released by Committee for Our Children’s Future, a nonprofit group that supports the governor.\n\n\"For years, politicians have run amok in Trenton and cleaning up their mess hasn't been easy, but [with] Gov. Chris Christie and bipartisan reformers: the most job growth in 11 years, millions in new education funding, two budgets balanced,\" the narrator says in the ad released Jan. 25. \"Christie and reformers are working to strengthen our economy, improve education and cut income taxes for all New Jersey families. Join our reform movement, because cleaning up is never easy, but it's worth it.\"\n\nPolitiFact New Jersey has addressed two of these claims previously: the governor increased education funding this year and he’s balanced two budgets, as he’s required to do.\n\nNow, we’re checking the claim that with Christie and bipartisan reformers, New Jersey had the \"most job growth in 11 years.\"\n\nBrian Jones, a spokesman for Committee for Our Children’s Future, first sent us a Jan. 15 Asbury Park Press article to support the claim. It states that job growth last year \"put the state on pace for its best year since 2000, when it added 77,100 jobs.\"\n\nBut PolitiFact New Jersey’s analysis of the most recent state data, which is still subject to revision, doesn’t support that conclusion.\n\nLet’s look at job growth in the Garden State.\n\nIn 2011, New Jersey gained 39,400 private-sector jobs and lost 3,000 government jobs. The net gain, then, was 36,400 jobs.\n\nIn 2004, the state added 37,700 jobs of which 14,700 were from the public sector\n\nPrior to that, New Jersey had the most job growth in 2000, with an overall increase of 77,100 jobs.\n\nSo, last year New Jersey had the highest total employment growth in seven years.\n\nWhen we reached back out to Jones, he said the statement in the ad was referring to private-sector employment, which grew more last year than in 11 years.\n\n\"There’s been bloated government in Trenton for too long. Governor Christie’s policies are working to trim the fat, while growing private-sector jobs,\" he said.\n\nJoseph Seneca, a professor at the Edward J. Bloustein School of Planning and Public Policy at Rutgers University in New Brunswick, said it’s more appropriate to compare private-sector job growth now.\n\nIn 2011, the state was purposefully \"trying to reduce public-sector employment and the public sector in general,\" he said. \"Whereas in 2004 it was sort of the Wild West, 40 percent of the total growth that year was in the public sector.\"\n\nAs we’ve noted in previous rulings, it’s generally wrong to assign full credit or blame for job growth or job losses to specific individuals. While the governor and bipartisan reformers may have had a hand in creating more jobs other factors are at work, including the nation’s recovery  from a job-destroying recession.\n\nOur ruling\n\nA group that supports the governor  released a video ad that said with Christie and bipartisan reformers, New Jersey had \"the most job growth in 11 years.\"\n\nThe state gained more jobs overall last year than in seven years -- not 11 years. In 2004, the state added 37,700 jobs. In 2011, we added 36,400 jobs.\n\nPublic-sector growth boosted job gains in 2004, while last year the state added jobs despite a decrease in government employment    .\n\nThe ad doesn’t make a distinction in the types of jobs gained, but a spokesman said it was referring to private-sector employment. Last year, New Jersey had the most private-sector job growth in 11 years.\n\nOverall, we rate this statement Half True.", "To comment on this ruling, go to NJ.com.", "Committee for Our Children’s Future’s YouTube Channel, Mess, Jan. 24, 2012\n\nCommittee for Our Children’s Future, CCF Launches Second Television Ad to Promote New Jersey's Reform Movement, Jan. 25, 2012\n\nPolitiFact New Jersey, Television ad promotes Chris Christie’s spending cuts, increased education funding, Oct. 6, 2011\n\nNJSpotlight, Opinion: The Great Recession and NJ’s Lost Employment Decade, May 3, 2010\n\nNew Jersey League of Municipalities, Economy 2012: Grow and Rebalance, Jan. 2012\n\nThe Star-Ledger, Christie supporters plan $1.5M TV campaign to tout his successes, push income tax proposal, Jan. 25, 2012\n\nPolitiFact New Jersey, Chris Christie claims he balanced two budgets while facing $13 billion in deficits and didn’t raise taxes, Oct. 2, 2011\n\nNew Jersey Department of Labor and Workforce Development, Jan-19-12 Unemployment Rate Drops to 9.0 Percent Lowest New Jersey Jobless Rate Since May 2009, Jan. 19, 2012", "New Jersey Department of Labor and Workforce Development, New Jersey Nonagricultural Wage & Salary Employment: 1990 to 2010 (Seasonally Adjusted), accessed Jan. 26, 2012", "New Jersey Department of Labor and Workforce Development, Seasonally adjusted statewide nonagricultural wage and salary employment, accessed Jan. 26, 2012", "New Jersey Department of Labor and Workforce Development, Labor Force Estimates: NJ Monthly Seasonally Adjusted Estimates: 1976-2011, accessed Jan. 26, 2012\n\nAsbury Park Press, NJ jobs are picking up, but it's still a struggle for those without work, Jan. 15, 2012\n\nEmail and phone interview with Brian Jones, spokesman for Committee for Our Children’s Future, Jan. 26, 2012\n\nInterview with Joseph Seneca, University Professor at the Edward J. Bloustein School of Planning and Public Policy at Rutgers University, Jan. 26, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]