["About this rating", "Shortly after the November 2020 U.S. presidential election in which Democratic challenger Joe Biden prevailed over incumbent Donald Trump, social media users circulated a block of text -- purportedly originating with a Prague newspaper -- that termed the U.S. a 'confederacy of fools' for electing Biden:", "But this item was just another piece of repurposed political misinformation, one that had previously featured Donald Trump as its subject, and Barack Obama before him. It was originally presented as a reproduction of a newspaper editorial harshly critical of those who had voted for Obama in 2008, one supposedly published in \"the Prague newspaper, Prager Zeitungon.\" That mention appeared to be a misspelled reference to Prager Zeitung (\"Prague Newspaper\"), a German-language weekly newspaper from the Czech Republic which is also circulated in Germany, Austria and Switzerland. Later versions of this same item attributed that editorial to Václav Klaus, a Czech politician who served as the first prime minister of an independent Czech Republic from 1993 to 1998 and then as the second President of the Czech Republic from 2003 to 2013.", "The attributions of both publication and author were unverifiable, however. The initial version of this item (which was circulated at least as far back as April 2009) provided no contextual information such as a publication date or headline that would facilitate verification of its publication in Prager Zeitung. A search of that newspaper's website at that time pulled up only one article that mentioned Barack Obama, and that article included only an incidental reference about the level of security provided to a U.S. president. No evidence documented that this editorial had been published in either the print or online version of the Prager Zeitung.", "Moreover, not only did no evidence exist showing that Václav Klaus penned this editorial, it was exceedingly unlikely that he would have written anything like it. Václav Klaus and Barack Obama appeared to have a reasonably good working relationship while both were in office, and Klaus had not been otherwise been recorded as writing or saying anything (in public or private) nearly so harshly critical of President Obama as the editorial attributed to him here.", "Marcus Hundt, the editor-in-chief of Prager Zeitung, confirmed that the newspaper “has never published such an article ... about Joe Biden nor about Barack Obama” and that it “primarily reports on events in the Czech Republic and Europe and not on domestic affairs in other counties”.", "This piece has been repurposed to reference a number of other national leaders and politicians from around the globe, including South African president Jacob Zuma, Australian prime minister Julia Gillard, New Zealand prime minister John Key, Northern Mariana Islands governor Benigno Fitial, and Nigerian Delta State governor James Ibori.", "This article was updated to include the version circulated in 2020 that references Joe Biden.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]