["By Saranac Hale Spencer", "Posted on May 28, 2020", "A year-old video spoof that manipulated a television interview to make former Vice President Joe Biden appear incoherent recently has been circulating on social media. But many of those who are posting the video have not disclosed that it was edited and intended as satire.", "Don’t be fooled by an old spoof video that has resurfaced online a year after it was first posted.", "The video shows a manipulated version of former Vice President Joe Biden’s appearance on ABC’s “The View” in April 2019. That month Biden officially entered the race for the Democratic nomination for president and he addressed criticism that he sometimes made women uncomfortable in their interactions with him.", "Biden is asked, “Seven women accused you of touching them without their permission. Are you sorry for what you did? Are you prepared to apologize to those women?”", "The video then splices together pauses and half-thoughts from the whole segment to make it look like that’s how he responded to the question.", "It was originally posted by the Daily Caller in a section of the site labeled “comedy,” and was clearly marked in the upper right-hand corner with the Daily Caller’s logo and the word, “comedy.” Along with the video was this text (emphasis added):", "Daily Caller, April 26, 2019: Joe Biden has a message for the public on his unwanted touching scandal — sort of.", "The former vice president sat down with the hosts of ‘The View’ to address his recent public scandals and talk about his presidential campaign.", "A thoughtful and productive conversation might have ensued … if he didn’t fall over himself stuttering. Here are some highlights of his most incoherent moments.”", "Now the video has resurfaced with little of the original context intact. The Daily Caller logo and the word “comedy” still appear in the upper right-hand corner, but nothing else is included with the social media posts to indicate that it’s a compilation video created as satire.", "In fact, some posts suggest that it’s a legitimate, unedited interview clip. One such example on Twitter, which has gotten 10,000 likes and retweets, says: “biden absolutely bombs on the view… not only can’t he get through a sentence of thought he refuses to apologize after being told exactly what to say by hosts…”", "That post has also migrated to Facebook, where it was shared with more innuendo, saying: “It’s heartwarming to witness each sentence get dismantled by the next thought in his mind.”", "Other Facebook accounts have shared the video, too, without explaining that it’s a manipulated video.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "The View. “Joe Biden on Inappropriate Behavior Allegations Against Him.” YouTube. 26 Apr 2019.", "Peoples, Steve and Thomas Beaumont. “Biden enters Democratic race with strong anti-Trump theme.” Associated Press. 26 Apr 2019.", "Hayes, Christal. “Joe Biden vows to be ‘more mindful’ on same day as three more women make accusations.” USA Today. 3 Apr 2019.", "Daily Caller. “Joe Biden Can’t Keep His Thoughts Straight.” 26 Apr 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]