["About this rating", "Despite his youthful age at the time, Stone did play a consequential role in Richard Nixon's 1972 re-election campaign.", "To say Stone was an \"adviser\" to Nixon is to overstate his role.", "When long-time political operative Roger Stone was arrested on 25 January 2019 in a U.S. Department of Justice (DOJ) Special Counsel-led investigation into Russian interference in the 2016 presidential election, many pundits were quick to draw parallels between Stone's involvement in the campaigns of both presidents Donald Trump and Richard Nixon. Nixon is perhaps best known for becoming the first president to resign, under the cloud of impeachment in 1974.", "But the parallels drawn in news stories were ones that the Nixon Foundation, the charitable organization founded by the 37th president, was eager to debunk. Taking to social media, the Nixon Foundation said that Stone had a minimal role in Nixon's campaigns for election and re-election in 1968 and 1972:", "This morning’s widely-circulated characterization of Roger Stone as a Nixon campaign aide or adviser is a gross misstatement. Mr. Stone was 16 years old during the Nixon presidential campaign of 1968 and 20 years old during the reelection campaign of 1972. 1/2", "— Nixon Foundation (@nixonfoundation) January 25, 2019", "Mr. Stone, during his time as a student at George Washington University, was a junior scheduler on the Nixon reelection committee. Mr. Stone was not a campaign aide or adviser. Nowhere in the Presidential Daily Diaries from 1972 to 1974 does the name \"Roger Stone\" appear. 2/2", "— Nixon Foundation (@nixonfoundation) January 25, 2019", "Stone was charged by Special Counsel Robert Mueller's office with seven counts, including lying to Congress, obstruction of justice, and witness tampering. A political adviser, public supporter and campaign insider to Donald Trump, Stone also has an image of Nixon tattooed on his back and made Nixon's characteristic \"victory\" gesture upon leaving court after being indicted.", "Despite his young age and limited official capacity in Nixon's 1972 re-election campaign, Stone managed to play a consequential role in that event, earning an early reputation as a master of dirty political tricks.", "Timothy Naftali, historian and founding director of the Richard Nixon Presidential Library and Museum in Yorba Linda, California, pointed out that Stone had a much more involved role in Nixon's 1972 re-election campaign than the Nixon Foundation let on. Writing for the Washington Post, Naftali stated that:", "As a member of President Richard M. Nixon’s Committee to Re-Elect the President, better known as CREEP, Stone helped recruit a young operative to spy on a group of Quakers who had set up a peace vigil in front of the Nixon White House. Stone also admitted to Congress that he faked a contribution from the Young Socialist Alliance to Pete McCloskey, a liberal Republican who in 1972 was mounting a challenge to Nixon in the New Hampshire primary. After delivering the $135 in cash and receiving a receipt, Stone then drafted an anonymous letter to the conservative Manchester Union Leader with a photocopy of the receipt to discredit McCloskey.", "Stone did not merely engage in dirty tricks; in 1972, the then-19-year-old Stone was assigned by CREEP official Herbert “Bart” Porter to recruit a spy to penetrate the campaigns of Democratic presidential hopefuls. The secret Nixon agent, Michael W. McMinoway, introduced himself successively into the campaigns of Edmund Muskie, Hubert Humphrey and George McGovern. Stone became his case officer, receiving intelligence from McMinoway via a post office box in Washington.", "Nixon became the first U.S. president to resign from office on 9 August 1974, amid the Watergate scandal, dwindling public approval, and the looming prospect of impeachment. Because of the criminal investigations surrounding his campaign and a parade of scandals plaguing his presidency, Trump has drawn Nixonian comparisons that go beyond Stone's involvement in both candidates' campaigns.", "Nixon fired a series of DOJ officials in order to get rid of special prosecutor Archibald Cox, in an event known historically as the \"Saturday Night Massacre.\" When Trump fired FBI Director James Comey on 9 May 2017, sparking the appointment of Robert Mueller, the Nixon Presidential Library tweeted a humorous homage to Nixon:", "FUN FACT: President Nixon never fired the Director of the FBI #FBIDirector #notNixonian pic.twitter.com/PatArKOZlk", "— RichardNixonLibrary (@NixonLibrary) May 9, 2017", "Naftali, Timothy.   \"How Did Roger Stone Survive Watergate?\"\r\n    The Washington Post.   27 January 2019.", "Hakim, Danny.   \"A Political Operative’s Career: ‘The Stone Zone’.\"\r\n    The New York Times.   22 August 2007.", "Calia, Mike et al.   \"Trump Associate Roger Stone Arrested on 7 Counts, Including Lying to Congress, In Special Counsel Robert Mueller’s Probe.\"\r\n    CNBC.   25 January 2019.", "Toobin, Jeffrey.  \"The Dirty Trickster.\"\r\n    The New Yorker.   2 June 2008.", "Locker, Ray.   \"Donald Trump, Richard Nixon and Watergate: What's the Same and What's Different?\"\r\n    USA Today.   10 May 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]