["About this rating", "Amid a climate of hostility toward the mainstream news media from President Donald Trump and some of his supporters, further controversy appeared in November 2017 when the retail giant Walmart was accused of selling a shirt bearing a slogan alluding to hanging journalists:", "Rope. Tree. Journalist.\nSome Assembly Required.", "The shirt is real and it was temporarily available for sale on Walmart's online store. It is made by the third-party seller Teespring.com. Walmart removed it on 30 November 2017, a day after the Radio Television Digital News Association (a nonprofit group that represents broadcast and digital journalists) wrote to Walmart executives requesting it be taken down.  RTDNA executive director Dan Shelley wrote:", "It is our belief that at the least, T-Shirts or any other items bearing such words simply inflame the passions of those who either don’t like, or don’t understand, the news media. At worst, they openly encourage violence targeting journalists. We believe they are particularly inflammatory within the context of today’s vitriolic political and ideological environment.", "As a fierce proponent of the First Amendment that is politically nonpartisan, we recognize Walmart’s right to sell the T-Shirts, and the right of consumers to purchase and wear them. However, just because Walmart has the right to sell the shirts, that doesn’t mean it is the right thing to do.", "As The Hill points out, the same T-shirt first came to national attention when a supporter of Donald Trump was seen wearing it at a rally in Minnesota, two days before the 2016 presidential election:", "From Trump rally in Minnesota today, via @ReutersPolitics pic.twitter.com/a7CdYT1UCi", "— Breanne Deppisch (@breanne_dep) November 6, 2016", "Journalism can be a dangerous business, particularly in countries in which elected officials are openly hostile to reporters. The Committee to Protect Journalists reports that 48 journalists and eight media workers were confirmed killed as a direct result of their work in 2017 alone.", "Grynbaum, Michael M.  \"Trump Calls the News Media the 'Enemy of the American People.'\"\r\n  New York Times.  17 February 2017.", "Radio Television Digital News Association.  \"Walmart Pulls Threatening Shirt at RTDNA's Urging.\"\r\n  Radio Television Digital News Association.  30 November 2017.", "Breland, Ali.  \"Walmart Takes Down T-Shirt About Killing Journalists.\"\r\n  The Hill.  30 November 2017.", "Update [6 December 2017]: Added clarification that the t-shirt was made by Teespring.com, a third-party seller, and sold on Walmart's web site.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]