["About this rating", "Donald Trump's surprise victory in the 2016 U.S. presidential election led to widely mixed social media reactions, among them a spate of tweets, Facebook posts, and other material concerning the pending \"cut off\" of misnamed \"Obama phones\" (i.e., government-subsidized telephone service for low-income residents):", "They said yall Obama phones cut off in January ????? gotta chill ⚰️?", "— Andrè//DJ Drizzy ? (@flvshy) November 9, 2016", "Lmfao soooooo did those Obama phones really get cut off?? This kid just posted his phone stopped working & he still had 500mins left?☠️? — BLM✨ (@blmmxo_) November 9, 2016", "Rumors or jokes about \"Obama phones\" didn't appear to be based on any actual developments; social media users simply joked that a Trump presidency meant the end of the program. But the Lifeline program, which was originally intended to subsidize landline phones for low-income Americans (and was introduced under President Ronald Reagan in 1984) did not involve President Barack Obama distributing taxpayer-subsidized cellphones to welfare recipients (which President-Elect Trump could summarily confiscate):", "[A growing need for universal access to phones] prompted the Federal Communication Commission to implement the Lifeline benefit program for income-eligible consumers in 1984. That program had two parts: Lifeline Assistance, which provided discounts on basic monthly landline telephone service at the primary residence of qualified telephone subscribers, and Lifeline Link-Up, which provided discounts on the initial installation fee for landline telephone service at the primary residence of qualified telephone subscribers.", "As cell phone usage has increased and cell phone service fees have dropped, the Lifeline program has been expanded to include wireless technology ... From that basic framework, rumors have circulated claiming that \"the Obama administration created a program to give free cell phones paid for by taxpayer money to welfare recipients.\" All the elements of such statements are erroneous or exaggerated.", "Most mentions of \"cutting off ... Obama phones\" appeared to be humorous in nature, but some social media users unfamiliar with the program's details presumed the claims were serious. The Lifeline program is not slated for any major changes or discontinuation based on the 2016 presidential election's outcome (and even if it were, any change would not occur the new administration takes office on 20 January 2017).", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]