["By Brooks Jackson", "Posted on June 22, 2016", "In his recent video address to supporters, Sen. Bernie Sanders said homelessness “is increasing.” Actually, the number of homeless people has decreased steadily each year since 2010, going down by more than 72,000, or 11.4 percent.", "Sanders made his claim in online video remarks he recorded June 16 from a studio in Burlington, Vermont. He said the “political revolution” started by his presidential campaign “is about ending the disgrace that too many veterans still sleep out on the streets. That homelessness is increasing.”", "That’s just not so, according to the most recent figures from the U.S. Department of Housing and Urban Development, which conducts an annual survey of the homeless population.", "HUD’s “2015 Annual Homeless Assessment Report (AHAR) to Congress,” released last November, estimated that there were 564,708 homeless individuals when the survey was taken in January 2015, which was 72,369 fewer than in 2010, and 82,550 fewer than 2007, the earliest year in that report.", "Sanders would have been correct to say that homelessness is increasing in some places, such as Los Angeles. But not nationally.", "His campaign referred us to the National Alliance to End Homelessness, which noted that 16 states reported increases in homelessness in 2015. But twice as many — 33 states and the District of Columbia — reported decreases.", "We won’t argue with Sanders’ statement that “too many” veterans are homeless; HUD estimated the number at 47,725 last year. But the fact is, the number of homeless veterans has gone down even more rapidly than the overall homeless population.", "HUD has only tracked the number of homeless veterans since 2009. The number hit a peak in 2010 of 74,087, and it has declined by 35.6 percent since then.", "Furthermore, Sanders made a specific reference to veterans who “still sleep out on the streets.” Two-thirds of homeless veterans are in shelters, while 34 percent are sleeping on the streets, in cars or other unsheltered locations.", "And the number of those unsheltered vets has declined by 47.1 percent since 2010, an even more dramatic decline than the overall reduction in veteran homelessness.", "So the fact is, both homelessness in general, and veteran homelessness in particular, are going down steadily.", "https://www.sharethefacts.co/share/0b5d5084-6039-4185-b2dc-da572a3afd7c", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]