["An executive order signed by Michigan Gov. Gretchen Whitmer that went into effect mid-April prohibits people from traveling between two residences and bans travel to vacation rentals.", "But an April 13 Facebook post alleges the Democratic governor defied her own rules.", "\"Governor Gretchen Whitmer spent the past weekend at her VACATION COTTAGE at Birch Lake. Violating her own EXECUTIVE ORDER.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We reached out to Whitmer’s office about the post, asking whether the governor had visited a vacation cottage at Birch Lake the weekend of April 11.", "\"This is completely false information,\" a spokeswoman said in an email. \"Posts like these are being spread across social media platforms to create rumors and fear.\"", "Searching for news about the governor and Birch Lake and a vacation home, we found nothing that supported the claim in the Facebook post.", "Whitmer lives in the state’s governor’s mansion but her primary residence is in East Lansing, Mich., according to her 2018 financial disclosure. The document also lists a \"family lake house\" in Elk Rapids, the main town by Birch Lake.", "James Janisse, the Elk Rapids village president, asked Whitmer in an April 6 letter to make people choose between staying at their first and second homes, and to ban future travel between homes. Janisse said in the letter that people arriving in Elk Rapids \"from across the country and state\" to open their vacation homes weren’t self-isolating.", "\"They are busy in our grocery and hardware stores and gas stations, increasing the risk of our vulnerable population, in a county with no ICU beds, and limited regional medical resources,\" he said. \"Parks and trails are bustling, from children playing on closed equipment to vacationers mingling with friends they haven’t seen for months. Propane companies are overwhelmed with service requests for second homes.\"", "The governor’s stricter executive order took effect April 9. In a TV interview that aired on April 10, Whitmer discussed the prohibition on visiting second homes.", "\"I would love to be coming up to Elk Rapids, trust me,\" she said, \"but the fact of the matter is, if I got in the car, I have to go to the gas station and I’ll be touching a gas pump.\"", "On April 24, Whitmer extended her stay-at-home order, including the travel ban concerning vacation homes, through May 15.", "There is no evidence Whitmer visited her family lake house after banning such travel in mid-April.", "We rate this Facebook post False.", "Facebook post, April 13, 2020", "Michigan Executive Order 2020-42 (COVID-19), effective April 9, 2020", "Whitmer Gilchrist for Michigan, Meet Gretchen Whitmer, visited April 23, 2020", "Fox 47, What you should know about the Michigan Governor’s mansions, Nov. 9, 2018", "Politico, ‘The Woman in Michigan’ goes national, April 9, 2020", "Gretchen Whitmer 2018 financial disclosure", "MLive.com, Northern Michigan leader asks Whitmer to make people pick one home amid coronavirus, April 8, 2020", "9&10 News, Gov. Whitmer talks new stay-at-home order in 1-on-1 interview, April 10, 2020", "Office of the Governor, Governor Whitmer extends stay home, stay safe order, directs Michiganders to wear homemade masks in enclosed public spaces, April 24, 2020", "James Janisse letter to Gretchen Whitmer, April 6, 2020", "Email interview with Chelsea Lewis, deputy press secretary for Gov. Gretchen Whitmer, April 22, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]