["Thousands of Facebook users have recently shared a photo of a shirtless man raising his arms, revealing dozens of little red spots on the side of his torso. Next to him stands a man in uniform, wearing a hospital glove. Above the photo, a caption reads:", "“The bumps on this illegal’s body who was detained from the Caravan @ the Border is smallpox. Over ½ of the detainees from that Caravan have tested positive for Tuberculosis which there is no vaccine for. Is the border wall starting to look good now?”", "A variation of the same photo was shared with a similar claim about smallpox in December 2018.", "Although the image is real, both posts are false.", "The man is not a member of one of the migrant caravans that travelled from Central America to the US in 2018 and 2019, the largest of which totalled about 7,000 people in October 2018 according to the United Nations. The photo was taken in 2014 at a US Customs and Border Protection facility in Texas.", "The photo was provided to the Houston Chronicle newspaper by US Representative Henry Cuellar for an article about overcrowded immigrant facilities during a surge in border crossings in 2014.", "The unidentified man in the photo does not have smallpox. Smallpox was officially declared eradicated during the 33rd World Health Assembly. According to the US Centers for Disease Control and Prevention (CDC), the last person to die of smallpox was Janet Parker, a medical photographer in England, in 1978.", "The rash on the man’s torso is a likely a case of scabies, a contagious but treatable skin disease caused by mites. In 2014, a scabies outbreak spread in immigration detention centers and border patrol stations in South Texas’ Rio Grande Valley, amid a surge in irregular border crossings. Here is a report from a local news station on the outbreak.", "The false post also claims that half of the members of the migrant caravan are infected with tuberculosis, and that no vaccine exists to cure it.", "According to the CDC, the Bacille Calmette-Guérin (BCG) is a vaccine for tuberculosis which is given to children in countries where the disease is highly prevalent. This chart compiled from World Health Organization data by the Cato Institute, a US libertarian think-tank, shows 2017 coverage rates for the BCG vaccine in Central American countries.", "The CDC website says BCG is not often recommended for use in the United States.", "In late 2018, some cases of tuberculosis and “flu-like symptoms” were reported in facilities hosting migrants in the Mexican state of Baja California, AFP reported at the time.", "Rodolfo Olimpo Hernandez, president of the state council for migrant care in Baja California, told AFP that amid members of the 2018 caravan they mainly treated chicken pox and pediculosis (lice). “Surely there were some tuberculosis cases but not in proportions out of the ordinary,” he said.", "As for 2019, Mexican Red Cross national coordinator of communication Rafael González told AFP in an email that after recently reviewing the humanitarian agency’s local offices in northern Mexico, there are currently “no records of this disease.”", "In 2017, a total of 9,105 tuberculosis cases were reported in the United States, according to the CDC. This represents a 1.6 percent decrease from 2016, and follows a more general downward trend since 1993. In 2017, 70.1 percent of tuberculosis cases occurred among non-US born persons.", "Refugees and immigrants settling in the United States via regular channels go through a strict tuberculosis screening, and are vaccinated in certain cases.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]