["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Supreme Court Justice Sonia Sotomayor speaks to elementary students in Berkeley, Calif. Radio host Laura Ingraham said Sotomayor came from an immigrant family. (Berkeley Unified School District)", "A note to our readers: A reader recently asked us to look into comments made by conservative talk show radio host Laura Ingraham about Supreme Court Justice Sonia Sotomayor.", "The reader heard that Ingraham said Sotomayor must choose between her \"immigrant family background\" or the U.S. Constitution she is sworn to protect and uphold. We decided the claim was worth looking into and found the clip, but after publishing our fact-check, we noticed that Ingraham's original claim was made in February 2014, not February 2015.", "It's not normal procedure to fact-check a claim a year old. Yet in this case, Ingraham's claim has as many flaws now as it did then -- namely because Sotomayor's family is Puerto Rican and not an immigrant family in the traditional sense.", "We have corrected the fact-check with the accurate dates.", "***", "Puerto Ricans occupy an unusual legal space in America and conservative radio talker Laura Ingraham stumbled in discussing their status.", "Ingraham was inveighing against Supreme Court Justice Sonia Sotomayor, who told an audience she shunned the term \"illegal aliens\" because it \"does seem insulting.\"", "That got Ingraham fired up.", "\"Her duty is to defend the Constitution and the laws of the United States of America, and that’s what she says?\" Ingraham said during a Feb. 4, 2014, broadcast of her radio show. \"Why do we have a Supreme Court Justice whose allegiance obviously goes to her immigrant family background, not the U.S. Constitution?\"", "A reader asked us to check whether Sotomayor comes from a family of immigrants.", "We reached out to Ingraham through her producer and did not hear back.", "Legally speaking, Ingraham’s characterization is inaccurate. Sotomayor’s parents moved to New York City from Puerto Rico during World War II. Puerto Ricans are American citizens, and have been since 1917 when President Woodrow Wilson signed the Jones-Shafroth Act. Puerto Rico became a U.S.-held territory after the 1898 Spanish-American War. The Jones Act granted the island a certain amount of autonomy and carved out a legal patchwork quilt for its residents.", "Puerto Ricans are U.S. citizens who have no vote in Congress, don’t pay federal income taxes on money earned in Puerto Rico and can’t vote in general elections for president. But they can vote in party primaries. Puerto Rico is neither a state nor a country.", "But specific to Ingraham’s focus on illegal immigration, the key point is that as citizens Puerto Ricans can move anywhere they wish in the United States.", "\"Whether people move from California to Texas, or from Puerto Rico to Florida, it’s the same thing,\" said Mark Hugo Lopez, the director of Hispanic research at the Pew Research Center.", "Lopez said the Pew Center and the U.S. Census use the term migrants when talking about people who move from Puerto Rico.", "\"The word ‘immigrant’ is inappropriate because they are citizens at birth,\" Lopez said.", "On the other hand, the distinction between migrant and immigrant can get cloudy.", "Jose Cruz, a political scientist at the State University of New York at Albany, studied how Puerto Ricans worked their way into New York City politics in the 1960s. In an article, Cruz wrote how Puerto Ricans can appear different when seen through a legal lens or a sociological one.", "\"De jure, Puerto Ricans born in Puerto Rico are not immigrants but de facto they are,\" Cruz wrote. \"Not only do most of them look foreign but they are clearly foreign by nationality, ethnicity, culture, and language.\"", "Under the second approach, Sotomayor’s parents would carry with them the qualities of many immigrants.", "Lopez at Pew also said that if he and his colleagues are studying matters of assimilation, they sometimes consider Puerto Ricans under the same umbrella as actual immigrants.", "The confusion between social and legal perspectives can creep into the popular press. When the New York Times reviewed Sotomayor’s book My Beloved World, it referred to \"the corner of Puerto Rican immigrant New York where she was raised.\"", "However, the instances when Puerto Ricans are thought of as immigrants is only in a sociological, not a legal sense. They are citizens and, whatever limits they face while they live in Puerto Rico, all it takes is a move to any state and they immediately enjoy all the rights of full citizenship, including the right to vote for president and write checks to the IRS.", "Our ruling", "Ingraham spoke of Sotomayor’s \"immigrant family background.\" Importantly, Ingraham said this in the context of enforcing American immigration laws. Legally, Sotomayor comes from a family that was always American. Her parents did not immigrate to New York. They moved there, just as Americans have moved around the country for centuries.", "However, we did find that in terms of language and culture, there are times when Puerto Ricans share some characteristics with immigrants, and this can muddy the waters. Researchers sometimes treat Puerto Ricans as immigrants for sociological reasons. Ingraham’s topic was strictly legal, but the element of social identity could have played a role in her meaning.", "Her statement is largely inaccurate but might contain a smattering of truth. We rate her claim Mostly False.", "The Laura Ingraham Show, Feb. 4, 2014", "New Haven Register, Supreme Court Justice Sonia Sotomayor returns to Yale to give lectures, Feb. 3, 2014", "Media Matters, Laura Ingraham's Attacks On Sonia Sotomayor Miss Her All-American Heritage, Feb. 4, 2014", "White House, Background on Judge Sonia Sotomayor, May 26, 2009", "Pew Research Center, Puerto Rican Population Declines on Island, Grows on U.S. Mainland, Aug. 11, 2014", "Library of Congress, Immigration: Puerto Rican/Cuban", "Internal Revenue Service, Is a Person With Income From Puerto Rico Required to File a U.S. Federal Income Tax Return?, Dec. 16, 2014", "Journalist’s Resource, Puerto Ricans in the United States: Research roundup, July 2, 2013", "Library of Congress, Jones-Shafroth Act", "Jose Cruz, The Political Incorporation of (In)Migrants in the United States: The Case of Puerto Ricans, Aug. 22, 2011", "Salon, Laura Ingraham: Justice Sotomayor’s \"allegiance\" is to \"her immigrant family background\" and not the Constitution, Feb. 4, 2015", "Interview, Mark Hugo Lopez, director of Hispanic Research, Pew Research Center, Feb. 16, 2015", "Photo credit: Berkeley Unified School District, via Flickr Creative Commons", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]