["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Attorney General William Barr made the case that voting by mail is \"fraught with the risk of fraud and coercion.\"", "As an example of such problems, he pointed to a case in Texas.", "\"We indicted someone in Texas, 1,700 ballots collected from people who could vote, he made them out and voted for the person he wanted to,\" Barr said in an interview on CNN on Sept. 2.", "The U.S. Justice Department has already walked back this claim, but social media posts continue to echo the attorney general’s inaccurate statement.", "One, from Sept. 17, attributes to Barr a paraphrased statement of what he actually said: \"‘In Texas, we arrested one man who filled out 1,700 ballots. That’s what happens with mail-in ballots.’ - AG Barr.\"", "The Justice Department did not immediately respond to our email about Barr’s statement.", "But here’s what we know from media reports.", "The Justice Department did not indict someone in Texas for casting 1,700 ballots. A spokesperson for the department told the Washington Post that prior to his CNN interview, Barr was \"provided a memo prepared within the department that contained an inaccurate summary about the case which he relied upon when using the case as an example.\"", "In 2017, prosecutors in Dallas County, in Texas, investigated suspected mail-in voter fraud after receiving a tip that voters who had not requested mail ballots received notices that they would receive them, according to the Washington Post.", "The name \"Jose Rodriguez\" appeared on about 700 ballots, indicating that this person helped fill them out. Andy Chatham, who was the assistant district attorney on the case at the time, said that when investigators approached the voters who were said to have cast the ballots, the voters generally said the ballots were legitimate and cast for the candidate they supported, the Post reported.", "\"We didn’t find any evidence of widespread voter fraud, and instead the ballots that were returned were consistent with the voter’s choice,\" the paper quotes Chatham as saying.", "Ultimately, one suspect was arrested in the case — Miguel Hernandez, who pleaded guilty to forging a woman’s signature on a mail-in ballot in a Dallas County municipal election, the Dallas Morning News reported. Elderly voters had alleged that someone forged their signatures on mail-in ballots in a 2017 Dallas City Council race.", "\"He violated the law but not for voting,\" Chatham told ABC News. \"It was for procuring mail-in ballots under false pretenses.\"", "Mike Snipes, another prosecutor, said investigators initially suspected that there were potentially 1,700 fraudulent ballots, \"but we did not uncover that, at all,\" the Post quotes him as saying. \"We actually thought there was voter fraud initially and we couldn’t find it except that little tiny case.\"", "Our ruling", "Barr said that the Justice Department indicted someone in Texas for casting 1,700 fraudulent mail-in ballots in Texas.", "Prosecutors investigated about 700 ballots — not 1,700 — for possible fraud.", "But investigators never found evidence of widespread fraud, and the ballots under scrutiny were cast in favor of the candidates the voter supported.", "\"Everyone who voted in it, their vote counted,\" Chatham told the Morning News. \"They weren’t disenfranchised, and we made sure of this.\"", "We rate Barr’s claim False.", "CNN, Barr says voting by mail is ‘playing with fire,’ Sept. 2, 2020", "The Washington Post, Barr claims a man collected 1,700 ballots and filled them out as he pleased. Prosecutors say that’s not what happened, Sept. 3, 2020", "Facebook post, Sept. 17, 2020", "The Dallas Morning News, AG Barr’s claim of 1,700 fraudulent ballots in 2017 Dallas City Council race not true, prosecutor says, Sept. 4, 2020", "The Dallas Morning News, Bogus voter gets 180 days in Dallas jail for forging mail-in ballot, June 20, 2020", "ABC News, Barr gives false recounting of Texas voter fraud case in effort to cast doubt on mail-in voting, Sept. 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]