["“USA Arrested A Chinese Scientist That Created Coronavirus (sic),” reads the caption on a video shared more than 3,500 times by MOB TV, a Facebook page covering Nigerian news.", "The clip features two officials from the US Department of Justice holding a press conference.", "“We're here today to announce three separate cases highlighting the ongoing threat posed by Chinese economic espionage and research theft,” one of the men says, standing in front of a US Department of Justice sign.", "“China’s communist government's goal, simply put, is to replace the United States as the world’s leading superpower and they’re breaking the law to get there,” his colleague says later on in the footage.", "However, at no point do they refer to the coronavirus pandemic that has claimed more than 50,000 lives around the world as of April 3, 2020.", "AFP ran a reverse image search on the video using the InVID We Verify tool, which traced the footage to local news reports on a press conference on January 28, 2020, in Boston, Massachusetts.", "At the conference, US Attorney for Massachusetts Andrew Lelling and the head of Boston’s Federal Bureau of Intelligence (FBI), Joseph Bonavolonta, announced the arrest of a Harvard scientist and two Chinese nationals for hiding alleged ties to China.", "AFP reported that US prosecutors charged the chairman of Harvard University’s chemistry and chemical biology department Charles Lieber with hiding his alleged role in a Chinese government programme that security officials say steals trade secrets.", "Two other scientists, both Chinese nationals, were also charged as part of an investigation into hundreds of cases of alleged theft by Chinese scientists in the US.", "The arrests were widely covered by local media, who broadcast footage from the original press conference.", "Similar posts shared thousands of times on Facebook claim the FBI arrested a professor at Boston University, rather than Harvard. \"He is very clear that the corona virus is a bio-attack planned and led by China (sic)”, reads one post shared more than 15,000 times since April 26, 2020.", "Contacted by AFP Fact Check, FBI spokeswoman Kristen M. Setera confirmed that the post was incorrect.", "\"We did not arrest a Boston University professor in connection with the COVID-19 outbreak,\" she said via e-mail.", "The posts also recommend inhaling steam to kill the virus, although health experts told AFP that doing so is not an effective treatment and can in fact be harmful.", "Experts have refuted the theory that the new coronavirus was deliberately created. In a letter published in The Lancet medical journal, various public health scientists said that the virus “originated in wildlife”.", "“We stand together to strongly condemn conspiracy theories suggesting that COVID-19 does not have a natural origin. Scientists from multiple countries ... overwhelmingly conclude that this coronavirus originated in wildlife, as have so many other emerging pathogens,” it reads.", "Scientists at the Ohio State University in the US also published a paper concluding there was “no credible evidence” that the new coronavirus was engineered in a laboratory.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]