["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "News that legendary basketball star Kobe Bryant died Sunday in a helicopter crash shook the basketball community, the country and the world.", "But in the wake of tragedy, misinformation about the identity of the victims who lost their lives in the crash has also spread online.", "Viral posts, like this one, falsely claim that Rick Fox, a former NBA player and teammate of Bryant’s, was also on board the helicopter and died in the crash.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Fox was not among those killed in the crash. His stepdaughter, Jillian Hervey, confirmed that he wasn’t on board.", "To confirm my stepdad Rick Fox is ALIVE and safe! I just got off the phone with my sister. We are all in shock and deeply saddened but please don’t spread false news. #ripkobe 💔 pic.twitter.com/vGSAShagkk", "Jared Greenberg, a reporter for NBATV, also tweeted that he spoke to Fox himself who confirmed he was not involved.", "I have personally communicated with Rick Fox via text since the news about Kobe dying came out PLEASE STOP spreading “news” unless you personally can confirm it!", "So far, seven of the nine people killed in the crash have been identified. The group was headed to a girls’ basketball game which Bryant was scheduled to coach. Victims include an assistant coach, parents and players from the club team, including Bryant’s 13-year-old daughter, Gianna; and the pilot of the helicopter.", "This claim is False.", "Facebook post, Jan. 26, 2020", "Los Angeles Times, Victims of the Calabasas helicopter crash: Who they were, Jan. 27, 2020", "Twitter, Jillian Hervey tweet, Jan. 26, 2020", "Twitter,  Jared Greenberg tweet, Jan. 26, 2020", "People, Rick Fox Not Among Those Killed in Kobe Bryant Helicopter Crash, Stepdaughter Says, Jan. 26, 2020", "Yahoo, Rick Fox Not Among Those Killed in Kobe Bryant Helicopter Crash, Stepdaughter Says, Jan. 26, 2020", "CBS, Rick Fox not a passenger in helicopter crash that killed Kobe Bryant, eight others, Jan. 26, 2020", "Fox 61, VERIFY: Fact-checking rumors that spread after Kobe Bryant’s death in helicopter crash, Jan. 26, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]