["About this rating", "In early October 2018, social media users recirculated variations of a news item that, while legitimate, was something that had been resolved in the courts months earlier.", "The story, first reported by the website LawNewz on 28 September 2017 and subsequently picked up by other news outlets, concerned the Department of Justice's (DOJ) efforts to gather information from Facebook accounts in connection with a protest against President Donald Trump's inauguration.", "The DOJ served search warrants against Facebook seeking information on activists Legba Carrefour and Lacy MacAuley, as well as a separate warrant against Emmelia Talarico, who operated the Facebook page DisruptJ20, now known as Resist This! According to the American Civil Liberties Union (ACLU), who filed a motion to intervene, the warrants were overly broad and would have required disclosure of information about thousands of people who were not targets of the investigation:", "The American Civil Liberties Union of the District of Columbia (ACLU-DC) went to court today to block the enforcement of search warrants targeting three Facebook accounts as part of the government’s investigation and prosecution of activists arrested on Inauguration Day 2017 in Washington D.C.", "Two of the warrants would require Facebook to disclose to the government all information from the personal Facebook profiles of local DisruptJ20 activists Lacy MacAuley and Legba Carrefour from November 1, 2016 through February 9, 2017. Although the warrants claim to seek only evidence in support of the government’s prosecutions of January 20 demonstrations, they demand—among other things—all private messages, friend lists, status updates, comments, photos, video, and other private information solely intended for the users’ Facebook friends and family, even if they have nothing to do with Inauguration Day. The warrants also seek information about actions taken on Facebook, including all searches performed by the users, groups or networks joined, and all “data and information that has been deleted by the user.”", "The third search warrant was issued for the “DisruptJ20” Facebook page (now called “Resist This”), administered and moderated by Emmelia Talarico. Although the page is public, the warrant would require the disclosure of non-public lists of people who planned to attend political organizing events and even the names of people who simply liked, followed, reacted to, commented on, or otherwise engaged with the content on the Facebook page. During the three-month span the search warrant covers, approximately 6,000 Facebook users liked the page.", "The warrants were originally filed in February 2017 but were accompanied by a gag order. They came to light shortly after the DOJ dropped the gag order, allowing Facebook to notify the three targeted individuals.", "On 13 November 2017, D.C. Superior Court Chief Judge Robert E. Morin ruled that while Carrefour and MacAuley had not been charged in connection with activities during the inauguration protests that past January, authorities could still request a search of their accounts.", "However, Morin also ruled that the names of their friends and anyone who exchanged messages with the duo be redacted. Morin also ordered Facebook to redact the identities of about 6,000 users who \"liked\" or followed the DisruptJ20 Facebook page.", "\"While the government has the right to execute its warrants, it does not have the right to rummage through the information contained on the Facebook accounts and discover the identity of, or access communications by, individuals not participating in alleged criminal activity, particularly those persons who were engage in protected First Amendment activities,\" Morin wrote.", "The individual targets of the search -- Lacy MacAuley and Legba Carrefour -- have not been charged with any crime. The judge ordered the names redacted of MacAuley's and Carrefour's Facebook friends and the names of anyone who communicated with the two.", "But Morin ruled that because the government has \"established probable cause to believe that criminal activity is likely to be found in the individual accounts,\" investigators can review those communications and postings.", "In July 2017, the DOJ also served a separate warrant to the web hosting company DreamHost seeking Internet provider (IP) addresses and other information for 1.3 million visitors to the site DisruptJ20.org:", "On 17 July, the DoJ served a website-hosting company, DreamHost, with a search warrant for every piece of information it possessed that was related to a website that was used to coordinate protests during Donald Trump’s inauguration. The warrant covers the people who own and operate the site, but also seeks to get the IP addresses of 1.3 million people who visited it, as well as the date and time of their visit and information about what browser or operating system they used.", "The website, www.disruptj20.org, was used to coordinate protests and civil disobedience on 20 January, when Trump was inaugurated.", "Morin ruled in November 2017 that DreamHost could redact users' IP and email information while still complying with the warrant:", "Morin has wrestled with how prosecutors could obtain information on DreamHost Web users who might have planned or participated in the Jan. 20 riots without also turning over information on users who had no involvement.", "\"While the government has the right to execute its warrant, it does not have the right to rummage through the information contained on DreamHost's website and discover the identity of, or access communications by, individuals not participating in alleged criminal activity, particularly those persons engaged in protected First Amendment activities,\" Morin, the court's chief judge, wrote in his ruling.", "Prosecutors from the U.S. attorney's office in the District have filed felony rioting charges against about 200 people who they say participated in the riots. The disturbances left six police officers injured and caused tens of thousands of dollars in damage when businesses in downtown Washington were vandalized.", "Morin required prosecutors to submit a plan as to how they will review the data ... After prosecutors complete their review, they will have to submit to the judge an \"itemized list\" of information they contend is relevant to the criminal case. If Morin decides the information is indeed evidence of criminal activity, he will require DreamHost to turn over the users' identifying information. In addition, prosecutors will also need approval from the judge if they wish to retain any of the information.", "Information that will be redacted includes names, addresses, email addresses, IP addresses, and email or blog content that would identify individual users.", "Luperon, Albert.   \"DOJ Seeking Info on 6,000 People Who ‘Liked’ Anti-Trump Facebook Page.\"\r\n    LawNewz   28 September 2017.", "Schneider, Jessica.   \"DOJ Demands Facebook Information from 'Anti-Administration Activists.'\"\r\n    CNN   30 September 2017.", "Wong, Julia Carrie and Olivia Solon.   \"US Government Demands Details on All Visitors to Anti-Trump Protest Website.\"\r\n    The Guardian.   15 August 2017.", "Marimow, Ann E.   \"Judge Limits Search of Facebook Accounts Connected to Inauguration Day Protests.\"\r\n    The Washington Post.   13 November 2017.", "Alexander, Keith L.   \"Judge Lets Internet Firm Redact User-Identifying Data in Information Provided to Prosecutors in Rioting Case.\"\r\n    The Washington Post.   10 October 2017.", "American Civil Liberties Union.   \"ACLU-DC Seeks Protection for Personal Facebook Accounts Against Inauguration Day Search Warrants.\"\r\n    28 September 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]