["By Jessica McDonald", "Posted on October 30, 2018", "Two weeks ago, Sen. Elizabeth Warren released the results of a genetic test showing she has a small but detectable amount of Native American DNA. The report concluded there is “strong evidence” she had a Native American ancestor approximately six to 10 generations ago. But many have misconstrued the results — including President Donald Trump, who wrongly claimed Warren “doesn’t have any Indian blood.”", "Warren’s release, which was widely interpreted as a sign that she intends to run for president in 2020, comes after years of controversy over her heritage. Warren has previously said she was part Cherokee and Delaware Indian, based on stories she heard growing up. Her ancestry first became a political issue in 2012, when she ran for Senate in Massachusetts. Critics questioned whether she received any advantages from claiming Native American ancestry — an idea we’ve addressed before (there’s no evidence she benefited).", "Subsequently, Trump took to calling her “Pocahontas,” and during a rally this past July, challenged her to take a DNA test, saying he would donate $1 million to charity “if you take the test and it shows you’re an Indian.”", "The new findings support Warren’s claim that she has at least one Native American ancestor, although they cannot reveal whether that individual was a member of any specific tribe. The results were not peer-reviewed, as they would be in a formal scientific publication, but four anthropological geneticists told us the methodologies were valid and the conclusions reasonable.", "Trump, however, interpreted the findings differently. Over a series of tweets, he called the test “bogus” and said the results showed Warren might have less Native American DNA than the “average American.”", "Now that her claims of being of Indian heritage have turned out to be a scam and a lie, Elizabeth Warren should apologize for perpetrating this fraud against the American Public. Harvard called her “a person of color” (amazing con), and would not have taken her otherwise!", "— Donald J. Trump (@realDonaldTrump) October 16, 2018", "Pocahontas (the bad version), sometimes referred to as Elizabeth Warren, is getting slammed. She took a bogus DNA test and it showed that she may be 1/1024, far less than the average American. Now Cherokee Nation denies her, “DNA test is useless.” Even they don’t want her. Phony!", "— Donald J. Trump (@realDonaldTrump) October 16, 2018", "In campaign rallies in Montana, Arizona, Texas and, most recently, Illinois, the president has claimed to be more Native American than Warren.", "Trump in Murphysboro, Illinois, on Oct. 27: But how do you lose a debate where you say as an example — no, we can’t use Pocahontas anymore. She’s got no Indian blood. We can’t use the name. He says call her Pocahontas. I can’t do it. She doesn’t have any Indian blood. I have more than she does, and I have none. Right? I have none, but it’s more than her.", "On each of these points, Trump is wrong or comes to an unsubstantiated conclusion:", "Before explaining more of the science, it’s important to say, as others have done elsewhere, that DNA tests like the one Warren took have no bearing on Native American identity or tribal membership. As a result, even if Warren’s test showed she had a substantial amount of Native American DNA, that would not make her “Native American.” Native identity is socially and culturally determined, and cannot be reduced to a DNA ancestry test.", "While lineage often matters to tribal membership, it is not established by modern genetic tests that assess overall ancestry. Some, but not all tribes, for example, use a system called “blood quantum,” which requires members to meet certain cutoffs, such as one-quarter or one-half, to officially join as citizens. (This system, it should be noted, began as a forced policy under the federal government, and is therefore viewed as problematic by many.) Other tribes, including the Cherokee Nation, don’t have specific blood quantum requirements, but require proof of descent from an enrolled member in the historical record.", "For tribes using blood quantum, these fractions do not correspond to an exact percentage of Native American DNA a person might have — thanks to a quirk of biology that we’ll explain later, it’s more variable than that. Instead, they use an approximate value, such as whether an individual has one fully Native parent or grandparent. Tribes might use basic DNA tests, such as paternity tests, in an effort to establish links to certain individuals, but none accepts results from the type of test Warren took.", "Warren has stated that she understands the difference “between citizenship and ancestry,” and that she is not claiming anything other than ancestry. But many people in indigenous communities, including the Cherokee Nation, found Warren’s decision to release her DNA results offensive. We won’t be wading into that debate any further. Instead, we’ll stick to addressing the scientific claims surrounding Warren’s test.", "We don’t know all the details about how the test was done because the Stanford geneticist, Carlos Bustamante, did not respond to repeated requests for an interview. But based on the released report, the general methods are similar to what would happen if you sent your DNA to a company like 23andMe or Ancestry.com.", "The technique is a form of genotyping that uses something called a DNA microarray, or what is more popularly known as a DNA chip. The chips are essentially glass microscope slides covered with tiny dots of DNA, and they can reveal a person’s DNA sequence at hundreds of thousands of spots across their genome. These spots, many of which are single nucleotide polymorphisms, or SNPs, are useful to check because scientists already know something about them.", "For one, they’re known to be variable across different populations and between individuals. This is important, since humans share the vast majority of their DNA with each other. Second, the SNPs are usually selected because they tend to associate with certain health conditions, physical features or ancestries. In this way, someone can get a lot of information about their genome without having to sequence it. Sequencing is a different method that reads out the entire string of DNA letters, or bases — all of the A, T, C and Gs — in a given piece of DNA. It is much more expensive than chip-based genotyping, especially when applied to the 3 billion bases of a person’s genome (or 6 billion, if covering both sets of chromosomes).", "Ancestry information ultimately comes from comparisons of a person’s tested genetic variants to those of other individuals. In Warren’s case, scientists compared 660,173 spots of genetic variation to those of 148 people who had had their entire genomes sequenced as part of the 1000 Genomes Project. The 1000 Genomes Project was a collaborative effort by scientists across the globe to better understand human genetic variation, and involved sequencing more than 2,500 genomes from 26 different populations. These genomes are handy as references genomes, which is how they were used here. Warren’s comparison group was equally split between Europeans, Africans, East Asians and those with Native American ancestry. The analyst made the comparisons using a computer program called RFMix, which Bustamante’s group developed and previously established as a reliable tool.", "To confirm evidence of Warren’s Native American ancestry, researchers also compared Warren’s DNA data to two other sets of reference populations from the 1000 Genomes Project: 99 people from Utah with European ancestry, and 86 people from Great Britain, also with European ancestry.", "According to the report, Warren’s test results show that she is of “primarily European descent,” but also that she has at least five genetic segments that are “Native American in origin at high confidence.”", "One of these segments is larger than the others, spanning about 4.7 million bases, and further analysis indicates this DNA chunk has a genetic signature one would expect from a person having European and Native American heritage. The total length of all of Warren’s Native American-assigned segments is about 12.3 million bases, which the report states is about 12.4 times greater than the average in the Great Britain reference population, and 10.5 times greater than the average in the Utah population. Bustamante concludes there is “strong evidence” for a Native American ancestor roughly six to 10 generations ago.", "All of the anthropological geneticists we consulted felt the test was performed as well as it could have been, given the available data.", "“Carlos Bustamante is a very respected researcher,” said Jeffrey Long of the University of New Mexico in a phone interview. “What I’ve seen makes sense to me.” (Bustamante is also an adviser to both 23andMe and Ancestry.com.)", "Long added that while Warren doesn’t appear to have a lot of DNA from a Native American ancestor, it’s “probably proof” there was one, and that the six to 10 generations figure was “appropriately cautious.”", "“The methods that they used are among the best that are out there today,” said Deborah Bolnick of the University of Connecticut in a phone interview.", "She said the test still had limitations, largely because of the lack of available Native American data sets, but that the limitations “don’t influence the idea that she had an indigenous ancestor.”", "For example, in the analysis, the Native American samples came from people from Mexico, Peru and Colombia. Ideally, Warren’s DNA would be compared to that from Native Americans living in the United States — but that data isn’t publicly available.", "These other samples can still be used, however, because there is enough shared ancestry. Many people living in North and South America today, Bolnick explained, still retain genetic variants that emerged in more ancestral populations, and therefore these people can serve as legitimate comparisons to determine whether an individual descended from the first people of the Americas.", "While the results are clear on the basic findings, things get murkier when people attempt to extrapolate beyond them.", "“It’s hard to say more than, ‘Yes, it’s clear she has Native American ancestry,’” said Long.", "Shortly after Warren’s release, critics began to question whether she has more Native ancestry than other white Americans. Using the six to 10 generations figure, a Republican spokesman and an op-ed writer converted this to fractional ancestry (1/64 to 1/1024), which they then compared to a number appearing in a 2014 study published in the American Journal of Human Genetics. The paper, which was written by 23andMe researchers and colleagues, analyzed the genetic ancestry of more than 160,000 23andMe customers who self-identified as either African American, Latino or European American. For European Americans, the genome-wide “mean estimate” of Native American ancestry was 0.18 percent (given in table 1). Because this percentage is higher than the equivalent percentage for the 10 generations fraction (0.098 percent), these critics concluded Warren might have less Native American ancestry than the “average” white American.", "Trump appears to have picked up this line of thinking, saying in an Oct. 16 tweet that the test showed that Warren “may be 1/1024, far less than the average American,” and in his Oct. 18 speech in Montana that “the one good thing about her test is that there was so little she had less than the average American.”", "This is problematic for several reasons, the first being that the Bustamante report never specifies a fraction or percentage, so these estimates are derived from a back calculation from the six to 10 generation estimate. As others have written, this incorrectly assumes equal inheritance through time from all of your ancestors — something that simply doesn’t happen. Biology is more random, and because of the way DNA is passed down, these fractions may not represent the true amount of DNA a person retains from each ancestor.", "In fact, there is a surprisingly high chance that a person will receive no DNA from a relatively recent ancestor. Graham Coop, an evolutionary and populations geneticist at the University of California, Davis, for example, has estimated there’s about a 13 percent chance a person will not get any genetic material from an ancestor from eight generations ago. At 10 generations, this jumps to about a 50 percent chance. This reveals a fundamental discrepancy between ancestry and genetics, since a person’s ancestry can still be true, and yet they might not have any trace of it in their bodies.", "Even if we had a more precise estimate of the amount of Native American DNA Warren carries, it still would be inappropriate to use the 23andMe study to come to definitive conclusions about how Warren stacks up.", "That’s because, Bolnick explained, the 23andMe percentages were calculated using different genetic data and different statistical tools. “They’re not comparable,” she said.", "Furthermore, because the 23andMe data come from customers, the information is not necessarily representative of all of white America, as this population had the interest in and the means to pay for a genetic test. While this may be the best estimate we have, it’s still not a random sample.", "“I don’t think it’s way off, but we’re talking about really small numbers here,” cautioned Long.", "Others have pointed to the Utah reference population — which had on average just a tenth of Native American DNA as Warren’s sample — as a more relevant comparison. But Bolnick and Long don’t think this population is representative of the entire U.S., either.", "Several of the anthropological geneticists we spoke to also found the entire concept of an “average” Native American ancestry in white Americans questionable, as this ancestry fluctuates a great deal based on geography and past events.", "In the end, with respect to the “average” claim, Bolnick said, “I don’t think we have enough data to answer whether she does or does not have more.”", "The most that can be concluded, then, is that Warren’s test results are consistent with someone who has a small amount of Native American ancestry.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]