["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Conservative blogs accused Democrats of sitting through an ovation for the widow a slain Navy SEAL during President Donald Trump’s first address to Congress, but video shows a different story.", "In his speech, Trump thanked Carryn Owens, who was married to William \"Ryan\" Owens, the SEAL killed in a Jan. 29, 2017, raid in Yemen. The mention drew the crowd to their feet for extended applause, lasting more than two minutes. But some outlets focused on what they saw as disrespect from Democrats.", "\"Horrible! Top Democrats refuse to stand for Gold Star widow,\" read the headline on a March 1, 2017, post on 100PercentFedUp.com.", "A photo showed U.S. Reps. Debbie Wasserman Schultz of Florida, the former chairwoman of the Democratic National Committee, and Keith Ellison of Minnesota, the current deputy chairman of the DNC, seated together. (Snopes determined the image was taken more than a half an hour prior to the ovation.)", "Another post from DailyWire.com read, \"Awful: Top Democrats refuse to stand, clap for Navy SEAL widow honored by Trump.\" That post originally showed the same photo of Wasserman Schultz and Ellison but was later changed after we inquired about it. The post also excoriated House Minority Leader Nancy Pelosi and U.S. Sen. Bernie Sanders of Vermont by name. The post did say that \"Democrats initially stood for the widow,\" but the headline suggests otherwise.", "TheBlaze.com said the incident was \"truly disgusting.\" Other posts focused on Twitter outrage over the incident. State GOP organizations piled on.", "Even Florida Sen. Marco Rubio mentioned the incident the morning after the speech on Fox & Friends.", "\"I turned back around my shoulder and I see half the room, most of them sitting down, I was just shocked by that,\" Rubio said. \"I noticed as soon as the speech was done they got up and walked out.\"", "The show alluded to the incident with a chyron that read, \"Dems sat during POTUS tribute to SEAL’s widow.\"", "Democrats weren’t too thrilled with Trump’s speech, to be sure. But upon reviewing recordings of the speech, there’s ample evidence that Democrats did stand — just not as long as their Republican counterparts. And that’s a fairly typical thing for the opposition party to do, an expert told us.", "Tale of the tape", "Ryan Owens was the first American combatant killed during the Trump administration. Critics have questioned whether the raid in which he was killed should have been approved, and Owens’ father refused to meet with Trump. More recently, Trump been criticized for appearing to assign the blame to the military.", "Here’s a breakdown of what happens in the video.", "Video time stamp  (approx.)", "What’s happening", "The scene", "0:30", "Trump says, \"We are blessed to be joined tonight by Carryn Owens, the widow of U.S. Navy special operator, Senior Chief William \"Ryan\" Owens. Ryan died as he lived: a warrior, and a hero — battling against terrorism and securing our nation.\"", "Both sides of the aisle stand to acknowledge Owens. In the lower lefthand corner of the video you can see Ellison and Wasserman Schultz standing. Sanders is seen standing a few rows closer to the front.", "0:45", "Republicans and Democrats sit down and Trump continues.", "1:20", "Trump says, \"I just spoke to our great Gen. Mattis, just now, who reconfirmed that, and I quote, ‘Ryan was a part of a highly successful raid that generated large amounts of vital intelligence that will lead to many more victories in the future against our enemy.’ Ryan’s legacy is etched into eternity.\"", "People in the chamber rise and applaud. The video shows Carryn Owens in the gallery.", "1:50", "The camera pans away to show Democrats and Republicans both standing. Some Democrats begin to take their seats. We can see Pelosi standing, but it appears Wasserman Schultz, Ellison and Sanders are seated.", "2:00", "A wide shot shows that many Democrats have sat down. Republicans remain standing.", "2:20", "Most Democrats are seated, but it appears some are still clapping, and some are standing.", "2:55", "Applause ends and entire chamber sits down.", "This video from NBC shows some different angles, including a wide, panning shot showing Democrats seated while Republicans cheer.", "That image was used on some blogs to \"prove\" Democrats didn’t stand, but it’s actually about 2 minutes and 45 seconds into the NBC video.", "Breaches of etiquette do happen during speeches before Congress — U.S. Rep. Joe Wilson, R-S.C., shouted \"You lie!\" during a 2009 speech by President Barack Obama.", "\"Republicans often sat stone-faced during Obama's State of the Union addresses. Democrats laughed derisively when Reagan promised to balance the budget,\" said Craig Smith, a former speechwriter for Gerald Ford and George H.W. Bush and director emeritus of the Center for First Amendment Studies at California State University, Long Beach.", "Smith said Trump’s tribute to the Navy SEAL was a \"moment unmatched since Reagan paid tribute to Lenny Skutnick, who actually was in the gallery. And that began the tradition.\"", "Skutnik was a former Congressional Budget Office employee who helped rescue a plane crash survivor from the Potomac River in January 1982. Reagan recognized him days later in his State of the Union speech, which is considered the first time the practice of noting an ordinary citizen became routine.", "Our ruling", "Bloggers said, \"Top Democrats refuse to stand for Gold Star widow.\"", "That makes it sound as if the blue side of the aisle stubbornly stayed seated while the GOP cheered for the widow of a Navy SEAL killed in a raid in Yemen. A more accurate headline would be, \"Top Democrats don’t stand as long as Republicans for Gold Star widow.\" A video review shows Democrats including Sanders, Pelosi, Wasserman Schultz and Ellison stood.  But most sat down while Republicans renewed their applause.", "To say they outright refused to stand up is inaccurate. We rate these headlines False.", "100PercentFedUp.com, \"HORRIBLE! TOP DEMOCRATS Refuse To Stand For Gold Star Widow,\" March 1, 2017", "CNN, \"Rep. Wilson shouts, 'You lie' to Obama during speech,\" Sept. 10, 2009", "Politico, \"How Lenny Skutnik, Reagan’s SOTU Hero, Soured on Obama’s America,\" Jan. 12, 2016", "Washington Post, \"The White House says a deadly raid in Yemen was long planned in Washington. Not true, say officials who served Obama.,\" Feb. 2, 2017", "Miami Herald, \"Slain SEAL’s dad wants answers: ‘Don’t hide behind my son’s death’,\" Feb. 26, 2017", "The Hill, \"Trump appears to blame generals for SEAL's death in Yemen raid,\" Feb. 28, 2017", "NBC News, \"Trump Honors Widow of Fallen Navy SEAL William 'Ryan' Owens in Address to Congress,\" Feb. 28, 2017", "DailyWire.com, \"AWFUL: Top Democrats Refuse To Stand, Clap For Navy SEAL Widow Honored By Trump,\" Feb. 28, 2017", "USA Today, \"GOP lawmakers cheer Trump's speech as Democrats sit stone-faced,\" Feb. 28, 2017", "McClatchy via YouTube, \"Widow of slain Navy SEAL receives standing ovation during Trump speech,\" Feb. 28, 2017", "Snopes, \"Did Democrats Refuse to Stand for a Navy SEAL's Widow?,\" March 1, 2017", "TheBlaze.com, \"Matt Walsh: Democrats, that shameful performance proves why normal Americans despise your party,\" March 1, 2017", "Fox & Friends via Facebook, Marco Rubio interview excerpt, March 1, 2017", "Interview with Craig Smith, Center for First Amendment Studies at California State University, Long Beach, director emeritus, March 1, 2017", "Interview with Ben Shapiro, DailyWire.com editor, March 1, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]