["About this rating", "This photograph shows \"Cannon Colossus,\" who was once billed as the \"world's heaviest man.\"", "The date of this image, as well as the nationalities and identities of the other two card players, is unclear. The tall man is likely \"Cornelius Brum,\" another \"freak show\" performer who drew audiences due to his height.  While circus performers were billed, for instance, as the \"world's heaviest man,\" we can't confirm that any of these men was indeed the world's shortest, tallest, or fattest person for his respective time.", "A photograph frequently shared on social media supposedly shows three men playing cards circa 1919 who were Europe's \"tallest, shortest, and fattest,\" respectively:", "We have not been able to find a definitive source for this image, and we don't know enough about the men pictured to confirm if their respective superlatives were accurate, but we'll piece together all that we could find in the article below.", "It appears that the man on the right is Egon Cannon Erven, better known as \"Cannon Colossus,\" who appeared at \"freak shows\" in the 1900s where he was billed as the world's heaviest man. We're less certain about the identities of the other two individuals. The tall man is likely \"Cornelius Brun,\" who, like Colossus, was a public attraction for being a \"giant.\" We found one post identifying the third person in this image as a 70-year-old dwarf named Flea, but we don't have much faith in that identification.", "Egon Cannon \"Colossus\" was a relatively well-known \"freak show\" performer in the early 1900s. We have found several postcards featuring images of \"Colossus\" and captions that labeled him as the \"world's heaviest man.\"", "We have not been able to find too much biographical information about Cannon. In September 1917, the Journal Gazette of Mattoon, Illinois, mentioned Cannon in an article about \"many freaks of the modern circus.\" He reportedly weighed 804 pounds at the time.", "It seems likely that this card-playing image was originally circulated as a postcard. While we have not been able to find a definitive source for this image, we did find a version on the now-defunct website thetallestman.com that carried a French caption: \"CANNON, le Colosse Géant Hollandais pesant 738 livres, faisant une partie avec le plus grand Cosaque Russe et le Nain Puce âgé de 70 ans.\" This translates roughly to \"Cannon, the giant Dutch colossus weighing 738 pounds, playing a game with the tallest Russian Cossack and the 70-year-old flea dwarf.\"", "This image does not carry a date but it was likely taken, like the other postcards of Cannon, sometime in the early 1900s.", "The two other people in this photograph are also likely circus performers, but we are less sure about their identities. It's possible that the tall man in this image is Cornelius Brum, another circus performer who toured as a \"giant.\"", "Information about Brun has been even harder to come by. The State Library of Victoria, Australia, has two images of these unusually sized men. The image of Colossus carries a German caption which states that this man weighed \"more than 5 normal people\" at 634 pounds. The image of Cornelius simply notes that he was an exhibition giant.", "While we have not found any other images of Cannon and Brun together, we did find a newspaper clipping from 1913 that billed the appearance of Cannon Colossus, \"the heaviest man living,\" and \"Greta and Cornelius,\" \"the tallest pair,\" (possibly a reference to Cornelius Brum) at an amusement park in Australia:", "Wed, Apr 9, 1913 – Page 16 · The Age (Melbourne, Victoria, Australia) · Newspapers.com", "We know the least about the third man in this photo. The only tidbit we could uncover comes from the aforementioned caption that listed this person as a \"70-year-old dwarf.\"", "In short, this photograph appears to show three performers who toured with a traveling circus in the early 1900s. The tallest and the fattest men in this picture are likely Egon Cannon Colossus and Cornelius Brun, while the third person in this photo remains unidentified.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]