["About this rating", "On June 30, 2020, U.S. President Donald Trump -- in reference to an ongoing controversy over the display and removal of monuments and statues associated with slavery and the Confederacy -- tweeted that \"This is a battle to save the Heritage, History, and Greatness of our Country!\":", "Shortly afterwards, a meme circulated via social media presented Trump's words as a perfect echo of a passage in a speech given by German dictator Adolf Hitler some eighty years earlier, in which the latter supposedly proclaimed, “Dies ist ein Kampf um die Rettung des Erbes, der Geschichte und der Größe unseres Landes!”:", "However, this statement -- as worded here -- is not a documented utterance of Hitler's. It appears that someone just ran the wording of Trump's tweet through Google Translate and attributed the result to Hitler, as references to this phrasing are not found elsewhere and only appeared on the internet at the same time the meme itself did.", "Hitler did give a speech on Jan. 30, 1939, the infamous Reichstag Speech in which he warned \"the German public and the world that the outbreak of war would mean the end of European Jewry.\" During that speech, Hitler did talk of the importance of preserving Germany and its culture, but he did not phrase that concept as succinctly as presented in the meme, and he was primarily speaking out against the incursion of foreigners and Jews into German territory and government, not warning against an internecine domestic battle over German heritage and history:", "The German nation does not wish its interests to be determined and controlled by any foreign nation. France to the French, England to the English, America to the Americans, and Germany to the Germans. We are resolved to prevent the settlement in our country of a strange people which was capable of snatching for itself all the leading positions in the land, and to oust it. For it is our will to educate our own nation for these leading positions. We have hundreds of thousands of very intelligent children of peasants and of the working classes. We shall have them educated -- in fact we have already begun and we wish that one day they, and not the representatives of an alien race, may hold the leading positions in the State together with our educated classes. Above all, German culture, as its name alone shows, is German and not Jewish, and therefore its management and care will be entrusted to members of our own nation.", "Germany History in Documents and Images (GHDI).   \"Excerpts from Hitler’s Speech Before the First 'Greater German Reichstag' (January 30, 1939).\"\r\n    Accessed 13 July 2020.", "United States Holocaust Memorial Museum.   \"Reichstag Speech.\"\r\n    Accessed 13 July 2020.", "Srikanth, Anagha.   \"Trump Doubles Down on 'Heritage' Defense of Confederate Statues.\"\r\n    The Hill.   29 June 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]