["A question for the ages: Why is a gorilla a gorilla, and not a human?", "Conservative radio host Rush Limbaugh wondered aloud about primate evolution while discussing the case of a boy who fell into a gorilla enclosure at a Cincinnati zoo.", "Limbaugh said the zoo keepers did the right thing when they made the difficult but necessary choice to shoot and kill Harambe, a 400-pound male gorilla, to protect the toddler in the May 28 incident. But some animal activists are outraged at the death of a critically endangered animal.", "One dimension of this outrage, Limbaugh said, is people think they’re related to gorillas.", "\"A lot of people think that all of us used to be gorillas, and they're looking for the missing link out there,\" Limbaugh said. \"The evolution crowd. They think we were originally apes. I've always had a question: If we were the original apes, then how come Harambe is still an ape, and how come he didn't become one of us?\"", "Limbaugh has delivered mixed messages on his belief in evolution in the past. In 2004, he asked why chimpanzees and baboons \"got stuck being idiot gorillas\" instead of becoming humans. Then in 2010, he said, \"clearly things evolve,\" while still expressing skepticism about the progression of human and primate evolution.", "We thought we’d take the opportunity to answer Limbaugh’s question and explain why the presence of gorillas doesn’t negate the concept of evolution.", "Humans are apes, as members of the taxonomic family hominidae, which also includes the great apes — orangutans, chimpanzees and gorillas. Humans, the great apes, monkeys and more are all primates.", "However, humans didn’t evolve from gorillas or other apes, as Limbaugh suggests. Rather humans, gorillas and all other apes evolved from a common ape-like ancestor (now extinct) around 5 million to 8 million years ago. See the primate family tree to the left.", "Scientists know this from studying the comparative anatomy and DNA for humans and other creatures, said Blythe Williams, a professor of evolutionary anthropology at Duke University.", "\"Each species has changed over time,\" Williams said. \"For reasons that are not clear, our own species has changed in some very dramatic ways, such as becoming bipedal and getting really big brained.\"", "Some experts believe this common ancestor was chimp-like, while others think it might have been different from anything currently living, said David Pilbeam, professor of human evolution at Harvard University.", "Williams said the question Limbaugh poses — why gorillas and humans coexist despite evolution — is akin to asking why Rush Limbaugh hasn’t evolved into his cousin, Stephen, or vice-versa. The two share a common ancestor, but they’re not the same person.", "\"They are different people, with some shared DNA,\" Williams said. \"But because of the introduction of other genes into their gene pool, via parents, they are not exactly the same as one another or their shared grandparent.\"", "So it’s not that there was a linear progression from gorillas to humans, and some gorillas just didn’t evolve. It’s that over some 6 million years, descendants of a single, common species became gorillas, and others became humans.", "\"Evolution, including human evolution, doesn't have a goal beyond survival and reproduction,\" Pilbeam said, making the argument that becoming human isn’t the end-all-be-all in evolution.", "Homo sapiens are the only remaining human species, having emerged about 200,000 years ago, though there used to be numerous human species, including our closest extinct relative, the neanderthal.", "Certain genes differ just 1.8 percent between humans and gorillas. The difference in those genes is about 1.2 percent between humans and our closest animal relative, the chimpanzee.", "Our ruling", "Limbaugh said the presence of gorillas calls into question the concept of evolution.", "Limbaugh hit on a common misconception that humans evolved from modern-day apes. In reality, modern-day humans and modern-day gorillas are cousins, having both evolved from a common, but now extinct, ancestor.", "We rate Limbaugh’s statement False.", "https://www.sharethefacts.co/share/b42f712a-3014-4819-ac8e-9e84151e6146", "Rush Limbaugh Show, \"The Politics of the Gorilla Story,\" May 31, 2016", "Rush Limbaugh Show, \"Undeniable Truth of Life #23,\" May 21, 2004", "Rush Limbaugh Show, \"Tackling Darwinism in Literalville,\" Sept. 29, 2010", "Smithsonian Museum of Natural History, \"Introduction To Human Evolution,\" accessed June 2, 2016", "U.C. Berkeley Museum of Paleontology, \"Understanding Evolution,\" accessed June 2, 2016", "Berggorilla & Regenwald Direkthilfe, \"How closely are gorillas related to us?\" accessed June 2", "Email interview, Duke professor Blythe Williams, June 2, 2016", "Email interview, Harvard professor David Pilbeam, June 3, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]