["About this rating", "On 26 November 2016, a prankster altered Google Maps so that Trump Tower (the New York City home base for President-elect Donald Trump) was labeled \"Dump Tower.\" Multiple media outlets took screen shots of the change and posted them online:", "Google Maps Shows “Dump Tower” When You Search For NYC’s Trump Tower https://t.co/Vor6zApJ4Gpic.twitter.com/UY3BiyvsmW", "— BuzzFeed News (@BuzzFeedNews) November 27, 2016", "The prank caught on, prompting another Google user to similarly alter the name of Trump International Hotel & Tower in Columbus Circle. But the names have since been corrected.", "Google allows users to suggest edits to location names, not to outright change them, so it's unclear how the edit was made:", "It wasn’t the first time that a location on Google Maps has become vulnerable to some sort of malicious online defacement.", "In May 2015, users on Google Maps would be directed to the White House if they searched for “N***a House.”", "Earlier that year, Google had announced that it would no longer allow public edits to maps after a series of “Incidents,” but described the White House issue as some sort of “vandalism.”", "A spokeswoman for the tech giant told the Associated Press:", "User contributions help provide an up-to-date map, but also occasionally lead to inaccuracies.", "The names of Trump's buildings were corrected the same day the edits occurred.", "Hernandez, Salvador. \"Google Maps Shows “Dump Tower” In A Search For NYC’s Trump Tower.\"\r\nBuzzFeed News. 27 November 2016.", "Associated Press. \"Trump Tower becomes 'Dump Tower' on Google Maps.\"\r\n27 November 2016.", "KXTV. \"Dump International Hotel Renamed on Google Maps.\"\r\n  27 November 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]