["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A national Republican group is misleading Miami voters with a radio ad that says U.S. Sen. Bill Nelson \"supports murderers,\" pointing to the Democrat’s positions on Cuba and Venezuela.", "The crisis in Venezuela could become an issue for Florida candidates in 2018, including Nelson, who is expected to face a challenge from Republican Gov. Rick Scott.", "The Spanish-language ad by the National Republican Senatorial Committee attacks Nelson for meeting with then-Venezuela President Hugo Chávez in 2005 and tries to link Nelson to Chávez’s successor, Nicolas Maduro, and the Castro brothers of Cuba.", "Here’s part of the script in English:", "\"In the past, (Nelson) has aligned himself with communists and dictators. Look at him with Cuba. He supported Obama when he negotiated with the other terrorists, the Castro brothers. When Nelson supports the Castros, that only reinforces and encourages others, like it did with Chávez’s and now with Maduro. In 2005, Bill Nelson even visited Hugo Chávez in Venezuela. Here it says Nelson went to Venezuela to admire Chávez’s revolution. If Bill Nelson supports murderers, I can’t support Bill Nelson.\"", "The fact that Nelson met with Chávez and supported Obama’s efforts to normalize relations with Cuba is by no means evidence that Nelson \"supports murderers\" or admired Chávez’s revolution. In fact, Nelson has repeatedly criticized the leadership of both Venezuela and Cuba.", "When we asked for evidence of the ad’s claims, an NRSC spokeswoman pointed to a Miami Herald article about a 2005 meeting between Nelson and Chávez.", "In January 2005, Nelson and two other U.S. senators on the Foreign Relations Committee -- Christopher Dodd, D-Conn. and Lincoln Chafee R-R.I. -- met with Chávez in Caracas. In addition to Venezuela, the senators traveled to Argentina, Bolivia, Paraguay and Peru to discuss counterterrorism, counter-narcotics and economic issues.", "The senators discussed with Chávez concerns about his relationship with the Revolutionary Armed Forces of Colombia (FARC), though Nelson also described the session as \"very friendly (in) tone.\"", "Senators \"made a point of emphasizing the need for a fresh start in the often troubled relationship between Washington and Chávez's government,\" the Herald wrote.", "An NRSC spokeswoman also pointed to a September 2006 editorial in Investor’s Business Daily that describes trips taken by Nelson as \"junkets to Venezuela to admire Chávez's ‘revolution’ in his dog and pony shows.\" But the article included no evidence that Nelson admired Chávez’s revolution.", "There is evidence of Nelson, however, criticizing Chávez over his new media laws, private property seizures and pro-Chávez judicial appointments in a 2005 op-ed.", "\"While we cannot accept Chávez's duplicity, his anti-democratic consolidation of power or his ties to Cuba, dialogue between the United States and Venezuela is needed to help avoid the real possibility of a disruption in the relationship with our fourth-largest oil supplier,\" he wrote.", "Other have called Nelson a frequent critic of Chávez. In 2004, the Miami Herald described Nelson as being \"perhaps Chávez's fiercest critic in Congress.\"", "Nelson called on the federal government to investigate terrorist operations in Venezuela and called Chávez a \"serious threat\" governing in \"an increasingly autocratic manner\" and \"unfriendly to the civilized world.\"", "In April 2014, Nelson held a joint press conference with Republican U.S. Sen. Marco Rubio to call for stepped-up attention to Venezuela for repressing political protests.", "\"It's time to stand up and speak out,\" he said.", "In July 2017, after Maduro won re-election in which what has been described as a fraudulent vote, Nelson urged sanctions.", "\"It's time that we consider cutting the imports of Venezuelan oil,\" Nelson said in a Senate Floor speech. \"We are now dealing with a Cuban-style dictator.\"", "\"Maduro has made himself dictator, and he and his cronies are bent on turning Venezuela's once-vibrant democracy and once-vibrant economy into a Cuban-style regime,\" he said.", "Nelson supported Obama’s move in December 2014 to normalize relations with Cuba, but he called for Castro to expand freedoms.", "The Republicans point to an article about Nelson speaking on CNN after Obama’s announcement. He described the day as \"Hallelujah Day,\" as American Alan Gross was released from Cuba prison as part of the agreement.", "Nelson described himself as \"anti-Castro\" but saw Obama’s decision as a step in the right direction.", "In July 2015 when the U.S. and Cuba opened embassies, Nelson supported the move but continued to criticize Castro.", "\"I still distrust Castro, but we have to get that regime to open up, stop human rights abuses, and give the Cuban people their basic freedoms,\" he said in a statement.", "The ad says that Nelson \"supports murderers,\" which appears to be a reference to Chávez, Maduro and the Castro brothers. The leaders have been associated with political violence of different types.", "Sebastian A. Arcos, associate director at the Cuban Research Institute at Florida International University, said the Castro brothers have a well-documented history of politically motivated killings beginning in the early months of the Cuban Revolution and extending to recent years.", "\"Chávez and Maduro do not have the Castro’s record of politically motivated killings,\" he said. \"Under their collective rule, however, Venezuela has suffered a significant spike in the murder rate, already high before Chávez came to power. In addition, Maduro has been responsible for over 100 dead while repressing anti-government demonstrations.\"", "Andy Gomez, interim director of the University of Miami’s Institute for Cuban and Cuban-American Studies, called the attack on Nelson \"absolutely silly.\"", "\"Bill Nelson has always been anti-Castro and anti-Chávez and Maduro, the record speaks for itself,\" he said. \"Does the U.S. ever take positions, or any senator including Bill (Nelson), approving atrocities being made to the people? Absolutely not. Has Sen. Nelson ever supported any of these guys? Absolutely not.\"", "The NRSC radio ad says Nelson \"has aligned himself with communists and dictators,\" \"went to Venezuela to admire Chávez’s revolution\" and \"supports murderers.\"", "Though Nelson did visit Venezuela with other senators in 2005, he also repeatedly criticized Chávez in 2004 and 2005, calling him a \"serious threat\" and raised concerns about his property seizures, judicial appointments and \"anti-democratic consolidation of power,\" as well as his ties to Cuba. Nelson has also been critical of Maduro, including the recent election, which he called a \"sham.\"", "While Nelson agreed with Obama’s decision to normalize relations with Cuba in 2014, Nelson called for democratic reforms.", "This ad grossly distorts Nelson’s record about his visit with Chávez and about his record on the leadership of Venezuela and Cuba. We rate this statement Pants on Fire.", "'", "National Republican Senatorial Committee, Radio ad \"Accomplice,\" Aug. 14, 2017", "Miami Herald Naked Politics blog, \"Republicans use Spanish-language radio to attack Bill Nelson on Venezuela and Cuba,\" Aug. 14, 2017", "CNN, Sen. Nelson reacts to Alan Gross’s release, Dec. 17, 2014", "Key West Citizen, \"This is a Hallelujah Day,'\" (Accessed in Nexis) Dec. 18, 2014", "U.S. Sen. Bill Nelson op-ed in the Miami Herald, \"South America beset by `crisis after crisis,'\" Jan. 23, 2005", "Miami Herald, \"U.S. senators, Chávez discuss ties,\" Jan. 11, 2005", "Miami Herald, \"Sen. Nelson rails on Chavez, policies ‘unfriendly’ to U.S.,\" (Accessed in Nexis) April 18, 2004", "AP, \"Venezuela rejects U.S senator's charges that Chavez backs Colombian rebels,\" (Accessed in Nexis) April 19, 2004", "Miami Herald, Latin America briefs, (Accessed in Nexis) April 20, 2017", "Sen. Bill Nelson op-ed in the Miami Herald, \"Signature recount last chance to avoid chaos,\" (Accessed in Nexis) May 28, 2004", "Miami Herald, \"Nelson wants voting system reviewed,\" (Accessed in Nexis) June 23, 2004", "Florida Times-Union, \"Nelson: Ax won't hit Mayport; Base's role to combat narcotics, terrorist networks makes it safe, senator says,\" (Accessed in Nexis) July 13, 2004", "Florida Times-Union, \"Fight for nuclear Mayport toughens; Tight budgets and Pacific threats make Florida less likely to station a nuclear carrier,\" (Accessed in Nexis) Jan. 30, 2005", "Miami Herald, \"Chavez vote sure to affect South Florida,\" Aug. 15, 2004", "Washington Post, \"Chavez Defeats Recall Attempt,\" Aug. 17, 2004", "Connecticut Post (Bridgeport, CT), \"Rare protest to electoral vote count,\" (Accessed in Nexis) Jan. 9, 2005", "UPI, \"Venezuelan oil a U.S. concern,\" (Accessed in Nexis) Feb. 7, 2005", "Tampa Bay Times, \"A partnership in peril; cutting an oil artery,\" (Accessed in Nexis) Feb. 7, 2005", "Sen. Bill Nelson press release, Sen. Bill Nelson’s reaction to the president’s announcement regarding Cuba, July 1, 2015", "Investor’s Business Daily editorial, \"Much Too Cozy With Chavez,\" (Accessed in Nexis) Sept. 22, 2006", "Miami Herald, \"Amid political unrest, Miami Congressman Joe Garcia asks President Obama to let more Venezuelans stay in U.S.\" Feb. 24, 2014", "Miami Herald, \"Sen. Marco Rubio, Sen. Bill Nelson speak in Doral about situation in Venezuela,\" April 17, 2017", "Miami Herald, \"U.S. slaps sanctions on Maduro and labels him a 'dictator',\" July 31, 2017", "Miami Herald, \"Why Venezuela politics matter to Miami’s Cuban-American lawmakers,\" July 21, 2017", "Miami Herald, \"Violence marks Venezuelan election as opposition warns of fraud,\" July 30, 2017", "Tampa Tribune, \"Impose sanctions on Venezuela,\" (Accessed in Nexis) May 1, 2014", "Interview, Katie Martin, National Republican Senatorial Committee spokeswoman, Aug. 14, 2017", "Interview, Ryan Brown, U.S. Sen. Bill Nelson spokesman, Aug. 14, 2017", "Interview, Sebastian A. Arcos, Associate Director at the Cuban Research Institute Steven J. Green School of International and Public Affairs at Florida International University, Aug. 16, 2017", "Interview, Andy Gomez, interim director of the University of Miami’s Institute for Cuban and Cuban-American Studies (ICCAS), Aug. 16, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]