["By Eugene Kiely, Robert Farley and D'Angelo Gore", "Posted on February 19, 2019", "Both sides are spinning the facts in response to President Donald Trump’s declaration of a national emergency on the Southwest border:", "On Feb. 15, Trump declared the national emergency, which the White House said would enable the use of $8 billion for the construction of a border wall, with most of the money coming from Department of Defense budgets.", "In making the administration’s case for a border wall, White House senior policy adviser Stephen Miller cited an increase in the number of people crossing the border who “can’t be turned around” and sent home, because existing U.S. laws and court decisions allow them to stay in the U.S. pending immigration hearings.", "But a border wall would have no impact on such people since they readily turn themselves in to border agents.", "Miller made his remarks after “Fox News Sunday” host Chris Wallace questioned the need for a national emergency to build a border wall at a time when border apprehensions are a quarter of what they were at the peak. Southwest border apprehensions peaked in 2000 at 1.64 million and have generally declined since, totaling 396,579 in 2018.", "Wallace, Feb. 17: Four times as many people were coming across the border in 2000 as now, so why is that –", "Miller: Back then, when 95 percent could be turned around in a matter of days. As a result of loopholes, activist judicial rulings, and increasing sophistication from cartels, the reality is that more than half the people crossing the border are what we call non-impactable. They can’t be turned around.", "Who are these “non-impactable” people? We’ll explain who they are and then why a border wall would not keep them out.", "In a May 1, 2018, report to Congress, the Department of Homeland Security attempted to estimate the number of people who successfully evaded detection and crossed the border illegally. The report divides unlawful border crossers into two groups: “impactable and non-impactable.”", "“Non-impactable border crossers” — the group Miller is talking about — “include unaccompanied minors, family units, individuals who request asylum,” the report says. This includes people from countries other than Mexico — primarily El Salvador, Guatemala and Honduras — and their numbers are increasing, the report says.", "“Aliens in this group are described as non-impactable because, historically, they have usually been released into the United States with a Notice to Appear in immigration court for legal proceedings on a future date, rather than being subject to immediate DHS enforcement consequences,” the report says. “These aliens are assumed generally to be ‘non-impactable’ by traditional DHS enforcement activities at the border because even if they are apprehended they are typically unlikely to be immediately removed or returned.”", "As we have written, the administration has criticized current laws and court rulings that provide for the release of unaccompanied children and families from countries other than Mexico until their immigration status can be resolved in court. But changing the laws, which the administration supports, would take congressional action.", "A wall, however, won’t serve as a deterrent for the “non-impactable.”", "In a 2017 report, the nonpartisan Government Accountability Office said many of the unaccompanied children and those traveling in a family unit “turn themselves in to Border Patrol without attempting to evade detection.”", "GAO, November 2017: We have previously reported that [Customs and Border Protection] officials have attributed high apprehension rates in the Rio Grande Valley sector to the high number of unaccompanied children and adults with children, many of whom turn themselves in to Border Patrol without attempting to evade detection. Officials said children are often told by smugglers to wait in specific locations where agents frequently patrol so that they will be found. According to Border Patrol officials, persons apprehended from Central America are often fleeing violence, and once apprehended they may assert claims for asylum in the United States.", "It’s for this reason that the DHS, in explaining the methodology it used to estimate the number of people who successfully entered the U.S. illegally, assumes that “the non-impactable population” doesn’t attempt to evade detection. The 2018 report says “all unlawful border crossers in the non-impactable population are assumed to intentionally present themselves” to border agents either at ports of entry or between the ports.", "They “make no attempt to evade detection, and … surrender to the first USBP agent they encounter,” as DHS said in an earlier report explaining its methodology.", "That doesn’t mean that all “non-impactable” people turn themselves in, but such an assumption helps to “construct a probability model,” the DHS said in its 2018 report.", "Miller has a point that the share of unaccompanied minors, family units and individuals seeking asylum from Central America are increasing, but the border wall wouldn’t have much of an impact on this particular population.", "California Attorney General Xavier Becerra, who has filed suit to block Trump’s national emergency from taking effect, said President Barack Obama “didn’t change laws” or “try to dismiss laws” when using his executive authority to create programs known as the Deferred Action for Parents of Americans and Lawful Permanent Residents, or DAPA, and the Deferred Action for Childhood Arrivals, or DACA.", "But the federal courts ruled that Obama did try to change the law. In 2015, a federal judge blocked the DAPA program from taking effect, calling the new program “in effect, a new law.” Obama himself once boasted that he “took action to change the law” when creating DAPA.", "In a Feb. 15 interview on PBS’ “NewsHour,” Becerra, a former Democratic congressman, was asked how his support for Obama’s executive actions on illegal immigration squared with his lawsuit that claims Trump’s action on illegal immigration is unconstitutional.", "Becerra, Feb. 15: Remember that President Obama acted — executive action based on his authority as president. He didn’t change laws. He didn’t try to dismiss laws. He was simply trying to work within the framework of our immigration laws in dealing with DACA and the DAPA program. Here, President Trump is not simply trying to work within the framework of our existing laws.", "Both of Becerra’s claims — that Obama’s didn’t change the law and Trump is not working within existing laws — are a matter of legal dispute. But, in Obama’s case, the dispute has been settled and not in the Democratic president’s favor.", "The Deferred Action for Childhood Arrivals program — or DACA — was created by executive action in 2012. It defers deportation proceedings for two years for qualified individuals who were brought to the United States illegally when they were children. The Obama administration in November 2014 sought to expand DACA eligibility and the period of deferred action to three years, and to create a second program called Deferred Action for Parents of Americans and Lawful Permanent Residents, which would defer deportation proceedings for parents with children who were citizens or lawful permanent residents.", "But the DACA expansion and the DAPA implementation were successfully challenged in court by 26 states.", "In his February 2015 ruling, Judge Andrew Hanen, of the Federal District Court for the Southern District of Texas, blocked implementation of DAPA and the expansion of DACA. In his ruling, Hanen described the DAPA program as “in effect, a new law.”", "Hanen, Feb. 16, 2015: The DAPA program clearly represents a substantive change in immigration policy. It is a program instituted to give a certain, newly-adopted class of 4.3 million illegal immigrants not only “legal presence” in the United States, but also the right to work legally and the right to receive a myriad of governmental benefits to which they would not otherwise be entitled. It does more than “supplement” the statute; if anything, it contradicts the [Immigration and Nationality Act]. It is, in effect, a new law.", "The Obama administration appealed, but Hanen’s ruling was affirmed on Nov. 9, 2015, by a three-judge panel of the United States Court of Appeals for the Fifth Circuit in New Orleans.", "In his majority opinion, Judge Jerry E. Smith wrote that the Immigration and Nationality Act “flatly does not permit the reclassification of millions of illegal aliens as lawfully present and thereby make them newly eligible for a host of federal and state benefits, including work authorization.”", "The circuit court ruling was affirmed when the Supreme Court deadlocked in a 4-4 ruling on June 23, 2016.", "In their opinions, Hanen and Smith both used Obama’s own words against him, citing a 2014 speech in which Obama said he “took action to change the law.”", "When giving a speech in Chicago on immigration on Nov. 25, 2014, Obama was confronted by a heckler who accused his administration of breaking up families with large numbers of deportations. In response, Obama said, “Now, you’re absolutely right that there have been significant numbers of deportations. That’s true. But what you’re not paying attention to is the fact that I just took action to change the law.”", "White House adviser Miller wrongly said that illegal immigration doubled under President George W. Bush. It went up 28 percent, according to Department of Homeland Security estimates.", "Miller also said that Bush failed to “[defend] this country on the southern border.” But that ignores some of the significant steps Bush took to protect the border, such as adding hundreds of miles of border barrier and doubling the number of border patrol agents.", "Miller made his comments when Chris Wallace of “Fox News Sunday” questioned him about the president talking about an “invasion” of the southern border. “But let’s look at the facts,” Wallace said, “1.6 million people were stopped crossing the border illegally back in 2000, less than a quarter that many were caught last year.”", "Miller responded, “As you know, when George Bush came into office, illegal immigration total — doubled from 6 million to 12 million by the time he left office. That represented an astonishing betrayal of the American people. I’m not going to sit here today and tell you that George Bush defended this country on the southern border because he did not.”", "There is no exact count of the the illegal immigration population, but the estimates from the U.S. government show Miller is inflating the growth of illegal immigration under Bush. According to Department of Homeland Security estimates, which are based on an analysis of Census data, the population was 8.46 million in January 2000, the year before Bush took office, and climbed to 10.8 million in January 2009, the month he left office. That’s a 28 percent increase, far from double.", "To be fair, those aren’t the only estimates of the illegal immigration population. The Pew Research Center estimated the population at 11.1 million in March 2009, shortly after Bush left office. Still, Pew’s figures show a 32 percent increase from 2000 to 2009, not a doubling, as Miller said.", "Miller is certainly entitled to his opinion that Bush didn’t do enough to secure the southern border, but his blanket claim that Bush did not “[defend] this country on the southern border” ignores the fact that hundreds of miles of border barrier were constructed after Bush signed the Secure Fence Act of 2006. The bill never lived up to its original promise of at “least two layers of reinforced fencing” along about 700 miles of the border with Mexico. The bill was amended the year after its passage to give the Department of Homeland Security the flexibility to decide what type of barrier was appropriate in different areas, and DHS later determined that it needed fewer miles of fence than initially designated in the law. Nonetheless, the bill resulted in the construction of hundreds of miles of new pedestrian and vehicle fencing.", "Under Bush, the number of border patrol agents doubled, from 9,821 in fiscal year 2001, the year Bush took office, to 20,119 in fiscal 2009, the year he left.", "In addition, Bush issued a policy in 2006 that required people from all countries — not just Mexico and Canada — caught trying to cross the border illegally to be detained until they could be returned. “The Administration has effectively ended the policy of ‘catch and release,’” the Bush administration said at the time.", "The policy change cut the number of immigrants released from 113,000 in FY2005 to “nearly zero” by mid-FY2007 and increased the demand for detention space, according to an April 2009 report by the Department of Homeland Security.", "In the years following those actions, the number of apprehensions at the southern border began to decline, from 1.1 million in 2006 to 858,638 in 2007, 705,005 in 2008 and 540,865 in 2009. Again, Miller can argue that not enough was done to protect the southern border under Bush, but Bush did take some significant steps to try to improve border security.", "On ABC’s “This Week,” Republican Rep. Jim Jordan defended Trump’s national emergency declaration and said he was amazed by the “dangerous … position that the left and the Democrats are now taking.” But Jordan went on to highlight comments made by Hillary Clinton and Stacey Abrams without providing the full context of their remarks.", "Jordan, Feb. 17: You had the – the candidate for president, Secretary Clinton, say we need a borderless hemisphere, and oh, by the way, the person that the Democrats had do the State of the Union response, Stacey Abrams, just four weeks ago said noncitizens should be able to vote.", "Jordan is referencing what Clinton said in a private speech to a Brazilian bank in 2013. According to an excerpt included in a Clinton campaign email that Wikileaks released in 2016, Clinton said: “My dream is a hemispheric common market, with open trade and open borders, some time in the future with energy that is as green and sustainable as we can get it, powering growth and opportunity for every person in the hemisphere.”", "The full speech was not made public, so we don’t know what Clinton said before or after that brief statement. But in the final 2016 presidential debate with Trump, Clinton said she was talking about “open borders” for energy, not immigration.", "“Well, if you went on to read the rest of the sentence, I was talking about energy,” Clinton explained. “You know, we trade more energy with our neighbors than we trade with the rest of the world combined. And I do want us to have an electric grid, an energy system that crosses borders. I think that would be a great benefit to us.”", "Jordan also left out important context from the remarks made by Abrams, the former Georgia state legislator who lost her bid to become governor last year.", "In an interview with PBS’ Margaret Hoover last month, Abrams said she “wouldn’t oppose” allowing noncitizens to vote in municipal elections, not state and federal ones.", "Hoover, “Firing Line,” Jan. 13: What is your view about some municipalities, like San Francisco, who have decided that it’s okay for some noncitizens to vote in local elections?", "Abrams: I think there’s a difference between municipal and state and federal. Part of municipality — I’m not arguing for it or against it, but I will say, having been deputy city attorney, there’s a very — the granularity of what cities decide is so specific, as to, I think, allow for people to be participants in the process without it somehow undermining our larger democratic ethic that says that you should be a citizen to be a part of the conversation.", "Hoover: So, in some cases, you would be supportive of noncitizens voting?", "Abrams: I wouldn’t be — I wouldn’t oppose it.", "That’s different from saying noncitizens should be allowed to vote in all elections, which may have been the impression that ABC viewers got from what Jordan said.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]