["About this rating", "One of the more persistent types of racial hoaxes are misleading claims on social media that people of color loot property during various natural disasters.", "One such hoax about Hurricane Dorian, which threatened the Southeast coastal region of the U.S. in late August and early September 2019, was perpetuated by a Facebook user on Aug. 30, 2019. The user used the disaster as an opportunity to post images of non-white people carrying boxes on sidewalks and across streets and claiming they were Floridians looting property as residents and business owners evacuated ahead of the storm.", "But none of the images was taken during Dorian, nor were they taken in Florida or even taken in the same year as Dorian.\nThe first photograph was taken in London in August 2011 during violence that erupted after police killed a black man; some people also blamed the violence on economic inequality and government-austerity measures. A Reuters photographer took the picture, which carried captions that said the people pictured were stealing from an electronics store.", "The second photograph (bottom left) was taken almost three decades ago. According to the caption, it was taken in April 1992 during the Los Angeles riots, which resulted from the acquittal of four white police officers who were captured on video beating black motorist Rodney King. The caption on the photograph states that those pictured were taking stolen electronics in boxes across a street.", "The final image appears to be a screen capture from a video taken by bystanders during Hurricane Harvey, which hit Texas in 2017. Although the purpose of the Facebook post appears to be to make it look like non-white people are predisposed to commit crimes of opportunity like looting, overall crime during Harvey actually dropped, according to Houston police Chief Art Acevedo.", "Acevedo told the local NPR station, \"There’s this idea that crime is always going to follow storms, and that is frankly — according to most research — not really true. In fact, what most researchers actually say is that there’s this certain sense of goodwill and altruism in communities that actually helps deter violence and other crimes in the wake of these things.”", "The Telegraph. \"London Riots: Timeline of Violence.\"\r\n  9 August 2011.", "Novak, Matt. \"ABC News Journalist Reports 'Looters' to Police During Flood, Gets Dragged on Social Media.\"\r\n  Gizmodo. 30 August 2017.", "Fanning, Rhonda. \"Houston Police Say Crime Went Down During Harvey. Is Looting a Myth?\"\r\n  KUT. 31 October 2017.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]