["By Robert Farley", "Posted on November 29, 2017 | Updated on December 6, 2017", "House Democratic Leader Nancy Pelosi says the Republican tax plans will be a “job-killer,” but most economic analyses of the plans suggest, on balance, modest job growth.", "The government’s nonpartisan Joint Committee on Taxation has not yet completed its analysis of the plans’ effect on employment. But several outside groups have run analyses that show modest net job gains from the GOP tax plans.", "For example, Moody’s Analytics forecasts the plans will create in the range of 500,000 to 600,000 net new jobs over 10 years — though it says that comes at a steep cost to the nation’s debt.", "The business-backed Tax Foundation’s analysis of the Senate plan concludes it would result in 925,000 additional full-time equivalent jobs over 10 years.", "A spokesman for Pelosi says the House Democratic leader was “talking about the perverse incentives the Republican bill creates for corporations to ship more American jobs overseas.” The spokesman cited, in part, the work of Jared Bernstein, formerly a member of President Obama’s economic team.", "In an op-ed for the Washington Post, Bernstein says the Republican plan is “likely to lead to more outsourcing of U.S. jobs and a larger trade deficit.” Specifically, he believes working-class factory workers would take a hit.", "But Bernstein told us “most conventional scores” of the GOP plans show slightly higher GDP growth leading to what Bernstein called “minimal job growth, but a net plus.” Bernstein said the point of his op-ed was that the plan is “likely to lead to job loss (relative to a baseline) in manufacturing.”", "Wildly divergent claims about the tax plans’ effect on jobs have been coming from opposite sides of the political aisle.", "In comments on Nov. 27, President Donald Trump assured that the tax changes “will bring jobs.” Later, he added, “It’s going to mostly benefit people looking for jobs more than anything else, because we’re giving great incentives.” A day earlier, on NBC’s “Meet the Press,” Pelosi offered the opposite take on the Republican tax plan, saying “it’s going to be a job-killer.”", "Eric Toder, co-director of the Tax Policy Center, warns people not to put much stock in such projections either way.", "“Most comments on either side of the political divide about how tax proposals would affect jobs either plus or minus are bogus,” Toder told us via email. “Overall employment depends on total demand for goods and services in the U.S. economy which is largely determined by monetary policy. Fiscal stimulus can increase employment during times of high cyclical unemployment, but in today’s low unemployment economy probably has very little effect. However, the tax bill, by increasing the deficit, may provide a temporary employment boost in the short run. And changes in the relative tax treatment of different activities will raise employment in some industries and lower it in others.”", "As we said, neither side can cite direct evidence for the effect on jobs from a government analysis. The government’s nonpartisan Joint Committee on Taxation has yet to weigh in on the plans’ effect on employment.", "Congressional Budget Office and JCT report to the Senate Committee on Finance, Nov. 26: The staff of the Joint Committee on Taxation is currently analyzing changes in economic output, employment, capital stock, and other macroeconomic variables resulting from the bill for purposes of determining these budgetary effects. However, JCT indicates that it is not practicable for a macroeconomic analysis to incorporate the full effects of all of the provisions in the bill, including interactions between these provisions, within the very short time available between completion of the bill and the filing of the committee report.", "But analyses from at least two outside groups suggest the Republican tax plans would result in modest job gains.", "An analysis of the House and Senate tax plans by Moody’s Analytics concluded the “economic lift from the tax cuts is small” and the effect on jobs moderate. Nonetheless, it did predict a small jobs gain — just over 500,000 jobs over 10 years from the House plan or just over 600,000 jobs from the Senate plan.", "Under the Senate plan, Mark Zandi, Moody’s chief economist, told us via email, the net number of jobs created or lost will fluctuate year to year. By the end of a 10-year window, in 2027, “employment will be 600,000 higher under the Senate plan. This comes at a high price though. The nation’s debt-to-GDP ratio will be 5 percentage points higher as a result of the Senate plan. The plan is a very expensive way to create 600,000 jobs.”", "The business-backed Tax Foundation’s analysis of the Senate plan concluded it would result in 925,000 additional full-time equivalent jobs over 10 years.", "The plan, the Tax Foundation wrote, would be “pro-growth, boosting long-run GDP 3.7 percent and increasing the domestic capital stock by 9.9 percent. Wages, long stagnant, would increase by 2.9 percent, while the reform would produce 925,000 new jobs.”", "To put those projected job gains in context, the economy has added nearly 1.5 million jobs since January, and nearly 9 million over the last 10 years (including more than 17 million since the start of 2010), according to the Bureau of Labor Statistics.", "Asked for backup for Pelosi’s claim that the tax plans would be a “job-killer,” her spokesman said she was referring to “incentives the Republican bill creates for corporations to ship more American jobs overseas.”", "The spokesman cited the work of Gene Sperling, a principal economic adviser to Democratic Presidents Bill Clinton and Barack Obama, and Jared Bernstein, a member of Obama’s economic team and currently a senior fellow at the left-leaning Center on Budget and Policy Priorities.", "In a piece for the Atlantic, Sperling argues that a provision in the bill designed to limit offshoring of jobs “would actually incentivize U.S. companies to move their operations overseas and to shift profits to tax havens.”", "Bernstein echoes those concerns in a piece penned for the Washington Post. The GOP plans, he notes, call for moving to a territorial system of international taxation, which would tax only income earned in the U.S. While the idea is to reduce incentives for corporations to offshore jobs, Bernstein argues the GOP plan would “exacerbate” those incentives, “which will lead to more overseas production and the loss of jobs here at home.” Specifically, Bernstein argues, it would lead to a loss of manufacturing jobs.", "In an email to FactCheck.org, Bernstein said the point of his piece “was that because of the offshoring incentives in the plan and its clear impact on higher trade deficits (this is widely agreed upon), it is likely to lead to job loss (relative to a baseline) in manufacturing.”", "But Bernstein isn’t saying the tax plan is necessarily a net job-killer.", "“I think the best way to answer this is to look at the various dynamic scores that have come out and recognize that in these basic models, higher GDP is associated with more net jobs,” Bernstein said. “Most conventional scores I’ve seen show at least slightly higher GDP growth, so they imply some net job growth, though many of the estimates are fractional [less than 1 percent] … I’d characterize that as minimal job growth, but a net plus.”", "Indeed, several macroeconomic analyses of the GOP tax plans forecast very modest long-term GDP gains.", "Pelosi’s speculation about the tax plan being a “job-killer” is just that, speculation. But most economic analyses to date suggest that while there will be winners and losers in the labor force, the net effect on the number of jobs will be small, but positive.", "Toder, of the Tax Policy Center, stressed that “all macro analysis of the effects of tax bills have a high degree of uncertainty,” and he advised readers to “[b]eware of simplistic or over-confident assertions on this topic.”", "Update, Dec. 6: After we published this story, the Joint Committee on Taxation issued a report on the economic impact of the Senate tax bill that projected an increase in employment of about 0.6 percent over 10 years compared with current law.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]