["From lawmakers to rappers, people across that nation have been throwing their support behind candidates this year in hopes of having an impact on the 2020 presidential election.", "But a recent Facebook post about one particular endorsement has drawn skepticism and backlash from some social media users.", "“Maurice Davis, a lifelong Democrat who serves as vice president of the Flint, Michigan, City Council, endorsed President Donald Trump for re-election on Wednesday,” reads a Facebook post by Breitbart News that has been shared over 15,000 times. “’President Trump is full of hate? Let me tell you something, the Democrats is full of hate,’ he said.”", "Other users shared similar versions of the claim.", "Fact check: Michigan governor encourages voters to drop off ballots, not mail them", "Davis’ controversial endorsement became known during a podcast with “No BS News Hour” where he said, “I really like Trump’s attitude.”", "Davis also spoke of his endorsement ahead of Vice President Mike Pence’s rally at Michigan Flint Bishop Airport, Newsweek reported.", "“Right now, the narrative (has) been spent — President Trump is full of hate. Let me tell you something, the Democrats are full of hate. I’m tired, I’ve been a Democrat, I am a Democrat all my life, 64 years,” Davis said.", "He added that he voted for Hillary Clinton in the 2016 election, but this year voted for Trump.", "“I’m not a bootlicker, I’m not an Uncle Tom,” Davis said. “I’m none of those things, I’m somebody that’s in a poor, impoverished community.\"", "Davis told The Detroit News that his support for Trump was prompted by frustrations with conditions in Flint and the Black community, however, he added that his endorsement didn’t extend to making “a pitiful commercial about how beautiful Trump is.”", "Pence thanked Davis for his support, and urged those in the crowd to vote for John James, challenger to Democrat Sen. Gary Peters. Trump also took to Twitter to thank Davis for his support.", "A full video of Davis' remarks at the Pence's campaign rally can be viewed on YouTube.", "Flint has been a Democratic stronghold for some time; however, outlying communities in Genesee County have moved further right since the 2016 election, according to The Detroit Free Press.", "Fact check: Thin Blue Line flag has taken a prominent place at Trump rallies", "The claim that Maurice Davis, a Flint, Michigan, City Council member and lifelong Democrat, endorsed Trump for president is TRUE, based on our research. Davis first made his support known during a podcast earlier this month and spoke about his endorsement during a campaign rally in Michigan, where he said his endorsement represents his support for the Black community.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]