["About this rating", "On Feb. 25, 2021, multiple news reports emerged that Lady Gaga’s pet French bulldogs, Koji and Gustav, had been stolen, and that their walker was shot in the process. CNN reported that a source close to the singer said that she was “offering half-a-million dollars to anyone who has her two dogs, no questions asked.”", "BBC spoke with a press representative for the singer, who said anyone who had information on the dogs can write to KojiandGustav@gmail.com. CNN also reported the same email address for potential tips on the dogs’ whereabouts.", "The Los Angeles Police Department (LAPD) confirmed that a man was indeed shot during a robbery before 10 p.m. on Feb. 24 and was taken to the hospital where he was in stable condition. According to police, the male suspect used a semi-automatic handgun, took two bulldogs from the walker, and fled the scene in a white sedan.", "TMZ reported that the walker was with three dogs. One named Miss Asia ran away but was later retrieved by the police. It is not known if the thieves were specifically targeting Gaga’s dogs, but the breed is considered to be very expensive and in high demand.", "The source told CNN that the dog walker was “recovering well.”", "The dogs were recovered unharmed later that week after a woman whose identity was not disclosed brought them to a police station, Associated Press reported.", "On April 29, 2021, the Associated Press reported that 5 people had been arrested by Los Angeles police in connection to the robbery, including the woman who brought the dogs back. Detectives believe that the thieves did not know who the dogs belonged to, but were motivated by the value of French bulldogs which run into thousands of dollars. The woman who returned the dogs turned out to be in a relationship with the father of one of the suspects. The suspects are charged with attempted murder, conspiracy to commit robbery and second-degree robbery.", "Feb. 27, 2021: Updated to include Associated Press reporting on the dogs' recovery.", "April 30, 2021: Updated to include Associated Press reporting on arrests of suspects.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]