["About this rating", "On Feb. 23, 2021, golf legend Tiger Woods was in a one-vehicle rollover crash in a suburb south of Los Angeles, according to the L.A. County Sheriff's Department. This raised questions on social media about whether Woods had been involved in other vehicle crashes.", "It's true that Woods was involved in one other high-profile collision.", "In November 2009, Woods lost control of his vehicle in an early-morning collision near his residence in Windermere, Florida. Although he was treated and released at a local hospital for injuries, the accident resulted in a snowballing scandal for Woods that cost him his marriage and, temporarily, his career.", "After pulling out of his driveway the day after Thanksgiving 2009, Woods crashed his SUV into a fire hydrant and a tree, authorities said at the time. His wife, Elin Nordegren, reportedly used golf clubs to break the rear windows of the vehicle, leading to speculation that the couple had just been in an argument. After the accident, multiple women came forward and publicly stated they had relationships with him while he was married to Nordegren. The resulting scandal ruined his career for the time being.", "But Woods has since rebounded from that scandal and is considered one of the world's best golfers.", "The cause of the February 2021 collision is not currently known to the public. Authorities said that Woods rolled his vehicle just after 7 a.m. on the border of Rolling Hills Estates and Ranchos Palos Verdes, two wealthy communities south of the city of Los Angeles.", "News helicopter footage showed Woods' vehicle lying on its side, off the side of the road.", "Correction [Feb. 26, 2021]: Deleted erroneous statement that Jaws of Life were used to extricate Woods from the vehicle.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]