["About this rating", "On Dec. 22, 2020, U.S. President Donald Trump issued a slew of pardons and commuted sentences ahead of leaving office. Among the pardons were individuals convicted of money laundering, perjury, perpetrating a massacre, as well as nonviolent drug offenders.", "We received questions from Snopes readers about whether Bernie Madoff was among the people granted clemency by Trump.", "Madoff, who pleaded guilty in 2009 to swindling billions of dollars off thousands of investors in an infamous Ponzi scheme, had attempted to have his 150-year prison sentence commuted by Trump back in 2019 but has so far been unsuccessful.", "Madoff filed a request for an early release in February 2020 saying he had only 18 months left to live, but a judge rejected it. According to his filing, he was in a wheelchair and had chronic kidney failure that progressed to “end-stage renal disease.” The judge, upon rejecting the request, said that Madoff had never fully accepted responsibility for his crimes. Madoff’s lawyer said his client’s last hope was for Trump to commute his sentence.", "But Trump’s list of people for whom he granted clemencies in December did not include Madoff. The U.S. Department of Justice also has a list of commutations granted by Trump until October 2020. Madoff is not included on that list either. Years before becoming president, Trump had spoken about Madoff with derision, calling him a “sleazebag” and a “total crook.”", "We thus rate this claim as “False.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]