["About this rating", "In October 2014, a rumor started circulating online that a GMO corn field in Ontario, Canada, was the cause of more than 37 million bee deaths. While it is true millions of bees were found to have died around that time in Canada, the cause of those deaths has not been definitively linked to GMO corn.", "The rumor started after OrganicHealth.com published an article titled 37 Million Bees Found Dead in Ontario, Canada After Planting Large GMO Corn Field:", "Millions of bees dropped dead after GMO corn was planted few weeks ago in Ontario, Canada. The local bee keeper, Dave Schuit who produces honey in Elmwood lost about 37 million bees which are about 600 hives.", "\"Once the corn started to get planted our bees died by the millions,\" Schuit said.", "The Organic Health article was basically a repurposed version of two articles published by The Post in June 2013 and CBC News in August 2013. Neither of those articles mentioned GMO corn.", "In fact, the Organic Health article never truly blamed GMO corn for killing millions of bees. Other than the title and the first sentence, Organic Health steered away from the idea that a GMO corn field caused 37 million bees to die in Canada and instead aligned with the conclusions drawn by the Post and CBC News: The culprit behind the devastating bee deaths in Canada is believed to be neonicotinoid pesticides: \"What seems to be deadly to bees is that the neonicotinoid pesticides are coating corn seed and with the use of new air seeders, are blowing the pesticide dust into the air when planted.\"", "While the idea that GMO corn is causing millions of bees to perish around the world is intriguing, it is also unproven. The same could be said for neonicotinoid pesticides, of course, but the evidence is starting to tip towards the latter. The Pest Management Regulatory Agency (PMRA), an arm of Health Canada that regulates pesticides, investigated the bee death incident in Ontario and found that neonicotinoids were likely to blame:", "In the spring and summer of 2012, Health Canada's Pest Management Regulatory Agency (PMRA) received a significant number of honey bee mortality reports from the provinces of Alberta, Manitoba, Saskatchewan, Nova Scotia, Quebec and Ontario. A portion of these mortalities were determined to be associated with spray drift, however, an unusually high number of reports of honey bee mortalities were received from beekeepers in corn growing regions of Ontario and Quebec. The majority of reports were from southern Ontario, involving over 40 beekeepers and 240 different bee yard locations. Additionally, one report was received from Quebec involving eight bee yards. Timing and location of these honey bee mortalities appeared to coincide with planting corn seed treated with insecticides.", "The information evaluated suggests that planting of corn seeds treated with the nitro guanidine insecticides clothianidin and/or thiamethoxam contributed to the majority of the bee mortalities that occurred in corn growing regions of Ontario and Quebec in Spring 2012. The likely route of exposure was insecticide contaminated dust generated during the planting of treated corn seed. The unusual weather conditions in the spring of 2012 were likely also a contributing factor.", "The Ontario Beekeeper's Association, which claims that Ontario has seen a 35% decrease in honey bees over the last two years, recently started a petition calling for a provincial ban on neonicotinoids:", "Ontario's bees are dying in massive numbers due to the pervasive use of neonicotinoid pesticides on our agricultural field crops. Fully a third of our food relies on pollinators: without bees, Ontario's food supply could be in serious trouble. Further, these chemicals leach into soils, groundwater and waterways, and can persist for years, killing not only bees, but other pollinators, aquatic insects, amphibians and birds.", "We already have sufficient evidence to prove that neonicotinoid pesticides are killing our bees. Canada's Pesticide Management Regulatory Agency has confirmed that last year's widespread bee deaths in Ontario were caused by neonicotinoid pesticides. As well, dozens of independent, peer reviewed scientific research studies have concluded that these pesticides pose a significant threat to bees and other wildlife. Furthermore, science and experience has shown that neonicotinoids don't really increase agricultural yield in the long run.", "CBC News.   \"Beekeeper Says Pesticide Killing Millions of Bees.\"\r\n    15 August 2013.", "Radojkovic, Jon   \"Six French Science Academies Dismiss Study Finding GM Corn Harmed Rats.\"\r\n    The Post.   19 June 2013.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]