["By Robert Farley", "Posted on March 7, 2017 | Updated on March 7, 2017", "President Donald Trump wrongly tweeted that “122 vicious prisoners, released by the Obama Administration from Gitmo, have returned to the battlefield.” Actually, it’s only nine former detainees. The other 113 were released under President George W. Bush.", "122 vicious prisoners, released by the Obama Administration from Gitmo, have returned to the battlefield. Just another terrible decision!", "— Donald J. Trump (@realDonaldTrump) March 7, 2017", "The president’s March 7 tweet came just a half hour after “Fox & Friends” tweeted a Fox News story about a prisoner released by President Obama from the Guantanamo Bay detention facility who was killed recently by a U.S. airstrike. The tweet noted that “122 former Gitmo detainees have re-engaged in terrorism,” a point also made in the news story.", "Former Gitmo detainee killed by a U.S. airstrike in Yemen; at least 122 former Gitmo detainees have re-engaged in terrorism pic.twitter.com/y9jb420fFZ", "— FOX & friends (@foxandfriends) March 7, 2017", "The Fox News segment reported that U.S, airstrikes in Yemen killed Yasir al Silmi, who the New York Times noted went by the name Mohammed Tahar while at Guantanamo, according to military records. According to The Long War Journal, al Silmi was detained at Gitmo because he was suspected of being part of a group that was “planning to use explosives against Americans in Afghanistan.”", "Although he was recommended for “transfer out of [Department of Defense] control” in 2007, that assessment was reversed in 2008, according to a leaked intelligence document that stated it had been that determined al Silmi was a “high risk” as he is “likely to pose a threat to the US, its interests and allies.”", "“It is assessed detainee [al Silmi] will engage in extremist activities upon release,” the 2008 report states. “He has threatened GTMO personnel and continues to support jihad.”", "Nonetheless, after a comprehensive review of Gitmo detainees by the Obama administration, al Silmi was transferred from Gitmo to Yemen on Dec. 19, 2009.", "According to the New York Times, al Silmi “was among a small group the Obama administration repatriated in December 2009 as part of an experiment.” However, the Times reported, after the attempted bombing of a plane headed for Detroit by al Qaeda’s Yemen branch, Obama “halted further repatriations to Yemen.”", "The Fox News segment posted on the “Fox & Friends” Twitter page on March 7 concluded with the announcer stating, “122 prisoners released from Gitmo have returned to the battlefield.” A graphic highlighted the same statistic.", "That’s true. But Trump took the extra step of assigning all of those releases to Obama. And that’s simply false.", "According to the government’s latest “Summary of Reengagement of Detainees Formerly Held at Guantanamo Bay, Cuba,” the vast majority of the released Gitmo detainees who were “confirmed of reengaging”  — 113 of the 122 — were released or transferred out of Gitmo by President Bush.", "Obama had transferred 161 Gitmo detainees as of July 15, 2016. Of those, nine were “confirmed of reengaging” in terrorist activities and another 11 were “suspected of reengaging.”", "This is not the first time the Trump administration has wrongly assigned Obama blame for detainees released by Bush.", "On Feb. 22, we wrote, Sebastian Gorka, a deputy assistant to the president, wrongly suggested that a released Guantanamo Bay detainee responsible for a recent suicide bombing in Iraq was released by Obama. He was transferred from Gitmo in 2004 under President Bush. Gorka also wrongly claimed that among detainees released by Obama, “almost half the time, they returned to the battlefield.” According to the Office of the Director of National Intelligence, about 12.4 percent of those transferred from Gitmo under Obama are either confirmed or suspected of reengaging.", "As we noted then, most of the former Gitmo detainees who are now suspected or confirmed to have reengaged were transferred or released under President Bush. Bush transferred a higher number of detainees — 532 compared to 161 under Obama — and they have been reengaging (or are suspected of reengaging) at a higher rate — 35 percent  compared to 12.4 percent under Obama. That may change over time, but those were the percentages as of last July.", "Update, March 7: The Director of National Intelligence on March 7 published updated figures, as of Jan. 15, 2017, for reengagement of detainees formerly held at Guantanamo Bay. The figures now show 121 former Gitmo detainees “confirmed of reengaging,” 113 of whom were transferred or released by President Bush, and eight by Obama. That’s one less under Obama and one less total from the July 15, 2016, figures we cite in our story.", "Update No. 2, March 7: White House Press Secretary Sean Spicer was asked at a press briefing if Trump would offer a correction to the tweet. Spicer said: “I mean, obviously the president meant in totality the number that had been released on the battlefield — that have been released from Gitmo since — since individuals have been released. So that is — that is correct.”", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]