["With the increased focus on racial justice in the workplace, many businesses are offering employees diversity, equity and inclusion training, including major firms like Coca-Cola Co.", "After claims that the training offered by Coca-Cola included a tip “to be less white” made headlines, some social media users are calling for a boycott of the beverage giant. Several Facebook users have also attributed a disparaging quote to Coca-Cola CEO James Quincey, alleging he responded to the boycott threat by saying, “A few right winged nuts won’t affect our bottom line.”", "Cumulatively, those posts have racked up thousands of shares within just a few days.", "USA TODAY contacted several social media users who posted the quote for comment; they did not respond.", "More:Fact check: Quote falsely attributed to Jerry Nadler", "Coca-Cola made headlines after it was accused of requiring employees to watch an online “Confronting Racism” training that included a tip to “be less white.”", "In a statement, Coca-Cola denied the video and images circulating on social media were part of the company’s learning curriculum.", "“Our Better Together global training is part of a learning plan to help build an inclusive workplace. It is comprised of a number of short vignettes, each a few minutes long,” the statement read. “The training includes access to the LinkedIn Learning platform on a variety of topics, including on diversity, equity and inclusion.”", "A Coca-Cola spokesperson told Snopes users had “the ability to navigate outside of the intended curriculum, which may have given the false impression that certain videos were part of the training.”", "LinkedIn later removed the course from its online offerings. In the aftermath, however, #BoycottCocaCola and #BoycottCoke began circulating on Twitter and Facebook, with users urging others to avoid Coca-Cola’s products due to the company's connection to the training.", "Get these in your inbox: We're fact-checking the news and sending it to your inbox. Sign up here to start receiving our newsletter.", "While the quote attributed to Quincey has become a rallying point for boycott efforts, the quote can’t be found in any official Coca-Cola social media posts, statements or press releases. Neither does it appear in any interviews Quincey has given, nor in a recent Coca-Cola earnings call.", "Coca-Cola spokesperson Debbie Ebalobo confirmed in an email to USA TODAY the quote is fabricated.", "In fact, this isn’t the first fabricated comment to come of the recent Coca-Cola controversy. Social media users also circulated a fake tweet from President Joe Biden saying he was \"proud to see Coca-Cola educate their staff in cultural reappropriation,” according to Snopes.", "We rate the claim that Coca-Cola CEO James Quincey said “a few right winged nuts won’t affect our bottom line” FALSE, based on our research. There is no evidence Quincey has commented on the boycott calls, and a Coca-Cola spokesperson confirmed the quote is fabricated.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]