["About this rating", "In June 2017, television show host Bill Maher dropped an offensive racial slur on his show \"Real Time with Bill Maher\", sparking the usual wave of opinion articles and think pieces. The Chicago Tribune looked at what could be learned from Maher's remark, the Hollywood Reporter wondered aloud if Maher had just lost his chance at winning an Emmy... and CNN wrote an article explaining why it was acceptable for Maher to use the racial slur.", "Or did it?  On 3 June 2017, a web site calling itself 70News published an article appearing to report that CNN had posted — then subsequently deleted — an article by Laura Jarrett, daughter of Valerie Jarrett:", "CNN deleted this article written by Laura Jarrett, daughter of Obama’s top adviser Valerie Jarrett : ‘Bill Maher just dropped the “N” word, here’s 5 reasons why that’s okay”", "After realizing nobody is going to buy their five stupid reasons, CNN decided to delete it.", "Well, maybe she’ll change her mind and tell us what those five reasons are, right CNN?", "This obvious hoax received wide attention after it was promulgated by conservative pundits, such as Jack Posobiec and Dinesh D'Souza. Although D'Souza later issued a correction, which stated that he had been duped by a fake news article, Posobiec did not retract his claim:", "It further appears that 70Newssimply put a fake title on an image of a genuine article published by Laura Jarrett. A look at the actual story article published by CNN above the doctored image shows that they have identical timestamps:", "70News is not a reliable source for factual information. The WordPress site peddles little more than conspiracy theories and misinformation, and was largely responsible for spreading the (completely and demonstrably false) rumor that President Trump won the popular vote.", "NPR.   \"Bill Maher Apologizes After Using N-Word On His Show.\"\r\n    5 June 2017.", "Stevens, Heidi.   \"Comedian Bill Maher, Believe It or Not, Offers a Teaching Moment.\"\r\n    Chicago Tribune.   5 June 2017.", "Feinberg, Scott.   \"Emmys: Did Bill Maher Just Blow a Nomination?\"\r\n    The Hollywood Reporter.   4 June 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]