["By Lori Robertson, Eugene Kiely and D'Angelo Gore", "Posted on February 23, 2021", "In remarks at a Pfizer manufacturing site, President Joe Biden made misleading claims while boasting about his administration’s progress in getting Americans vaccinated against COVID-19.", "Biden spoke on Feb. 19 at Pfizer’s Kalamazoo, Michigan, manufacturing site.", "Biden claimed that the previous administration had “failed to order enough vaccines.” But that’s misleading.", "The Biden administration increased the federal government’s vaccine orders with Moderna and Pfizer/BioNTech. But the Trump administration had options in place to order more from Moderna and Pfizer/BioNTech.", "The Trump administration also had contracted for even more doses from other companies, but that plan depended on those vaccines getting Food and Drug Administration authorization.", "“Just over four weeks ago, America had no real plan to vaccinate most of the country,” Biden said, going on to say his predecessor “failed to order enough vaccines, failed to mobilize the effort to administer the shots, failed to set up vaccine centers. That changed the moment we took office.”", "We’ll start with the claim that the Trump administration hadn’t ordered “enough vaccines.” As we’ve written before, the federal government, as of Dec. 31, had contracted to buy at least 800 million COVID-19 vaccine doses with delivery by July 31. Those doses included vaccines from four companies who have not yet received FDA authorization.", "And a Government Accountability Office report, released on Jan. 28, said in a footnote that updated information from the vaccine companies and the Department of Defense “indicate there are at least one billion vaccine doses under contract as of January 2021. Moreover, the government may acquire additional doses through the exercise of options or execution of new agreements.”", "So, the Trump administration had clearly ordered “enough” vaccine doses for the U.S. population. However, the issue right now is that only the Pfizer/BioNTech and Moderna vaccines are authorized. (The FDA’s vaccine advisory committee is meeting on Feb. 26 to discuss the Janssen Biotech vaccine candidate.)", "In December, Pfizer and Moderna had agreed to provide 400 million doses (200 million each) by the end of July. The initial agreement with the Trump administration was for 200 million doses total from the two companies, but it made agreements for another 200 million total, according to the GAO report.", "The Biden administration announced this month the two companies would provide yet another 200 million doses by the end of July, for a total of 600 million.", "And Biden announced the federal government would get some of those doses sooner than previously expected, with 100 million of the doses from each company promised by the end of May, rather than the end of June.", "It’s worth noting that the Trump administration could have increased its order with Pfizer and Moderna as well. The U.S. government announced its initial agreement with Pfizer in July, contracting for 100 million doses of a COVID-19 vaccine once it was approved. That agreement included an option to acquire an additional 500 million doses from Pfizer.", "Similarly, the government’s initial contract with Moderna, announced in August, was for 100 million doses of a vaccine once approved, with an option to buy another 400 million doses.", "As for Biden’s claim that there was “no real plan to vaccinate most of the country,” the Washington Post Fact Checker wrote about a similar claim from Vice President Kamala Harris. The Fact Checker explained that there were vaccination plans that the Biden administration had built upon. But the two administrations have a philosophical difference on how much of a role the federal government, as opposed to state and local entities, should play in vaccinating the country.", "On Sept. 16, nearly three months before the first FDA authorization of a COVID-19 vaccine, the Department of Health and Human Services, with support from the Department of Defense and the Centers for Disease Control and Prevention, released a report to Congress, outlining a strategy for vaccine distribution and a playbook for states and localities “on how to plan and operationalize a vaccination response to COVID-19 within their respective jurisdictions,” according to the HHS press release.", "The Government Accountability Office, however, in a report released Jan. 28, said it had recommended that HHS go further to “establish a time frame for documenting and sharing a national plan for distributing and administering COVID-19 vaccine” including “how efforts would be coordinated across federal agencies and nonfederal entities.” GAO said that its recommendation hadn’t been “fully implemented.”", "Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, told CNN on Feb. 16 that there had been a vaccine distribution plan but a “rather vague” plan on “getting the vaccine doses into people’s arms.”", "“Getting the vaccines made, getting them shipped through Operation Warp Speed was okay,” Fauci said. “But I believe what the vice president is referring to is what is the process of actually getting these doses into people. That is something that we had to get much better organized now with getting the community vaccine centers, getting the pharmacies involved, getting mobile units involved.”", "The Biden administration has taken steps to increase the number of people who can administer the vaccines and where the shots can be given, including by shipping vaccines directly to retail pharmacies and opening mass vaccination sites operated by the Federal Emergency Management Agency. These steps have also come as vaccine availability has increased.", "Biden exaggerated when he claimed that vaccinations have “nearly doubled” on his watch.", "Biden, Feb. 19: We’re now at a point where we’ve seen the average daily number of people vaccinated nearly double, from the week before I took office, to about 1.7 million average per day getting a shot.", "Actually, on the day Biden spoke, the average daily number of people vaccinated had increased by 31% — not “nearly double.”", "On the day Biden took office, the seven-day “moving average” for the previous week was about 971,500 shots a day, according to the Centers for Disease Control and Prevention’s COVID Data Tracker. By Feb. 19, when Biden visited Pfizer, the daily average was at 1,270,728 vaccinations.", "The average had been higher in the days before. On Feb. 14, the seven-day moving average hit a peak of 1,621,578. That’s a 67% increase — sizable, but still not “nearly double.”", "This is not the first time that Biden has exaggerated his administration’s progress in vaccinating the public.", "Earlier this month, Biden tweeted this about his promise to administer 100 million vaccine doses in his first 100 days in office: “With the progress we’re making I believe we’ll not only reach that, we’ll break it.” But, as we wrote, the seven-day daily average was at 1 million doses per day on Biden’s second day in office — so he was well on his way to meeting his 100-day goal.", "Biden, as he has several times before, said “an analysis by the Wall Street firm Moody’s estimates that if we pass my American Rescue Plan, the economy will create 7 million jobs this year.”", "But the Jan. 15 analysis from Moody’s Analytics didn’t say Biden’s economic plan alone would be responsible for the addition of all those jobs, as the president’s statement could suggest.", "Moody’s said that, assuming Biden’s $1.9 trillion coronavirus relief plan is fully enacted by March, gross domestic product would grow to 8% for 2021 and 4% in 2022. “At this pace of growth, the economy would create 7.5 million jobs in 2021 (December to December) and 2.5 million in 2022 to fully recover the jobs lost since the pre-pandemic peak,” the analysis said.", "The report, however, noted that projected economic growth “is almost double the growth that would be expected without any additional fiscal support.”", "The chief economist at Moody’s Analytics, Mark Zandi, who co-authored the analysis of Biden’s proposal, confirmed that means nearly half of the projected job gains for this year are likely to occur even if the president’s plan doesn’t become law.", "“If there is no additional fiscal support, the economy will create 3.5 million jobs during this period [December 2020 and December 2021], or 4 million less than if the Biden plan is passed,” Zandi told us in an email.", "At least one time, Biden himself has made that distinction more clear.", "“Wall Street investment firm, Moody’s, says if we pass the American Rescue Plan, it will lead to 4 million more jobs than otherwise would be created,” he said in Feb. 5 remarks at the White House, for example.", "In advocating for the American Rescue Plan, the president said “40 million Americans will lose nutritional assistance through a program we call SNAP, the old food stamp program” if the relief plan isn’t enacted.", "“Do we not invest $3 million — $3 billion to keep families from going hungry?” he said.", "That claim needs context.", "The White House transcript of Biden’s remarks added the words “some of their” in brackets before “nutritional assistance.” If Biden’s plan isn’t enacted, those Americans in the Supplemental Nutrition Assistance Program — 42.9 million as of September, the latest figures available — would lose “some of” their benefits, but not until the end of June.", "COVID-19 relief legislation passed in December put in place a 15% SNAP benefit increase that will last through June; Biden’s plan would extend that 15% boost until September. In announcing the plan in January, the White House said Biden “is also committed to providing this boost for as long as the COVID-19 crisis continues, and will work with Congress on ways to automatically adjust the length and amount of relief depending on health and economic conditions.”", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]