["About this rating", "On 20 May 2018, United States President Donald Trump stated in a message posted to social media platform Twitter that he wanted the Department of Justice to investigate whether it \"infiltrated or surveilled\" his political campaign at the behest of his predecessor:", "I hereby demand, and will do so officially tomorrow, that the Department of Justice look into whether or not the FBI/DOJ infiltrated or surveilled the Trump Campaign for Political Purposes - and if any such demands or requests were made by people within the Obama Administration!", "— Donald J. Trump (@realDonaldTrump) May 20, 2018", "The president had been fuming on Twitter about mid-May 2018 revelations that the Federal Bureau of Investigation had an informant talking to key members of his presidential campaign and accusing former U.S. President Barack Obama of sending the Justice Department to spy on it for political purposes.", "The FBI's activities have culminated into what is now an ongoing Department of Justice investigation led by Special Counsel Robert Mueller into Russian meddling in the election. The investigation has lead to indictments of several key Trump campaign associates, including its former chairman.", "The New York Times reported on the tweet with a story headlined, \"Trump Demands Inquiry Into Whether Justice Dept. ‘Infiltrated or Surveilled’ His Campaign,\" which inspired a satirical but fake image purporting to show a headline comparing the DOJ investigation to the one that brought down notorious Chicago mobster Al Capone in 1931:", "From the archives: On Oct. 17, 1931, Al Capone was found guilty of tax evasion. He would later be sentenced to 11 years in prison. https://t.co/uFx3oncrc8 pic.twitter.com/Q3MXNqqcjQ", "— Chicago Tribune (@chicagotribune) October 17, 2017", "Capone was a Chicago gangster who gained influence bootlegging liquor during Prohibition. He was finally convicted on tax fraud charges resulting from an FBI investigation that nabbed him despite a public corruption scheme in which he paid off police and officials that allowed him to operate with relative impunity for years.", "Hirschfeld Davis, Julie, and Goldman, Adam. \"Trump Demands Inquiry Into Whether Justice Dept. ‘Infiltrated or Surveilled’ His Campaign.\"\r\n  The New York Times 20 May 2018.", "Tucker, Neely. \"Eliot Ness and Al Capone: The Men, the Myths and the Bad Man in the Dark.\"\r\n  The Washington Post. 18 February 2014.", "Costa, Robert, et al. \"Secret FBI Source for Russia Investigation Met With Three Trump Advisers During Campaign.\"\r\n  The Washington Post. 18 May 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]