["About this rating", "In November 2011, news outlets (such as the UK's Sun) picked up a news story about a \"furious woman suing her ex-boyfriend after he tattooed a steaming poo on her back\":", "Rossie Brovent wants £60,000 in damages from Ryan Fitzjerald.", "Rossie, from Dayton, Ohio, US, wanted a scene from the Narnia trilogy inked on her back.", "Instead she was left with a pile of excrement with flies buzzing around it.", "Tattoo artist Ryan turned rogue after discovering that Rossie had cheated on him with his best friend.", "Rossie originally tried to have her ex-lover charged with assault but she had signed a consent form agreeing the tattoo design was \"at the artist's discretion\".", "She said: \"He tricked me by drinking a bottle of cheap wine with me and doing tequila shots before I signed it and got the tattoo.\"", "\"Actually I was passed out for most of the time, and woke up to this horrible image on my back.\"", "However, as other news outlets (such as the Daily Mail) found after investigating the story, it didn't pan out: the proffered photograph was a much older one that had originally appeared in a different context and had since been reused to illustrate a fabricated backstory, as the Smoking Gun noted of the claim:", "The photo appears legitimate. In fact, it first surfaced online about 18 months ago as part of a \"Worst Tattoo of the Day\" post on the blog I Am Bored.", "The image reappeared this week — complete with a backstory about the fractured love of \"Rossie\" and \"Ryan\" — on a sketchy \"weird news\" web site that appears to be dedicated to ginning up its Google AdSense impressions.", "A review of court indices, of course, shows no such civil complaint has ever been filed (either in federal or state court) by \"Brovent.\" James Druber, administrator of the Montgomery County Common Pleas Court (where Dayton residents file their six-figure complaints), said that he had heard nothing about the purported tattoo lawsuit.", "Records for Dayton and Montgomery County show no evidence that \"Fitzjerald\" (or \"Fitzgerald\") has been licensed as a tattoo parlor operator or employee, according to Alan Pierce, an official with the Public Health department.", "Exactly who is pictured in the original photograph, and what the tattoo shown was intended to depict, remain unknown.  Some viewers have suggested that the tattoo might be a representation of moths being drawn to a candle flame that is sitting atop a pile of stones rather than of flies buzzing around a pile of feces.", "Duell, Mark.   \"The Truth About the Girl with the 'Poop' Tattoo.\"\r\n     Daily Mail.   29 November 2011.", "The Sun.   \"Tatt-Poo for Cheating.\"\r\n     29 November 2011.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]