["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Andrew Cuomo gives a coronavirus update on May 20, 2020, in the State Capitol. At left is Mariah Kennedy Cuomo. (courtesy Gov. Andrew Cuomo's office)", "New York Gov. Andrew Cuomo, facing criticism for how the state handled COVID-19 in nursing homes, has said his administration followed guidance from the U.S. Centers for Disease Control and Prevention.", "Approximately 6,000 nursing home residents in New York have died from the virus, and Cuomo was asked on May 20 about calls for a federal probe into how the state handled nursing homes, and in particular, a March advisory that sent COVID-19 patients from hospitals to nursing homes.", "\"I’m not going to get into the political back and forth, but anyone who wants to ask, why did the state do that with COVID patients in nursing homes? It’s because the state followed President Trump’s CDC guidance,\" Cuomo said.", "Is Cuomo correct? We looked at federal guidance at the time of the state's March 25 order, as well as other state Health Department actions at that time.", "Before the state Health Department sent its controversial March 25 advisory, which has since been withdrawn, the CDC released guidance for nursing homes.", "The CDC cited two \"key factors\" to consider when deciding whether to discharge a patient with COVID-19 to a long-term care facility, said Kristen Nordlund, a CDC spokesperson. First, is the patient medically ready for discharge to a long-term care facility? And second, is the selected long-term care facility able to safely care for a patient recovering from the virus by implementing all recommended infection control procedures? These directives were in place on or before March 23, two days before the state issued its advisory.", "One week before the state's advisory was released, the CDC’s Morbidity and Mortality Report looked at a facility in Washington State. The report’s authors recommended that \"in the context of rapidly escalating COVID-19 outbreaks in much of the United States, it is critical that long-term care facilities implement active measures to prevent introduction of COVID-19.\"", "The U.S. Centers for Medicare and Medicaid Services, the federal regulator of nursing homes known as CMS, also issued COVID-19 guidance.", "The top administrator at CMS, Seema Verma, pushed back on Cuomo’s claim that the state followed federal guidance. She  cited a March 13 CMS document, which says that nursing homes should only accept those patients for which they can care.", "The CMS memo also states: \"Per CDC, prompt detection, triage and isolation of potentially infectious residents are essential to prevent unnecessary exposures among residents, healthcare personnel, and visitors at the facility. Therefore, facilities should continue to be vigilant in identifying any possible infected individuals.\"", "It was a week after the Cuomo order, on April 2, that the CMS said new long-term care patients and residents \"should be screened for COVID-19 through testing, if available.\"", "CMS guidance also states that if possible, nursing homes should dedicate a unit or wing exclusively to residents returning from the hospital, where they can remain for 14 days without symptoms.", "The state was clear about why it issued its March 25 advisory to nursing home administrators, directors of nursing and hospital discharge planners: There was an \"urgent need\" to free up space in hospitals for seriously ill coronavirus patients.", "The advisory said all nursing homes \"must comply with the expedited receipt of residents returning from hospitals to\" nursing homes, and that hospitals must declare residents medically stable before they are sent back to the nursing homes.", "The next directive, where \"NH\" is \"nursing home\" (emphasis by the Department of Health): \"No resident shall be denied re-admission or admission to the NH solely based on a confirmed or suspected diagnosis of COVID-19. NHs are prohibited from requiring a hospitalized resident who is determined medically stable to be tested for COVID-19 prior to admission or readmission.\"", "It also stated: \"As always, standard precautions must be maintained, and environmental cleaning made a priority, during this public health emergency.\"", "In other communications in March, the state told nursing homes to isolate infected residents in their rooms or to consider grouping them in a dedicated unit, as well as to stay current with CDC guidelines in preventing the spread of the disease.", "To support Cuomo’s claim, the administration pointed us to longstanding state and federal regulations that predate the pandemic, which require nursing homes to only accept patients for which they can care.", "\"This is business in a nursing home: Take them if you can care for them,\" said state Department of Health spokesperson Gary Holmes.", "Holmes also pointed us to the March 13 CMS memo, which states that when a resident who was diagnosed with COVID-19 is coming from a hospital, nursing homes \"can accept\" them, as long as the facility can follow CDC infection control measures.", "The CMS memo also states: \"Nursing homes should admit any individuals that they would normally admit to their facility, including individuals from hospitals where a case of COVID-19 was/is present.\"", "Nursing homes felt pressure to accept coronavirus patients following the March 25 order.", "The AMDA-Society for Post-Acute and Long-Term Care Medicine issued a statement on March 26 opposing the order: \"We find the New York State Advisory to be over-reaching, not consistent with science, unenforceable, and beyond all, not in the least consistent with patient safety principles.\" A joint statement by that organization and others in long-term care three days later reinforced their objections: \"a blanket order for every nursing home in the state to accept all admissions from hospitals is not sound policy.\"", "On April 9, the head of a Brooklyn nursing home asked state health officials if COVID-19 patients could be transfered to the Javits Center or the Navy hospital ship, and was denied permission, the Associated Press reported.", "In late April, when reporters questioned Cuomo about the directive that nursing homes accept coronavirus patients, Cuomo repeatedly said that nursing homes should find other beds for these patients if they cannot care for them, or turn to the state to do so. He also said that the facilities \"don’t have the right to object\" to the state’s policy.", "On April 23, State Health Commissioner Dr. Howard Zucker said no nursing home had asked the state to take any patients it couldn’t handle.", "On April 29, after the state's policy had been under intense scrutiny, Zucker wrote a letter to nursing homes, telling them to alert the state if they have patients for which they cannot care.", "In recent weeks, three facilities have asked the state for help, Holmes said.", "The March 25 advisory has been removed from the state website, and the state’s directive to nursing homes is now much different. Cuomo issued an executive order on May 10, which states that hospitals \"shall not discharge a patient to a nursing home, unless the nursing home operator or administrator has first certified that it is able to properly care for such a patient.\" The order also requires that a patient must be tested for COVID-19, and the test must be negative.", "Though the state's actions have been criticized, it’s unclear what was the biggest source of infection in nursing homes, whether it was incoming residents, or health care workers and visitors unaware they had the virus.", "The CDC's guidance at the time of the March 25 state order was that COVID-19 patients who are medically stable can be discharged from a hospital to a nursing home, but only if the nursing home can implement all recommended infection control procedures.", "CMS, a federal agency that regulates nursing homes, issued similar guidance, and also said that preferably, coronoavirus patients should be cared for in a dedicated unit.", "Like CDC and CMS, the state Health Department said only those patients who are medically stable can be discharged, and also recommended that nursing homes consider dedicated units, if possible. The Health Department prohibited nursing homes from requiring a COVID-19 test before admitting a resident, while CMS said new residents should be tested, but did not require it.", "The Cuomo administration points to state and federal regulations that predate the pandemic, which require facilities to accept only those patients they can care for. In addition, earlier state communications encouraged nursing homes to stay current with CDC guidance.", "But once the state issued its March 25 advisory, nursing home operators said that they felt they had no choice but to accept residents who were either known to be infected or suspected to be. That’s because the March 25 memo did not say anything about making sure that a nursing home can care for a patient before making an admission decision, and said they \"must comply with the expedited receipt of residents.\" In the month following the memo, nursing homes pleaded for relief from the order.", "We rate his statement Mostly False.", "Rev.com, \"Andrew Cuomo New York May 20 COVID-19 Press Conference Transcript,\" May 20, 2020. Accessed May 21, 2020.", "USA Today, \"Coronavirus in nursing homes: three months and 40,600 deaths,\" June 1, 2020. Accessed June 7, 2020.", "The Buffalo News, \"Covid-19 brutal on NY long-term care facilities; nationwide, it's worse,\" May 26, 2020. Accessed May 27, 2020.", "New York State Department of Health, \"Advisory: Hospital Discharges and Admissions to Nursing Homes,\" March 25, 2020, via Skilled Nursing News. Accessed May 24, 2020.", "New York State Executive Order No. 202.30, \"Continuing Temporary Suspension and Modification of Laws Relating to the Disaster Emergency,\" May 10, 2020. Accessed May 24, 2020.", "Email interview, Kristen Nordlund, public affairs, U.S. Centers for Disease Control and Prevention, June 5, 2020.", "Twitter, tweets, @SeemaCMS, May 21, 2020. Accessed May 22, 2020.", "Centers for Medicare and Medicaid Services, memo, \"Guidance for Infection Control and Prevention of Coronavirus Disease 2019 (COVID-19) in Nursing Homes (REVISED),\" March 13, 2020. Accessed May 22, 2020.", "Email, phone interviews, Gary Holmes, spokesperson, New York State Department of Health, May 21, 27, 2020.", "Centers for Disease Control and Prevention, \"Discontinuation of Transmission-Based Precautions and Disposition of Patients with COVID-19 in Healthcare Settings (Interim Guidance)\" on March 24, 2020, via Internet Archive. Accessed May 27, 2020.", "Centers for Disease Control and Prevention, \"Responding to Coronavirus (COVID-19) in Nursing Homes,\" April 30, 2020. Accessed May 31, 2020.", "Email interview, Richard J. Mollot, executive director, Long Term Care Community Coalition, May 22, 2020.", "AMDA-The Society for Post-Acute and Long Term Care Medicine, \"Statement on the March 25, 2020 New York State Department of Health Advisory: Hospital Discharges and Admissions to Nursing Homes,\" March 26, 2020. Accessed May 25, 2020.", "AMDA-AHCA-NCAL Statement, \"State Advisories re: Hospital Discharges and Admissions to Nursing Homes and Assisted Living Communities,\" March 29, 2020. Accessed May 25, 2020.", "Rev.com, transcript, \"Andrew Cuomo New York COVID-19 Briefing Transcript April 23,\" April 23, 2020. Accessed May 30, 2020.", "Rev.com, transcript, \"Andrew Cuomo New York COVID-19 Briefing Transcript April 22,\" April 22, 2020. Accessed May 25, 2020.", "ABC.com, \"AP count: Over 4,500 virus patients sent to NY nursing homes,\" May 22, 2020. Accessed May 25, 2020.", "Centers for Medicare and Medicaid Services, State Operations Manual, Appendix PP - Guidance to Surveyors for Long Term Care Facilities, Section §483.15(c) (1) (i), Revised Nov. 22, 2017. Accessed May 26, 2020.", "New York Codes, Rules, and Regulations: Volume C (Title 10), Chapter V, SubChapter A, Article 3, Part 415, Administrative, Title: Section 415.26 - Organization and Administration, Admission Policies and Practices, June 2, 2010. Accessed May 26, 2020.", "Centers for Medicare and Medicaid Services, \"COVID-19 Long-Term Care Facility Guidance,\" April 2, 2020. Accessed May 31, 2020.", "Centers for Disease Control and Prevention, \"Morbidity and Mortality Weekly Report: COVID-19 in a Long-Term Care Facility — King County, Washington, February 27–March 9, 2020,\" March 18, 2020. Accessed May 26, 2020.", "The Associated Press, \"NY’s Cuomo criticized over highest nursing home death toll,\" May 9, 2020. Accessed May 25, 2020.", "The Wall Street Journal, \"New York Sent Recovering Coronavirus Patients to Nursing Homes: ‘It Was a Fatal Error’\" May 14, 2020. Accessed May 24, 2020.", "New York State Department of Health presentation, \"COVID-19 Infection Control Guidance for Nursing Homes and Adult Care Facilities,\" March 26, 2020. Accessed May 27, 2020.", "New York State Department of Health, \"Health Advisory: COVID-19 Cases in Nursing Homes and Adult Care Facilities,\" March 13, 2020. Accessed May 27, 2020.", "The New York Times, \"She’s Alone, 105 and in a Nursing Home Threatened by the Virus,\" March 31, 2020. Accessed May 27, 2020.", "New York State Department of Health letter to nursing homes, March 11, 2020. Accessed May 27, 2020.", "NBC News, \"Coronavirus spreads in a New York nursing home forced to take recovering patients,\" April 25, 2020. Accessed May 27, 2020.", "Emailed statement, Christopher Laxton, executive director, AMDA-The Society for Post-Acute and Long-Term Care Medicine, May 29, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]