["By Mitchell Aronoff", "Posted on February 13, 2020", "A fabricated newspaper clipping is circulating online claiming a teenage Pete Buttigieg was arrested in the late 1990s for killing dogs. The Twitter user who created the bogus story — and the newspaper that allegedly published it — say the clipping is a fake.", "A fake newspaper clipping with a photo of a very young Pete Buttigieg, the presidential candidate and former mayor South Bend, Indiana, is circulating online, reporting that Buttigieg was arrested in 1998 for killing five dogs. The creator of the clipping who first shared it on his Twitter account has repeatedly admitted that it was fabricated and intended as a joke. And the newspaper that it purportedly appeared in, the South Bend Tribune, has stated that it never published the article in question.", "Yet the fake clipping is still being shared on social media, amassing more than 2,000 shares on Facebook and 2,000 retweets of the original tweet.", "The bogus article first appeared in a Feb. 8 tweet by @ComradeCrow, with the caption, “Why won’t anyone discuss this? @CNN @washingtonpost @nytimes” and two accompanying photos: one of the fabricated newspaper article and the other of a teenage Buttigieg.", "Under the headline, “Teen Arrested for Dog Slayin,” the article reads: “A local teen, Peter Buttigieg, has been arrested on suspicion of the recent killings of at least 5 dogs.”", "In the comments, when another Twitter user, @janeruthsozo, asked, “Where did you find this article?” @ComradeCrow stated, “In my web browser when I made it.” He goes on to admit that the tweet was “a joke,” and even reaffirmed that he is an “unreliable news source.”", "A representative of the Buttigieg campaign had no comment on the fake article, but directed us to a story in the South Bend Tribune, the alleged source of the phony clipping, debunking this and other false claims circulating around Buttigieg.", "The Tribune stated that it had never published the dog story and noted “several clues” that indicated the clipping was a fraud, including the wrong masthead style, the lack of a byline or dateline, and no age or hometown given for Buttigieg.", "“So let’s just make this perfectly clear: The Tribune did not publish the story making the rounds,” the paper wrote.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "@ComradeCrow “Why won’t anyone discuss this? @CNN @washingtonpost @nytimes” Twitter. 8 Feb 2020.", "@janeruthsozo “Where did you find this article?” Twitter. 8 Feb 2020.", "Havens, Cory. The CIA, abused dogs, the Iowa app and ‘Breathe Easy’: Buttigieg draws rumors, conspiracies. South Bend Tribune. 11 Feb 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]