["About this rating", "On 18 September 2017, the satirical web site As American As Apple Pie reported that actor Alec Baldwin had been arrested at the 2017 Emmy Awards for threatening President Donald Trump:", "The Secret Service was forced to remove Alec Baldwin from the Emmys in Los Angeles Sunday night after he threatened to “use his influence to get close to Trump and then slit his throat.” Baldwin, whose mic was still hot in the sound booth at the time, put up quite a fight:", "“Mr Baldwin doesn’t reaslize [sic] the severity of this situation. He voiced a credible threat to the President of the United States. There are consequences for that.”", "Baldwin is being held for questioning at the federal holding facility at Los Alamada del Ray. We will update this developing story as more information is available.", "Alec Baldwin did attend the Emmy Awards on 17 September 2017, and won Outstanding Supporting Actor in a Comedy Series for his portrayal of Trump on Saturday Night Live. However, he did not make any threat against the President and was not arrested.", "As American As Apple Pie is a satirical, fake news web site which publishes exclusively fake content, and alludes to its own unreliability in this tongue-in-cheek disclaimer:", "When no one can trust the lying fake news liberal media anymore because they hate us and guns and Harley Davidson and meat and OUR president, As American as Apple Pie is here to be your beacon of something you can kinda rely on sometimes, but not really. God Bless America and Amen.", "Other stories that have taken in readers of the site include claims that a Muslim mayor outlawed Christmas in 2017, and that a Muslim federal judge had ruled that two items of sharia law were now considered legal in the United States. Neither story had any truth to them whatsoever.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]