["A message regarding the availability of an online voting facility for Non-Indian Residents (NRIs) in 2019 general elections is doing the rounds on social media. The message says, “Hello All, Those who hold Indian passport, can now vote online for 2019 elections. Please register yourself on https://eci.gov.in There is a link Enroll as NRI voter. Please spread the word in your different groups.”.", "It claims that any Non-Resident Indian (NRI), who holds an Indian passport can now vote online by registering themselves on the website of Election Commission of India (ECI). A link to the official website of ECI was also attached to the message. Multiple social media users on Twitter and Facebook have shared the same message.", "Hello All, Those who hold Indian passport, can now vote online for 2019 elections. Please register yourself on…", "Posted by Neena Verma on Saturday, 23 March 2019", "Alt News found that the claim about NRIs registering and voting online is partially true to the extent that they can register online for voting in the upcoming general election. As far as the casting of votes for overseas Indian voters is concerned, the Election Commission of India has specified that an overseas Indian voter has to be physically present at the polling booth with his/her Indian passport. According to the ECI website, overseas Indians may have to submit an application for enrollment in form 6A online at the nvsp.in or by using the Voters helpline mobile app.", "This was also reiterated by the spokesperson of ECI and on the official website after rumours about online voting facility started circulating on social media.", "The Election Commission of India has also written to the Deputy Commissioner of Police (DCP) of Delhi to lodge an FIR and investigate the matter of fake news related to voting by NRIs. It may well be noted that a bill to extend the facility of proxy voting to overseas Indians was passed by the Lok Sabha in August last year but is pending in the Rajya Sabha. This was earlier fact-checked by BoomLive.", "As follow up action, written to DCP New Delhi District to lodge FIR & investigate the matter of fake news, relating to voting by NRIs using ECI logo, currently in circulation on WhatsApp pic.twitter.com/2JpvRcAbzQ", "— Sheyphali Sharan (@SpokespersonECI) February 22, 2019", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]