["About this rating", "A 2010 review undertaken by Oxford University suggested that gluteofemoral fat stores conferred more health benefits than visceral fat, and 2007 research similarly examined waist-to-hip ratio (not \"big butts\").", "Studies have not determined that women with big butts are generally smarter and healthier than women who don't have big butts.", "On 30 October 2013, the web site Elite Daily published an article that quickly became accepted social media fact:", "If the University of Oxford says so ... \"Women With Big Butts Are Smarter And Healthier\" https://t.co/PG6QZdgEbA #ScienceSays", "— Natali Tofiloski (@talkALOTski) April 14, 2016", "An Oxford study has shown that women with big butts are more intelligent than women with flat butts. pic.twitter.com/dPzbfoUdvb — Google Facts (@GoogleFacts) February 26, 2016", "That reporting featured a study supposedly documenting that \"women with big butts\" are \"smarter and healthier\" than their flat-bottomed counterparts:", "Scientists from the University of Oxford have discovered that women with larger than average butts are not only increasingly intelligent but also very resistant to chronic illnesses.", "According to ABC News, the results found that women with bigger backsides tend to have lower levels of cholesterol and are more likely to produce hormones to metabolize sugar.", "That article didn't directly link to the research in question but instead cited a 12 January 2010 ABC News piece about the same study, which made less bombastic claims:", "Public health officials have harped on actively taking steps to reduce obesity, but it seems for some genetically lucky individuals, reducing their body fat isn't as important.", "A new review published by researchers at the University of Oxford and Churchill Hospital in the United Kingdom suggests that people who carry their body fat in their thighs and backside aren't just carrying extra weight, but also some extra protection against diabetes, heart disease and other conditions associated with obesity.", "Elite Daily didn't mention the age of the original research at the time their article was published in 2013, and neither did Cosmopolitan UK when they rehashed the old news as recent information in February 2016. The latter publication also didn't go into much detail about the research, simply referencing famous people with big buttocks and the strategic consumption of cookies:", "Someone tell Kim Kardashian and Beyonce Knowles to have a celebratory buck's fizz, because a study conducted by the University of Oxford reveals women with bigger bums are stereotypically smarter and healthier.", "If ever there were an excuse to have another chocolate chip cookie in the hope it makes your arse bigger, this would be it.", "The claim popped up again in April 2016 on health and lifestyle blogs, framed as a novel new discovery:", "Here’s something you surely didn’t know by now — according to a study conducted at the University of Oxford, women with big butts are smarter and healthier than their average-sized butt counterparts! Girls with big butts also had lower cholesterol levels and good hormones which help them process sugar better, effectively reducing the risk of cardiovascular diseases.", "The research on which these reports were based (which was rarely linked to by these stories) was often portrayed as breaking scientific news, using the same facile summaries:", "A new study by the University of Oxford uncovers evidence that curvaceous women are more intelligent and most resistant to chronic illnesses. According to results, ladies with bigger backsides have lower levels of cholesterol, less heart problems and are less likely to get diabetes.", "Scientists at Oxford argue that fat from the lower body produces “hormones that help to better metabolize sugars and other lipids, unlike abdominal fat secretes hormones with the opposite effect.”", "As noted earlier, this \"news\" repatedly rehashed as welcome health information for curvy women wasn't new at all. Researchers from Oxford University published the far less sexy-sounding \"Gluteofemoral Body Fat as a Determinant of Metabolic Health\" in the International Journal of Obesity way back on 12 January 2010.", "That research was a review (not a study), and it began by stating that the \"proportion of abdominal to gluteofemoral body fat, as measured, for example, by the waist-to-hip ratio, correlates with obesity-associated diseases and mortality and is a stronger cardiovascular risk marker than BMI.\"  In other words, the issue is not how much fat is deposited, but where.  That focus was reflected in the study's conclusion, which reiterated that gluteofemoral adipose tissue potentially offers cardiovascular benefits and merits further research:", "Body fat distribution is a major determinant of metabolic health and gluteofemoral adipose tissue exerts specific functional properties that are associated with an improved metabolic and cardiovascular risk profile. The protective properties of gluteofemoral fat have been confirmed in large population studies. Evidence arising from in vitro and in vivo studies suggests that this is due to a differential regulation of lower-body fatty acid release and uptake at the level of the adipocyte that results in the long-term entrapment of fatty acids in this depot and protection from ectopic fat accumulation. This becomes even more evident in states of gluteofemoral fat loss as in glucocorticoid excess and lipodystrophic syndromes that are associated with increased metabolic and cardiovascular risk. In addition, gluteofemoral adipose tissue could convey protection through a beneficial adipokine profile. This is suggested by the favorable association of leptin and adiponectin levels with gluteofemoral fat mass, while it remains to be proven for other emerging adipokines. The recent discovery of novel gene loci involved in the regulation of body fat distribution, beyond the male–female dichotomy, provides an appealing area for further investigation. Future research will also show if the protective properties of gluteofemoral body fat can be used to attenuate metabolic and cardiovascular risk, as already observed in the redistribution of body fat associated with the clinical use of thiazolidinediones", "No portion of the Journal of Obesity's review definitively stated that women with big butts were \"healthier\" or \"smarter\" than other women, and the authors simply contrasted findings about gluteofemoral fat versus abdominal fat (while other body types, or absence of either kind of fat, were not mentioned):", "Several population studies support the fact that obesity-associated health risks depend on the accumulation of abdominal fat. Abdominal obesity is associated with increased blood pressure and plasma triglyceride (TG) levels. It is also an independent predictor for the development of type 2 diabetes.", "The adverse effect of abdominal obesity arises from the combination of subcutaneous adipose tissue dysfunction and the accumulation of visceral fat that becomes apparent when individuals with increased waist-to-hip ratio are studied with imaging techniques. The particular importance of visceral fat accumulation versus subcutaneous fat depot dysfunction has recently been challenged, as there is mounting evidence to support that visceral adipocytes are phenotypically different from subcutaneous adipocytes.", "That research largely pertained to \"waist-to-hip ratio\" and not just the presence of large derrieres. The same physiological profile was examined by the University of Pittsburgh and the University of California, Santa Barbara, in 2007 research [PDF] published in the journal Evolution and Human Behavior. Again, in that research waist-to-hip ratio (rather than big butts) was the scientific focus:", "Upper-body fat has negative effects and lower-body fat has positive effects on the supply of long-chain polyunsaturated fatty acids that are essential for neurodevelopment. Thus, waist-hip ratio (WHR), a useful proxy for the ratio of upper-body fat to lower-body fat, should predict cognitive ability in women and their offspring. Moreover, because teenage mothers and their children compete for these resources, their cognitive development should be compromised, but less so for mothers with lower WHRs. These predictions are supported by data from the Third National Health and Nutrition Examination Survey. Controlling for other correlates of cognitive ability, women with lower WHRs and their children have significantly higher cognitive test scores, and teenage mothers with lower WHRs and their children are protected from cognitive decrements associated with teen births. These findings support the idea that WHR reflects the availability of neurodevelopmental resources and thus offer a new explanation for men's preference for low WHR.", "So, research undertaken in 2010 contrasting central obesity with gluteofemoral fat stores was widely misinterpreted several years later to suggest that women with big butts were \"smarter and healthier\" than other women. In fact, the research simply reviewed already-published data about different types of obesity and suggested further study based on a collected series of prior findings, and no portion of the 2010 review undertaken at Oxford University pertained to intellect. Research published in 2007 and 2008 similarly looked at waist-hip ratio but never claimed women with \"big butts\" were \"smarter.\"", "Baxter-Wright, Dusty.    \"Women with Bigger Bums Are Smarter and Healthier, Oxford University Study Says.\"\r\n    Cosmopolitan UK.    15 February 2016.", "Brownstein, Joseph.    \"Does More Butt and Thigh Fat Make You Healthier?\"\r\n    ABC News.    12 January 2010.", "Lassek, William D.    \"Waist-Hip Ratio and Cognitive Ability: Is Gluteofemoral Fat a Privileged Store of Neurodevelopmental Resources?\"\r\n    Evolution and Human Behavior.    16 April 2007.", "Levinson, Sam.    \"A Big Butt Is a Healthy Butt: Women with Big Butts Are Smarter and Healthier.\"\r\n    Elite Daily.    30 October 2013.", "Manolopoulous, K.    \"Gluteofemoral Body Fat as a Determinant of Metabolic Health.\"\r\n    International Journal of Obesity.    12 January 2010.", "Schoenwald, Christine.    \"Women with Bigger Butts Are Smarter and Healthier, Study Says.\"\r\n    Your Tango.    4 February 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]