["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democrat Russ Feingold falsely claims only his opponent, U.S. Sen. Ron Johnson, a Republican, is benefiting from spending by super PACs. (Michael Sears, Milwaukee Journal Sentinel)", "Democrat Russ Feingold, locked in a tight rematch with Republican U.S. Sen. Ron Johnson, called a recent attack ad from Johnson’s camp \"simply false\" and \"intentionally misleading.\"", "The ad accused Feingold of starting his Progressives United committee to pay himself and his staff, not to support progressive candidates. (We rated Half True a similar claim from the state GOP)", "When speaking to reporters in Milwaukee October 27, Feingold said about the ad: \"They don’t want to talk about the fact that Senator Johnson not only loves the current finance system, but he is the one who is benefiting from several super PACs. And I am not.\"", "We took a look at claim about who benefitted from the Progressive’s United fund. In this item, we are looking at Feingold’s response: That Johnson is benefiting from several super PACs, but he is not.", "We wondered if that was right.", "Unpacking the PACs", "The day after Feingold’s statement, a major Democratic super PAC announced a $2 million ad buy on his behalf. But we’re considering Feingold’s claim at the time he made it.", "Feingold himself has a history with campaign finance reform — he was half of the McCain-Feingold Bipartisan Campaign Reform Act of 2002, which limited the amount of money national parties can raise and spend on behalf of their candidates.", "The act was an attempt to reign in spending, but some say it pushed donors to super PACs that can raise unlimited amounts of money but can’t donate the money directly to a candidate. Which brings us to 2016.", "At the time of Feingold’s statement, both candidates had already benefited from super PACs, according to data from the Federal Election Committee’s website.", "Two super PACs — For Our Future and Working America Coalition — had spent around $50,000 to support Feingold. And four super PACs had spent around $950,000 to support Johnson: Citizen PAC, Club for Growth Action, Freedom Partners Action Fund, and Let America Work.", "Of course, money spent to oppose a candidate also benefits the other and there was even more spent there.", "Four super PACs spent almost $640,000 to oppose Johnson: For Our Future, Working America Coalition, Planned Parenthood Votes and the League of Conservation Voters Victory Fund.", "And five super PACs spent more than $2.5 million to oppose Feingold: Americas PAC, Citizen PAC, Club for Growth Action, The New Prosperity Foundation and Reform Wisconsin Fund.", "So at the time of Feingold’s statement, super PACs had reported spending around $690,000 on Feingold’s behalf and nearly $3.5 million on Johnson’s. (As noted, an additional $2 million was directed to Feingold the next day.)", "Feingold’s camp pointed to the fact that Johnson had benefited from a much larger share of super PAC spending.", "Maybe so. But that’s not what Feingold said.", "Our rating", "Feingold said Johnson is \"benefiting from several super PACs. And I am not.\"", "Simply put, he was. Though such spending for Johnson has been higher, Feingold has received significant super PAC support.", "Our rating is False.", "Email exchange with Michael Taylor, Feingold spokesman, November 2016", "Email exchange with Ben Voelkel, Johnson spokesman, November 2016", "Feingold defends PAC, hits Johnson on Trump, Daily Tribune, October 27, 2016", "Russ Feingold’s PAC funded fees, salaries for former staffers, himself, Milwaukee Journal Sentinel, June 15, 2015", "\"A better way to buy politicians\", New York Times, February 16, 2012", "Federal Election Committee 2016 independent expenditure data catalog, accessed November 2, 2016", "Super PACs, OpenSecrets.org, accessed November 2, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]