["Not everyone agrees there’s a war on coal, as Republicans often charge, but there’s no question there’s a war over the war on coal in Kentucky’s high-profile Senate race.", "For months, Democrat Alison Lundergan Grimes and Senate Republican leader Mitch McConnell have lobbed accusations at each other, saying their opponent is too weak in supporting the state’s abundant fossil fuel.", "The latest salvo comes from Grimes, who has sustained accusations by McConnell that she wouldn’t fight back against the Environmental Protection Agency’s new proposal for regulating carbon emissions. In a recent ad — which begins with her \"approving\" the ad while appearing in a mine, helmet and all — she parries McConnell’s claim by launching her own coal-themed attack.", "\"What Mitch McConnell doesn’t want you to know is that he and his wife personally took $600,000 from anti-coal groups, including New York City Mayor Michael Bloomberg’s anti-coal foundation,\" Grimes said. \"The only candidate pocketing big money from people who want to destroy coal is Mitch McConnell.\"", "We’ll assess two parts of this claim. First, is McConnell \"pocketing big money from people who want to destroy coal\"? And second, is he the \"only candidate\" taking money from anti-coal activists?", "McConnell’s money", "When we asked Grimes for evidence that McConnell has received $600,000 from those who oppose coal, a Grimes spokeswoman said that McConnell’s wife, former Labor Secretary Elaine Chao, sits on the board of directors of Bloomberg Philanthropies, a charitable organization founded by the former New York City mayor and billionaire founder of the Bloomberg media conglomerate.", "In 2011, Bloomberg Philanthropies promised $50 million over four years to the Sierra Club’s Beyond Coal Initiative. The recipient had a decidedly anti-coal agenda, including an effort to close coal plants in many parts of the country. According to Yahoo! News, Bloomberg said, \"Ending coal power production is the right thing to do, because while it may seem to be an inexpensive energy source the impact on our environment and the impact on public health is significant.\"", "However, Chao didn’t join the board until 2012. Bloomberg Philanthropies spokeswoman Meghan Womack told PolitiFact, \"The decision to provide funding to Sierra Club’s Beyond Coal initiative took place before Elaine Chao joined the Bloomberg Philanthropies board. Bloomberg Philanthropies’ board members do not vote on individual initiatives or program spends.\"", "But the claim really goes off the rails when the ad says McConnell and Chao took $600,000 from anti-coal groups. Chao made far less than that — $9,400 — for serving on the board of Bloomberg Philanthropies, according to the organization’s latest annual filing in 2012.", "So how does the Grimes campaign get to $600,000?", "They also count the $684,186 in fees, stock options and other compensation that Chao made while serving on the board of directors for Wells Fargo.", "How can a bank be anti-coal?", "According to Yahoo! News, in 2013, Wells Fargo announced it would stop investing in companies that engage in mountaintop removal, a practice that involves extracting coal more or less by blowing up mountain summits.", "\"We recognize the significant concerns associated with this practice and we also acknowledge the significant investments made by our coal customers in their mine operations, which were entered into in good faith and in accordance with applicable regulations,\" Wells Fargo wrote in a report titled Environmental and Social Risk Management. \"As a result of our deliberate approach and the broader movement of the industry toward other mining methods, our involvement with the practice of (mountaintop removal) is limited and declining. Wells Fargo will not extend credit to individual MTR mining projects or to a coal producer that receives a majority of its production from MTR mining.\"", "That’s not an insignificant development, but as the Washington Post Fact Checker noted in its own analysis of the ad, that only tells part of the story.", "For instance, Wells Fargo told the Washington Post, \"Given that we still finance coal companies, we would certainly not characterize ourselves as ‘anti-coal.’ \"", "Environmental groups, too, don’t agree that Wells Fargo is out to destroy coal. On the contrary, in 2012, Rainforest Action Network, Sierra Club, and BankTrack named Wells Fargo one of the top five worst banks on coal due to \"their relationship to and control over these dirty dinosaurs.\"", "An updated report card from the groups released in 2014 gave Wells Fargo a \"B\" for its mountain-top removal investments, but the bank still scored a \"D\" for its ties to coal-fired power plants.", "There are certainly banks with a cozier relationship with coal and energy companies. But even though Wells Fargo says it does \"not finance coal-power plants on a stand-alone basis,\" Wells Fargo remains a bank that \"provided $1.9 billion in financing as a lead arranger or lead manager in transactions with coal-fired power companies,\" according to the environmental report.", "Grimes’ money", "How about the other side of the equation — that McConnell is the only candidate \"pocketing big money\" from anti-coal groups?", "As it happens, Grimes’ campaign has benefited some from groups and individuals that are critical of coal use.", "For starters, her campaign reported a $1,000 donation from Frances Beinecke, the president of the Natural Resource Defense Council. The NRDC was instrumental in helping the Obama administration develop the new carbon regulations on existing power plants.", "In October 2011, Susie Tompkins Buell, the founder of the women’s clothing line Esprit and a noted climate change activist, held a fundraiser for Grimes at her California home.", "Grimes’ campaign points out the McConnell has also accepted money from some donors with anti-coal ties. For example, McConnell received $2,000 in campaign contributions from David Litman, a Texas businessman who started Texas Business for Clean Air to oppose new coal plants there.", "Meanwhile, Grimes’ campaign has also benefited indirectly from outside groups that have helped in the ongoing ad wars in Kentucky without officially coordinating with her campaign.", "CREDO, a progressive organization with a campaign focused on fighting \"dirty coal,\" has spent $35,000 to air anti-McConnell ads so far, according to the Center for Responsive Politics, a campaign finance watchdog.", "Meanwhile, the Senate Majority PAC, a political arm of Senate Democrats, has put $4.3 million into the race. The PAC has received significant funding — about $5 million so far — from billionaire environmental activist Tom Steyer.", "That’s not to say that Grimes’ campaign is bankrolled or heavily influenced by anti-coal organizations. Indeed, environmental groups have not jumped into the Kentucky Senate race to back Grimes with the same intensity as they have to help Democrats in states like Colorado and Michigan.", "But there’s enough financial support from anti-coal entities that Grimes’ claim of entirely clean hands is significantly misleading.", "Our ruling", "A Grimes ad claimed that \"the only candidate pocketing big money from people who want to destroy coal is Mitch McConnell.\"", "The assertion is that McConnell and his wife took $600,000 from anti-coal organizations. But the overwhelming bulk of that was earned by Chao from sitting on the board of directors for Wells Fargo, a bank that, despite some steps to curb its support of mountain-top removal mining, still maintains $1.8 billion in coal investments, environmental groups say.", "Meanwhile, Grimes’ campaign has directly and indirectly benefited from money and ads from environmental groups and activists critical of coal.", "We rate the claim False.", "Alison Lundergan Grimes campaign ad, Oct. 6, 2014", "Email interview with Charly Norton, Grimes spokeswoman, Oct. 6, 2014", "Email interview with Allison Moore, spokeswoman for Sen. Mitch McConnell, Oct. 6, 2014", "Yahoo! News, \"Mitch McConnell's wife sits on the board of a group working to kill the coal industry,\" Aug. 8, 2014", "Washington Post Fact Checker, \"4 Pinocchios for a misguided ‘big money’ coal attack by Alison Grimes,\" Oct. 7, 2014", "Wells Fargo, \"Environmental and Social Risk Management,\" February 2013", "New York State Office of the Attorney Generals, Tax information for Bloomberg Family Foundation, 2012", "Bloomberg Philanthropies, Beyond Coal, accessed Oct. 6, 2014", "Rainforest Action Network, the Sierra Club, and BankTrack, \"2014 Coal Finance Report Card, published,\" April 17, 2014", "Rainforest Action Network, the Sierra Club, and BankTrack, \"Dirty Money: US Banks At the Bottom of the Class,\" 2012", "Wells Fargo, Proxy Statement Summary, March 18, 2014", "Wells Fargo, Proxy Statement Summary, March 14, 2013", "Wells Fargo, Proxy Statement Summary, March 15, 2012", "Kentucky for Grimes, Campaign finance reports, May 8, 2014", "New York Times, \"Billionaire Democrat Sets Eye on Senate Races,\" May 17, 2014", "Lexington Herald-Ledger, Grimes raises money with opponents of coal-fired power; McConnell attends pro-coal rally, Oct. 29, 2013", "CREDO, Activism report, 2012", "OpenSecrets.org, Outside Spending: Kentucky Senate Race, accessed Oct. 7, 2014", "Politico, \"Election 2013: Greens face dilemma on backing Alison Lundergan Grimes,\" Nov. 11, 2013", "Associated Press, \"News Guide: Steyer writes $15M to his super PAC,\" Sept. 20, 2014", "Email interview with Meghan Womack, spokeswoman for Bloomberg Philanthropies, Oct. 7, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]