["About this rating", "ON 30 March 2018, the Secular Coalition for America published an article reporting that the Trump administration was planning to construct a monument \"hailing the end of the War on Christmas\":", "Washington, DC -- Today, the Trump Administration unveiled plans to construct a monument hailing the end of the War on Christmas. The new memorial will make good on President Trump's promise to bring about a peaceful resolution to the nearly 20-year contrived conflict.", "\"President Trump is proud to declare victory in the War on Christmas,\" said a White House spokesman, who repeatedly asked that their name not be used. \"No longer will the celebration of Christmas be restricted to private homes, multiple 24/7 radio stations, non-stop television specials, Christmas themed commercials interrupting those television specials, decorations in every major retail outlet, proclamations from elected officials, and a federal holiday. Now that the War on Christmas is over, this cherished religious holiday can finally get the recognition it deserves. The President believes his victory in the War on Christmas will be among the greatest achievements of his presidency.\"", "At the consecration ceremony for the new monument, President Trump is expected to issue an official proclamation establishing that \"Christmas\" will now refer to the entire period of time between Thanksgiving and New Year's Day.", "Of course, no such monument has been planned or announced.  The article was merely a spoof from the Secular Coalition for America, a nonprofit advocacy organization \"dedicated to amplifying the diverse and growing voice of the nontheistic community in the United States,\" that poked fun at the current U.S. political climate and the so-called \"War on Christmas\" -- a supposed liberal movement to strip the December holiday season of all religious significance, along with any mention of Christmas itself, in favor of a highly commercialized, secular, and generic \"winter holiday.\"", "The japing article was clearly identified as an April Fool's Day prank, but because that disclaimer fell at the bottom of the page, the information was presented in a rather dry and official format, and the article was published two days before April 1, many readers didn't catch on that it was merely a seasonal joke -- and that its seasonal aspect is associated with a particular day in April, not one in December.", "Secular Coalition for America.   \"President Trump Announces Plans to Build a Monument Commemorating the War on Christmas.\"\r\n    30 March 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]