["In another feisty affair, the Democrats traded barbs over contested quotes, crime and Castro. We referee some of the rhetoric.", "By Eugene Kiely, Brooks Jackson, Lori Robertson, Robert Farley, D'Angelo Gore, Jessica McDonald and Saranac Hale Spencer", "Posted on February 26, 2020", "In the last Democratic debate before Super Tuesday, the candidates often talked over and past one another. We sort out some of the misinformation.", "CBS News, the Congressional Black Caucus Institute and Twitter hosted the Feb. 25 debate in South Carolina, days before the state’s primary.", "In one of the many heated exchanges throughout the night, Sanders and Biden disagreed over remarks that Sanders made about Cuba in a “60 Minutes” interview that aired on Feb. 23.", "The Vermont senator has been criticized for saying in that interview that not everything was bad in Cuba under dictator Fidel Castro, citing a literacy program that Castro started soon after seizing power.", "When Norah O’Donnell, one of the debate moderators, asked Sanders how voters can trust him after “expressing sympathy for socialist governments in Cuba and Nicaragua,” Sanders compared his remarks on “60 Minutes” to what President Barack Obama had once said about Cuba.", "“Of course you have a dictatorship in Cuba. What I said is what Barack Obama said in terms of Cuba, that Cuba made progress on education,” said Sanders, a self-described democratic socialist. “What Barack Obama said was they made great progress on education and health care. That was Barack Obama.”", "Biden took exception to Sanders comparing himself to Obama, triggering a back-and-forth between the two.", "Biden: Barack Obama was abroad, he was in a town meeting, he did not in any way suggest that there was anything positive about the Cuban government. He acknowledged that they did increase life expectancy. But he went on and condemned the dictatorship. … [T]he fact of the matter is [Obama], in fact, does not, did not, has never embraced an authoritarian regime and does not now. [Sanders] said that, in fact, he thought it was — he did not condemn what they did.", "Sanders: That is untrue, categorically untrue. I have condemned authoritarianism.", "Biden was right about Obama’s town hall remarks, but wrong about Sanders’ statements on “60 Minutes.”", "Obama visited Cuba in March 2016 and days later held a town hall in Argentina. At the town hall, Obama recalled speaking to Castro and telling him that he had “made great progress in educating young people” and significantly improving health care.", "“They should be congratulated,” Obama said. “But you drive around Havana and you say this economy is not working. It looks like it did in the 1950s. And so you have to be practical in asking yourself how can you achieve the goals of equality and inclusion, but also recognize that the market system produces a lot of wealth and goods and services. And it also gives individuals freedom because they have initiative.”", "In an exchange with “60 Minutes” host Anderson Cooper, Sanders said he condemned “the authoritarian nature of Cuba,” contrary to Biden’s statement.", "Sanders, Feb. 23: We’re very opposed to the authoritarian nature of Cuba but you know, it’s unfair to simply say everything is bad. You know? When Fidel Castro came into office, you know what he did? He had a massive literacy program. Is that a bad thing? Even though Fidel Castro did it?", "Cooper: A lot of dissidents were imprisoned in Cuba.", "Sanders: That’s right. And we condemn that.", "The Biden campaign provided us with past votes and statements that Sanders has made about Cuba — including one statement that was featured during the “60 Minutes” segment. Sanders — “back in the 1980s,” as Cooper put it — said the Cuban people did not help the U.S. overthrow Castro because “he educated their kids, gave them health care, totally transformed the society, you know?”", "Biden has a point that Sanders has said positive things about authoritarian regimes, but he was wrong when he said that Sanders “did not condemn what they did.” He said so in the “60 Minutes” interview that triggered the dispute between the two candidates.", "Bloomberg and Warren clashed early in the debate over a harassment allegation made against Bloomberg in the 1990s.", "After describing what she called pregnancy discrimination during her first career as a special-education teacher, Warren took a shot at Bloomberg, saying, “At least I didn’t have a boss who said to me, ‘kill it,’ the way that Mayor Bloomberg is alleged to have said to one of his pregnant employees,” she said. Bloomberg cut in to respond, “I never said that.”", "When asked later by a moderator for evidence for the charge, Warren replied, “Her own words.” Bloomberg iterated again that he did not make the offending comments. “I never said it. Period. End of story. Categorically never said it,” he said. “When it was accused, when I was accused of doing it, we couldn’t figure out what she was talking about. But right now, I’m sorry if she heard what she thought she heard, or whatever happened.”", "We have no way of knowing who is right, but Warren’s description of the allegation is correct. A woman who sold terminals for Bloomberg’s company alleged, among other instances of harassment while working for his company, that Bloomberg told her, “Kill it!” twice after inquiring about her marriage and learning that she was pregnant.", "According to a complaint filed in 1997, Bloomberg added, “Great! Number 16!,” a reference the woman took to mean the number of pregnant women employed by the company. The saleswoman interpreted his comments to suggest that she should have an abortion; Bloomberg denied making the comments.", "The case was settled confidentially and without an admission of guilt in 2000, reportedly for a “six-figure sum.” The case is one of the three that the Bloomberg campaign said last week it would release from a nondisclosure agreement.", "In 2001, just before Bloomberg’s first campaign to be mayor of New York City, he denied the harassment and released a statement saying he had passed a polygraph test.", "In a statement given to the Daily News at the time, Bloomberg said that he settled the case “because the lawyers believed the suit could drag on for years and disrupt the company’s focus and that of our employees.” The woman’s lawyer told the New York Times that they settled “to avoid the distraction and expense of litigation.”", "In a Feb. 15 story, the Washington Post said that a former Bloomberg technology reporter witnessed Bloomberg’s comments to the woman. “I remember she had been telling some of her girlfriends that she was pregnant,” he said. “And Mike came out and I remember he said, ‘Are you going to kill it?’ And that stopped everything. And I couldn’t believe it.” The man had not previously come forward about the incident and was not involved in the lawsuit.", "Sanders said that both Buttigieg and Biden have received campaign contributions from 50 or more billionaires and that the American people “don’t want candidates to be running to billionaires for huge amounts of funding.”", "Buttigieg objected, arguing that what Sanders said may have given people the false impression that “most of my campaign is funded by billionaires.”", "Buttigieg may have a point.", "Sanders: I will tell you, Pete, what the American people want, and, Joe, what the American people want. They don’t want candidates to be running to billionaires for huge amounts of funding.", "Buttigieg: All right, let’s clear this up once and for all.", "Sanders: Pete has gotten funding from over 50 billionaires.", "Buttigieg: You’ve got people believing something that is false. This needs to be cleared up.", "Sanders: Joe, I think, has gotten a little bit more. …", "Buttigieg: I can’t allow — I can’t allow this to stand because it’s just not true. Sen. Sanders has got people believing something that is untrue about my campaign. The idea that most of my campaign is funded by billionaires.", "Sanders: I didn’t say that, Pete.", "Sanders appears to have been referring to the most recent data from an analysis by Forbes, which has been tracking contributions by billionaires and their spouses to the campaign committees of the Democratic presidential candidates.", "In a Feb. 18 update, Forbes said that in all of 2019, 56 billionaires or their spouses donated to Buttigieg’s campaign committee and 60 donated to Biden’s. To get those numbers, Forbes said it “mined Federal Election Commission data for donations from billionaires and their spouses, searching for all itemized donations of at least $100.”", "We don’t know the total amount of money donated to each candidate by those individuals because Forbes did not publish that information. But even if each person donated the $5,600 maximum an individual can contribute to a candidate’s campaign — $2,800 each for the primary and general election — that would mean that billionaires and their spouses contributed no more than 0.4% and 0.5% of the amounts that Forbes reported Buttigieg ($76.8 million) and Biden ($61 million) raised as of the end of December, respectively.", "Buttigieg himself later claimed that he had actually received more money from campaign donors from Charleston, South Carolina, than billionaires.", "“In Charleston alone … over 2,000 people have contributed to my campaign. That means the dollars that have come to my campaign, just from Charleston, is more than the dollars that have come from the 50 people that you mentioned,” Buttigieg said.", "A Buttigieg spokesman told us the campaign has received $277,000 from more than 2,300 donors from Charleston.", "Even if that figure is accurate, we can’t say whether it is more or less than what the campaign has received from billionaires, because we don’t know the actual amount billionaires or their spouses have donated to Buttigieg. The campaign did not provide that information before we published this article.", "Several candidates disagreed with Sanders over whether he had explained how he would pay for Medicare for All, his plan for a universal, government-run health care system, and other proposals. Sanders pointed to a study that said his health care plan would reduce total national health expenditures, but that depends on many unknown details. Other researchers have found it would increase total spending.", "Moderator Norah O’Donnell asked Sanders: “You’ve said Medicare for All for all will cost $30 trillion. But you can only explain how you’ll pay for just about half of that. Can you do the math for the rest of us?”", "Sanders interjected that it was a 10-year estimate and went on to talk about a recent study led by a Yale researcher that found Medicare for All would lower total national health spending — that’s all health care spending, by individuals, governments, employers and insurers. That study, published in the Lancet this month, was led by Alison Galvani, a professor of epidemiology and director of Yale’s Center for Infectious Disease Modeling and Analysis, who disclosed that she was an “informal unpaid adviser” to Sanders’ Senate office for his 2019 Medicare for All Act.", "The study estimated Medicare for All could reduce national health care spending by more than $450 billion a year. On his campaign website, Sanders estimates that, based on the Yale study and projections of current national health care spending, he would only need to increase government spending by $17.5 trillion over 10 years to cover the cost of his universal health care proposal. And he puts forth several tax measures to meet that cost.", "But other studies have come up with different estimates for Medicare for All, a proposal that lacks many details, leaving researchers to make various assumptions. Sanders was wrong to say that “every study out there, conservative or progressive, says Medicare for All will save money.”", "The Urban Institute estimated a plan like Sanders’ would increase national health spending by $720 billion in 2020. “Federal government spending would increase by $2.8 trillion in 2020, or $34.0 trillion over 10 years,” the October 2019 report said.", "Federal government spending would increase, because nearly all health spending would shift to the federal government.", "One reason the Yale and Urban Institute estimates are so far apart is the assumption on what the government would pay health care providers under Medicare for All. The plan itself doesn’t say. The Yale study assumed hospitals would be paid at Medicare rates, which are lower than private insurance payment rates, but the Urban Institute assumed the hospital rate would be 115% of Medicare rates in its “base case.”", "The think tank notes that “it may be politically challenging to bring all hospital payment rates down to the level assumed in the base case, given the much higher average commercial provider payment levels and the enormous variation in payment rates across hospitals and commercial payers.” It gave estimates for a different scenario, under which hospitals were paid 140% of Medicare rates, which would raise national health spending by $951 billion in 2020 (see Figure 3).", "When Sanders said that “your program,” referring to the other candidates, “would cost some $50 trillion over a 10-year period,” he was referring to the projected national health spending under current law. That would total $47 trillion over 10 years, from 2018 to 2027, according to the Centers for Medicare & Medicaid Services. Again, that’s for all payers, including governments, individuals, employers and insurers.", "Meanwhile, when Sen. Amy Klobuchar said all of Sanders’ proposals — including free public college, universal child care and pre-K, increased Social Security benefits, climate change measures and Medicare for All — would cost “nearly $60 trillion,” that math works out if the Urban Institute’s estimate of increased federal government spending for Medicare for All is used.", "After Biden took a jab at Steyer, a former hedge fund manager, for once investing in a private prison company, Steyer jabbed back at Biden for authoring a crime bill that Steyer said led to mass incarceration of black and Latino men.", "Steyer: You wrote the crime bill … that put hundreds of thousands of black and Latino men in prison. You did.", "Biden: Not true.", "Steyer is referring to the Violent Crime Control and Law Enforcement Act of 1994, which Biden, as chairman of the Senate Judiciary Committee, largely wrote and shepherded through the legislative process. The sweeping legislation provided funding for tens of thousands of community police officers and drug courts, banned certain assault weapons, and mandated life sentences for criminals convicted of a violent felony after two or more prior convictions, including drug crimes.", "As we wrote in 2016, critics often lay too much blame on the 1994 crime bill for the mass incarceration trend in the U.S. that has hit the black community particularly hard. In fact, the trend toward increased incarceration began in the early 1970s, and quadrupled in the ensuing four decades. A two-year study by the National Research Council concluded that the increase was historically unprecedented, that the U.S. far outpaced the incarceration rates elsewhere in the world, and that high incarceration rates disproportionately affected Hispanic and black communities. The report cited policies enacted by officials at all levels — local, state and federal — that expanded the use of incarceration, largely in response to decades of rising crime.", "“In the 1970s, the numbers of arrests and court caseloads increased, and prosecutors and judges became harsher in their charging and sentencing,” the report states. “In the 1980s, convicted defendants became more likely to serve prison time.”", "But that doesn’t mean the 1994 crime bill didn’t have any effect. Experts told us the law exacerbated the trend. For example, the bill included a federal “three-strikes” provision, which required mandatory life imprisonment without possibility of parole for those who commit federal violent felonies if they had two or more previous convictions for violent felonies or drug trafficking crimes.", "In a speech at an NAACP convention in Philadelphia in July 2015, Bill Clinton, who signed the bill into law as president, acknowledged that tougher incarceration provisions in the bill were a mistake. “I signed a bill that made the problem worse,” Clinton said. “And I want to admit it.” Although most people are in prison under state law, “the federal law set a trend,” Clinton said.", "The bill also included incentives for states to build prisons and increase sentences. States that adopted “truth-in-sentencing” laws requiring that people convicted of violent crimes serve at least 85% of their sentences were rewarded with federal dollars for prison construction.", "In his defense of the bill, Biden has pointed out that it was written in response to decades of rising violent crime, and was supported by a majority of Democrats in the Senate and House. As we have written, Biden opposed some of the measures in the bill that have been most closely tied to higher incarceration rates.", "He didn’t back the final legislation’s three-strikes provision, though Biden is on record at the time saying he supported a three-strikes provision for “serious [violent] felonies against a person.” But he was against including nonviolent offenses and expressed concern that minor crimes could get swept up in the measure. Biden also opposed mandatory minimum sentences in the bill, and he supported a lower level of federal funding for state prison construction ($6 billion) than the $10 billion that was in the final bill.", "Warren criticized Bloomberg for not releasing his income tax returns —  comparing him to President Donald Trump, who has never released his tax returns.", "“We know that Mayor Bloomberg has been doing business with China for a long time, and he is the only one on this stage who has not released his taxes,” Warren said. “He plans to release them after Super Tuesday. It is not enough to be able to say, just trust me on this. We have a president who said he was going to release his taxes after the election and has refused to do this.”", "Bloomberg promised he would release them, but blamed his late entry into the race for the delay.", "Bloomberg: I got into this race only 10 or 12 weeks ago. We have been working on our tax returns; I’ve said they will be out. We probably have another couple of weeks left to go. We’re doing it as fast as we can. We’ve complied with every single requirement for disclosure. And when I was mayor of New York, we had our tax returns out 12 years in a row and we will do that in the White House.", "But Bloomberg never released his full returns as mayor. The Wall Street Journal wrote in 2013, Bloomberg’s last year as mayor, that he provided reporters with only a brief glimpse of his redacted tax returns.", "Wall Street Journal, May 23, 2013: Unlike most New York politicians, the billionaire mayor for 12 years has refused to release his full tax returns, instead inviting the media each year to review — for a few hours only — his highly redacted filings. Reporters are prohibited from photocopying, scanning, photographing, videotaping or otherwise mechanically duplicating any of the information provided.", "The paper said the returns were also altered to avoid disclosing actual dollar amounts — providing only “a code letter representing ranges of dollar amounts” in place of income and other financial data.", "“For example, the mayor listed his adjusted gross income as ‘G,’ the highest category: $500,000 or more,” the Journal wrote. “The letter G appeared scores of times in the tax documents.”", "Stu Loeser, Bloomberg’s chief spokesman when he was mayor, told WNYC in May 2012 that disclosing too much information would compromise the strategic plans of the financial service company Bloomberg LP.", "Biden flubbed a talking point on gun homicides that he’s used before. When he gets it right, Biden says 150,000 people have been murdered with guns since 2007.", "Numbers from the Centers for Disease Control and Prevention tracking homicides by firearm between 2007 and 2018, the most recent year with available data, support his claim.", "Biden misspoke during the debate when he said that 150 million people have been killed since 2007, a campaign spokesman told us. But Biden’s claim needs further explanation.", "He cites that homicide statistic to criticize Sanders’ support of the 2005 Protection of Lawful Commerce in Arms Act, which kept gun sellers and manufacturers largely immune from civil suits over the misuse of their weapons.", "Here’s how Biden framed it at the debate, referring to the 2005 law: “That has caused carnage on our streets, 150 million people have been killed since 2007 when Bernie voted to exempt the gun manufacturers from liability.”", "One study from researchers at Johns Hopkins University in 2007 warned that the PLCAA would deprive the public of potentially safer guns since it lifted the incentive provided by the threat of lawsuits from the firearm manufacturing industry. But it didn’t suggest the PLCAA would cause “carnage” in the streets.", "Rather, the study concluded: “Because most lawsuits were dismissed by the PLCAA or the courts before they came to trial, we cannot know precisely how these lawsuits would have affected the firearm industry’s conduct or whether rates of firearm-related death and injury would ultimately have been reduced. But under the PLCAA, the lack of both regulation and litigation as public health tools for firearm injury prevention is a potentially dangerous combination for the public’s health.”", "It should also be noted that Sanders, who was criticized by Hillary Clinton in the 2016 Democratic presidential primary for voting in favor of the PLCAA, later cosponsored a failed effort to repeal the law.", "Sanders erred when he claimed that “billionaires in this country saw an $850 billion increase in their wealth” in the last three years.", "According to Forbes magazine, which publishes an annual listing of the world’s wealthiest people, the combined net worth of U.S. billionaires went from $2.40 trillion in 2016 to $3.11 trillion last year. That’s an increase of $710 billion, well below the figure Sanders used.", "CNN reported last night that a liberal think tank, the Institute for Policy Studies, took responsibility for giving Sanders the inaccurate figure, and said its “updated” figure was $710 billion.", "Sanders didn’t mention that the number of U.S. billionaires also increased during that period, from 542 in 2016 to 607 in 2019, according to Forbes. So while total billionaire wealth went up 29.6% during that time, the wealth of the average billionaire rose by about half as much, 15.7%.", "Sanders was deflecting a question about the U.S. unemployment rate, which at 3.5% in January is near the lowest in 50 years.", "“For the ordinary American, things are not so good [as for billionaires],” he said. “Last year, real wage increases for the average worker were less than 1%.”", "That’s true enough: Average weekly earnings of all private-sector workers barely rose at all in the 12 months ending in January, going up just less than 0.04% after adjusting for inflation, according to the Bureau of Labor Statistics.", "But over the last three years — the period he used for his billionaire figure — the increase in average real weekly earnings has been 2.7%. And that comes on top of a 4.1% rise during the Obama years.", "And if average billionaire wealth were also adjusted for inflation, using the BLS “CPI Inflation Calculator,” the three-year increase in net worth per billionaire comes out to 6.1%.", "So using accurate figures, and comparable time periods and inflation adjustments, the contrast between the net worth of billionaires and the real wages of average workers is far less dramatic than Sanders makes out.", "Bloomberg continued to be criticized about the controversial stop-and-frisk policy employed by New York City police during Bloomberg’s tenure as mayor. He offered his usual response, acknowledging that “we let it get out of control” but adding, “when I realized that, I cut it back by 95%.”", "As we wrote recently, Bloomberg gets to his figure of a 95% cut by comparing the quarterly high point of 203,500 stops in the first quarter of 2012 with the 12,495 stops in the last quarter of 2013 — a decline that would not have been possible without the numbers ballooning earlier in Bloomberg’s tenure.", "As Bloomberg often notes, stop-and frisk was put in place by his predecessor, Rudy Giuliani, but the practice multiplied exponentially under Bloomberg. In Bloomberg’s first 10 years in office, the number of stop-and-frisk actions increased nearly 600%, reaching a peak of nearly 686,000 stops in 2011. There were about 192,000 documented stops in 2013, nearly twice as many as there were the year before Bloomberg took office.", "Although Bloomberg says the turnaround in the policy came when he “realized” it had spiraled out of control, Bloomberg continued to defend stop-and-frisk throughout his term as mayor — and after — maintaining that the policy led to a decrease in crime, a justification he now acknowledges was wrong.", "A day before the police department in May 2012 announced new training and supervision designed to address concerns about racial profiling in the application of stop-and-frisk, a federal judge granted class-action status to a lawsuit brought by people who had been stopped.", "On Aug. 12, 2013, U.S. District Court Judge Shira A. Scheindlin ruled that the city police department violated the U.S. Constitution in the way that it carried out its stop-and-frisk program, calling it “a form of racial profiling” of young black and Hispanic men. In her opinion, Scheindlin wrote that she was “not ordering an end to the practice of stop and frisk” and that the practice could continue if the city complied with court-ordered remedies — including an independent monitor to oversee the program to make sure that it did not violate the Constitution.", "In an interview on MSNBC on Feb. 20, Scheindlin, now retired, attempted to set the record straight after Bloomberg made a similar claim about the 95% decline in the last Democratic debate.", "“Mayor Bloomberg said ‘When I realized it was bad towards the end, I ended it and it dropped 95%,’” Scheindlin said. “That is not accurate. In the last two years or so, it began to drop dramatically, it dropped 67%, not 95%.” (Scheindlin is citing the yearly decline, as opposed to the quarterly decline.) “But it wasn’t because he realized—had an epiphany that it was wrong; it was because of the court rulings,” she said. “That’s what happened. I ruled.”", "The stop-and-frisk policy also faced mounting public opposition. And Bloomberg faced efforts by the City Council to rein in the program, which Bloomberg opposed. It wasn’t until days before announcing his candidacy for president in November that Bloomberg said that he “should have acted sooner, and acted faster to cut the stops,” and he apologized for not doing that.", "Warren again attacked Bloomberg for “blaming the housing crash of 2008 on African Americans and on Latinos.” But Bloomberg didn’t do that, as we reported Feb. 20 after Warren first made the claim during the previous Democratic debate in Las Vegas.", "Then as now, Warren was referring to remarks Bloomberg made at Georgetown University in Washington, D.C., on Sept. 17, 2008 — at the height of the worst financial crisis since the Great Depression.", "He never mentioned African Americans or Latinos in his 6-minute recitation of the “root causes” of the crisis. He started with a mention of Congress and state and local officials pushing to end the old practice of “redlining” — which he described as banks avoiding making loans in “poor” neighborhoods.", "“And once you started pushing in that direction, banks started making more and more loans where the credit of the person buying the house wasn’t as good as you would like,” Bloomberg said. He also said the Federal Reserve’s policies led to “very cheap money” and that Wall Street firms — seeking new ways to profit — packaged loans in ways that were so complex that even they didn’t grasp the risks. “Wall Street got into the position where they created so many sophisticated products, my theory is that most people couldn’t understand them,” he said.", "Redlining hurt African Americans and other minority groups, to be sure, but Bloomberg didn’t endorse the practice in his 2008 remarks. He just said the dominoes started to fall when Congress pushed lenders to make loans to “everyone.”", "Cooper, Anderson. “Bernie Sanders on being the Democratic front-runner and taking on Donald Trump.” CBS News. 23 Feb 2020.", "White House. “Remarks by President Obama in Young Leaders of the Americas Initiative Town Hall.” 23 Mar 2016.", "Saunders, Laura and Michael Howard Saul. “A Final (Redacted) Peek at Mayor’s Taxes.” Wall Street Journal. 23 May 2013.", "Hennelly, Bob. “Another Year, Another Disclosure of Bloomberg’s Taxes.” WNYC. 25 May 2012.", "Bumiller, Elisabeth. “Bloomberg Cites Polygraph In a Denial of Harassment.” New York Times. 28 Mar 2001.", "Jaffe, Alexandra and Kathleen Ronayne. “Bloomberg : 3 women can be released on non-disclosure deals.” Associated Press. 22 Feb 2020.", "Kranish, Michael. “Mike Bloomberg for years has battled women’s allegations of profane, sexist comments.” Washington Post. 15 Feb 2020.", "Tindera, Michela. “Here Are The Billionaires Funding The Democratic Presidential Candidates.” Forbes.com. 18 Feb 2020.", "Federal Election Commission. “Contribution limits for 2019-2020 federal elections.” Fec.gov. Accessed 25 Feb 2020.", "Congress.gov. S.397 – Protection of Lawful Commerce in Arms Act. Accessed 25 Feb 2020.", "Centers for Disease Control and Prevention. Homicide by firearm, 2007-2018. Accessed 25 Feb 2020.", "Vernick, Jon, et al. “Availability of Litigation as a Public Health Tool for Firearm Injury Prevention: Comparison of Guns, Vaccines, and Motor Vehicles.” American Journal of Public Health. Nov 2007.", "Farley, Robert. “Bloomberg Misleads on Stop-And-Frisk.” FactCheck.org. 14 Feb 2020.", "NYCLU. “New York City Police Department Stop Question & Frisk Activity Reports prepared during the period January 1, 2012 through March 31, 2012.”", "NYCLU. “New York City Police Department Stop Question & Frisk Activity Reports prepared during the period October 1, 2013 through December 31, 2013.”", "Kopan, Tal. “Feds back monitor in New York stop-and-frisk case.” Politico. 13 Jun 2013.", "United States District Court Southern District of New York. David Floyd, et al, v. City of New York, et al. Statement of Interest of the United States. 12 Jun 2013.", "CBS/AP. “NYPD alters stop-and-frisk policy amid outcry.” 17 May 2012.", "Goodman, J. David. “Council Reverses Bloomberg Veto of Policing Bills.” New York Times. 22 Aug 2013.", "YouTube.com. “Full Speech: Bloomberg Apologizes for ‘Stop and Frisk’ Police Practice.” NBC New York. 17 Nov 2019.", "Marinucci, Carla. “Old investment by Steyer becomes an issue as he eyes public office.” Politico. 24 Oct 2016.", "Congress.gov. H.R.3355 – Violent Crime Control and Law Enforcement Act of 1994. Accessed 26 Feb 2020.", "Farley, Robert. “Bill Clinton and the 1994 Crime Bill.” FactCheck.org. 12 Apr 2016.", "National Research Council. “The Growth of Incarceration in the United States.” Jun 2016.", "Merica, Dan. “Bill Clinton says he made mass incarceration issue worse.” CNN. 15 Jul 2015.", "Ditton, Paula M. and Wilson, Doris James. “Truth in Sentencing in State Prisons.” Bureau of Justice Statistics. Jan 1999.", "Robertson, Lori. “Biden on the 1994 Crime Bill.” FactCheck.org. 12 Jul 2019.", "Kroll, Luisa and Kerry A. Dolan. Interactive map in “Billionaires: The Richest People in the World.” Forbes. 5 Mar 2019.", "Hays, Mike and Veronica Rocha “Democratic debate in South Carolina” 25 Feb 2020.", "Bureau of Labor Statistics. “Employment, Hours, and Earnings from the Current Employment Statistics survey (National); Average Weekly Earnings of All Employees, 1982-1984 Dollars.” Data extracted 25 Feb 2020.", "C-SPAN. “Urban Economics.” Video of interview with Michael Bloomberg. 17 Sep 2008.", "Galvani, Alison et al. “Improving the prognosis of health care in the USA.” The Lancet. Vol. 395, Issue 10223.15 Feb 2020.", "Blumberg, Linda J. et al. “From Incremental to Comprehensive Health Insurance Reform: How Various\nReform Options Compare on Coverage and Costs.” Urban Institute. Oct 2019.", "Sanders, Bernie. “How Does Bernie Pay for His Major Plans?” berniesanders.com. accessed 26 Feb 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]