["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "House Speaker John Boehner, R-Ohio, speaks during a news conference in Washington on Sept. 12, 2013.", "In a recent press conference, House Speaker John Boehner, R-Ohio, took time out from discussing the crisis in Syria to remind Americans about shortcomings in the job market.", "\"Last week yet another report showing our economy continues to struggle -- this new normal of slow growth, high unemployment, and stagnant wages,\" Boehner said on Sept. 12, 2013. \"We've got more Americans leaving the workforce than we have finding jobs.\"", "We wondered if Boehner was correct that there are \"more Americans leaving the workforce than we have finding jobs.\"", "Boehner is expressing a commonly shared concern. Most economists express worry about an ongoing decline in \"labor-force participation\" -- the percentage of Americans 16 or older who are working, or who are actively looking for a job. The percentage for August 2013 was the lowest it’s been since August 1978, and if fewer people are working, that’s a drag on the nation’s potential for rapid economic growth.", "But as we will see, determining how much of this decline in labor-force participation is due to the poor economy, as opposed to broader demographic trends, is tricky.", "When we asked Boehner’s office for the source of this statistic, a spokesman pointed us to news reports about the most recent employment report from the Bureau of Labor Statistics.", "The bureau found that between July 2013 and August 2013, the economy created a net 169,000 additional jobs, while the size of the civilian labor force dropped by 312,000. (The civilian labor force refers to working-age people who are either employed or were unemployed but looking for work.) That supports Boehner’s comment that more Americans are leaving the workforce finding jobs.", "But economists say the statistic Boehner chose to illustrate the broader trend isn’t ideal.", "For starters, it combines numbers from two different surveys that don’t really produce apples-to-apples comparisons. And there are two more worrisome issues:", "• One-month comparisons are less reliable than longer-term comparisons. There’s a lot of statistical \"noise\" from month to month in this type of data -- \"noise\" that tends to balance out over a longer period of time.", "This is important because, while Boehner was correct about the most recent jobs report, the trends in the most recent month actually run counter to what’s been happening over the longer term.", "Since the start of the year, the civilian labor force has fallen by 168,000 people, but the number of people employed has risen by 848,000. And over the past year -- from August 2012 to August 2013 -- the civilian labor force has risen by 839,000 people, while the number of people employed has risen by a little more than 2 million. (The numbers are only slightly different if you take into account an annual adjustment for population growth that occurs in January.)", "Either way, the gain in employment was bigger than the gain (or loss) in people in the labor force. So by choosing to focus on the most recent month, Boehner is essentially cherry-picking the one period for which the trends don’t look very favorable.", "• Using the full labor force to gauge how many people are \"leaving the workforce\" isn’t perfect. Americans are aging -- the leading edge of the baby boomers is turning 67, so every month, large numbers of Americans are retiring. In addition, the statistic Boehner used captures Americans as young as age 16, and many Americans between that age and their early 20s aren’t part of the labor market because they are going to school.", "How much does this skew the numbers? It’s hard to say for sure, but in August 2013, just under 7 percent of those categorized as \"not in the labor force\" were also categorized as \"want a job now.\" The bulk of the remaining 93 percent are likely school- and retirement-age Americans. So many of the non-workers Boehner’s referring to aren’t people actively engaged in the job market.", "We can make a more targeted estimate by focusing on those who \"want a job now.\" This particular statistic is not offered in a seasonally adjusted version, so we can’t compare one month to the next. The only valid comparison we can do is between August 2012 and August 2013.", "What does that show? It turns out that the number of people not in the labor force but who wanted a job fell by 740,000 over that year-long period, while the number of people employed over the same period rose by more than 2.2 million.", "So, looking at it this way, Boehner’s claim misses the longer-term trend.", "Our ruling", "Boehner said that, according to the most recent jobs report, \"we've got more Americans leaving the workforce than we have finding jobs.\"", "That is what the most recent one-month jobs report found. However, there’s less to this piece of data than meets the eye. Looking at the year-to-date and year-to-year figures show the opposite pattern, and Boehner’s calculation doesn’t account for the large numbers of baby boomers who are retiring because they no longer want to work.", "In all, Boehner has stated one fact correctly -- and put his finger on an issue of concern to economists -- but he’s ignored other pieces of that give a more nuanced impression. We rate his claim Half True.", "John Boehner, transcript of weekly press conference, Sept. 12, 2013 (CQ subscribers only)", "Bureau of Labor Statistics, search form for Table A-1: Employment status of the civilian population by sex and age, accessed Sept. 13, 2013", "Bureau of Labor Statistics, search form for Table A-16. Persons not in the labor force and multiple jobholders by sex, not seasonally adjusted, accessed Sept. 13, 2013", "Bureau of Labor Statistics, search form for \"Labor Force Statistics from the Current Population Survey,\" accessed Sept. 13, 2013", "Bureau of Labor Statistics, search form for \"Employment, Hours, and Earnings from the Current Employment Statistics survey (National),\" accessed Sept. 13, 2013", "Bureau of Labor Statistics, \"Employment, Hours, and Earnings from the Current Employment Statistics survey (National): 1-Month Net Change,\" accessed Sept. 13, 2013", "Bureau of Labor Statistics, glossary, accessed Sept. 13, 2013", "Email interview with Tara Sinclair, economist at George Washington University, Sept 13, 2013", "Email interview with Gary Burtless, senior fellow with the Brookings Institution, Sept. 13, 2013", "Email interview with Gary Steinberg, spokesman for the Bureau of Labor Statistics, Sept. 13, 2013", "Email interview with Brendan Buck, spokesman for John Boehner, Sept. 13, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]