["By Angelo Fichera", "Posted on June 4, 2020", "Across social media, posts falsely claim to show a picture of the White House in the dark — purportedly “for the first time” in history — as protesters marched outside on May 31. But the image is actually from 2014 and was edited to appear darker.", "As protesters against police brutality demonstrated in Washington, D.C., late into the night on May 31, the lights outside the White House went dark.", "Soon after, a photo purportedly depicting the scene went viral — showing all the interior and nearly all the exterior lights off. The image was eventually shared on Twitter by former Secretary of State Hillary Clinton, earning nearly 45,000 retweets and 179,000 likes. A tweet of the image from an “Anonymous” account garnered 176,000 likes.", "But the widely spread photo was actually taken several years ago. The Associated Press first reported the photo was old and, using a reverse image search, we found the same photo on the stock photo website Alamy dated 2014.", "A close comparison of the 2014 image and the version currently circulating shows distinct marks that appear on both, including a white mark near a bush (center left) and a light’s reflection on a vehicle (to the right of the White House).", "The version of the image shared recently on social media, however, was also edited to make the image even darker, with the portico lights and an interior light darkened.", "The manipulated image took off: a meme on Facebook shared tens of thousands of times used it — alongside an actual picture from the May 31 rally — claiming that for “the first time in the history, the lights of the White House went off and The President was taken to the Bunker.”", "Regarding the bunker, multiple news outlets reported that President Donald Trump was taken to the underground bunker amid protests May 29 — two days earlier. Trump was asked about those reports in a June 3 radio interview and said he was taken to the bunker “during the day” for “an inspection,” and that “there was no problem” with protesters during the day.", "There are images showing the exterior lights off at the White House on May 31 amid the protests. An image shared on Twitter by CBS News White House correspondent Mark Knoller shows what he described as the “[e]xterior lights at WH turned off just before 11pm.”", "Amid the claims about the White House going dark, a CNN reporter wrote on Twitter that the exterior lights are actually turned off every night around that time. “As someone who has done many late night live shots, the lights at the White House go off every night around 11 p.m.,” Kaitlan Collins wrote.", "That’s also what White House spokesperson Hogan Gidley said. Gidley told Newsweek that “[t]he White House lights go out at about 11 p.m. almost every night” and that the lights being turned off was “nothing new.”", "It’s unclear if any additional lights were turned off during the protest on May 31 that would otherwise typically remain on. We asked the White House about that and for more information on the lighting operations, but didn’t hear back.", "We do know, however, that the image of the White House in near complete darkness that was shared across social media was not taken during the protest on May 31 — or even during the Trump administration, for that matter.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Collins, Kaitlan (@kaitlancollins). “As someone who has done many late night live shots, the lights at the White House go off every night around 11 p.m.” Twitter. 1 Jun 2020.", "Da Silva, Chantal. “White House Says Lights Go Out Same Time ‘Almost Every Night’ After Facing Criticism for Going Dark Amid Protests.” Newsweek. 1 Jun 2020.", "Knoller, Mark (@markknoller). “Exterior lights at WH turned off just before 11pm as protests continued in vicinity.” Twitter. 31 May 2020.", "“President Trump on the Brian Kilmeade Show.” Brian Kilmeade Show. Fox News Radio. 3 Jun 2020.", "Runck, Robin. “White house in Washington at night – Image ID: F6TDXJ.” Alamy Stock Photo. 9 Jul 2014.", "“Tear gas and fires outside White House.” Reuters. 1 Jun 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]