["By Robert Farley", "Posted on July 23, 2020", "Experts say there is no evidence that Black Lives Matter protests or Mexicans have caused the spike in coronavirus cases in pockets of the U.S., contradicting President Donald Trump’s assertions.", "In a press briefing on July 21, Trump acknowledged cases were rising in some parts of the country and, “It will probably, unfortunately, get worse before it gets better.” In another press briefing the following day, Trump noted that cases are rising in parts of the South and Southwest and the West. Trump offered this assessment of the reasons why:", "Trump, July 22: There are likely a number of causes for the spike in infections. Cases started to rise among young Americans shortly after demonstrations — which you know very well about — which presumably triggered a broader relaxation of mitigation efforts nationwide. And a substantial increase in travel also was a cause.", "Increased gathering on holidays, such as Memorial Day, as well as young people closely congregating at bars and probably other places — maybe beaches — four or five different listed places; we have 12 that are listed on the guide — likely also contributed.", "We’re also sharing a 2,000-mile border with Mexico, as we know very well, and cases are surging in Mexico, unfortunately. I was with the president, and it’s a big problem for Mexico. But cases are surging very sharply and all across the rest of the Western Hemisphere.", "Despite Trump mentioning the protests that followed the death of George Floyd and cases rising in Mexico, experts told us there is no evidence either of those is responsible for the spike in cases around the country. Rather, they said, it is a result of some states reopening too quickly or aggressively, without proper measures in place to test, trace and isolate cases, and people generally socializing in ways that epidemiologists had warned would result in the spread of the virus.", "Many epidemiologists feared that the protests in honor of Floyd — a Black man who died after a white police officer kneeled on his neck during an arrest in Minneapolis on May 25  — would trigger a jump in coronavirus cases.", "Dr. Amesh Adalja, an infectious disease physician and senior scholar at the Johns Hopkins University Center for Health Security, told us in a phone interview that he was concerned about large groups of protesters in close quarters screaming and chanting, and in some cases hit with tear gas that would make them cough — things that can contribute to virus spread. But the feared spike in infections never panned out, he said.", "“There has been no evidence that protests led to a significant increase in infections,” Adalja said.", "While there have been some cases that have emerged among law enforcement in particular, he said, “It hasn’t been very big.” Any increase, he said, “has been minimal, at best.”", "“It really hasn’t had a significant impact on the increases we’re seeing in certain states,” he said.", "Harvard epidemiologist Marc Lipsitch concurs.", "“To my knowledge there is no evidence that the spike in cases can be attributed to protests,” Lipsitch told us via email. “While I and other epidemiologists have noted the likelihood that some transmissions would likely occur at protests, my understanding is that when testing facilities were opened for those who had been at large gatherings, positivity was very low or even zero among those who came — probably because the protests were outdoors and largely masked.”", "In a June working paper for the National Bureau of Economic Research, economists concluded there was “no evidence that urban protests reignited COVID-19 case growth during the more than three weeks following protest onset.” The paper, which is not peer-reviewed, further concluded “predictions of broad negative public health consequences of Black Lives Matter protests were far too narrowly conceived.”", "The researchers said their analysis of 315 U.S. cities provided “strong evidence” that as a result of protests, non-protesters generally stayed home more, resulting in a net benefit with regard to spread of the coronavirus.", "“Event-study analyses provide strong evidence that net stay-at-home behavior increased following protest onset, consistent with the hypothesis that non-protesters’ behavior was substantially affected by urban protests,” the authors wrote. “This effect was not fully explained by the imposition of city curfews. Estimated effects were generally larger for persistent protests and those accompanied by media reports of violence.”", "Jesse Goodman, a professor of medicine and an infectious disease specialist at Georgetown University Medical Center, told us via email he was “not aware of evidence that outdoors protests have fueled COVID outbreaks to a significant degree.”", "Nor did the experts we contacted believe there is any validity to Trump’s assertion that Mexico has contributed to the rise of cases in the U.S.", "“The role of Mexican migrants is utterly without foundation, and surely can’t explain upsurges in the Southeast, Northern California, and many other parts of the country,” Lipsitch told us.", "On March 21, Mexico and the U.S. jointly restricted nonessential land travel between the two countries to prevent spread of the coronavirus. Nonessential travel includes travel that is considered tourism or recreation. At least one Mexican state completely closed its border with the U.S. ahead of the July 4 holiday, fearing spread of the virus from the U.S. into Mexico.", "Statistics from U.S. Customs and Border Protection show that apprehensions of people crossing the Mexican border illegally into the U.S. have been relatively low in the first half of 2020 compared with 2019.", "Trump suggested that a rise in coronavirus cases in the Southwest may be due, in part, to the U.S. sharing a 2,000-mile border with Mexico — where he said cases are “surging.” But Adalja said that is likely “mere coincidence,” considering that states like Florida, Delaware and some in the Midwest are not border states, and yet have also seen spikes in coronavirus infections.", "“I don’t think there’s any evidence that Mexico has anything to do with case increases and hospitalization increases in those areas [along the border],” Adalja said. “There’s no evidence of that.”", "“It is possible that some infected people may cross borders, but that could probably work in both directions,” Goodman told us. “Again, I’m not aware it is a significant contributor to the U.S. upswing which has generally correlated with relaxation of social distancing.”", "Several of the things mentioned by Trump were contributors to the spike in coronavirus cases around the country, experts said, such as people ignoring social distancing recommendations and gathering in bars, and people traveling more for vacation.", "The main reason for the spike is fairly obvious, Adalja told us.", "“The virus never went anywhere,” he said. When the stay-at-home orders were lifted, it was inevitable that there would be spread.", "People began to interact. They went to bars. They gathered at events, often not wearing masks.", "The increase was predictable, he said, especially since some states had not prepared the necessary infrastructure to do proper testing, tracing and isolation to control outbreaks.", "“What has consistently been clear is that the most stringent control measures have been in the Northeast and these have been the states with the best control over case and death numbers; government policies and individual decisions about reopening and not masking are clearly the main causes of upsurges in the U.S.,” Lipsitch said.", "Not mentioned by Trump is the belief among many scientists — including some on the president’s own task force — that some states opened too quickly and aggressively.", "“Yeah, then there are some times when despite the guidelines and the recommendations to open up carefully and prudently, some states skipped over those and just opened up too quickly,” Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said in a FiveThirtyEight podcast on July 9.", "Fauci also attributed the spike to a general attitude among some U.S. residents, “You know, well, I’m either going to be locked down or I’m going to let it all rip.”", "In a press gaggle on July 22, White House counselor Kellyanne Conway said “some of these states blew through our gated criteria, blew through our phases, and they opened up some of the industries a little too quickly, like bars.”", "Conway then engaged in revisionist history when she added, “So remember, the governors wanted complete latitude over when they would open their states. They pushed back heavily, handsomely, Republicans and Democrats, when it was falsely rumored that the president was going to be in charge of opening the states. He’s a federalist. He believes in states’ rights.”", "In fact, Trump was a strong cheerleader for reopening, and repeatedly — and wrongly — claimed that he, not governors, had the ultimate authority to open up states.", "In April, Trump admonished Georgia Gov. Brian Kemp for opening “too soon.” But he also chastised states with Democratic governors who he thought were being too strict, calling via Twitter to “LIBERATE” Minnesota, Michigan and Virginia.", "He has also praised the reopening efforts by some Republican governors, like Florida Gov. Ron DeSantis, who he said has done a “fantastic job” responding to the coronavirus, even as Fauci singled out Florida for “jump[ing] over a couple of checkpoints” and opening too quickly. On July 23, Florida broke its record for the highest single-day death toll.", "The U.S. has now had 4 million people test positive for COVID-19 – including 1 million in the last 15 days, as the COVID Tracking Project data shows. For the second straight day, the U.S. recorded more than 1,100 daily deaths, on July 22 and 23, and now has had more than 143,000 total deaths.", "Epidemiologists say there are a number of reasons for the recent spike in cases around the country, but there is no evidence that Black Lives Matter protests and a surge of cases in Mexico have been major contributors.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]