["President Donald Trump lashed out at CNN New Day anchor Chris Cuomo for failing to get tough with Sen. Richard Blumenthal, D- Conn. Cuomo had interviewed Blumenthal after the senator made headlines by saying that Supreme Court nominee Neil Gorsuch had told him he was \"disheartened\" by the president’s dismissive comments about federal judges.", "Blumenthal drew Trump’s wrath first. The president tweeted, \"Sen.Richard Blumenthal, who never fought in Vietnam when he said for years he had (major lie),now misrepresents what Judge Gorsuch told him?\"", "Cuomo’s turn came next. After he spoke with Blumenthal, Trump tweeted on Feb. 9, 2017, \"Chris Cuomo, in his interview with Sen. Blumenthal, never asked him about his long-term lie about his brave \"service\" in Vietnam. FAKE NEWS!\"", "Chris Cuomo, in his interview with Sen. Blumenthal, never asked him about his long-term lie about his brave \"service\" in Vietnam. FAKE NEWS!", "Actually, Cuomo did ask about that.", "CNN posted Cuomo’s interview with Blumenthal. Cuomo’s first question was: \"What is your response to the president of the United States saying you should not be believed because you misrepresented your military record in the past?\"", "Blumenthal didn’t answer the question. Instead, he repeated his account of what Gorsuch said to him. The interview moved on to details about the Gorsuch nomination.", "After Trump took his shot at Cuomo, the CNN anchor defended himself on air.", "\"The president, with all due respect, is once again off on the facts,\" Cuomo said. \"He just said, ‘You never asked him about it.’ I did. He ducked it, and that’s okay. Politicians duck things all the time.\"", "\"The President ... is once again off on the facts\": @ChrisCuomo's response to @realDonaldTrump's tweet about him https://t.co/ckWo75HT8L", "We reached out to the White House for comment and did not hear back. If they do respond, we will update this fact-check.", "Vietnam legacy", "Both Blumenthal and Trump avoided serving in Vietnam, but while Trump never claimed to have been there, Blumenthal did.", "In 2010, the New York Times reported that at a 2008 ceremony for veterans and senior citizens, Blumenthal said, \"We have learned something important since the days that I served in Vietnam.\"  In 2003, Blumenthal spoke at a rally supporting troops overseas. \"When we returned, we saw nothing like this,\" he said, a comparison with soldiers who came back from Vietnam.", "Blumenthal told the New York Times he had \"misspoken\" about his Vietnam record. In reality, between 1965 and 1970, he received at least five deferments for military service. In 1970, he obtained a slot in the Marine Reserves and was stationed in America.", "As we’ve reported before, Trump benefited from four student deferments in college and one medical deferment (Trump later said that was for bone spurs in his heels), before being classified 4-F, unfit to serve. Trump played baseball, tennis and squash during his college years. He once said attending a private military-style boarding school gave him \"more training militarily than a lot of the guys that go into the military.\"", "Our ruling", "Trump said Cuomo failed to ask Blumenthal about his \"long-term lie\" about his service in Vietnam. The video record shows that Cuomo asked Blumenthal to respond to the charge that he lacked credibility after misrepresenting his military record.", "Cuomo might not have mentioned Vietnam, but he certainly brought Blumenthal’s past distortions into the conversation. Cuomo could have pressed Blumenthal with follow-up questions, which he failed to do. But he did ask.", "We rate this claim False.", "Donald Trump, tweet, Feb. 9, 2017", "CNN, Sen. Richard Blumenthal responds to Trump’s attack, Feb. 9, 2017", "CNN, Cuomo responds to Trump’s tweet, Feb. 9. 2017", "CNN Communications, tweet, Feb. 9, 2017", "New York Times, Candidate’s Words on Vietnam Service Differ From History, May 17, 2010", "PolitiFact, Was Trump a 'draft dodger'?, July 21, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]