["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In late July 2020, Snopes readers inquired about viral photographs that showed a couple shopping at a Walmart store while wearing face masks emblazoned with swastikas, the symbol of Nazi Germany. Readers stated that the pictures \"seemed like a hoax\" and inquired as to whether they were real.", "The pictures are real. They depict an incident that took place on July 25, 2020, in Marshall, Minnesota, in which a couple went to a Walmart store wearing swastika masks over their faces and made obscene gestures at fellow shoppers. A bystander recorded a video of the incident and posted it on social media, where it has since gone viral.", "The below tweet from a Minnesota Reformer reporter contains the video, but we caution it contains offensive imagery, gestures, and language:", "Marshall Police Sgt. Jason Buysse told TV station KARE that police responded to reports that the couple were causing a disturbance. Police issued them a notice of trespass, Buysse told the station. We left a phone message for Buysse but didn't hear back in time for publication.", "A spokeswoman for Walmart told us by email that the couple were banned from all Walmart stores for one year as a result of their actions.", "When bystanders confronted the couple in the video, the woman in the swastika mask stated, \"If you vote for Biden you're gonna be in Nazi Germany, that's what it's gonna be like,\" in reference to presumptive 2020 Democratic presidential nominee Joe Biden.", "This was not the first time law enforcement have been called to respond to reports of shoppers donning white supremacist symbols in 2020. Two separate incidents in Santee, California, reportedly saw grocery store customers brandishing a swastika and a Ku Klux Klan hood.", "Amid the COVID-19 pandemic, some Americans have resisted requirements from various levels of government that people wear masks to slow the spread of the disease, likening those orders to a loss of freedom under fascism. As of July 24, 2020, all Minnesotans must wear masks while visiting indoor businesses or indoor public spaces, unless they are alone. Multiple states have similar requirements on masks in place, and the Centers for Disease Control and Prevention has called on Americans to wear masks to help stop the spread of the virus.", "Cashman, Tyler.   \"Swastika-Wearing Pair Cited for Disturbance at Marshall Walmart.\"\r\n    KARE-11.   25 July 2020.", "Nesterak, Max.   \"Couple Wears Nazi Flags Inside Walmart to Protest Face Mask Mandate.\"\r\n    Minnesota Reformer.   25 July 2020.", "Jokich, Alex.   \"What to Know About Minnesota's Mask Mandate.\"\r\n    KSTP.   24 July 2020.", "Bunch, Will. \"America Is Drunk on a Warped Idea of Freedom, and Now It’s Killing People: Will Bunch.\"\r\n    Philadelphia Inquirer.   28 June 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]