["The image was published here on Facebook on April 21, 2020. It has been shared more than 4,800 times.", "Below is a screenshot of the misleading post:", "The Sinhala-language text superimposed on the image translates to English as: “Good manners of the people of Kantale / Let's make it an example to follow / The whole country love you all”", "Kantale is a small town located in the Trincomalee district of eastern Sri Lanka.", "The post's caption reads: “A gesture that must be truly appreciated”.", "The image was also shared here, here and here on Facebook alongside a similar claim.", "The claim is false; the photo has circulated in reports about a market in Myanmar.", "A reverse image search on Google found the same photo published here on the Facebook page “Pro Asia” on April 21, 2020.", "Its caption reads: “A unique idea from Myanmar.”", "Below is a screenshot comparison of the photo in the misleading post (L) and the photo in the Pro Asia post (R) :", "A further keyword search also found this tweet published on April 19, 2020 by Thaung Tun, the head of the Myanmar government’s Ministry of Investment and Foreign Economic Relations, which includes similar photos of the same market. The tweet states: \"Social distancing in practice! Hats off to Kalaw authorities and people.??.\"", "Social distancing in practice! Hats off to Kalaw authorities and people.?? pic.twitter.com/SpHv1iL3nA", "Kalaw is a town in the Shan state of Myanmar.", "The images in Tun’s tweet show similar multicoloured parasols to the image in the misleading post.", "Below is a screenshot comparison of the image in the misleading post (L) and the photo of Tun’s tweet (R), with the parasol circled in red by AFP:", "The location seen in the photo in the misleading posts generally corresponds with this Google Street View imagery of Kalaw Myoma Market.", "Similar photos of the market were also published in this April 20, 2020 tweet by the Philippine news channel ABS-CBN and this report by the Thailand-based newspaper The Nation on April 21, 2020, about social distancing in Myanmar.", "LOOK: Vendors and buyers practice physical distancing in a public market in Myanmar.\n\n\t\tAs of April 20, 2020, Myanmar has 111 confirmed cases of #COVID19, with 7 recoveries and 5 deaths.\n\n\t\t?Jain Weraphong | via @goldiesaurin pic.twitter.com/HVVC5PKvHM", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]