["The hoax report was published here.", "Below is a screenshot of the misleading report:", "The headline states: “QUADEN BAYLES' the BuIIied KlD REC0RDED HlS SUlClDE. HE KILLED HlMSELF after after Bullying Worsens at School- BBC NEWS”", "The purported BBC news breaking news banner reads: “BULLIED AUSTRALIAN BOY QUADEN BAYLES 9-YEAR-OLD QUADEN BAYLES FOUND DEAD INSIDE HIS ROOM.”", "Quaden Bayles is an Australian boy with dwarfism. The nine-year-old received global media attention in late February 2020 after his mum recorded a now-viral video of him in which he complains about being bullied at school. Bayles’ family received an outpouring of support and donations from around the world, as reported here by AFP.", "The link was published in this Facebook post on February 29 with the hashtag #PleaseShareToStopBullying.", "Other users shared the same link in Facebook posts here, here, here and here, with a similar claim.", "The claim is false; Bayles has not died and a BBC spokesperson told AFP that the report is a hoax.", "A BBC spokesperson told AFP via email on March 2, 2020: “We are aware of a fake video with BBC News branding circulating, incorrectly reporting the death of Quaden Bayles. When the BBC brand is infringed we will take appropriate action.  We urge people to check the veracity of stories on the BBC News website.”", "When users click the video in the hoax report, they can view part of a video taken from this 2014 CBS News report about an unrelated death of a nine-year-old boy in New York.", "Below is a screenshot of the video in the hoax report:", "Viewers can only watch a portion of the report before receiving an “Uncover Video” prompt, which asks them to share the link on Facebook. The prompt has the hallmarks of a phishing scam.", "Below is a screenshot of the video before the prompt appears:", "Since the hoax report was circulated, Quaden, his mother Yarraka and sister Guyala, were interviewed here in a March 4, 2020 episode of Australian television programme The Point. They spoke about the global attention Quaden had received, and the misinformation surrounding his age and his death.", "“That just goes to show how stupid people are,” Yarraka told the program. “They obviously haven’t done their homework. A simple Google [search] would save a lot of drama.”", "Yarraka's quote, in part, appears at 1:15:00 in the below video:", "A video of Bayles’ interview was also published here on the SBS News Facebook page on March 4, 2020.", "The hoax is similar in nature to one that falsely claimed the widow of the late basketball star Kobe Bryant had committed suicide, as reported here by AFP Fact Check.", "Bayles has also been subject of a false conspiracy theory surrounding his age, which AFP Fact Check debunked here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]