["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump boards Air Force One in Morristown, N.J., July 22, 2018, en route to Washington after staying at Trump National Golf Club in Bedminster, N.J. (AP Photo/Carolyn Kaster)", "President Donald Trump claimed newly released documents underlying the FBI’s surveillance of a former campaign adviser show the controversial Steele dossier was responsible for triggering the investigation into links between the Trump campaign and Russia.", "On July 21, in response to a Freedom of Information Act request, the Justice Department released the warrant application used to obtain a wiretap on former Trump campaign adviser Carter Page starting in October 2016, a month after he parted ways with Trump’s team. Intelligence officials feared Page was a potential Russian agent, or the target of Moscow's recruiting efforts.", "On Twitter, Trump claimed the surveillance application proves the Steele dossier launched the Russia probe.", "\"So we now find out that it was indeed the unverified and Fake Dirty Dossier, that was paid for by Crooked Hillary Clinton and the DNC, that was knowingly & falsely submitted to FISA and which was responsible for starting the totally conflicted and discredited Mueller Witch Hunt!\" Trump tweeted July 23.", "So we now find out that it was indeed the unverified and Fake Dirty Dossier, that was paid for by Crooked Hillary Clinton and the DNC, that was knowingly & falsely submitted to FISA and which was responsible for starting the totally conflicted and discredited Mueller Witch Hunt!", "Put simply, Trump is wrong about the triggering event. The Steele dossier did not launch the FBI’s investigation into links between the Trump campaign and Russia.", "The dossier was used, to some extent, to persuade a Foreign Intelligence Surveillance Act court to authorize surveillance of Page. But it was the actions of another Trump campaign adviser — George Papadopoulos — that actually started the investigation.", "The federal government started looking into Russian election involvement in July 2016 based on information from Papadopoulos. This was confirmed by Republican members of the House Intelligence Committee.", "\"The Papadopoulos information triggered the opening of an FBI counterintelligence investigation in late July 2016 by FBI agent Pete Strzok,\" the House Intelligence Committee’s GOP members wrote in a Feb. 2 memo.", "House Intelligence Committee Republicans confirmed in an April report it was Papadopoulos who set the FBI investigation in motion.", "So, what was the \"Papadopoulos information\"?", "According to the New York Times, Papadopoulos told a high-ranking Australian diplomat at an upscale London bar in May 2016 that Moscow had \"political dirt\" on Hillary Clinton. Australian officials relayed this information to their American counterparts.", "Trump also confused the timeline of Special Counsel Robert Mueller’s involvement.", "The Papadopoulos discussion of Clinton dirt that triggered the investigation took place in May 2016. Yet an entire year would pass before Mueller entered the picture.", "The Justice Department did not appoint Mueller to take over the FBI investigation until May 2017, roughly a week after Trump fired FBI director James Comey.", "Trump said the Steele dossier \"was responsible for starting\" Special Counsel Robert Mueller’s investigation into links between the Trump campaign and Russia.", "The Steele dossier did not trigger Mueller’s investigation. It was information from Trump campaign adviser George Papadopoulos that set the probe in motion. Also, Mueller did not take up the investigation until roughly a year after the triggering event.", "We rate this False.", "Tweet from President Donald Trump, July 23, 2018", "FISA application for Carter Page, released July 21, 2018", "PolitiFact, \"Democrats’ memo pushes back on GOP claims about Russia probe,\" Feb. 28, 2018", "PolitiFact, \"The Russia investigation and Donald Trump: a timeline from on-the-record sources,\" July 16, 2018", "New York Times, \"How the Russia Inquiry Began: A Campaign Aide, Drinks and Talk of Political Dirt,\" Dec. 30, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]