["About this rating", "In April 2019, a video seemingly showing a car turning its wheels perpendicular to the curb in order to exit from a tight parallel parking spot went viral after it was posted to Reddit. A version of the video from the Xe Hay Facebook page can be seen below:", "This is not a genuine video of new automotive technology in action, but rather a partially computer-generated animation showcasing a prospective futuristic feature.", "A close inspection of this video reveals a few oddities. For example the texture of the road appears to change as the vehicle moves out of its parking spot. And the speed with which the wheels spin doesn't quite match up with the movement of the car.", "In addition to these anomalies, the model of vehicle shown in this video, an all-electric SUV manufactured by XPeng Motors called the G3, is not equipped with wheels that can rotate in such a fashion.", "The G3 does incorporate several modern features, including auto-parking, but the video above does not document the actual mechanism used by the G3 to park via autopilot. Here's a video from XPeng Motors showing how this car actually manages to park by itself:", "In a December 2018 press release announcing the launch of the new vehicle in China, XPeng Motors explained that the car uses 23 sensors and cameras with 360° real-time perceptions (not wheels that turn perpendicular to the curb) in order to auto-park:", "The remarkably intelligent and high performance 5-seater SUV, offered at a price range of RMB 227,800 to 257,800 before subsidies, presents a combination of best-in-class smart features, specs and attractive value which has led its average weekly pre-sales number to increase by nine-fold in November from August 2018.", "\"Today is a milestone for XPENG Motors. We are proud to deliver a truly intelligent, stylish and more importantly reliable and affordable electric car to our customers,\" says CEO and Chairman He Xiaopeng.", "\"The XPENG G3 is to set the benchmark for the new era of AI-empowered vehicles. Our self-developed innovative features, many of which are first-of-its-kind, are intended for China's unique user behaviors and road conditions. These will set us apart from others,\" says He as the company delivers the G3 to the first group of purchasers at the ceremony.", "\"The automobile industry is undergoing a profound transition driven by two engines: electric and AI. We are seeing tremendous growth opportunity ahead of us. This is just the beginning,\" He says.", "Enabled by 23 sensors and cameras with 360° real-time perceptions, the XPILOT 2.5 autonomous driving assistant can achieve full auto parking in the broadest range of parking scenarios among mass production models, effectively addressing parking difficulties in China.", "The viral video of this car's unusual and digitally altered wheels was part of a series of videos imagining the XPeng G3 with not-yet-realized futuristic features. It appears that these digitally altered videos were created by TikTok user lilliangebhardt5, and while the video at the top of this page may seem somewhat realistic, the added digital elements are much more obvious in the other videos compiled by lilliangebhardt5.", "For instance, here's a video of the XPeng G3 changing another vehicle's tire:", "Here's another video which shows the XPeng G3 giving itself a car wash:", "Finally, this video supposedly shows the XPeng G3 driving up the side of a building:", "Automotive engineers have been tinkering with features to facilitate the parking and maneuvering of vehicles in tight spaces for several decades. The \"Park Car\" with a fifth wheel was patented in the 1950s, for example:", "Xpeng Motors.   \"XPENG G3 Launches in China.\"\r\n    12 December 2018.", "O'Kane, Sean.   \"Chinese EV Startup XPeng Is at the Center of Major Trade Secret Disputes with Apple and Tesla.\"\r\n    The Verge.   24 May 2019.", "Smith, Karl.   \"CES 2018: XPeng G3 Takes on Tesla.\"\r\n    Car Design News.   11 January 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]