["About this rating", "The arrest of five adults for child abuse in August 2018 at a New Mexico compound where the principal suspect was accused of training children to be school shooters took an unexpected turn when far-right websites declared that the suspect's father, a well-known Muslim cleric, had been a keynote speaker at the 2012 Democratic National Convention.", "One of those sites, True Pundit, reported on 9 August that Siraj Wahhaj, who is the American-born imam of the Al-Taqwa mosque in Brooklyn, New York, spoke at the Charlotte, North Carolina, convention where President Obama was nominated to run for a second term in office:", "Radical Father of Man Who Trained SCHOOL SHOOTERS Was Keynote Speaker at Obama’s Democratic National Convention, Possibly Tied to World Trade Center Bombing", "The Democrats really know how to pick their role models and keynote speakers. This one, however, is going to give the battered political party another black eye.", "Let’s begin here. Per CBS NEWS: The man arrested at a squalid New Mexico compound is the son of a controversial Brooklyn imam who was on a list of people who “may be alleged as co-conspirators” to the 1993 World Trade Center bombing, according to court documents released by prosecutors Wednesday. Siraj Wahhaj, who shares a name with his son who was arrested Saturday, testified as a character witness for Sheik Omar Abdel Rahman, the notorious “blind sheikh” who was convicted in 1995 of plotting terror attacks in the U.S.", "Worse yet, the entire Democratic party celebrated this man during Obama’s second trip to the White House. That was AFTER his alleged role in the WTC bombing.", "The article is correct in stating that Imam Wahhaj is the father of Siraj Ibn Wahhaj, who was one of the five arrested in New Mexico and is under investigation in the death of an unidentified child whose body was found on the compound. The imam acknowledged their relationship (as well as his familial connections to the other four suspects) during a press conference one week after the arrests.", "However, the claim that Wahhaj was the keynote speaker at the 2012 Democratic National Convention, and therefore somehow connected to Obama, is false, basically a regurgitation of a years-old, politically-motivated Internet rumor. Wahhaj neither participated in nor spoke at that convention.", "The rumor that Wahhaj was supposedly going to speak at the 2012 DNC erupted on right-wing blogs and websites during the weeks leading up to the September 2012 event. It so happened that an Islamic group called the Bureau of Indigenous Muslim Affairs (BIMA) announced it would host several public events, including an open-air prayer gathering (to be called \"Jumah at the 2012 DNC\") the weekend before the convention. The prayer gathering was slated to take place in Marshall Park (about a mile from the convention center) on Friday, 31 August 2012 (four days before the convention opened on 4 September). It was announced that Imam Siraj Wahhaj would lead the Friday prayer.", "Jumah at the 2012 DNC did take place, but it was not an official Democratic National Convention event. It wasn't organized or sponsored by the Democratic Party, and it was over before the convention even started. It never appeared on the party's roster of official convention activities. According to the Charlotte Observer, the BIMA prayer meeting was one of about a thousand \"nonofficial convention-related events\" planned by independent groups to coincide with the Democratic Party gathering.", "However, those facts did not stop hyperpartisan websites from publishing articles stating variants of the following:", "The false claim that the convention would open with a Muslim prayer was ultimately coupled with another false rumor to the effect that the Democratic National Committee had rejected an offer by Cardinal Timothy Dolan, the archbishop of New York, to deliver a Christian prayer at the event. But there was no Muslim prayer, and Dolan did, in fact, deliver the closing benediction at the 2012 Democratic National Convention.", "The keynote speaker at that convention was then-San Antonio mayor Julian Castro. He is a Roman Catholic, not a Muslim.", "It is a fact that Imam Siraj Wahhaj led a prayer at an Islamic event (Jumah at the 2012 DNC) that took place in Charlotte, North Carolina, a few days before the opening of the convention that would deliver Barack Obama his second Democratic presidential nomination.", "In partisan hands, this morphed into the rumor that Wahhaj led a prayer at the Democratic National Convention itself, which in turn has morphed into the rumor that Wahhaj was the keynote speaker at the convention, and therefore somehow intimately connected to Democratic Party politics and Obama's presidency. Those rumors are false.", "Carnes, Tony.   \"Cardinal Timothy Dolan's Benediction at the 2012 Democratic National Convention.\"\r\n    NYCReligion.info.   7 September 2012.", "Cusido, Carmen.   \"Muslims to Host Events During DNC; Up to 20,000 Could Attend.\"\r\n    Charlotte Observer.   2 July 2012.", "Dmitry, Baxter.   \"Father Of Man Who Trained School Shooters Was 2012 DNC Keynote Speaker.\"\r\n    Your News Wire.   10 August 2018.", "Hollenbeck, Derrick.   \"Democrats’ America Hating Islamists to Open DNC with Prayer for Sharia to Replace U.S. Constitution.\"\r\n    CoachIsRight.com.   29 August 2012.", "Hauslohner, Abigail.  \" Father of N.M. Child-Abuse Suspects Speaks Out: They ‘Cut Ties’ and Disappeared.\"\r\n    The Washington Post.   9 August 2018.", "Minor, Jack.  \" Democrats Host Radical Muslims at Charlotte.\"\r\n    World Net Daily.   27 August 2012.", "National Public Radio.   \"Transcript: Julian Castro's DNC Keynote Address.\"\r\n    4 September 2012.", "Riehl, Dan.  \"DNC Embracing Radical Islamists at National Convention.\"\r\n    Breitbart.   22 August 2012.", "True Pundit.   \"Radical Father of Man Who Trained SCHOOL SHOOTERS Was Keynote Speaker at Obama’s Democratic National Convention, Possibly Tied to World Trade Center Bombing.\"\r\n    9 August 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]