["By Lori Robertson, Eugene Kiely, Robert Farley and D'Angelo Gore", "Posted on February 6, 2020", "A day after his acquittal in the Senate impeachment trial, President Donald Trump made celebratory remarks in the White House on Feb. 6, thanking many Republican politicians and repeating several false and misleading claims, many of which we’ve checked before.", "The president twisted the facts on the Russia investigation, former FBI officials, European contributions to Ukraine, the stock market, Medicare for All and drug prices.", "Recounting what he described as ongoing and unfair attempts to overturn his presidency, Trump provided this blunt assessment of the Russia investigation: “And you have to understand, we first went through Russia, Russia, Russia. It was all bullshit.”", "But there was plenty to the Russia investigation.", "On Jan. 6, 2017, two weeks before Trump’s inauguration, the Office of the Director of National Intelligence publicly released a declassified intelligence report that said: “Russian President Vladimir Putin ordered an influence campaign in 2016 aimed at the U.S. presidential election,” and the goal of the campaign was “to help President-elect Trump’s election chances.”", "In addition to a clandestine social media campaign to discredit Hillary Clinton, the report said Russian military intelligence gained access to Democratic National Committee computers from July 2015 to June 2016 and then used WikiLeaks, DCLeaks.com and “Guccifer 2.0, who claimed to be an independent Romanian hacker,” to publicly release hacked emails and documents. The cyberattacks and public release of hacked material were part of larger “Russian propaganda efforts” to hurt Clinton and help Trump, the report said.", "The special counsel’s office in February 2018 secured an indictment against 13 Russian nationals and three Russian entities for their role in that interference. The indictment says the defendants conspired to defraud the United States. The conspiracy involved using the names of U.S. citizens and companies to illegally buy political ads on social media and stage political rallies. Some defendants also “solicited and compensated real U.S. persons to promote or disparage candidates,” according to the indictment.", "The defendants are alleged to have employed hundreds of people for online operations, “ranging from creators of fictitious personas to technical and administrative support personnel, with an annual budget of millions of dollars,” then-Deputy Attorney General Rod Rosenstein said. In July of that year, 12 Russian military officers were also indicted.", "Regarding special counsel Robert Mueller’s inquiry into potential coordination between the Trump campaign and Russians, his report said that “the investigation established multiple links between Trump Campaign officials and individuals tied to the Russian government. Those links included Russia offers of assistance to the Campaign. In some instances, the Campaign was receptive to the offer, while in other instances the Campaign officials shied away.”", "It continued: “Ultimately, the investigation did not establish that the Campaign coordinated or conspired with the Russian government in its election-interference activities.”", "As we have written, Trump has provided mixed messages about the appropriateness of the investigation into Russian interference in the 2016 president election. At times he has acknowledged that Russia interfered in the election, and other times he has called the investigation a “hoax” and questioned whether Russians or some other group was responsible.", "During the phone call in July with Ukrainian President Volodymyr Zelensky that triggered the impeachment investigation, Trump raised the debunked conspiracy theory that Ukraine, not Russia, interfered in the 2016 elections and hacked the Democratic National Committee.", "“The server, they say Ukraine has it,” Trump said, according to a memo of the call released by the White House, adding, “I would like you to get to the bottom of it.” But there is no evidence Ukraine has the servers.", "Trump once again falsely claimed that Peter Strzok, a former FBI senior counterintelligence agent, and Lisa Page, a former FBI lawyer, “illegally deleted” all of their emails and text messages between them. They have not been charged with violating any laws, and there is no evidence that any messages were intentionally deleted — let alone “all” of them.", "The president, in the midst of celebrating his impeachment acquittal, recalled how Strzok and Page exchanged anti-Trump text messages prior to the election. Trump read from some of those messages — which resulted in special counsel Mueller removing Strzok from the Russia investigation.", "Trump: When Mueller found out that everybody knew that they were 100% this way, he let them go. But they deleted all of their emails and text messages. So when we got the phone, they were all deleted. Can you imagine the treasure trove? They illegally deleted.", "We covered this issue in a story in 2018, but here’s a summary: During the election, Strzok and Page were assigned to the FBI’s investigation into Hillary Clinton’s use of personal email for government business while she was secretary of state. In July 2016, the FBI closed the Clinton investigation without any charges being filed, and opened an investigation into reports that Russia hacked into the Democratic National Committee’s servers. Strzok was assigned to lead the Russia probe, and Page was assigned to serve as the deputy director’s liaison to the new investigation, according to a Department of Justice inspector general’s report published in June 2018.", "But they weren’t on the Russia investigation for long. Both left in July 2017. Page’s assignment ended after less than two months, and Strzok was removed after the IG informed Mueller that the couple exchanged text messages that expressed “hostility” toward Trump during the 2016 presidential election, according to the IG’s June 2018 report.", "“[A]fter finding responsive text messages between Page and Strzok that appeared to intermingle political comments with discussions of the [Clinton] investigation, the OIG obtained from the FBI all text messages between Strzok and Page from their FBI-issued phones for the entire period of the Clinton email server investigation as well as the period of the Russia investigation during which Strzok and Page worked on it,” the report stated. “The OIG received more than 40,000 unique text messages between Strzok and Page in response to these requests. The FBI did not provide any text messages for the period from December 15, 2016, to May 17, 2017, because of issues with the data collection and preservation software used on the FBI’s Samsung S5 mobile devices.”", "Trump repeatedly has accused Strzok and Page, as well as Mueller and Mueller’s team, of deleting the missing text messages from December 2016 to May 2017.", "“Biggest outrage yet in the long, winding and highly conflicted Mueller Witch Hunt is the fact that 19,000 demanded Text messages between Peter Strzok and his FBI lover, Lisa Page, were purposely & illegally deleted,” Trump tweeted on Dec. 18, 2018. “Would have explained whole Hoax, which is now under protest!”", "However, the IG’s forensic agents were able to recover about 20,000 missing text messages during that “gap period” in late 2016 to mid-2017. A footnote in that June report says the failure to preserve the emails from Dec. 15, 2016, to May 17, 2017, resulted from a software problem — “not from the actions of any FBI employee, including Strzok.”", "A second IG report in December 2018 detailed how the IG was able to recover the emails, and why the text message data collection tools on the FBI’s Samsung phones failed. That report similarly said, “[T]he OIG did not find that the gaps in collection were intentional on the part of the FBI or any FBI personnel.”", "Contrary to the evidence, the president continues to claim that the text messages were “illegally deleted.”", "Trump falsely said that Sen. Chuck Grassley of Iowa got former FBI Director James Comey to admit to leaking information about the FBI’s investigations of Hillary Clinton and Russian interference in the 2016 elections.", "“Chuck Grassley, he’s looking at Comey, ‘Well, you tell me, what did you say?’” Trump said Grassley asked. “And that was when Comey, I think that was when Comey announced that he was leaking, lying and everything else, right? He choked.”", "That’s not what happened in the May 2017 Senate Judiciary Committee hearing that Trump appears to be referencing. Comey, who was still the FBI director at the time, actually told Grassley he did not leak, or authorize anyone else at the FBI to leak, information about those investigations to the press.", "Here’s the exchange:", "Grassley, May 3, 2017: Director Comey, have you ever been an anonymous source in news reports about matters relating to the Trump investigation or the Clinton investigation?", "Comey: Never.", "Grassley: Question two, relatively related, have you ever authorized someone else at the FBI to be an anonymous source in news reports about the Trump investigation or the Clinton investigation?", "Comey: No.", "About a month later, during a hearing before a different Senate committee, Comey did admit to Sen. Susan Collins of Maine that — after he was fired as FBI director by Trump on May 9 — he had a friend of his relay to the New York Times the contents of a memo he wrote about a conversation he had with Trump about Trump’s former national security adviser, Michael Flynn, whom the FBI was investigating.", "Collins, June 8, 2017: Finally, did you show copies of your memos to anyone outside the Department of Justice?", "Comey: Yes.", "Collins: And to whom did you show copies?", "Comey: The president tweeted on Friday after I got fired that I better hope there’s not tapes. I woke up in the middle of the night on Monday night, because it didn’t dawn on me originally, that there might be corroboration for our conversation, there might be a tape. And my judgment was, I needed to get that out into the public square, so I asked a friend of mine to share the content of the memo with the reporter. I didn’t do it myself for a variety of reasons, but I asked him to because I thought that might prompt the appointment of a special counsel. So I asked a close friend of mine to do it.", "Trump falsely suggested that Germany, France and the United Kingdom don’t give money to Ukraine. In fact, as we have written, the European Union and European financial institutions have contributed $16.4 billion in grants and loans to Ukraine since 2014, considerably more than the United States. The Organisation for Economic Cooperation and Development’s list of the top 10 donors of official development assistance to Ukraine has EU institutions as No. 1, with $425.2 million contributed on average for 2016-2017. The U.S. was second ($204.4 million in assistance) and Germany was third ($189.8 million on its own, in addition to what it would have given through the EU).", "Trump said he would ask Vice President Mike Pence, “Tell me, why isn’t Germany paying money? Why isn’t France? Why isn’t the United Kingdom paying money? … I say, find out what the hell’s going on. And I told that to all of my people. … Why is the United States always the sucker?”", "Some State Department employees did try to tell the president that EU countries contributed more money to Ukraine than the U.S., according to the congressional testimony of David Holmes, the political counselor for the U.S. Embassy in Ukraine. Holmes said he and others on the Ukraine team, in coordination with other U.S. missions in Europe and NATO, began “looking into the facts” after the hold was placed on the security assistance to Ukraine and they were trying to understand why. Holmes said they found the U.S. had provided about $3 billion in combined civilian and military assistance to Ukraine since 2014, plus $3 billion in loan guarantees that he said “get paid back largely.” The EU plus member states “have provided a combined $12 billion to Ukraine” since 2014. Holmes said he believed this was communicated to the White House in late August.", "Trump made the remarkable prediction that “if we didn’t win, the stock market would’ve crashed. The market was going up a lot before the election because it was looking like we had a good chance to win.” We wrote the day Trump was inaugurated: “Trump takes office with stock prices near historic highs, after an eight-year run-up that will be a tough act for Trump to follow.”", "Over former President Barack Obama’s eight years in office, stock prices set record after record. The Standard & Poor’s 500-stock average increased by 166%, from the last trading day before he took office until his final day as president. The S&P has gone up another 47.8% under Trump.", "Trump boasted that stock prices “went up tremendously from the time we won the election until the time we took office,” and there was a so-called “Trump Rally” in the weeks after the election that many attributed partly to investor optimism that Trump would cut taxes and regulation as promised. But the S&P increased by just under 6% between Election Day and Obama’s last day in office.", "Trump claimed, in a reference to Medicare for All, that one year of the plan would cost more than the country “could make in 30 years.” That doesn’t add up.", "“We’re going to give you a health care that’s going to cost more money than the country could make in 30 years if it does really well. That’s one year,” he said Democrats were saying by backing the plan.", "The cost estimates for Medicare for All — a plan introduced by Sen. Bernie Sanders for a universal, Medicare-like health care system — vary, as many details are yet to be determined. One recent estimate, from the Urban Institute, for a single-payer plan similar to Sanders’ legislation found federal government spending would need to go up by $2.8 trillion next year and $34 trillion over 10 years.", "But federal revenues, without any changes to finance the plan, would be higher than that cost, contrary to what Trump said. The White House Office of Management and Budget estimates total federal receipts would be $3.6 trillion in 2020 and increase to $4.8 trillion by 2024. Perhaps more important, Sanders, and others who support the plan, have said they will use new revenue streams to finance it, such as payroll taxes, an income-based “premium” and increased taxes on high-income individuals. So, the revenue the government makes would increase.", "Also, it’s worth noting that while the cost to the federal government would go up significantly under a single-payer plan, health spending by everyone else — individuals, employers, insurers, and state and local governments — would be largely, if not entirely, eliminated. Total national health expenditures by all payers were an estimated $3.6 trillion in 2018 and are projected to be $47 trillion over 10 years, 2018-2027, according to the Centers for Medicare & Medicaid Services.", "The president falsely claimed, “We had first time in 51 years where drug prices actually came down last year.” Drug prices can be measured in different ways, but using Trump’s measure — the 12-month change in the consumer price index for prescription drugs — the price decline from December 2017 to December 2018 was the first in five-and-a-half years, when the year-over-year change in the CPI for drugs dipped below zero from July 2012 to July 2013.", "The CPI for prescription drugs is a measure from the Bureau of Labor Statistics that aims to capture what consumers, plus their insurance companies or other payers, are paying for a basket of retail prescriptions. As we found when we wrote about this issue last year, Trump has used the December 2017 to December 2018 decline of 0.6% as the first “calendar year” drop since December 1971 to December 1972, which is 46 years prior, not 51. But that’s not the last year-to-year drop for these figures.", "Trump has a point that the CPI for prescription drugs has appeared to show good news, with a year-to-year decline in nine out of the 13 months from December 2018 through December 2019, the most recent figures available. However, those year-to-year figures have gone up for the last three months of 2019, so drug prices, by this measure — at the point of sale and for all payers combined — are again rising.", "We explained in detail the limitations to the CPI and what other measures of drug prices show. For instance, brand list prices, inflation-adjusted, had gone up by 3.3% in the first quarter of 2019, but net prices (after rebates, discounts, coupons and fees are deducted) had dropped by 4.1%, according to an analysis by SSR Health, an investment research firm.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]