["Since NASA's Perseverance touched down on Mars' surface Feb. 18, the rover has sent back footage of its dramatic planetary descent, panoramic views of its landing site and first recorded Martian sounds.", "While its impressive imagery is being shared across social media, another image has been added to the mix: a picture of Earth, Venus and Jupiter seen as twinkling lights in the dusky Mars skyline.", "The picture, shared in a Feb. 23 post on Facebook, has garnered much attention, with users expressing their awe and amazement.", "USA TODAY has reached out to the poster of the image for further comment.", "More:Fact check: Heavily edited viral image of sun's surface wasn't taken by NASA", "Unfortunately for space lovers, the photo, while not a hoax, is not real either.", "Astronomer Phil Plait debunked the photo in 2012, after finding telltale signs it was likely created with the help of a planetarium computer software. Plait noted the symbol for northeast was visible in the lower lefthand corner – after adjusting the photo's brightness and contrast – referring to cardinal directions such programs provide.", "Plait also found, based on his own planetarium software simulations, the almost linear arrangement of Earth, Venus and Jupiter in the Martian sky would have been a sight visible if one were facing westward on the planet in mid-2010.", "Newsweek confirmed this finding with the help of amateur astronomer Rob Tinsley, who was able to reproduce the planetary alignment, as it would appear on July 11, 2010, using the SkySafari solar system simulation software.", "More:Fact check: Viral image claiming to be a blue Philippine owl is doctored", "\"Mind you, the picture itself isn't a hoax!\" Plait wrote for Discover Magazine. \"It's just a computer generated image probably meant to represent a real scene. But it got spread around the net, and before you know it people think it's real.\"", "The computer simulated theory appears on the nose when searching for where and when the image originated. USA TODAY could not find the photo anywhere on NASA's website – in a statement to PolitiFact, the agency denied it came from them – but we were able to trace it back to a July 2010 post by blogger Louise Riofrio.", "\"This is the view you would see looking East from Gusev Crater (on Mars) at local sunrise, 1:14 Universal Time. Because of the speed of light, this image will not appear until 1:26 PM UT,\" they write beneath the photo.", "A view of Earth from Mars was first captured by NASA's Spirit rover in 2004, and again by the Curiosity rover in January 2014. Taken during the rover's 529th Martian day, Curiosity's image also includes a faint impression of the moon hovering directly below.", "The claim that an image depicts Earth, Venus and Jupiter from Mars is FALSE, based on our research. The photo was widely circulated on social media in 2012, and experts ruled it was likely generated by a planetarium simulation software. This theory appears accurate when tracing back the image's origins to a July 2010 blog post. NASA has also denied the photo was from the agency.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]