["The poster does not specify in which country the ruling was made. However, the image has been shared on Facebook in South Africa more than 920 times, including here, here and here.", "After listing the various claims, the poster ends by calling face masks “a symbol of oppression not protection”, before declaring “we do not consent”.", "AFP Fact Check ran the rule over each of the claims.", "In short, yes. This is because of a court ruling handed down in June that invalidated the current government regulations under the Disaster Management Act to manage the pandemic.", "The regulations include a section governing the use of face masks during this time.", "While the legal challenge brought by a group called the Liberty Fighters Network did not target face masks in particular, they were ruled unconstitutional by default because the judgement applied to the entire piece of legislation.", "However, the state has appealed this judgement and until the Supreme Court of Appeal hears the matter, the Covid-19 regulations remain in force.", "“One of the problems with the [initial] ruling is it threw the entire thing out, having found only certain bits of it problematic,” said Cathleen Powell, associate professor in public law at South Africa’s University of Cape Town.", "“When a court judgement goes on appeal, it doesn’t have legal force until the appeal is decided. Currently, the regulations are still in force because the court judgement declaring them invalid has been appealed.”", "As a result, face masks are still mandatory in public, even under alert level one, the most relaxed of South Africa’s lockdown levels.", "Bernard Bekink, public law professor at South Africa’s University of Pretoria, agreed.", "“According to my understanding, the Pretoria High Court judgement of Judge Davies, which declared certain lockdown regulations unconstitutional, has indeed been taken on appeal and the judgement is thus suspended pending the appeal process,” he told AFP Fact Check. “The regulations in general, as amended to date, are therefore in force.”", "Justice ministry spokesman Chrispin Phiri also confirmed that face masks remain mandatory in public for now.", "“Individuals will be turned away from public places if not wearing a mask,” he told AFP Fact Check. “However, public transport operators and building managers may be fined for allowing people who are not wearing a mask into their buildings.”", "Constitutional law expert Pierre de Vos said in a blog post that while the regulations do not criminalise an individual’s refusal to wear a mask in public, there could be ramifications for others.", "“It places an obligation on a driver or operator of any form of public transport, a manager or owner of a building, an employer, and a school principal to ensure the wearing of face masks in the space they have authority over,” he wrote.", "“If these individuals fail to take reasonable steps to ensure compliance with the wearing of face masks commits an offence and is liable on conviction to a fine or to imprisonment for a period not exceeding six months or to both such fine and imprisonment.”", "No date has been set yet for the government appeal. But AFP Fact Check confirmed with registrar Paul Myburgh of the Supreme Court of Appeal that the application has been lodged.", "The poster claims that the World Health Organization (WHO) says there is no proof that face masks protect against Covid-19. This is not true and a claim similar to this was debunked by AFP Fact Check in August.", "“Masks should be used as part of a comprehensive strategy of measures to suppress transmission and save lives; the use of a mask alone is not sufficient to provide an adequate level of protection against Covid-19,” the WHO says on its website.", "It also advises that people keep a metre apart, frequently wash their hands and avoid touching their face and mask.", "Masks fall into two categories: medical masks and non-medical or cloth masks.", "The WHO notes that there is limited evidence on the effectiveness of non-medical or fabric masks and does not recommend their widespread use among the public for control of Covid-19.", "“However, for areas of widespread transmission, with limited capacity for implementing control measures and especially in settings where physical distancing of at least one metre is not possible -- such as on public transport, in shops or in other confined or crowded environments -- WHO advises governments to encourage the general public to use non-medical fabric masks,” the UN agency says.", "Experts say that face masks protect against a virus if they are worn correctly.", "“Any kind of barrier over the mouth and nose including a homemade mask will prevent most of those droplets from coming out or in, and that is how ordinary masks can prevent infection,” said Dr Benjamin Neuman, an expert in coronaviruses who chairs the biological sciences department at Texas A&M University-Texarkana.", "He added that some types of masks were particularly effective.", "“An N95 or P95 mask is a filter that has been certified to catch most particles of a specific size, but only if it is fit-tested to make sure there is a good seal with your face,” Neuman told AFP Fact Check.", "He said physical barriers were the main idea behind all medical personal protective equipment, and work “fantastically” if used correctly and if precaution is exercised when taking off potentially contaminated equipment.", "“But you don't necessarily need an N95 mask outside a lab or hospital,” Neuman added.", "This was echoed by Yves Coppieters, epidemiologist and public health professor at the Free University of Brussels in this debunk by AFP Fact Check.", "“Surgical masks have a filtering capacity for 90 percent of microorganisms, including (the virus). For FFP2 masks used in intensive care, this capacity increases to 98 percent, 99 percent. For fabric masks, it is lower, estimated to be between 50 percent and 70 percent,” Coppieters said.", "This false claim was debunked by AFP Fact Check here.", "Dr Shelley Payne, director of the LaMontagne Center for Infectious Disease at the University of Texas in Austin, said that a correctly-worn mask allows air to flow without the accumulation of carbon dioxide.", "“A properly fitted mask will not cause hypoxia,” she told AFP Fact Check.", "Nairobi-based infectious disease specialist Rodney Adam agreed: “You only rebreathe carbon dioxide if you do not have air exchange but this is not the case while wearing a proper mask. Air goes in and out of masks just fine.”", "This claim was also made in the viral “Plandemic” video, which AFP Fact Check debunked here.", "Payne again told AFP Fact Check that “there is no evidence that masks or gloves reduce the normal microbiota or predispose people to opportunistic infections”.", "Microbiota are the various microorganisms that live in the human body, including all bacteria, viruses, fungi and other single-celled organisms.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]