["The photo was published here on Facebook on January 14, 2020. It has since been shared more than 1,900 times.", "Below is a screenshot of the misleading post:", "The Thai text superimposed over the photo translates to English as: “The government is preparing to order authorities to smash 6,000 temples in national park areas throughout the country. What should we do fellow Buddhists?”", "The text highlighted in pink reads: “The government of smashing temples”.", "The post’s caption reads: “This is like losing our independence for the third time, the second time was when we were burnt by the Burmese. The third time is under the demolition orders of an unfaithful Muslim Prime Minister.”", "The photo has been shared in a misleading context; a reverse image search on Google found it shows the destruction of Bangkok's Kalayanamitr Temple. It matches with screenshots from a video published here by Nation TV, a Thai news channel, on August 25, 2015.", "Below is a screenshot of the video report:", "The article’s headline translates into English as: “Director of National Office of Buddhism has delayed the order to demolish Kalayanamitr Temple”.", "Below is a screenshot comparison of the photo in the misleading post (L) and the Nation TV video (R) with similarities circled in red by AFP:", "The destruction of Kalyanamitr Temple gained national media attention after a judge ordered authorities to cease the demolition.", "In 2018, a court sentenced the Kalayanamitr abbot to one year parole for proceeding with temple renovations that resulted in the destruction of ancient ruins located nearby, according to this report by Thairath, a Thai daily newspaper.", "Thailand’s Anti-Fake News Centre, a government-run platform within the Ministry of Digital Economy and Society, published a report here labeling the claim in the misleading post as “fake news.”", "Below is a screenshot of the Anti-Fake News Centre’s article:", "The Thai headline translates to English as: “The Government Prepares to Smash Temples in 6,000 parks around the country is fake news that has confused the general public. Do not share!”", "The office of Director Thanya Netithammakun, who heads the Department of National Parks, Wildlife and Plant Conservation, also said the claim was false.", "“This piece of information is false. Demolishing temples is not our agenda, nor it will ever be. We fully support the existence of temples in national park areas throughout the country,” the director’s spokesperson told AFP by phone on January 23, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]