["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In the second presidential debate on Oct. 7, 2008, Sen. Barack Obama listed energy independence as one of the nation's biggest priorities, and touched briefly on the controversial issue of whether to open up new areas to offshore drilling.", "\"I believe in the need for increased oil production,\" Obama said. \"We're going to have to explore new ways to get more oil, and that includes offshore drilling. It includes telling the oil companies, that currently have 68-million acres that they're not using, that either you use them or you lose them.\"", "Obama has been a consistent opponent to opening new areas to offshore drilling. But in early August, Obama softened that position when he said he was open to supporting the New Energy Reform Act of 2008, a bipartisan compromise bill that includes alternative energy incentives that Obama wants — such as $84-billion over 10 years on research and development of better batteries, fuels and energy-saving technologies and tax incentives for people who buy hybrid and alternative-fuel cars — but also would allow drilling for oil and natural gas as close as 50 miles from Florida’s west coast.", "As he did in the debate, Obama has often bolstered his case against moving too fast on drilling with the argument that before opening up new areas to drilling, oil companies should be required to drill the acreage they already have.", "Obama is echoing a June report from the Democratic staff of the House Natural Resources Committee, which cited the fiscal 2007 statistics from the Interior Department's Minerals Revenue Management that classified 67,055,715 acres of oil and gas leases as \"non-producing.\"", "The line sounds good as a Democratic rebuttal to Republican demands that Democrats move to allow drilling in Alaska's protected Arctic National Wildlife Refuge and offshore areas that also are currently off limits to the oil and gas companies. A Democratic House bill would bar new oil and gas leases to leaseholders who have not met benchmarks to \"ensure\" oil and gas production within five years on the leases they already hold.", "But Obama's statement is misleading, inasmuch as it suggests that oil and gas companies have access to 68-million acres of oil and gas fields that they deliberately are not drilling. What Obama did not take into account is the long, complex process that companies must work through, both in federal red tape and in geologic exploration, before leased property becomes a producing oil or gas field. The government classifies that acreage as \"non-producing\" simply because the companies aren't taking oil and natural gas out of it now.", "David Curtiss, director of the American Association of Petroleum Geologists' Geoscience and Energy Office in Washington, D.C., says it's wrong to assume that \"the only lease that is being actively worked is one that has a drill rig on it.\"", "The Interior Department issues leases for onshore territory for 10-year initial terms. The department issues offshore leases for five-, eight- or 10-year initial terms, depending on the depth of the water. Dave Smith, a spokesman for the department's Minerals Management Service, which handles offshore leases, says those initial terms are calculated according to how long the government thinks it will take oil and gas companies to find and start producing oil or gas.", "For both onshore and offshore leases, the companies have to comply with government permitting requirements as they undertake a lengthy scientific exploration process that culminates in test drilling to determine whether there is enough oil or natural gas in a particular spot to warrant full-scale drilling. All the while, the companies are paying rent to the federal government for acreage that is classified as \"non-producing.\"", "It can take more than 10 years for a company to start producing oil or natural gas from a leased parcel, but as long as the company can demonstrate that it is making serious efforts to find some, the leases are extended. If the company cannot show that it's actively working the parcel, the lease is not renewed. Sometimes companies don't renew leases if their early work leads them to believe adequate reserves of oil or gas don't exist.", "Obama's statement suggests that \"non-producing\" acreage where drilling is permitted is land that oil companies are ignoring. That is simply not true. Years of exploration and federal permitting must be completed before leased land yields oil or gas. As a result, we find Obama's claim to be False.", "Department of Interior,\n\n\nTotal Producing and Non-Producing Leases, Fiscal 2007", "Department of Interior,\n\n\nTotal By Category of Acreage, Fiscal 2007", "Department of Interior,\n\n\nTotal By Mineral Production Type", "Interior Department Minerals Management Service guidelines for offshore leases", "Federal Regulations on Extension of Onshore Leases", "House Energy and Resources Committee,\n\n\nDemocratic staff report, June 2008", "CQ Today, \"Democrats Try 'Use it or Lose It' Oil Argument\"\n\n\nJune 16, 2008", "Interview with David Curtiss, Aug. 12, 2008", "Interview with Allyson L. Groff, communications director for the House Natural Resources Committee, Aug. 12, 2008", "Interview with Nicholas Pardi, spokesman for the Interior Department's Minerals Management Service, Aug. 12, 2008", "Interview with Dave Smith, spokesman for the Interior Department's Minerals Management Service, Aug. 18, 2008", "Interview with Patrick Etchard, spokesman for the Interior Department's Minerals Revenue Management, Aug. 18, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]