["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Mark Meadows, R-N.C., questions Commerce Secretary Wilbur Ross during the House Oversight Committee hearing on March 14, 2019. (AP/Jose Luis Magana)", "The fate of the Trump administration’s census citizenship question rests in the hands of the Supreme Court, but debate over the issue has been swirling in Congress.", "During Commerce Secretary Wilbur Ross’ March 14 testimony before the House Oversight and Reform Committee, Rep. Mark Meadows, R-N.C. and a leader of the House Freedom Caucus, said asking about citizenship is nothing out of the ordinary.", "\"The previous administration under President Barack Obama really was the first time that we didn’t ask a citizenship-type question,\" Meadows said in a question to Ross. \"For the first time in a century, a citizenship question was not included in 2010.\"", "Meadows, who represents North Carolina’s 11th Congressional District, which includes the state’s westernmost counties, made the same claim at an earlier point in the testimony, saying citizenship questions were a staple of censuses \"prior to 2010, when President Obama decided not to include a citizenship question on the census.\"", "But Meadows’ statements muddle the facts because the citizenship question did not disappear entirely during the Obama years.", "Here’s what Meadows got wrong.", "The answer is complicated.", "The census has been administered every decade since 1790 to get a national population count used for determining the distribution of seats in Congress. The 1790 census asked for the name of the head of the family and the number of people in each household, including slaves.", "According to a history published by the U.S. Census Bureau in 2009, a question asking about citizenship status first showed up in 1820 and 1830. It was then asked of males ages 21 and older in 1870, and has appeared as a general question every decade since 1890, with the exception of 1960, when it was removed for unexplained reasons.", "What’s unique about the Trump administration’s proposal is that the question would be asked of all U.S. households.", "The last time the Census Bureau came close to asking every household about citizenship status was in 1950.", "That year, census workers knocked on doors to fill out the census by interviewing the residents of American households. They jotted down where each person was born and, in a follow-up question for those born outside the U.S., asked, \"If foreign born — is he naturalized?\"", "But because citizenship was the subject of a follow-up question, not every U.S. household was asked about it, said D. Sunshine Hillygus, professor of political science at Duke University and a former member of the Census Scientific Advisory Committee.", "\"Census workers asked about citizenship as a follow-up question only to those households who reported someone was born outside the United States,\" she said.", "A decade later, the 1960 census asked about place of birth but not about citizenship. Then, beginning in 1970, the Census Bureau started distributing two different questionnaires: a short form sent to most households and a long form sent to about 1 in 6 households. Only the long form asked about citizenship.", "In 2000, for example, respondents who got the long-form questionnaire were asked, \"Is this person a CITIZEN of the United States?\" But those who received the short form were only asked for the basics, such as name, date of birth, sex, and race.", "The 2010 census ditched the long form, using only a 10-question short-form questionnaire that did not ask about citizenship.", "That’s because the Census Bureau had also started collecting demographic and socioeconomic information through the American Community Survey, or ACS, which is sent every year to approximately 3.5 million households and does inquire about citizenship status.", "Meadows’ spokesman Ben Williamson said the congressman \"was talking about the first time the decennial census was without a citizenship question on either the long form or short form.\"", "But Meadows’ claim that 2010 was \"the first time that we didn’t ask a citizenship-type question\" gets the history wrong, since the Census Bureau asked about citizenship that year via the ACS, which effectively replaced the long form and was sent to a sample of households.", "\"The Census Bureau has long measured citizenship within the U.S. population (including in the Obama administration), but not as part of the decennial census of all U.S. households,\" Hillygus wrote in an email to PolitiFact North Carolina. \"So, the proposed citizenship question on the 2020 decennial census is a new addition to the census of all American households.\"", "\"We already have access to quality data on our citizens and non-citizens alike through the ACS,\" added Terry Ao Minnis, director of census and voting programs at Asian Americans Advancing Justice, a legal and civil rights group. \"In 2010, a citizenship question was asked on the ACS.\"", "It has been asked every year since.", "Meadows said, \"The previous administration under President Barack Obama really was the first time that we didn’t ask a citizenship-type question … for the first time in a century, a citizenship question was not included in 2010.\"", "That’s factually inaccurate. A citizenship question has not been asked of all U.S. households since 1950, when it was a follow-up for foreign-born respondents. In 2010, the Census Bureau sent a citizenship question to approximately 3.5 million households through the ACS.", "We rate this statement False.", "This story was produced by the North Carolina Fact-Checking Project, a partnership of McClatchy Carolinas, the Duke University Reporters’ Lab and PolitiFact. The NC Local News Lab Fund and the International Center for Journalists provide support for the project, which shares fact-checks with newsrooms statewide. To offer ideas for fact checks, email [email protected].", "Correction: A previous version of this fact-check mistakenly said \"Walker\" instead of \"Meadows\" in the third-to-last paragraph. Our ruling remains the same.", "C-Span, \"Commerce Secretary Ross on the 2020 Census,\" March 14, 2019", "United States Census Bureau, \"1790 Overview,\" accessed April 2, 2019", "United States Census Bureau, \"History: 2000 Census of Population and Housing,\" December 2009", "United States Census Bureau, \"Questions Planned for the 2020 Census and American Community Survey,\" March 2018", "United States Census Bureau, 1950 Census of Population and Housing, accessed April 2, 2019", "United States Census Bureau, 1960 Census of Population and Housing, accessed April 2, 2019", "United States Census Bureau, 1970 Census of Population and Housing, accessed April 2, 2019", "United States Census Bureau, United States Census 2000, long form questionnaire, accessed April 2, 2019", "United States Census Bureau, United States Census 2000, short form questionnaire, accessed April 2, 2019", "United States Census Bureau, United States Census 2010 questionnaire, accessed April 2, 2019", "United States Census Bureau, \"American Community Survey (ACS) Questionnaire Archive,\" accessed April 2, 2019", "NPR, \"FACT CHECK: Has Citizenship Been A Standard Census Question?\" March 27, 2018", "Snopes, \"When Did the United States Census Stop Asking About Citizenship?\" April 2, 2018", "PolitiFact, \"What you need to know about the Census’ citizenship question,\" March 28, 2018", "PolitiFact, \"2020 Census citizenship question awaits Supreme Court review,\" April 1, 2019", "Email interview with Terry Ao Minnis, director of census and voting programs at Asian Americans Advancing Justice, March 29, 2019", "Email interview with D. Sunshine Hillygus, professor of political science at Duke University and former member of the Census Scientific Advisory Committee, March 28, 2019", "Email interview with Ben Williamson, communications director for Rep. Mark Meadows, March 28, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]