["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Michelle Obama addresses the class of 2016 in her final commencement speech as first lady, June 3, 2016, at City College, part of the City University of New York. (AP)", "An image of former first lady Michelle Obama smiling as a man places a doctoral hood on her shoulders is spreading on social media.", "\"Dr. Michelle Obama — she put her doctorate studies on hold for the sake of her husband’s political career,\" a description above the photo says. \"Now she is done! Congratulations Dr. Obama!\"", "But the photo is old, and the facts are wrong.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The image —taken by Getty Images photographer Steve Sands — is from June 2016. It shows City University of New York Chancellor James Milliken conferring an honorary degree on Obama, the commencement speaker, when she was first lady.", "It was one of several honorary degrees Obama was awarded during her time as first lady.", "In 2012, when she gave the commencement speech at Oregon State University, she was awarded an honorary doctorate of public health in part for her work promoting healthy nutrition.", "In 2013, she received an honorary doctorate of laws at Bowie State University, where she gave another commencement address.", "Obama’s office did not immediately respond to PolitiFact’s questions about this post.", "But back in June, when a variation of this claim was circulating on social media — that she had decided to complete her \"PHD in law\" — a spokesperson for Obama told the Associated Press that she hadn’t earned any new degrees since leaving the White House.", "Obama earned a bachelor’s degree from Princeton University and a juris doctor degree from Harvard Law School before she returned to Chicago in 1988 and joined the law firm where she met Barack Obama.", "We found no evidence to support the claim that she recently earned a doctorate after her husband’s second term ended.", "We rate this post False.", "Facebook post, Feb. 8, 2021", "Popsugar, A-List Doctorates: Stars with honorary degrees, Aug. 10, 2016", "The Associated Press, Michelle Obama gives commencement speech in New York City, June 3, 2016", "The Associated Press, Michelle Obama didn’t recently earn a doctorate, June 26, 2020", "The White House, Michelle Obama, visited Feb. 8, 2021", "Oregon State University, First! June 21, 2012", "The Washington Post, Michelle Obama gives commencement address at Bowie State, challenges students to keep learning, May 17, 2013", "Jackson State University, Michelle Obama, JD, PhD, ‘16 former first lady of the United States, March 1, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]