["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "During a congressional hearing on hate crimes, conservative African American commentator Candace Owens said that the Republican Party never had a strategy of capitalizing on racism to lure voters.", "Owens said that black conservatives face criticism from the left because they \"have the audacity to think for ourselves and become educated about our history, and the myth of things, like the Southern switch and the Southern strategy, which never happened.\"", "The \"Southern strategy\" refers to efforts by the Republican Party to appeal to Southern white voters who were turned off by the Democratic Party advocating for civil rights.", "Historians disputed her statement, including Cornell professor Lawrence Glickman and University of Arkansas professor Angie Maxwell. Princeton historian Kevin Kruse called Owens’ statements \"utter nonsense.\"", "Owens is a spokesperson for the conservative nonprofit Turning Point USA and encourages black people to leave the Democratic Party (calling it \"Blexit\").", "Owens did not respond to our emailed request for comment. On Twitter, she said she was referring to the \"myth\" that the Republicans and Democrats in Congress switched parties.", "Kruse challenged her explanation, saying, \"Owens, predictably, points to the small number of congressmen who switched parties as ‘proof’ that the larger literature on the racial realignment is a myth — even though that isn't actually something historians and political scientists emphasize in the work on this.\"", "The Republicans’ Southern strategy has been documented for decades — including by Republicans who were a part of it.", "For this fact-check, we interviewed historians and reviewed news articles from the civil rights era.", "Joseph Alsop, an influential syndicated newspaper columnist, called it \"basically a segregationist strategy\" in a 1962 column.", "When Republican Barry Goldwater ran for president in 1964, his Southern surrogates played up the fact that he had just voted against the Civil Rights Act. That paid off in the Deep South where he won a handful of states, but he ultimately lost to Lyndon B. Johnson.", "By 1968, the Republicans fine-tuned their approach and packaged it in a way they could win, said Maxwell, the Arkansas professor and an expert on southern politics.", "Republican nominee Richard Nixon reached out to white Southerners by opposing school busing and promising that his administration would not \"ram anything down your throats\" and would appoint \"strict constructionist\" Supreme Court justices.", "The strongest evidence of the Southern strategy comes directly from Republicans at the time.", "That includes Clarence Townes, who served as director of the Minorities Division of the Republican National Committee in the 1960s. Harvard professor Leah Wright Rigueur wrote about Townes in her book \"The Loneliness of the Black Republican.\"", "When Nixon disbanded the division, Townes told reporters in 1970, \"There’s a total fear of what’s called the Southern strategy. Blacks understand that their wellbeing is being sacrificed to political gain. There has to be some moral leadership from the president on the race question, and there just hasn’t been any.\"", "In 1969, Nixon White House aide Lamar Alexander, who now represents Tennessee in the U.S. Senate, wrote about the Southern strategy in a memo following the unsuccessful Supreme Court nomination of Clement Haynsworth, who was opposed by civil rights groups.", "\"SOUTHERN STRATEGY — we flat out invited the kind of political battle that ultimately erupted when we named a Democrat-turned-Republican conservative from South Carolina. This confirmed the Southern strategy just at a time when it was being nationally debated,\" Alexander wrote.", "Nixon strategist Kevin Phillips openly discussed the Southern strategy in a newspaper article in 1973:", "\"If the New Washington liberal crowd could tear themselves away from Watergate ecstasy and the lionizing of Daniel Ellsberg for a little look-see below the Mason-Dixon line, they might glean a useful political insight, namely that the GOP 'Southern Strategy' seems to be rolling along — and rolling up local victories — just as if G. Gordon Liddy had never existed.\" (Ellsberg released the Pentagon papers in 1971 while Liddy was an FBI agent convicted of illegal wiretapping.)", "Phillips told the New York Times in 1970 that the Republicans were never going to get more than 10 to 20 percent of the \"Negro vote and they don't need any more than that.\"", "\"The more Negroes who register as Democrats in the South, the sooner the Negrophobe whites will quit the Democrats and become Republicans,\" he wrote. \"That's where the votes are. Without that prodding from the blacks, the whites will backslide into their old comfortable arrangement with the local Democrats.\"", "Ultimately, winning over white Southern voters required using coded language, as campaign consultant Lee Atwater, who worked on Reagan’s 1980 campaign, explained in an interview 1981. In audio, he can be heard describing how in 1954, a racial slur could be used to describe black Americans, but that \"backfired\" by 1968 — requiring a pivot to use more abstract language.", "\"So you say stuff like, uh, forced busing, states’ rights, and all that stuff, and you’re getting so abstract. Now, you’re talking about cutting taxes, and all these things you’re talking about are totally economic things and a byproduct of them is, blacks get hurt worse than whites,\" he said.", "Reagan used language such as \"states’ rights\" and \"welfare queens,\" which critics said was coded racist language.", "\"The partisan shift in the South from the 1960s to George W. Bush is the greatest partisan shift in all of American history,\" Maxwell said.", "In 2005, Republican National Committee chairman Ken Mehlman told the NAACP national convention in Milwaukee that using race as a wedge issue was \"wrong.\"", "\"By the ‘70s and into the ‘80s and ‘90s, the Democratic Party solidified its gains in the African American community, and we Republicans did not effectively reach out. Some Republicans gave up on winning the African American vote, looking the other way or trying to benefit politically from racial polarization. I am here today as the Republican chairman to tell you we were wrong.\"", "Owens said the Southern strategy is a \"myth\" that \"never happened.\"", "Efforts by the Republican Party starting in the 1960s to win over white Southern voters have been documented by scholars for decades.", "The strongest evidence that it happened comes from the Republicans who were part of that strategy. There are numerous instances of them talking about the approach in documents or interviews.", "We rate this statement False.", "C-Span, House judiciary committee hearing, April 9, 2019", "Alexander Nazaryan, Twitter video clip of Candace Owens, April 9, 2019", "Washington Post, Candace Owens’s presence turned a serious inquiry into a farce, April 9, 2019", "Washington Post, Candace Owens wrongly called GOP's Southern strategy a 'myth'; The conservative commentator said the well-documented Republican political effort \"never happened,\" April 9, 2019", "Washington Post, RNC Chief to Say It Was 'Wrong' to Exploit Racial Conflict for Votes, July 14, 2005", "Washington Post, A Repentant Harry Dent Will Follow the Lord, Aug. 22, 1981", "Nation, Exclusive: Lee Atwater’s Infamous 1981 Interview on the Southern Strategy, Nov. 13, 2012", "BuzzFeed, The Newest Star Of The Trump Movement Ran A Trump-Bashing Publication — Less Than Two Years Ago, May 15, 2018", "New York TImes, Clement Haynsworth Dies at 77; Lost Struggle for High Court Seat, Nov. 23, 1989", "Princeton Professor Kevin Kruse, Twitter thread, May 7, 2018", "Princeton Professor Kevin Kruse, Twitter thread, April 9, 2019", "Cornell Professor Lawrence Glickman, Tweet, April 9, 2019", "University of Arkansas professor Angie Maxwell, Tweet, April 9, 2019", "President Donald Trump, Tweet, May 9, 2018", "Kevin Phillips, Old southern strategy keeps rolling on, 1973", "New York Herald Tribune, The southern strategy is segregationist strategy, 1962", "New York Times, Nixon's Southern strategy, May 17, 1970", "The Neshoba Democrat, Transcript of Ronald Reagan's 1980 Neshoba County Fair speech, 1980", "Leah Wright Rigueur, The Loneliness of the Black Republican: Pragmatic Politics and the Pursuit of Power, 2016", "USA Today, Candace Owens fumes at Rep. Ted Lieu's use of her Hitler comments, April 9, 2019", "Tennessean, Controversial professor Carol Swain to retire from Vanderbilt, Jan. 23, 2017", "New York Times, The Southern Strategist, Dec. 30, 2007", "Hartford Courant, 'We just want to have a dialogue,' April 10, 2019", "New York Magazine, Candace Owens Says the GOP Southern Strategy 'Never Happened,' April 9, 2019", "The Root, Candace Owens Is Racist White America’s Black Friend and She Just Told Congress That White Nationalism Isn’t a Thing, April 9, 2019", "PragerU, Why did the Democratic south become Republican? July 24, 2017", "PolitiFact, No, the Democratic Party didn’t create the Ku Klux Klan, Oct. 24, 2018", "Interview, Lawrence Glickman, Cornell university history professor, April 9, 2019", "Interview, Angie Maxwell, University of Arkansas professor, April 10, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]