["The claim that a Hindu youth was beaten in West Bengal for hoisting a saffron flag atop his house is viral across social media platforms. A video of a young man tied to a tree and thrashed by a group of people is shared to support this narrative widely circulated with the caption, “This is the position of Hindus in West Bengal. This Hindu boy hoisted saffron flag atop his house. Forwarded by LT Col Dilip Kumar Havanur.”", "This is the position of Hindus in West Bengal. This Hindu boy hoisted saffron flag atop his house. Forwarded by LT Col Dilip Kumar Havanur.", "Posted by Rajesh Jain on Wednesday, 15 May 2019", "The same post has also been shared by a few individual users in Hindi, Telugu and Tamil.", "It is viral on Twitter as well.", "This is the position of Hindus in West Bengal.This Hindu boy hoisted saffron flag atop his house. @MamataOfficial The day is not too far when every Hindu will be crucified like this boy.#SaveBengalSaveDemocracy #BattleForBengal @TajinderBagga @KapilMishra_IND @MODIfiedVikas pic.twitter.com/PbrWyoERiZ", "— Real Chowkidar Deepak Kapur™ (@realkapur) May 16, 2019", "From what it seems, the clip is also doing rounds on WhatsApp.", "Alt News found that the same clip was viral last year as well with the identical claim that a Hindu youth was attacked in Bengal for hoisting a saffron flag atop his house. If one carefully listens, the mob can be heard conversing in Hindi, with the dialect of speech resembling that of people from Hindi-speaking states in Eastern India.", "The video actually depicts a case of flogging in UP’s Deoria. The police arrested six people for beating an 18-year-old after tying him to a tree. “The victim was assaulted as [he] had reportedly asked one of the accused to return Rs 1,500 he had lent, they [police] said,” according to The Indian Express.", "The incident had reportedly occurred on March 31, 2018, after which the same clip which is now viral with a false narrative was circulating at the time.", "West Bengal has been a prime target of misinformation in the ongoing election.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]