["“For those wondering if it’s worth impeaching him this time, it means he: 1) loses his 200k+ pension for the rest of his life 2) loses his 1 million dollar/year travel allowance 3) loses lifetime full secret service detail 4) loses his ability to run in 2024,” reads a January 8, 2021 Facebook post shared 14,000 times.", "The post contains a screenshot of a tweet that has since been deleted. More posts are available on Facebook here and here and on Instagram here and here.", "The president’s supporters stormed a session of Congress held on January 6 to certify Joe Biden’s victory in the 2020 election, which  Trump repeatedly and falsely claimed was plagued by widespread fraud, including in a speech shortly before the breach of the Capitol. The unrest led to the deaths of five people.", "Lawmakers later reconvened and voted to formally certify Biden’s win.", "The Democrat-controlled House of Representatives impeached Trump, for a second time, on January 13 with support from 10 Republicans on the charge of \"incitement of insurrection.\"", "The Republican-controlled Senate, however, is in recess until January 19, and its leadership says there is no way to rush through an impeachment trial before Biden takes over the following day.", "This means that Trump, who was acquitted in the Senate last year after his first impeachment, would not be forced out of office early.", "The US Senate website outlines the Constitutional process for impeachment. It gives the House of Representatives \"the sole Power of Impeachment\" and the Senate the power to “try all Impeachments.”", "The accused can only be convicted with a two-thirds vote of the Senate, whose composition in the new term will be evenly split between Republicans and Democrats. Vice-President Kamala Harris will have the power to cast a tie-breaking vote.", "Senator Chuck Schumer, who is expected to become the Senate majority leader, vowed that the chamber will proceed with a trial, even though Trump will no longer be in office.", "The Former Presidents Act spells out the benefits ex-leaders are entitled to after leaving office, but notes that those removed from office through impeachment are not covered.", "“As used in this section, the term ‘former President’ means a person… whose service in such office shall have terminated other than by removal pursuant to section 4 of article II of the Constitution of the United States of America,” it says.", "Matthew Dallek, professor at George Washington University’s Graduate School of Political Management, confirmed in an email: “Trump only loses those things -- the consequences only kick in -- if he is convicted in the Senate. My understanding is that just being impeached in the House without conviction in the Senate has no formal consequences.”", "Below, AFP Fact Check compares the social media claims with the law.", "“For those wondering if it’s worth impeaching him this time, it means he: 1) loses his 200k+ pension for the rest of his life,” the posts claim.", "The Former Presidents Act allots each ex-president a yearly allowance paid monthly that is equal to that of an executive department head -- the departments are listed here -- and the highest level does amount to more than $200,000 per year.", "Trump would still be entitled to the sum, according to University of Chicago Law School Professor Daniel Hemel.", "“A former president does not lose his post-presidential pension unless he is impeached and convicted *while in office.*  If he is convicted after January 20, he remains eligible for his pension,” Hemel said in an email.", "The social media posts also claim that an impeached Trump would lose a $1 million per year travel allowance following his presidency.", "The Former Presidents Act says up to $1 million is available “for security and travel related expenses” to former presidents as an alternative to Secret Service protection.", "A 2013 measure ensures “Secret Service protection for former Presidents and their spouses and children… except that protection of a spouse shall terminate in the event of remarriage.”", "Allan Lichtman, US history professor at American University, confirmed by email that Trump will retain lifetime Secret Service detail, should he choose to, regardless of whether he is impeached and removed.", "University of Utah political science Assistant Professor James Curry agreed.", "“My understanding is that an impeached and removed president loses their former-president benefits, with the exception of the security detail, which they keep,” he said in an email.", "The penalty for an impeached official upon conviction is removal from office, and social media posts claim that, if impeached, Trump “loses his ability to run in 2024.”", "However, that penalty cannot be imposed upon a president without conviction in the Senate and a subsequent extra vote barring him from office.", "The Constitution says the following:", "“Judgment in Cases of Impeachment shall not extend further than to removal from Office, and disqualification to hold and enjoy any Office of honor, Trust or Profit under the United States: but the Party convicted shall nevertheless be liable and subject to Indictment, Trial, Judgment and Punishment, according to Law.”", "The Senate website adds: “In some cases, the Senate has also disqualified such officials from holding public offices in the future.”", "Trump has talked of running again in 2024. He is now the only president in US history to be impeached twice.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]