["About this rating", "Jack Owoc, the CEO of Vital Pharmaceuticals, which manufactures the Bang Energy brand of energy drinks, is a supporter of President Donald Trump; Vital Pharmaceuticals donated $250,000 to a pro-Trump super PAC in March 2019.", "A portion of every Bang Energy purchase does not go directly to Trump's re-election efforts.", "On July 31, 2019, Axios published a report about the fundraising efforts of pro-Donald Trump super PAC America First Action and its affiliated 501(c)(4) nonprofit, America First Policies. The news outlet found that these organizations had jointly raised more than $17 million during the first six months of 2019, thanks in part to donations from PAC Chairwoman Linda McMahon ($1 million), Chicago Cubs Co-Owner Marlene Ricketts ($500,000), and the company Vital Pharmaceuticals Inc. ($250,000).", "The donation from Vital Pharmaceuticals, the company that manufacturers Bang Energy, caught the attention of the website Popular Information. On Aug. 1, that website elaborated on Axios' findings in an article entitled: \"Every can of (Bang Energy) drink helps Trump get re-elected\":", "Every can of this energy drink helps Trump get re-elected", "If you've ever spent any time on Instagram, you've probably run into one of the ubiquitous sponsored posts promoting Bang energy drink. In the ads, models in garish Bang-branded gear promote the benefits of drinking Bang or just try to look appealing while posing with a Bang beverage.", "These ads are working. Bang's sales grew over 780% in 2018.", "One thing these ads don't tell you: Every time you buy a can, you help Trump get re-elected.", "The notion that every purchase of a BANG Energy drink helps fund President Trump's 2020 re-election campaign reached a wider audience a few days later when the following message was posted to Twitter:", "PSA: (just found this out) everyime you buy a BANG, a portion of your $$ is going towards the re-election fund campaign of Donald Trump. I know these taste ? af, but I can’t be supporting a company that supports children in cages, no change on guns laws, etc. https://t.co/L1ulgP6val", "— ????? ??????$? (@Yungmdot) August 4, 2019", "Both the Popular Information article and the aforementioned tweet exaggerated Bang's connection to the Trump campaign. Vital Pharmaceuticals did donate $250,000 to a pro-Trump super PAC in March 2019. But that is not the same as Bang Energy donating a portion of every product sold to Trump's re-election effort.", "Bang has no advertising campaign promising to donate a portion of sales to fund Trump's re-election. Furthermore, the Pharmaceuticals donation appears to have been for one time only. We found no record of that company donating to any pro-Trump super PACs during the 2016 presidential election. Also, no evidence exists that this donation was directly tied to Bang Energy sales, now or in the future.", "That said, Vital Pharmaceuticals and Bang Energy founder and CEO Jack Owoc has been a vocal supporter of the president:", "@realDonaldTrump Your brilliance has fueled the most epic turn of events in the history of politics. God bless the inevitable – Trump wins!", "— Jack Owoc (@BangEnergyCEO) March 14, 2016", "He is also friends (or at least friendly) with President Trump's son Don Jr. and his girlfriend and television personality Kimberly Guilfoyle. Trump Jr. tagged Owoc in a March 2019 Facebook post about a great night of fishing:", "Owoc also celebrated Guilfoyle's birthday with Trump Jr. at Mar-a-Lago:", "Happy Birthday @kimberlyguilfoyle!! ?❤️ You are beautiful, courageous, and selfless! I am so proud to be your friend! ???It was such an incredible honor to be invited to such an exclusive and beautiful event at @themaralagoclub! ✨ This was literally the best day of my life, being in the presence of our fearless leader, President Donald Trump @realdonaldtrump, First Lady Melania Trump @flotus, Ivanka Trump @ivankatrump, Donald Trump Junior @donaldjtrumpjr and our incredible friends @kimberlyguilfoyle @realdrgina @johnwloudon @kayajones @globalstallion! ??❤️ Love you guys and God Bless America! . . #maralago #happybirthday #maga #americafirst #america #westpalmbeach #leadership #kimberlyguilfoyle", "A post shared by  BANG ENERGY | Meg Liz Owoc (@megliz.owoc) on Mar 10, 2019 at 6:24pm PDT", "In sum, Owoc, the CEO of Vital Pharmaceuticals and Bang Energy, is a supporter of President Trump. Vital Pharmaceuticals donated $250,000 to a pro-Trump super PAC in March 2019. However, no evidence exists that a portion of every Bang Energy drink sale supports Trump's reelection efforts.", "Perano, Ursula and Jonathan Swan.   \"Exclusive: Pro-Trump Outside Groups Jointly Raise $17.8 Million.\"\r\n    Axios.   31 July 2019.", "Lyons, Jenna.   \"Trump's Re-Election Campaign Funded by Shady Florida Energy-Drink Hawker.\"\r\n    Orlando Weekly.   2 August 2019.", "Popular Information.   \"Every Can of This Energy Drink Helps Trump Get Re-Elected.\"\r\n    1 August 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]