["In a statewide election year when both parties are courting Florida’s growing Hispanic vote, the Legislature is debating giving in-state college tuition to young illegal immigrants known as \"Dreamers.\"", "Similar efforts have failed in the past decade in Tallahassee. But this year the proposal may have the support of Gov. Rick Scott, who has said he will consider the bill if it also contains a provision he wants, one that is unrelated to immigrants: prohibiting universities from raising tuition above the rate set by the Florida Legislature.", "Democrats have portrayed Scott as anti-Hispanic after supporting an Arizona-style immigration law in 2010 and vetoing a bill that would have given Dreamers driver's licenses in 2013. Scott’s campaign also faced accusations by his former campaign finance chairman, Mike Fernandez, that some campaign staffers made fun of Mexican accents. In an April 9 press release, the Florida Democratic Party said the in-state tuition this year is election-year pandering.", "The Republican Party of Florida fired back in an email with their own attack against Charlie Crist, the Democratic frontrunner for governor:", "\"Yesterday, Florida Democrats said it was time to ‘do what is right’ for Florida’s Hispanic community, regarding legislation that is moving through the Senate giving in-state college tuition to children brought to the U.S. illegally by their parents,\" April 10 the state party stated. \"So where does the Florida Democratic Party’s own candidate stand on the issue? In 2006, Charlie Crist opposed in-state tuition for illegal immigrants.\"", "We wanted to check Crist’s position on in-state tuition for illegal immigrants in 2006 -- and in the following years.", "First, a note about Hispanics, who represented about 14 percent of voters in Florida as of 2012. Hispanics lean Democratic but past results show their vote in the governor’s race could be competitive. Though President Barack Obama overwhelmingly won the state’s Hispanic vote in 2012, Hispanics narrowly backed Scott in 2010 according to exit polls, though there was a large margin of error.", "Dreamers bill in 2006", "The state party email cited a 2006 Miami Herald article about Crist when he was attorney general.", "According to the story, Crist said state lawmakers \"did the ‘right thing’ earlier this year when they rejected a bill allowing children of illegal immigrants to pay the same tuition rates as Florida residents.\"", "That year a proposal to give certain Florida residents who were illegal immigrants in-state tuition divided Republican legislators and drew opposition from Senate President Tom Lee. Ultimately, the proposal failed. (Then-Gov. Jeb Bush said he supported giving in-state tuition to those children if they had lived in Florida at least two years, but he also said it wasn’t the year to deal with it, so the controversial provision was removed from an education bill.)", "A spokeswoman for the Republican Party of Florida didn’t point to any additional statements by Crist.", "We went in search of other statements by Crist about giving in-state tuition to children of illegal immigrants and found little else. It did not appear that any bills that would grant in-state tuition to Dreamers reached Crist’s desk while he was governor during sessions between 2007 and 2010.", "An August 2006 article in the Tampa Bay Times included a one-word \"yes\" or \"no\" answer from candidates for governor to several questions, including this one: \"Should we allow the children of illegal immigrants to pay in-state tuition at our universities?\"", "The answer for Crist: No.", "Dreamers bill in 2014", "Now running as a Democrat, Crist supports in-state tuition for illegal immigrants.", "\"We must immediately pass legislation that allows the children of undocumented parents to attend Florida colleges and universities at in-state tuition levels,\" Crist says on the immigration page of his campaign website. \"It simply isn’t fair to punish children of undocumented parents.\"", "This year’s bill has the backing of House Speaker Will Weatherford, R-Wesley Chapel, and passed the House 81-33 in March. In the Senate, a similar measure passed in committees but hasn’t received a vote by the full Senate yet.", "The bill has the support of many public universities in Florida, and other Republican governors have signed similar measures, including Gov. Rick Perry of Texas and Gov. Chris Christie of New Jersey.", "A footnote about Scott and the Dreamers bill this year: Scott has expressed support for the Senate version of the bill which includes getting rid of the tuition differential that allows universities to raise rates beyond what the Legislature sets. The House version doesn’t include that provision.", "When asked about the House bill April 1, Scott reaffirmed his support for the Senate version.", "\"I'm going to work with the Senate and the House to make sure we have a bill that lowers tuition for all Floridians,\" he said.", "Our ruling", "The Republican Party of Florida said in an email, \"In 2006, Charlie Crist opposed in-state tuition for illegal immigrants.\"", "The attack doesn’t mention the fact that Crist now supports in-state tuition for immigrants here illegally. But the statement about 2006 is correct: We found two newspaper articles that stated Crist, who was running as a Republican for governor, opposed in-state tuition for Dreamers.", "We rate the statement True.", "Republican Party of Florida, \"Charlie Crist opposed in-state tuition for illegal immigrants,\" April 10, 2014", "Gov. Rick Scott office press release, \"Gov. Scott applauds judiciary committee on supporting bill to keep college affordable,\" April 1, 2014", "Florida Democratic Party press release, \"FDP statement on in-state tuition for Dreamers,\" April 9, 2014", "PewResearch Hispanic Trends Project, \"Latino voters in the 2012 election,\" Nov. 7, 2012", "PolitiFact, \"Jeb Bush says Rick Scott won Hispanic vote, bucking national trend,\" Nov. 15, 2010", "Miami Herald, \"Governor signs college aid bill,\" June 2, 2006", "Miami Herald, \"Cuban Americans courted,\" June 10, 2006", "Tampa Bay Times, \"No Jeb? Hispanics wait to be wooed,\" Aug. 7, 2006", "Sun-Sentinel, \"A conversation with Gov. Rick Scott,\" April 21, 2013", "Miami Herald, \"Gov. Rick Scott backs in-state tuition for undocumented students,\" March 12, 2014", "Miami Herald op-ed by Dario Moreno, \"Rick Scott’s support among Hispanics at risk,\" April 3, 2014", "Interview, Susan Hepworth, spokeswoman Republican Party of Florida, April 10, 2014", "Interview, Kevin Cate, spokesman Charlie Crist campaign, April 10, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]