["About this rating", "On 7 February 2018, anti-Muslim blogger Pamela Geller posted a video on her web site GellerReport.com meant to demonstrate the criminality of Muslim migrants — but it backfired.", "The video, showing men destroying a car with baseball bats, was included in Geller's \"Morning News Report\" newsletter and uploaded to her YouTube channel.", "As progressive media watchdog Media Matters pointed out, not only has the video been online for years, it quite clearly does not show an act of migrant violence. There is camera equipment visible in the frame because it was originally taken by a bystander watching the filming of the 2015 Italian drama \"Mediterranea.\" The video has been debunked in multiple languages, including Italian:", "After being informed that it was misleading and pulling it from YouTube, Geller included the following non-apology in her post:", "UPDATE: Left-wing propaganda sites and Muslim supremacist terror-tied orgs have taken issue with one of the videos I previously ran saying it wasn’t real. The fact is there are thousands of videos exposing Muslim migrant violence and destruction that elicit no response from the enemedia. Left-wing propaganda sites and Muslim supremacist terror-tied orgs continue to ignore those videos and the widespread horror these migrants have wrought on the countries they’ve invaded.", "True to form, the remainder of Geller's post entitled \"WATCH: MIGRANTS IN ITALY\" contains several other videos completely lacking context or explanation. One appears to simply show an altercation on public transit, while another purportedly shows men trying to abduct a woman (who is rescued by a bystander). There is no evidence either of these incidents involve migrants, or that they even took place in Italy to begin with.", "Geller regularly disseminates false or unverified information. In December 2015, for example, Geller falsely claimed Muslims were commandeering Christmas Eve and turning it into a Muslim holiday.", "As RationalWiki points out, Geller is hardly a reliable source, and should be viewed with a healthy dose of skepticism — for example, she's a longtime birther who believes former United States President Barack Obama is secretly a Muslim, and pushes crank conspiracy theories, such as Obama's real father is Malcolm X.", "Despite her track record for promoting blatant race-baiting disinformation, she has managed to be influential:", "Pamela Geller is the epically insane writer who blogs at Atlas Shrugs (named after Ayn Rand's Atlas Shrugged) and at WND. She is well-known for her ridiculous vlogs, her hatred of anyone looking like a Muslim and her ability to post screeds occasionally so incoherent that it makes you wonder if she's got what might be politely termed a \"problem\".", "Geller's latest escapade is not without consequence. It comes amid rising anti-immigrant sentiment in Italy, and an upcoming election in which refugees and asylum-seekers are simmering issues that have already had violent consequences. Former Prime Minister Silvio Berlusconi, who has been barred from running for public office after being convicted of tax fraud, pledged that if the political coalition he backs takes office he will deport 600,000 people. Just days before that, a far-right activist shot and wounded six people of African origin in Macerata, a city northeast of Rome.", "An ongoing refugee crisis in Europe, driven in part by wars in countries like Syria and Afghanistan, has led extremists and white supremacists to falsely claim that the newly arrived are causing massive crime waves and Muslim \"no-go zones\" in places like Sweden, the Netherlands and Germany. Although these claims are persistent thanks to fake news and disinformation generators like Geller, they remain unfounded.", "Mast, Nina. \"Pamela Geller's Anti-Migrant Video is a Hoax. There's Even a Complete Film Crew in the Shot.\"\r\n  Media Matters for America. 12 February 2018.", "Gattinara, Pietro Castelli. \"An Italian Neo-Fascist Shot 6 immigrants. So Why Won’t Italy’s Political Parties Condemn Xenophobia?\"\r\n  The Washington Post. 9 February 2018.", "Giuffrida, Angela. \"Berlusconi Pledges to Deport 600,000 Illegal Immigrants From Italy.\"\r\n  The Guardian. 5 February 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]