["The nine-second video was published here on Facebook on December 2, just as Typhoon Kammuri made landfall in the Philippines.", "The storm killed at least 13 in the Philippines and forced a rare shutdown of the international airport in the capital Manila, AFP reported here on December 5.", "The video, viewed more than 142,000 times since it was posted, shows trees nearly being uprooted by extreme winds. The post is captioned: “Bohol now!!”", "Bohol, which is roughly 900 kilometers south of Manila, can be seen on Google maps here.", "Below is a screenshot of the misleading post:", "The claim is false; the video has circulated online since 2018 in reports about Typhoon Mangkhut lashing Hong Kong.", "Reverse image searches on Google of keyframes from the video extracted using InVID, a video verification tool, and subsequent keyword searches, found this extended video showing several clips of Typhoon Mangkhut published by İhlas Haber Ajansı (IHA), a Turkish news agency.", "The video in the misleading posts corresponds to the first nine seconds of the IHA video, which has a Turkish-language title that translates to English as: “The toll from Typhoon Mangkhut which hit China is rising: 4 dead, 200 injured”.", "The IHA report adds: “HONG KONG, HONGKONG/ 17 September 2018”.", "Its summary translates to English as: “After killing 65 people in the Philippines, Typhoon Mangkhut hit China's Hong Kong region and southern states, leading to the deaths of 4 people and injuring over 200 people.”", "Below is a screenshot of the IHA page containing the video:", "Below is a screenshot comparison showing the video in the misleading posts (L) and the IHA video (R):", "The Hong Kong Observatory reported that Typhoon Mangkhut brought ferocious winds and storm surges to Hong Kong, toppling more than 60,000 trees.", "By contrast, situational reports released by the Philippine government during Typhoon Kommuri show that Bohol was not in the storm’s direct path.", "There was no tropical cyclone signal issued for the province on December 2, the day the video in the misleading posts was published, as shown in reports issued here and here by the Philippine Disaster Risk Reduction and Management Council.", "Below is an AFP graphic showing Typhoon Kammuri’s path, with Bohol circled on the map on the left:", "Bohol was placed on tropical cyclone signal no. 1 on the morning of December 3, as shown in this report.", "Signal no. 1 is the lowest public warning, which indicates the possibility of 30-60 kph winds in at least 36 hours, according to this Philippine weather bureau page. Potential damage to vegetation includes tilting or downing of some banana plants and broken twigs of small trees.", "By the night of December 3, Bohol was no longer listed as an area under a tropical storm signal.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]