["Some social media users are linking the Texas power outages to one of President Joe Biden's recent executive orders regarding a policy put in place by his predecessor.", "A lengthy Feb. 18 Facebook text post claims \"Biden handed the grid to China\" through his Keystone Pipeline executive order and that one of Biden's purported engineers who is supposed to be working on the power situation in Texas worked as an engineer in China for five years.", "\"Millions of Texas families are pulling Biden’s EO’s this morning and found something buried in the Keystone Piepline (SIC) EO,\" the post reads, claiming that the president lifted the security on the U.S. power grid for 90 days the same day he shut down the Keystone Pipeline.", "Accompanying the post is an image and biography of Yunzhi Cheng, a purported senior planning engineer at the Electrical Reliability Council of Texas.", "The user includes a link to the Federal Register pointing to one of former President Donald Trump's previous executive orders that \"secured our power grid by giving China no access.\" Also included is an invalid White House page and an April 2014 document from the Department of Energy titled \"Large Power Transformers and the U.S. Electric Grid.\"", "USA TODAY reached out to the Facebook user for comment.", "Fact check: Sublimation, not government conspiracy, explains snowmelt videos", "On his first day in office, Biden signed the \"Executive Order on Protecting Public Health and the Environment and Restoring Science to Tackle the Climate Crisis.\"", "The directive was part of a series of executive orders that aim to address climate change and roll back environmental and energy policies put in place by the Trump administration.", "The order directs federal agencies and executive departments to review existing regulations, revokes the March 2019 construction permit of TC Energy Corporation’s Keystone XL oil pipeline and places a temporary moratorium on oil and gas leases at the Arctic National Wildlife Refuge.", "Prior to this, on May 1, 2020, Trump signed an executive order declaring foreign cybersecurity threats to the U.S. electricity system a national emergency. It allowed the Energy secretary to prohibit acquisition, importation, transfer or installation of power equipment. Trump's order defined bulk power equipment as control rooms, power plants, nuclear reactors, capacitors, large generators and more.", "The executive order does not mention any countries specifically. However, a 2019 Worldwide Threat Assessment by then-U.S. Director of National Intelligence Dan Coats said China, Russia and other countries were using cyber methods to spy on U.S. infrastructure, Reuters reported.", "In December 2020, Energy Secretary Dan Brouillette issued a prohibition order designed to \"reduce the risks that entities associated with the People’s Republic of China pose to the Nation’s bulk-power system.\"", "Biden's Jan. 20 executive order places a 90-day suspension on Trump's bulk-power system policy and directs the secretary of energy to review Trump's order and consider whether a replacement order should be issued.", "Fact check:Viral statement claiming to come from Texas power company is fake", "Biden's executive order only temporarily suspends Trump's May 1 order, and it does not mean China can access U.S. electrical grids for 90 days.", "What the suspension does do, according to the U.S. Department of Energy, is prohibit providers from installing the equipment outlined in Brouillette's December prohibition order.", "During the 90-day suspension, \"the Department’s engagements with utilities on energy security issues will continue, and our commitment to mitigating threats affecting critical defense facilities and the electric sector remains unchanged,\" reads a press release from the Department of Energy.", "Further, the Electric Reliability Council of Texas, a nonprofit corporation, manages the network of electrical suppliers, the Texas Interconnection, which serves 90% of the state, according to Scientific American.", "A search of Yunzhi Cheng, the man mentioned in the post, results in an inactive Linkedin profile that said he was the supervisor of operations stability analysis at ERCOT.  USA TODAY reached out to ERCOT for comment.", "Fact check: Price of oil has not more than doubled during Biden presidency", "There are many factors including extreme energy demand and overloaded frozen utility plants that led to the statewide power outages in Texas, USA TODAY reported.", "The U.S. is divided into three electrical grids. One covers the eastern part of the country, another the western part, and then the third is the Texas grid, which covers almost the entire state.", "Daniel Cohan, an associate professor of civil and environmental engineering at Rice University told USA TODAY that the high demand for energy amid the recent winter storm outpaced the energy supply needed to heat and power homes. A combination of natural gas, some coal and a nuclear power plant failed to meet demand, according to Cohan.", "\"Plants are optimized to run under our typical and our extreme summer conditions, but they aren't as well prepared and engineered for extreme cold,\" he said.", "The claim that President Joe Biden's executive order on the climate crisis includes giving China control of the U.S. power grid is FALSE, based on our research. Biden's executive order put in place a 90-day temporary suspension of Trump administration orders so officials may evaluate and review them. The suspension prohibits utility providers from installing equipment outlined in the former energy secretary's prohibition order and does not give China access to the power grid. Further, the Texas power grid is operated by the Electric Reliability Council of Texas.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]