["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In November 2020, an image supposedly showing an email sent by the Trump reelection campaign offering supporters of U.S. President Donald Trump tickets to his inauguration in the White House Rose Garden started circulating on social media.", "This image struck many viewers as odd for a few reasons: Presidential inaugurations have been held in front of the U.S. Capitol, not in the Rose Garden, since the 1980s. And, more important, Trump did not win the 2020 election. The 2021 inauguration will feature President-elect Joe Biden.", "While Trump has waged a legal effort to contest the results of the 2020 election, he is not (as far as we know) planning on hosting an alternative inauguration. The above-displayed email is fake and did not originate with his campaign.", "Members of the Snopes staff receive Trump's campaign emails, and we have not received any emails offering tickets to Trump's inauguration in the Rose Garden. The website politicalemails.com, which archives the emails of political campaigns, also shows no record of this email. The Twitter account @TrumpEmail also reported that they were unaware of such an email being sent out from the Trump campaign, writing:", "I've had several people ask me about this screenshot.", "I haven't received it, the offer is unrealistic, and the formatting seems off. It looks like someone tried to match the design of the campaign's news releases, not their fundraising emails. I believe it’s fake.", "In addition to the fact that nobody appears to have actually received this email, a few artifacts of digital fakery are seemingly evident in the above-displayed image.", "For one, the \"Trump / Pence\" text at the top is of a lower resolution compared to the text in the main body. This wouldn't happen if the above-displayed image was a genuine screenshot of a campaign email. It could happen, however, if someone took a screenshot of a genuine email, saved it, uploaded it to an editing program, and then altered the main body text.", "It's also suspicious how the gray box that encircles the \"All Donations of $50 or More...\" text fades away on the right-hand side. This, again, appears to be the result of digital editing. Whoever created this fake email appears to have run out of space (the word inauguration extends too far to the right) and decided to erase a part of this box instead of reformatting the text.", "We reached out to the Trump campaign for comment, but have yet to receive a response. We will update this article if more information becomes available.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]