["A video of idols, supposedly of Ganesh, kept on the roadside near Sabarmati riverfront in Ahmedabad, Gujarat is doing rounds on social media. Facebook user Padmini Natarajan claimed that people were not allowed to immerse the idols, therefore, they chose to abandon them on the roads.", "This is Sabarmathi river front of Ahmedabad . Ganpathi visarjan not allowed . So people left them on footpath. So much for God!", "Posted by Padmini Natarajan on Saturday, 7 September 2019", "Alt News has received several requests on its official app to verify the claim circulating along with the video. Twitter handle @iScrew alleged that this video depicted scenes of the recent Ganesh Chaturthi.", "Leave moon alone, look at what we’re doing to earth. If this continues, environment too will crash like #Chandrayaan2 #GaneshChaturthi pic.twitter.com/RTZT7nxzrl", "— TheAgeOfBananas (@iScrew) September 7, 2019", "This video shared without proper context was quote-tweeted by several users on social media believing it to be ‘ill-treatment’ shown to the deity and an ‘insult’. Zainab Sikander, a journalist associated with The Print, also tweeted the video and opined that people who immerse idols in natural water bodies should use ‘eco-friendly, biodegradable (non-toxic paint) idols’.", "Rebel AAP MLA Alka Lamba, who has reportedly joined the Congress party, tweeted the video with a message, “क्या आज इन मूर्तियों को अपने घर ले जाने वाला कोई नहीं ???”.", "#GaneshChaturthi #GanpatiBappaMorya… क्या आज इन मूर्तियों को अपने घर ले जाने वाला कोई नहीं ??? pic.twitter.com/omqwjmzhR5", "— Alka Lamba – अलका लाम्बा (@LambaAlka) September 9, 2019", "Alt News found that while the video is from Ahmedabad’s Sabarmati riverfront, it is neither recent nor is the accompanying claim true. The idols placed on the roadside are of Goddess Dashama and this took place at least a month ago.", "On August 11, Ahmedabad Municipal Corporation (AMC) commissioner Vijay Nehra had tweeted about the initiative taken by the citizens to keep Sabarmati river clean by not immersing the idols of Dashama in the river. Posting the images of idols left by the citizens on the road, Nehra said, “Instead of immersing Dashama idols in the river, they have respectfully left them on the banks!!”.", "Something amazing is happening in #Ahmedabad today.", "Ordinary citizens have decided to keep #Sabarmati river clean.", "Instead of immersing Dashama idols in the river, they have respectfully left them on the banks!!", "Thousands and Thousands of them. Unbelievable change 🙏 pic.twitter.com/t5f0yh9ywr", "— Vijay Nehra (@vnehra) August 11, 2019", "He further added that the corporation was working on the behavioural change from several months under the aegis of the ‘Swachh Sabarmati’ campaign.", "We had been working on this behaviour change for several months", "Since early morning today, security had been intensified. Several artificial ponds were also created. #SwachhSabarmati campaign has clearly helped change habits", "CHANGING HABITS FOR CHANGING CITIES pic.twitter.com/NK87HTYxyG", "— Vijay Nehra (@vnehra) August 11, 2019", "While the video is at least a month old, Nehra took to Twitter today urging the citizen of Ahmedabad city to also not immerse idols of Lord Ganesh on September 12 i.e the day of Ganesh Visarjan or Anant Chaturdashi. He informed that there are more than 61 kunds (immersion ponds) to immerse these idols without polluting the river.", "વ્હાલા અમદાવાદીઓને મારી નમ્ર અપીલ…#સ્વચ્છસાબરમતી#સ્વચ્છઅમદાવાદ pic.twitter.com/EM6IpNwWo4", "— Vijay Nehra (@vnehra) September 9, 2019", "However, according to a DNA report published on September 3, 2019, some idols of Ganesh were immersed in the river due to the lack of immersion ponds near the riverfront. Moreover, the standing committee chairman Amul Bhatt said that while immersion ponds were still under construction, 10 artificial ponds were made available to the devotees. “Finding the artificial immersion ponds still under construction, devotees who came to immerse idols on the first day had to turn to Sabarmati for the ritual”, stated the report.", "Ahmedabad Municipal Corporation is actively urging citizens to not immerse idols of deities in the river in order to reduce water pollution. The initiative taken by AMC is misrepresented on social media. A month-old video shot when Goddess Dashama’s idol was placed on the roadside near Sabarmati riverfront under an initiative led by the Municipal corporation of Ahmedabad city was shared as Ganesh idols disposed by citizens. This was an attempt to portray people as irresponsible and insensitive toward the environment when, in fact, the opposite was true.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]