["President Donald Trump delivers the 2019 State of the Union address on Feb. 5, 2019. (AP)", "Does President Donald Trump’s legacy include legislation to rid marine systems of millions of tons of plastic bottles, broken fishing gear and more?", "\"Trump signs bill to clean millions of tons of garbage from world’s oceans,\" the headline of the article posted on Facebook on Jan. 30 says.", "The story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The link in the post leads to an Oct. 12 story in Neon Nettle, an online publication \"that challenges the official narrative in the general news cycle,\" according to its website.", "The story says Trump signed the Save Our Seas Act of 2018 and \"extended and expanded the program to clean up man-made waste by boosting international cooperation on removing debris from the planet’s oceans.\"", "It cites another story published on the website of a Fox News affiliate in El Paso. The station reported the Save Our Seas Act \"reauthorizes and amends the Marine Debris Act to promote international action to reduce marine debris.\"", "A spokesman for National Oceanic and Atmospheric Administration didn’t respond to PolitiFact’s email about the Facebook post, but we got a reply from a spokeswoman for Ocean Conservancy, a nonprofit that supported the Save Our Seas Act and celebrated its passage. There are millions of tons of debris in the world’s oceans; an estimated eight million metric tons of plastic find their way there each year, according to Ocean Conservancy.", "Is it accurate, we asked, to summarize the legislation as a bill \"to clean millions of tons of garbage from the world’s oceans.\"", "\"Not exactly,\" said Jordana Merran, communications manager for the group. Rather, the law Trump signed reauthorizes \"the longstanding amount of $10 million annually\" for NOAA’s Marine Debris Program, she said.", "\"The program does support, among other efforts, Ocean Conservancy’s International Coastal Cleanup, in which volunteers collect millions of pounds of garbage off beaches and waterways annually across the globe. However, many entities provide financial support for the ICC.\"", "According to a transcript of Trump’s remarks as he signed the bill on Oct. 11, he said more than 8 million tons of garbage is dumped into oceans every year. The Save Our Seas Act \"will help address this problem,\" he said. \"We also are strengthening that up to improve waste management overseas and clean up our nation’s waters.\"", "The legislation, which was sponsored by U.S. Sen. Dan Sullivan, R-Alaska, and cosponsored by Sen. Sheldon Whitehouse, D-Rhode Island, had bipartisan support. It doesn’t direct the country to clean millions of tons of garbage from marine environments.", "Rather, the bill reauthorizes and amends the Marine Debris Act \"to promote international action to reduce marine debris, and for other purposes,\" according to the law. But it’s not specific about how much debris, or how it should be cleaned up. For example, in cases of a \"severe marine debris event\"—when natural disasters like tsunamis or storms cause unusually large amounts of marine debris—the United States would \"assist in the cleanup and response required by the severe marine debris event,\" the bill says. It also notes the president should \"support research and development on systems and materials that reduce\" the amount of solid waste in the marine environment, as well as work with other countries that discharge waste into the water to develop \"mechanisms to reduce such discharges.\" And there are other suggestions in the law, such as studying of the economic impacts of marine debris.", "The Marine Debris Program, meanwhile, was established in 2006 to \"identify, determine sources of, assess, prevent, reduce, and remove marine debris and address the adverse impacts of marine debris on the economy in the United States.\" But it also doesn’t specify how many tons of debris the country will clean, in the words of the Facebook post.", "There are millions of tons of garbage in the world’s oceans and President Donald Trump signed a bill reauthorizing a program aimed in part at removing marine debris. But the law doesn’t mandate removing a certain amount of garbage from the water.", "We rate this claim Half True.", "Facebook post, Jan. 30, 2019", "Neon Nettle, \"Trump signs bill to clean millions of tons of garbage from the world’s oceans,\" Oct. 12, 2018", "KFox14, \"President Trump signs Goodlatte Music Modernization and Save Our Seas acts,\" Oct. 11, 2018", "The White House, Remarks by President Trump at signing of S. 3508, the \"Save Our Seas Act of 2018,\" Oct. 11, 2018", "S.3508 - Save Our Seas Act of 2018", "Ocean Conservancy blog, \"Save Our Seas Act signed into law,\" Oct. 11, 2018", "The Associated Press, \"Trump signs Save Our Seas Act into law,\" Oct. 13, 2018", "Email interview with Jordana Merran, communications manager, Ocean Conservancy, Feb. 7, 2019", "NOAA Marine Debris Program, accessed Feb. 6, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]