["About this rating", "In December 2019, Rowling expressed support for Maya Forstater, a woman who had not been given a new contract by her employer, after consistently and repeatedly expressing trans-skeptical and trans-exclusionary views, including \"Transwomen are men,\" and the view that a trans woman is a man even if she has a legally binding Gender Recognition Certificate in the U.K. In June 2020, Rowling wrote about her \"concerns\" over several aspects of the \"trans rights movement,\" and her rejection of what she presented as an attempt to \"erode ‘woman’ as a political and biological class.\"", "Although Rowling's support for Forstater was relevant and significant, and although the views she later expressed about the importance of biological sex and her concerns over elements of the \"trans rights movement\" were offensive to some observers, Rowling has not articulated a personal antipathy towards transgender people, as such. It is also relevant that Rowling did not make any comment whatsoever on trans issues until after June 2019, when the claim at hand was published.", "In late June 2019, a blog post went viral on social media after it claimed that the English writer and author of the Harry Potter book series, J.K. Rowling, had \"confirmed [her] stance against transgender women.\"", "The author of the piece, Phaylen Fairchild, wrote: \"It’s been a long time coming, but finally we have a definitive answer. J.K. Rowling is a TERF [trans-exclusionary radical feminist].\" The post listed what Fairchild presented as several pieces of evidence she believed amounted to proof of Rowling's personal views on trans issues, especially in the context of an ongoing, and at times bitter, debate about such issues in the United Kingdom.", "The most recent piece of evidence according to Fairchild, and the one that purportedly allowed for \"confirmation\" of Rowling's personal views, was Rowling's having followed the Twitter account of Magdalen Berns, a YouTuber whom Fairchild characterized as having transphobic views: \"Finally, we have some confirmation of Rowling’s stance against the transgender community. She has followed one of the most hateful and aggressive anti-trans radical feminists on Twitter, Magdalen Berns.\"", "The headline of a June 25 article from the website The Mary Sue proclaimed \"J.K. Rowling Leaves Little Doubt About Her Terfdom,\" and Rowling's following the Twitter account of Berns prompted ample criticism of Rowling similar to that expressed by Fairchild, as reported by the website Pink News.", "When Fairchild wrote her article, and at the time this fact check was originally published, Rowling's personal views on trans issues were unclear. In support of the claim that the author had \"confirmed [her] stance against transgender women\" and against \"the transgender community,\" Fairchild did not cite a single utterance produced by Rowling.", "Rather, she cited Rowling's having liked certain tweets and having followed the account of Berns as sufficient evidence to allow for a \"definitive\" conclusion about the author's personal views on trans issues, and as amounting to \"confirmation\" that Rowling had taken a \"stance against transgender women.\" However, the tweets that an individual likes or the Twitter accounts that they follow do not provide definitive proof of that individual's personal views on any subject.", "In many cases, likes, follows, and retweets can actually provide a rather unreliable guide to an individual's personal opinions, since Twitter users like and retweet content, as well as follow other accounts, for a variety of reasons. Twitter users may interact with content and accounts in these ways because they admire another person or agree with their views, but also because they find a particular tweet interesting, egregious, or even outrageous.", "Some Twitter users follow accounts towards which they feel antipathy but which they view as being significant or prominent, or which they wish to monitor, precisely because of that antipathy or disagreement. Similarly, Twitter users sometimes like tweets as a way of bookmarking them for later reference, even if they find them objectionable, and they sometimes retweet content that they find objectionable as a way of alerting their own followers to that content.", "In June 2019, it wasn't clear what Rowling's motivations or reasons were for the follows and likes highlighted by Fairchild and others, and in June 2019, it was not clear what Rowling's views were on trans issues. As such, in June 2019, when Fairchild published her post, the claim that Rowling had \"confirmed [her] stance against transgender women\" was false on two grounds. First, Rowling had not herself made substantive public utterances about trans issues, so there was no clear \"stance\" to be confirmed, and second, even if there had been, Rowling's following of Berns' account in June 2019 would not constitute relevant reliable evidence, since it had several possible explanations.", "Rowling broke her silence on trans issues in December, in a way that indicated she does indeed hold trans-exclusionary and trans-skeptical views, and that cast her previous pattern of following certain accounts and retweeting or liking certain tweets in a different light. Her remarks in December necessitated a substantial update to this fact check, and we have changed the rating from \"False\" to \"Mixture.\" Subsequently, in June 2020, Rowling published a blog post in which she outlined her views on trans issues in considerable detail, and explained that she had followed Berns on Twitter \"because I wanted to contact her directly.\" Rowling described Berns as \"an immensely brave young feminist and lesbian,\" clearly indicating that she admired Berns and agreed with at least some of her views.", "On Dec. 19, Rowling expressed support for Maya Forstater, a researcher who had not been given a new contract by her employer, the London and Washington D.C.-based think tank the Center for Global Development (CGD), after she published a series of statements, expressing trans-skeptical and trans-exclusionary views. Forstater brought a claim against CGD, under the U.K.'s Equality Act, arguing her rights had been violated because she was denied a new contract on the basis of her beliefs.", "On Dec. 18, Judge James Tayler of the Employment Tribunal in Central London issued a preliminary judgment against Forstater, finding that her views were \"incompatible with human dignity and [the] fundamental rights of others,\" and that this outweighed her right to hold and express her beliefs. Tayler wrote:", "\"[Forstater] is absolutist in her view of sex and it is a core component of her belief that she will refer to a person by the sex she considered appropriate even if it violates their dignity and/or creates an intimidating, hostile, degrading, humiliating or offensive environment. [That] approach is not worthy of respect in a democratic society.\"", "In response to that judgment, Rowling tweeted on Dec. 19:", "\"Dress however you please. Call yourself whatever you like. Sleep with any consenting adult who’ll have you. Live your best life in peace and security. But force women out of their jobs for stating that sex is real? #IStandWithMaya #ThisIsNotADrill.\"", "Rowling's expression of disapproval of the judgment, and her expression of solidarity with and support for Forstater, were significant. Forstater had not simply 'stated that sex is real,' she had repeatedly made statements that might be aptly described as trans-skeptical (that is, denying that trans women are or could ever be anything other than men and male) and trans-exclusionary (that is, advocating for trans women to be excluded from women-only spaces such as bathrooms, and women-only activities such as women's sports and athletics).", "Though there is no fixed, universally accepted definition of \"transphobia,\" many observers regard trans-skeptical and trans-exclusionary views to be inherently transphobic, since they fundamentally deny the legitimacy and force of a trans person's self-identification.", "Tayler's judgment cited multiple examples of Forstater's views. For example, in a September 2018 letter to the Conservative party MP Anne Main, Forstater wrote: \"Please stand up for the truth that it is not possible for someone who is male to become female. Transwomen are men, and should be respected and protected as men.”", "\"Transwomen are men\" is a declaration that is likely to be deeply and extremely hurtful and offensive to trans women, and it neatly encapsulates a viewpoint which fundamentally denies the legitimacy of a trans woman's self-identification. That quotation was also not an outlier or a cherry-picked remark which does not fairly reflect the totality of Forstater's views — it rather perfectly summarized her views on the issue, several more examples of which were listed in the judgment.", "Tayler also described testimony that Forstater provided, in which she asserted that her insistence that \"transwomen are men\" would extend even to a trans woman who held a legally binding, government-issued Gender Recognition Certificate:", "\"When questioned during live evidence [Forstater] stated that biological males cannot be women. She considers that if a trans woman says she is a woman that is untrue, even if she has a Gender Recognition Certificate. On the totality of [Forstater's] evidence it was clear that she considers there are two sexes, male and female, there is no spectrum in sex and there are no circumstances whatsoever in which a person can change from one sex to another, or to being of neither sex.", "\"She would generally seek to be polite to trans persons and would usually seek to respect their choice of pronoun but would not feel bound to; mainly if a trans person who was not assigned female at birth was in a 'woman’s space,' but also more generally. If a person has a Gender Recognition Certificate this would not alter [Forstater's] position. [Forstater] made it clear that her view is that the words man and woman describe a person’s sex and are immutable ...\"", "In his conclusions, Tayler wrote that trans persons \"should be entitled to live as a person of the sex to which they have transitioned,\" and added:", "\"That was recognised in the Gender Recognition Act which states that the change of sex applies for 'all purposes.' Therefore, if a person has transitioned from male to female and has a Gender Recognition Certificate that person is legally a woman. That is not something that [Forstater] is entitled to ignore.\"", "In expressing solidarity with and support for Forstater, and expressing disapproval of Tayler's judgment, Rowling was clearly indicating that she herself holds similar trans-skeptical and trans-exclusionary views. This provides considerable credibility and support for the claims made by Fairchild in her June 2019 blog post, even if, at that time, definitive evidence was lacking.", "However, it should be noted that although Rowling, in her tweet, clearly expressed support for Forstater and her case, without articulating any disclaimers or conditions on that solidarity, the author herself has not personally made statements that might be widely regarded as hateful or prejudicial towards trans women.", "Until December 2019, and at the time this fact check was originally published in June, Rowling had not made any statement whatsoever about trans issues, but many observers had expressed concern about a pattern of Twitter activity that suggested (but did not clearly demonstrate) that Rowling held trans-exclusionary or trans-skeptical views. In light of her explicit statements in December, it is difficult in retrospect to explain that pattern in a way that does not involve Rowling's holding such views.", "In her blog post, Fairchild argued that the absence of an explicit comment from Rowling on trans issues, up to that point, indicated not that Rowling's views were unclear, but rather that she was, in short, creating plausible deniability around her views, which she was signaling in other ways (that is, through the tweets she likes and accounts she follows):", "While the LGBT community and our allies have stood back and watched a rather ominous narrative form around J.K. Rowling, it has been without any direct confirmation or statement from the author herself. It’s as if she is conditioning the world to accept it rather than rebuke it. First she stuck her toe in the water, was caught, claimed it was a misunderstanding and we accepted that. Then, she persisted to do the same things ... again and again.", "(The \"misunderstanding\" in question came in 2018, when Rowling liked a tweet that appeared to describe trans women as \"men in dresses,\" an action her representative attributed to an accident.)", "Even before Rowling provided confirmation of her views in December, this was a reasonable point. First, Rowling has been relatively outspoken in her political views, and generally promotes left-leaning causes and opinions. She has been an avowed and vocal supporter and funder of the centre-left Labour Party in the U.K. but also a critic of its current leader, Jeremy Corbyn, and she was a vocal supporter and funder of the \"No\" side in the 2014 Scottish independence referendum campaign. She has been outspoken in her opposition to Brexit, and at times scathing in her criticism of U.S. President Donald Trump and his policies. Rowling has also repeatedly expressed support for gay rights.", "Despite frequently offering her views on a wide range of political subjects, including ones closely associated with trans issues (e.g., feminism and gay rights), Rowling had never articulated solidarity for trans people or support for trans rights or trans inclusion. A search of Rowling's Twitter feed in June showed that she had never once used any of the following terms: \"trans,\" \"transgender,\" \"LGBT,\" \"LGBTQ,\" \"transphobia,\" \"transphobe,\" \"transphobic,\" \"TERF,\" \"inclusion,\" or \"exclusion.\"", "Second, Rowling had never explicitly corrected or refuted characterizations of her as holding trans-exclusionary views, or holding a stance against trans women, despite having done so in other contexts.", "For example, Rowling has in the past made a point of rejecting allegations that her criticism of the current Labour Party leader Jeremy Corbyn meant she was a \"tory\" (a supporter of the U.K. Conservative party). However, despite also repeatedly being directly accused of holding transphobic or trans-exclusionary views, Rowling had never made similar efforts to refute such allegations. (Although Rowling's representative said the 2018 \"men in dresses\" episode had been an accident, neither Rowling nor the representative said she did not agree with that characterization.) This failure to refute allegations of transphobia was noteworthy even before her watershed expression of solidarity with Forstater in December.", "In an attempt to clear up the striking ambiguity in relation to Rowling's views on trans issues, we contacted her representatives in June, posing several detailed questions about her general views on trans issues, her response to being labeled a radical feminist, whether she supported or agreed with the views of Magdalen Berns and Janice Turner (as highlighted by Fairchild in her blog post), and so on. Unfortunately, we did not receive a response.", "After her expression of support for Forstater's views, in December, we again contacted representatives for Rowling, inviting them to provide any explanation, context, background or additional statement which they viewed as relevant. On this occasion, a representative told Snopes neither Rowling nor her team would be making any comment.", "On June 10, 2020, Rowling published a lengthy blog post in which she finally gave a detailed account of her views on trans issues. Broadly speaking, she listed several \"concerns\" she had over aspects of what she described as the \"trans rights movement\" and her perceptions of the online comportment of \"trans activists.\" Rowling articulated a concern that \"the new trans activism\" was \"pushing to erode the legal definition of sex and replace it with gender\"; that a recent increase in the prevalence of trans-identifying young people was attributable to internalized homophobia and even \"social contagion\" or other more transient causes; and that laws which certify gender identity on the basis of self-identification alone could have the result of endangering women and girls by legally entitling individuals who were assigned as male at birth to access \"women-only\" spaces such as public bathrooms.", "Some observers found Rowling's blog post deeply offensive, and her pronouncements prompted an outraged response from some quarters. However, Rowling did not articulate a personal antipathy towards trans people, as such. Rather, her essay constituted the latest high-profile installment in an often bitter conceptual dispute over the status and rights of trans people, the distinction between gender and biological sex, and the relative status and rights of cisgender females. In several instances, Rowling articulated a care for, and empathy with, individual trans persons, writing \"of course trans rights are human rights and of course trans lives matter,\" and emphasizing that, due to her own experience of domestic abuse and sexual assault, \"I feel nothing but empathy and solidarity with trans women who’ve been abused by men.\" On Twitter, Rowling wrote: \"I know and love trans people, but erasing the concept of sex removes the ability of many to meaningfully discuss their lives...I respect every trans person’s right to live any way that feels authentic and comfortable to them. I’d march with you if you were discriminated against on the basis of being trans. At the same time, my life has been shaped by being female. I do not believe it’s hateful to say so.\"", "Fairchild, Phaylen.   \"J.K. Rowling Confirms Stance Against Transgender Women.\"\r\n    Medium.   24 June 2019.", "Smythe, Viv.   \"I'm Credited with Having Coined the Word 'Terf.' Here's How It Happened.\"\r\n    The Guardian.   28 November 2018.", "Voice of America.   \"Trans Debate Rages Around World, Pitting LGBT+ Community Against Itself.\"\r\n    15 March 2019.", "Kane, Vivian.   \"J.K. Rowling Leaves Little Doubt About Her TERFdom.\"\r\n    The Mary Sue.   25 June 2019.", "Powys Maurice, Emma.   \"J.K. Rowling Under Fire for Following a 'Proud Transphobe' on Twitter.\"\r\n    Pink News.   25 June 2019.", "Norman, Julian et al.   \"'Shifting Sands': Six Legal Views on the Transgender Debate.\"\r\n    The Guardian.   19 October 2018.", "Leach, Ben.   \"Harry Potter Author J.K. Rowling Gives £1 Million to Labour.\"\r\n    The Daily Telegraph.   20 September 2008.", "Carrell, Severin and Libby Brooks   \"J.K. Rowling Donates £1 Million to Scotland's Anti-Independence Campaign.\"\r\n    The Guardian.   11 June 2014.", "Tayler, James.  \"Forstater vs. CGD et al -- Judgement.\"\r\n  The Employment Tribunals, London Central.  18 December 2019.", "Updated [19 December 2019]: Rating changed from \"False\" to \"Mixture.\" Article extensively updated to reflect statements made by Rowling in December 2019, regarding an employment tribunal case involving an employee denied a contract due to her expressions of trans-exclusionary and trans-skeptical views.", "Updated [16 June 2020]: Several paragraphs added in light of a June 2020 blog post in which Rowling gave a fuller account of her views on trans issues.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]