["About this rating", "On 9 November 2016, the day after Republican presidential nominee Donald Trump claimed a surprise victory in the U.S. presidential race, a grainy picture began circulating on social media along with the claim that the Ku Klux Klan were openly marching in Mebane, North Carolina, to celebrate the win:", "KKK on the bridge in Mebane, NC this morning ? pic.twitter.com/GcSQeUB3w9", "— shorty guizman (@kelbi1lewis) November 9, 2016", "The picture shared over social media on 9 November 2016 shows conservatives who were carrying American, Gadsden, and Christian flags, which some viewers of the grainy picture mistook for robes. The Loyal White Knights of the Ku Klux Klan confirmed to us they were not on the bridge -- but they do have a separate victory parade planned on 3 December 2016 in North Carolina.", "Burlington Times News reporter Natalie Janicello confirmed the grainy picture was taken in the evening hours on 8 November 2016, and that none of the people who were rallying claimed to be associated with the KKK. She sent us this clarification via Twitter:", "Conservative group was standing on interstate overpasses yesterday in Alamance County, NC, waving Trump/American/Christian flags. Someone took a dark/grainy pic of it last night (which I saw on social media last night) & it was shared again this morning by a woman claiming it was the KKK.", "Janicello interviewed the group for a piece published on 8 November 2016, in which one of the participants, Barry Brown, told her he had been coming out to the location (the Tucker Street overpass) since February in support of Trump. On election day, the group was joined by Nievelis Bittman, a Cuban immigrant and Republican party member, who said \"We’re fighting for freedom. I came from Cuba looking for freedom.\"", "Alamance County Sheriff's Director of Public Information Randy Jones told us he has seen the group periodically on different overpasses and there is no indication they are Klan-affiliated.", "They have no affiliation with the KKK or anything else. They were just Donald Trump supporters. They are not a radical group or anything of that nature. There are no sheets, no hoods, no crosses, they didn't have Confederate flags.", "Jones added that he checked with the local police departments and found no reports of the Klan marching openly in Mebane as the tweet claims. We also contacted Mebane police, who confirmed they had no reports of a KKK march.", "The picture being circulated doesn't depict the KKK openly marching in Mebane, North Carolina. It shows a group of conservatives who have been regularly rallying on an overpass since February 2016 in support of their chosen political candidate. As Janicello pointed out, while some KKK members may also be Trump supporters, the people seen on the bridge in this photograph did not claim to be affiliated with the white supremacist group.", "When we contacted the KKK to ask about this event, we were told by a representative of the Loyal White Knights of the Ku Klux Klan that the photograph has nothing to do with them, but the group is indeed planning a separate Trump victory march on 3 December 2016 in North Carolina.", "Janicello, Natalie A.   \"Trump Fans Rally Above Interstate.\"\r\n   [Burlington] Times News.   8 November 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]