["About this rating", "Police raided a Virginia daycare center after arresting a teacher's aide for sexually abusing students.", "Police did not claim or suspect the school was \"pimping children\" to \"high-society pedophiles,\" nor did investigators link the daycare center to an \"elite pedophile ring.\"", "On 6 May 2018, the Neon Nettle web site published an article reporting that police had raided a daycare center in Washington, D.C., on suspicion that it was \"pimping children\" to \"high-society pedophiles,\" and that investigators had linked the daycare center to an \"elite pedophile ring\":", "One of the largest daycare centers in Washington DC has been raided by police following allegations it has been \"pimping children\" to \"high-society pedophiles.\"", "The raid follows the arrest of a number of staff members after complaints they were sexually abusing children.", "Officers in unmarked vehicles raided the building at Minnieland Academy in Bristow, carrying seized computers, hard drives, and brown paper bags full of other evidence.", "Staff members are accused of child sex trafficking and sexual abuse.", "Investigators say they now have evidence that ties the daycare center to an elite pedophile ring in the Washington DC area.", "It is true that police raided a daycare center in Virginia several days earlier, after arresting a teacher's aide for sexually abusing students:", "Police have conducted a raid at one of the largest daycare chains in the D.C. region after a teacher's aid was arrested for sexually abusing students.", "Officers in unmarked vehicles were seen at Minnieland Academy in Bristow, Virginia, carrying a few computers and brown paper bags full of materials.", "Former Minnieland employee Taylor Boykin is accused of sexually assaulting four young children. Boykin, who was denied bond, happens to live just a few blocks away from the daycare. His home was also raided by investigators earlier [in the] week.", "As noted in the news report quoted above (and related reporting), only a single person — who acted on his own — was arrested in conjunction with the raid. No law enforcement personnel stated that the daycare center was (or was suspected of) \"pimping children\" to \"high-society pedophiles,\" or had been linked to an \"elite pedophile ring.\"", "Neon Nettle is a notorious fake news site with a predilection for publishing sensationalized and exaggerated (if not completely fabricated) stories about pedophiles. True to form, Neon Nettle added multiple false elements to this particular report to enhance its luridness.", "Greenberg, Jay.   \"Washington DC Daycare Center Raided for 'Pimping Children' to Elite Pedophiles.\"\r\n    Neon Nettle.   6 May 2018.", "Coffin, Cori.   \"Raid Conducted at Minnieland Academy After Teacher Arrested for Sex Abuse Allegations.\"\r\n    WTTG-TV.   1 May 2018.", "Coffin, Cori.   \"Parents Demand Answers, Transparency After Minnieland Academy Day Care Worker Arrested.\"\r\n    WTTG-TV.   26 April 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]