["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A recent Texas federal court decision has given congressional Republicans new hope that they can stop President Barack Obama’s executive action to delay the deportation of some illegal immigrants.", "Here’s how U.S. Rep. David Jolly, a Florida Republican, put it Feb. 26, 2015, during House floor debate:", "\"I understand there's disagreement over the president's executive order last September. I think it was wrong. Members on the other side don't,\" Jolly said. \"A federal judge has said it's unconstitutional. The president of the United States said over 20 times he didn't have the authority to do it, and yet he did it.\"", "Jolly was talking as Congress was wrestling with a proposal to defund Obama’s execution action as part of a larger proposal to fund the Department of Homeland Security. House Republicans eventually passed a bill funding the homeland security agency without the immigration rider.", "What caught our attention was the claim that a federal judge labeled Obama’s action \"unconstitutional.\"", "Turns out, it is not as simple as that.", "The executive action", "Obama announced Nov. 20, 2014, that immigration officials would delay deportation of unauthorized immigrants for the parents of children who are citizens or have green cards, as long as the parents have been in the country for more than five years and met other criteria. (Jolly said September, but his spokesman said he had simply mixed up the dates with a press conference about Syria.)", "The 2014 action, referred to as Deferred Action for Parents of Americans and Lawful Permanent Residents (sometimes called Deferred Action for Parental Accountability, or DAPA for short), let qualified immigrants apply for work permits and to avoid deportation for three years at a time. The applicants had to pass background checks and pay a fee.", "More than 4 million people were estimated to qualify under the DAPA executive action, which built upon Obama’s 2012 Deferred Action for Childhood Arrivals program. That initiative protected \"dreamers,\" people who had been brought to the United States illegally as children and had no criminal record.", "DAPA in the courts", "As of this writing, the November executive action is on hold indefinitely. On Feb. 16, a day before the action was to take effect, Texas U.S. District Court Judge Andrew Hanen issued an injunction stopping the action from being carried out. He was hearing a Texas case that included 26 states (including Florida) challenging Obama’s announcement. Hanen said the change would be a burden on states, writing \"no statute gives the DHS the discretion it is trying to exercise here.\"", "This is the portion of the ruling Jolly first cited when we asked him what he meant. Hanen had ruled \"that the president and his secretary acted legislatively by creating new law regarding immigration enforcement,\" and thereby violated the constitutional separation of powers, Jolly told PolitiFact Florida in a statement.", "But several experts in immigration policy and constitutional law disagreed with Jolly’s assessment. The impression a reasonable person could make from Jolly’s statement is that a federal judge ruled the action unconstitutional, which is not the case.", "The states bringing the case did argue the action was unconstitutional -- a point Hanen discussed at length in his opinion, but explicitly said he would not rule on. Hanen said Texas had proven its grievance enough for the case to proceed, but not because the action was unconstitutional.", "Instead, the judge said the action violated something called the 1946 Administrative Procedure Act, which Hanen interpreted as specifying the president should have formally posted a public notice in the Federal Register about the action and held a public comment period before enacting it. The Justice Department will take the case to the Fifth U.S. Circuit Court of Appeals in New Orleans.", "\"The more correct formulation would be that ‘A federal judge has said it’s illegal,’ \" Center for Immigration Studies executive director Mark Krikorian said.", "We did find a separate instance in which a federal judge said Obama’s executive action was unconstitutional. U.S. District Judge Arthur Schwab in Pennsylvania said in a Dec. 16, 2014, ruling that \"President Obama’s unilateral legislative action violates the separation of powers provided for in the United States Constitution as well as the Take Care Clause, and, therefore, is unconstitutional.\"", "That case, though, was about whether Obama’s executive action applied to the defendant, a Honduran immigrant who was in the process of being deported for being in the country illegally. Schwab said the defendant could change his plea and face trial under the executive action, but the immigrant declined and was deported because the action doesn’t apply in criminal cases.", "Schwab’s position doesn’t set precedent, Washington University law professor Stephen Legomsky said, because it’s just the judge’s opinion and not a ruling. (Jolly said he agreed with Schwab’s characterization after we asked about it.)", "Lastly, Washington D.C. U.S. District Judge Beryl Howell rejected the argument of Schwab and others in December when she threw out a lawsuit from Maricopa County, Ariz., Sheriff Joe Arpaio, in which the sheriff called Obama’s executive action unconstitutional. Howell ruled Arpaio couldn’t prove the action harmed the sheriff’s department and that deferred action was a congressionally approved method of enforcing policy, and therefore constitutional.", "\"Any party can raise an alleged constitutional violation,\" Cornell law professor Stephen Yale-Loehr said. \"Only when the Supreme Court rules on the executive action’s constitutionality will that issue be resolved once and for all.\"", "Our ruling", "Jolly said a federal judge called Obama’s executive action on immigration \"unconstitutional.\"", "A reasonable person may think Jolly meant a judge ruled the action violated the Constitution, but that isn’t accurate. A federal judge in Texas said the government was acting outside its authority by issuing the order. But the actual ruling said the state of Texas had a chance to win a case based on a procedural misstep, not the action’s constitutionality.", "Another federal judge in Pennsylvania really did call the action unconstitutional, but that was an opinion in a ruling on a deportation case in which the action didn’t apply.", "Jolly's statement is accurate but needs clarification. We rate it Mostly True.", "David Jolly, Speech on U.S. House floor, Feb. 26, 2015", "Washington Post, \"Executive actions: An increasingly common way for Congress to hate presidents,\" Nov. 17, 2014", "U.S. Department of Homeland Security, \"Exercising Prosecutorial Discretion with Respect to Individuals Who Came to the United States as Children and with Respect to Certain Individuals Who Are the Parents of U.S. Citizens or Permanent Residents,\" Nov. 20, 2014", "White House, \"FACT SHEET: Immigration Accountability Executive Action,\" Nov. 20, 2014", "Business Insider, \"Obama's Big Immigration Speech Sets Up Possible Shutdown Showdown With GOP,\" Nov. 20, 2014", "Washington Post, \"Your complete guide to Obama’s immigration executive action,\" Nov. 20, 2014", "Huffington Post, \"House Republicans Call Obama's Executive Actions On Immigration 'Unconstitutional',\" Dec. 3, 2014", "U.S. District Court for the Western District of Pennsylvania, U.S. vs. Juarez-Escobar ruling, Dec. 16, 2014", "National Review, \"District Court Declares Obama Immigration Amnesty Unconstitutional,\" Dec. 16, 2014", "Washington Times, \"Federal judge rules Obama amnesty order unconstitutional power grab,\" Dec. 16, 2014", "SCOTUS Blog, \"Judge rules new immigration policy invalid,\" Dec. 17, 2014", "Southeast Texas Record, \"Judge says immigration order unconstitutional as applied to Penn. case,\" Dec. 18, 2014", "U.S. News & World Report, \"Judge Considers Arpaio Lawsuit Against Obama Immigration Action,\" Dec. 22, 2014", "Pittsburgh Post-Gazette, \"Pittsburgh judge grants U.S. more time to prepare appeal of immigration ruling,\" Dec. 23, 2014", "U.S. News & World Report, \"Arpaio's Immigration Lawsuit Against Obama Thrown Out of Court,\" Dec. 24, 2014", "Pittsburgh Post-Gazette, \"2 deported in cases tied to ruling on Obama policy,\" Feb. 12, 2015", "U.S. District Court Southern District of Texas, Texas vs. U.S. ruling, Feb. 16, 2015", "New York Times, \"Dealt Setback, Obama Puts Off Immigrant Plan,\" Feb. 17, 2015", "NPR, \"Federal Judge Blocks Obama's Executive Actions On Immigration,\" Feb. 17, 2015", "Washington Post, \"Federal judge in Texas blocks Obama immigration orders,\" Feb. 17, 2015", "Wall Street Journal, \"Obama Administration Dealt Setback on Immigration,\" Feb. 17, 2015", "Reuters, \"Texas judge's immigration rebuke may be hard to challenge,\" Feb. 18, 2015", "Boston Globe, \"US seeks stay of ruling on Obama immigration action,\" Feb. 24, 2015", "Newsweek, \"The Judge Who Halted Obama’s Immigration Reform,\" Feb. 26, 2015", "Politico, \"Congress passes one-week DHS fix,\" Feb. 27, 2015", "Washington Post, \"House passes bill fully funding the Department of Homeland Security,\" March 3, 2015", "U.S. Citizenship and Immigration Services, \"Executive Actions on Immigration,\" accessed March 2, 2015", "Electronic Privacy Information Center, \"The Administrative Procedure Act (APA),\" accessed March 2, 2015", "Interview with Mark Krikorian, Center for Immigration Studies executive director, Feb. 27, 2015", "Interview with John Woolley, University of California-Santa Barbara political science professor, Feb. 27, 2015", "Interview with Richard Hujber, Boynton Beach immigration lawyer, Feb. 27, 2015", "Interview with Kermit Roosevelt, University of Pennsylvania law professor, Feb. 27, 2015", "Interview with Kevin Johnson, University of California-Davis law professor, Feb. 27, 2015", "Interview with Stephen Legomsky, Washington University law professor, Feb. 27 & March 2, 2015", "Interview with Kenneth Mayer, University of Wisconsin-Madison political science professor, Feb. 27 & March 2, 2015", "Interview with Stephen Yale-Loehr, Cornell University law professor, Feb. 27 & March 2, 2015", "Interview with U.S. Rep. David Jolly, R-Indian Shores, March 2, 2015", "Interview with Preston Rudie, U.S. Rep. David Jolly spokesman, March 2 & 4, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]