["About this rating", "At one point during a CNN town hall on Feb. 16, Biden said: \"It’s one thing to have the vaccine, which we didn’t have when we came into office.\" It appears that Biden simply misspoke, however, given that he had acknowledged just minutes before that 50 million doses were available when he took office.", "Given the totality of his remarks on the subject during the town hall, it is false to claim that Biden said there was no vaccine at all at the beginning of his term of office.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "During a town hall moderated by CNN's Anderson Cooper on Feb. 16, 2021, U.S. President Joe Biden discussed the country's work to prevent the spread of COVID-19 following former President Donald Trump's departure from the White House.", "During Biden's appearance, Kayleigh McEnany, Trump's former press secretary, alleged via the below-displayed tweet that Biden falsely claimed a vaccine did not exist when he began his term roughly one month earlier.", "Sharing a video segment of the town hall, McEnany claimed in a tweet: \"Biden says there was no vaccine when he came into office. That is abjectly FALSE.\"", "She was correct in that epidemiologists developed vaccines (one by Pfizer and BioNTech and the other by Moderna and the National Institutes of Health) and received FDA approval for distributing the shots in late 2020, under the Trump administration.", "Additionally, the video in McEnany's tweet did include authentic comments by Biden, according to footage of the event on CNN's website and a White House transcript. The president indeed said the following on stage with Cooper:", "And the biggest thing, though, as you remember when you and I — no, I shouldn’t say it that way, 'as you remember' — but when you and I talked last, we talked about — it’s one thing to have the vaccine, which we didn’t have when we came into office, but a vaccinator — how do you get the vaccine into someone’s arm?", "In other words, McEnany's accusation was true at face value; the president at one point during the town hall said his administration did not have \"the vaccine\" when it took over the White House.", "But based on his other comments at the event, as well as an email correspondence Snopes had with the White House to determine the intention behind the president's phrasing in that brief moment, it was misleading to claim Biden erroneously attempted to erase the success of scientists who developed COVID-19 vaccines under the Trump administration or that he literally believed a vaccine did not exist before his term.", "Seconds before the above comment, the president not only acknowledged a COVID-19 vaccine existed before he took his oath of office but he elaborated on the nation's stock of shots at that time. He and Cooper had the below-transcribed exchange, according to the CNN video and White House document.", "Cooper: When is every American who wants it going to be able to get a vaccine?", "Biden: By the end of July of this year. We came into office, there was only 50 million doses that were available. We have now — by the end of July, we’ll have over 600 million doses — enough to vaccinate every single American.", "Then, the president advertised his national plan for distributing the vaccines after states and hospitals reported dwindling supplies and unclear guidelines for how to immunize Americans under Trump.", "Biden: Here, look, we — what we did — we got into office and found out the supply — there was no backlog. I mean, there was nothing in the refrigerator, figuratively and literally speaking, and there were 10 million doses a day that were available.", "We’ve upped that, in the first three weeks that we were in office, to significantly more than that.", "Moments later, the president made the alleged comment shown in the video in McEnany's tweet, while stressing the importance of expanding the number of people who administer the shots and places that offer them nationwide.", "Snopes reached out to the White House to determine the president's intention behind the phrase \"we didn’t have [the vaccine] when we came into office,\" and asked whether he was trying to erase success by vaccine developers under Trump with the statement. A spokesperson responded to us via email, refuting the latter claim, and emphasized the alleged lack of shots ready for distribution when Biden took over.", "\"When we came into office, vaccines existed, but were already allocated,\" the spokesperson told Snopes. \"There was no stockpile really.\"", "In sum, while it was true Biden literally at one point said, \"we didn’t have [the vaccine] when we came into office\" at the CNN town hall on Feb. 16, it was a false interpretation of that moment to frame it as the president trying to convince Americans that epidemiologists did not develop vaccines under Trump. For those reasons, and those outlined above, we rate this claim a \"mixture\" of truth and misleading information.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]