["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic/Progressive gubernatorial candidate David Zuckerman, left, and Republican Gov. Phil Scott in a debate sponsored by VTDigger on Sept. 29. Photo by Glenn Russell/VTDigger", "Gov. Phil Scott came out firing when the issue of Lt. Gov. David Zuckerman’s proposed wealth tax came up during a debate Tuesday.", "Zuckerman touted his plan to raise a tax on the wealthiest 5% for revenue to build out broadband and fund climate change initiatives like home weatherization.", "Scott, who has opposed new tax increases, criticized the plan, arguing that it would impact middle class families, in addition to wealthy residents.", "\"That 5% starts at $159,000 per family,\" Scott said. \"So we’re not talking about a grand amount of money here. Think about two teachers, married teachers. The tax proposal that I’m hearing from David is that it’s going to impact them.\"", "Zuckerman has said the tax would target the high-income earners who benefited from the federal tax cuts Trump instituted in 2017. Zuckerman hasn’t proposed a specific rate, but his campaign says the tax would raise $100 million.", "We’re certain that not all two-teacher households are making $159,000. But setting that anecdote aside, Scott’s income bracket didn’t square up with what Zuckerman and other Progressive and Democratic lawmakers have been saying about the proposed wealth tax, when discussing initiatives like the Green New Deal.", "So VTDigger decided to find out who, exactly, would be impacted by a tax on Vermont’s top 5% of earners.", "After the debate, Colleen Jackson, a spokesperson for Zuckerman, disputed Scott’s numbers and told VTDigger the top 5% of earners start at households earning $294,000 per year. She pointed to a document from the Joint Fiscal Office to support that claim.", "Jason Maulucci, Scott’s campaign manager, said the governor was citing an analysis by the Vermont Department of Taxes, in response to legislation, S.311, that proposes a wealth tax. It was sponsored by Sen. Anthony Pollina, P/D-Washington, and co-sponsored by 13 other senators.", "The Tax Department found the top 5% starts at $159,000 in taxable income, according to its 2018 data.", "Pollina’s bill would place a 1.6% income tax surcharge on Vermonters making between $200,000 and $500,000. For people making more than $500,000, the tax rate would go up an additional 0.15%.", "This would mean that someone making about $500,000 a year would pay about $3,000 more in state income taxes under the proposal, which would raise about $30 million annually.", "The decision to begin the tax on people with an adjusted gross income of $200,000 and up is based on an analysis by the Institute on Taxation and Economic Policy (ITEP), a non-partisan think tank.", "Using estimates of Vermont’s 2018 tax data, ITEP reported that the top 5% begins with people who are making between $215,000 and $517,790. The average income of this group, ITEP, is $294,600 — incredibly close to what the Zuckerman campaign said the top 5% begins.", "Graham Campbell, the member of the Joint Fiscal Office who summarized the ITEP report in late 2019 for Pollina, reviewed the data and said the institute’s \"percentile breakdowns are likely not as exact as the Tax Department’s.\"", "Scott said \"that 5% starts at $159,000 per family\" when referring to his opponent’s proposed tax on the wealthiest Vermonters.", "The Department of Taxes reports that filers with $159,000 in adjusted gross income would indeed be included in Vermont’s wealthiest 5%.", "While the Institute on Taxation and Economic Policy’s analysis shows that 5% would encompass people making $215,000 or more, closer to Zuckerman’s projection, the Department of Taxes’ data is a more accurate reflection of who the current proposal would impact.", "We rate Scott’s statement True.", "Editor’s note: The headline on this article was changed after publication to better reflect the statement being fact-checked.", "VTDigger-hosted gubernatorial debate.", "Email exchange between VTDigger and Graham Campbell, Oct. 2, 2020.", "Email exchange between VTDigger and Rebecca Kelley, spokesperson for Gov. Scott, Oct. 1, 2020. Department of Taxes data provided by Jake Feldman and Doug Farnham.", "Email exchange between VTDigger and Jason Maullucci, Scott’s campaign manager, Sept. 30, 2020.", "Institute on Taxation and Economic Policy’s analysis.", "Joint Fiscal Office’s Fiscal Facts 2020.", "Vermont Green New Deal legislation.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]