["The videos have been circulating on Facebook, Twitter and TikTok since at least July 2019, including here and here.", "“Bet y’all didn’t know there was a plan b pill inside a pregnancy test (sic),” reads the caption on a Facebook post shared more than 18,000 times since August 3, 2019.", "The footage shows two young women forcing open a Clearblue pregnancy test to discover a white, disc-shaped object.", "“No way! There actually is!” one of them says. “There is a Plan B pill in these pregnancy tests.”", "A similar video shared on Facebook shows a couple opening a pregnancy test with a knife, only to discover the “pill”.", "“Oh my gosh, it’s really in there!” the woman says, before her partner jokes, “You’re like ‘oh, you don’t want the baby? Now you’ve got a decision!’”", "'Should not be eaten'", "However, manufacturer Clearblue rubbished the claims.", "“Clearblue tests do NOT contain Plan B,” the company said on its website. “All our tests contain a desiccant tablet to absorb moisture and should not be eaten”.", "The company posted similar messages on Facebook and Twitter on August 6, 2019.", "We are aware of videos about Clearblue pregnancy tests and the tablet inside. Clearblue tests do NOT contain Plan B. All our tests contain a desiccant tablet to absorb moisture and should not be eaten. If accidentally ingested, seek medical advice. Questions? 1800-321-3279", "The false claims have sparked debunks around the world, including in the US, the UK, Ireland, France and Germany.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]