["About this rating", "This warning blasted across the internet in 2011:", "WARNING!!!!! It was on Fox news earlier that 70 dogs have died as a result of eating chicken jerky treats made from chicken that has come from China. Kingdom Pets brand from Costco is one of them. Also certain Blue Buffalo brand pet foods have a recall for the same thing. Please re post and make sure all your dog friends are aware.", "In response to reports of illnesses in pets associated with the consumption of jerky pet treats (primarily manufactured in China), over the past several years the U.S. Food and Drug Administration (FDA) has issued several advisories to consumers: one in September 2007, one in December 2008, one in November 2011, one in September 2012, and another in May 2014.", "For example, an FDA advisory released on 14 September 2012 chronicled 2,200 reports of pet illnesses associated with jerky treats:", "Since 2007, the FDA has become aware of increasing numbers of illnesses in pets associated with the consumption of jerky pet treats. The majority of complaints involve chicken jerky (treats, tenders, and strips), but others include duck, sweet potato, and treats where chicken or duck jerky is wrapped around dried fruits, sweet potatoes, or yams.", "The FDA has received approximately 2,200 reports of pet illnesses which may be related to consumption of the jerky treats. The majority of the complaints involve dogs, but cats also have been affected. Over the past 18 months the reports have contained information on 360 canine deaths and one feline death. There does not appear to be a geographic pattern to the case reports. Cases have been reported from all 50 states and 6 Canadian provinces in the past 18 months.", "By May 2014, those numbers had swelled to encompass 4,800 complaints:", "As of May 1, 2014, we have received in total more than 4,800 complaints of illness in pets that ate chicken, duck, or sweet potato jerky treats, nearly all of which are imported from China. The reports involve more than 5,600 dogs, 24 cats, three people, and include more than 1,000 canine deaths. The breakdown of symptoms associated with the cases is similar to that of earlier reports: approximately 60 percent of the cases report gastrointestinal/liver disease, 30 percent kidney or urinary disease, with the remaining 10 percent of complaints including various other signs such as neurologic, dermatologic, and immunologic symptoms. About 15 percent of the kidney or urinary cases also tested positive for Fanconi syndrome, a rare kidney disease that has been associated with this investigation.", "In response to this information, in May 2014 the national chain of Petco retail pet stores announced it would stop selling Chinese-made jerky treats in all of its stores  by the end of 2014:", "Petco became the first national pet retail chain to remove all China-made dog and cat treats when it announced that it would stop selling the products in its more than 1,300 locations by the end of [2014].", "\"We know some pet parents are wary of dog and cat treats made in China, especially Chicken Jerky products, and we’ve heard their concerns,\" said Petco CEO Jim Myers in a statement. \"As a leader in the industry and the trusted partner for our pet parents, we're eager to make this transition and to expand our assortment of safe and healthy treats, the majority of which are made right here in the U.S. Very simply, we feel this decision is in the best interest of the pets we all love and, ultimately, for our business.\"", "Petco said that it doesn’t want its customers to take any chances. \"We know the FDA hasn’t yet identified a direct cause for the reported illnesses, but we decided the uncertainty of the situation outweighs the lack of actual proof,\" said Myers. \"It has taken some time and careful thought to get to this point, but we're proud to make the change and we believe our customers will be pleased with it as well.\"", "However, the FDA still has not definitively established a causative link between pet illness and the consumption of jerky treats, stating that although they \"continue to receive complaints of dogs experiencing illness that their owners or veterinarians associate with consumption of chicken jerky products ... to date, scientists have not been able to determine a definitive cause for the reported illnesses\":", "Although the FDA has been actively investigating the reports of illnesses, no definitive cause has been determined. The ongoing global investigation is complex, multifaceted and includes a wide variety of experts at the FDA including toxicologists, epidemiologists, veterinary researchers, forensic chemists, microbiologists, field investigators and senior agency officials.", "At best, the FDA has so far been able to perform necropsies on a few dozen dogs whose deaths were attributed to jerky treats.  That agency found half that those deaths did not appear to be related to jerky pet treats, and the causes of death in the other half may or may not have been linked to the consumption of jerky treats:", "FDA has had the opportunity to perform necropsies (post-mortem examinations) on 26 dogs, 13 of which appeared to have causes of death not related to consumption of jerky pet treats. Of the remaining 13 cases, an association with consumption of jerky pet treats could not be ruled out. Eleven of these dogs had indications of kidney disease and two involved gastrointestinal disease.", "On 22 October 2013, the FDA released a Progress Report noting that the \"rate of complaints associated with jerky pet treats dropped sharply after several well-known brands were removed from the market in January 2013,\" but reiterating that the \"FDA has not yet identified a cause for the reported illnesses\":", "As of September 24, 2013, FDA has received approximately 3000 complaints of illness related to consumption of chicken, duck, or sweet potato jerky treats, most of which involve products imported from China. The reports involve more than 3600 dogs, 10 cats and include more than 580 deaths. FDA continues to investigate the cause of these illnesses in conjunction with our partners in the Veterinary Laboratory Investigation and Response Network (Vet-LIRN), a network of animal health laboratories affiliated with FDA.", "The complaints FDA has received include adverse events involving different sizes, ages and breeds of dogs. About 60 percent of the reports are for gastrointestinal illness (with or without elevated liver enzymes) and about 30 percent relate to kidney or urinary signs. The remaining 10 percent of cases involve a variety of other signs, including convulsions, tremors, hives, and skin irritation.", "It is important to note that the reported illnesses are not limited to jerky treats made from chicken. We have received complaints about duck and sweet potato jerky treats and related products, such as jerky-wrapped rawhide treats. We know that the illnesses and deaths reported are mostly linked to jerky pet treats sourced from China. Pet owners should be aware, however, that manufacturers do not need to list the country of origin for each ingredient used in their products.", "FDA has noticed a sharp drop in the number of complaints since several treat products were removed from the market in January 2013 following a study by the New York State Department of Agriculture and Marketing (NYSDAM) that revealed low levels of antibiotic residues in those products. Recalled products included several well-known brands believed to comprise the majority of the jerky pet treat market. FDA believes it unlikely that the reports of illness it has received are caused by the presence of antibiotic residues in jerky pet treat products. Rather, because the brands that were recalled represent a significant portion of the jerky pet treat market in the United States, FDA theorizes, therefore, that the drop off in complaints since January 2013 is the more likely the result of the general lack of availability jerky pet treat products.", "To date, testing for contaminants in jerky pet treats has not revealed a cause for the illnesses.", "The FDA also explained the difficulties it faces in trying to determine the specific cause behind pet illness reports:", "This investigation continues to be a challenging one for FDA. Complicating the investigation are some fundamental differences between investigations into illnesses in people versus those in pets.", "In human illness outbreaks caused by foodborne bacteria or contaminates, FDA works in concert with the Centers for Disease Control and Prevention (CDC) and state boards of health, which collect and track cases of foodborne illness. Unfortunately, there is no equivalent for pets, which means that it is difficult to accurately evaluate the scope of an outbreak.", "Another complicating factor in the investigation is the lack of post-mortem information. When a person dies unexpectedly, it is not unusual for a medical examiner to perform an autopsy to try to determine the cause of death. When a pet dies, it is much less likely that qualified veterinary pathologists will have the opportunity to examine the body. By the time FDA receives reports of deaths in pets, the body has often already been cremated or buried, eliminating the chance for scientists to gather more information about potential causes for the pet’s illness.", "Finally, FDA does not have access to market data about food items for pets. FDA regulations do not require product registration for foods, whether they are intended for people or animals. Therefore, it is difficult to appreciate the scope of the jerky pet treat market and the different products available to consumers.", "Pet owners who believe their pets have become ill from consuming jerky treats should observe the following steps to assist the FDA in its investigation:", "In addition to your contact information, your pet's symptoms, and medical records, the one piece of information we most often lack is the lot number of the jerky treat product. If we have the lot numbers, we can identify whether particular lots triggered more complaints, trace products back to specific manufacturing facilities, and identify lots for testing. While we still want to hear from you even without the lot number, this information can help our investigation immensely.", "If you find it convenient to transfer pet food and treats to a secondary container to protect them from rodents, insects or spoilage, FDA recommends that you consider saving the original packaging. This will help ensure that you will still have access to the lot code if your pet becomes ill from consuming the product.", "While working with your veterinarian to review your pet's records, FDA and Vet-LIRN scientists might request specific testing to try to narrow down the cause of your pet's illness. The costs of tests requested by the scientists will be covered by Vet-LIRN and FDA, but pet owners will not be reimbursed for any additional testing expenses they may incur.", "Although it is always a difficult topic to consider, in the event of a pet death that appears to be related to the consumption of jerky pet treats, post-mortem testing of animal tissues, such as a necropsy (in human medicine, doctors call this procedure an autopsy) may also be helpful. While we want to do everything we can to prevent pets from becoming ill in the first place, having the chance to examine tissues may fill gaps in information that can help us pinpoint a cause for the reports of injury and death.", "For additional information, check out the FDA's website and this episode of CBC's \"Marketplace.\"", "Alba, Monica.   \"Petco Pulls All Tainted Pet Jerky Treats from Shelves.\"\n     NBCNews.com.   20 May 2014.", "Aleccia, JoNel.   \"Nearly 1,000 Dogs Now Sick from Jerky Treats, FDA Reports Say.\"\n     MSNBC.com.   22 May 2012.", "Pous, Terri.   \"FDA: Nearly 1,000 Pets Sickened by China-Made Dog Treats.\"\n     Time.   23 May 2012.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]