["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Hillary Clinton talks about her emails in August.", "On WPRI’s \"Newsmakers\" show on Sept. 4, co-hosts Ted Nesi and Tim White asked U.S. Rep. David Cicilline about Hillary Clinton’s use of a personal server for work-related email when she was secretary of state.", "Cicilline emphasized that Clinton herself acknowledged that she \"didn’t handle this well.\"", "He lamented that \"early on\" Clinton hadn’t succeeded in an effort \"to put it to rest.\" He suggested that the effect on Clinton’s campaign has been \"unfortunate\" and \"regrettable.\"", "\"The secretary has acknowledged that having a separate server was a bad idea,\" he said.", "Cicilline added: \"She has also said unequivocally that she didn't receive classified documents.\"", "Voters tend to like politicians who are unequivocal about things.", "The Random House dictionary defines unequivocal as not equivocal, unambiguous, clear and having only one possible meaning or interpretation. It also means absolute, unqualified; not subject to conditions or exception.", "We wondered if Clinton has actually been \"unequivocal\" in her comments about not receiving classified documents on her personal server, so we gathered together some video clips.", "One of those clips was from early March -- just after The New York Times broke the news that the candidate had used a personal email account to conduct government business as secretary of state and that her advisers had reviewed tens of thousands of pages of her personal emails and decided which ones to provide to the State Department for record-keeping purposes.", "On March 10, Clinton took some questions from reporters on C-SPAN.", "One reporter asked her: \"Were you ever specifically briefed on the security implications of using your own email server and using your personal address to email with the president?\"", "Her response was: \"I did not email any classified material to anyone on my email. There is no classified material. So I certainly am well aware of the classification requirements and did not send classified material.\"", "This was certainly unequivocal, especially the assertion that \"There is no classified material.\"", "But later we found Clinton’s statements veered from \"unambiguous, clear and having only one possible meaning or interpretation.\"", "In footage that CNN posted online on July 28, Clinton said, \"First let me say that I am confident that I never sent nor received any information that was classified at the time it was sent and received.\"", "\"At the time it was sent and received\" seems to us to be open to more than one possible meaning, especially when compared to her statement in March.", "Then, on Aug. 15, speaking at the Iowa State Fair, Clinton said: \"... The facts are the same as they have been from the very beginning of these questions being raised. Most importantly, I never sent classified material on my email. And I never received any that was marked classified.\"", "In March, Clinton was saying there was no classified material, regardless of how it was marked. Now, she was allowing for the possibility that there might have been some material that was actually classified -- but just not \"marked\" that way.", "In stories parsing her August comments, in which she uses the phrase \"marked classified,\"  The Wall Street said she had shifted her emphasis. The Boston Globe said she had qualified her position.", "We asked a spokesman for Clinton, Josh Schwerin, if the candidate agrees with Cicilline's statement, particularly his use of the word unequivocally.", "\"We'll let her past statements on the matter speak for themselves,\" Schwerin said in an email.", "We also asked Cicilline’s spokesman, Richard Luchette, to provide his evidence that Clinton has said \"unequivocally\" that she didn’t receive classified documents.", "Luchette provided a series of quotes that reflect the same evolution we’ve tracked. It’s a chain of quotes that begins with Clinton’s quite unequivocal statement from March. It ends with the more recent statements, which are qualified, including this one: \"As has been confirmed repeatedly by the inspectors general, over and over, I did not send or receive any material marked classified.\"", "There’s that word \"marked\" again.", "Our ruling", "Ten days ago, Cicilline said Hillary Clinton  \"has also said unequivocally that she didn't receive classified documents.\"", "Cicilline set a high bar for himself when he used the word \"unequivocally.\" Certainly in March she was unequivocal. But the record also shows that since then she has hedged and qualified her remarks, as has been noted in the media.", "The problem for Cicilline is that the definition of unequivocal doesn’t leave much, if any, wiggle room: Think \"clear and having only one possible meaning or interpretation.\"", "Because Cicilline’s statement was accurate in regard to Clinton’s quote from March, but failed to provide the context of Clinton’s subsequent elaborations, the judges rate Cicilline’s claim Half True.", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "WPRI.com, Newsmakers, \"David Cicilline,\" Sept. 4, 2015, accessed Sept. 8, 2015", "WSJ.com, \"Hillary Clinton Campaign Says Classified Emails Were On Server,\" Aug. 19, 2015, accessed Sept. 9, 2015", "BostonGlobe.com, \"Hillary Clinton’s e-mail problems persist,\" Aug. 19, 2015, accessed Sept. 9, 2015", "Email from U.S. Rep. David Cicilline’s spokesman, Richard Luchette, Sept. 9, 2015.", "C-SPAN.org, \"Presidential Candidate Hillary Clinton at the Iowa State Fair,\" Aug. 15, 2015, accessed Sept. 9, 2015", "CNN.com, \"Hillary Clinton on emails:`The facts are pretty clear,' July 28, 2015, accessed Sept. 9, 2015", "C-SPAN,org \"Hillary Clinton on her Personal Electronic Mail Account,\" March 10, 2015, accessed Sept. 9, 2015", "WashingtonPost.com, \"Complete Text of Hillary Clinton’s remarks on emails, Iran,\" March 10, 2015, accessed Sept. 9, 2015", "Reuters.com, \"Clinton: I did not send or get classified emails on private account,\" July 25, 2015, accessed Sept. 9, 2015", "Time.com, \"New Hillary Clinton Email Release Contains 150 Now Deemed Classified,\" Aug. 31, 2015, accessed Sept. 9, 2015", "Huffingtonpost.com, \"Hillary Clinton Denies Private Email Allegations in New Interview,\" Sept. 4, 2015, accessed Sept. 9, 2015", "NewYorkTimes.com, \"Hillary Clinton Used Personal Email Account at State Department, Possibly Breaking Rules,\" March 2, 2015, accessed Sept. 9, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]