["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "\"Popeyes fried chicken is fantastic,\" New Yorker food writer Helen Rosner wrote on Aug. 20. \"The meat is flavorful and juicy, encased in a spiky, golden sea urchin of batter — surprisingly light, uncommonly crispy.\"", "And *just* the right amount of cocaine. Or, at least, that’s what a recycled image recently posted on Facebook would have you believe.", "The image looks like a news story with this headline: \"Popeyes manager arrested for allegedly dipping chicken in cocaine based flour to increase business sales.\" And, given the recent craze over the chain’s new chicken sandwich, one might actually believe the headline.", "But it’s fake, Popeyes Nation. This Aug. 23 post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "That’s because if you search for the headline you’ll find it on channel22news.com, which describes itself as \"a prank website that is intended for fun.\"", "Cropped out of the image that appeared on Facebook are the words \"you’ve been pranked!\" with three laughing-while-crying emojis, and an image of a clown with the words \"you got owned\" stamped on its hat.", "We rate this Facebook post Pants on Fire!", "Facebook post, Aug. 23, 2019", "The New Yorker, \"The Popeyes chicken sandwich is here to save America,\" Aug. 20, 2019", "Thrillist, \"Popeyes’ New Fried Chicken Sandwich is So Popular No One Can Buy It,\"  Aug. 21, 2019", "Channel22news.com, \"Popeyes manager arrested for allegedly dipping chicken in cocaine based flour to increase business sales,\" visited Aug. 23, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]