["About this rating", "In March 2021, following the death of Hall of Fame middleweight boxer Marvelous Marvin Hagler, rumors swirled online that the 66-year-old had died from receiving a COVID-19 vaccination.", "The claim was widely shared on Facebook and Twitter, but appears to have originated from one source only, and has been explicitly refuted by Hagler's wife, Kay (shown with Hagler in the photograph above).", "Hagler, who was undisputed middleweight world champion for a remarkable seven years during the 1980s, died on March 13. On Facebook, his wife Kay announced his passing, saying he had died at their home in New Hampshire:", "I am sorry to make a very sad announcement. Today unfortunately my beloved husband Marvelous Marvin passed away unexpectedly at his home here in New Hampshire. Our family requests that you respect our privacy during this difficult time. With love\nKay G. Hagler", "Hagler legally changed his name from \"Marvin Nathaniel\" to \"Marvelous Marvin\" Hagler, in April 1982. His website featured a similar announcement, which specified that he had died of natural causes, but said his death had taken place \"near\" his home, rather than at his home, in New Hampshire:", "\"We are very sad to report that Marvelous Marvin Hagler died on March 13 of natural causes near his home in New Hampshire. He was a champion until the end. His family asks for privacy at this time of sorrow.\"", "The only source of the claim that COVID-19 vaccination was involved in Hagler's death came in the form of a March 13 Instagram post by Thomas Hearns, who was defeated by Hagler in a now-famous April 1985 world middleweight fight. In a post that featured a photograph of Hagler, Hearns wrote:", "\"A real true warrior. Pray for the king and his family.. he’s in ICU fighting the after effects of the vaccine! He’ll be just fine but we could use the positive energy and Prayer for his Full Recovery !\"", "In a subsequent Instagram post that appears to have since been deleted, Hearns did not retract his claims regarding the purported role of the COVID-19 vaccine in Hagler's death, but insisted \"this is not an anti vaccine campaign.\"", "However, on March 15, Hagler's wife Kay explicitly refuted the claim, writing \"For sure [it] wasn't the vaccine that caused his death,\" adding \"Now is not the time to talk nonsense.\"", "On Facebook, she wrote:", "I was the only person close to him until the last minute, and I am the only person that [knows] how things went not even his family know all the details and I do NOT accept to read some stupid comment without knowing really what [happened]. For sure [it] wasn't the vaccine that caused his death. My baby left in peace with his [usual] smile and now is not the time to talk nonsense.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]