["A Twitter user Shekhar Chahal shared a WhatsApp chat with an alleged Pakistani, who is a resident of Balakot, to claim that the Indian air force’s recent air strike killed 292 terrorists of JeM. Chahal is followed by prime minister Narendra Modi on Twitter.", "In the chat, Chahal’s ‘friend’ said that his mother is the dean of Balakot medical university and was responsible for examining the dead bodies of the slain terrorists.", "Chahal has also shared the alleged conversation on his Facebook profile.", "Exclusive #PROOF of #AirStrikes One of My Friend’s Known From PAKISTAN Claimed That Around 292 Terrorists Killed in…", "Posted by Shekhar Chahal on Monday, 4 March 2019", "Alt News looked up ‘Balakot medical university’ on Google but the search engine threw up no results. Chahal, however, tweeted a link, claiming that it pertains to the said university. But the link has no mention of the medical college. A few users called out his chicanery.", "Alt News also looked up existing medical universities in Balakot on Google Maps. However, as there seem to be no medical colleges in Balakot, Google maps threw up universities in nearby areas. One of the closest universities, Azad Jammu & Kashmir medical college, is situated at a distance of about 40 km from Balakot.", "The airforce is yet to provide any details on the number of casualties in the airstrike. In a recent press briefing, Air vice-marshal RGK Kapoor stated it is premature to ascertain the number of casualties. Air Chief Marshal B S Dhanoa on March 4 said that it is not for the air force to count the number of casualties and the government provides such details. The only detail that the government has, however, provided is union minister SS Ahluwalia’s statement that the Indian air force strike in Balakot did not intend to inflict “any human casualty” but was to send out the message that India is capable of hitting deep inside enemy lines.", "Despite BJP president Amit Shah’s claims that 250 terrorists were killed in the Balakot airstrike, there is no evidence to back the statement. In fact, the Defence minister herself said that there are “no numbers” to give out.", "The WhatsApp chat uploaded Chahal was clearly manufactured, the poor attempt at Urdu giving away its fallacy. Several basic Urdu words were misspelt in the conversation.", "For instance, ‘nazdiki’ was spelt was ‘najdiki’; ‘pareshan’ was written as ‘paresan’; ‘Alhamdulillah’ was spelt as ‘Allamuddiah’; ‘tashreef’ was written as ‘tasreef’.", "A few other words like ‘ghayalo’ and ‘aantankvaad’ are Hindi words. A person living in Pakistan, fluent in Urdu, is most likely to use ‘zakhmi’ for the former and ‘dehshat gardi’ for the latter.", "Furthermore, a few sentences in the chat do not make any sense and it appears that Urdu words were forcefully added mid-sentence. “Par ye galat hai na loc cross krna..khair allah fitrat kre” – was one of the messages sent by Chahal’s ‘friend’ from across the border. However, the word ‘fitrat’, which means ‘character’ or ‘habit’, is not applicable here. What the ‘friend’ perhaps meant was ‘allah khair/hifazat kare’, which basically means ‘May God bless you’.", "Another sentence, “aur allamuddiah media bhi imran ke ishare pe chalti hai”, makes no sense as the word ‘Alhamdulillah’ means ‘praise the God’ and is used while thanking for blessings.", "The aftermath of the Balakot air strike has seen a massive amount of misinformation circulating online, with several users posting fake videos and images to prove that the air strike caused severe damage in Pakistan.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]