["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On May 7, a student was killed and more were injured in a mass shooting at STEM School Highlands Ranch in Colorado. Facebook posts reacting to the incident followed.", "One, from May 9, says: \"The Colorado school shooter is a transsexual, Trump-hating, Christian-hating, leftist freak .. and the media is silent.\" The post also features a photo of a person in what looks like an orange jail uniform.", "It’s been shared more than 95,000 times, and it was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Here are the facts.", "There are two suspects in the shooting. One of the suspects is 16 years old and was listed on a court docket as Maya Elizabeth McKinney. But a lawyer for the suspect referred to McKinney as \"Alec McKinney,\" and the judge addressed the suspect as \"Mr. McKinney,\" Reuters reported on May 7.", "\"Denver’s ABC television affiliate, citing an unidentified police source, has reported that the younger suspect identified as transgender and had been bullied for it,\" the wire service said in its dispatch the day after the shooting.", "Some stories, such as this one from the Washington Post, don’t mention that McKinney is transgender. But others do, including these from Buzzfeed, The Wall Street Journal, and The Denver Post.", "However, the person in the photo that appears in the Facebook post is the other suspect, 18-year-old Devon Erickson, who has not been identified as transgender. And it was this suspect that the New York Post reported on May 8 shared social media posts critical of President Donald Trump and Christians while praising former president Barack Obama.", "\"You know what I hate? All these Christians who hate gays, yet in the bible, it says in Deuteronomy 17:12-13, if someone doesn’t do what their priest tells them to do, they are supposed to die,\" the New York Post says Erickson wrote on Facebook in May 2014. \"It has plenty of crazy stuff like that. But all they get out of it is ‘ewwwwww gays.\"", "On May 9, the New York Post reported on online posts from McKinney, who, the paper said, is undergoing a female-to-male transition. McKinney tweeted about taking prescription drugs, disliking STEM students, and self-harm. The story doesn’t mention Trump or religion.", "The Facebook post appears to have conflated the two suspects in the shooting, drawing details about the gender identity of one of the suspects and references to Trump and Christians from the other’s social media posts. Media outlets have also reported that one of the suspects is transgender and that the other posted political missives online.", "How these insights into the suspects are related to the shooting is unclear. Citing this May 8 Daily Mail story, the New York Post reported that a friend of Erickson and McKinney wrote online that the two were troubled and didn’t get the help they needed. \"Devon did what he did because he’s a liberal or to make a statement,\" the friend said, according to the Daily Mail. \"He did it due to internal struggles. They’re both struggling with mental health issues and this is a time for awareness.\"", "About McKinney, the friend said: \"Had people supported him in the way that he needed and deserved, he would not have struggled so much that he got pushed over the edge.\"", "The Denver7 TV station reported on May 8 that Douglas County Sheriff Tony Spurlock said the incident was \"too new\" to establish a motive, though unnamed sources are cited as saying \"the motive went beyond bullying and involved revenge and anger towards others at the school.\"", "Our ruling", "A Facebook post claimed that a Colorado school shooter is a \"transsexual, Trump-hating, Christian-hating, leftist freak\" and that the media hasn’t reported on those facts. Journalists have reported that one of the STEM school shooters is transgender and that some of the other shooter’s social media posts were critical of Trump and Christians. We rate this post False.", "Facebook post, May 9, 2019", "The New York Times, \"School shooting leaves 1 student dead, 8 injured,\" May 7, 2019", "The Washington Post, \"Colorado shooting suspects will both be tried as adults,\" May 15, 2019", "Reuters, \"Two students arrested in Colorado school shooting make first appearance,\" May 7, 2019", "Buzzfeed, \"The Colorado STEM school shooting suspects have been charged with murder,\" May 15, 2019", "The Wall Street Journal, \"Attackers in Denver-area school shooting appear in court,\" May 8, 2019", "The Denver Post, \"STEM school shooting; classroom heroes lauded…\" May 8, 2019", "New York Post, \"Devon Erickson, Colorado school shooting suspect, shared anti-Trump post on Facebook,\" May 8, 2019", "New York Post, \"Inside the online posts of Colorado shooting suspect Maya McKinney,\" May 9, 2019", "Daily Mail, \"Transgender Denver high school student is identified as ‘second gunman’...\" May 8, 2019", "Denver7, \"Source: Investigators believe suspects in STEM School shooting stole guns from parents of 1 suspect,\" May 8, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]