["About this rating", "According to the medical literature, drinking turpentine does impart a scent resembling violets to urine, which was known to physicians in first-century Rome.", "The imparted floral scent is that of violets, not roses.", "We have encountered no documentary evidence to the effect that women in ancient Rome commonly used this method to sweeten the smell of their urine.", "One of those fascinating tidbits of historical \"fact\" that circulates perennially on the Internet holds that women in ancient Rome drank turpentine, a toxic solvent (better known as paint thinner) distilled from the resin of pine trees, to make their urine smell \"like roses.\"", "Here's an example from Facebook:", "This specimen is from Twitter:", "In Ancient Rome, women would drink turpentine to make their urine smell sweet like roses https://t.co/uH5p8ooymp", "— Facts Zone (@facts_zone) April 8, 2016", "We also find the claim set forth in a 30 May 2013 article by natural health entrepreneur Joseph Mercola explaining what, according to him, the color and odor of one's urine says about the state of one's health:", "If you're a woman from ancient Rome and your urine smells like roses, you've probably been drinking turpentine. This is a high price to pay to woo your suitor with pleasant-smelling pee, as turpentine may kill you!", "A version posted in article entitled \"Bizarre Facts About ... Pee!\" on the web site Neatorama.com in 2010 repeated the claim that it was a practice indulged in by women, but that its origin wasn't necessarily so ancient:", "Asparagus isn't the only thing some people smell in urine. Drinking turpentine is said to make urine smell like a rose, so hundreds of years ago, women would drink turpentine so their piss would smell sweet.", "Despite the fact that no one ever cites a source for it, the claim has a plausible enough ring. As most people are aware, the things we consume can directly affect the appearance and smell of our urine. Two of the most common examples, as noted by the Harvard Medical School web site, are beets and asparagus:", "Beets, blackberries, and rhubarb can temporarily turn urine pink or red, which can be alarming, because it may be mistaken for blood. The pigment that gives beets their deep magenta color is stable only at certain levels of stomach acidity and is usually too faint to show up in most people's urine. The phenomenon — dubbed \"beeturia\" — occurs in only about 10% to 14% of the population. Even if you're in that select group, eating beets won't always have a visible effect, because the acidity of your stomach (and therefore your urine) depends on when you ate and what else you ate. Rhubarb can also turn urine dark brown or tea-colored, as can fava beans and aloe. Carrots, carrot juice, and vitamin C can color urine orange, and B vitamins can turn it a fluorescent yellow-green.", "Asparagus sometimes gives urine a greenish tinge and a distinctive smell, said to resemble rotting cabbage. The cause of this smell is a matter for speculation. Some blame it on the sulfur-containing fertilizers used on asparagus plants (there is no record of the vegetable causing urine odor before such fertilizers were introduced). Others suggest that only people who carry a particular gene break down the sulfur-containing proteins in asparagus and release the odor. Still another view is that the smell of everyone's urine undergoes a change, but only some of us notice it.", "It's not a vast leap from beets and asparagus to claiming that drinking turpentine imparts a floral aroma (and some say a pink tinge) to the urine. As a matter of fact we find that confirmed in any number of legitimate medical texts — except the specific floral scent they name, oddly, is never that of roses, but rather of violets!", "For example, the Toxnet database of the U.S. National Library of Medicine (NLM) states that \"Turpentine exposure can produce the odor of violets in urine.\" A Material Safety Data Sheet (MSDS) for gum spirits of turpentine lists \"painful urination with a violet-like odor of the urine\" as a health effect of acute exposure to turpentine via inhalation. The definition of \"turpentine poisoning\" on Drugs.com states that \"symptoms include hematuria, albuminuria, and coma; the urine may have an odor of violets.\"", "This characteristic of turpentine has been recognized by medical practitioners for centuries, in large part, no doubt, because turpentine itself was once regarded as a medicine. The 1911 edition of the Encyclopedia Britannica lists turpentine's \"pharmacological\" qualities, among which are: \"The drug is excreted partly by the bronchi — which it tends to disinfect — and partly in the urine, which it causes to smell of violets.\"", "Abraham Rees' The Cyclopaedia: Or, Universal Dictionary of Arts, Sciences and Literature, published in 1819, contains a discussion about which of several varieties of turpentine works best as a diuretic, noting that all of them \"seem to act in a peculiar manner on the urinary organs, impregnating the water with a violet smell, even when applied externally, particularly the Venice sort.\"", "\"A few Stems of Asparagus eaten, shall give our Urine a disagreable Odour,\" wrote Benjamin Franklin in a satirical 1781 letter to the Royal Academy of Brussels, \"and a Pill of Turpentine no bigger than a Pea, shall bestow on it the pleasing Smell of Violets. And why should it be thought more impossible in Nature, to find Means of making a Perfume of our Wind than of our Water?\"", "The 1749 edition of Pharmacopoeia Universalis: or, A New Universal English Dispensatory by Robert James notes that turpentine sourced from Cyprus, in particular, \"gives a Violet Smell to the Urine, even when given in a clyster. It is an excellent Diuretic, and very proper in Ulcers of the Kidneys, Bladder and Uterus.\"", "What we not been able to find, however, is any record of the use of turpentine by women in ancient Rome (or anywhere else thereafter) specifically to lend their urine a floral scent. While it's certainly possible that this was the case, no historical sources have been cited by those making the claim.", "Franklin, Benjamin.   \"Fart Proudly.\"\r\n    TeachingAmericanHistory.org.   Visited 17 April 2017.", "James, Robert.   Pharmacopoeia Universalis: or, A New Universal English Dispensatory.\r\n    London: J. Hodges and J. Wood, 1747   (p. 453).", "Pliny the Elder.   The Natural History.\r\n   Perseus Digital Library.   Visited 17 April 2017.", "Rees, Abraham.   The Cyclopaedia: Or, Universal Dictionary of Arts, Sciences and Literature, Vol. 36.\r\n   London: Longman, Hurst, 1819.", "Santoso, Alex.   \"Bizarre Facts About ... Pee!\"\r\n   Neatorama.com.   8 April 2010.", "Encyclopedia Britannica.   \"Turpentine.\"\r\n   Chicago: Encyclopedia Britannica Company, 1911, vol. 27, pg. 481.", "Harvard.edu.   \"MSDS: Gum Spirits of Turpentine.\"\r\n   24 May 1995.", "Harvard.edu.   \"Urine Color and Odor Changes.\"\r\n   June 2010.", "Mercola, Joseph.   \"What You Can Learn About Your Health by Analyzing the Color and Smell of Your Urine.\r\n   Mercola.com.   30 May 2013.", "Toxnet.   \"Turpentine.\"\r\n   U.S. Library of Medicine.   19 October 2015.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]