["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "As U.S. President Donald Trump faced political fallout from his June 20, 2020, rally in Tulsa, Oklahoma, many speculated about the health consequences of the large gathering due to the ongoing COVID-19 coronavirus pandemic. One such speculation took place on MSNBC's \"All in With Chris Hayes\" program, where on June 29, the anchor addressed a spike in COVID-19 cases in the state.", "Though Hayes emphasized there was no way to confirm cause and effect, his analysis led to an incorrect theory that the rally resulted in two days of 100% positive COVID-19 tests a week later. In a later segment, Hayes clarified that the data he presented was incomplete.", "We will address this claim starting with the initial misreport, followed by a look at the actual data, and then the clarification.", "On June 29, Hayes reported that positive COVID-19 test rates in Oklahoma had skyrocketed. He said:", "And it comes less than 10 days after that infamous Tulsa, Oklahoma, rally where even with the arena far from full, you still had thousands of people gathered in an indoor space cheering and screaming in a city that had just seen a spike in cases and in violation of every single recommendation for safety ... And while we never know cause and effect exactly, particularly in the moment, it’s hard to figure out what the exact impact of that rally looks ... Look at this: yesterday in Oklahoma, they tested 352 people for the coronavirus, and every single test came back positive. Today they tested another 178 people, and all those tests came back positive, too. If you can’t do the math in your head, that’s a 100% positive rate.", "According to data the show cited from The COVID Tracking Project on those dates, there did appear to be a 100% COVID-19 positive testing rate. On June 28 and 29 respectively, the data showed 352 and 178 tests were conducted and reported positive (see table below). This was in stark contrast to June 30 numbers that showed more than 15,000 tests had been conducted, and the number of negative cases had risen.", "However, Hayes’ language led to misinterpretation. PoliticusUSA, a news organization, reported Trump’s rally \"may have [had] an impact on the spread of coronavirus in the state.\" Numerous tweets linked the two events together more directly.", "But the reality was not so simple. We found some lags in the government's reporting after looking at the Oklahoma health department’s daily executive order reports, which provide updated cumulative COVID-19 data for the state, and speaking with Paul Monies, a reporter with Oklahoma Watch, a non-profit investigative journalism outlet. Those lags generally mean that percentages pinned to any specific day can be problematic.", "Each government report — only issued on weekdays — shares data from midnight of the previous day, so the Monday report would conceivably share new information from Sunday, in addition to cumulative data. Monies suggested that many labs with COVID-19 tests were closed on weekends, or worked limited hours, so complete numbers of COVID-19 tests would be released during the regular work week in government reports. Indeed, each report indicates with an asterisk which labs were closed on weekends.", "The COVID Tracking Project’s reporting showed that on some weekends, negative specimens' numbers remained unchanged. For example, the government did not release reports for July 3, 4, and 5 during the Fourth of July break, so The COVID Tracking Project reflected the negative specimens' data from the July 2 report for those three days, a cumulative total of 348,789. The same lag happened on June 27, 28, and 29, where the number of negative specimens remained unchanged in reports (313,021), and The COVID Tracking Project reflected data from the government's June 26 report. In other words, reporting delays impacted both the data reported by the government and the data that The COVID Tracking Project pulled from the government.", "We also noticed that the state reported large batches of negative tests on Tuesday mornings. For this reason, looking at positive percentage rates on specific days was not useful, Dillon Richards, an Oklahoma City reporter with KOCO News, told us.", "On July 1, Hayes issued a correction:", "... those numbers I cited on Monday did not provide a clear or complete picture because they were not the final numbers for Oklahoma’s weekend testing. I have a cardinal rule that I violated there, that if a statistic sounds too wild to be true, it probably is ...", "PoliticusUSA also subsequently corrected its report. Hayes told Snopes:", "... our reporting of what the state had published *was correct* ( I was so incredulous I actually checked it manually myself!) but it was a byproduct of a bad reporting system that is lumpy and misleading.", "All of that said, Trump’s June 20 rally did violate numerous health recommendations from experts, took place when COVID-19 cases were rising in the state, and may have resulted in some positive cases. But no one has traced the increased number of cases to that one event. Oklahoma is also one of the unhealthiest states in the country, a potential factor in rising numbers.", "In sum, even though the rally may have increased risk for attendees, its connection to rising COVID cases is difficult to prove. The 100% positive test rate was also misreported, and Hayes issued a clarification. We therefore rate this claim as \"False.\"", "Brown, Trevor.   \"Experts: Oklahoma, Among the Unhealthiest States, Faces Heightened Risks for COVID-19.\"\r\n   Frontline PBS.   16 April 2020.", "Colarossi, Sean.   \"Correction: MSNBC’s Chris Hayes Misinterpreted Oklahoma Virus Test Data.\"\r\n   PoliticusUSA.   29 June 2020.", "Coronavirus.health.ok.gov.   \"Executive Order Reports.\"", "Gupta, Sanjay and Andrea Kane.   \"How Risky is it to Attend a Trump Campaign Rally During a Pandemic?\"\r\n   CNN.   19 June 2020.", "Lutz, Tom.   \"Brad Parscale Faces Trump 'Fury' After Tulsa Comeback Rally Flops.\"\r\n   The Guardian.   21 June 2020.", "Regan, Helen, Marsh, Jenni, Rahim, Zamira.   \"Coronavirus Pandemic: Updates From Around The World.\"\r\n   CNN.   21 June 2020.", "The COVID Tracking Project.   \"Oklahoma.\"", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]