["The three-minute 47-second clip was published here on Facebook on August 26, 2020. It has been viewed more than 15,000 times.", "The post’s caption reads: “Flood in China”.", "The video was also shared alongside a similar claim on Facebook here and here.", "However, the claim is false.", "Reverse image and keyword searches on Google found that the footage in fact shows a tsunami that hit Japan’s Miyagi prefecture in 2011. A longer version of the video was published here on YouTube on December 18, 2011.", "The Japanese caption translates to English as: “Ishinomaki city Tsunami TSUNAMI JAPAN 3.11/2011”.", "The video’s English caption reads: “‘Ishinomaki-shi Tidal wave’ eastern Japan great earthquake  A picture in Ishinomaki-shi, Miyagi. I suggest you be rubbed by such tidal wave, it can't be done. I take a picture from a roof of Ishinomaki gas. 2-3-48, Myojincho, Ishinomaki-shi, Miyagi”.", "The tsunami swept through much of Japan’s northeastern shoreline after a powerful earthquake struck the seabed off Miyagi on March 11, 2011. The disaster killed almost 16,000 people with more than 2,500 still missing, AFP reported here.", "Below is a side-by-side screenshot comparison of the video in the misleading post (L) and the YouTube video (R):", "AFP also covered the 2011 devastation in Ishinomaki in a video report here.", "Other false claims about the video shared in the misleading posts have previously been debunked by AFP. Those claims wrongly stated that the footage showed the collapse of a hydropower dam in Laos in 2020; flooding during Typhoon Hagibis in 2019; and a tsunami in Indonesia in 2018.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]