["“An Exclusive picture of the patient’s Throat infected with Coronavirus Covid19,” says text on an image shared here and here in English and also in Spanish since at least April 12, 2020 on Facebook. The picture has also been shared on Instagram and Twitter.", "AFP Fact Check conducted a reverse image search and determined that the photo was posted on Reddit on May 29, 2018.", "“Is this normal looking strep throat? Lots of white spots on tonsils and even on the back of my throat,” asks the user who posted the photo.", "Asked about the photo, Dr. Fernando De La Hoz, epidemiologist and director of the Department of Public Health at the National University of Colombia, told AFP in Spanish that “this is not typical of the coronavirus.”", "The novel coronavirus is a viral infection and according to De La Hoz, “these lesions appear bacterial.”", "The same user who shared the photo on Reddit later published a message explaining that, after taking a laboratory test, they were diagnosed with “Mersa in the throat.”", "According to the US Centers for Disease Control and Prevention, MRSA is “methicillin-resistant Staphylococcus aureus, a type of bacteria that is resistant to several antibiotics.”", "Throat pain is one of the symptoms of COVID-19 according to the World Health Organization.", "The novel coronavirus was first discovered in December 2019 in the Chinese city of Wuhan and has since spread across the world. More than 2.4 million cases and 166,000 deaths have been reported as of April 20, 2020 according to Johns Hopkins University.", "AFP Fact Check has debunked more than 340 false and misleading claims about COVID-19.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]