["About this rating", "Waterworld hosted a single \"women-only\" private event aimed at Muslims in 2015.", "Aside from private events, no dress codes were altered at Waterworld, and no Muslims expressed that they were offended by the wearing of bikinis at the waterpark.", "On 13 June 2016 (one day after the 12 June 2016 Orlando nightclub shooting), the web site This Is England published a \"breaking\" item titled \"BRITISH waterpark bans bikinis and DEMANDS visitors wear ‘Islamically appropriate’ clothes.\"", "The item was shared quite a bit on Facebook and Twitter, where readers were exposed only to the headline and came away with the impression that Waterworld imposed an Islam-friendly dress code on the entire park at all times. However, the item's content immediately revealed that the headline referenced a single event scheduled when the park was closed:", "WaterWorld in Stoke-on-Trent plans to black out windows and provide a prayer room during a women-only night aimed at Muslims.", "Only female lifeguards will patrol the park during the event, which has triggered a flood of complaints.", "Staff will also “guard” the front entrance to “make sure that no males enter the facility”.", "In a statement on its Facebook page, a spokesman for WaterWorld said the Sisters Only event would “attract ladies of all religions/beliefs as we invite you to visit our facility and enjoy its features whilst having the option of wearing attire that our normal operating procedures prevent”.", "Conservative MP Philip Hollobone said: “I imagine there would be a lot of outrage if the boot was on the other foot and swimmers were told they had to dress appropriately in respect of Christians. I don’t see how this is different.”", "One invitation to the “Sisters Only Funday” advises attendees to cover their “awrah” (nudity) by wearing full-length jogging bottoms and a dark-coloured t-shirt.", "Protesters are now planning to demonstrate outside the event.", "WaterWorld owner Mo Chaudry said: “I’m astonished that we have been targeted. We feel we’ve been victimised for offering something that we feel there is a demand for.”", "The session is scheduled to take place outside the centre’s normal opening hours, meaning it would not restrict access to the facilities for those who did not want to comply with the additional dress requirements, the statement added.", "Not only did the headline tell an entirely different story than the content, the claim wasn't even recent to its publication date of 13 June 2016. Far from being \"breaking news,\" both the header image and the content matched an article published in the tabloid Express a full year earlier.", "On 14 June 2015, Waterworld published a Facebook post clarifying that Muslim night was one of several events scheduled for hours after the park had closed to the general public for the day. Other such special events included clothing-optional events, male-only nights, teen nights, inclusive nights for disabled customers, and holiday events:", "So while it was true Waterworld listed a Muslim night for female visitors among its roster of after-hours events, it was one of at least seven events of its type (including ones that catered to nude customers and solely men). The park in no way \"banned bikinis\" nor demanded folks wear \"Islamically appropriate\" attire, and the event in question was among several private nights held at Waterworld in 2015. The recurring social media outrage mirrored a similar controversy in the U.S. over \"Muslim Family Day\" at Six Flags locations.", "Campbell, Scott.   \"UK Waterpark Bans Bikinis And Orders Visitors to Wear 'Islamically Appropriate' Clothes.\"\r\n    Express.   14 June 2015.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]