["About this rating", "A photograph shows an Islamic message displayed on a London bus.", "The British government banned recitation of the Lord's Prayer in UK cinemas.", "On 4 December 2015 a Facebook user shared the above-reproduced status update and photograph, with the former reporting that:", "I do recall, just last week, the Lords Prayer was banned in cinema's.\nToday, with Government support, these busses were all over London!\nI am not offended by the message... Just \"Fucked off\" that Christianity has to take a \"back-seat\" in a Christian country!!!", "The user's claim that the buses were \"all over London\" on 4 December 2015 was demonstrably false; reverse image searches for the photo used by that individual were dated to January 2015 (nearly a year earlier):", "Prophet Muhammad (sws) The light of life Teacher of the truth Blessing for the believers This is the united kingdom pic.twitter.com/VA2ots8hTc", "— R.S Lebanon (@FilsSole) January 10, 2015", "After the photograph of the Islamic message on a London bus initially appeared in January 2015, it was later recirculated with a claim that the banner had been attached to the bus by order of the British government:", "London buses started today (friday) by order of the British government with the following poster:\n\"Prophet Muhammad,\nThe light of life\nTeacher of truth\nA blessing for the believers\"..", "We were unable to substantiate any involvement by the British government in the use of the banner, but its visual style doesn't match official government signage, and the placement outside the bus appears atypical for advertisements on public transport in the UK. Although we were unable to locate a complete explanation for the banners, a commenter to the Facebook post suggested that they were displayed on buses engaged as transport for a private event:", "This was [taken] last year. It was for a Muslim festival [and the bus] was hired out from the bus company. I'm a big part of anti-jihad, but spreading bollox is pathetic.", "While the source of the banner remains unclear, the photograph in question was taken on 9 January 2015 at the latest (and wasn't from 4 December 2015).", "The poster additionally claimed that \"the Lords Prayer was banned in cinema's [sic],\" which was also not entirely accurate. A 22 November 2015 BBC article reported that a cinema chain management agency had rejected a Church of England advertisement. That advertisement included the Lord's Prayer and was turned down because its overall content was deemed too overtly religious (a policy that broadly applies to both political and religious content in cinema ads):", "The Church of England has said it is \"disappointed and bewildered\" by the refusal of leading UK cinemas to show an advert featuring the Lord's Prayer.", "However, the Digital Cinema Media (DCM) agency, which handles British film advertising for the major cinema chains, Odeon, Cineworld and Vue, refused to show the advert because it believed it would risk upsetting or offending audiences.", "In a statement, DCM said it had a policy of not accepting political or religious advertising content in its cinemas.", "It said that \"some advertisements — unintentionally or otherwise — could cause offence to those of differing political persuasions, as well as to those of differing faiths and indeed of no faith,\" and that \"in this regard, DCM treats all political or religious beliefs equally\".", "On 23 November 2015, the Guardian reported that:", "According to the advertising policy on DCM's website, to gain approval an advertisement must not \"in the reasonable opinion of DCM constitute political or religious advertising\".", "That meant \"advertising which wholly or partly advertises any religion, faith or equivalent systems of belief (including any absence of belief) or any part of any religion, faith or such equivalent systems of belief\".", "That piece quoted a British ad industry exec, who asserted that accepting the Church of England's ad would open the door for in-cinema proselytizing :", "However, one of the UK's leading advertising figures backed the ban. John Hegarty, who co-founded the top agency Bartle Bogle Hegarty, said it was right to have a ban on political and religious advertising in cinemas.", "\"People pay money to go to the cinema, very diverse audiences, and they really don't want religion dictating to them,\" he said. The subject matter was completely different from brands, such as trainers or soft drinks. \"Religion deals with profound philosophical belief.\"", "If an advertisement on behalf of the church was accepted, he said, it would be difficult to draw the line at adverts for Scientology or Jehovah's Witnesses.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]