["About this rating", "If you or someone you know is experiencing a mental health, suicide or substance use crisis or emotional distress, reach out 24/7 to the 988 Suicide and Crisis Lifeline (formerly known as the National Suicide Prevention Lifeline) by dialing or texting 988 or using chat services at suicidepreventionlifeline.org to connect to a trained crisis counselor.", "In March 2021, the controversial English broadcaster and former tabloid newspaper editor Piers Morgan left ITV's \"Good Morning Britain\" after he became the subject of widespread criticism, including from his own colleagues, for the substance and tone of his response to Prince Harry and Meghan Markle's high-profile March 7 interview with Oprah Winfrey.", "Morgan habitually attacks and criticizes the couple, and in particular Markle, on his Twitter account, and suggested the former actor was lying when she told Winfrey that she had contemplated suicide due to what she described as a lack of support from other members of the British royal family.", "Morgan has a long track record of feuding with and targeting other public figures, especially those within the celebrity and media worlds on both sides of the Atlantic. In the aftermath of Morgan's departure from \"Good Morning Britain,\" one particularly striking quotation was shared widely on social media and attributed to the English actor and activist Jameela Jamil.", "The details and substance of that quotation go beyond the scope of this particular fact check, which is focused specifically on the authenticity of the remarks attributed to Jamil.", "On March 10, for example, the Facebook page NowThis Entertainment, posted a meme that contained a photograph of Jamil, who is probably best known her role in the NBC sitcom \"The Good Place,\" along with the following text:", "I almost killed myself a year ago because of Piers Morgan’s relentless campaign of lies and hatred against me last February. I’m glad I’m still alive today for many reasons. But watching him leave GMB today is right up there...", "The same quotation, along with another picture of Jamil, was included in a similar meme posted to Instagram by the Australian news website News.com.au:", "On Facebook, users widely shared those memes and other content including the same quotation. The following screenshot illustrates the popularity of the Jamil quotation on Facebook in March 2021:", "That quotation was authentic and was accurately attributed to Jamil. As a result, we are issuing a rating of \"Correct Attribution.\"", "Jamil made the statement in question in a tweet she posted on March 9, 2021:", "She was referring to a widely publicized dispute between her and Morgan that took place in early 2020 and followed an earlier online conflict between the two in 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]