["About this rating", "U.S. Rep. Ilhan Omar, D-Minn., has for several years been the target of rumors and misinformation, much of it related to her personal background as a former refugee from Somalia who became one of the two first Muslim women to be elected to the U.S. Congress, in 2018.", "In August 2019, some of her critics and opponents promulgated a photograph that falsely described Omar cleaning a firearm as part of her training at \"jihad academy.\" (The photograph was taken in 1978, before Omar was born.)", "And weeks later, another doctored photograph emerged on social media, this time purporting to show the Minnesota Democrat smiling and sitting among armed terrorists:", "A PICTURE SPEAKS A THOUSAND WORDS? https://t.co/7DKauCOpaI", "— Cami (@CamiP934) August 19, 2019", "The picture was a fake and consisted of an image of Omar's face digitally superimposed onto a photograph of a news conference held by the al-Qaida-linked terrorist group al-Shabab.", "The picture of Omar was taken by Associated Press photographer J. Scott Applewhite on Nov. 15, 2018, as the then-U.S. representative-elect was walking to a meeting of Democrats at the Capitol building in Washington, D.C.:", "Rep.-Elect Ilhan Omar says she'll work to lift ban on religious headwear in Congress https://t.co/US2IMzHbN7 pic.twitter.com/CMpuHNleII", "— Yahoo News (@YahooNews) November 19, 2018", "The section containing her head and scarf was then digitally extracted and superimposed onto the second photograph. That picture was taken by the Reuters photographer Feisal Omar and shows an al-Shabab news conference in Mogadishu, Somalia, on Dec. 14, 2008:", "Going green? Somali terrorist group’s plastic bag ban aims to protect ‘humans and animals’ — RT World News https://t.co/VhqqeV43AC", "— Sara Hamdy (@Sara_HOmar) July 4, 2018", "The result of the digital manipulation was the fake and inflammatory image shared online in August 2019:", "A PICTURE SPEAKS A THOUSAND WORDS? https://t.co/7DKauCOpaI", "— Cami (@CamiP934) August 19, 2019", "Evon, Dan.  \"Did This Picture Show U.S. Rep. Ilhan Omar in 'Jihad Academy'?\"\r\n  Snopes.com.  21 August 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]