["About this rating", "On 5 April 2018, the Your News Wire web site published an article reporting that a Centers for Disease Control and Prevention doctor who supposedly had warned the public that flu shots had caused a \"deadly flu epidemic\" was found dead:", "The body of the missing CDC doctor who controversially warned that this year’s “disastrous” flu shot was responsible for the deadly flu epidemic, was found in an Atlanta river on Tuesday evening.", "Dr. Timothy J. Cunningham, 35, a team lead with CDC’s Division of Population Health, went missing on February 12th, according to Atlanta police, with family and police desperate for answers regarding his sudden disappearance.", "In January, Dr. Cunningham shared his opinion that this year’s flu shot was behind the deadly outbreak of the flu, while warning that if his name was attached to the widely-circulated quotes, he would lose his job – or suffer an even worse fate.", "It is true that the body of Timothy Cunningham, an epidemiologist at the Centers for Disease Control and Prevention, was found in an Atlanta river more than six weeks after he was reported missing. (The circumstances of his drowning death have not yet been determined.)", "However, no credible information documents that Dr. Cunningham had opined that flu shots were actually responsible creating a flu epidemic. Your News Wire is a fake news site that has published multiple false articles about the alleged deleterious effects of flu shots, and their \"reporting\" in this case cited nothing other than their own fabricated material.", "As Atlanta television station WXIA reported, Your News Wire's account was \"hollow of credible sources and verified facts\" and included multiple false statements. Moreover, Dr. Cunningham did not deal with infectious diseases and did not have access to sensitive information in that area:", "[Cunningham's disappearance] led conspiracy theorists to spin fantastic rumors online.", "Some claimed he knew the cure to cancer. Most believed he was holding back a CDC bombshell: that the flu vaccine caused the current epidemic.", "Our researchers traced that claim back to an article on a site called YourNewsWire.com from January 2018. The article quoted an anonymous CDC doctor who said, “we have seen people dying across the country of the flu, and one thing nearly all of them have in common is they got the flu shot.” While the article doesn't name Cunningham, some are outing him as the Whistleblower, saying it was too convenient he went missing.", "YourNewsWire.com made several false statements in their article including that the flu vaccine is only 10 percent effective (it's not — it's 36% effective according to health officials) and that 2018 has been the deadliest flu season (it hasn't — in 1918 the epidemic killed millions according to National Archives).", "The article says not to trust 'Big Pharma' and the 'Mainstream Media.' It was hollow of credible sources and verified facts.", "We checked with police and they say they are aware of these conspiracies. They say Cunningham wasn't authorized to see classified information.", "\"Dr. Cunningham worked in the chronic disease unit, which is not the infectious disease unit, he had no access to classified material,\" [Major Michael] O'Connor [of the Atlanta Police Department] said.\"[The CDC doesn't] believe that his employment would be cause for something like that to occur because he simply doesn't have access to those types of things.\"", "Harris, Niamh.   \"Body of CDC Doctor Who Exposed Flu Shot Found Floating in River.\"\r\n    Your News Wire.   5 April 2018.", "Block, Eliana.   \"Here's Why the Missing CDC Scientist Is Not a Flu Vaccine Whistle Blower.\"\r\n    WXIA-TV [Atlanta].   8 March 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]