["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This post is an unsubstantiated warning.", "Local police in a Canadian city where the post appears to have originated said there have been no reports of sex traffickers using the zip-tie contraption shown.", "Nonprofit organizations working to combat human trafficking said they have not identified the zip-tie method as a trend. Trafficking is not always physical or between strangers.", "Social media users are warning women to be careful if they discover zip ties looped around the door handles of their cars and the cars parked nearby.", "\"Sex traffickers are using this contraption to trick females into looking down and digging for something in their purse to cut with after returning to their vehicle and seeing this,\" the posts, including one posted to Facebook on Jan. 15, say. \"Once they’re distracted, boom! They are quickly forced into another vehicle, never to be seen again by their people.\"", "The posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Human trafficking is a legitimate threat that affects millions of people. But the method isn’t as widespread as the social media posts make it out to be.", "The posts are similar to another alarmist hoax we debunked related to zip ties and sex trafficking.", "A screenshot of a viral Facebook post warning women about a zip-tie contraption allegedly used by sex traffickers to distract women.", "We searched news archives for reports of sex traffickers using zip ties and found no record of the contraption described in the social media posts being used to distract women at their cars.", "We read about these posts in multiple reports from news outlets in Canada. According to those reports, the image started making the rounds in January, with posters claiming an incident occurred at a mall in the city of Burnaby. A separate post circulating at the same time said sex traffickers were also placing $100 on car doors as a different form of distraction.", "Burnaby police said on Twitter that they were aware of the posts and that they were \"unable to find any report or investigation that fits this criminal activity.\" They said the information in the posts was causing \"unnecessary concern\" to city residents.", "The FBI declined to comment when asked if incidents involving the zip-tie contraption had cropped up in the United States.", "The Polaris Project, a nonprofit organization that works to combat human trafficking, said they haven’t identified the method as a trend.", "Human trafficking often occurs between people that know each other, rather than complete strangers, and it doesn’t always involve a form of physical restraint, the group said.", "\"By far the most pervasive myth about human trafficking is that it always — or often — involves kidnapping or otherwise physically forcing someone into a situation,\" the Polaris Project said. \"In reality, most human traffickers use psychological means such as tricking, defrauding, manipulating or threatening victims.\"", "Shared Hope International, a nonprofit, Christian organization with a similar mission, told us that \"trafficking victims are generally not kidnapped or taken away from their families abruptly.\"", "The bottom line: It’s important to stay aware of your surroundings, and should you want to report or seek services related to a case of human trafficking, you can contact the National Human Trafficking Hotline at 1-888-373-7888 or email [email protected].", "But the Facebook posts about zip ties — like similar posts before it — are an example of an unsubstantiated warning.", "We rate this post False.", "Facebook post, Jan. 15, 2020", "Narcity, \"Viral Social Media Posts About Human Trafficking In Canada Are Fake According To Police,\" Jan. 19, 2020", "Burnaby RCMP on Twitter, Jan. 17, 2020", "CTV News, \"Posts about $100 bills, zip ties left by sex traffickers believed to be a hoax: police,\" Jan. 17, 2020", "Daily Hive, \"Viral sex trafficking social media posts appears to be hoax: Burnaby RCMP,\" Jan. 17, 2020", "WKYC, \"VERIFY: Are those viral posts about human traffickers using zip ties and vans to abduct women real?\" Jan. 8, 2020", "WUSA9, \"VERIFY: Is this social media warning about human traffickers zip-tying windshield wipers on cars real?\" Dec. 6, 2019", "Snopes, \"Are Sex Traffickers Leaving Zip Ties on Cars, Mailboxes of Potential Victims?\" July 29, 2019", "PolitiFact, \"No, sex traffickers aren’t using zip ties to mark victims or abduct women,\" Nov. 15, 2019", "Statement from the Polaris Project, Feb. 28, 2020", "Statement from Shared Hope International, Feb. 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]