["To Elizabeth Warren’s list of plans, add improving rural broadband. In an op-ed in the Washington Post, Warren wrote that over 21 million Americans lack access to high-speed broadband. She blamed the major internet service providers, such as Verizon, Comcast, AT&T and Charter, for profiting at the expense of rural communities and others.", "\"We lag behind many other developed nations in connectivity and speed, while also paying more for that service,\" Warren continued.", "We decided to see where the United States stands compared with its peers.", "Trying to measure this is challenging but Warren’s comments are broad enough that experts say it’s generally accurate. The United States does lag behind other nations by some measures, but rarely is it among the worst performers and it has also gained ground in recent years when it comes to its high speed offerings.", "Warren cited the latest numbers from the Federal Communications Commission. The agency looks at speed, price and the reach of broadband in 26 countries, plus the United States.", "The list includes Australia, Austria, Belgium, Canada, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Iceland, Ireland, Italy, Japan, Latvia, Luxembourg, Netherlands, New Zealand, Norway, Portugal, South Korea, Spain, Sweden, Switzerland, and the United Kingdom.", "Some things to note when making international comparisons: The United States is less densely populated than Europe, which raises costs here. Fixed broadband and mobile broadband are measured separately, and rankings can vary. The 21 million figure Warren cites in her claim refers to those without a fixed, on-the-ground connection.", "Michael J. Santorelli, director of the Advanced Communications Law and Policy Institute at New York Law School, urged caution when comparing nations on this topic.", "\"Each country’s broadband market is highly unique, having been shaped by factors like regulatory regime, population density, income, and consumer demand, among many others.\"", "With that in mind, here’s some of what the FCC found based on 2016 numbers.", "For fixed broadband, the United States ranked 10th on download speed. The tiny country of Luxembourg was way out in the lead with a median download speed of 358 Mbps (megabits per second). After Luxembourg, the speed drops fast. No. 2 Iceland posted a speed of 96 Mbps. The United States was in a tight cluster in the 55 Mbps range, with Spain and Denmark a little faster, and Norway and Portugal a little slower.", "Rankings are always a little dicey, because sometimes, tiny differences in speed put one country above another.", "University of Pennsylvania law professor Christopher Yoo, who specializes in communications and information technology matters, noted that the United States has gained ground over the years. In 2012, the United States ranked 25th for fixed broadband.", "\"We seem to be in the top half and getting better,\" Yoo said.", "On a similar measure for mobile broadband, the United States ranked 24th. With a speed of about 41 Mbps, the Netherlands was the winner. The United States clocked in about 19 Mbps, below Portugal, Italy and Czech Republic.", "The FCC has three ways to come up with prices to compare across all the countries. It uses average prices, and two other approaches that factor in the value of the service as well as variables like population size and density.", "The results from the different methods vary widely: When it comes to average price, the United States ranks 18th. But when measured using the FCC’s more nuanced methods, it ranks 7th for fixed connection and 10th for mobile.", "Penn State telecommunications professor Rob Frieden generally agrees with Warren’s summary, but he says the big picture can mask that some American customers do better than their foreign counterparts.", "\"For so-called bandwidth hogs who stream lots and lots of video, the U.S. offers some of the lowest cost per megabit transmission speed and megabyte data delivered,\" Frieden said.", "A British firm called, appropriately, Cable, also collects broadband price information worldwide. In its 2018 survey, based on average monthly cost, the United States ranked 23rd among a list of countries that is similar, but not identical, to the FCC’s list.", "This is the area where the FCC report delivers more mixed signals.", "The United States ranks 10th overall for the percentage of the population reached by its fixed broadband networks. For rural areas, the country ranks 9th.", "But the FCC has no breakdown by country for mobile broadband.", "Instead, the study compares the United States to a group of 21 European nations. In that light, the United States does better overall, but especially in rural areas: 98% of rural U.S. households have high-speed service. For the 21 EU nations, the fraction slips to 83%. But, using this FCC snapshot as a guide, we don’t have a clear picture of how the United States’ population using mobile broadband stacks up against countries that are not mentioned in this section of the report.", "Warren said that the United States lags \"behind many other developed nations in connectivity and speed, while also paying more for that service.\"", "Her words are sufficiently broad to fit the government report she cited, but the numbers show the United States generally in the middle of the pack for speed, price and reach.", "While the top performing nations might stand out, in many cases, small differences in values determine their placement in the rankings.", "Warren’s statement is generally accurate, but it needs context.", "We rate this claim Mostly True.", "Washington Post, Elizabeth Warren: Here’s how we get broadband Internet to rural America, Aug. 27, 2019", "Federal Communications Commission, International Broadband Data Report, Feb. 2, 2018", "Broadband Now, FCC Report Concludes US Internet Speeds Are ‘Among Worst in the Developed World’, Feb. 5, 2018", "Cable.uk, Worldwide Broadband Pricing, 2018", "New York Times, We Need a National Rural Broadband Plan, Feb. 6, 2019", "Email exchange, Christopher S. Yoo, professor of law, University of Pennsylvania Law School, Aug. 28, 2019", "Email exchange, Rob Frieden, professor oftTelecommunications and law, Penn State University, Aug. 28, 2019", "Email exchange, Michael J. Santorelli, director, Advanced Communications Law and Policy Institute, New York Law School, Aug. 28, 2019", "Email exchange, Chris Hayden, spokesman, Warren for President, Aug. 28, 2019", "Photo: Broadband box (Declan via Flickr Creative Commons license)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]