["About this rating", "In mid-July 2020, various Twitter users posted a video that they alleged showed former U.S. Vice President and presumptive Democratic presidential nominee Joe Biden participating in a \"blackface skit.\"", "Here is a screenshot of one such tweet:", "However, the video was misleadingly edited and in fact doesn't show a blackface incident.", "On July 9, 2020, Washington Examiner reported that during a \"$1,000-a-plate 1985 Democratic Congressional Dinner held at the Washington Hilton in Washington, D.C.,\" Biden made a racist joke and referred to singer Jerome Powell, who is Black, as Michael Jackson, \"soon to become Prince.\"", "Powell, who still performs, commented on the incident 35 years later. He was quoted by the Examiner as saying Biden's comment was a \"big mistake,\" noting that he is a big band singer in the tradition of \"Frank Sinatra, Nat King Cole, and Tony Bennett\" and that his performance style is nothing like Jackson or Prince, both pop singers.", "The Examiner story contains the original, unedited video.", "Washington Post political reporter Dave Weigel pointed out the misleading image on Twitter and also posted a screenshot from the original, unedited video in which Powell's face can be seen:", "Because the video was altered to make the false claim that Biden participated in a blackface incident at a fundraiser dinner in 1985, we rate this claim \"False.\"", "Halaschak, Zachary.   \"Joe Biden Introduced Black Singer as ‘Michael Jackson’ at Democratic Dinner.\"\r\n   Washington Examiner. 9 January 2020.", "Weigel, Dave.   Twitter thread.\r\n   16 July 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]