["About this rating", "In June 2015, several videos claiming that Samsung had planted a secret microchip on their cell phone batteries in order to steal data and photographs from customers' phones began circulating online:", "Samsung users beware...", "Posted by Paint Fade on Monday, June 22, 2015", "While it's true that this video clip has not been doctored and there is indeed a coil beneath the wrapping of the batteries included with many Samsung phones, the claim that what's seen here is a \"secret microchip\" used to steal data is false. The coil shown in the video is actually an NFC (Near Field Communication) antenna:", "The tech involved is deceptively simple. Evolved from radio frequency identification (RFID) tech, an NFC chip operates as one part of a wireless link. Once it's activated by another chip, small amounts of data between the two devices can be transferred when held a few centimeters from each other.", "Although this antenna allows Samsung users to share small amounts of data between two devices, that usage is hardly a secret — it is plainly stated in Samsung advertisements:", "NFC is used with many Google Android and Apple iPhone devices to enable applications such as Apple Pay and Google Wallet. It is also used to transfer photographs, contacts, and other small pieces of data.", "When iFixit published their \"tear down\" of the Samsung Galaxy Nexus, they included several videos of the battery and the NFC antenna:", "Not only does the 3.7 V, 1750 mAh battery power the phone, but the user manual states that it also doubles as the NFC antenna. O RLY? We had to see this one for ourselves.", "Lo and behold, there's a sweet antenna hiding underneath the battery's shiny wrapper. So if you ever want to buy a replacement battery (and keep NFC functional), ensure that the battery has the antenna.", "While there is a coil \"hidden\" in the wrapping surrounding most batteries included with Samsung phones, this is merely the NFC antenna and not a \"secret microchip\" used to steal data", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]