["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Governor Tom Wolf giving a budget address this February, as Speaker Mike Turzai and Lieutenant Governor Mike Stack look on. Credit: Governor Tom Wolf/Flickr", "Gov. Tom Wolf this week pushed for a severance tax on natural gas produced in Pennsylvania to help finance infrastructure improvements and a plan he hopes will put residents who lost their jobs in the pandemic back to work.", "He touted the proposed tax by describing Pennsylvania as an outlier in taxing natural gas drilling.", "\"We’re the only major gas-producing state in the U.S. that doesn’t have a severance tax,\" he said, referring to a tax on raw materials extracted from the ground.", "We wondered if that’s true.", "Wolf is right. Among the 34 states that produce oil or natural gas, Pennsylvania is the only one that doesn’t tax the extracted resources. (They’re called \"severance\" taxes because they tax materials severed from the ground.) Instead, Pennsylvania charges an annual impact fee for every gas well that’s drilled.", "The difference between the taxes levied by other big natural gas producers like Texas, Oklahoma, and Louisiana, and the fee Pennsylvania charges is the revenue they generate.", "The left-leaning Pennsylvania Budget and Policy Center has estimated that while the state’s impact fee will continue generating up to $227 million a year, a severance tax could bring in an additional $1.7 billion over five years.", "The particulars of the severance taxes imposed elsewhere vary by state.", "For example, Texas charges a 7.5% tax on the market value of oil and natural gas extracted within its borders. Oklahoma charges 7% of the gross value of oil and gas production, in addition to a fee on new wells drilled. Louisiana’s gas severance tax rate adjusts annually but never falls below 7%.", "Wolf first proposed a severance tax on natural gas drilling when he ran for governor in 2014, and he pitched one with the budget each of his first four years in office. All those efforts failed, so in 2019, after winning reelection, he tried a new approach — a tax whose revenue would be earmarked for infrastructure projects. But that effort stalled, too.", "At issue is the widely held belief among lawmakers from Southwestern Pennsylvania — where much of the state’s natural gas fracturing, or \"fracking,\" takes place — that a severance tax would cripple an important industry in the state.", "One Republican lawmaker from Beaver County recently told the Beaver County Times that Wolf’s latest attempt to impose a severance tax on natural gas production would be \"dead on arrival\" in the Republican-controlled state House. Even Democrats who represent the region have called Wolf’s tax \"misguided.\"", "Wolf said Pennsylvania is \"the only major gas-producing state in the US that doesn’t have a severance tax.\" That’s correct. Pennsylvania does not tax the materials extracted from the ground, as many other gas-producing states do. We rate Wolf’s statement True.", "PAcast, \"Governor Wolf Unveils Workforce and Economic Development Plan to Get Pennsylvania Back to Work,\" Feb. 22, 2021", "Commonwealth of Pennsylvania, \"Governor Wolf: Restore Pennsylvania is Still the Only Comprehensive Plan to Address Community Infrastructure Needs,\" Jan. 28, 2020", "WGAL, \"Gov. Tom Wolf pitches workforce and economic development plan,\" Feb. 22, 2021", "National Conference of State Legislatures, \"State Oil and Gas Severance Taxes,\" Sept. 6, 2018", "Pennsylvania Budget and Policy Center, \"Governor Wolf’s 2018 Severance Tax Proposal Could Bring in $1.7 Billion of Revenue Over the Next Five Years,\" June 19, 2018", "State Impact Pennsylvania, \"Restore PA and Wolf’s fifth severance tax attempt, explained,\" June 25, 2019", "Beaver County Times, \"Why Wolf faces bipartisan opposition to natural gas severance tax in southwestern PA,\" Feb. 9, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]