["About this rating", "Solar activity, which is often defined by the amount of sunspots on the star's surface, pendulates on a roughly 11-year cycle. The most recent cycle, which began in late 2008, peaked with sunspots in April 2014 and then steadily decreased until reaching a \"solar minimum\" — or a period with zero sunspots — in late 2019 and 2020. That means, yes, by spring 2020, solar activity had reached a so-called \"lockdown,\" or solar minimum.", "While the sun had entered a so-called \"lockdown\" period — when the number of sunspots on the star's surface decreased to few or none, technically called a \"solar minimum\" — by spring 2020, it was a normal occurrence for the star and was not projected by scientists to threaten life on Earth with famine, earthquakes, or freezing weather.", "In mid-May 2020, as people worldwide remained quarantined to limit the spread of the COVID-19 coronavirus disease, social media posts claimed not only were humans on Earth sheltering-in-place during the pandemic, but our life source — the sun — had gone on \"lockdown,\" too.", "Recirculating sensational headlines on the concept — including the New York Post's May 14 article \"The sun has entered a 'lockdown' period, which could cause freezing weather, famine\" — numerous people reached out to Snopes to investigate the validity of the claim: that the power of our solar system's star had decreased to the point that life on Earth would be threatened by famine, earthquakes, and freezing temperatures.", "First, we considered the definitions of key terms in helioseismology (the study of the sun) to make sense of the claim.", "Per astronomers' research over centuries, the sun generates powerful magnetic forces that are constantly changing, affecting the intensity of ultraviolet radiation and X-rays from the ball of gas that illuminates Earth. In areas of the star where the magnetic fields are particularly strong — thus restricting some heat from the sun's core from reaching its surface — dark spots appear, or what astronomers call sunspots. In other words, sunspots are places on the sun that are cooler than other areas. Sarah Scoles, a writer for the peer-reviewed Science Magazine, of the American Association for the Advancement of Science, wrote in 2019:", "Sunspots can be seen with the naked eye, but it wasn't until the mid-1800s that astronomers realized they come and go on a rough schedule. They first appear at midlatitudes and then proliferate, migrating toward the equator over about 11 years.", "In contrast, flashes of light on the star's surface occur when magnetic fields tangle or cross each other, causing a sudden explosion of energy — a phenomenon astronomers call solar flares.", "All of these factors — the number of sunspots, their locations, and the intensity of solar flares, etc. — are known as solar activity, which, like Scoles pointed out, fluctuates on a relatively predictable cycle every 11 years or so. Astronomers measure this 11-year timeframe, the sun cycle, in two major phases: when sunspots gradually increase over roughly five or six years, peaking for a solar maximum, and when sunspots diminish over the next approximately five or six years until there are few or zero sunspots, called a solar minimum. NASA writes:", "While intense activity such as sunspots and solar flares subside during solar minimum, that doesn’t mean the sun becomes dull. Solar activity simply changes form.", "In late 2008, the sun began its 24th solar cycle since scientists began taking accurate measurements of solar activity. The cycle's solar maximum, or when the sun was at its most active state with its highest level of sunspots, occurred in April 2014, according to the National Oceanic and Atmospheric Administration (NOAA). And from that point on, the number of sunspots decreased until late 2019, when the sun had zero sunspots, or reached a solar minimum.", "As of May 2020, the sun remained at a solar minimum, which meant one facet of the claim — that the sun had entered a so-called \"lockdown\" period, or solar minimum, by spring 2020 — was true. Dr. Tony Phillips, a former NASA researcher who now runs a daily website with astronomy updates for scientists, said in a May 19, 2020, email to Snopes that scientists expected the latest phase to last through much, if not all, of 2020.", "For solar scientists like him, the phases in the sun cycle are important because they can change how satellites or natural debris orbit the Earth; different periods can also intensify cosmic rays and slightly dim the brightness of the sun's rays.", "With little or zero sunspots on the star's surface, there's greater likelihood of long-lived coronal holes, which are low-energy regions in the outermost part of the sun's atmosphere where magnetic forces open up and allow streams of solar particles to escape the star — and those flows of solar wind can cause space weather effects if, or when, they hit Earth’s magnetic field, according to NASA. In a 2017 article about the upcoming solar minimum in 2019 and 2020, NASA said:", "These effects (from long-lived coronal holes) can include temporary disturbances of the Earth’s magnetosphere, called geomagnetic storms, auroras, and disruptions to communications and navigation systems.", "During solar minimum, the effects of Earth’s upper atmosphere on satellites in low Earth orbit changes too.", "Furthermore, in other periods of the solar cycle, the star's ultraviolet radiation heats up the Earth’s atmosphere in a way that causes friction for anything hovering and orbiting the globe. That friction causes what scientists call \"drag,\" a phenomenon that prevents natural and manmade space debris from reaching low-orbiting rings closest to the Earth's surface. But during a solar minimum, the NASA article stated, \"this natural heating mechanism subsides,\" adding:", "Earth’s upper atmosphere cools and, to some degree, can collapse. Without a normal amount of drag, space junk tends to hang around.", "That means it is accurate to say solar minimums can affect space weather, though the impacts remain at the atmospheric level.", "Next, to fully investigate the claim, we looked for any indication from scientists that the latest solar minimum — or the 25th sun cycle — was forecasted to affect humans in ways that most cycles in modern history had not: by causing low-crop production, earthquakes, and freezing weather.", "According to a panel of scientists sponsored by NOAA and NASA that makes such projections, as of April 2019, the upcoming roughly 11-year sun cycle (the 25th) was expected to \"likely be weak\" compared to others in modern history, yet similar to the previous cycle (the 24th) in terms of its number of sunspots and how they pendulate over time. NASA released the following graphic to help people visualize the prediction:", "That means, as of this writing, astronomers were not predicting any catastrophic damages as a result of the 2019-2020 solar minimum. Phillips said:", "This is a normal part of the solar cycle. ... Although this Solar Minimum is unusually deep compared to other Minima of the Space Age (1957 to present), it is hardly unprecedented. The Solar Minimum of 2008-2009 was similarly deep and, by the way, caused *no* famines, earthquakes or other catastrophes.", "If Solar Minimum went on forever — that is, if the sun got \"stuck\" and never produced any more sunspots — then, yes, new types of effects might emerge.", "Since the start of astronomers' research into the sun's patterns, it has always produced sunspots after a solar minimum, even after the 17th Century's Maunder Minimum, or \"prolonged sunspot minimum,\" from 1645 to 1715, when sunspots were exceedingly rare for about 70 years. \"However, there is no evidence that the sun is currently 'stuck',\" Phillips said of the 2020 claim. \"On the contrary, we are already starting to see the first sunspots of the next solar cycle. By the end of this year, we will probably be on the up-swing again.\"", "Lastly, to complete our examination, we looked at where the concerns about the sun had originated; the New York Post's article was a recycled report by the British tabloid newspaper, The Sun, which appeared to have been the first publication to dub what is a normal occurrence in the sun's 11-year cycle a \"lockdown\" without any specific attribution. The tabloid stated declaratively in the report's first paragraph:", "Our sun has gone into lockdown, which could cause freezing weather, earthquakes and famine, scientists say.", "Despite the plurality of that tagline (\"scientists say\"), The Sun’s story appeared to have been based on just one source: Phillips. The tabloid article quotes him directly, giving readers the assumption that he talked directly to writers of the report and shared comments to support the sensationalist headline and first paragraph.", "But in his email to Snopes, Phillips set the record straight: He did not provide an interview to The Sun and, instead, he said its writers used statements on his website, Spaceweather.com, under the misleading pretense that the solar minimum would cause catastrophic effects. Of the tabloid article, the astronomer said:", "They surrounded my accurate \"quotes\" (from the website) with false content about a \"Solar Lockdown\" and its imaginary consequences. The overall impression is that I have raised the alarm about Solar Minimum, famine, drought, earthquakes and so on. ... It's a sensational fabrication.", "In sum, given the sensational, inaccurate news reporting that spurred the claim, the fact that solar minimums impact space weather but do not typically cause catastrophic impacts for humans on Earth — as well as the prediction by scientists that the 2019-2020 solar minimum would be similar to the last one — we rate this claim \"Mostly False.\"", "NASA.   \"Solar Cycle 25 Forecast Update\".\r\n   9 December 2019.", "spaceweather.com.   \"The Sunspot Number\".\r\n   Accessed 18 May 2020.", "Carter, Jamie.   \"The Sun Is Asleep. Deep 'Solar Minimum' Feared As 2020 Sees Record-Setting 100-Day Slump\".\r\n   Forbes.   12 May 2020.", "Scoles, Sarah.   \"Scientists tackle a burning question: When will our quiet sun turn violent?\"\r\n   American Association for the Advancement of Science, Science Magazine.   30 May 2019.", "NASA.   \"Solar Minimum is Coming\".\r\n   27 June 2017.", "Pollard, Chris.   \"The sun has entered a 'lockdown' period, which could cause freezing weather, famine\".\r\n The Sun.   14 May 2020.", "National Oceanic and Atmospheric Administration.   \"Solar experts predict the Sun's activity in Solar Cycle 25 to be below average, similar to Solar Cycle 24\".\r\n   19 May 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]