["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In the months leading up to the gubernatorial primary, Chris Christie was busy flying off to various political events around the country, paying little attention to urban blight, soaring property taxes and double-digit unemployment plaguing some New Jersey neighborhoods.", "That’s the suggestion of a new Internet ad released Tuesday by a group called ChristieNotForNJ.com. Buono, a Democratic state senator from Middlesex County, is running against Christie, a Republican, in November’s governor’s race.", "In the ad, Christie is seen campaigning with former Republican presidential candidate Mitt Romney at a fundraiser in Iowa, followed by a shot of boarded up homes in a blighted neighborhood.", "\"Guess what, governor? There’s no fried butter in Newark,\" Buono says in the ad, as a shot from the Iowa State Fair – where fried butter is a staple delicacy – plays in the back. \"Just 13 percent unemployment.\"", "We’ll leave the butter assessment for the culinary crowd and look instead at the unemployment claim since New Jersey’s had unusually high unemployment figures even after the recession ended in 2009. But 13 percent for the state’s largest city? It turns out that Newark’s unemployment rate since Christie’s been governor has been quite a bit higher than Buono’s estimate.", "Before looking at unemployment data from the U.S. Bureau of Labor Statistics, let’s note that the data we reviewed was not seasonally adjusted. As a result, BLS spokeswoman Stacey Standish told us it’s best to use the same month to compare data from different years.", "We decided to look at two time frames: February 2010 – Christie’s first full month as governor – to February 2013, and May 2010 to May 2013, the last month for which BLS has unemployment data on Newark. Each time frame allows us to review three years of data. We also looked specifically at the unemployment rate.", "Standish confirmed that our methodology for determining Newark’s unemployment rate was correct.", "First, the February comparisons.", "Newark’s unemployment rate was 15.9 percent in February 2010 and 14.6 percent this past February. For the months in between, the jobless rate seesawed between 14.3 percent and nearly 16.5 percent.", "Now let’s compare May unemployment rates in Newark for 2010 and 2013.", "The rate was 15.1 percent in May 2010. The preliminary rate for this past May is 13.7 percent.", "The only months where unemployment fell to 13 percent during Christie’s entire tenure thus far was in April 2012 (13.8 percent), this past April  (13.2 percent) and May (13.7 percent), according to BLS data.", "Buono for Governor spokesman David Turner and Christie for Governor spokesman Kevin Roberts did not respond to our requests for comment.", "We also looked at unemployment rates in Camden and Trenton – other major New Jersey urban centers with large minority populations -- and found those rates were as high or higher.", "So why has Newark’s unemployment rate been so high?", "The National Association for the Advancement of Colored People has acknowledged previously to PolitiFact New Jersey that there’s a high rate of unemployment for blacks. Hilary Shelton, director of the NAACP’s Washington bureau and senior vice president for advocacy and policy, noted in 2011 that initiatives such as education and more training and employment services could help improve those statistics.", "Our ruling", "Buono said in a new online ad about Christie’s trips to other states, \"Guess what, governor? There’s no fried butter in Newark. Just 13 percent unemployment.\"", "Data from the BLS shows that for almost all of Christie’s tenure as governor, Newark’s unemployment rate has been at least a full percentage point or two higher than what Buono’s ad claims. There have only been three months in which the city’s unemployment rate was in the 13 percent range: April 2012, April 2013 and a preliminary rate in that range for May.", "The point of Buono’s claim is that Newark has had consistently high unemployment, whether during the few months it was in the 13 percent range or when it stagnated in the 15 percent range. We rate her claim True.", "To comment on this story, go to NJ.com.", "NJ.com, Buono ad highlights Christie’s out-of-state travels, July 9, 2013", "U.S. Bureau of Labor Statistics unemployment database, accessed July 9, 10 and 11, 2013", "Phone interview with Stacey Standish, spokeswoman, U.S. Bureau of Labor Statistics, July 10, 2013", "ChristieNotForNJ.com website, accessed July 10, 2013", "Buono for Governor website, accessed July 10, 2013", "PolitiFact New Jersey, New Jersey Tea Party blames Barack Obama for unemployment of 540,000 blacks since January 2009, Nov. 27, 2011, accessed July 10, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]