["About this rating", "Since at least 2010, a set of awe-inspiring pictures have been shared in email forwards and on social media. The color photographs purportedly show the Russian Kalinin K-7 heavy bomber. One of the pictures was even displayed in a paid online advertisement:", "The massive aircraft certainly looked quite heavy. (Courtesy: Levin)", "However, while the Kalinin K-7 was once a real aircraft from the 1930s, the color pictures in question showed 3-D artist renderings.", "The Kalinin K-7 heavy bomber is seen from another angle in a 3-D rendering. (Courtesy: Levin)", "We were able to find the original website that hosted the original images, but it wasn't easy. At first, we thought it might be a fan-created 3-D model for the \"Battlefield V\" video game, as one of the color pictures appeared in the /r/BattlefieldV/ subreddit. However, this was incorrect.", "Lots of reading of old blogs and message boards, combined with reverse image searching, finally led us to the original source. Thanks to a tip from englishrussia.com, we found the source to be a person using the handle \"Levin.\"", "On the original page, which appeared to be from 2007, Levin wrote that his work had been misunderstood:", "In view of the fact that this work is discussed at various serious forums on aviation and military affairs, and it is being discussed, apparently, without a clear understanding of the purpose of this work and the attitude of the author himself (i.e. me) to what he did here, I want to warn you in advance - everything that lies below is nothing more than the usual techno-fantasy, techno-utopia, if you like - techno-absurdity. There are no serious applications on my part for something that can fly, and there cannot be.", "This work is an attempt to reproduce, quite possibly taking place in reality in the 30s, an attempt by some hypothetical and not quite healthy and poorly educated designer to build such an absurdity with state money. I can even assume that as a result, this hypothetical poor fellow-designer was again hypothetically arrested and soon shot for senseless waste of folk funds on an especially large scale. )))", "And the main task from the point of view of technical reliability here was only to comply with the technical style of those years, so that the engines and other parts did not look taken from other eras. So if there is something worth discussing for aviation connoisseurs, then only this moment is the correspondence of the appearance of the parts and the whole structure in general to the level of aviation development in the early 30s of the 20th century.", "Levin also confirmed that Adobe Photoshop was not used in the process to make the renders. \"This is not Photoshop. This is 3-D, three-dimensional models.\"", "WarHistoryOnline.com published the history of the real Kalinin K-7 heavy bomber, which was smaller than what was displayed for the 3-D renderings. \"The Kalinin K-7 was a heavy experimental aircraft designed and tested in the Soviet Union in the early 1930s,\" the website read. \"It was of unusual configuration with twin booms and large underwing pods housing fixed landing gear and machine gun turrets.\"", "The real Kalinin K-7 was large, but not as massive as the aircraft seen in the 3-D renderings.", "Unfortunately, the aircraft had a brief history. On Nov. 21, 1933, the aircraft crashed.", "A flight crew stands in front of a Kalinin K-7 heavy bomber.", "According to WarHistoryOnline.com, the accident \"killed 14 people aboard and one on the ground.\"", "The K-7 first flew on 11 August 1933. The very brief first flight showed instability and serious vibration caused by the airframe resonating with the engine frequency. The solution to this was thought to be to shorten and strengthen the tail booms, little being known then about the natural frequencies of structures and their response to vibration.", "The aircraft completed seven test flights before a crash due to structural failure of one of the tail booms on 21 November 1933.", "The project was eventually scrapped in 1935. No known color photographs of the aircraft exist today.", "Levin, the 3-D artist, published more of his computer-generated work on his old website. One of them showed quite the battle in the skies:", "The Kalinin K-7 heavy bomber battles an unidentified foe in this 3-D rendering. (Courtesy: Levin)", "In sum, the Kalinin K-7 heavy bomber was real. However, color pictures that appeared in email forwards, social media, and ads were nothing more than 3-D renderings.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]