["About this rating", "On 30 May 2019, Carbon Hill, Ala., Mayor Mark Chambers took to Facebook and posted remarks about \"killing them out\" in reference to a post about the LGBTQ community, socialists and pro-choice activists.", "The post was deleted but not before Birmingham, Ala. news station WBRC captured screenshots of Chambers' comments, which prompted him to issue an apology.", "Chambers posted a Facebook meme that read, \"We live in a society where homosexuals lecture us on morals, transvestites lecture us on human biology, baby killers lecture us on human rights and socialists lecture us on economics.\"", "A friend then replied, \"By giving the minority more rights than the majority. I hate to think of the country my grandkids will live in unless somehow we change and I think that will take a revolution.\" In response, Chambers stated, \"The only way to change it would be to kill the problem out. I know it’s bad to say but without killing them out there’s no way to fix it.\"", "We located a version of the meme on Facebook:\n\nWe called the phone number listed on Chamber's profile on the city's website but were unable to leave a message, so we sent an email to him, via the city clerk, but have yet to hear back.", "Several days after writing the comment, Chambers posted an apology on his now-private Facebook page.", "UPDATE: Carbon Hill Mayor Mark Chambers is now apologizing for comments he made on social media. He claims his comments on killing people in the LGBTQ community and Democrats were taken out of context. Some people are calling on him to resign: pic.twitter.com/wdVwmdnIZ2", "— Josh Gauntt (@joshg_TV) June 4, 2019", "When interviewed by WBRC, Chambers at first denied writing the post but later admitted he did. He said he didn't know the comment was public, and that he thought he was sending a private message to a friend. Per WBRC:", "Chambers went on to defend his comments.", "“I never said anything about killing out gays or anything like that,” Chambers said.", "We read the post from Chambers’ page back to him.", "“That’s in a revolution. That’s right! If it comes to a revolution in this country both sides of these people will be killed out,\" he said.", "Chambers then fumed about privacy and his Facebook page not being for the public, although Chambers acknowledged his pages privacy settings were public. He later changed the Facebook page to private.", "Chambers' comments have engulfed the tiny town of 2,000 in unprecedented controversy. In the fallout, a death threat was called in to Carbon Hill Baptist Church on 4 June 2019, even though the church's pastor, Rev. Scott McCullar, said Chambers is in no way associated with the parish. \"We don't agree with those comments at all, they’re reprehensible,\" McCullar told us by phone. \"We exist to serve the lord Jesus and share the Gospel, not to make statements like that. We don't even think that way.\"", "The voicemail said, \"Mark Chambers wants all the gay people to be executed. So all the intelligent people want your (expletive) church to burn down. See how that works? Until it is illegal to be in possession of a sentiment, I hope you get (expletive) cancer and die in a fire.\"", "McCullar is among those calling for Chambers to resign. Three of the city's six-member city council submitted a letter on 4 June 2019 to Chambers requesting he do so, but so far he has remained in his post. The community, McCullar said, just wants the controversy to go away. \"By and large it’s a wonderful community, the people are very friendly, some of the friendliest people you would ever meet,\" he said. \"This just doesn't happen here. They're not used to anything like this whatsoever.\"", "Dionne, Brittany. \"Ala. Mayor Posts Apology After Defending Social Media Comments on Killing LGBTQ People and Democrats.\"\r\n  WBRC. 4 June 2019.", "Howell, Ed. \"Threat Made to Church; Pastor Said Mayor Should Resign.\"\r\n  Daily Mountain Eagle. 6 June 2019.", "Howell, Ed. \"Council Members Call for Chambers' Resignation.\"\r\n  Daily Mountain Eagle. 6 June 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]