["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In October 2020, messages started to circulate on social media claiming that the three red stripes on Democratic presidential nominee Joe Biden's logo were a reference to the so-called \"three red banners\" that outlined the socialist policies of Mao Zedong, the chairman of the Communist Party of China in the 1950s:", "This is a genuine image of one of the logos the Biden-Harris ticket has used in their campaign as well as a genuine screenshot (to the right) from a Wikipedia page about the three red banners. However, the logic used to connect these two dots — Mao described a portion of his socialist policies as \"three red banners,\" therefore, items with three red stripes are about socialism — does not hold up under the lightest scrutiny.", "For starters, \"three red banners\" is a reference to an ideological philosophy, not a specific visual design. In other words, China did not have a physical flag representing the three red banners in a similar fashion displayed on Biden's logo. This claim is attempting to connect a textual description of a 1950s policy with a visual representation of the letter \"E\" in the campaign logo.", "Here's how QZ described Mao's \"three red banners\":", "The long history of China’s obsession with numbered policies starts with Mao.", "The Three Red Banners—the “General Line for socialist construction,” the “Great Leap Forward” and the “people’s communes”—laid out how Mao’s socialist policies would transform China. But they are the de facto culprits of the Great Famine, Yang said.", "The first banner is an ideological slogan that calls on Chinese people to build a socialist state. The Great Leap Forward, initiated by Mao in 1958, aims to transfer China into an industrialized country. And the people’s communes put households together in rural areas where they shared everything from food to farm tools — a way to discount individuality and centralize more manpower and resources for agricultural and industrial production.", "The claim that Biden's logo is a reference to the socialist policies of Mao in China during the 1950s is based solely on the fact that Biden's logo contains three red lines.", "As the \"three red banners\" does not refer to any specific visual design, one could connect these socialist policies to any item adorned with three red stripes. By this logic, anybody living in Hawaii, Puerto Rico, Ohio, or working for the New York City Fire Department could be labeled a communist as these entities all use flags containing three red stripes.", "In addition to the logical flaws of this comparison, Mekanism, the ad agency that created Biden's logo, has already explained what this logo is supposed to symbolize.", "Aimee Brodbeck, the company's designer and art director who led the team that created the logo, said that the stripes and the colors of the logo were nods to the American flag. More specifically, Brodbeck explained that the three stripes represent the three branches of the U.S. government.", "\"The logo is approachable and strong, just like the Biden name. By incorporating nods to the American flag, the logo is a representation of Biden's investment in America. The 3 stripes represent the branches of government and the strength of unity with Biden. The logo also nods to the familiarity of the Obama \"O\" logo where 3 stripes are seen.", "Smith, Lilly.   \"Experts Weigh in on the Biden-Harris Logo: 'It Could be Scribbled on a Napkin and I'd be Happy.\"\r\n    Fast Company.   12 August 2020.", "Hofford, Alex.   \"Charted: China’s Great Famine, According to Yang Jisheng, a Journalist Who Lived Through It.\"\r\n    QZ.   10 March 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]