["A photograph of two men donning skull caps burning the Indian national flag is circulating on social media. The text inscribed in the image reads, “शाइन बाग मैं मुसलमानों ने CAA NRC के विरोध में तिरंगा जलाया है मुसलमान आतंकवादी देशद्रोही है अब मुसलमानों को भगाना है पाकिस्तान में, हिन्दू भाई एक हो जाए, जाऊ श्री राम (In the protest against CAA-NRC, Muslims in Shaheen Bagh burnt the tricolour. Muslims are terrorist, anti-nationals, they have to driven out to Pakistan. All Hindu brothers come together, and unite. Jai shri ram -translated)”. Facebook user Pradeep Lodhi posted the image on the group मोदी 2.0( मोदी समर्थक जुड़े on February 3, 2020. It has garnered more than 1,100 shares so far.", "Another user Anuradha Hindu also shared the image with the caption, “#संविधान बचाओ की रैली में #तिरंगा जला रहे हे. #गद्दार #कॉम #मुसलमान #बहिस्कार”.", "Alt News had earlier debunked this image in May 2019. The image represents a group of protesters burning the Indian National flag in Pakistan, NOT India. In July 2015, this image was published along with a blog titled, “Pakistani protesters burn a poster of PM Narendra Modi”. Upon searching for images related to the protest, we found the original photograph clicked by an Associated Press (AP) photographer.", "The caption posted with the image reads, “Pakistani protesters burn an Indian flag during a protest in Multan, Pakistan, Thursday, June 11, 2015. Pakistan has reacted angrily to comments made by the Indian prime minister that reportedly acknowledged Indian forces had a role in the war that created Bangladesh, part of Pakistan until 1971 when separatists won independence after a war.”", "In conclusion, a four-year-old image from Pakistan was falsely shared as Shaheen Bagh protesters burning the Indian national flag at a demonstration against the Citizenship Amendment Act (CAA) and the National Register of Citizens (NRC).", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]