["By Eugene Kiely and Robert Farley", "Posted on October 9, 2019", "With its candidate the subject of an impeachment inquiry, President Donald Trump’s reelection campaign has gone on the offensive with a TV ad that claims to present the “facts” about Democratic presidential candidate Joe Biden and Ukraine. In fact, the ad relies on speculation and unsupported accusations to mislead viewers.", "The TV ad, among other things, cites a “witness statement … for use in legal proceedings in Austria” that includes assumptions, beliefs and speculation. A University of Pennsylvania law professor told us such a document would not be admissible in U.S. federal court under the Federal Rules of Evidence.", "The ad, which began airing on Oct. 4, presents two “facts” about Biden’s role in the firing of former Ukraine Prosecutor General Viktor Shokin. It also presents two “facts” about the impeachment inquiry that House Speaker Nancy Pelosi started on Sept. 24 after reports that Trump in a July 25 phone call asked Ukrainian President Volodymyr Zelensky to investigate Biden and his son, Hunter.", "We’ll just focus on the claims about the Bidens and Ukraine in the ad, which has received more than 1.5 million views on Twitter after Trump posted it to his account on Oct. 9.", "“Fact: Joe Biden pressured Ukraine to fire its prosecutor,” the ad starts.", "It then shows a 2018 clip of Biden recalling a visit he made to Ukraine, where as vice president he told Ukrainian leaders that the U.S. would withhold $1 billion in loan guarantees if Ukraine did not fire Shokin.", "“If the prosecutor’s not fired, you’re not getting the money,” Biden is shown saying at a Jan. 23, 2018, event hosted by the Council on Foreign Relations. “Well, son of a bitch, he got fired.”", "“Fact: The prosecutor said he was forced out for leading a corruption probe into Hunter Biden’s company,” the ad announcer says next.", "While the announcer speaks, viewers see a blurry English-language translation of a “witness statement” from Shokin, and an abbreviated quote from the statement superimposed on the document that says, “I was forced out because I was leading a wide-ranging corruption probe into Burisma … Joe Biden’s son, Hunter Biden, was a member of the Board of Directors.”", "Let’s stop it there.", "Shokin did say that, but his version of events has been disputed. And he offers no proof to support his statements on why he was fired.", "The implication is that Biden wanted Ukraine to fire Shokin and close its investigation of Burisma to protect his son, Hunter, who served on the company’s board from 2014 to 2019. But, as we have written before, there is no evidence to support the claim that Hunter Biden was under investigation or that his father acted to kill the investigation of Burisma.", "And the witness statement isn’t proof of that, either.", "In fact, the very next sentence in the witness statement says, “I assume Burisma, which was connected with gas extraction, had the support of the US Vice-President Joe Biden because his son was on the Board of Directors.” Shokin assumes Biden had him fired for personal reasons, but he doesn’t know that as a fact and presents no evidence in his statement.", "He claims that then-Ukrainian President Petro Poroshenko told him to close down the investigation, implying it was at Biden’s request, but Poroshenko has denied that in interviews this month with CNN, Bloomberg News and the Los Angeles Times.", "“In my conversations with Poroshenko at the time, he was emphatic that I should cease my investigations regarding Burisma,” Shokin’s statement reads. “When I did not, he said that the US (via Biden) were refusing to release the USD$1 billion promised to Ukraine.”", "“We never, ever speak about any commercial company or about any person neither with Vice President Biden, no with the President Obama, no with the President Trump,” Poroshenko told CNN.", "Shokin’s statement — which also uses phrases such as “my opinion” and “I believe” — ends with a “statement of truth” that says, “I have given this statement orally in Russian. I have carefully read Ukrainian and Russian translation and confirm that it is entirely true to the best of my knowledge and belief.” (Emphasis is ours.)", "Stephen Burbank, a University of Pennsylvania Law School professor, told us in an email that such a statement would not be admissible in a U.S. federal court.", "“An affidavit of this sort would not be admissible in evidence in federal court in the United States if it were offered to prove the truth of matters asserted in it because it is hearsay (the declarant is not subject to contemporaneous cross-examination), and it does not appear that any of the recognized exceptions to the hearsay rule apply,” Burbank told us.", "“Moreover, and quite apart from that defect, even in legal settings where affidavits are permitted, as for instance on a motion for summary judgment, the ‘evidence’ must be capable of being presented at trial in admissible form,” Burbank added. “Numerous statements made in the affidavit would not qualify for admission.”", "Shokin, who was removed from office in March 2015, gave the statement “at the request of lawyers acting for Dmitry Firtash … for use in legal proceedings in Austria.” Firtash — a Ukraine oligarch with ties to former Trump campaign manager Paul Manafort — was indicted on bribery charges in 2014 by the U.S. Department of Justice. The case in Austria involves a U.S. extradition request.", "We don’t know if the statement, which was obtained by The Hill’s opinion writer John Solomon, has been filed in court in Austria. Firtash lost his extradition case in June, when the Austrian Supreme Court upheld a decision to allow the U.S. extradition request. The statement says it was notarized on Sept. 4.", "The Ukraine oligarch is now represented by conservative lawyers Joe diGenova and his wife, Victoria Toensing, who appear on Fox News as legal analysts in support of Trump on the Russia investigation and, more recently, the impeachment inquiry. Both were named to Trump’s legal team during the Russia investigation in March of last year, but it was announced days later that they would not join because of “conflicts.”", "Toensing and diGenova have replaced Lanny Davis, a onetime special counsel to former President Bill Clinton, on Firtash’s legal team. We sent an email to Davis’ law firm, which referred us to Toensing. We sent an email to Toensing, but have yet to receive any response to our questions.", "The Trump campaign TV ad — and his personal attorney, Rudy Giuliani, in TV interviews — cites Shokin’s affidavit as evidence of Biden’s wrongdoing in pressuring Ukraine to fire Shokin. In talking with reporters and on Twitter, Trump has described Shokin as “a very tough prosecutor,” and has lamented that he was fired.", "But the Obama administration, not just Biden, joined the international community and anti-corruption advocates in Ukraine in calling for Shokin to be removed from office for his failure to aggressively prosecute corruption.", "Shokin became prosecutor general a few months after Viktor Yanukovych, the former pro-Russia president of Ukraine, fled to Russia during the Ukraine revolution. Shokin, however, failed “to indict any major figures from the Yanukovych administration for corruption,” according to testimony that John E. Herbst, a former U.S. ambassador to Ukraine under President George W. Bush, gave in March 2016 to a subcommittee of the Senate Foreign Relations Committee.", "“Ukraine has had a long line of prosecutors whose function has not been to enforce the law, but to perform the political function of selectively prosecuting political enemies and to hold out the threat of prosecution in order to secure political loyalty and compliance. Shokin was precisely that kind of prosecutor,” Keith Darden, an associate professor at American University’s School of International Service, told us in an email. “He would open cases as a way of holding the threat of prosecution over a business, but he did not actually prosecute cases.”", "Initially, Ukraine’s then-president, Poroshenko, resisted pressure to fire Shokin, even after Biden and others demanded it.", "“By late fall of 2015, the EU and the United States joined the chorus of those seeking Mr. Shokin’s removal as the start of an overall reform of the Prosecutor General’s Office,” Herbst testified. “U.S. Vice President Joe Biden spoke publicly about this before and during his December visit to Kyiv; but Mr. Shokin remained in place.”", "(Biden did not say when he made the threat to withhold U.S. assistance, but he addressed the Ukrainian Parliament in Kyiv on Dec. 9, 2015, and held out the prospect of future U.S. aid if the country rid itself of the “cancer of corruption.”)", "Around this time, the International Monetary Fund also withheld financial assistance from Ukraine until it took steps to tackle corruption, and the anti-corruption group Transparency International Ukraine held Shokin “personally responsible for the breakdown in the fight against corruption in Ukraine.”", "Olesia Koval, a spokeswoman for TI Ukraine, told us in an email that her group was “involved in the campaign against Shokin because of his ineffectiveness and sabotage of corruption fight, especially of the cases of grand political corruption and in particular Zlochevskyi’s case” — referring to Mykola Zlochevsky, president of Burisma.", "In February 2016, Aivaras Abromavičius, the country’s economic minister, resigned to protest government corruption, prompting the bipartisan Senate Ukraine Caucus to send a letter to Poroshenko urging him “to press ahead with urgent reforms to the Prosecutor General’s office and judiciary.”", "A month later, Shokin was removed from office.", "We don’t doubt that Shokin believes he was a strong prosecutor who was unjustly removed from office, as his statement says. But he provides no proof.", "The TV ad, in short, creates a false narrative about Joe Biden to discredit the impeachment inquiry, but it doesn’t have the “facts” to support its claim.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]