["About this rating", "The U.S. federal stockpile of N95 protective face masks was largely depleted during the 2009 swine flu outbreak and was not restocked.", "However, the Obama administration was not solely responsible for the current shortage of masks. In the intervening years, the stockpile went unreplenished as the Trump administration failed to heed indications that dramatic shortages could occur.", "In late March 2020, amid a widening COVID-19 pandemic, U.S. President Donald Trump sought to blame previous administrations for the fact that frontline medical workers facing a spike in cases were reporting urgent shortages in personal protective equipment (PPE), notably N95 respirator masks that filter out particles in the air.", "\"So, many administrations preceded me. For the most part, they did very little, in terms of what you’re talking about,\" Trump stated during a March 21 press conference when asked by a reporter about protective medical gear shortages.", "Right-leaning media outlets followed suit, focusing the blame more narrowly on the administration of former President Barack Obama in particular. \"Report: Obama Admin Depleted Stockpile of N95 Masks, Never Restored,\" a Breitbart.com headline read. \"Los Angeles Times and Bloomberg News: Federal stockpile of N95 masks was depleted under Obama and never restocked,\" Washington Examiner reported. Readers asked Snopes.com to verify the claim that the Obama administration was directly responsible for the shortage of equipment.", "The reports on pro-Trump websites relied on selectively culled facts from other sources to weave a somewhat misleading narrative. It's true that both Bloomberg and Los Angeles Times, for example, reported that the national stockpile of N95 masks was largely depleted under the Obama administration during the swine flu epidemic, and that the depletion was not corrected.", "From the Times' report on March 20, 2020:", "After the swine flu epidemic in 2009, a safety-equipment industry association and a federally sponsored task force both recommended that depleted supplies of N95 respirator masks, which filter out airborne particles, be replenished by the stockpile, which is maintained by the U.S. Department of Health and Human Services.", "That didn’t happen, according to Charles Johnson, president of the International Safety Equipment Assn.", "But both the Times and Bloomberg pointed out that Congress and the Trump administration bore some responsibility for the current medical equipment shortages as well.", "Bloomberg reported that Trump's Secretary of Health and Human Services Alex Azar told Congress in February 2020 that the Strategic National Stockpile (SNS), a reserve of emergency medical supplies, contained \"30 million surgical masks and 12 million of the more protective N95 masks. He said there were an additional 5 million N95 masks that may have passed their expiration date\" in the stockpile, which at that time had not yet been tapped to deal with COVID-19.", "But as far back as 2015, government scientists had estimated that \"a severe flu outbreak infecting 20 to 30 percent of the population would require at least 1.7 billion of the N95 respirators.\" The SNS didn't have that quantity on hand, even before the swine flu broke out (in 2009 the SNS distributed 85 million N95 respirators).", "The Times also reported that the Trump administration, which is currently in its third year, ignored alarms raised by various government agencies early on that the U.S. was not prepared for a pandemic:", "As the current crisis has widened, President Trump has attempted to deflect responsibility for his administration’s poor planning, suggesting the coronavirus outbreak was inconceivable.", "“Nobody knew there would be a pandemic or epidemic of this proportion,” the president said Thursday.", "The opposite is true. The [Government Accountability Office], public health experts and others issued a steady drumbeat of warnings that America would sooner or later face a widespread infectious disease outbreak or a major bioterrorism attack and was woefully unprepared.", "In both 2018 and 2019, U.S. intelligence agencies issued insistent warnings in their annual Worldwide Threat Assessment.", "“We assess that the United States and the world will remain vulnerable to the next flu pandemic or large-scale outbreak of a contagious disease that could lead to massive rates of death and disability, severely affect the world economy, strain international resources, and increase calls on the United States for support,” the 2019 report noted.", "It's true, as reported by Bloomberg and the Los Angeles Times, and the partisan websites that borrowed from their reporting, that the supply of protective masks in the Strategic National Stockpile was largely depleted during the Obama administration, which then failed to restock the supply. But it's also true that the Trump administration ignored indications that the SNS remained understocked and the country was ill-prepared for a pandemic in the years leading up to the COVID-19 outbreak.", "The claim that the Obama administration \"caused\" or was solely responsible for the current shortage of medical equipment such as N95 protective face masks omits that wider context. We therefore rate this claim \"Mixture.\"", "The White House. \"Remarks by President Trump, Vice President Pence, and Members of the Coronavirus Task Force in Press Briefing.\"\r\n  21 March 2020.", "Elgin, Ben and John Tozzi. \"Hospital Workers Make Masks From Office Supplies Amid U.S. Shortage.\"\r\n  Bloomberg. 17 March 2020.", "Levey, Noam N., et al. \"A Disaster Foretold: Shortages of Ventilators and Other Medical Supplies Have Long Been Warned About.\"\r\n  Los Angeles Times. 20 March 2020.", "Lee, Don and Jennifer Haberkorn. \"Trump’s Refusal to Use Wartime Powers to Direct Scarce Medical Supplies has Left States Fighting It Out.\"\r\n  Los Angeles Times. 25 March 2020.", "Jacobs, Andrew, et al. \"'At War With No Ammo': Doctors Say Shortage of Protective Gear Is Dire.\"\r\n  The New York Times. 19 March 2020.", "Reinhard, Beth and Emma Brown. \"Face Masks in National Stockpile Have Not Been Substantially Replenished Since 2009.\"\r\n  Washington Post. 10 March 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]