["By Eugene Kiely", "Posted on October 15, 2020 | Updated on August 16, 2023", "At a campaign rally in Iowa, President Donald Trump cited an unsubstantiated news report to revive a widely debunked false narrative about Joe Biden’s work in Ukraine on behalf of the Obama administration.", "As we have reported more than once last year, Biden traveled to Kyiv as vice president and warned Ukraine’s then-president, Petro Poroshenko, that the U.S. would withhold $1 billion in loan guarantees until Ukraine removed its prosecutor general, Viktor Shokin, who was widely viewed as corrupt.", "At the time, the international community and anti-corruption advocates in Ukraine were also calling for Shokin to be removed from office for his failure to aggressively prosecute corruption.", "But Trump has repeatedly distorted the facts about Biden’s work in Ukraine to baselessly accuse his Democratic rival of seeking Shokin’s removal to help his son, Hunter, who at the time was a board member of a Ukraine gas company called Burisma. He left the board in 2019.", "In Des Moines, Iowa, on Oct. 14, Trump cited “explosive documents” published earlier that day by the New York Post to revive his widely discredited claim that Biden “went to Ukraine and threatened to withhold $1 billion in aid if they did not fire the prosecutor that was investigating his son and the company that his son worked for.”", "As we’ve written, there’s no evidence Hunter Biden was being investigated.", "The president made this line of attack against Biden a central campaign theme last year — until a whistleblower last fall alleged Trump had pressured newly elected Ukrainian President Volodymyr Zelensky in a July 25, 2019, phone call to investigate Burisma, Biden and his son, Hunter. The administration released a memo of the phone call that confirmed the whistleblower’s account, and a subsequent House investigation confirmed that the Trump administration withheld U.S. military assistance to Ukraine to pressure Zelensky to publicly announce that he would launch the investigations sought by Trump.", "As a result, the president was impeached by the House in December for abusing his office and obstructing the House investigation.", "Undeterred, the president at the Iowa rally cited unverified emails allegedly sent and received by Hunter Biden that had been obtained by the New York Post from Trump’s lawyer, Rudy Giuliani, as evidence that “Joe Biden has been blatantly lying about his involvement in his son’s corrupt business dealings.”", "But the Post story and Hunter Biden’s emails — which may or may not be authentic — don’t support Trump’s claims.", "In one of several stories on Hunter Biden, the New York Post wrote about a “smoking-gun email” that it claims proves the Democratic presidential nominee helped his son and Burisma. The story is based on a photo of an email that Vadym Pozharskyi, an adviser to the board of Burisma, allegedly sent to Hunter Biden to “thank you for inviting me to DC and giving an opportunity to meet your father and spent [sic] some time together.” We have no way to verify that the email is authentic.", "The Biden campaign says “no meeting, as alleged by the New York Post, ever took place” because it wasn’t on Biden’s schedule. Of course, that isn’t evidence a meeting didn’t occur — but the email (if authentic) isn’t evidence that a meeting did occur, either. The New York Post did not confirm that the meeting happened, and it’s unclear from the email if the meeting did occur.", "“There was no meeting. Period. I was in all of the Vice President’s meetings that touched on Ukraine, and I’d never heard of this guy until now,” Mike Carpenter, who was Biden’s lead adviser for Ukraine at the time, said in a statement provided to us by the campaign. “This has all the hallmarks of a Russian disinformation campaign.”", "Update, Aug. 16, 2023: Pozharskyi met Joe Biden and others at a dinner in Washington, D.C., in April 2015 – which is when Pozharskyi reportedly sent Hunter Biden the email mentioned in the New York Post story. Devon Archer, Hunter Biden’s former business partner, discussed the dinner during a closed-door interview with the House oversight committee on July 31, 2023, according to a transcript of the interview. However, Archer said business was not discussed at the dinner and that Joe Biden had nothing to do with Hunter Biden’s business ventures.", "We asked the Biden campaign about the authenticity of the emails and the claim that the laptop belonged to Hunter Biden, and it referred us to Hunter Biden’s attorney. We will update this story if we get a response.", "Citing another email from that same story, Trump said that “the same Ukrainian energy executive even sent Hunter an email saying quote ‘we urgently need your advice on how you could use your influence.’ In other words, Hunter was being paid for access to his vice president father who was specifically put in charge of Ukraine and Russia.”", "Trump is referring to a May 12, 2014, email Pozharskyi allegedly sent to Hunter Biden that asked for “advice on how you could use your influence” to help Burisma. Again, we don’t know if the email is authentic, but even so, the email isn’t evidence that Hunter Biden agreed to use his “influence” with his father to help Burisma. And it certainly isn’t evidence that Joe Biden did anything to help Burisma.", "Another story by the New York Post published the same day included an April 13, 2014, memo purportedly written by Hunter Biden to one of his partners, Devon Archer. The New York Post says in the memo Hunter Biden “repeatedly mentioned ‘my guy’ while apparently referring to then-Vice President Joe Biden.”", "The memo said: “The announcement of my guys [sic] upcoming travels should be characterized as part of our advice and thinking- but what he will say and do is out of our hands.” It was written about a week before Biden, as vice president, visited Kyiv, where he talked about anti-corruption efforts during a press conference with Ukrainian Prime Minister Arseniy Yatsenyuk in the wake of the Ukrainian revolution.", "Update, Aug. 16, 2023: In his July 31 testimony, Archer discussed the April 2014, memo, although his attorney, Matthew Schwartz, said he could not authenticate any emails produced by the committee. Archer said the email was an example of Hunter Biden taking credit for his father’s trip, even though he had nothing to do with it. Hunter Biden gave Burisma executives the “illusion of access to his father, other than social,” such as a dinner, Archer said. For more about Archer’s interview, read “Republicans Oversell Archer’s Testimony About Hunter and Joe Biden.”", "Biden’s April 22, 2014, press conference came a few months after Viktor Yanukovych, the former pro-Russia president of Ukraine, fled to Russia during the revolution.", "“Ukrainians have also made clear that after an era of staggering public theft — not debt, public theft — that they will no longer accept corruption from public officials,” Biden said at the press conference. “Your former leader had to run in hiding for fear that after everyone saw the excesses to which his theft had taken him and others. The fact of the matter is I’m of the view — and it’s presumptuous to ever tell another man what his country thinks — but I’m of the view that Ukrainians east, west, north and south are just sick and tired of the corruption.”", "Under the new regime, Shokin became prosecutor general in early 2015. But he failed “to indict any major figures from the Yanukovych administration for corruption,” according to testimony that John E. Herbst, a former U.S. ambassador to Ukraine under President George W. Bush, gave in March 2016 to a subcommittee of the Senate Foreign Relations Committee.", "“Ukraine has had a long line of prosecutors whose function has not been to enforce the law, but to perform the political function of selectively prosecuting political enemies and to hold out the threat of prosecution in order to secure political loyalty and compliance. Shokin was precisely that kind of prosecutor,” Keith Darden, an associate professor at American University’s School of International Service, told us in an email for a story last year. “He would open cases as a way of holding the threat of prosecution over a business, but he did not actually prosecute cases.”", "Biden later publicly disclosed that on another trip to Kyiv he told Ukraine’s new leadership that Shokin needed to be removed, warning that the U.S. would withhold $1 billion in loan guarantees until Shokin was replaced. (Biden did not say when he made the threat, but he addressed the Ukrainian Parliament in Kyiv on Dec. 9, 2015, and dangled the prospect of future U.S. aid if the country rid itself of the “cancer of corruption.”)", "“I looked at them and said: I’m leaving in six hours. If the prosecutor is not fired, you’re not getting the money,” Biden recalled in remarks at an event hosted in January 2018 by the Council on Foreign Relations. “Well, son of a bitch. He got fired.”", "Trump repeatedly cites Biden’s January 2018 remarks as evidence that the former vice president pressured Ukraine to fire Shokin because he was investigating Burisma.", "But, as we said, the evidence shows Biden was carrying out U.S. policy, and the United States was not alone in pressuring Ukraine to fire Shokin.", "In February 2016, International Monetary Fund Managing Director Christine Lagarde threatened to withhold $40 billion unless Ukraine undertook “a substantial new effort” to fight corruption after the country’s economic minister and his team resigned to protest government corruption. That same month, a “reform-minded deputy prosecutor resigned, complaining that his efforts to address government corruption had been consistently stymied by his own prosecutor general, Viktor Shokin,” according to a Jan. 3, 2017, Congressional Research Service report.", "“After President Poroshenko complained that Shokin was taking too long to clean up corruption even within the [Prosecutor General’s Office] itself, he asked for Shokin’s resignation,” the CRS report said. Shokin submitted his resignation in February 2016 and was removed a month later.", "It’s important to note, too, that Trump is citing from unverified emails that were allegedly obtained in a bizarre way by his own lawyer. According to the Post, the emails were found on a laptop that had been abandoned at a Delaware computer repair store, and the shop owner turned it over to the FBI but before doing so he “made a copy of the hard drive and later gave it to former Mayor Rudy Giuliani’s lawyer, Robert Costello.”", "As we documented earlier this year, Giuliani has visited Ukraine and worked with current and former officials there in an attempt to obtain information damaging to Biden.", "More recently, we wrote that Giuliani had been working with Andriy Derkach, who has been identified by the U.S. intelligence community as a “pro-Russia Ukrainian parliamentarian” who is “spreading claims about corruption … to undermine former Vice President Biden’s candidacy and the Democratic Party.” Those were the words of National Counterintelligence and Security Center Director William Evanina, who issued an “election threat update” on Aug. 7 that said: “Russia is using a range of measures to primarily denigrate former Vice President Biden.”", "This, of course, isn’t the first time Trump is using material obtained from questionable sources against a Democratic opponent.", "As we wrote in 2016, then-candidate Trump used hacked materials released by WikiLeaks to repeatedly distort the facts about then-Democratic presidential nominee Hillary Clinton in the final days of the 2016 campaign. In that case, the Main Intelligence Directorate, or GRU, which is responsible for intelligence collection for the Russian military, hacked into computer servers of the Democratic National Committee and party officials and released the hacked material to WikiLeaks and others “to help President-elect Trump’s election chances,” the U.S. intelligence community said in 2017. A counterintelligence investigation led by special counsel Robert Mueller resulted in multiple indictments against Russians and Russian companies.", "Earlier this year, the New York Times reported that the GRU successfully hacked Burisma’s computers.", "“The timing of the Russian campaign mirrors the G.R.U. hacks we saw in 2016 against the D.N.C. and [Clinton campaign chairman] John Podesta,” Oren Falkowitz, co-founder of Area 1, a security firm that discovered the hacking attempts, told the Times. “Once again, they are stealing email credentials, in what we can only assume is a repeat of Russian interference in the last election.”", "We don’t know at this point how Giuliani obtained emails and documents that purportedly belong to Hunter Biden. But we do know that they don’t support Trump’s baseless accusations against Joe Biden.", "Updated, Oct. 16: We added a comment from Mike Carpenter, who was Biden’s lead adviser for Ukraine.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]