["The photo was published on Facebook here on April 26, 2020.", "The post’s caption reads: “SGH Hospital Bill For COVID-19 Patient 18 Days Stay. Total bil [sic] amount SD180,143.00. / No joke / Pls Stay at Home & Stay Safe..”", "The photographed hospital bill is dated February 27, 2020 and bears SGH’s letterhead. A logo and a watermark for GIVE.Asia, an online fundraising platform, is also visible in the photo.", "Below is a screenshot of the misleading Facebook post:", "The photo was also shared alongside a similar claim on Facebook here, here and here.", "The claim is false.", "In response to the misleading posts, a spokesperson for SGH said on Facebook on April 28 that the photo had been shared with “false claims.”", "The statement reads: “It has been brought to our attention that a hospital bill (case number: xxxxxxx469H) dated 27 Feb 2020 belonging to one of our patients has resurfaced and is circulating on social media and text message platforms. There was claim that the patient was diagnosed with COVID-19. This is not true.", "“The said patient was not diagnosed with COVID-19. We urge the public to exercise social responsibility and not to circulate any false claims.”", "The photo of the bill was taken from a fundraising campaign page on GIVE.Asia, titled: “Help my wife fight for her life in ICU”.", "The campaign was started by a man identified as Gan Chang in order to fund treatment for his wife, Wen Bin, according to the GIVE.Asia webpage. Wen Bin was admitted to SGH in January 2020 and suffered from a number of ailments including severe aplastic anemia, tuberculosis and pneumonia, the website states.", "On the GIVE.Asia post, Gan Chang says: “Wen Bin was diagnosed with both severe aplastic anemia (SAA) and tuberculosis in January at the Singapore General Hospital (SGH)... she developed a 40 degree fever, where she was diagnosed with severe pneumonia.", "“Wen Bin soon needed intubation and support from a medical ventilator to help her breathe, and was admitted into the Intensive Care Unit (ICU) on 10 February 2020.", "“The growing cost has been a constant source of stress for Wen Bin, myself and her family, such that it makes her think twice about agreeing to certain treatment procedures.”", "Closer examination of the photo in the misleading posts and the GIVE.Asia post shows the bill is addressed to Wen Bin.", "Below is a screenshot of the bill, with the addressee's name circled in red by AFP:", "The Singaporean government pays “COVID-19 testing fees and hospital bill in full” for citizens and long-term residents, according to a Ministry of Health statement dated March 9. The department added in a separate statement released on March 24 that anyone who travels in defiance of the government's travel advisory will not qualify for free treatment.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]