["A video of uniformed soldiers has been shared thousands of times in social media posts that claim Thailand has issued a \"shoot to kill\" order to protect the country from Covid-19 infected Myanmar migrants. The claim is false: the footage was taken from a Facebook Live posted by a Thai soldier showing an anti-smuggling operation in Mae Sot on the Thai-Burmese border; a Thai government spokesperson told AFP that no shoot to kill order had been issued against migrants from Myanmar.", "The misleading video and four photos were posted here on Facebook on August 28, 2020.", "The misleading post’s Burmese-language caption translates to English as: “The Thai government ordered the military to shoot on sight”.", "Part of the lengthy caption says: “After the number of confirmed COVID-19 cases hits a record high in Myanmar, the Thai government ordered the military to shoot on sight anyone who enters Thailand illegally as the neighbouring country is very afraid of infection”.", "The same photos have been shared here, here, here, here, here, here, here and here on Facebook and here and here on websites as well as here on YouTube with a similar claim.", "The claim is false.", "The video in the misleading post was originally streamed live here at 9:49am on August 28 on the Facebook page of Aek Kriangsak, a soldier in the Thai military who has more than 80,000 followers on Facebook.", "The misleading posts start to appear hours later, for example here at 1:53pm on August 28.", "The original live stream footage is captioned in Thai: \"Security Department in Mae Sot district inspect the Thai-Myanmar border, to prevent illegal smuggling.\"", "It shows a Thai army official saying in Thai: \"Right now, the Prime Minister and Minister of Ministry of Interior has ordered the Thai Army to tighten strict controls for inspection, by improving administration, military, police and legal and border police to inspect in order to prevent illegal smuggling.\"", "The officer makes no reference to shooting Myanmar people who cross the border illegally.", "Aek Kriangsak told AFP via Facebook messenger that he had posted the live stream on Facebook on August 28, 2020 from the first friendship Thai-Myanmar bridge in Mae Sot district during an army border inspection connected to illegal smuggling.", "\"They were carrying weapons as part of the outfit, but there were no violence. That is illegal! The friendship between Myanmar and Thailand are good,\" he said.", "The original footage is embedded below:", "The photographs used in the misleading post were also originally posted by Aek Kriangsak on his Facebook page here.", "In response to the misleading posts, Thai government spokesperson Anucha Burapachaisri told AFP by phone on September 3 that the claim was “totally not true”.", "“This is totally not true, given the second wave of Covid-19 in Myanmar, we have been tightening our controls to make sure that people feel more at ease, especially those who work near the border area,” he said. “But there is definitely no violence.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]