["By Saranac Hale Spencer", "Posted on December 5, 2018", "An old, bogus quote claiming that Hillary Clinton suggested in 2013 that Donald Trump should run for public office is circulating again on Facebook. It’s still not true.", "Even after it has been thoroughly debunked, misinformation can keep spreading.", "For example, a claim from a made-up story that was popular shortly before the 2016 presidential election has morphed into a meme that has been recently circulating on social media, even though it has been exposed as misinformation by major news outlets.", "The meme claims that Hillary Clinton said in 2013: “I would like to see people like Donald Trump run for office; they’re honest and can’t be bought.”", "Clinton did not say that. The claim that she did was first made in October 2016 on a now defunct website called therightists.com, which was registered to an owner in Israel. The site’s “About Us” page said, “This is HYBRID site of news and satire. part of our stories already happens, part, not yet. NOT all of our stories are true!”", "Clinton’s purported praise of Trump would fall into the “satire” category, since the quote attributed to her is fabricated.", "The “hybrid” website claimed Clinton made her flattering remarks about Trump at a conference hosted by Goldman Sachs on Oct. 29, 2013. Clinton did speak at that conference; WikiLeaks posted the transcript of her speech. But the quote attributed to her is not in the transcript.", "The made-up quote from therightists.com’s story that has been turned into a meme appears to be loosely based on Clinton’s answer to a question she was asked at the event:", "Male attendee at Goldman Sachs’ Builders and Innovators Summit, Oct. 29, 2013: My question is, as entrepreneurs, we risk a lot.  And Mike Bloomberg had 30 billion other reasons than to take office.  Do we need a wholesale change in Washington that has more to do with people that don’t need the job than have the job?", "Clinton: That’s a really interesting question.  You know, I would like to see more successful business people run for office.  I really would like to see that because I do think, you know, you don’t have to have 30 billion, but you have a certain level of freedom.  And there’s that memorable phrase from a former member of the Senate:  You can be maybe rented but never bought.  And I think it’s important to have people with those experiences.", "And especially now, because many of you in this room are on the cutting edge of technology or health care or some other segment of the economy, so you are people who look over the horizon.  And coming into public life and bringing that perspective as well as the success and the insulation that success gives you could really help in a lot of our political situations right now.", "The part about not being able to be “bought” was likely a reference to John Breaux, a former congressman who once said his vote could not be bought, but “it can be rented.” That quote has been changed a little over the years and widely used since Breaux, a Louisiana Democrat, said it in 1981 after changing his vote to support Reagan-era budget cuts after sugar subsidies were included. Breaux later became a senator.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“Hillary Clinton In 2013: ‘I Would Like To See People Like Donald Trump Run For Office; They’re Honest And Can’t Be Bought.’” Therightists.com. 17 Oct 2016.", "WikiLeaks. “Goldman Sachs paid speeches” email. Wikileaks.org. Accessed 4 Dec 2018.", "Clinton, Hillary. Speaker at Goldman Sachs Builders and Innovators Summit. Ritz-Carlton Dove Mountain, Marana, Ariz. 29 Oct 2013.", "Edsall, Thomas. “Democrats Watch GOP Checks Bounce; Southern Democrats Wonder If Reagan Can Still Deliver the Goods.” Washington Post. 25 Oct 1981.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]