["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• There is no evidence Trump said “Africans Are Lazy, Good At Sex, Theft.”", "• This claim was debunked as long ago as 2015.", "President Donald Trump is regularly criticized for comments deemed insensitive, racist and more. But at least one comment attributed to him on social media is baseless.", "A Sept. 11 Instagram post shows an image of what appears to be a newspaper clipping from Oct. 27, 2015, with a headline in quote marks: \"‘Africans Are Lazy, Good At Sex, Theft.’\" Under the headline is a picture of Trump with his mouth open as if he were photographed mid-sentence. The first sentence of the story reads, \"Business magnate Donald Trump has expressed his deep distrust for Africans by referring to them as lazy fools only good at eating, lovemaking and thuggery.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There is no evidence Trump said this. Social media users have revived the old claim in this fabricated newspaper clip despite the fact that it was debunked by other fact-checking organizations as long ago as 2015.", "PolitiFact searched news archives for any record of Trump saying the quote or anything similar, and found nothing.", "Snopes reported that several African websites in 2015 claimed that Trump, then a candidate for president, made the comments in Indianapolis. But there is no evidence any U.S. or international news outlet reported on the comments, which would have been considered newsworthy. What’s more, his campaign events leading up to Oct. 27, 2015, when this false news story was supposedly published, were in Jacksonville, Fla., and New Hampshire. He was not in Indiana during this period.", "Even stories that focus on offensive things the president has said do not include this quote.", "The closest we found: In his 1991 memoir, former Trump business associate John O’Donnell wrote that Trump once called Black people lazy. \"I think that the guy is lazy,\" the quote attributed to Trump says. \"And it’s probably not his fault because laziness is a trait in Blacks. It really is; I believe that. It’s not anything they can control.\"", "An Instagram post shows an image of a newspaper story that claims Trump said \"Africans Are Lazy, Good At Sex, Theft.\"", "There is no evidence Trump said this.", "We rate this claim Pants on Fire!", "Lead Stories, \"Fake News: Donald Trump Did NOT Say \"Africans Are Lazy, Good At Sex, Theft,\"\" April 30, 2019", "FactCheck.org, \"Facebook Users Peddle False Trump Story,\" April 30, 2019", "Snopes.com, \"Trump Says Africans Are Poor Because They Think of Sex Instead of Farming?\" Dec. 12, 2016", "Snopes.com, \"Did Trump Say Africans Are \"Lazy Fools Only Good at Eating, Lovemaking and Thuggery\"?\" Oct. 27, 2015", "BBC, \"Mythbuster: What Donald Trump didn't say about Africa,\" Nov. 11, 2016", "Huffpost, \"Donald Trump’s Problem With ‘The Blacks,’\" Aug. 23, 2017", "Politico EU, \"The 15 most offensive things that have come out of Trump’s mouth,\" Dec. 8, 2015", "Slate, \"\"Laziness Is a Trait in Blacks,\" 1991 Book Quotes Trump as Saying,\" July 20, 2016", "The Washington Post, \"Trump’s courtship of black voters hampered by decades of race controversies,\" July 20, 2016", "Donald Trump Tweet, Oct. 25, 2015", "Donald Trump Tweet, Oct. 25, 2015", "Today, \"Donald Trump's TODAY town hall: Guns, ISIS — and the last time he ate McDonald's,\" Oct. 26, 2015", "The St. Augustine Record, \"Thousands turn out for Trump speech in Jacksonville,\" Oct. 24, 2015", "Indy Star, \"Donald Trump rally at the Indiana State Fairgrounds,\" April 20, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]