["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Five babies born to parents Daniel and Liz Hodges, of Temple, Texas, pause before heading home from an Austin hospital in July 2017 (Jay Janner, AUSTIN AMERICAN-STATESMAN).", "A Fort Worth pediatrician who supports continued federal backing of health insurance for children of the working poor suggested it’s an important issue in these parts because 10 percent of Americans start as Texans.", "In October 2017, Joyce Mauk, president of the Texas Pediatric Society, was quoted by the Austin American-Statesman as saying: \"One in 10 babies born in this country is born in Texas, and so it affects us disproportionately if access to health care is compromised for children. There is nothing good you can say about taking away access to health care for children.\"", "At the time, Congress had failed to extend its authorization of the Children’s Health Insurance Program before federal funding expired at the end of September. Without further action, about 400,000 Texas children and pregnant women were believed to be at risk of losing coverage by early 2018.", "We wondered about the share of U.S.-born babies birthed in Texas.", "By phone, Mauk told us she relied on statistics compiled from U.S. states by the U.S. Centers for Disease Control and Prevention showing that 403,618 Texas births accounted for 10 percent of 3,980,000 births nationally in 2015.", "We were shortly able to confirm that number, thanks to a January 2017 CDC report tabulating U.S. births. It showed 403,618 Texas births in 2015 made up 10.1 percent of 3,978,497 births nationally. Among the states, the chart shows, only California accounted for a greater share; 491,478 births there accounted for 12.4 percent of U.S. births.", "Next, we asked the CDC and the Texas Demographic Center, based at the University of Texas at San Antonio, about more recent data and figures giving historical perspective.", "By email, CDC spokesman Brian Tsai pointed us to bureau-posted 2016 birth counts by state, posted in September 2017, showing that the 406,945 births in Texas that year accounted for 10.3 percent of 3,956,112 births nationally.", "So, the 1-in-10 figure still holds up.", "In Texas, to our emailed queries, Lila Valencia of the demographic center provided a chart showing that Texas-born babies have comprised 1 in 10 U.S. births since 2008. From 1960 through 1971, the chart indicates, Texas-born babies made up 6 percent of U.S.-born babies. That share, the chart shows, was 7 percent from 1972 through 1979; 8 percent from 1980 through 1995; and 9 percent from 1996 through 2007.", "Of late, Valencia elaborated, \"the Texas share of births has been steadily increasing, even following drops in the number of births following the Great Recession,\" Valencia wrote, adding: \"If current total fertility rates and the child-bearing age distribution of women in each state remains the same, we would anticipate the Texas share of births to continue to increase given the younger age distribution of the state, its larger Hispanic share of the population, and its significant population growth relative to other states.\"", "Our ruling", "Mauk said 1 in 10 U.S.-born babies is born in Texas.", "According to government tallies, that’s been so since 2008.", "We rate this claim True.", "TRUE – The statement is accurate and there’s nothing significant missing. Click here for more on the six PolitiFact ratings and how we select facts to check.", "News story, \"400,000 Texas children at risk of losing health insurance,\" Austin American-Statesman, Oct. 3, 2017", "Phone interview, Joyce Mauk, president, Texas Pediatric Society, Oct. 6, 2017", "Reports, National Vital Statistics Reports, Centers for Disease Control and Prevention, \"Births: Final Data for 2007,\" Aug. 9, 2010; \"Births: Final Data for 2008,\" Dec. 8, 2010; \"Births: Final Data for 2009,\" Nov. 5, 2011;  \"Births: Final Data for 2010,\" Aug. 28, 2012; \"Births: Final Data for 2011,\" June 28, 2013; \"Births: Final Data for 2012,\" Dec. 30, 2013; \"Births: Final Data for 2013,\" \"Births: Final Data for 2014,\" Dec. 23, 2015; \"Births: Final Data for 2015,\" January 2017; \"User Guide to the  2016 Natality Public Use File,\" Sept. 27, 2017", "Charts showing U.S. births and births by state in 1980, 1993, 2003, CDC, various dates (accessed Oct. 9, 2017)", "Emails, Lila Valencia, senior demographer, Texas Demographic Center, Oct. 9, 2017", "Chart showing the share of U.S.-born babies born in Texas, 1960-2015 (received by email from Lila Valencia, Oct. 9, 2017)", "Emails, Brian Tsai, public affairs specialist, Centers for Disease Control and Prevention, Oct. 6 and 10, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]