["About this rating", "On 1 April 2016, the web site Inked magazine published an article reporting that Disney had banned customers with tattoos from all of their theme parks:", "Announced today, Disney theme parks, including Walt Disney World Florida and Disneyland in Anaheim, are banning admittance to anyone with visible tattoos.", "Per The Walt Disney Company's spokesperson for Consumer Relations-Theme Parks Division, April Engañar: “We don’t think that tattoos fit into the image of a wholesome Disney family. For years we have received complaints from concerned parents saying that they didn’t want their children to be subjected to tattoos so this decision has been a longtime coming. We still value tattooed customers, we just want them to cover up before experiencing the Happiest Place on Earth.\"", "Inked didn't explicitly state that this report was an April Fool's Day joke, but the name of the putative Disney spokesperson, April Engañar, was one clue: engañar is a Spanish verb meaning to trick, deceive, or fool. Also, the magazine called attention to the date in the text of their article:", "Sadly, the parks are also removing seven of the pirates from their popular Pirates of the Caribbean ride because they have tattoos. \"This is a zero tolerance policy beginning today, April 1st,\" Engañar said. \"Not even Johnny Depp will be allowed into our parks with short sleeves.\"", "Although Inked's article was just a spoof, Disney resorts do have some restrictions on tattoos. The Dress Code at Disneyland, for instance, prohibits visible tattoos that \"could be considered inappropriate\":", "Attire that is not appropriate for the theme parks (and which may result in refusal of admittance or ejection) includes but is not limited to:", "Visible tattoos that could be considered inappropriate, such as those containing objectionable language or designs.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]