["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ali Alchikh and his wife, Najoua Laroui, replenished supplies of bottled water at Costco as Hurricane Irma approached. (Jonathan Capriel/Tampa Bay Times)", "A misleading headline from a website called Freedom Daily suggests that reports of potential food poisoning at grocery stores emerged after people stocked up in preparation for Hurricane Irma.", "\"BREAKING: Muslims’ Disturbing Plan Comes Out After Grocery Stores Go Bare To Prepare For Irma,\" said the headline of an undated post on Freedomdaily.com", "Like a lot of fake news, the headline is extremely misleading while the text of the story itself is more accurate.", "The article summarizes and adds its own commentary to reports from the media and other sources about the Islamic State’s poisoning of prisoners and about the group’s followers potential to also poison Western grocery stores.", "In its About Us page, Freedom Daily said they \"post and decipher content to a level that is consistent with a common sense approach and falls in line with the ideals of American liberty and freedom.\" Its Facebook page said the website \"gives Americans the real news as it unfolds with a conservative opinion.\"", "In its story, the website doesn’t make any claims about active plots discovered against American supermarkets.", "\"Multiple outlets have reported that ISIS is utilizing social media to instruct members to poison food in supermarkets. It may or may not happen, but the thought of it occurring on a widespread attack on groceries could be terrorizing,\" said the post about the grocery stores. \"People could even entertain the thought of an ISIS attack before a hurricane in which the food is all poisoned and people falter in the midst of a category 4 storm before the storm even hits them. Of course, this is not something that has happened, but a mere idea or spectacle that theorists could allege.\"", "SITE Intelligence Group reported on Sept. 3 that potential terrorists were advised to inject food sold at markets with cyanide poison. SITE said that message was distributed Sept. 3 on a pro-Islamic State channel on the social media platform Telegram and that it was part of a series of information promoting \"lone-wolf jihad in Western countries.\"", "Freedom Daily linked to a Sept. 6 story on The Federalist Papers Project based on SITE’s report. Newsweek also published a story Sept. 7 headlined, \"ISIS supporters call for poisoning of food in grocery stores across U.S. and Europe.\" But neither of them say the information came after people emptied shelves at stores as they prepared for Hurricane Irma’s path across the Caribbean and Florida.", "Freedom Daily’s story uses a photo of a woman in a blue blouse pushing a shopping cart past empty shelves in a grocery store. That photo was shot on Sept. 5 at a Publix supermarket in Palm Beach Gardens, Fla. by the Palm Beach Post — two days after SITE’s report came out.", "The Miami Herald and several other outlets also reported on Sept. 5 about empty shelves at stores as Floridians prepared for Hurricane Irma. The New York Times on Sept. 4 also noted there were bare water shelves in Puerto Rico as they also braced for the storm.", "Freedom Daily’s story itself contains true information, but the headline ignores critical facts that would give a different impression. We rate it Mostly False.", "Freedom Daily, BREAKING: Muslims’ Disturbing Plan Comes Out After Grocery Stores Go Bare To Prepare For Irma, accessed Sept. 11, 2017", "Freedom Daily, About Us page", "Email exchange, Rita Katz, director, SITE Intelligence Group, Sept. 11, 2017", "SITE Intelligence Group, IS Supporters distribute English message suggesting to poison food in markets, Sept. 3, 2017", "Palm Beach Post, Hurricane watches likely issued for Florida today as Irma nears, Sept. 7, 2017", "Newsweek, ISIS supporters call for poisoning of food in grocery stores across U.S. and Europe, Sept. 7, 2017", "The Federalist Papers Project, ALERT: ISIS Instructs Supporters to Poison Food At USA Grocery Stores, Sept. 6, 2017", "Miami Herald, Empty shelves everywhere, but retailers say supplies are on the way, Sept. 5, 2017", "New York Times, Hurricane Irma, Now a Category 5 Storm, Threatens the Caribbean and Florida, Sept. 4, 2017", "NBC-2.com, Empty shelves greet those trying to prepare for Irma, Sept. 5, 2017", "TCPalm.com, Early rush for supplies before Hurricane Irma leaving some store shelves bare, published Sept. 5, 2017, updated Sept. 6, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]