["House Republicans announced last Thursday legislation that they say would simplify the tax code, lower taxes, boost job creation and improve international competitiveness.", "Kevin Brady, chairman of the House Ways and Means committee, co-hosted the press conference — part of the GOP’s \"Better Way\" initiative — along with Speaker Paul Ryan and House Majority Whip Steve Scalise. During the announcement, Brady compared the United States tax code to other countries’ and made one notable claim about United States exporters.", "\"No longer will we be the only major country that taxes its own exports,\" Brady said. He wrote something similar in a Wall Street Journal editorial.", "This caught our eye, given a clause in the Constitution — Article I, Section 9 —  stating \"No Tax or Duty shall be laid on Articles exported from any State.\"", "So what was Brady referring to? A spokesperson for Brady referred us to the GOP’s \"Our Better Way\" tax plan. So we dug in.", "‘Our Better Way’", "The plan points to one aspect of the current tax code: the use of a federal corporate income tax rather than a federal consumption tax.", "Let’s explain.", "Many countries beside the United States use a \"value-added\" consumption tax in addition to an income tax. The VAT is complicated to explain, but in essence applies taxes throughout the production chain and not just at the end like a normal sales tax.", "One aspect of the VAT is \"border adjustability,\" which means the country removes the \"value-added\" tax when it’s applied to exports, said Richard Schmalbeck, a professor of law at Duke University.", "\"VATs are consumption taxes, and it wouldn't be appropriate for the French to tax consumption by residents of other countries,\" Schmalbeck said. \"The border adjustments assure that the tax will be borne only by French consumers.\"", "Point being, other countries’ national consumption taxes (which the United States does not have) do not tax exports. But Brady is missing something in his comparison.", "Income taxes", "Other countries’ income taxes do capture exports under their umbrella, experts told us.", "Some of the income from exported goods is still made from domestic manufacturing, said H. David Rosenbloom, a professor of taxation at New York University, who called Brady’s claim \"incomplete.\"", "\"When BMW manufactures an automobile in Germany, I would doubt very much that the income attributable to the manufacturing activity is exempt from German income taxation,\" Rosenbloom said.", "Exempting foreign export sales from income tax is also not an easy task, said Peter Barnes, a senior lecturing fellow at Duke University. Companies would have to keep separate books on domestic and foreign sales.", "He added that some countries in the past, China and India notably, have done this. However, such exemptions are not standard practice, Barnes said.", "Joseph Rosenberg, a senior research associate at the Urban-Brookings Tax Policy Center, agreed. He said other countries’ income taxes would impose some burden on exports, even if exports are exempted from their consumption taxes.", "\"The ‘territorial’ corporate income taxes that most countries have are still origin-based taxes (i.e., not border adjusted),\" Rosenberg said. \"The base is essentially domestic production and those taxes apply to domestically produced goods whether they are sold at home or abroad.\"", "A new system", "Among other measures designed to promote international competitiveness, the GOP plan wants to transform the United States’ current corporate income tax system, which currently lacks border adjustments, into what is called a \"destination, cash-flow based\" income tax.", "This new system would tax net cash flow, deduct exported sales and impose the income tax on imports. Thus, the new tax protocol provides for income taxes on the \"border adjustments\" other countries use for VAT consumption taxes.", "To deduct exports, companies would subtract sales abroad from revenue otherwise taxed, Rosenberg said.", "However, Rosenberg and other economists are also not sold on how problematic the current state of affairs actually is.", "\"Most economists would not expect any significant change in the terms of trade from this tax swap,\" he said.", "Barnes also suggested that the new tax system could compel other countries to move to a destination-based system, hurting U.S. businesses.", "\"Imagine if Boeing owed income tax to every country where it sold a plane,\" Barnes said. \"Or Apple.\"", "It is also unclear that border adjustments under the new approach would be allowed by current international tax law, Rosenberg said. Daniel Mitchell, a senior fellow at the libertarian Cato Institute, also wrote the World Trade Organization might not approve this new plan.", "A few exceptions", "Even if you believe Brady broadly has something of a point comparing the U.S. system to VAT countries, he’s wrong on the specifics.", "Other countries do apply a direct export tax on goods. Most of these are in developing countries and are imposed only on select agricultural goods, according to a WTO report.", "But a few countries that impose export taxes are countries belonging to the Organization of Economic Cooperation and Development (a typical benchmark for a major country). Norway, Turkey and Mexico have export taxes for a few select goods. Brazil has an export tax on all goods, up to 30 percent, although officials say these taxes are typically not applied.", "Our ruling", "Brady said that the United States is the only country that taxes its own exports, a problem the GOP tax plan intends to fix.", "Other countries do exempt exports from their consumption taxes using \"border-adjustments.\" However, experts told us that Brady’s statement ignores the income taxes of other countries, which do end up taxing export income, at least in part.", "For that reason, we rate this claim Mostly False.", "https://www.sharethefacts.co/share/232eaee9-6d5f-4e86-863e-162ba667e2af", "Committee on Ways and Means, \"House Republicans Unveil 21st Century Tax Plan Built for Growth,\" June 24, 2016", "The Wall Street Journal, \"The GOP Plan for Tax Sanity,\" June 24, 2016", "National Archives and Records Administration, \"The Constitution of the United States: A Transcription.\"", "Congressional Research Service, \"Export Clause: Limitation on Congress’s Taxing Power,\" October 18, 2012", "Speaker of the House, \"A Better Way, Our Vision For A Confident America: Tax\" June 24, 2016", "World Trade Organization, \"The Role of Export Taxes in the Field of Primary Commodities,\" 2004", "OECD, Glossary of Statistical Terms: Export Taxes,\" November 11, 2001", "The Atlantic, \"How does a ‘Value Added Tax’ Work, Anyway?\" March 1, 2010", "American Enterprise Institute, \"Border Tax Adjustments Won’t Stimulate Exports,\" March 2, 2009", "International Liberty, \"A Remarkably Good and Reasonably Bold Tax Reform Plan From Republicans,\" June 25, 2016", "Tax Analysts, \"Does a VAT Promote Exports?\" 2011", "Working Party of the Trade Committee, \"Analysis of Non-Tariff Measures: The Case of Export Duties,\" January 31, 2003", "General Agreement on Tariffs and Trade, \"Report by the Working Party on Border Tax Adjustments,\" November 20, 1970", "Tax Foundation, \"A Global Perspective on Territorial Taxation,\" August 10, 2012", "Catholic University Law Review, \"A Common Sense Corporate Tax: The Case for a Destination-Based, Cash Flow Tax on Corporations,\" 2012", "Email interview with Richard Schmalbeck, Simpson Thacher & Bartlett professor of law at Duke University, June 27, 2016.", "Email and phone interview with H. David Rosenbloom, director of the International Tax Program at New York University, June 27, 2016", "Phone and email interview with Joseph Rosenberg, senior research associate at the Urban-Brookings Tax Policy Center, June 27, 2016", "Email Interview with Peter Barnes, senior lecturing fellow at Duke University, June 27, 2016", "Response from Emily Schillinger, communications director for the Ways and Means committee, June 27, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]