["Fake news is bananas by nature, but one particularly slippery claim is actually about bananas said to be infected with HIV.", "\"HIV virus detected in Walmart bananas after 10 year old boy contracts the virus,\" reads the headline on a post we first saw on Feb. 6, 2017, from a website called CNNews3.com. Facebook users flagged the story as part of the social media platform’s efforts to stamp out fabricated news stories.", "The fake story, which is undated, said eight children younger than 17 had tested positive for the virus that causes AIDS in the month of March (it doesn’t say in which year). All eight allegedly ate bananas purchased at a Tulsa, Okla., Walmart store, with the boy in the headline developing symptoms within a week. The text falsely says Walmart stores are recalling bananas nationwide.", "The post included a contrived photo (shown above) featuring a red-streaked banana. The screenshot is made to resemble a breaking news alert from CNN.", "But the website is not the real CNN, and there is no epidemic of HIV-infected bananas. The story is instead a symptom of a long-running online infection of fake news stories about disease-ridden fruit.", "CNNews3.com is filled with several obviously untrue posts about libidinous gorillas and dubious Big Mac ingredients made up to look like news reports, as well as other headlines that could be construed as real without any indication otherwise. The site’s administrators did not answer our attempts to contact them, but it’s obvious that CNNews3.com is attempting to masquerade as the cable news giant with a similar name.", "For the record, HIV can’t survive outside the human body, so it’s not possible for the virus to live in a fruit like a banana. The CNNews3.com tries to cast doubt on this by noting researchers were puzzled by the banana-borne infections.", "Here’s what is true: The Centers for Disease Control and Prevention says on its website that the virus cannot be spread by food. \"Even if the food contained small amounts of HIV-infected blood or semen, exposure to the air, heat from cooking, and stomach acid would destroy the virus,\" the CDC says.", "This particular fake story is a variation on an Internet hoax that has been around for a few years. One version said the World Health Organization issued a warning about bananas being infected with HIV in India. Another said the South African government warned its citizens of a similar problem, then took down warnings to avoid a panic.", "This particular strain of the story can plausibly be traced back to one Facebook user’s photos of red-streaked bananas in November 2015. User Anna Aquavia claimed that her friend’s sister bought bananas in Nebraska that had been injected with HIV-positive blood.", "The photos are now gone, but you can see them at this Washington Post story. The Post credited the images to a Colorado woman named Amanda Andrys, who said Del Monte told her the red streaks were from a bacteria-induced disease called mokillo.", "Mokillo is more colorfully known as finger-tip rot, and can be a problem for banana growers. The disease doesn’t harm humans, but it does require banana growers to disinfect farming equipment.", "Once we peeled back the layers on this story, it was obviously a fake. We rate it Pants On Fire!", "https://www.sharethefacts.co/share/e585b449-4fe0-480e-8201-b78b5a4bc979", "CNNews3.com, \"‘HIV Virus’ Detected In Walmart Bananas After 10 Year Old Boy Contracts The Virus,\" accessed Feb. 6, 2017", "New Yorker, \"We have no bananas,\" Jan. 10, 2011", "Washington Post, \"What was fake on the Internet this week: HIV blood in bananas and SeaWorld whales in plastic bags,\" Nov. 13, 2015", "Manila Times, \"Exporters ask DA for help vs banana disease,\" Dec. 14, 2015", "Philippine Star, \"Banana growers seek help in fight vs Mokillo disease,\" Dec. 20, 2015", "TMZWorldNews.com, \"Bananas are Being INJECTED with the HIV virus!,\" accessed Feb. 6, 2017", "News4ktla.com, \"WHO: Bananas From India Are Being Injected With The HIV Virus Prior To U.S. Shipment,\" accessed Feb. 6, 2017", "BuzzSouthAfrica.com, \"HIV Infected Bananas In SA Supermarket: Health Ministry Cautions,\" accessed Feb. 6, 2017", "Centers for Disease Control and Prevention, \"HIV Transmission,\" accessed Feb. 6, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]