["About this rating", "Sonia Azevedo died on Jan. 1, 2021, two days after receiving a COVID-19 vaccination.", "However, an autopsy concluded that her death was not due to the vaccine. Further, Associated Press previously reported that the U.S. Food and Drug Administration \"found no serious side effects in the tens of thousands enrolled in studies\" for either the Pfizer-BioNTech or Moderna COVID-19 vaccine.", "It was unclear if the vaccine administered to Azevedo was specifically the Pfizer-BioNTech COVID-19 vaccine.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In early January 2021, the India-based WION (World Is One News) published this headline: \"Portuguese nurse dies two days after getting the Pfizer Covid vaccine.\" Russia Today ran with a similar headline: \"Health authorities on alert after nurse DIES following vaccination with Pfizer’s Covid-19 shot in Portugal.\" It also included a conspiratorial tweet in its story that hinted the death was caused by the COVID-19 vaccine. The Daily Mail tabloid also published a piece on the same subject.", "In order to find the truth of the matter, we turned to the source of the news story. On Jan. 4, Portuguese newspaper Correio da Manhã published an exclusive article for paying subscribers, reporting that a 41-year-old woman named Sonia Azevedo received a COVID-19 vaccine on Dec. 30 and that two days later her boyfriend discovered her dead at his house. She was a resident of Maia, located north of Porto in Portugal.", "As for headlines that claimed, \"Portuguese nurse dies two days after getting the Pfizer Covid vaccine,\" Correio da Manhã did not describe Azevedo as a \"nurse.\" The original story in the Portuguese newspaper said that Azevedo was an \"assistente operacional\" (operational assistant) at the Instituto Português de Oncologia (IPO) in Porto.", "According to a rough translation from Google, the story reported the following:", "Shattered and looking for answers. This is how the family of Sónia Azevedo, the operational assistant at the Portuguese Institute of Oncology (IPO) in Porto, died on the first day of the year. She had been vaccinated against Covid-19 on December 30 last year. \"She was fine. She had no health problems. She took the vaccine against Covid-19, but had no symptoms. I do not know what happened. I just want answers. I want to know what led to my daughter's death,\" Abílio Azevedo, the assistant's father, told Correio da Manhã.", "Sónia, 41, had two children. She lived with his family in Maia and worked for more than 10 years at the IPO in Porto. She died at her boyfriend's house, in Trofa. \"She had dinner with us on New Year's Eve and then went to her boyfriend's house. It was he who called me at 11 am to say that he found her still and that she had died. My daughter left home and I never saw her alive again,\" said Abílio, touched.", "The family finds no explanation for Sónia's death. \"My daughter was fine and happy. She never drank alcoholic beverages, she didn’t eat anything special or unusual,\" he said.", "The autopsy on the woman's body will be performed this Monday or Tuesday. Only the result can reveal the cause of death. \"We don't know what happened. It was all so fast and without explanation. I didn't notice anything different about my mother, she was fine. I just said it hurt her where she was vaccinated. But this is normal,\" said Vânia Figueiredo, the victim's daughter.", "A subsequent story confirmed that an autopsy would be performed on Jan. 5. After the autopsy, Correio da Manhã reported on the results:", "The autopsy performed on the Porto IPO official who died two days after being vaccinated against Covid-19 concluded that the cause of death was not due to the vaccine, the government clarified this Tuesday.", "\"It is reported, without any reference to the cause of death, which is covered by the secrecy of justice, that the preliminary data resulting from the medico-legal autopsy carried out today [Tuesday] do not show any relationship between death and the vaccine to that was subject, \"says a statement from the Ministry of Justice.", "The story did not mention why she died. However, this was because Correio da Manhã reported that \"the Ministry of Justice does not mention causes of death because it is covered by the secrecy of justice.\"", "One item not clarified by the Portuguese newspaper was which coronavirus vaccine Azevedo received. WION, RT, and Daily Mail all mentioned the Pfizer-BioNTech vaccine, however, it was unclear where this information was obtained.", "Further, on Dec. 31, the IPO posted on Facebook that 538 of its staff had been vaccinated on Dec. 29 and 30. A translation of the post also said that the vaccination adherence rate was previously tested to be 95% effective, meaning it could have been either the Pfizer-BioNTech or Moderna vaccine. Both were tested at 95%.", "Azevedo's father said that she worked in pediatrics for 10 years. The Portuguese newspaper Correio da Manhã reported of tributes posted on a funeral home website: \"Several parents of children hospitalized at the IPO made a point of remembering the smile of the assistant that will remain forever in their memory.\"", "The Associated Press previously reported on the rigorous clinical trials for both vaccines:", "The FDA found no serious side effects in the tens of thousands enrolled in studies of the two vaccines.", "Still, problems so rare they don’t occur in even very large studies sometimes crop up when a vaccine is used more widely and without the stringent rules of a clinical trial.", "Jan. 6, 2021: This story was updated to include autopsy results that \"concluded that the cause of death was not due to the vaccine.\"", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]