["About this rating", "Digital editing has been responsible for the creation of images of some fantastically fictional looking creatures, such as seven-headed snakes, pink-horned rhinos, and impossibly small kittens. In July 2018, many social media users wondered if they were witnessing a similar creation in an image of an odd-looking, large animal said to be a \"hammerhead bat\":", "We have not been able to pinpoint the exact origins of this photograph, but we can say that the hammerhead bat (also known as the \"hammer-headed bat\") is a genuine animal that looks like the one pictured here.", "The hammer-headed bat (Hypsignathus monstrosus) is a megabat found in the tropical forests of central Africa. A profile on the large fruit bat from Bat Magazine provides some more information about this unusual-looking animal:", "The hammer-headed bat (Hypsignathus monstrosus), widely distributed in equatorial Africa, is one of three species of African fruit bat thought to be asymptomatically infected with the Ebola virus; though scientists do not know if the species is an incidental host or a reservoir of Ebolavirus.", "The little-collared fruit bat (Myonycteris torquata) and the Egyptian fruit bat (Rousettus aegyptiacus) are the other two species. The species is locally common and is typically found in lowland tropical moist forests, riverine forests, swamp forests, mangroves and palm forests, where it roosts in trees. Although colonies up to 25 bats have been observed, the average hammer-headed fruit bat roost is fewer than five bats.", "The hammer-headed bat, with wingspans up to 38 inches (97 cm), is Africa's largest bat. Strong sexual dimorphism is observed in the species, as males are significantly larger than females. Males have a large head with enlarged rostrum, larynx and lips that allows for the production of loud honking calls; the appearance of females is similar to most other fruit bats. The species has a \"lek\" mating system whereby a few hundred males gather into groups (leks) to attract female mates.", "Although the hammerhead bat is a relatively large bat, the viral image may have given some viewers a false impression of the animal's true size. The person holding this fruit bat is extending the animal out toward the camera, and since the bat is closer to the lens than the human, the forced perspective makes the animal appear larger than normal. Photographs exhibiting the forced perspective optical illusion have caused confusion about the relative sizes of frogs, rats, snakes, and half-eaten sharks.", "As noted by Bats Magazine, the hammer-headed bat can possess a wingspan of nearly 40 inches, but it's average body length is only about 10 inches:", "H. monstrosus is the largest bat found in Africa, with males being significantly larger than females. Males range in mass from 228 g to 450 g, averaging 377 g. Females are about half the size, weighing from 218 to 377 g, and averaging 275 g. Males range in length from 220 to 280 mm, with an average of 250 mm. Females measure 195 to 225 mm, averaging 210 mm. Males have a wingspan of 686 to 970 mm, and females have an average wingspan of 840 mm.", "We've collected a few other images of the hammerhead bat for comparison:", "Images of the hammer-headed bat are often met with skepticism, and some viewers claim that this odd-looking creature could be the real-world animal responsible for various sightings of mythical creatures such as the \"New Jersey Devil.\"", "Bat Magazine.   \"Hammer-Headed Fruit Bat.\"     2015.", "Animal Diversity Web.   \"Hypsignathus Monstrosus: Hammer-Headed Fruit Bat.\"     Retrieved 30 July 2018.", "Encyclopedia Of Life.   \"Hypsignathus Monstrosus: Hammerhead Bat.\"     Retrieved 30 July 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]