["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Joe Biden signs an executive order on climate change, in the State Dining Room of the White House on Jan. 27, 2021, in Washington. (AP)", "An old campaign attack continues to dog President Joe Biden.", "A Jan. 25 post on Facebook juxtaposes two news articles: one from the Washington Post and one from Townhall, a conservative news site. The former article says Biden won’t ban fracking, while the latter says he \"followed through\" with a ban.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Throughout the 2020 presidential election, we fact-checked many claims that Biden would ban fracking, a process used to extract oil and gas from the ground. Several of them misrepresented his position, so we wanted to take a closer look at this post.", "(Screenshot from Facebook)", "We found that it, too, distorts Biden’s actions by making them appear more sweeping than they really are. In short, Biden is doing what he said he would do if elected — that is, ban new fracking on federal land.", "On his first day, Biden signed an executive order that put a hold on all oil and gas development in the Alaska National Wildlife Refuge. On Jan. 27, he signed an additional executive order that pauses new oil and gas leases on federal land, effectively banning new fracking there for as long as the policy lasts. His moves leave current fracking untouched.", "Let’s take a closer look at the Facebook post.", "The top of it shows the headline of a Washington Post fact-check published in early October. It debunked a Trump campaign ad that said, if elected president, Biden said he will end fracking. The headline: \"Trump campaign promotes false claim that Biden would end fracking.\"", "The second article in the Facebook post purportedly shows \"what Biden is doing,\" and was published by Town Hall on Jan. 20. Its headline said: \"Biden Administration: Yes, We Are Following Through With a Fracking Ban.\"", "The Townhall article covers an interaction at the first press briefing of the Biden administration. (The article more accurately explains the type of fracking that Biden promised to block.)", "On Jan. 20, White House press secretary Jen Psaki answered a reporter’s question about the executive order that Biden signed that day about Alaska oil and gas drilling. Here’s the exchange, in context:", "Reporter: \"President Biden promised to end all new oil and gas leasing on federal lands when he was a candidate. The order that you just mentioned that he signed today was much narrower than that — it's a temporary moratorium and it only applies to (the Arctic National Wildlife Refuge). And there is some debate about whether he has the legal flexibility to even follow through with his full promise. Does the administration still have that commitment today?", "Psaki: \"We do, and the leases will be reviewed by our team. We just have only been in office for less than a day now\"", "What Biden signed was an executive order that paused the federal government’s implementation of the Coastal Plain Oil and Gas Leasing Program in the Arctic National Wildlife Refuge. The Trump-era program, passed as part of the Tax Cuts and Jobs Act of 2017, directed the Interior Department to issue leases for drilling oil and natural gas in the refuge’s coastal plain. Biden’s order also reinstated an Obama-era policy that withdrew certain areas of the Arctic from consideration for oil drilling.", "\"The Secretary (of the Interior) shall review the program and, as appropriate and consistent with applicable law, conduct a new, comprehensive analysis of the potential environmental impacts of the oil and gas program,\" Biden’s executive order says.", "Biden’s move tracked with his climate change plan, which calls for banning fracking on federal lands but not all fracking.", "RELATED: Biden Promise Tracker", "On Jan. 27 — after the Facebook post and Townhall article were published — Biden signed an additional executive order that directs the interior secretary to \"pause new oil and natural gas leases on public lands or in offshore waters pending completion of a comprehensive review.\" It would effectively prevent new fracking projects on federal land.", "The Interior Department said the order \"does not impact existing operations or permits for valid, existing leases, which are continuing to be reviewed and approved.\" Biden reiterated that point in remarks to the press.", "\"Let me be clear, and I know this always comes up: We're not going to ban fracking,\" he said.", "The Facebook post says Biden is \"following through with a fracking ban.\"", "That’s not quite right.", "Biden has signed two executive orders related to land leases for oil and natural gas drilling. One order pauses new leases specifically in the Arctic National Wildlife Refuge, while the other pauses new leases on all federal land. Neither ban existing fracking operations, and Biden has said repeatedly that he does not intend to do so.", "The Facebook post contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "CNN, \"No, Joe Biden didn't just ban fracking,\" Jan. 27, 2021", "Congress.gov, Tax Cuts and Jobs Act", "C-SPAN, \"President Biden Signs Executive Orders on Environmental Policy,\" Jan. 27, 2021", "C-SPAN, White House Daily Briefing, Jan. 20, 2021", "Facebook post, Jan. 25, 2021", "Federal Register, \"Implementing an America-First Offshore Energy Strategy,\" May 3, 2017", "Federal Register, \"Northern Bering Sea Climate Resilience,\" Dec. 14, 2016", "Federal Register, \"Protecting Public Health and the Environment and Restoring Science To Tackle the Climate Crisis,\" Jan. 25, 2021", "JoeBiden.com, THE BIDEN PLAN FOR A CLEAN ENERGY REVOLUTION AND ENVIRONMENTAL JUSTICE", "Newsweek, \"Fact Check: Does Joe Biden's Executive Order Ban Fracking?\" Jan. 27, 2021", "PolitiFact, \"In debate, Joe Biden said no more oil drilling and no new fracking, didn’t say shutdowns,\" March 20, 2020", "PolitiFact, \"Joe Biden called for limits on fracking, not a ban,\" June 19, 2020", "PolitiFact, \"No, Joe Biden doesn’t want to ban fracking and kill the Wisconsin jobs the industry supports,\" Aug. 18, 2020", "PolitiFact, \"No, Joe Biden doesn’t want to ban fracking or kill the Pennsylvania jobs it supports,\" July 21, 2020", "Townhall, \"Biden Administration: Yes, We Are Following Through With a Fracking Ban,\" Jan. 20, 2021", "U.S. Department of the Interior, \"FACT SHEET: President Biden to Take Action to Uphold Commitment to Restore Balance on Public Lands and Waters, Invest in Clean Energy Future,\" Jan. 27, 2021", "U.S. Department of the Interior, \"Secretary Bernhardt Signs Decision to Implement the Coastal Plain Oil and Gas Leasing Program in Alaska,\" Aug. 17, 2020", "U.S. Geological Survey, \"What is hydraulic fracturing?\"", "The Washington Post, \"Biden plans temporary halt of oil activity in Arctic refuge,\" Jan. 20, 2021", "The Washington Post, \"Trump campaign promotes false claim that Biden would end fracking,\" Oct. 7, 2020", "The White House, \"Executive Order on Tackling the Climate Crisis at Home and Abroad,\" Jan. 27, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]