["About this rating", "A photograph showing a man holding a large bullfrog is real.", "The bullfrog is being held out toward the camera, making it appear larger than usual; This bullfrog does not weigh 13 pounds.", "On 25 May 2017, the South Texas Hunting Association Facebook page posted two images of a man holding an unusually large bullfrog:", "Markcuz Rangel - Wanted to share a monster bull frog we got yesterday afternoon at one of our fishing ponds in South texas ranch located in Batesville tx 13lb monster frog!!! #stxha", "Although the South Texas Hunting Association claimed that this image showed a real 13 pound bullfrog, we're skeptical about the creature's size.", "For one, 13 pounds is simply too big for a frog. Adult American Bullfrogs, the largest frogs in the United States, only weigh about 1.5 pounds. The largest frog in the world, the Goliath Frog, is also too small to meet the requirements of this claim. The Goliath Frog, which has a relatively small habitat range in Cameroon and Equatorial Guinea (and not South Texas), only weighs about 7 pounds.", "In addition to its exaggerated weight, we suspect this picture makes the frog appear larger than it actually is by using forced perspective. The hunter is most likely using a gig pole to hold the frog closer to the camera. This places the frog in the foreground, making it appear much larger in comparison to the man, now standing in the background.", "Photographs showing people \"holding up\" the Leaning Tower of Pisa are good examples of forced perspective photography. The man in the following image, for instance, is not nearly as tall as the famous Italian structure:", "Chron.com that the image was real, but said that forced perspective was used to to make the frog appear unusually large:", "\"It's not as bigly as it appears,\" Lightfoot said video.\" [sic] [It's an] optical illusion created by extending frog toward the camera -- similar to what you see with fishermen holding up fish to make them appear larger. Still a big bullfrog, though.\"", "A very similar claim, featuring a very similar photograph, which used a very similar optical trick, was circulated in November 2015. That image purportedly showing a 42-pound bullfrog was also fake.", "Arkansas Frogs and Toads.   \"American Bullfrog.\"     Retrieved 26 May 2017.", "American Museum of Natural History.   \"Goliath Frog.\"     Retrieved 26 May 2017.", "Hlavaty, Craig.   \"Giant Texas Bullfrog Photo is Real... But Don't be Fooled by What You See.\"     Houston Chronicle.   26 May 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]