["By Saranac Hale Spencer", "Posted on March 22, 2018", "Q: Did “two million people leave the food stamp rolls in Trump’s first year”?", "A: No. That’s the decline in average monthly enrollment in fiscal year 2017, including almost four months when Trump wasn’t president.", "Fact check story on 2 million less people on food stamps ‘thanks’ to 45. I saw this on Facebook this morning.", "The number of people collecting benefits under the Supplemental Nutrition Assistance Program, formerly called food stamps, has been declining since fiscal year 2014.", "Consistent with that trend, average monthly enrollment decreased by about 2 million from fiscal year 2016 to fiscal year 2017.", "That decrease happened only partly on President Donald Trump’s watch.", "Trump took office on Jan. 20, 2017, while the 2017 fiscal year ran from Oct. 1, 2016, to Sept. 30, 2017. So, about four months — a third of that fiscal year — were during Barack Obama’s presidency.", "But some pundits have attributed the entire drop in enrollment last fiscal year to Trump’s policies after the Department of Agriculture released data for the last fiscal year on March 9.", "On “Fox & Friends” on March 17, Rachel Campos-Duffy said: “Two million Americans are off of food stamps. This is, like, the opposite of what happened in the Obama administration, where we saw that number grow. In one year, it’s coming down.”", "It’s true that the number of people enrolled in SNAP initially increased during the Obama administration — reaching a peak average monthly enrollment of 47.6 million in fiscal year 2013. That rise was a consequence of the deep recession that began in 2007, according to a 2012 report by the nonpartisan Congressional Budget Office.", "However, as the economy recovered and poverty and unemployment rates decreased, so did SNAP enrollment, according to the USDA’s Economic Research Service. Enrollment was down to 42.7 million in January 2017, when Obama left office.", "That decline has continued under Trump.", "Enrollment went down by 1.35 million from January 2017, when Trump took office, to December 2017, according to the most recent monthly figures from the USDA, which administers SNAP. By comparison, enrollment declined by 1.88 million over the same time period in 2016 when Obama was president, from 44,852,347 in January 2016 to 42,969,079 in December 2016.", "But Campos-Duffy’s statement was turned into a meme that has been circulating on Facebook, and other websites published stories making similar claims. For example, the Gateway Pundit posted a story with the headline: “TWO MILLION Leave Food Stamp Rolls in Trump’s First Year — Saving Country $3 Billion Annually.”", "Some Facebook users flagged the story as potentially false, and others emailed to ask us if the meme is accurate. Both are misleading.", "There are two things wrong with the claim: It credits Trump with the entire decrease in fiscal year 2017, even though he wasn’t in office for a third of the fiscal year, and it ignores a years-long trend in the reduction of food stamp recipients. If anything, the rate of the decrease in people receiving food stamps has slowed under Trump.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label false stories flagged by readers on the social media network.", "U.S. Department of Agriculture. “A Short History of SNAP.” 28 Nov 2017.", "U.S. Department of Agriculture. “Supplemental Nutrition Assistance Program Participation and Costs.” 9 Mar 2018.", "U.S. Department of Agriculture. “Supplemental Nutrition Assistance Program.” 9 Mar 2018.", "Fox News. Fox & Friends clip. 17 Mar 2018.", "Congressional Budget Office. “The Supplemental Nutrition Assistance Program.” Apr 2012.", "USDA Economic Research Service. “SNAP participation and selected economic indicators, 1980-2016.” 30 Mar 2017.", "Hoft, Jim. “TWO MILLION Leave Food Stamp Rolls in Trump’s First Year — Saving Country $3 Billion Annually.” GatewayPundit.com. 19 Mar 2018.", "Jackson, Brooks. “Trump’s Numbers.” FactCheck.org. 19 Jan 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]