["The photo was published on Twitter here on February 21, 2021.", "The post’s Burmese-language caption translates to English as: “The inhumane acts by the military dictators today. During the violent crackdown that happened on Kannar Road in Mandalay this evening, [the forces] fired their snipers not only at protesters but also at social workers. The injured and dead people were pulled onto the police truck.”", "The post circulated online one day after two people, including a teenager, were shot by security forces during a crackdown on anti-coup protesters in Mandalay on February 20, 2021. AFP reported on the violence here.", "The same image was also shared alongside a similar claim on Twitter here, here, and here and on TikTok here.", "The claim, however, is false.", "A reverse Google image search found the photo was published on a website called Asian Wiki blog here. The post is about a Korean film released in 2007 titled “May 18”.", "“May 18” details the Gwangju Uprising, which began on May 18, 1980 and resulted in several days of deadly clashes between anti-martial law protesters and security forces in the South Korean city of Gwangju.", "Below is a screenshot comparison of the image in the misleading tweet (L) and the Asian Wiki blog image (R):", "The image from the “May 18” film was also published on a Polish movie database site here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]