["The official Twitter handle of Manipur Congress tweeted a collage of four images on January 23 to showcase development in Rahul Gandhi’s turf Amethi and regression in PM Modi’s constituency Varanasi under the last 4.5 years of BJP government. “While PM Modi & the BJP govt. may not care for the contribution of HAL, the people of Amethi are proud of the HAL division in their district – which provides employment for 1100 skilled workers & 200 engineers. #AmethiKiPragati,” wrote Manipur Congress.", "This tweet was made at 1:08 PM and soon after, General secretary and social media in-charge of Mahila Congress Chitra Sarwara also tweeted the same set of images. “काम किया है- @RahulGandhi बस नाम किया है -@narendramodi (Has done work – @RahulGandhi Has only promoted his name – @narendramodi),” read her tweet.", "Himachal Congress and Uttarakhand Congress also tweeted the identical collage.", "Upon reverse-searching the images, Alt News found that the one on the bottom-right dates back to at least 2011. A website Water and Megacities had included the photograph in one of its articles on Varanasi, published on July 28, 2011. Twitter user Ankur Singh had pointed this out. The website is now unavailable although a Google search still throws up the article.", "We also found that the image was used in an article about potholes published by Dainik Jagran in 2012.", "Since the photograph exists on the internet prior to 2014, it cannot be attributed to poor governance under the last 4.5 years of BJP’s rule.", "The other image used by Congress (top-right) is also an old picture, even though it does not date back prior to 2014. We found that the image is a screengrab of a video posted in American stock photo agency Shutterstock in 2015.", "Congress, therefore, used old images to target BJP by portraying that the party hasn’t contributed to development initiatives in PM Modi’s constituency, Varanasi, in the last 4.5 years. Earlier, BJP had used old images (1, 2,) to portray infrastructural projects completed under PM’s Modi’s tenure.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]