["About this rating", "A high balance of more than $5,000 on an EBT card would be exceedingly rare -- but it wouldn't necessarily mean the system was being abused if true.", "Whether or not the photograph showing the receipt is real or forged.", "In August 2016, several viral web sites started circulating a story about a shopper in Liberty, Kentucky, who picked up a receipt dropped by another shopper who was (according to the story) a recipient of \"food stamps.\"", "The unnamed person took a picture of the receipt, showing the shopper spent about $40 at the grocery store Save-A-Lot. But they were \"floored\" to see this shopper also had an EBT food balance of $5,583.42:", "So, this individual could spend over 5 grand in that store, much more than most working people have in their savings account, and none of that money would actually be money that they had earned. It was taxpayer money. Your money.", "Turns out this isn’t isolated. There have been cases of up to 20 grand in EBT balances and many other abuses on the system taking place.", "EBT stands for Electronic Benefits Transfer. Funds are dispersed to qualifying beneficiaries from the federal government on debit-like cards for food purchases. According to officials from Food and Nutrition Service (a subsidiary of the U.S. Department of Agriculture, which oversees the Supplemental Nutrition Assistance Program, or SNAP), it's not impossible for a recipient of assistance to have a high balance on their EBT card — but it is highly unlikely. A USDA spokesman told us:", "As of June 2015, FNS identified 1,783 households nationwide with balances of $2,500 or higher.  That represents 0.00008 percent of the 22,436,441 households nationwide in the same month.", "It's actually 0.008%, but even if the shopper in Liberty, Kentucky happened to be one of the less than 1 percent of households with a EBT balance over $2,500, the balance in and of itself doesn't represent \"abuse.\" Per the USDA:", "Existing law allows program recipients to accumulate unused benefits, so long as the account is active. To remain in active status, an account must be used at least once during a 12-month period or the benefits will be expunged. There is no cap on the amount of benefits that may be accumulated...", "A number of news reports have suggested that households may accrue large SNAP balances because they “no longer need” assistance.  SNAP households are required to report changes in income at least every 6 months and to completely recertify their eligibility for benefits at least once every 12 months, with the exception of certain households in which all members are elderly or have a disability and have no earned income.", "Households are required to promptly report any change in income that might make them ineligible.  Participants who fail to report these changes are subject to claims for repayment of any overpayments received, and State agencies are required to remove them from the program if they are no longer eligible.", "Further, FNS reviewed high-balance holders and found that \"few of these households exhibit behavior that suggests potential fraud.\" The states of Texas and Ohio reviewed recipients who accumulated high balances. Findings reflected that those balances resulted largely from frugality — using the funds only when needed or using coupons to cut costs. Some recipients reported transportation problems impeding them from making frequent grocery trips, resulting in accumulation of food benefits.", "The viral stories don't provide enough information to identify the recipient, nor do they identify the person who posted the picture of the alleged receipt, but Glen Phillips, Jr. claimed in a 22 June 2016 Facebook post to have found the receipt in his driveway. While it's impossible to determine whether an individual in Kentucky really has an EBT food balance of more than $5,000, it would hardly prove they were abusing the system — if it were shown to be true.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]