["About this rating", "Ever since the 2007 publication of the seventh and final Harry Potter novel, Harry Potter and the Deathly Hallows, many fans of the fantasy series have been hoping author J.K. Rowling might change her mind and pen additional volumes featuring the adventures of Harry, his friends Ronald Weasley and Hermione Granger, and the rest of the gang from the Hogwarts School of Witchcraft and Wizardry. Such expectations were stoked in September 2013 by the web publication of an article stating that not only was Rowling planning an eighth Harry Potter novel, but that she was already 75% done with the manuscript:", "Yahoo News and the New York Times today confirmed that J.K. Rowling is writing the eighth Harry Potter novel, and is already 75% done with the manuscript. Details on the storyline are hush hush, but Rowling is said to be revealing more about the upcoming HP novel later this very week in a press conference in Scotland.", "Rowling is said to be disappointed to the reaction of her adult novel The Casual Vacancy, released last fall, which left readers worldwide perplexed and disappointed. She was discouraged particularly by the disappointment of the younger readers, who picked up The Casual Vacancy expecting another Harry Potter book. She wanted to go back and write a book that will be a treat to her fans all around the world.", "However, J.K. Rowling has announced no such plans, and neither Yahoo News nor The New York Times (nor any other reputable web site) reported that she has. This item was a hoax, a spurious rumor spread by the disreputable Top Information Post web site, a site which has a history of picking up and republishing false information from other sources with no regard for its veracity. In this case, Top Information Post simply reproduced an article that was clearly an April Fool's Day joke, published on another web site on 1 April 2013.", "On 12 September 2013, Warner Bros. did announce that J.K. Rowling would be penning a screenplay inspired by Harry Potter's Hogwarts textbook \"Fantastic Beasts and Where to Find Them\" and featuring the adventures of the book's fictitious author, Newt Scamander. Although that film will be set in the same wizarding world as the Harry Potter books, it will not be part of (nor is it a prequel or sequel to) the Harry Potter series:", "\"Fantastic Beasts and Where to Find Them\" will be an original story and will mark Rowling's screenwriting debut. It is planned as the first picture in a new film series. Set in the wizarding world, the story will feature magical creatures and characters, some of which will be familiar to devoted Harry Potter fans.", "\"Although it will be set in the worldwide community of witches and wizards where I was so happy for seventeen years, 'Fantastic Beasts and Where to Find Them' is neither a prequel nor a sequel to the Harry Potter series, but an extension of the wizarding world,\" said Rowling. \"The laws and customs of the hidden magical society will be familiar to anyone who has read the Harry Potter books or seen the films, but Newt's story will start in New York, seventy years before Harry's gets underway.\"", "In 2016, a new story set in the Harry Potter universe explored the adult lives of the original series' main characters. However, Harry Potter and the Cursed Child was not a book authored by Rowling, but a play written by by Jack Thorne and John Tiffany (and sanctioned by Rowling) that was released as a script book.", "On 17 August 2016, Rowling announced on her official web site that she would be releasing three new collections of short stories as e-books: one that explores the history of Hogwarts school, one that delves into the machinations around the world's politics and prisons, and a third that offers up new stories on some of the school's staffers.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]