["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On Sept. 5, 2020, a message started circulating on Facebook claiming that grocery chain Kroger had banned its employees from wearing face masks adorned with the American flag, but permitted its employees to wear masks in support of the Black Lives Matter movement:", "There is no basis for this claim. This claim appears to have been made up out of whole cloth and placed against a colorful background, which, for some unexplained reason, lends statements unearned credibility.", "Kroger started requiring employees to wear face masks in stores in April 2020 in order to comply with CDC guidelines on how to best slow the spread of COVID-19. Kroger said at the time that they would be supplying masks for its employees. An employee news bulletin from Harris Teeter, a grocery store owned by Kroger, noted that employees could provide their own masks as long as the masks were of a solid color (or a simple pattern) and that they were absent of slogans or third party logos.", "We have not come across any news stories about Kroger employees being told not to wear American flag masks. We have, however, come across several stories about Kroger explicitly prohibiting employees from wearing BLM masks.", "In August 2020, there was a small controversy after some Kroger employees at stores in Detroit, Michigan, started wearing BLM shirts to work. According to Fox 2 Detroit, some employees also put on BLM masks. Management at these stores, however, told employees to remove or cover up these items, and a spokesperson for the store said that Kroger's uniform policy states that clothing \"must be clean, professional, and without visible pictures, logos, words or abbreviations.\"", "Kroger said in a statement:", "\"Our uniform policy must be clean, professional, and without visible pictures, logos, words or abbreviations including masks (ONLY exception is Local UFCW 876 mask or company provided mask). All associates must wear aprons to show that we are here to serve our customers, communities and each other.\"", "Kroger release a second statement acknowledging it wanted to \"offer a workplace that is uplifting, inclusive, and consistent with Our Values: Integrity, Honesty, Diversity, Inclusion, Safety and Respect\" and that it had produced wristbands that employees could wear in order to show their support for Black customers and communities:", "\"At Kroger, we strive to offer a workplace that is uplifting, inclusive and consistent with Our Values: Integrity, Honesty, Diversity, Inclusion, Safety and Respect. Many associates have expressed a desire to stand together with their communities and show their support through their clothing, facial coverings and accessories. While we are not adjusting our existing dress code, rules or policies, we acknowledge our associates’ feedback and want all to feel supported and heard.", "\"To offer a more consistent solution, we produced wristbands and made them available to all associates. Working with our partners, including a Black-owned supplier, we produced two wristband options, which were distributed in early July: one that represents our commitment to Standing Together with our Black associates, customers and communities against racism in all forms, and the other to serve as a reminder of Our Values that guide us.\"", "In other words, Kroger does not allow its employees to wear BLM masks (or any masks containing slogans or logos) as claimed in the viral Facebook post. It's possible that flag masks would also be prohibited under this policy as well, but Kroger did not ban flag masks while allowing BLM masks.", "It's possible that the above-displayed Facebook post conflated Kroger with another grocery chain, Food Lion, which was briefly mired in controversy when they prohibited employees from wearing American flag masks. This, again, was not a \"ban\" on the flag, but an enforcement of the grocery store's uniform policy, which, like Kroger, prohibited employees from wearing items with \"writing, insignia or symbols.\" Food Lion later modified its policy to allow flag masks.", "In summary, Kroger started requiring employees to wear masks to combat the spread of COVID-19 in April 2020. The company provides masks to employees. For those who choose to wear their own masks, these face coverings have to conform to the company's uniform policy, which prohibits the display of slogans and logos, such as BLM. It's possible that this policy would also prevent employees from wearing flag masks, but we've yet to come across any reports from employees stating that this is the case. Regardless, it is false to say that Kroger banned flag masks while allowing BLM masks.", "We've reached out to Kroger for more information, and will update this article accordingly.", "Grzeszczak, Jocelyn.   \"Grocery Chain Reverses Course, Allows Employees to Wear Patriotic Face Masks.\"\r\n    Newsweek.   5 September 2020.", "Fox 2 Detroit.   \"Bloomfield Kroger Employees Say They Were Not Allowed to Wear Black Lives Matter Shirts, Masks.\"\r\n    31 August 2020.", "Legum, Judd.   \"Kroger Unmasked.\"    \r\n    Popular Information.   15 June 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]