["About this rating", "On 21 August 2017, RochdaleHerald.co.uk published an item claiming R&B singer Mariah Carey recorded a cover of a Dead Kennedys song in support of Antifa:", "Born again Christian pop singer and self styled “voice of the MTV generation” Mariah Carey, has sent shock waves through tin pan alley with the announcement that she has recorded a cover of the Dead Kennedy’s “Nazi Punks Fuck Off” to be released as a single and with the proceeds to be donated to US anti Fascist action group ANTIFA.", "The shock release is slated to be available as MP3 and Flac downloads as well as CD single and a strictly limited edition vinyl double single in red vinyl featuring bonus covers of “California Über Alles” and “Too Drunk to Fuck”.", "\"Quotes\" appearing in the story attributed to a spokesman hinted that the claim was intended to be read as satire:", "“Mariah may be best known for producing some of the most dismally bland commercial music of the past two decades and for dating obscenely rich men but she feels this is the time to make a break with the past and embark on a new stage in her career,” he explained. The spokesman confirmed that plans are far advanced for Carey to do a nationwide tour of small club venues with a four piece backing band. “We can’t confirm the line up yet but East Bay Ray has said he’s up for it, and (Ex Hüsker Dü guitarist) Bob Mould is interested,” he added.", "News of the shock release has been taken by many to confirm long standing rumours that Carey had been secretly dating former Kennedy’s front man Eric Boucher, better known under his stage name Jello Biafra.", "The Rochdale Herald's \"About\" page clarified that the site's entire purpose was indeed meant to poke fun at current events:", "The Rochdale Herald is a satirical, spoof, parody commentary on current affairs, and stuff that annoys and amuses us. We make it up and it’s not intended, in any way whatsoever, to be considered factual.", "If you read a story on The Rochdale Herald, please take a deep breath before going off the deep end as we probably made it up, apart from the horoscopes, they’re all completely legit (no they aren’t, we make those up too). We don’t spend much time checking facts or corroborating sources because, and we can’t stress this enough, we’re not actually journalists and are making most of it up. This is an entertainment site that may occasionally confuse some fact with fiction and vice-versa but ultimately we’re writing about the news to make you laugh. We also might talk about sex and swear a bit from time to time so if you’re under 18 please don’t read it.", "Any resemblance to actual persons, living or dead, or actual events is purely coincidental, seriously ... If we’ve written about something that’s offended you, please accept our apologies. Unless you are just being a big sissy and have forgotten how the internet works.", "Prior to the claim about Mariah Carey and Antifa, The Rochdale Herald \"reported\" that Buzz Aldrin (one of the first two men to walk on the moon) described not punching President Donald Trump as his \"greatest achievement\".", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]