["Indian elections are set to take place between April 11 and May 19. Here is an AFP story about the upcoming polls.", "Multiple Facebook posts, for example this one published March 27, 2019, contain a 2 minute 43 second video that has been viewed more than 2,000 times.", "The footage shows a school bus packed with blue boxes next to a pick-up truck carrying large metallic containers. Other vehicles can be seen as well as a crowd of men talking to each other and filming the scene on their phones.", "The post's caption says: \"Breaking News… The conspiracy of Modi, Shah and the Election Commission is revealed. They were caught while storing several EVM machines in strong rooms from an unnumbered school bus and three Bolero jeeps in Bina town in Madhya Pradesh.", "\"No responsible authority is able to give a clear answer, this is why Shah and Modi are so confident about forming the government.. Share this video to the maximum so people would know the reality of Modi and the democracy is saved.\"", "The post is referring to Indian Prime Minister Narendra Modi, BJP president Amit Shah, and the Election Commission of India. EVM stands for electronic voting machine.", "Below is a screenshot of one of the misleading posts:", "The people in the video can be heard complaining on camera about the carelessness of the Election Commission in handling the voting machines.", "One of them says: \"None of these vehicles have registration plates, we are being fooled and this is the murder of democracy and constitution.\"", "The video has been shared repeatedly online with the same claim, for example here on Facebook, here on Twitter and here on YouTube.", "A Google reverse image search using keyframes from the misleading footage found it actually showed a November 2018 incident over the storage of electronic voting machines in the city of Khurai in Madhya Pradesh state, around 20 kilometres (12 miles) from Bina.", "The exact same footage as appears in the misleading post was uploaded to YouTube here on December 2, 2018. The footage starts from 00:46.", "The video's caption says: \"Hundreds of EVM & VVPAT machines detected in School Bus. EVM-Scam. Election Commission Scam\".", "On November 30, 2018, India's opposition Congress Party tweeted images here which correspond to the misleading video.", "The tweet contains four photos – two of a school bus and two of blue boxes – that match the misleading video.", "When translated, the Hindi-language tweet says: \"Forty-eight hours after voting in Madhya Pradesh, an attempt was made to transfer EVMs in strong room in a car without a registration number.", "\"Is this a ploy to let BJP win by changing the EVMs? There should be a strict enquiry against collector and election commission officers and democracy should be saved.\"", "The tweet is embedded below:", "मप्र के गृहमंत्री के क्षेत्र में मतदान के 48 घंटे बाद बिना नंबर की गाड़ी से ईवीएम स्ट्रांग रूम में जमा कराने का प्रयास हुआ।\n\n\t\t—भाजपा को जिताने के लिये ईवीएम बदलने की सरकारी साज़िश..?\n\n\t\tकलेक्टर, एसपी समेत निर्वाचन कार्य में लगे तमाम लोगों पर सख़्त कार्यवाही कर लोकतंत्र की रक्षा हो। pic.twitter.com/lj588NdyA5", "The Election Commission of Madhya Pradesh responded to the Congress allegations in this November 30 tweet which says that the photos show voting machines that were back-ups not used in the state elections.", "The tweet says: \"These are EVMs kept as 'Reserve' stationed at some Police stations, to be used as replacement for malfunctioning machines during Poll.", "\"Such machines were to be stored separately from polled EVMs. Strong room having Polled EVMs was neither opened nor was supposed to be opened.\"", "These are EVMs kept as 'Reserve' stationed at some Police stations, to be used as replacement for malfunctioning machines during Poll. Such machines were to be stored separately from polled EVMs. Strong room having Polled EVMs was neither opened nor was supposed to be opened. https://t.co/usco7xQpD1", "Election Commission of India spokesperson Sheyphali Sharan also replied to these tweets here saying:", "\"Chief Electoral Office again reaffirms that all EVMs are tamperproof. All EVMs are safely secured and sealed in strong rooms. More importantly they are under joint surveillance of police force and political parties.\"", "The issue was reported on here by major Indian broadcaster NDTV, here by The Hindu and here by the Hindustan Times.", "Below is the English-language NDTV broadcast, dated December 1, 2018:", "The NDTV report contains images that also match the footage in the misleading Facebook post, as illustrated in the collage below:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]