["About this rating", "On May 17, 2015, then-U.S. Vice President Joe Biden issued a short statement in observance of the International Day Against Homophobia and Transphobia. Those remarks (in full) read as follows:", "My father taught me the simple notion that everyone, everywhere is entitled to be treated with dignity and respect. When it comes to LGBT people, that simple proposition has been painfully difficult to accomplish over the years. But in the last decade, thanks to the astounding bravery of the LGBT community and those who have championed their cause, the United States has made remarkable progress toward the ultimate goal of equality in law and in life. Our progress remains incomplete, but the momentum has shifted in the right direction.", "Progress has also been made in many places around the world. But in too many places, life for lesbian, gay, bisexual, and transgender individuals is actually getting worse. In too many places, LGBT community members face violence with impunity, mistreatment by police, the denial of healthcare, or religious condemnation and social isolation.", "The best mechanism to confront this hatred is to speak up in favor of universal human rights. Supportive voices must be heard. Today and every day, let us continue to defend the rights of LGBT people, whether from nearby cities or far-off villages. We cannot rest until everyone receives the dignity, respect, and equal treatment under the law that all people deserve.", "A few days later, Geoffrey Grider, the \"author and editor-in-chief\" of the Now The End Begins (NTEB) website (self-described as delivering \"aggregate breaking news of the day from a biblical perspective\"; categorized elsewhere as a \"far-right Christian conspiracy website\") published an article under the headline \"Joe Biden Says Bible Believing Christians Violate LGBTQ Rights by Simply Existing.\" In the piece he asserted that, \"According to Joe Biden, the American Bible believing Christian who takes the Bible literally, is violating the 'rights' of the LGBT by trusting in God's word\":", "But the NTEB headline claim was not a remotely accurate or reasonable summary of what Biden actually said.", "The vice president merely noted that LGBTQ community members face the challenge (among many others) of \"religious condemnation\"; he did not single out Christianity or \"American Bible believing Christians\" as the sole source of that condemnation. Nor could Biden's words fairly be said to apply to all Christians, as interpretations of biblical passages that supposedly reference homosexuality, as well as official church positions on the issue of homosexuality, vary widely across different Christian denominations.", "Grider, Geoffrey.   \"Joe Biden Says Bible Believing Christians Violate LGBTQ Rights by Simply Existing.\"\r\n      Now the End Begins.   19 May 2015.", "The White House -- Office of the Vice President.   \"Statement by the Vice President on the International Day Against Homophobia and Transphobia.\"\r\n    17 May 2015.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]