["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "As the U.S. geared up for the 2020 presidential election, the unprecedented Republican National Convention (RNC) event held at the White House took center stage as images of the large gathering shared online appeared to show hundreds of attendees sitting side by side and without facial coverings in the midst of the coronavirus pandemic.", "Shortly after the Aug. 27 event, a photo that showed the White House lawn packed with people was shared to Twitter and went viral in the days that followed. Snopes readers asked our team to verify whether RNC attendees ignored social-distancing and mask-wearing recommendations put out by leading health officials earlier in the year.", "This claim is true. Hundreds of people were indeed recorded sitting within close proximity of each other — certainly closer than the recommended 6-foot guideline — while very few individuals were seen wearing a mask.", "The source for the image shared to Twitter was not immediately clear. A reverse-image search found 15 results, most of which linked back to Reddit and Imgur. While it is not immediately clear when the image in question was captured or who took it, Snopes corroborated elements from the photo with CSPAN live footage of the event and confirmed that attendees at the RNC convention did not appear to be practicing social distancing. Many were seen sitting side by side on the White House lawn, and few were wearing masks. A wide shot of the audience can be seen beginning at the 1-hour and 36-minute mark onward.", "https://www.c-span.org/video/?475004-1/republican-national-convention-day-4&live", "The event followed three days of convention activities in Charlotte, North Carolina, in which delegates officially selected incumbent Republican President Donald Trump and Vice President Mike Pence.", "In light of COVID-19 coronavirus regulations in the southern state, RNC representatives stated that organizers had \"modified\" convention rules to better align with the North Carolina governor’s executive order and limited the number of people allowed to gather. However, a look at COVID-19 restrictions in place at the time in North Carolina, and three days later in D.C., suggests that the convention committee did not adhere to regulations put in place by local government leaders.", "In August 2020, North Carolina's \"Safer at Home\" Phase Two restrictions required people to wear face masks while out in public when physical distancing of 6 feet was not possible, as well as limited gatherings to 10 people indoors and 25 people when outside. A government release shared by North Carolina officials confirmed that nearly 800 tests were conducted among those attending or providing support to the Charlotte meeting, and at least four people involved with the convention tested positive for COVID-19.", "On June 22, the District of Columbia also issued Phase Two regulations that prohibited mass gatherings of more than 50 people and similarly required people to wear masks outdoors when they were likely to come \"within six feet of another person for more than a fleeting time.\"", "In his acceptance speech, Trump did not mention mask-wearing or social-distancing but did promise a “safe and effective” vaccine by the end of the year — “or maybe even sooner” — adding that America will “crush the virus.”", "Confusion in the early days of the 2020 COVID-19 pandemic resulted from mixed messages shared by the White House and federal officials and soon became a point of political partisanship during the presidential election.", "Studies conducted by infectious disease experts confirmed that masks slow the spread of SARS-CoV-2, the coronavirus that causes the respiratory infection. The Centers for Disease Control and Prevention (CDC) flip-flopped on its mask-wearing stance at the onset of the pandemic, but in August 2020 reiterated that people in public settings should wear masks that completely cover the nose and mouth.", "De Vries, Karl. Watts, Amanda.   \"Republican Convention in Charlotte Tied to 4 Cases of Covid-19.\"\r\n    CNN.   28 Aug 2020.", "Palma, Bethania.   \"Ethics Experts Call Out Regulator Approval of RNC White House Speeches.\"\r\n    Snopes.   28 Aug 2020.", "Associated Press.   \"Pandemic Politics: Maskless Trump Tours Michigan Ford Plant.\"\r\n    Snopes.   21 May 2020.", "Hub Staff Report.   \"Understanding Changing Guidance on Mask Use.\"\r\n    Johns Hopkins University.   24 April 2020.", "Ibrahim, Nur.   \"Is This a Real Lineup of Speakers at the Republican National Convention?\"\r\n    Snopes.   24 Aug 2020.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]