["One of the defining public policy debates of our time has been about Obamacare, formally the Patient Protection and Affordable Care Act, passed in 2010.", "So PolitiFact Rhode Island was listening closely to the July 28, 2013 broadcast of Channel 12 \"Newsmakers,\" on which Rhode Island Lt. Gov. Elizabeth H. Roberts appeared. She is a leading figure in the debate, as chairwoman of the state Healthcare Reform Commission, which is charged with implementing Obamacare in Rhode Island.", "Providence Journal reporter Felice Freyer, one of the panelists, asked Roberts a hot-button question about Obamacare, which calls for the creation of state health insurance exchanges where individuals who don’t have health insurance or are seeking an alternative to plans provided by their employers may buy their own coverage.", "Since World War II, employer-paid coverage has been a cornerstone of health care insurance in the United States. Any possibility that the cornerstone will crumble has been a major topic in the debate.", "The Obamacare exchange is scheduled to open for enrollees in Rhode Island Oct. 1. After that happens, Freyer wanted to know, might employers just cancel their own insurance -- in order to save money and trouble -- and fob off their employees on the exchange.", "In reply, Roberts pointed to \"Romneycare.\" That is the seven-year-old health care insurance program in Massachusetts nicknamed for former Massachusetts Gov. Mitt Romney and often cited as the model for Obamacare.", "\"They’ve seen employer-supported coverage increase in Massachusetts after [Romneycare] was implemented,\" Roberts declared. \"I think lots of people were worried [that employers might drop coverage] but it hasn’t been what has happened.\"", "Are more Massachusetts employers providing coverage now than before \"Romneycare?\"", "First, a little background. Obamacare requires businesses with 50 or more employees to offer health insurance or pay a penalty.", "In Massachusetts, a penalty that applied to businesses with 11 or more employees was in force until July 1, when it was abolished in anticipation of the implementation of the Obamacare penalty. But then implementation of the federal employer mandate and accompanying penalty unexpectedly were delayed until 2015. Massachusetts Gov. Deval Patrick has warned employers in his state not to take advantage of the hiatus by dropping their insurance.", "A trip to the website of the Commonwealth of Massachusetts Health Insurance Connector Authority, the agency that oversees Romneycare, showed that Roberts had her facts right.", "In 2001, well before Romneycare took effect, 69 percent of Massachusetts employers offered insurance, according to the Connector. As of 2010, four years after Romneycare was enacted, 77 percent offered insurance, the Connector says.", "Fresher data from another government body, the Center for Health Information and Analysis of the Massachusetts Executive Office of Health and Human Services, confirmed the trend. From 2005, the year before Romneycare was signed into law, through 2011, the percentage of employers offering insurance increased from 70 percent to 76 percent, according to a survey of employers.", "And a study by the independent Henry J. Kaiser Family Foundation, \"Massachusetts Health Care Reform: Six Years Later,\" found that employer coverage had not decreased.", "When we checked with Roberts’ office about the basis of her statement, her spokeswoman, Maria Tocco, referred us to the Health and Human Services survey, albeit from a companion report.", "Nationally, according to Massachusetts authorities, only 60 percent of employers offer health insurance.", "Asked why more Massachusetts employers offered insurance even though an alternative had been created, Jason Lefferts, the Connector director of communications, said the business community responded to a call to duty from government when health care reform was enacted.", "\"We saw great buy-in from the business community\" and an acceptance that health care is a shared responsibility of the individual, business and government, Lefferts said. \"There was a message that everyone was in this together.\"", "The Massachusetts authorities went even further on the Connector website, to predict that as employment rebounds in their state, \"reliance on public sector insurance will decrease.\" Lefferts said the business community’s track record makes that a safe prediction.", "Our ruling", "Rhode Island Lt. Gov. Elizabeth H. Roberts said that Massachusetts has \"seen employer-supported coverage increase\" since \"Romneycare\" was implemented.", "Massachusetts officials have published figures that back her up. The judges rate her claim True.", "WPRI Channel 12 \"Newsmakers,\" July 28, 2013", "FactCheck.org, \"RomneyCare Facts and Falsehoods,\" March 28, 2011, accessed July 30, 2013", "Henry J. Kaiser Family Foundation, \"Massachusetts Health Care Reform: Six Years Later,\" , May 1, 2012, accessed July 30, 2013", "ABCNEWS.go.com, \"Romneycare in Massachusetts, Six Years Later,\" June 21, 2012, accessed July 31, 2013", "Massachusetts Health Insurance Connector,  \"Health Care Reform: Overview,\" 2012, accessed July 31, 2013", "Massachusetts Health Insurance Connector, \"The Top Ten Facts about Massachusetts Health Care Reform,\" 2012, accessed July 31, 2013", "Massachusetts Executive Office of Health and Human Services, \"Massachusetts Household and Employer Insurance Surveys: Results from 2011,\" page 11, January 2013, accessed July 31, 2013", "Massachusetts Executive Office of Health and Human Services, \"Massachusetts Health Insurance and Employer Survey Chartbook, Updates for 2011,\" page 46, January 2013, accessed Aug. 1, 2013", "Interview: Jason Lefferts, director of communications, Commonwealth of Massachusetts Health Insurance Connector Authority, July 31, 2013", "Email: Maria Tocco, spokeswoman for Lt. Gov. Elizabeth Roberts, Aug. 1, 20", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]