["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An official counts ballots for Georgia's Senate runoff election at the Georgia World Congress Center on Jan. 6, 2021, in Atlanta. (AP)", "The Georgia secretary of state’s office told PolitiFact its data did not reflect a drop in votes for Sen. David Perdue at any point.", "Votes for Perdue appeared to change during CNN’s broadcast because the firm that the network gets its data from corrected an error.", "Democrats are projected to take control of the Senate after Georgia’s runoff election, but on Facebook, some people are casting doubt on the vote-counting process.", "In a Jan. 5 post, a Facebook page called Prime Time Patriots published a clip from CNN’s broadcast of election results. In a caption, the account said the video showed \"32,000 votes disappear from Georgia Senate run-off candidate David Perdue live on CNN.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "Prime Time Patriots also published the video on YouTube, where it has more than 27,000 views. We found dozens of similar claims about disappearing votes for Perdue using CrowdTangle, a social media insights tool.", "After the 2020 presidential election, run-of-the-mill clerical errors in the vote counting process were taken out of context to spin a false narrative of voter fraud. So we wanted to take a closer look at claims that Perdue lost votes during the runoff.", "Those claims are wrong — the Georgia secretary of state’s office told PolitiFact its data did not reflect a drop in votes for Perdue at any point. The tally appeared to change during CNN’s broadcast because the firm that the network gets its data from corrected an error.", "Many news organizations don’t get their vote tallies directly from the states — they get them from third-party organizations. CNN receives data from Edison Research, a company that contracts with the National Election Pool, a consortium of American news organizations, to provide real-time vote results.", "Rob Farbman, executive vice president of Edison Research, told PolitiFact in an email that the vote drop for Perdue actually corrected a previous mistake in the vote counting process.", "\"The vote drop for Perdue happened after we corrected an error that had erroneously added 32,000 to Perdue’s vote count in Bibb County,\" he said. \"The incorrect vote was entered by a data entry operator reporting results collected by an Edison reporter stationed at the Bibb County Office. This error was corrected within five minutes and accounts for the brief additional 32,000 votes for Perdue.\"", "That means that, at the time of CNN’s broadcast, Perdue had 742,323 votes, not 774,723. The sudden drop adjusted for that error.", "We reached out to CNN for a comment, but we haven’t heard back.", "The Facebook post contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "RELATED: How will the Senate work under a 50-50 split?", "CNN, \"It's not magic, it's math. Here's how CNN makes election projections,\" Oct. 17, 2020", "CrowdTangle, accessed Jan. 6, 2021", "DDHQ Election Results, accessed Jan. 6, 2021", "Email from the Georgia secretary of state’s office, Jan. 6, 2021", "Email from Rob Farbman, executive vice president of Edison Research, Jan. 6, 2021", "Facebook post, Jan. 5, 2020", "The New York Times, \"How Claims of Dead Michigan Voters Spread Faster Than the Facts,\" Nov. 6, 2020", "YouTube video, Jan. 5, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]