["Republican Ken Cuccinelli says if he’s elected governor, he won’t push for strategic bills that could be used to challenge the U.S. Supreme Court’s 1973 Roe v Wade decision that established abortion rights.", "He made the declaration during a July 20 debate against Democrat Terry McAuliffe. Moderator Judy Woodruff asked Cuccinelli, who opposes abortions, whether he would sign a law defining life as beginning at conception.", "Cuccinelli, who has backed such legislation in the past, said \"when those things hit my desk, I’ll be supportive of them, \"but stressed that his focus is on jobs and the economy.", "\"Certainly I want to respect life as best we can, but we can’t defy the (U.S.) Constitution as it stands now,\" Cuccinelli said. \"Every bill I’ve ever supported has either had language that says we’re conforming to the constitutional rulings of the Supreme Court or language to that effect. I’m not looking to make a challenge in that respect.\"", "We wondered whether every bill that Cuccinelli has backed granting personhood to fetuses has contained language saying the legislation is not intended to challenge high court rulings. We found two clear occasions when he supported such legislation during his career as a state senator from 2002 to 2009 and attorney general starting in 2010.", "Ana Nix, a spokeswoman for Cuccinelli’s campaign, pointed us to a 2012 bill introduced by Del. Bob Marshall, R-Prince William. Cuccinelli spoke at a rally supporting the legislation on the state capitol’s grounds.", "The bill contained this clause: \"The laws of this Commonwealth shall be interpreted and construed to acknowledge on behalf of the unborn child at every stage of development all the rights, privileges, and immunities available to other persons, citizens and residents of this Commonwealth, subject only to the Constitution of the United States and decisional interpretations thereof by the United States Supreme Court and specific provisions to the contrary in the statutes and constitution of this Commonwealth.\"", "So this measure, which passed the House of Delegates and died in the Senate, supports Cuccinelli’s debate statement. But his campaign neglected to mention the other personhood bill Cuccinelli weighed in on, and it erodes the candidate’s claim.", "In 2007, Cuccinelli cosponsored unsuccessful legislation that said life begins at the moment of fertilization and extended the \"right to the enjoyment of life\" from that point onward. The bill contained no language deferring to Supreme Court precedence.", "Our ruling", "Cuccinelli said all the bills he’s supported defining life as beginning at conception have contained language saying measures are intended to comply with Supreme Court rulings on abortion rights.", "Cuccinelli has backed two bills during his career; one had the qualifying clause he described and the other -- which Cuccinelli cosponsored -- did not.", "We rate his statement False.", "Ken Cuccinelli’s comments at the Virginia Bar Association debate, July 20, 2013.", "E-mail from Anna Nix, spokeswoman for the Cuccinelli for Governor, August 1, 2013.", "E-mail from Brian Coy, spokesman for the Democratic Party of Virginia, July 22, 2013.", "Legislative Information System, H.B. 1 from the 2012 session, accessed Aug. 6, 2013.", "Legislative Information System, H.B. 2124 from the 2007 session, accessed Aug. 6, 2013.", "Legislative Information System, H.B. 2797 from the 2007 session, accessed Aug. 6, 2013.", "Legislative Information System, S.B. 319, from the 2004 session, accessed Aug. 6, 2013.", "The Washington Times, \"Virginia Republicans push back against critics of their agenda,\" Feb 15, 2012.", "The Washington Post, \"Virginia Assembly to tackle abortion,\" Jan. 15, 2007.", "The Washington Post, \"Assembly rebuffs Warner amendments,\" April 22, 2004.", "Richmond Times-Dispatch, \"Fetal-death bills advance,\" Feb. 3, 2004.", "Richmond Times-Dispatch, \"Familiar health issues on list,\" Jan. 11, 2004.", "Richmond Times-Dispatch, \"‘Fetal homicide’ to be law,\" May 22, 2004.", "Richmond Times-Dispatch, \"Assembly’s vote bans same-sex unions in Va.,\" April 22, 2004.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]