["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Demonstrators protest on June 4, 2020, at the Martin Luther King Jr. Memorial in Washington, over the death of George Floyd. (AP)", "The post includes an image of graffiti on a veterans memorial.", "The photo was taken in 2016 and shows a vandalized Vietnam War memorial in Venice, Calif. It is not related to recent demonstrations over the death of George Floyd.", "Some Black Lives Matter protesters have spray-painted war memorials around Washington, D.C. But as of now, the Vietnam Veterans Memorial has not been vandalized.", "In an effort to show how nationwide Black Lives Matter demonstrations have gotten out of hand, some Facebook users are pointing to the scene of a crime — a 2016 crime, that is.", "A June 3 Facebook post claims that some people protesting the death of George Floyd, who died in Minneapolis police custody after a white officer kneeled on his neck, have vandalized a veterans memorial.", "\"If you stand for this you are the problem!!!\" the poster wrote in the caption.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "The photo is real — but it doesn’t show vandalism caused by recent Black Lives Matter protesters.", "In May 2016, vandals spray-painted graffiti on a Vietnam War memorial in Venice, Calif. The memorial was one of several around the country that was vandalized before Memorial Day that year.", "Images of the defaced mural in 2016 appear to match up with the image shared in the Facebook post. Los Angeles detectives identified four people behind the vandalism, which was not connected to a Black Lives Matter protest.", "Since Floyd’s death on May 25, demonstrations have erupted in more than 350 American cities. Protesters in Washington, D.C., have defaced some war monuments, including the World War II Memorial.", "In the wake of last night's demonstrations, there are numerous instances of vandalism to sites around the National Mall. For generations the Mall has been our nation’s premier civic gathering space for non-violent demonstrations, and we ask individuals to carry on that tradition. pic.twitter.com/LmIHfW2AHj", "But as of now, the Vietnam Veterans Memorial in Washington remains untouched.", "\"I have had no reports of it being vandalized,\" said Sgt. Eduardo Delgado, a public information officer for the National Park Service, in an email. \"I saw it this morning and it was fine.\"", "We could find no evidence that other Vietnam memorials have been vandalized as a result of Black Lives Matter demonstrations.", "The Facebook post is inaccurate. We rate it False.", "ABC 7, \"Vietnam War memorial in Venice reopens after restoration,\" May 29, 2017", "ABC 7, \"Volunteers fix vandalized Vietnam War memorial in Venice,\" May 29, 2016", "Al Jazeera, \"Mapping US cities where George Floyd protests have erupted,\" June 2, 2020", "Email from Sgt. Eduardo Delgado, a public information officer for the National Park Service, June 4, 2020", "Facebook post, June 3, 2020", "Los Angeles Times, \"Graffiti is scrubbed from veterans memorial in Venice, but more restoration work remains,\" May 30, 2016", "Los Angeles Times, \"Tagger known as ‘Liter’ arrested on suspicion of defacing Vietnam veterans memorial in Venice,\" July 14, 2016", "Military Times, \"Protesters damage Veterans Affairs headquarters, several DC war monuments,\" June 1, 2020", "TinEye, accessed June 3, 2020", "Tribune News Services, \"Veterans sites in California, Kentucky, Virginia damaged by vandals,\" May 28, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]