["About this rating", "On 29 January 2018, shortly after news broke that Andrew McCabe would be stepping down from his position as the deputy director of the Federal Bureau of Investigation, a photograph showing him walking down a hallway surrounded by armed guards appeared with the claim that it showed McCabe doing the \"walk of shame\" as he was escorted out of the building:", "The walk of shame.", "McCabe is escorted out by security after being forced out of the FBI. I'm sorry, but if McCabe has done half of what we think he has done he deserved every last big of embarrassment he felt leaving the FBI!!", "Sorry Andy, no going away party for you!!", "This image is real and does show McCabe, but it is also miscaptioned in what looks like a rather ham-handed attempt to make him appear guilty of something: It was not taken in January 2018, and it does not show McCabe being escorted out of the FBI building by security.", "The photograph was taken on 21 December 2017 by Getty Images photographer Chip Somodevilla. It shows McCabe making his way through the Rayburn House Office Building on his way to a meeting with various government committees to provide testimony about former FBI Director James Comey, the FBI's investigation on Russia interference in the 2016 election, and Hillary Clinton's use of a private email server:", "Federal Bureau of Investigation Deputy Director Andrew McCabe (C) is escorted by U.S. Capitol Police before a meeting with members of the Oversight and Government Reform and Judiciary committees in the Rayburn House Office Building December 21, 2017 in Washington, DC. McCabe testified before the House Intelligence Committee for ten hours on Tuesday.", "Andrew McCabe did leave the FBI in January 2018. This photograph, however, is unrelated to his departure.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]