["This photo released by the Suez Canal Authority on March 25, 2021, shows the Ever Given, a Panama-flagged cargo ship, after it become wedged across the Suez Canal and blocking traffic in the vital waterway. (Suez Canal Authority via AP)", "There is no evidence that an Evergreen ship stuck in the Suez Canal is linked to a human trafficking operation run by Hillary Clinton. That claim has been pushed by supporters of the baseless QAnon conspiracy theory.", "What do the Suez Canal, Hillary Clinton and a Taiwanese shipping company have in common?", "Conspiracy theorists on Facebook insist they’re all part of an international human trafficking scheme.", "Egyptian authorities are working to remove a 1,300-foot cargo ship that got stuck March 23 in the Suez Canal, a critical shipping route that connects the Red Sea to the Mediterranean Sea. The boat is operated by the Evergreen Group, a Taiwan shipping conglomerate.", "Some Facebook users took that as a signal of Clinton’s involvement.", "\"HRC = Hillary Rodham Clinton. Evergreen = Hillary’s Secret Service name. Evergreen Call Sign: H3RC,\" a March 24 post about the shipping accident says.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "Similar false claims about Clinton, \"evergreen\" and human trafficking surfaced after the Beirut port explosion in August. The newest example is similarly bogus and traces back to a baseless conspiracy theory that’s been circulating since 2016.", "First, let’s review some facts about Evergreen.", "Evergreen Line is the trade name for the five shipping companies owned by the Evergreen Group. The companies comprise the fourth largest container fleet in the world, according to the JOC Group, a logistics intelligence firm.", "An Evergreen ship got stuck in a bank of the Suez Canal during a dust storm with high winds, the Wall Street Journal reported. The incident involves an Ever Given ship, which is one of the largest ocean vessels in the world. More than 100 ships are waiting to traverse the canal, dealing a blow to global shipping.", "The story turns into fiction with the added elements of Clinton and human trafficking. The conspiracy theory goes like this: Clinton is part of a global child sex trafficking cabal, and her Secret Service codename was \"Evergreen.\" (She confirmed the codename during the 2016 campaign.) Therefore, Clinton is using Evergreen to transport children.", "That baseless line is related to the broader Pizzagate and QAnon conspiracy theories about prominent Democrats and child victims.", "After the Ever Given ship got stuck in the Suez Canal, QAnon supporters on Telegram and Gab, social media platforms that are popular among conservatives, pointed to the boat’s call sign, H3RC, as evidence to support their theory. Clinton’s initials are HRC.", "It’s unclear what cargo the Evergreen ship is carrying, but there’s no evidence that it’s people. We reached out to Evergreen through its website for a comment, but we haven’t heard back.", "The post is inaccurate, ridiculous and free of proof. We rate it Pants on Fire!", "Associated Press, \"Shipping losses mount from cargo vessel stuck in Suez Canal,\" March 25, 2021", "CBS, \"While Campaigning in Montana, Clinton Reveals Secret Service Codename,\" May 27, 2008", "Evergreen Line, \"What is Evergreen Line\"", "Facebook post, March 24, 2021", "JOC Group, EVERGREEN LINE", "Newsweek, \"QAnon Claims Stuck Suez Canal Ship Used by Hillary Clinton to Traffic Children,\" March 24, 2021", "PolitiFact, \"How Pizzagate went from fake news to a real problem for a D.C. business,\" Dec. 5, 2016", "PolitiFact, \"Pizzagate conspiracy theorists spread false claims about Beirut explosion, human trafficking,\" Aug. 7, 2020", "PolitiFact, \"What is QAnon, the baseless conspiracy spilling into US politics?\" Aug. 27, 2020", "Telegram, accessed March 25, 2021", "Vesseltracker.com, EVER GIVEN", "The Wall Street Journal, \"Suez Canal Backlog Grows as Efforts Resume to Free Trapped Ship,\" March 25, 2021", "The Wall Street Journal, \"Suez Canal Is Blocked by Container Ship Causing Huge Traffic Jam,\" March 24, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]