["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The photo in the article is a picture of a flathead catfish, native to the Mississippi River, that doesn’t grow to be more than 123 pounds.", "This photo was edited to make the catfish appear larger than it is.", "Giant Mekong catfish, which can grow up to 650 pounds, are native to the Mekong River in Southeast Asia and have never been seen in the United States.", "An Illinois man’s quest to salvage his grandfather’s reputation led him to catch a 736-pound catfish.", "That’s according to a four-year-old story that has gotten a lot of recent traffic on Facebook, despite its astonishing claim that this massive fish has been swimming in Mississippi waters for at least 114 years.", "\"Alton resident catches 736-pound catfish in Mississippi River,\" reads the headline on the story from Riverbender.com, which appears to share news and headlines from Alton, Ill.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "According to the story, 114 years passed between the time in 1902 when a man named \"Red Mudger...discovered the biggest catfish ever known to man\" and the day in 2016 when his grandson, Kato \"Mudcat\" Mudger, felt a tug at his fishing line that turned out to be a 170-year-old Mekong giant catfish — the same one his grandfather had seen in 1902.", "A couple things stand out about this claim:", "First, the article was published April 1, 2016, making it likely April Fools’ Day fodder.", "Second, a picture accompanying the story has been doctored. It shows the supposed 736-pound catfish lying on the ground. Next to it, a fisherman’s torso and legs can be seen, giving the viewer a sense of scale for the giant catfish.", "But the original fish photo was published in a Smithsonian article from Sept. 25, 2015, and credited to the U.S. Fish and Wildlife Service. The Smithsonian photo shows no sign of a human standing next to the fish and the caption under the picture identifies the fish as a flathead catfish, not a giant Mekong catfish, as the Riverbender story suggests.", "Flathead catfish are native to the Mississippi River, but they don’t grow heavier than 123 pounds or longer than 5 feet according to FishBase. Mekong catfish can grow to be 650 pounds, which is closer to 736 pounds, but they have never been seen outside of Southeast Asia’s Mekong River. They are endemic to the area and are also categorized as critically endangered.", "At PolitiFact, we’ve seen before that people get excited about seemingly giant fish, but we have to categorize this story as a tall (and heavy) tale. We rate this Pants on Fire!", "Riverbender.com, Alton resident catches 736-pound catfish in Mississippi River, April 1, 2016", "Smithsonian Insider, DNA solves puzzle of catfish dinners, Sept. 25, 2015", "FishBase, Pylodictis olivaris on FishBase, visited on Feb 11, 2020", "National Geographic, Mekong Giant Catfish, Explained, visited on Feb. 11, 2020", "National Geographic, Giant Mekong Catfish Babies Hard to Find on the Mekong, Sept. 4, 2018", "PolitiFact, No, anglerfish do not typically grow to be seven feet long, Jan. 24, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]