["A line of police move demonstrators away from St. John's Church across Lafayette Park from the White House June 1. (AP Photo/Alex Brandon)", "White House press secretary Kayleigh McEnany said federal police used neither tear gas nor rubber bullets to clear protesters from around a D.C. church where Trump was to visit.", "Federal police used pepper balls containing a chemical irritant that matches a federal definition of tear gas.", "Pepper balls are fired at about the same speed as rubber bullets and can cause similar or greater pain on impact.", "Federal officers’ use of force to clear the area around a church where President Donald Trump was due to visit June 1 has drawn the American public into the nuances of tear gas, rubber bullets and pepper balls.", "When a reporter asked White House Press Secretary Kayleigh McEnany if the administration had second thoughts about gassing and pummeling protestors, McEnany rejected the premise of the question.", "\"Let me first address, no tear gas was used and no rubber bullets were used,\" McEnany said June 3.", "\"Chemical agents were used,\" the reporter responded.", "\"Again, no tear gas was used and no rubber bullets were used,\" McEnany repeated.", "McEnany’s claim hinges on technical distinctions. But experts we reached said for someone on the receiving end of these crowd-dispersing agents, the differences might be hard to discern.", "The Centers for Disease Control and Prevention puts all manner of chemical crowd control agents into the same bucket.", "\"Riot control agents (sometimes referred to as ‘tear gas’) are chemical compounds that temporarily make people unable to function by causing irritation to the eyes, mouth, throat, lungs, and skin,\" the agency’s website says.", "The U.S. Park Police said in a statement that officers \"employed the use of smoke canisters and pepper balls.\"", "Multiple eyewitnesses and news accounts reported noxious fumes that caused protesters’ eyes and throats to burn. As federal officers fired on the crowd near the church, protesters cried out that tear gas was being used. There were calls to put on masks.", "Tear gas just deployed at 16th & H Streets, police in riot gear & on horseback pushed the crowd back to Connecticut Av #dcprotest pic.twitter.com/LOd2UC5nmH", "The U.S. Park Police press office told PolitiFact that officers used products made by the PepperBall company, which contain the chemical irritant pelargonic acid vanillylamide, or PAVA.", "\"PAVA primarily affects the eyes causing closure and severe pain,\" according to a report by Britain's Committee on Toxicity, an independent scientific body that advises the government.", "PAVA closely matches the CDC’s description of tear gas.", "McEnany emphasized that rubber bullets were not used. Pepper balls cause pain on impact all the same, experts said.", "Rubber bullets and pepper balls come in a variety of shapes and sizes, but the general difference is that rubber bullets are designed to cause pain, while pepper balls cause both pain on impact and the discomfort of a chemical irritant payload. Rubber bullets weigh much more than pepper balls, but with muzzle speeds of over 300 feet per second, both projectiles hurt on impact. (The actual impact speed depends on the distance between shooter and shootee.)", "Few, if any, academic researchers would be able to compare the two as well as Ed Maguire.", "Maguire, a professor at Arizona State University, studies crowd control. In the course of his field work, he’s been hit by both a pepper ball and a rubber bullet.", "In 2017, he and four graduate students were caught up in a clash between pro-Trump and anti-Trump groups in Phoenix. When police moved in, a pepper ball hit Maguire about half an inch above his right eye.", "\"I thought I had been stuck by the corner of a brick,\" Maguire said. \"I was delirious in the first couple of seconds. And I couldn't feel the top of my head, my scalp, for about a month.\"", "The next morning, Mcguire discovered a rubber bullet had hit him in the stomach, leaving a large, telltale bruise. He hadn’t felt it the night before.", "\"In terms of the level of pain, I think I was hit by both at about the same time,\" Maguire said. \"The pepper ball won the contest.\"", "Maguire said police use rubber bullets and pepper balls interchangeably, according to local preference.", "\"There’s no fundamental strategic reason to choose one over the other,\" Maguire said. \"They are both impact munitions.\"", "An early government sponsored study put rubber bullets and pepper balls in the same category of non-lethal impact munitions.", "One intrepid rock-and-roll DJ in Lubbock, Texas, put himself on the business end of a pepper ball pistol. When the round hit him in the chest at very close range, he instantly dropped to the ground. (Watch it if you like.)", "McEnany said that neither tear gas nor rubber bullets were used in removing a group of people from the area around a church in Washington.", "Tear gas, according to the CDC, includes a broad range of chemical agents, and the one used by federal police falls under the government’s description of teargas.", "Rubber bullets are different from the pepper balls fired by federal police, but both are fired at similar speeds, both can cause extreme pain, and both are characterized as impact munitions.", "McEnany makes much of the differences in the delivery systems, but the practical effects are similar.", "We rate her claim Mostly False.", "Bloomberg, White House press briefing, June 3, 2020", "Statement, U.S. Park Police, June 4, 2020", "PepperBall, LIVE, accessed June 4, 2020", "Centers for Disease Control and Prevention, Facts About Riot Control Agents Interim document, April 4, 2018", "U.S. Park Police, Statement from United States Park Police acting Chief Gregory T. Monahan about the actions taken over the weekend to protect life and property, June 2, 2020", "U.S. Defense Department Non-Lethal Weapons Program, U.S. Coast Guard Pepperball Launcher Systems, accessed Jun 3, 2020", "KFMX, Lubbock D.J. Takes Pepperball To The Chest, Oct. 4, 2010", "PBS Arizona, ASU professor hit by pepper balls at Trump rally protests, Aug. 23, 2017", "NPR, Trump Says He'll Deploy Military To States If They Don't Stop Violent Protests, June 1, 2020", "Dallas Morning News, Cruz and Cornyn stand by Trump on pepper balls and church photo op, as Texas Democrats slam dictator-like tactics, June 2, 2020", "WTOP, 4th day of DC protests saw marchers hit with smoke, rubber bullets, June 2, 2020", "Ken Duffy- WTOP News, tweet, June 1, 2020", "Alejandro Alvarez, tweet, June 1, 2020", "U.S. Criminal Justice Research Service, Impact Munitions Data Base of Use and Effects, February 2004", "Committee on Toxicity, Statement on combined exposure to 2-chlorobenzylidene malonitrile (CS) and PAVA (nonivamide) sprays, January 2006", "Kaiser Health News, Police Using Rubber Bullets On Protesters That Can Kill, Blind Or Maim For Life, June 2, 2020", "Boston Police, Commission investigating the death of Victoria Snelgrove, May 25, 2005", "SDI, Blunt Impact Projectile, accessed June 3, 2020", "U.S. District Court Northern District of California, United Tactical Systems v. Real Action Paintball, Dec. 2, 2014", "Poynter, There are many types of ‘tear gas.’ Here’s how to tell the difference, June 4, 2020", "Email exchange, David A. Koplow, professor of law, Georgetown University Law Center, June 3, 2020", "Interview, Ed Maguire, professor , School of Criminology and Criminal Justice, Arizona State University, June 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]