["British poet, playwright and actor William Shakespeare is regarded as one of the greatest writers in the English language.", "Shakespeare lived from 1564 to 1616 and wrote at least 37 plays, according to the  British Library. Hamlet, Othello, King Lear and Macbeth are among the more famous.", "Social media users and bloggers often publish wallpapers and text of  quotes by Shakespeare to keep their audiences interested. But not all the quotes are real.", "A Facebook page with close to 9 million followers posted a  meme with a quote on how to achieve happiness, attributed to Shakespeare. The meme and similar  versions of it  have been widelyshared by Facebook users in Nigeria, South Africa and Kenya.", "The quote reads: “I always feel happy, you know why? Because I don’t expect anything from anyone. Expectations always hurt. Life is short, so love your life, be happy. And keep smiling. Just live for yourself and before you speak, listen. Before you write, think. Before you spend, earn. Before you pray, forgive. Before you hurt, feel. Before you quit, try. Before you die, live.”", "Africa Check contacted the Folger Shakespeare Library, which has the world's largest collection of materials relating to the writer and his works from the 16th century on.", "Rachel Dankert, the library’s learning and engagement librarian, told us no such quote by Shakespeare exists at the library, and it is not by him.", "“That is definitely not Shakespeare,” she said. “The cadence, language, are all wrong and no phrases from the larger quote appears in Shakespeare.”", "The Shakespeare Birthplace Trust agreed. It’s an independent charity that cares for Shakespeare heritage sites and promotes the understanding of his works, life and times across the world.", "“This quote is not a Shakespeare quote and has been wrongly attributed,” the organisation’s reader services team told Africa Check. “It is not in early modern English.”", "The last part of the quote seems to have been lifted from the poem Before You by William Arthur Ward, a 20th century writer of inspirational proverbs.", "He wrote more than 100 articles, poems and meditations published in magazines such as Reader's Digest, Science of Mind and various Christian publications.", "Please complete this form to receive the HTML sharing code.", "A fact-checker has rated your Facebook or Instagram post as “false”, “altered”, “partly false” or “missing context”. This could have serious consequences. What do you do?", "Click on our guide for the steps you should follow.", "Africa Check is a partner in\nMeta's third-party fact-checking programme\nto help stop the spread of false information on social media.", "The content we rate as “false” will be downgraded on Facebook and Instagram. This means fewer people will see it.", "You can also help identify false information on Facebook. This\nguide explains how.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]