["The five-minute video was published here on August 9, 2020 in a public Facebook group with more than 72,000 members.", "The post’s caption reads: “Friends! Hold your breath! Here's a rare Video of Flight Crash in Calicut Airport on 7th August evening, of Air India Express DXB CCJ 07. Please watch. Stay Safe.”", "The video was also shared here, here and here on Facebook, alongside a similar claim.", "However, the claim is false.", "A reverse image search of keyframes extracted from the clip found an identical video published here on the YouTube channel of MPC Flight Recreations on August 7, 2020.", "The video is titled: “Air India Express flight 1344 crash video - (P3D).”", "“P3D” refers to the open simulation platform Prepar3D.", "The clip was published one day after the plane crash at Kozhikode Calicut Internation Airport in southern India.", "At least 18 people died in the crash after the plane overshot a runway in a storm and plunged down a bank, as reported by AFP here on August 9, 2020.", "The YouTube channel, MPC Flight Recreations, has posted five other simulation videos of plane crashes in the last six months.", "Below is a screenshot comparison of the video in the misleading post (L) and the simulation video on YouTube (R):", "The misleading post was also debunked here by Indian fact-checking website BOOM on August 9, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]