["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Chuck Todd sharply questions Donald Trump about why he will not apologize for his \"blood\" comments toward Fox host Megyn Kelly on the Aug. 9 episode of \"Meet the Press.\" (Screenshot)", "Donald Trump maintained several times on the Sunday shows that he would not apologize for \"totally appropriate\" — yet widely criticized — comments about Fox News host Megyn Kelly, who questioned him during the first GOP presidential debate about the way he’s talked about women over the years.", "\"You’ve called women you don’t like ‘fat pigs,’ ‘dogs,’ ‘slobs,’ and ‘disgusting animals,’ \" Kelly said.", "Trump cut her off with his index finger in the air, quipping it was \"only Rosie O’Donnell.\" When the crowd’s roar settled, Kelly continued.", "\"Your Twitter account has several disparaging comments about women’s looks. You once told a contestant on The Celebrity Apprentice it would be a ‘pretty picture’ to see her on her knees. Does that sound to you like the temperament of a man we should elect as president? And how will you answer the charge from Hillary Clinton, who was likely to be the Democratic nominee, that you are part of the 'war on women'?\"", "Trump, who owned up only to insulting comedian Rosie O’Donnell, disparaged Kelly after the debate — saying that she \"behaved very badly,\" that \"she had blood coming out of her eyes, blood coming out of her wherever,\" and sharing a Twitter post that referred to her as a \"bimbo\" — only inflaming debate about whether he is a misogynistic threat to the GOP.", "NBC host Chuck Todd tried to get Trump to understand why his comments are perceived as sexist, bringing up New York Times columnist Gail Collins and singer Bette Midler as two more examples of times he went after a woman’s \"looks.\"", "\"Well, some of the things that she said, I didn't say, okay?\" Trump said of Kelly. \"And she went through a whole list. And this is a hell of a first question, by the way. But I will say this, I was attacked by the people that you talk about.\"", "We decided to fact-check whether Kelly said things that Trump didn’t say and look at the context of some of his other arguments with high-profile women.", "A spokesperson for Trump’s campaign could not be reached for comment.", "‘Fat pig,’ ‘slob’ and ‘animal’", "Kelly said Trump had referred to women as \"fat pigs\" and \"slobs.\"", "As he admitted during the debate, Trump has leveled both invectives at O’Donnell, the comedian and former panelist on The View.", "He rattled off the first in a Dec. 29, 2006, interview with Fox News while imagining how O’Donnell’s ex-wife Kelli might have explained the couple’s relationship to her parents.", "\"Can you imagine the parents of Kelli ... when she said, 'Mom, Dad, I just fell in love with a big, fat pig named Rosie?’ \" he said.", "Trump also referred to O’Donnell as an \"animal\" and a \"slob\" in 2006.", "So the insults clearly happened, apparently spurred by comments O’Donnell made on the Dec. 20, 2006, episode of The View. After Trump announced he would not fire a Miss USA winner who had been accused of drug use, underage drinking and \"sexual indiscretions,\" O’Donnell criticized Trump’s personal and professional dealings, pointing out that a few of Trump’s companies had gone bankrupt in the past and calling him a \"snake-oil salesman.\"", "O’Donnell also lamented Trump’s appearance as the \"moral authority\" in the scandal, pointing to his two divorces as evidence that he should not be considered \"a model for the nation’s 20-year-olds.\"", "‘Dogs’", "Kelly said Trump called women \"dogs.\"", "One incident, as Todd brought up, refers to an insult he allegedly directed at Gail Collins, a liberal op-ed columnist for the New York Times who had interviewed Trump during his early years as a developer. In a 2011 Times column, Collins wrote, \"He is extremely sensitive to any gibes about his business record, which has been up and down over the years. During one down period, I referred to him in print as a ‘financially embattled thousandaire,’ and he sent me a copy of the column with my picture circled and ‘The Face of a Dog!’ written over it.\"", "We could not independently verify Collins’ claim, or dig up her original story from a \"down period\" for Trump.", "But Trump directed similar language at Arianna Huffington on Twitter in April.", "‘Disgusting’", "Kelly also referenced Trump’s treatment of a lawyer during a lawsuit involving one of his Florida developments.", "In a 2011 lawsuit, Elizabeth Beck, a lawyer representing Trump’s opponents, asked for a medical break, saying she had to pump breast milk for her 3-month-old daughter. But Trump objected, calling Beck \"disgusting\" when she took out the pump. Trump left the deposition, halting the day’s proceedings.", "Trump once traded barbs with the singer and actress Bette Midler, as Todd pointed out on Meet the Press. In 2012, Midler tweeted about Trump: \"The man who has ruined New York seeks to ruin the nation.\" Midler deleted the tweet, but later referred to him as \"stupid\" and called his hairstyle a \"terrible dye job someone talked him into.\"", "Trump replied by calling Midler \"disgusting,\" as well as \"grotesque,\" \"ugly,\" and a bad singer.", "We could not find documentation of an exact time he said \"disgusting animal,\" but he has certainly used both words.", "The Celebrity Apprentice", "Another remark came in 2013 during an episode of Trump’s reality show, The Celebrity Apprentice. During a judging session with Trump, former rocker Bret Michaels described a female contestant, Playboy playmate Brande Roderick, as \"falling to her knees\" and begging not to be fired.", "\"Excuse me,\" Trump said. \"You dropped to your knees?\"", "\"Yes,\" Roderick said.", "\"It must be a pretty picture, you dropping to your knees,\" Trump said.", "Our ruling", "Trump said that \"he didn’t say\" some of the things about women that Kelly talked about.", "The record, however, shows the opposite is true. He has said exactly what Kelly mentioned in the debate.", "We rate Trump’s statement False.", "https://www.sharethefacts.co/share/9520c998-b1af-4223-a6b2-7acb3ccbb9c9", "Republican Presidential Primary Debate, Aug. 6, 2015", "Meet the Press, Aug. 9, 2015", "CNN Tonight with Don Lemon, Aug. 7, 2015", "The View, \"December 20, 2006\"", "FoxNews.com, \"Trump Decides Not To Fire Miss USA Tara Conner,\" Dec. 19, 2006", "FoxNews.com, \"Rosie O'Donnell Calls Donald Trump 'Pimp' on Her Blog; Trump Fires Back That O'Donnell Is 'Big, Fat Pig',\" Dec. 29, 2006", "Gothamist, \"Rosie O'Donnell and Donald Trump's Fight Gets Personal,\" Dec. 21, 2006", "New York Times, \"Under Oath, Donald Trump Shows His Raw Side,\" Jul. 28, 2015", "New York Times, \"Donald Trump Gets Weirder,\" April 1, 2011", "Newsbusters, \"Donald Trump In Twitter War With Bette Midler: 'She's Disgusting' and 'Grotesque',\" Oct. 28, 2012", "Donald Trump, tweet from April 6, 2015", "Email interview with Kathleen Kendall, professor of communications at the University of Maryland, Aug. 9, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]