["About this rating", "After the August 3, 2019, mass shooting at a mall in El Paso, Texas, that left twenty people dead and dozens more injured, news accounts reported that a suspect arrested for crime had posted a four-page \"manifesto\" online shortly beforehand in which he expressed \"an intense hatred for immigrants and Mexicans\":", "The writings from the suspected shooter said the attack was in response to a \"Hispanic invasion\" of Texas, warning that the population will make Texas and other states a \"Democrat stronghold\" that will allow the party to win future presidential elections.", "\"They are the instigators, not me. I am simply defending my country from cultural and ethnic replacement brought on by an invasion,\" the document said.", "The suspected shooter also wrote that immigration can only be detrimental to the future of the United States and \"make one of the biggest issues of our time, automation, so much worse.\"", "\"It makes no sense to keep on letting millions of illegal or legal immigrants flood into the United States, and to keep the tens of millions that are already here,\" the manifesto said. \"Invaders who also have close to the highest birthrate of all ethnicities in America.\"", "By the following day, a rumor was afloat in social media that President Trump's \"team\" had begun deleting tweets in which Trump, like the shooting suspect, had referred to immigrants as \"invaders\":", "In light of El Paso and Dayton and the focus on white nationalist rhetoric, Trump's team has appeared to delete tweets where he used \"invaders\" to describe immigrants. This is a violation of the The Presidential Records Act of 1978 (44 USC §§ 2201–2207). #daytonshooter pic.twitter.com/OP8QgHUq2k", "— Amee Vanderpool (@girlsreallyrule) August 4, 2019", "However, at the time that rumor was posted, the three tweets it referenced as examples (one of which had nothing to do with immigrants) were still openly accessible in Trump's Twitter feed (and remained so at the time of this writing):", "We cannot allow all of these people to invade our Country. When somebody comes in, we must immediately, with no Judges or Court Cases, bring them back from where they came. Our system is a mockery to good immigration policy and Law and Order. Most children come without parents...", "— Donald J. Trump (@realDonaldTrump) June 24, 2018", "Headline: “Kim Prepared to Cede Nuclear Weapons if U.S. Pledges Not to Invade” - from the Failing New York Times. Also, will shut down Nuclear Test Site in May.", "— Donald J. Trump (@realDonaldTrump) April 30, 2018", "...travesty that is taking place in allowing millions of people to easily meander through their country and INVADE the U.S., not to mention the Drugs & Human Trafficking pouring in through Mexico. Are the Drug Lords, Cartels & Coyotes really running Mexico? We will soon find out!", "— Donald J. Trump (@realDonaldTrump) June 1, 2019", "The same account that promulgated the rumor later acknowledged that the supposedly \"deleted\" tweets were in fact still posted, but then contended President Trump had deleted two other tweets:", "UPDATE: The tweets about foreigners invading attached above are still posted. Trump HAS deleted the tweets shown below (see: https://t.co/RQPFu1XvRs and https://t.co/XHWlKAc377) to allegedly clear the negative comments attached to them.This is STILL a violation of the PRE. pic.twitter.com/4fZmeHQ47P", "— Amee Vanderpool (@girlsreallyrule) August 5, 2019", "However, those two other deleted tweets were ones in which President Trump had condemned the El Paso shooter (not immigrants), and which he had reposted later the same day:", "Today’s shooting in El Paso, Texas, was not only tragic, it was an act of cowardice. I know that I stand with everyone in this Country to condemn today’s hateful act. There are no reasons or excuses that will ever justify killing innocent people....", "— Donald J. Trump (@realDonaldTrump) August 4, 2019", "....Melania and I send our heartfelt thoughts and prayers to the great people of Texas.", "— Donald J. Trump (@realDonaldTrump) August 4, 2019", "Sacks, Brianna and Adolfo Flores.   \"The Suspected El Paso Terrorist Said He Was Motivated by a Hatred of Immigrants.\"\r\n    BuzzFeed News.   4 August 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]