["About this rating", "Evelyn Nesbit, the former actress and model, was featured in an online advertisement that promised: \"Historical Wild West photos - Discretion Advised.\" The ad was placed by a website named Bon Voyaged, and was likely years old. It was spotted as recently as November 2020.", "As we've noted in debunked stories about Alex Trebek's net worth and a dangerous vacation spot in California, internet advertisements that lead to slideshow lists aren't exactly credible sources of information.", "Bon Voyaged used the Outbrain advertising platform to place the advertisement, and the resulting landing page from 2016 was on the Bon Voyaged website. Once readers landed on Bon Voyaged, they were encouraged to click 80 times through a slideshow to see \"Amazing Wild West Photos\" — none of which featured Florence Evelyn Nesbit, which was her full name.", "Nesbit lived from 1884 (or 1885) to 1967. Her birth year is unclear, as spelled out in the book \"American Eve: Evelyn Nesbit, Stanford White, the Birth of the 'It' Girl, and the Crime of the Century\" by Paula Uruburu, a professor of English and film studies at Hofstra University. Nesbit lived the early years of her life in Pennsylvania, including in Natrona, Pittsburgh, and Philadelphia, cities that were not part of the so-called Wild West.", "Uruburu wrote that Nesbit was photographed in Philadelphia around the age of 14 or 15, which set off a firestorm of interest in her physical appearance:", "Not long after the suggestion was made, Ryland Phillips, a Philadelphia photographer who had heard from John Storm about the fetching fifteen-year-old, arranged for her to sit for some photographic studies. Or rather stand. Throughout the session, Phillips had Florence Evelyn lean casually against a wall, clad in a floor-length milky white satin gown, with her hair falling softly to one side. Unlike the painters, who preferred her without makeup, however, the photographer put some eye makeup and lipstick on Evelyn, subtle touches that nonetheless gave her a startlingly more mature appearance. Phillips was extraordinarily pleased by the pictures in which, he said, she resembled \"a young Aphrodite.\" He managed to have them printed in an art magazine, where they attracted a good deal of attention; they were then reproduced in the Philadelphia newspapers (and once again a year or two later in \"Broadway Magazine\").", "Nesbit then moved to New York City, where she became an \"overnight success.\"", "In 1901, she posed for the picture that, more than a century later, was used in the 2020 internet advertisement from Bon Voyaged:", "https://www.pinterest.co.uk/pin/478789004128441368/", "It appeared to be a photograph from Otto Sarony's studio. Uruburu noted that Sarony's work was mostly theatrical subjects. Some of his studio's photographs are still available today on eBay. This cabinet card appeared to show another photograph taken during the same session.", "In author Jim Alessio's book, \"The Eternal Flapper: The Many Lives of Edna Wallace Hopper,\" he wrote that Otto Sarony and his father, Napoleon Sarony, \"mass-marketed\" their images, and unaccredited photographers actually shot the photographs.", "Sarony Studio dominated the theatrical portraiture market during the last half of the 19th century, remained a power in theater publicity circles until the mid-1920s, and a viable brand as a portrait studio until late in the 20th century. [Napoleon] proved to be the most enterprising celebrity photographer of the post-Civil War era. His studio on Fifth Avenue, a famously extravagant temple of odd props, old art, and stuffed exotic wildlife, hosted sittings with the important personages of the era.", "Nesbit's life was marked by a love triangle, murder, and the \"trial of the century.\" Uruburu was asked by PBS's \"American Experience\" why people are still so fascinated with Nesbit's story. She answered: \"It has all the elements — sex and violence, love and betrayal, a teen-aged girl involved with a married man, an insanely jealous husband driven to murder. Moreover, it involves a supremely beautiful girl who was an icon of her age, the fall of the rich and powerful, the cult of celebrity that is now so familiar, but which at the time was brand new.\"", "In the early 20th century, Nesbit's image had been used in advertising campaigns to draw in revenue, including for a lumber company. Uruburu wrote in her book:", "\"Florence Evelyn was dubbed the 'modern Helen' by one columnist, and her evocative and soon familiar face launched any number of advertising campaigns as canny entrepreneurs began to capitalize on her uncanny ability to appeal to both sexes and appear chaste and alluring at the same time.\"", "More than 100 years later, advertisers still appeared to be using Nesbit's image for revenue.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Uruburu, Paula. \"American Eve: Evelyn Nesbit, Stanford White, the Birth of the 'It' Girl, and the Crime of the Century.\"\r\n    Riverhead Books. 2008.", "Alessio, Jim. \"The Eternal Flapper.\"\r\n    AuthorHouse. 2009.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]