["A video is widely circulating on Facebook with the claim that a rally where pro-Islam chants were raised was taken out in West Bengal’s Kolkata. “This rally was taken out today in Kolkata under Mamata’s rule. Tomorrow it will be taken out across the country and you will remember Modi.” (ममता की छांव में आज ये रेली कलकत्ता में निकली है । कल पुरे देश में निकलेंगी तब सिर्फ मोदी याद आयेंगा।) – reads the caption. The video is circulating on both Facebook and Twitter.", "The same video was also circulating in September 2020 with a similar caption – “This isn’t a scene from Kashmir or Kerala but Mamata Bano’s Kolkata, West Bengal. Look at this before you curse Modi.”", "यह दृश्य कश्मीर या केरल की नहीं है। यह आपके ममता दीदी के राज्य पश्चिम बंगाल कि राजधानी कलकत्ता की है।जहां इस्लाम जिंदाबाद के नारे लग रहे है।", "जागो हिन्दू जागो।", "Posted by संजय उवाच on Sunday, 6 September 2020", "It was widespread on Facebook, same as now.", "Pakistani-Canadian writer Tarek Fatah had tweeted the clip in August 2020. He later took down his tweet but an archived link can be accessed here. Fatah has shared false information on several occasions over the years.", "A user named Md. Sujon Rana posted the video on August 21, 2020 on Facebook with a Bengali caption that read, “Islam is the religion of the state!” God willing, it will remain Islamic. This wish of atheists will never be fulfilled. If you do not like that Islam is the state religion, then leave Bengal! The state religion was, is and will remain Islam. Inshallah!”", "[Translated from: “রাষ্ট্র ধর্ম ইসলাম আছে! ইসলামী থাকবে ইনশাআল্লাহ. নাস্তিকদের মনের আশা কোনদিন পূরণ হবে না “রাষ্ট্র ধর্ম ইসলাম ভালো না লাগলে! বাংলা ছেড়ে চলে যাও. রাষ্ট্রধর্ম ইসলাম ছিল, আছে, থাকবে ইনশাআল্লাহ.”]", "রাষ্ট্র ধর্ম ইসলাম আছে! ইসলামী থাকবে ইনশাআল্লাহ।", "নাস্তিকদের মনের আশা কোনদিন পূরণ হবে না ❌", "“রাষ্ট্র ধর্ম ইসলাম ভালো না লাগলে! বাংলা ছেড়ে চলে যাও। রাষ্ট্রধর্ম ইসলাম ছিল, আছে, থাকবে _______ইনশাআল্লাহ______ ✅✅✅", "Posted by Md Sujon Rana on Friday, 21 August 2020", "In a brief moment in the video, one of the protestors can be seen holding the flag of Bangladesh.", "Apart from this, many of the protestors are seen carrying placards and signs. One of these placards says ‘Islami shasantantra chhatra andolan’. This is the name of a student outfit of a Bangladeshi political party called Islami Andolon Bangladesh.", "When we did a keyword search on YouTube based on this information, we found the same video uploaded on September 13, 2017. The video is titled, “Bangladesh Islami Andolon Bangladesh enclose myanmar Embassy” and was uploaded by a channel called Spice InfoTube.", "Another YouTube channel called The Rohingya Post had uploaded a similar video on September 13, 2017. Its description reads, “Thousands of Islami Andolon Bangladesh marched towards the Myanmar Embassy in Dhaka demanding an end to the atrocities on Rohingya Muslims in Myanmar’s Rakhine state. As per the previous declaration, thousands of supporters of the Islamist party started their protest march in front of Baitul Mukarram National Mosque around 12.30 PM on Wednesday. Police barred the protesters at Kakrail Mor but the agitating party men managed to shatter the barricade and continued marching forward until they encountered another police barricade at Shantinagar intersection.”", "On September 13, 2017, The Financial Express reported, “Thousands of people in capital Dhaka have rallied in protests against the violence like killings and arsons against Rohingya Muslims in the northern Rakhine state of Myanmar.” Apart from this, Bangladesh news website Bangla News 24 had also published a report about this demonstration.", "Therefore, a three-year-old video from Bangladesh was shared online with the false claim that it was from West Bengal. Kolkata police had shared a screenshot of Tarek Fatah’s tweet clarifying that it was fake news. They also mentioned that they are taking the necessary legal action on the matter. A few hours after this tweet, Fatah issued a tweet apologising for sharing misleading information.", "#FakeNewsAlert A video clip from Bangladesh is being falsely claimed to be from Kolkata. Legal action initiated. pic.twitter.com/v5MYLICKiI", "— Kolkata Police (@KolkataPolice) August 28, 2020", "Two months later, West Bengal police tweeted that the incident took place in Bangladesh. This was after the video was again revived.", "This video of Bangladesh is being circulated as of West Bengal on WhatsApp. Legal action is being initiated. Efforts for finding out the culprit is going on.", "Please do not forward the fake video and the mischievous message#FakeNewsAlert pic.twitter.com/4nCfbBHLcD", "— West Bengal Police (@WBPolice) October 31, 2020", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]