["“Did anyone realize Hillary Clinton is on trial for Bengazi this week or does the media have you blinded by riots?!?!?!” reads a June 3, 2020 Facebook post, referring to protests that spread nationwide after the death of George Floyd at the hands of a police officer, some of which devolved into looting and vandalism.", "Similar posts are available on Facebook here and here and on Twitter here and here.", "“She is not on trial,” Clinton’s spokesman, Nick Merrill, told AFP in an email.", "In September 2014, Judicial Watch, a conservative foundation, sued the State Department to compel compliance with a Freedom of Information Act request seeking “any and all records concerning, regarding, or related to notes, updates, or reports created in response to the September 11, 2012 attack on the U.S. Consulate in Benghazi, Libya.”", "The information sought has expanded since the lawsuit was filed, and on March 2, 2020, US District Judge Royce Lamberth granted Judicial Watch’s request to depose Clinton “on matters concerning her reasons for using a private server and her understanding of State’s records management obligations.”", "The arguments heard Tuesday, June 2 at the US Court of Appeals for the DC Circuit were a petition to remove that order, according to Clinton’s attorney, David Kendall, and Merrill.", "Kendall said in an email: “She was not even a party to the... case until last fall, when she intervened to be heard on the issue (of) whether her deposition should be taken. It’s just a Freedom of Information Act case.”", "The only issue at hand is whether Judicial Watch received all the documents it is entitled to from the US Department of State -- not Clinton herself -- Kendall said.", "The full audio recording of the June 2 arguments is available here.", "The US Court of Appeals for the DC Circuit in August granted Clinton’s petition to prevent the deposition.", "A September 6 Facebook post claimed Clinton was scheduled to go to court again on September 9.", "“HILLARY CLINTON GOING TO COURT ON 9/9/2020 (AGAIN),” the post reads in part.", "This is false; Kendall told AFP in an email that he had “no idea what this claim is referring to.”", "“There were no legal proceedings of any kind involving former Secretary Clinton on September 9, 2020.”", "Four Americans died in the 2012 Benghazi attack.", "The US House of Representatives Benghazi Select Committee and Department of State inspector general’s office completed publicly available investigations into the State Department’s handling of the attack.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]