["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On the campaign trail, Portland mayoral candidate and former city commissioner Charlie Hales has been speaking up about what he’s done for schools -- but one of the claims has perplexed Portland teachers.\n\nIn a campaign ad this month, a woman shows her support for Hales: \"And when state budget cuts threatened four weeks of school, Charlie helped restore them, for every public school in Portland.\" That statement is repeated in The Oregonian’s Voter Guide, too.\n\nIn a schools-related online post March 27, his campaign website has more details on how Hales saved the day: \"He helped negotiate the city paying one time for two weeks of school, and the local teachers to work two weeks without pay.\"\n\nThe statement about negotiating with teachers is repeated in a March 28 KATU questionnaire posted online:\n\n\"I’m very proud that as a Portland City Commissioner, I worked with our Mayor and other commissioners to help save the school year when a budget crisis in Salem threatened to cut four weeks of the school year. I worked with our Mayor and school leaders to find emergency funds for half those days while negotiating with our local teachers to work half the days for free.\"\n\nPolitiFact Oregon gives an abundance of evidence so you know this isn’t a one-time claim by Hales, who faces chief rivals Eileen Brady and Jefferson Smith in the May 15 election. You should also know that Portland teachers’ union leaders say there’s been just one time in history when they worked for free -- and that was in 2003, when Hales was no longer on council. It was a huge deal.\n\n\"That would be erroneous,\" said Ann Nice, former president of the Portland Association of Teachers, of Hales’ claim. \"That was February 2003. It’s etched in my mind forever. I had to stand up to explain to 5,000 people why they should work for free.\"\n\nHales left the council in June 2002 to take a job in the private sector.\n\nIn January 2003, voters defeated a temporary statewide income tax increase and Portland Public Schools planned to cut 24 days of school. Before February was over, the county, city, teachers’ union and district had agreed to a contract that preserved those days.\n\nTeachers agreed to work 10 days of the 2002-03 school year without compensation, according to a tentative agreement signed Feb. 25, 2003. Mayor Vera Katz agreed to find money to pay for the remaining school days, and the city and county agreed to develop a longer-term funding package.\n\nNice recalls meeting on the issue with Commissioner Randy Leonard -- Hales’ successor on council -- and with then-Commissioner Erik Sten. Rounding out talks were Commissioners Jim Francesconi and Dan Saltzman, and of course, Katz.\n\nContacted by PolitiFact Oregon, Hales immediately owned up to the misstatement on Friday. He said he would issue a correction and pull the television ad from circulation.\n\n\"I apologize for not being accurate,\" he said. \"It appears that what happened is I merged in my mind the whole series of times when I voted in office to help schools with another later time when I was advocating for schools but out of office.\"\n\nWe know what you’re thinking. How could Hales forget where he was? Right?\n\nIn his defense, he and his campaign listed a number of votes he took in his decade on the City Council. We researched our in-house library and discovered that Portland Public Schools consistently needed help from the City Council -- which included Hales -- during the 1990s. For example, in 1999 the Oregon Legislature passed a budget that left Portland schools short $14 million.\n\nNice, the former union leader, attests to Hales’ support while on council.\n\n\"There were times when he was helpful with schools things and other times I know where the city helped the school district out, and he was helpful in those scenarios, but he wasn’t on City Council\" when teachers agreed to work two weeks without pay, Nice said.\n\nHales owned up to the inaccuracy of his statement. We give him and the campaign credit for being so quick to correct the record. But the statement is still flat wrong. We rule the statement False.", "Return to OregonLive to comment on this ruling.", "Emails from Jessica Moskovitz, Hales campaign manager, April 27, 2012\nCharlie Hales for Mayor, \"Quality Schools for Our Children,\" March 27, 2012\nCharlie Hales for Mayor, \"About Charlie\"\nKATU/Willamette Week, \"Mayoral Debate Club: Part 3,\" April 22, 2012\nKATU questionnaire, \"Portland Mayoral Candidate Charlie Hales,\" March 28, 2012\nInterview with Ann Nice, former President, Portland Association of Teachers, April 27, 2012\nInterview with Gwen Sullivan, President, Portland Association of Teachers, April 27, 2012  \nFrom Portland Association of Teachers, \"Tentative agreement between PAT and Portland Public Schools,\" Feb. 25, 2003\nThe Oregonian, \"Council agrees to raise fees to support Portland schools,\" March 13, 2003\nThe Oregonian, \"Q&A Portland schools spared shake-up,\" March 2, 2003\nThe Oregonian, \"Schools future still uncertain,\" Feb. 27, 2003\nThe Oregonian, \"It’s like 1996 all over again, minus the sandbags,\" Feb. 25, 2003\nThe Oregonian, \"Politicians find cash for schools plus dispute,\" Aug. 6, 1999", "The Oregonian, \"School budget math comes up $14 million short,\" July 28, 1999", "The Oregonian, \"$3.2 million goes to schools,\" Aug. 26, 1997", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]