["On October 25, Dainik Bhaskar reported an alleged case of human smuggling where a 20-year-old woman from Jharkhand, Sunita Toppo, was sold to a family in Delhi under false pretences of a job. She was the third such victim from Ranchi’s Mandar, per Dainik Bhaskar.", "In its subsequent reportage (1, 2, 3), the Hindi media outlet raised speculations of Sunita being held hostage at the residence of CBI chief Alok Verma.", "As it turned out, Dainik Bhaskar’s reportage was premature. Investigations were underway and Sunita was yet to give her statement on the identity of her alleged perpetrators. Dainik Bhaskar carried out several reports based on mere speculations because the man involved in the case bore the same name as the CBI chief Alok Verma. Alt News confirmed with the Delhi police that Verma had no links whatsoever with this case.", "Here is how Dainik Bhaskar misreported the incident and gave it a fictitious angle.", "According to a report published by Dainik Bhaskar on October 25, a woman named Nisha Devi from Jharkhand’s Tangar Basli sold Sunita to a placement agency in Delhi, run by duo Yamuna and Ashok. Sunita was made to work for Amiya Verma who resides in Vasant Vihar. Dainik Bhaskar added that Sunita was held captive in the house and not paid for the work. Her dues were directly transferred to Yamuna and Ashok.", "This report ended with Sunita’s family members pleading the police for their daughter’s safety. All subsequent reporting by the Hindi media outlet brought in the ‘CBI chief Alok Verma’ angle.", "This was the first instance of the news organisation raising speculations about the accused’s identity. The October 26 report by Dainik Bhaskar suggested that Sunita was rescued from the residence of CBI chief Alok Verma, where she had been held captive for the last three months. Verma has been at the centre of controversies surrounding the top investigation agency.", "“वर्मा सीबीआई निदेशक हैं या कोई और…इस पर सभी खामोश हैं। दिल्ली पुलिस ने इसका खंडन किया है। (Everyone is silent on whether this Verma is the CBI chief or not. Delhi police has denied the allegation),” reported Dainik Bhaskar.", "However, this was immediately followed with – “महिला आयोग की मदद से सुनीता का रेस्क्यू किया गया, लेकिन वर्मा के सीबीआई निदेशक होने की चर्चा चलते ही आयोग के सभी सदस्यों के फोन बंद हो गए। (Sunita was rescued with the help of women’s commission. But after speculations that this Verma might be the CBI chief, all phone lines of the commission have been unresponsive.)”", "Despite adding in this report that the Delhi police have denied rumours that Sunita was held hostage by CBI chief Alok Verma, Dainika Bhaskar published another report a few days later, furthering its speculations.", "In the report published on October 31, the Hindi media outlet said that Ranchi police was taking Sunita home on Monday after her rescue.", "“हालांकि, अभी तक यह स्पष्ट नहीं है कि ये आलोक वर्मा विवादों में फंसे सीबीआई निदेशक हैं या कोई और, इस मुद्दे पर दिल्ली महिला आयोग से लेकर रांची पुलिस तक चुप है। (However, it is still not clear whether the Alok Verma involved in this case is the controversial CBI chief. Both Delhi Women’s Commission and Ranchi police are mum on the issue.),” reported Dainik Bhaskar.", "The news organisation claimed that its reporters attempted to speak with Sunita when her train arrived at Bokaro station. However, police officials, including SSP Yogendra Kumar took the woman away. The title of Dainik Bhaskar’s story was based on this incident – “Bhaskar asked Sunita who was Alok Verma, police stopped the train and left (translated).”", "In the latter part of this article, Dainik Bhaskar included Sunita’s statement to the police – “सुनीता ने बयान में बताया कि वह आलोक वर्मा के यहां काम करती थी, मगर काम के पैसे नहीं दिए जाते थे..आलोक वर्मा कौन हैं पूछताछ के बाद ही यह साफ हो सकेगा। (Sunita said in her statement that she used to work for Alok Verma but was unpaid for her labour…The identity of Alok Verma will only be revealed after interrogation is completed.)”", "In the follow-up article published on November 1, Dainik Bhaskar reported, “झारखंड महिला आयोग की अध्यक्ष कल्याणी शरण ने बताया कि पीड़ित सुनीता ने सीबीआई निदेशक आलोक वर्मा की फोटो देखकर उनकी पहचान की। Jharkhand women’s commission chief Kalyani Sharan said that Sunita recognised CBI chief Alok Verma through his photograph.” Thus declaring that the head of India’s top investigating agency was involved the domestic help captive at his residence.", "Dainik Jagran conducted its own investigation of the case and published a report on November 2. “सीबीआइ निदेशक नहीं, कंसल्टेंट आलोक वर्मा के घर बंधक थी पीडि़ता| (Sunita was held hostage at the residence of consultant Alok Verma and not the CBI chief),” is the first sentence of the report.", "The news outlet found that Sunita was made to work at two households, including the residence of financial officer Alok Verma’s parents. Sunita carried out chores for Verma’s elderly father as well. All discussions vis-a-vis Sunita’s recruitment took place between Govind Sharma (one of the accused) and Alok Verma’s wife, Amiya.", "1. Statement of Delhi and Ranchi police: Alt News contacted senior officials in Delhi police who, after verifying facts with SSP Ranchi, said that Sunita was rescued from the residence of one Alok Verma who works as a financial assistant at a private firm. The police said that a confusion regarding the man’s identity was created because his name matched that of the CBI chief.", "Alt News accessed the FIR filed by Sunita, which named three people – Nishya, Alok Verma and Govind Sharma – as accused.", "In the FIR, Sunita has not referred to Alok Verma as the CBI chief.", "2. Address of the accused does not match the address of CBI chief Alok Verma: Recently, four officials of the Intelligence Bureau (IB) were detained for ‘snooping’ outside CBI chief Alok Verma’s residence. According to media reports, this was at 2 Janpath, which is the official residence of the director of CBI. The FIR mentions the accused Alok Verma’s address as 7/2, Block B, Vasant Vihar, which is approximately 10 km away from 2 Janpath.", "3. Statement of the chairperson of Jharkhand women’s commission: Alt News contacted the Jharkhand Commission for Women chairperson Kalyani Sharan who was quoted by Dainik Bhaskar as saying that Sunita identified the man who held her captive as CBI chief Alok Verma.", "Claiming that she was misquoted in the media, Sharan added, “Sunita has not confided in me that the man was, in fact, the CBI chief. There are thousands of Alok Verma in this country and it is only for the police to investigate the identity of the accused.”", "The statements of Delhi police and the report by Dainik Jagran point to a glaring case of misreporting by Dainik Bhaskar. A case unconnected to CBI chief Alok Verma was misreported by one of the most widely read mainstream media outlets, which is yet to publish any clarification on the same. In the recent past, there have been other cases of misreporting by Dainik Bhaskar, which includes giving a ‘fanatic evangelism’ angle to the Delhi shooting case and communalising the murder of Delhi resident Ankit Garg.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]