["About this rating", "In August 2020, the antifa.com URL began redirecting users to joebiden.com, the official campaign website for U.S. Democratic Presidential Candidate Joe Biden. Since the initial publication of this story, the redirect link continued to change and pointed users to other websites, including kamalaharris.org and the self-described anarchist website itsgoingdown.org.", "However, there are no apparent links between any of the website redirects and the Joe Biden campaign (anyone who owns or has access to a domain can establish either a temporary or permanent URL redirect, which essentially tells a search engine that the page has moved).", "As of late August 2020, it is unknown who implemented the web redirects.", "Shortly after presumptive U.S. Democratic presidential nominee Joe Biden announced Sen. Kamala Harris of California as his running mate, Snopes readers asked us to verify a number of rumors and claims surrounding the Democratic ticket and their respective campaigns. Among them was the question of whether the URL antifa.com automatically redirects to the official campaign website of Biden and Harris.", "A quick search by Snopes confirmed this rumor to be based in truth (our initial search from Aug. 12, 2020, is recorded in the video clip shown below). As of that date, the URL redirected internet users to joebiden.com. However, by the next day (Aug. 13), the antifa.com site and its redirect had been removed entirely. Since our initial publication of this story, the antifa.com redirect continued to change, pointing users once again to the official Biden campaign website at some point in late August 2020, according to readers. On Aug. 25, the URL redirected at least some users to a site called It’s Going Down (itsgoingdown.org), which described itself as a “community center for anarchist, anti-fascist, autonomous anti-capitalist and anti-colonial movements.” By Aug. 31, the antifa.com URL once again redirected the majority of users to joebiden.com. There was no apparent link between either of the websites and the Biden campaign.", "https://media.giphy.com/media/d6FEL2SQxYaC9pxTfG/giphy.gif", "Snopes contacted the Biden campaign for comment regarding any potential involvement with the redirect but did not hear back at the time of publication. In an Aug. 31 Tweet, Rob Flaherty, digital director for the Biden campaign, denied involvement with the redirect and blamed it on internet trolls.", "Flaherty also noted that antifa.com was registered to an entity located in Russia, which is partly true. An investigation of internet domain search engine Whoxy confirmed that antifa.com was previously registered through a domain privacy service located in Saint Petersburg, Russia, but a cross-reference with WhoIs, an online domain registry record found that the URL was registered under the privacy service “Namecheap Inc” using “WhoisGuard Protected” with a geolocation in Panama. It appeared that antifa.com was last updated on Jan. 1, 2021, but because the domain used a privacy service to hide its registration data, our team was not able to verify the location of the URL owner.", "Rumored associations with the political protest movement antifa, short for anti-fascists, have plagued Biden’s campaign. In June 2020, the politician was falsely accused of having called the far-left network a “courageous group of Americans.”", "According to the Anti-Defamation League, antifa is not a unified group but rather a “loose collection of local/regional groups and individuals” that many civil rights organizations have deemed “dangerous and counterproductive” for their use or endorsement of intimidation and violence.", "As of the most recent update of this article, it is unknown who implemented the web redirect. Anyone who owns or has access to a domain can establish either a temporary or permanent URL redirect, which essentially tells a search engine that the page has moved. As such, a redirect simply directs site visitors to a different URL when they click a particular link, according to website hosting platform Squarespace.", "According to Whois, antifa.com was registered on April 24, 2002, and was last updated on Oct. 23, 2019. We dug through the internet archives to establish a timeline of the domain in order to determine when the redirect was created. Here’s what we found:", "It’s not the first time Biden’s website has been the target of internet hoaxes. In 2019, Republican consulting firm Vici Media Group created joebiden.info, a mock website for the presidential hopeful that featured pictures, videos, and animated GIFs of Biden appearing to kiss and touch young women and girls. The marketing group also created fake websites for other Democratic candidates, including Sens. Bernie Sanders, Elizabeth Warren, and Kamala Harris.", "Evon, Dan.   \"Did Kamala Harris Call Joe Biden a Racist?\"\r\n    Snopes.   12 Aug 2020.", "MacGuill, Dan.   \"Did Trump Donate to Kamala Harris’ Past Election Campaigns?\"\r\n    Snopes.   12 Aug 2020.", "Mikkelson, David.   \"Is This Joe Biden Kissing a Young Girl?”\r\n    Snopes.   10 June 2020.", "\"Biden Selects California Sen. Kamala Harris as Running Mate.\"\r\n    The Associated Press.   11 Aug 2020.", "Ibrahim, Nur.   \"Did Joe Biden Call Antifa ‘Courageous’ Americans?”\r\n    Snopes.   16 June 2020.", "Ibrahim, Nur.   \"Can Trump Designate Antifa as a ‘Terrorist Organization’?”\r\n    Snopes.   3 June 2020.", "Frenkel, Sheera, Barnes, Julian.   \"Russians Again Targeting Americans With Disinformation, Facebook and Twitter Say.\"\r\n    The New York Times.   1 Sept 2020", "Binder, Matt.   \"Misinformation Spreads About Russia Connection to Antifa.com.\"\r\n    Mashable.   13 Aug 2020", "Update [Aug. 25, 2020]: This article was updated to include a second redirect to the Biden official campaign website, according to readers, as well as to highlight another redirect that sent users to itsgoingdown.org.", "Update [Aug. 31, 2020]: This article was updated to reflect continued changes to the antifa.com URL redirect and updates to the archive timeline.", "Update [Sept. 1, 2020]: This article was updated to include a Tweet from Rob Flaherty and domain registration information.", "Update [Feb. 2, 2021]: This article was updated to clarify language related to the URL registered location.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]