["An image of Ratan Tata has gone viral on social media particularly on WhatsApp. The text on the image reads, “Big announcement by Rata Tata Sahab: From now on Tata Group of companies not to recruit any of the JNU #Students.” The message adds, “Those who can’t be faithful to the country how can we expect them to be faithful to the company.”", "This comes after a Delhi court asked for a status report on the pending sanction to prosecute former Jawaharlal Nehru Students’ Union president Kanhaiya Kumar and others in the 2016 sedition case.", "Alt News received several requests to fact-check the images on WhatsApp (+91 76000 11160) and on our official mobile application.", "Alt News performed a keyword search on Google and found that a PTI report debunking the viral message in 2016 was republished by several news organisations including Financial Express and Business Standard.", "According to the report, Tata Group clarified that no such statement was made by Ratan Tata. Alt News did a keyword search and found a quote-tweet by Tata Group from February 15, 2016, where the company reiterated the same.", "Mr Tata has not issued any such statement. https://t.co/tIVi6Vgukh", "— Tata Group (@TataCompanies) February 15, 2016", "Moreover, had the company made such an announcement, it would have been reported in the media. The lack of reports and no mention of any such decision on the company website also hint that the viral message is false.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]