["About this rating", "Russian-born American author Ayn Rand, who is best known for her didactic novels championing capitalism and individualism, The Fountainhead and Atlas Shrugged, also wrote several philosophical works, essays, lectures, and newsletters elaborating on her ethos of \"Objectivism.\"", "In all these writings, Rand defended the rights of individual freedom and ownership of property, which she regarded as absolute and inviolable, against every encroachment of \"collectivism,\" broadly defined as the subjugation of the individual to a group. In her book of essays Capitalism: The Unknown Ideal, she wrote:", "The ideological root of statism (or collectivism) is the tribal premise of primordial savages who, unable to conceive of individual rights, believed that the tribe is a supreme, omnipotent ruler, that it owns the lives of its members and may sacrifice them whenever it pleases to whatever it deems to be its own “good.”", "In terms of the individual's relationship to the state (whose only valid reason for existing, she claimed, is to defend the safety and rights of its citizens), Rand believed that all taxation should be strictly voluntary. She therefore regarded every instance of the involuntary appropriation or redistribution of wealth as a violation of the rights of the individuals from whom money is taken — i.e., theft:", "Since there is no such thing as the right of some men to vote away the rights of others, and no such thing as the right of the government to seize the property of some men for the unearned benefit of others — the advocates and supporters of the welfare state are morally guilty of robbing their opponents, and the fact that the robbery is legalized makes it morally worse, not better.", "Unsurprisingly, then, the so-called \"welfare state,\" with its systematic redistribution of wealth as social entitlements, was Rand's bogeyman of choice. Economist Alan Greenspan, former Federal Reserve chairman and an early espouser of Rand's laissez-faire philosophy, wrote:", "Stripped of its academic jargon, the welfare state is nothing more than a mechanism by which governments confiscate the wealth of the productive members of a society to support a wide variety of welfare schemes....", "Although Social Security is usually framed as retirement insurance (pay in while you're working, then withdraw savings upon retirement), a 2014 article on the Ayn Rand Institute web site argues that it is a form of welfare:", "In fact, Social Security is not insurance. It merely seizes income from working Americans and dispenses it to retirees, with a vague (but legally unenforceable) assurance that younger Americans will someday get to reach into the pockets of their kids and grandkids. We shouldn’t hide that fact with euphemisms. “Contributions” should be called “taxes.” “Benefits” should be called “handouts.” Social Security shouldn’t be described as “social insurance” but as welfare.", "In 2010, journalist and former media rep for the Ayn Rand Institute Scott McConnell compiled an oral history of Rand in which Evva Pryor, who worked as a consultant to the law firm that represented Rand, admitted to helping the aging author and her husband apply for and receive Social Security benefits in the mid-1970s.", "McConnell's book, \"100 Voices: an Oral History of Ayn Rand\" comprised scores of transcribed interviews with scores of Rand's friends, family members, and associates. McConnell interviewed Pryor in 1998, 16 years after Rand's death.", "McConnell: How and when did you meet Ayn Rand?", "Pryor: It was around 1976 when I worked as a consultant for her attorneys, Ernst, Cane, Gitlin & Winick. My masters degree was in social work, and I had been with Mobilization for Youth and was also teaching at NYY as an adjunct [instructor] and working as a consultant to a number of other organizations. A problem came up, and her attorneys asked me if I would meet with her.", "McConnell: What was the problem?", "Pryor: She was \"retiring,\" and Paul Gitlin and Gene Winick, her attorneys, felt she should discuss applying for Social Security and Medicare. The office asked that I go over and talk with her about it.", "McConnell: Tell me about your first meeting with Ayn Rand and how these matters developed.", "Pryor: I had read enough to know that she despised government interference, and that she felt that people should and could live independently. She was coming to a point in her life where she was going to receive the very thing she didn't like, which was Medicare and Social Security.", "I remember telling her that this was going to be difficult. For me to do my job, she had to recognize that there were exceptions to her theory. So that started our politial discussions. From there on - with gusto - we argued all the time the initial argument was on greed. She had to see that there was such a thing as greed in this world. Doctors could cost an awful lot more money than books earn, and she could be totally wiped out by medical bills if she didn't watch it. Since she had worked her entire life and had paid into Social Security, she had a right to it. She didn't feel that an individual should take help.", "McConnell: And did she agree with you about Medicare and Social Security?", "Pryor: After several meetings and arguments, she gave me her power of attorney to deal with all matters having to do with health and Social Security. Whether she agreed or not is not the issue, she saw the necessity for both her and Frank. She was never involved other than to sign the power of attorney; I did the rest.", "An archivist for the Ayn Rand Institute told us that although most of Rand's financial records were destroyed at the time of her death and they have no physical evidence of her receiving Social Security distributions, Evva Pryor's testimony was backed up by Rand's secretary, Cynthia Peikoff, who helped the author with her finances during the last two years of her life and reported seeing Social Security checks.", "The archivist also told us that proof that Rand paid into the Social Security system earlier in life exists in the form of an application for a Social Security card, the card itself, and legal correspondence from the mid-1940s inquiring about a refund of Social Security withholdings.", "In 2010, freelance writer Patia Stephens reported obtaining a Social Security Administration record via FOIA request showing that Ayn Rand collected a total of $11,002 in Social Security payments between 1974 and her death in 1982 (her husband, Frank O'Connor, also collected benefits until his death).", "Upon the release of the book containing Pryor's testimony, critics of Ayn Rand's uncompromising libertarian ethos wasted no time pointing out the apparent inconsistency and hypocrisy of her acceptance of government payments. In an op-ed titled \"Ayn Rand Railed Against Government Benefits, But Grabbed Social Security and Medicare When She Needed Them,\" AlterNet's Joshua Holland wrote:", "Ayn Rand was not only a schlock novelist, she was also the progenitor of a sweeping “moral philosophy” that justifies the privilege of the wealthy and demonizes not only the slothful, undeserving poor but the lackluster middle-classes as well.", "Her books provided wide-ranging parables of \"parasites,\" \"looters\" and \"moochers\" using the levers of government to steal the fruits of her heroes' labor. In the real world, however, Rand herself received Social Security payments and Medicare benefits under the name of Ann O'Connor (her husband was Frank O'Connor).", "Center for the Study of the American Dream Founding Director Michael Ford wrote:", "As Pryor said, “Doctors cost a lot more money than books earn and she could be totally wiped out” without the aid of these two government programs. Ayn took the bail out even though Ayn “despised government interference and felt that people should and could live independently... She didn’t feel that an individual should take help.”", "But alas she did and said it was wrong for everyone else to do so. Apart from the strong implication that those who take the help are morally weak, it is also a philosophic point that such help dulls the will to work, to save and government assistance is said to dull the entrepreneurial spirit.", "In the end, Miss Rand was a hypocrite but she could never be faulted for failing to act in her own self-interest.", "Point acknowledged. Yet the accusation of hypocrisy rests on an assumption that nowhere in Rand's vast oeuvre had she ever made a case for accepting money from the government. However, she did, in fact, make such a case in a 1966 essay, \"The Question of Scholarships.\"", "It is morally defensible for those who decry publicly-funded scholarships, Social Security benefits, and unemployment insurance to turn around and accept them, Rand argued, because the government had taken money from them by force (via taxes). There's only one catch: the recipient must regard the receipt of said benefits as restitution, not a social entitlement.", "\"Those who advocate public scholarships [or Social Security benefits] have no right to them; those who oppose them have,\" Rand wrote. In fact, she seemed to see it as something approaching the duty of those opposed to the redistribution of wealth to accept such payments:", "Since there is no such thing as the right of some men to vote away the rights of others, and no such thing as the right of the government to seize the property of some men for the unearned benefit of others — the advocates and supporters of the welfare state are morally guilty of robbing their opponents, and the fact that the robbery is legalized makes it morally worse, not better. The victims do not have to add self-inflicted martyrdom to the injury done to them by others; they do not have to let the looters profit doubly, by letting them distribute the money exclusively to the parasites who clamored for it. Whenever the welfare-state laws offer them some small restitution, the victims should take it.", "Ayn Rand Institute Chief Content Officer Onkar Ghate addressed the apparent paradox of Rand's position in a 2014 article, \"The Myth About Ayn Rand and Social Security\":", "Precisely because Rand views welfare programs like Social Security as legalized plunder, she thinks the only condition under which it is moral to collect Social Security is if one “regards it as restitution and opposes all forms of welfare statism” (emphasis hers). The seeming contradiction that only the opponent of Social Security has the moral right to collect it dissolves, she argues, once you recognize the crucial difference between the voluntary and the coerced.", "Social Security is not voluntary. Your participation is forced through payroll taxes, with no choice to opt out even if you think the program harmful to your interests. If you consider such forced “participation” unjust, as Rand does, the harm inflicted on you would only be compounded if your announcement of the program’s injustice precludes you from collecting Social Security.", "This being said, your moral integrity does require that you view the funds only as (partial) restitution for all that has been taken from you by such welfare schemes and that you continue, sincerely, to oppose the welfare state.", "The flaw in this argument is that it only adds up if you accept Rand's characterization of involuntary taxation as \"legalized plunder\" and her assertion that it confers upon those who object to it on principle (and, by some interpretations, only those who object to it on principle) the right to financial restitution.", "Flawed or not, however, the fact that she articulated the position puts paid to the charge that her acceptance of Social Security benefits in later life was hypocritical. On her own terms, it was not.", "Ford, Michael.   \"Ayn Rand and the VIP-DIPers.\"\r\n   Huffington Post.   25 May 2011.", "Ghate, Onkar.   \"The Myth About Ayn Rand and Social Security.\"\r\n   Ayn Rand Institute.   19 June 2014.", "Holland, Joshua.   \"Ayn Rand Railed Against Government Benefits, but Grabbed Social Security and Medicare When She Needed Them.\"\r\n   AlterNet.   28 January 2011.", "McConnell, Scott.   100 Voices: An Oral History of Ayn Rand.\"\r\n   New York: Penguin, 2010.   ISBN 9781101477892, p. 456-8.", "Rand, Ayn.   Capitalism: The Unknown Ideal.\r\n   New York: New American Library, 1966.   p. 36.", "Rand, Ayn.   \"The Question of Scholarships.\"\r\n   The Objectivist.   June 1966.", "Stephens, Patia.   \"Ayn Rand, Hypocrite?\"\r\nSelf-published.   5 December 2010.", "Watkins, Dan.   \"Let's Have an Honest Debate About Social Security.\"\r\n   Ayn Rand Institute.   15 August 2014.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]