["About this rating", "A car drove through a crowd of protesters.", "The demonstration was in Brazil, not the United States, and was part of a general strike.", "In May 2017, a video appeared on social media showing a car driving through a crowd of protesters on a highway. Many posts of this footage lacked contextual information, leaving viewers in the dark about when and where it occurred.", "When Facebook group \"Trump Supporters\" posted the video without context, many commenters assumed that the protesters were liberals, part of Black Lives Matter, that they were protesting President Donald Trump, and that the incident took place somewhere in the United States:", "This video shows an incident that occurred on 28 April 2017 in the Brazilian city Sao Jose dos Campos during an anti-austerity protest. According to Globo.com, two women were injured during the incident (not critically) and the driver was arrested for attempted murder:", "When the vehicle arrived at the site, demonstrators had already occupied the highway. The driver tried to move forward, but the vehicle was surrounded. He then drives backward and pulls off the demonstrators. Film reporter Wilson Araújo, from TV Vanguarda, recorded the moment.", "The injured women were rescued by the Rescue at the Industrial Village emergency room. They suffered bruises and were discharged from the unit at night.", "The driver who got involved in the hit was prosecuted and arrested for attempted murder - he remains detained this Saturday (29).", "A second video of the incident clearly shows that the protesters were holding protest signs in Portuguese, one of which read \"Greve geral contra las reformas trabalhista e da previdencia,\" or \"General strike against the labor and social security reforms\":", "In short, any interpretation of this video involving anti-Trump protesters is resoundingly false.", "Pestano, Andrew.   \"Brazilian cities largely shut down in austerity protests.\"\r\n    UPI.   28 April 2017.", "G1.   \"Motorista fura bloqueio na Dutra e atropela manifestantes em São José; veja.\"\r\n    2 April 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]