["A post on this Kenyan Facebook group with more than two million followers shared a link to the article alongside this text: “President Museveni has postponed next Years Election to 2023 Due to CORONAVIRUS. We cannot Risk the life of millions of people of Uganda we will have our elections in 2023 - Museveni (sic)”.", "According to the article, the Ugandan leader made the announcement during a press conference at his official residence.", "Similar claims were made in other Facebook posts here, here, here, and here.", "Some online users appeared to believe the claims, commenting that it could be a ploy by Museveni -- who has ruled since 1986 -- to extend his term. He has already been endorsed by the ruling National Resistance Movement (NRM) for re-election.", "However, Museveni has made no such declaration.", "Don Wanyama, Museveni’s press adviser, told AFP via phone that “the president does not have powers to postpone elections”.", "“That is silly, obviously. It is fake news,” Wanyama said in dismissing the claims.", "Uganda holds its general election every five years and according to electoral laws, a presidential election may be suspended in the event of war or a state of emergency. The law allows parliament to reschedule the date for the election.", "Uganda's constitution gives the president the powers to declare a state of emergency.", "The claim coincides with a petition filed in a Ugandan court by Abey Mgugu, a citizen who is pleading with the state to postpone next year’s polls because of fears associated with the novel coronavirus, local media reports here. No response has been forthcoming from the government yet. Uganda has not reported any case of coronavirus and no official communication has been issued regarding next year’s election.", "However, the president is set to address the nation regarding the coronavirus pandemic during the afternoon of Wednesday 18 March, 2020.", "I will address the nation tomorrow Wednesday March 18th, 2020.\n\t\t5.00PM pic.twitter.com/nRAl6PAERo", "Jotham Taremwa, Electoral Commission spokesman, told AFP that the claims should be ignored, stating: “That is nonsense.”", "When asked whether the president has the power to postpone elections or what the process for such an event would be, he said: “I don't want to give any credit to discussing these false stories. Why should I? It is false.”", "Museveni, 75, got the clearance to run for the presidential seat after a bill that scrapped the presidential age limit of 75 was signed into law. This move by Uganda’s parliament sparked demonstrations and an outcry from the opposition which accused the president of seeking to rule for life. Read AFP’s report here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]