["About this rating", "On March 6, 2020, U.S. President Donald Trump traveled to Tennessee to survey the damage done by a series of tornadoes that killed at least 25 residents statewide. As Trump met with local officials, first-responders, and residents affected by the deadly twisters, a photograph started to circulate on social media that supposedly showed the 73-year-old commander-in-chief had wet his pants:", "This is a genuine photograph. However, the darkened area on Trump's pants is not the result of incontinence. It is just a shadow.", "This photograph was taken at Jefferson Avenue Church of Christ in Cookeville, Tennessee, by local photographer George Walker IV. The picture was posted to social media by Tennessee Gov. Bill Lee:", "Getty Images photographer Jim Watson captured the moment from a different angle:", "Trump's visit to Tennessee was covered by several news crews and photographers; videos are available via VOA News, Fox News, NBC News, the White House, The Associated Press, and several more. Dozens of additional photographs are also available via The Tennessean.", "The moment before the viral photograph is documented in the following clip from VOA News. You can see how the dark spot on Trump's pants (as well as the dark spots on everyone else's clothing) move in a manner consistent with shadows and wrinkles.", "Jefferson, Andrea.   \"Internet Speculates After Trump Appears to Have Wet Pants at Tennessee Disaster Meeting.\"\r\n    PoliticalFlare.com.   6 March 2020.", "Dwyer, Colin.   \"'We Love Them': Trump Tours And Consoles Tornado-Ravaged Tennessee.'\"     NPR.   6 March 2020.", "Ebert, Joel; Gonzales, Jason; Tamburin, Adam.   \"Trump Pledges Support, Aid for Tennessee Tornado Victims: 'We're Going to be With Them All the Way.'\"\r\n    Tennessean.   7 March 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]