["The video was published here on Facebook on February 19, 2019.  It has been viewed more than 286,000 times and shared more than 14,000 times.", "The 10-second clip shows a woman and a man standing in front of an elevator. At the six seconds mark, the man punches the woman in the face, knocking her to the ground. The man can then be seen grabbing an object which has fallen next to the woman's head.", "The simplified Chinese-language caption translates to English as: “Everyone please try to help by sharing this, and mobilise the power of the internet to find this evildoer. Thanks everybody. Let’s not let our friends, families or children become the next victim. This happened yesterday afternoon, around 12:20 pm on Raja Uda, Butterworth”.", "Raja Uda is a street in Butterworth, a town in the northwestern Malaysian state of Penang.", "Below is a screenshot of the misleading Facebook post:", "The video has also been viewed nearly 200 times here on Facebook alongside an identical claim.", "The same video has also been viewed more than 200 times in this February 2019 YouTube post that claims the incident took place in Hong Kong.", "Malaysian newspaper Sin Chew Daily included a screenshot of the video in this February 2019 report, which states the video shows a robbery at a train station in Cheras, a district in the Malaysian capital Kuala Lumpur.", "The claim is false; the robbery happened in November 2018 in a city in Romania.", "A reverse image search on Google using keyframes from the video found a longer version of the clip published in several Romanian news reports.", "A higher-definition, longer version of the video was published here by Romanian newspaper Adevărul on November 19, 2018.", "The Romanian language caption of the 48-second video translates to English as: “Young woman attacked in the elevator hall of an apartment building in Alba Iulia”.", "Alba Iulia is located in west-central Romania.", "A journalist in AFP's Bucharest bureau translated the headline of the report to English as: “VIDEO Shocking footage! A young woman knocked out and robbed in the elevator hall of an apartment building in Alba Iulia. The mugger snatched her mobile phone and ran away\".", "Parts of the article, translated from Romanian to English, read: “A shocking attack on a young woman in the entrance hall of an apartment building in Alba Iulia was captured by the surveillance cameras.", "“Police are investigating the case. The woman was hit by an unidentified man while she was waiting for the elevator. The young woman lost consciousness and the man bent over, most likely to rob her.", "“The whole incident only lasted a few seconds. The man took her phone and disappeared. It appears that the attack took place in the M3 apartment block in Cetate district. It occurred around 6 pm Saturday, November 17.”", "Below is a screenshot comparison of three moments in the video in the misleading post (L) and the Adevărul video (R):", "Romanian Police on November 20, 2018, published this statement about the incident.", "The relevant part of the statement translates to English as: “On November 19, 2018, officers from the Alba County Police criminal investigation unit identified a 33-year old resident as a robbery suspect.", "“The man is accused of hitting and stealing the phone from a young woman, aged 20, who was waiting for the elevator in the hall of an apartment building in Alba Iulia.", "“He will face the Alba County Courthouse today, November 20, and prosecutors will decide on the appropriate legal actions against the suspect.”", "The incident was also reported here by Romanian TV channel Pro TV, here by Romanian newspaper Libertatea and here in English by online news website The Romania Journal.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]