["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As he presses for sweeping tax reform, President Donald Trump continues to paint the nation’s current tax burden in superlative colors. And he continues to struggle to get it right.", "In an interview, Mike Sacks, national political correspondent for E.W. Scripps, brought this up with Trump. Here’s that exchange:", "Sacks: \"You've repeatedly said that we're the highest taxed nation in the world when that's been seen as objectively false. With the credibility you need to pass tax reform, why —\"", "Trump: \"Some people say it differently, they say we're the highest developed nation taxed in the world.\"", "Sacks: \"Then why don't you say it that way?\"", "Trump: \"Because a lot of people know exactly what I'm talking about, and in many cases they think I’m right when I say the highest. As far as I'm concerned I think we're really essentially the highest, but if you want to add the ‘developed nation,’ you can say that, too. But a lot of people agree that the way I'm saying it is exactly correct.\"", "Does adding the \"developed nation\" label make the claim more accurate?", "No.", "When Trump has said before that America has the highest corporate tax rate, he’s on pretty firm ground and we’ve rated him Mostly True. The statutory tax rate for corporations is 35%, the highest among countries like Japan, Mexico, Australia, Germany, France, the United Kingdom, and other European nations.", "To be clear, the tax rate on paper and the effective tax rate are two different things.", "Thanks to the thousands of deductions and exemptions in state and federal tax codes, according to a 2016 Government Accountability Office report, the effective average corporate tax is 22%. That puts the country in the middle of the pack among our economic peers.", "As for the tax burden across the board for individuals and companies alike, economists generally rely on a couple of yardsticks. One is the total tax burden compared to the size of the economy and the other is the tax burden per person.", "The most recent numbers come from the Organization for Economic Cooperation and Development for 2015. The countries it compares include the group that are generally seen as \"developed nations.\"", "As a percentage of GDP, the U.S. tax burden — covering all levels of government — ranks 28th out of 32 countries. We ran the numbers based on federal revenues alone, and the rankings stayed about the same.", "On a per-person basis, America ranks 13th out of 31 nations.", "We asked the White House if they had other numbers. We didn’t hear back, but if we do, we’ll update this fact-check.", "Trump said that the United States is \"the highest developed nation taxed in the world.\"", "Looking at tax collections relative to the size of the U.S. economy and the number of people, the numbers tell a different story. The United States ranks 28th in tax revenue as a percentage of GDP and 13th on a per-capita basis.", "Trump said his view is \"exactly correct.\"", "In fact, it is exactly incorrect.", "We rate this claim False.", "Scripps Television, Interview with Donald Trump, Oct. 17, 2017", "U.S. Government Accountability Office, \"Most Large Profitable U.S. Corporations Paid Tax but Effective Tax Rates Differed Significantly from the Statutory Rate,\" March 2016", "Organisation for Economic Co-operation and Development, Total tax revenue as pecentage of GDP, accessed Oct. 17, 2017", "PolitiFact National, \"For the third time, Donald Trump, U.S. is not 'highest taxed nation in the world,’\" May 8, 2016", "PolitiFact Wisconsin, Pledging cuts, Donald Trump says at Wisconsin rally that U.S. has highest corporate tax rate, Dec. 15, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]