["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Getting tough on China has been a recurring theme among the candidates running for president in 2016", "In Bow, N.H. last week, Florida Sen. Marco Rubio said one his GOP rivals isn’t telling the whole truth about his record standing up for American firms against the Chinese.", "\"Ted Cruz was counsel on record for a Chinese company that stole an invention from an American inventor in Florida,\" Rubio said. \"Here you have someone who goes around talking tough about China, but he leaves out the fact that when China stole an American inventor’s product, he stood with the Chinese.\"", "\"That is a fact,\" Rubio said.", "We decided to check it out.", "The case", "The case in question involved a man named Jordan Fishman, the CEO of Alpha Mining Systems, a Florida-based specialty tire company.", "In 2009, he sued a Chinese tire manufacturer, Shandong Linglong Rubber Co., in U.S. District Court, in Virginia, accusing them of stealing blueprints and violating his copyright. His company was manufacturing tires in China when he said an employee conspired with Shandong Linglong, \"to steal our copyrighted blueprints and make low-quality knock-off tires,\" Fishman wrote in an Op-ed published in the Concord Monitor.", "Fishman won the suit and was awarded $26 million in damages in 2010, according to federal court records.", "But the Chinese company appealed and hired the Washington D.C. law firm Morgan, Lewis and Bockius, where Cruz was a partner. Lawyers argued the court erred in its original verdict because the Copyright Act could not be used to enforce damages against a foreign company when no violation occurred within the United States.", "Federal court records list R. Ted Cruz as one of the lawyers representing the Chinese firm.", "The court rejected the appeal and affirmed the decision in June 2012 to award Fishman $26 million in damages.", "But collecting the money proved difficult.", "In October 2012, federal marshals seized Shandong Linglong property in an attempt to enforce the court order, according to industry news reports.", "The claim", "We reached out to Rubio’s campaign, which provided links to several news articles about the case and Cruz’s involvement.", "The case gained political attention in 2012, when Cruz was running for U.S. Senate against David Dewhurst. PolitiFact Texas examined a similar claim that Cruz represented a Chinese company \"found guilty of stealing blueprints from an American manufacturer.\" That claim was rated Mostly True.", "This isn’t the first time Rubio has made such an accusation during his presidential campaign, and Cruz has defended himself calling it a \"bogus attack.\"", "We reached out to Cruz’s campaign, which said Cruz’s involvement in the case was minimal.", "\"When Cruz worked for Morgan Lewis, the law firm represented a Chinese tire company, he had nothing to do with the trial,\" said Rick Tyler, Cruz’s Communications Director. \"He helped edit briefs, but did not argue the appeal.\"", "Our ruling", "Marco Rubio said \"Ted Cruz defended a Chinese company that stole an invention from an American inventor.\"", "Cruz’s firm represented a Chinese firm found liable for stealing blueprints. While other lawyers argued the appeal, Cruz’s name appears as one of the lawyers representing the Shandong Linglong Rubber Co. against an American company.", "Cruz and his firm were not involved with the original case, just the appeal.", "We rate Rubio’s claim Mostly True.", "Concord Monitor, My Turn: Ted Cruz chose money over American values, Tuesday, February 2, 2016", "Email interview with Michael Zona, New Hampshire Communications Director for Marco Rubio, Feb. 6, 2016", "Email interview with Rick Tyler, Communications Director for Ted Cruz, Feb. 6, 2106", "Rubber and Plastic News, Authorities seize Shandong Linglong Tyre booth at SEMA, October 31, 2012", "PolitiFact Texas, David Dewhurst says Ted Cruz represents a Chinese company found guilty of stealing U.S. blueprints, April 19, 2012", "Dallas Morning News, Rubio: Cruz, who once defended Chinese company, can’t be \"tough on China,\" Jan. 25, 2016", "Houston Chronicle, Fact-checking the Senate ads, April 23, 2012", "Texas Tribune, Ted Cruz and China: What Are the Facts?, June 22, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]