["About this rating", "Since at least 2014, one of the Internet's most viral scientific images has been an animated gif showing a protein with \"legs\" strutting along a filament while carrying a large undulating orb. Viral posts originating on Imgur and 9gag have suggested that it is a visual representation of happiness itself:", "This is what happiness really looks like: Molecules of the protein myosin drag a ball of endorphins along an active filament into the inner part of the brain's parietal cortex, which produces feelings of happiness.", "In reality, a more accurate description would be: This is what a kinesin protein might look like — if it were especially colorful.", "The computer-generated three-dimensional simulation, originally created by medical artist and animator John Lieber, is an early version of a visualization that appeared in a 2006 video produced by the artist and two Harvard scientists titled \"The Inner Life of the Cell\". In a 2014 blog post, Lieber explained that he originally created the animation as a side project, but that it ended up being a big part of the final short film:", "The kinesin motor protein was a real scene stealer in Inner Life, although it wasn't even in the original treatment for the short. The original plan was to omit the motor protein in the vesicle shots, but when I saw [another researcher's animation of the molecule] I secretly went ahead and modeled one of my own, animated a walk cycle for it, and added it into the vesicle shot. After I showed it to [one of the Harvard collaborators] it not only got into the animation, it got several more shots as well.", "Both kinesin and myosin are considered motor proteins, which (among other things) can transport newly synthesized molecules between different regions within eukaryotic cells, as described in a 2000 review in Science:", "The motions of muscles as well as much smaller intracellular cargoes are driven by molecular motors that move unidirectionally along protein polymers (actin or microtubules). [...] Muscle myosin, whose study dates back to 1864, has served as a model system for understanding motility for decades. Kinesin, discovered [...] in 1985, is a relative newcomer by comparison.", "While both proteins have a similar molecular core and both use ATP to power their movement, it is the iconic strut that gives away the identity of the motor protein in the viral animation.", "Both myosin and kinesin have identical pairs of molecules that \"latch\" onto different types of cellular structures. In kinesin they move over longer distances with coordinated steps. In myosin, which is most famous for the processes that drive muscle contractions, those latching molecules operate independently of each other, and the system produces more of a single tug than a coordinated strut.", "While scientists have not produced actual images or videos of such molecules with the clarity of this visualization, increasingly precise microscopic techniques and tools have allowed a detailed characterizations and direct observations of their movement. A groundbreaking paper published by Nature in 1993 detailed for the first time the nature of a kinesin movement — if you're wondering, each step is just about eight nanometers long.", "While some posts assert that this animation represents an action that takes place in the brain, the creator says that it — and the larger video it is part of — actually \"takes the viewer through many of the inner workings of a leukocyte (or white blood cell) showing many of the cellular structures and organelles along the way.\" While kinesins can and do play a role in transporting numerous important chemicals within neurons, that is not a process that would be happening in a white blood cell.", "Because this picture shows an artist's visualization of a kinesin protein in a white blood cell and not a myosin protein in a neuron, and it is not an actual video but a representation, we rate the claim that this picture is a visual representation of \"happiness\" as false.", "Lieber, John.   \"'The Inner Life of the Cell' Video\"     The Art of the Cell.   September 2014.", "Lieber, John.   \"In the Beginning There Was The (Inner Life of the) Cell\"     The Art of the Cell.   29 March 2014.", "Lieber, John.   \"Well, You Can Tell by the Way I Use My Walk… Scientific Illustration\"     The Art of the Cell.   9 May 2014.", "Vale, Ronald, D. and Milligan, Ronald A.   \"The Way Things Move: Looking Under the Hood of Molecular Motor Proteins.\"     The Art of the Cell.   7 April 2000", "Hirokawa, Nobutaka, et al.   \"Kinesin superfamily motor proteins and intracellular transport.\"     Nature Reviews Molecular Cell Biology .   October 2009.", "Update [June 29, 2022] Updated SEO/social, formatting and title.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]