["“ARE YOU GETTING IT...? ARE YOU GETTING IT? am still Silent......(sic),” reads the caption on this Facebook post, shared nearly 300 times since November 11, 2020.", "The post contains nine images, all but one purportedly showing religious leaders and US Democrats flashing Satanic symbols in public.", "Making up the montage is an image that appears to show a procession of people wearing black clothes with hoods over their faces and horns on their heads. It accompanied this report from earlier in the year about a Satanic church that opened in South Africa.", "Viewed as a whole, the post projects the wild conspiracies of right-wing movements and conservative online communities that have flourished during the Covid-19 pandemic, whose members believe that US President Donald Trump is waging a secret war against a global liberal cult of Satan-worshipping paedophiles, as reported here by AFP Fact Check.", "In other posts from the same page, the content varies from staunch support for Trump and Christian beliefs to promoting Biafra, a secessionist group in Nigeria’s south-eastern region that is advocating for an independent state.", "Pro-Biafran pages have also circulated misinformation about the US elections in support of Trump, and expressed the opinion that he would recognise their cause.", "One of the images shows the head of the Catholic Church Pope Francis and Filipino Cardinal Luis Antonio Tagle making a hand gesture with the thumb, index finger and pinky extended, while the ring and middle fingers are bent downwards.", "Many comments on the post insinuated it showed them flashing a sign commonly called “devil horns”. Considered by some as a symbol of Satanic worship, it has many different meanings in different parts of the world. In recent decades, it has been used by music fans as a sign for \"rock 'n' roll\" or \"rock on\", and has even become a popular emoji.", "Three of the photos in the Facebook post were also shared by another user of the social network, alongside a caption that reads: “Some said it’s sign of antichrist but he that’s doing it is a Pope, how can Pope be antichrist (sic).”", "Comments in this post also seem to view the hand gestures as the sign of devil worship.", "However, the photos do not show the religious leaders and politicians making a Satanic hand gesture.", "A reverse image search conducted by AFP Fact Check on one of the images showing the former head of the Roman Catholic Church, Pope Benedict, led to the original version in the archives of Reuters news agency.", "The photo was taken in 2005 in Germany when Pope Benedict was greeting pilgrims.", "The background, the pope’s clothes and other similarities match in the viral image and the original photo. However, the position of his hands and the pattern on his ring were digitally manipulated in the viral image.", "Meanwhile, checks on the photo of Pope Francis and Cardinal Luis Antonio Tagle raising their right hands show the image is genuine. However, the sign displayed by the two religious leaders is not the \"devil horns\".", "The photo was traced to the archives of the American news agency Associated Press (AP). According to AP, the photo shows the leaders saluting the crowd with the hand sign for \"I love you\" during a meeting with families at the Mall of Asia Arena in the Philippines, on January 16, 2015.", "“I love you”, often abbreviated as ILY, is a sign from the American Sign Language, which is predominant in US deaf communities. It has the thumb, index and pinky fingers extended to represent the letters I, L and Y.", "The “I love you” sign is similar but not identical to the \"devil horns\" gesture where the thumb is bent inwards alongside the ring and the middle fingers.", "A similar sign was used by actors Jim Carrey and Maya Rudolph who played US President-elect Joe Biden and Vice President-elect Kamala Harris in a comedy skit on NBC’s “Saturday Night Live” show.", "At the end of the skit, while he's adressing President Trump's at the polls, Carrey says the word \"loser\" and accompanies it with the \"L\" sign on his forehead. This \"loser\" gesture became popular in the 1990s, notably after the release of Carrey's 1994 movie \"Ace Ventura: Pet Detective.\"", "Not only are the two individuals not Biden and Harris, but the sign they display is not the \"devil horns\", but rather the \"L\" sign for “loser”.", "The last image featured in the viral post shows former US president Barack Obama in a photograph taken by AFP photographer Jewel Samad at the Paramount Theatre in Austin, Texas, on July 10, 2014.", "Obama is seen raising his hand and showing a symbol similar to the \"devil horns\".", "American daily newspaper USA Today explained that the former president actually flashed the \"Hook 'em Horns\" sign, a hand gesture prominent among alumni of the University of Texas honoring the Longhorns and their mascot, Bevo. “It's like seeing Bevo's horns and saying ‘hello’,” the article explained.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]