["By Lori Robertson", "Posted on January 6, 2017", "House Minority Leader Nancy Pelosi made some misleading claims this week on the Affordable Care Act:", "Pelosi held a Jan. 2 conference call to discuss the impact of the Affordable Care Act and Republicans’ plans to repeal the law, and spoke again at a Jan. 4 press conference. As Pelosi and other Democratic lawmakers stated repeatedly, about 20 million people have gained health insurance since the law was passed. That’s an administration estimate of the impact of the law, but other estimates back that up. The National Center for Health Statistics surveys also show a 20 million drop in the number of uninsured since 2010, when the law was passed. The Congressional Budget Office estimated that the House repeal plan in 2015 would increase the number of the uninsured by 22 million after 2017.", "But other claims by Pelosi aren’t so solid.", "Democrats have stressed in the past that the ACA isn’t a government-run health care system, but instead it builds upon the work-based insurance system that already existed in the country. And that’s accurate. But Pelosi greatly exaggerated the percentage of Americans with employer-based coverage when she argued that repealing the law would hurt all Americans.", "“This is not just about the 20 million previously uninsured Americans who now have health security, but that would be good justification – but this is about the 75 percent of the American people who get their health benefits through their workplace, not through the ACA, but who gets increased benefits through the Affordable Care Act.”", "Pelosi repeated that 75 percent figure twice more in the conference call, and used it again in a Jan. 4 press conference. It’s a much higher percentage than we had heard before.", "The nonpartisan Kaiser Family Foundation estimates that 49 percent of the total population had employer health insurance coverage in 2015. KFF figures are based on the Census Bureau’s Current Population Survey for March.", "Separately, the Census Bureau issues an annual report, the latest of which found that 55.7 percent of the population had employer-based insurance for part or all of 2015.", "When we inquired, Pelosi’s office told us she was referring to the percentage of working adults, excluding seniors, and that the figure came from a staff analysis of the Census Bureau’s report for 2014. The Census figures for that year show 78.8 percent of all workers, both full-time and part-time, had private health insurance. Pelosi’s staff lowered that to 75 percent to account for those buying private insurance on the ACA exchanges or on the individual market.", "But there is Census data for this very specific subset — working adults under 65 with employer insurance. The “all races” Excel tables here show that 71 percent of all workers, age 18-64, who worked part-time or full-time, had employment-based coverage in 2014 and in 2015 (see line 244).", "That’s close to the figure Pelosi used, but it does not represent the percentage of “the American people” with employer-based coverage, as she repeatedly said.", "Pelosi went on to say that there had been slower growth in costs for those with employer coverage since the ACA was enacted: “The impact on that 75 percent is also significant in terms of controlling the increase in costs which was so dramatic before the ACA and has drastically been reduced.”", "She made a similar claim in a Jan. 4 press conference, saying that “the cost increase in premiums is the lowest it has been in the 50-some years that they had been tracking that. So, it has contained cost.”", "As we’ve written before, the growth in premiums — and national health care spending overall — has been at low or moderate rates for several years, though it’s not clear how much of an impact the ACA has had on the slowdown. The recession and slowly recovering economy have played a role, experts say.", "Premiums for employer-sponsored family plans have grown at an average 3 percent or 4 percent per year since 2012, according to the Kaiser Family Foundation’s annual Employer Health Benefits Survey. The surveys also show premiums grew by an average 3 percent from 2009 to 2010, the year the ACA was enacted, and by 5 percent from 2008 to 2009. Premiums jumped up by 9 percent in 2011, with a small part of that due to increased benefits under the ACA, experts told us at the time.", "For the “dramatic” cost increases that Pelosi mentions, we have to go back to the early half of the 2000s. As a graphic from the Kaiser Family Foundation shows, family premiums went up an average 63 percent from 2001 to 2006, an average 31 percent from 2006 to 2011, and just an average 20 percent from 2011 to 2016.", "The country has seen low rates of overall health spending growth, too — that growth was 4.1 percent or less per year from 2009 through 2013, a rate that the journal Health Affairs said was the lowest since the National Health Expenditure Accounts data was first compiled in 1960 by the Centers for Medicare & Medicaid Services.", "But spending grew 5.8 percent in 2015. Experts with the Centers for Medicare & Medicaid Services have said that the ACA has had a “minimal” impact on the slowdown in growth. It was largely the economy that affected the growth of health spending, and it’s the economy that is expected to increase that growth.", "Jason Furman, chairman of the president’s Council of Economic Advisers, said in an Oct. 7, 2015, speech that “the recent slow growth in health care costs has a variety of causes,” including the recession, private-sector efforts to control health care costs “even before the recession hit and the Affordable Care Act was enacted,” and the Affordable Care Act. Furman said the law’s reductions in Medicare spending had a “spillover effect” on overall health care spending, calling the ACA “a major reason” for slow growth.", "In September, after the KFF employer survey again showed low growth in average family premiums, Furman and the Council of Economic Adviser’s Matt Fiedler wrote in a White House blog post that “there is evidence that the Great Recession placed downward pressure on health care cost growth in the early years of the recovery,” but that the continued slow growth in premiums and spending was evidence that it was “increasingly likely that structural changes in the health care system — including changes in public policy and other factors that would have a persistent effect on health care spending over the long run — are the primary reasons health care cost growth remains low today.”", "Pelosi is right that premiums for work-based coverage have generally grown at slower rates since the ACA was enacted than years past, but the law isn’t the only reason experts have cited for that slowdown.", "Pelosi accused Republicans of using savings from Medicare to pay for tax breaks for the wealthy.", "“So, in their budget, they have the voucherizing of Medicare, they take 800 billion dollars of savings from Medicare, which we use to prolong the life, close the donut hole and provide more benefits for seniors. They take that and give it as a tax break to the wealthiest people in our country,” she said.", "“Voucherizing” refers to Rep. Paul Ryan’s years-long proposal to create a premium-support system for future Medicare beneficiaries, in which seniors would get government subsidies for their health care and then choose from traditional Medicare and private plans on a new Medicare exchange.", "Readers of FactCheck.org may be familiar with the $800 billion in Medicare savings. That’s the Affordable Care Act’s cut in the future growth of Medicare spending over 10 years. (See Table 4 of the CBO’s June 2015 report on the effects of repealing the ACA.) The reduction in spending primarily comes from a reduction in the growth of future payments to hospitals through Medicare Part A; savings also come from changing future payment rates for Medicare Advantage, which provides benefits through private insurance.", "Pelosi is correct to say that this reduction in spending prolongs the life of Part A, or the hospital insurance trust fund, which is primarily funded by payroll taxes. The Medicare trustees’ 2010 report estimated that the ACA had added 12 years to the life of the trust fund.", "But to be clear, if Republicans keep that reduction in Medicare spending, the life of the trust fund is still extended. That doesn’t change.", "Pelosi is free to criticize the Republicans for reversing course. The GOP has long criticized the $800 billion in savings, calling it a cut or even a “raid” on Medicare. But now, just as Ryan has proposed in the past, congressional Republicans may keep the Medicare savings — if they don’t, they’d be increasing government spending.", "And Pelosi is free to criticize the Republicans’ plans for tax breaks — another part of Ryan’s past budget plans. But we don’t know what exactly Republicans will propose just yet. The budget resolution introduced in the Senate this week only gives spending and revenue guidelines, and doesn’t delve into any tax plan. It’s up to congressional committees to write legislation that fills in the details on how those budget guidelines would be met.", "Regardless of any tax changes, if the ACA Medicare savings, or most of them, stay in effect, the life of the trust fund would still be extended, because less money would be spent from the fund than would have been without those savings.", "Politifact Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]