["By D'Angelo Gore", "Posted on July 9, 2020", "A Democratic TV ad attacks Sen. Susan Collins for voting twice “to allow drug companies to keep cheaper generic drugs off the market,” but omits the fact that Collins has supported bills intended to increase generic-drug competition and lower prescription costs.", "Collins, for example, is a co-sponsor of the Preserve Access to Affordable Generics and Biosimilars Act of 2019. She also supports and contributed to the Lower Health Care Costs Act of 2019, which seeks, in part, to prevent the blocking of more generic drugs from the marketplace.", "Plus, her Senate website says she has supported at least two other bills — which became law in 2017 and 2019 — that aim to make more, not fewer, generic drugs available.", "The campaign of Maine House Speaker Sara Gideon, a Democrat, who is running to challenge Collins for her U.S. Senate seat, began airing the ad on July 7, according to Advertising Analytics. The Maine primary election is July 14.", "“Remember this Susan Collins?” the ad’s narrator asks. That’s followed by a clip of Collins saying in a 2002 debate, “Today, there are too many of our seniors who are literally choosing between filling prescriptions and paying their bills.”", "“But,” the narrator then says, “Susan Collins took $1.5 million from drug and insurance companies” and “voted twice to allow drug companies to keep cheaper generic drugs off the market, forcing Mainers to pay 10 times more for their medicine.”", "As of June 22, Collins, over her more than two-decade Senate career, had received $1.6 million in contributions from PACs or individuals in the insurance and pharmaceutical/health products industries, according to OpenSecrets.org.", "Collins has raised a total of $36.4 million during her career. The $1.6 million from the insurance and pharmaceuticals/health products industries is about 4.4% of the total amount.", "But the ad presents an incomplete picture of her record on prescription drugs.", "One of the votes cited in the ad — and in a Gideon campaign document — is Collins’ July 2010 vote in favor of the Senate Appropriations Committee removing from an appropriations bill a provision prohibiting brand-name manufacturers from paying generic drug companies to delay introducing less expensive products into the market. The amendment to strip the provision from the bill failed on a 15-15 committee vote.", "The Collins campaign told FactCheck.org that some members of the committee objected to inserting S. 369, the Preserve Access to Affordable Generics Act, into the Financial Services and General Government appropriations bill for fiscal year 2011.", "“This proposal clearly was not under the jurisdiction of the Appropriations Committee,” Kevin Kelley, a Collins campaign spokesman, argued in an email. He noted that some lawmakers opposed inserting the generics bill into any appropriations legislation.", "But, Kelley said, Collins “has been a longtime supporter of legislation that would stop harmful ‘pay for delay’ deals that prevent cheaper generic drugs from coming to market.” In fact, Collins actually backed S. 369 as a stand-alone bill. She signed on as a co-sponsor of the bipartisan legislation promoting access to more affordable alternatives three months after it was first introduced in February 2009 by then-Democratic Sen. Herb Kohl and Republican Sen. Chuck Grassley.", "In addition, Kelley pointed out that Collins is a co-sponsor of a similar, more recent version of the bill, the Preserve Access to Affordable Generics and Biosimilars Act, that was reintroduced by Sens. Grassley and Amy Klobuchar in January 2019. In a press release, Grassley’s Senate office noted that pay-off settlements between brand-name and generic drug makers “delay consumer access to generic and biosimilar drugs, which can be as much as 90 percent cheaper than brand-name drugs.”", "The other vote cited in the ad is Collins’ May 2012 opposition to an amendment then-Democratic Sen. Jeff Bingaman proposed to the Food and Drug Administration Safety and Innovation Act. The amendment, which Bingaman sponsored along with then-Republican Sen. David Vitter, was also intended to minimize pay-for-delay agreements.", "As Kaiser Permanente’s Institute for Health Policy explained in a 2018 paper: “When brand name drug manufacturers receive a patent, which typically lasts for 20 years, they have sole rights to produce their drug. However, generic drug companies have the right to challenge the validity of a patent in order to enter the market, and have been encouraged to do so due to a provision in the Hatch Waxman Act of 1984 that grants six months of market exclusivity to the first generic drug filed to compete with a branded drug.”", "On the Senate floor, Vitter said the amendment would have changed federal law so that the first generic company to challenge a brand’s patent would only have an exclusive 180-day window to sell its drug if it won its case.", "Collins was one of 67 senators — 41 Republicans, 25 Democrats and one independent — who voted against the amendment, Kelley said, because it “would have had the opposite effect of its intended goal, making generic companies less willing to challenge patents due to higher costs and fewer potential benefits.”", "He added that Collins does support the Lower Health Care Costs Act, which passed the Senate Committee on Health, Education, Labor, and Pensions in June 2019. The bill includes a section on “preventing blocking of generic drugs.”", "“The Senate HELP Committee’s Lower Health Care Costs bill addresses this same problem but in an effective way and includes patent reforms Senator Collins authored,” he told us.", "Furthermore, press releases on Collins’ Senate website say that she has supported at least two other measures — signed into law in 2017 and 2019 — that aim to increase competition from generic drugs and lower prescription drug prices.", "Thus, the two votes highlighted in Gideon’s attack ad are far from a full representation of Collins’ record on the issue.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]