["About this rating", "A South Florida gun owner said he wanted to lead by example in turning in his AR-57 shortly after a gunman used a similar weapon to kill 17 people at Marjory Stoneman Douglas High School in Parkland, Florida.", "In a Facebook post, Ben Dickmann proclaimed that he was a \"responsible, highly-trained gun owner,\" but that \"no one without a law enforcement badge needs this rifle\" so he had \"surrendered [it] to the Broward Sheriff\":", "Mr. Dickmann spoke to NPR's Michel Martin about his decision, saying:", "It's come after a lot of soul searching. Everybody always says - you know, it's the big argument right now - everybody's offering thoughts and prayers but nothing else. And I thought, well, this is something I can do that I think is right. And it's something I can do that might spark a change. You know, my whole goal was maybe to inspire one friend on my Facebook page to do the same thing. And maybe that friend would inspire one other person. And who knows? I totally didn't expect for this to go the way it did and as fast as it did.", "After Las Vegas, I had thought long and hard about it, and thought, well, you know, it's not hurting anything sitting in my gun safe here. But it wasn't really until this last tragedy at Stoneman Douglas where it really hit home with us - and me.", "Actually, one of my friends on Facebook rather sarcastically said, well, if you really feel this way, why don't you go turn in your gun at Broward Sheriff's Office? I'll even drive you. And that's what spurred me to think. Even though he was being extremely sarcastic about it because he's a very staunch conservative, gun rights activist person, it kind of spurred me to say, you know what? Yeah, I'll do that.", "Dickmann also expressed some dismay over Florida's current gun ownership laws, asserting that \"the concealed weapons permit program here in the state of Florida, as far as I'm concerned, is a joke\" because \"Literally, it's three hours of PowerPoint, and then you go down to the range with a very, very low caliber handgun, and you have to put five out of 10 rounds on a paper plate at 5 feet. Probably half the class that I had are people that had never touched a gun before in their life.\"", "The Broward Sheriff's Office tweeted their thanks for Dickmann's Facebook post and offered information to others looking to dispose of their firearms:", "Thank you Ben for sharing this with #BSO. We have 2 options for anyone looking to dispose of a firearm. pic.twitter.com/eN85FiIWMi", "— Broward Sheriff (@browardsheriff) February 17, 2018", "Martin, Michel.   \"After Parkland Shooting, A Florida Gun Owner Gives Up His AR-57.\"\r\n    NPR.   17 February 2018.", "Sutton, Scott.   \"Ben Dickmann: South Florida Gun Owner Turns in AR-57 After Parkland School Shooting.\"\r\n    WPTV.   18 February 2018.", "Lapin, Tamar.   \"Proud Gun Owner Gives Up AR-57 After School Shooting.\"\r\n    New York Post..   18 February 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]