["About this rating", "On 6 July 2017, the Chattanooga Bystander published a report that Tennessee lawmakers had approved a bill to create a \"Hail Satan\" license plate tag:", "After Tennessee legislators passed a bill to allow residents to get license plates that bear the phrase “In God We Trust,” in the interest of religious diversity, other plates were made available that bear other religious phrases, including “Shalom,” “Namaste,” “Praise Jah” and “Hail Satan.”", "“It’s only fair,” said State Senator Brody Printrip. “We should celebrate our diversity.”", "The Chattanooga Bystander is an entertainment web site that publishes satirical content.  Tennessee lawmakers passed a bill allowing the phrase \"In God We Trust\" to appear on license plates, but this law did not create other religious tags available, such as \"Hail Satan.\" The Associated Press reported on the \"In God We Trust\" licence plates in May 2017:", "Republican Gov. Bill Haslam has signed a bill creating a new Tennessee license plate design featuring the phrase \"In God We Trust.\"", "The original version of the bill would have required the phrase to be printed on all license plates issued in the state. But after the state attorney general raised constitutional concerns, sponsors agreed to make the make the new design optional.", "The Chattanooga Bystander carried a disclaimer at the bottom of the site labeling all of its content as fiction:", "This site is satire, fiction, and intended only for those age 18 and over. Names used in articles are fictional, unless those of public figures or entities as the subject of satire.", "The Associated Press.   \"Haslam Signs Bill Creating 'In God We Trust' License Plates.\"\r\n    22 May 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]