["A video filmed from a moving vehicle shows a long queue of people lined up under a bridge holding banners and marching forward. The video is being shared on social media with the claim that it depicts a protest against the Modi government in the wake of rising religious discrimination in the country. The caption, along with the video tweeted by a user, reads, “People have taken rally to show to Modi government, that all religions people are the citizens of this country, no discrimination will be accepted.”. The tweet has garnered more than 1000 retweets so far.", "Huge protest in Nagpur People have taken rally to show to Modi government, that all religions people are the citizens of this country, no discrimination will be accepted. Plz Retweet. pic.twitter.com/trnX1Kys9y", "— Retweet Sarkar 💯 (@GoSlowplz) September 2, 2019", "A few other individuals on Twitter and Facebook have shared the video with a similar narrative.", "Facebook user Enam Qureshi posted the same video with the caption, “#Save Kashmir”, suggesting that it was a protest against the government’s move to revoke the provisions of Article 370 of the Indian Constitution. The post has garnered over 18,000 shares.", "Alt News found that protest shown in the video did take place in Nagpur but it has nothing to do an agitation against religious discrimination or Kashmir. It actually depicts a rally organised on August 25, 2019, and carried out by activists and supporters of ‘Save Merit Save Nation’ forum to stage a protest against the state government’s reservation policy. The SMSN movement began as a protest against the Maharastra government’s policy to exceed the limit of reservation in education and jobs. “Thousands of men, women, youngsters and children representing general (unreserved) category communities on Sunday opposed the state government’s policy to exceed limit of reservation in education and jobs up to 74% against the ceiling of 50% fixed by the Supreme court”, stated a Times of India report published on August 26, 2019.", "You can see a video of the rally posted by Twitter handle of Save Merit Save Nation.", "@narendramodi @Dev_Fadnavis @DrMohanBhagwat @rammadhavbjp @chitratripathii @RenukaJain6 @ravishndtv @ppbajpai #savemeritsavenation Mega Rallies at Nagpur..solapur..mumbai.. More than 50000 people on roads… government pls notice anger of common people..we want our rights pic.twitter.com/nDRuosRBPf", "— Save Merit Save Nation (@Fight4justiceA) August 25, 2019", "A video report of the same protest by Awaaz India TV can be seen posted below.", "In conclusion, a video of a rally held against the reservation policy of the Maharastra government in Nagpur was shared with two separate false claims. While the first asserted that the people were protesting against the rise of religious discrimination in the country under the NDA regime, the second claimed that it was a protest against unrest in Kashmir.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]