["By Saranac Hale Spencer", "Posted on October 31, 2017", "Q: Did Hillary Clinton leave “the country as Mueller Indictment is announced”?", "A: No. She was in the U.S. all weekend.", "Hillary Rodham Clinton spent her weekend in Washington, D.C., and New York City, not in Lviv, Ukraine, as was claimed in a story that circulated online over the weekend.", "A story with the headline “UPDATE: Hillary Clinton Leaves The Country As Mueller Indictment Is Announced” ran on several sites after it was first posted on Saturday on Freedum Junkshun, following the news that Robert S. Mueller III’s investigation of Russian meddling in the 2016 presidential election would yield its first indictments on Monday.", "The story was flagged by Facebook users as potentially false. It is.", "It said — without offering any evidence — that the former presidential candidate was leaving the country amid “speculation and rumors” that she would be indicted in the Mueller investigation. However, the only people implicated in the charges made public on Monday morning were those associated with Donald Trump’s campaign.", "Also, Clinton didn’t leave the country at all.", "She delivered a speech at the Human Rights Campaign National Dinner in Washington, D.C., on Saturday night, where she joked about being on her doctor’s order to rest her fractured foot.", "Then, she celebrated her birthday in New York City on Sunday night at Estela, which the restaurant confirmed to FactCheck.org.", "The picture that ran with the story, which claims that she left from Reagan National Airport in Washington, D.C., shows her walking through an airport with Bill Clinton and a crowd of onlookers. But that picture was actually taken in 2013 when the couple toured the airport in Little Rock, Arkansas, that was being renamed for them.", "The site that first ran the story calls itself satirical and has a disclaimer that says it “uses facts that don’t exist and relies more on imagination than the truth. In fact, there is likely no truth at all in what you will read here. All of our articles are basically a crock of doody and should be considered satirical whimsies for today’s aging conservative.”", "The name of the person who wrote the story also changed, which is a red flag for spotting fake news. The byline first appeared as Butch Mannington and was later changed to Arnold Hilter, but the bio for each is the same and credits them with only fake accomplishments. We wrote more about that in this recent story.", "Still, at least three other websites picked up the story and posted it, too, but none of them labeled it as satire.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "“UPDATE: Hillary Clinton Leaves The Country As Mueller Indictment Is Announced.” Freedumjunkshun.com. 28 Oct 2017.", "Brown, Pamela; Perez, Evan; Prokupecz, Shimon. “First on CNN: First charges filed in Mueller investigation.” CNN. 27 Oct 2017.", "Clinton, Hillary. Human Rights Campaign National Dinner. C-SPAN. 28 Oct 2017.", "Khomami, Nadia. “Hillary Clinton praises NHS after broken toe prevents interviews.” The Guardian. 16 Oct 2017.", "Estela. Hillary Clinton birthday picture. Instagram. 29 Oct 2017.", "Brantley, Max. “Bill and Hillary Clinton headline airport expansion, renaming.” Arkansas Times. 3 May 2013.", "Spencer, Saranac. “Peddling Mueller Misinformation.” FactCheck.org. 27 Oct 2017.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]