["About this rating", "As rioters continued to storm the steps of the U.S. Capitol in opposition to the 2020 election results, U.S. President Donald Trump was slow to formally address the nation about the havoc caused by his supporters. And when he finally took to social media on the afternoon of Jan. 6, 2021, his message did not outright condemn the actions of the mob, but rather expressed a fondness.", "The minute-long video was originally shared on Twitter, YouTube, and Facebook, but had been deleted by all three platforms at the time of writing.", "Before the video statement was taken down, Snopes was able to download the video and transcribe Trump's speech:", "I know your pain. Your hurt. We had an election that was stolen from us. It was a landslide election, and everyone knows it, especially the other side. But you have to go home now. We have to have peace. We have to have law and order. We have to respect our great people in law and order. We don’t want anybody hurt. It’s a very tough period of time. There’s never been a time like this where such a thing happened where they could take it away from all of us. From me, from you and from our country.", "This was a fraudulent election, but we can’t play into the hands of these people. We have to have peace. So, go home, we love you, you’re very special. You’ve seen what happens. You’ve seen the way others are treated that are so bad and so evil. I know how you feel. But go home and go home in peace.", "In response to the above tweet and others shared by the president, Twitter deleted three posts and locked the account of @realDonaldTrump for 12 hours. If the tweets are not removed, the social media platform said that his account will remain locked.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]