["Recently, a video of a crowd of demonstrators holding a mock funeral procession has been going viral on social media. The crowd can be heard chanting a Hindi slogan which translates to, “He has murderous intentions just like Lord Krishna’s uncle, Kuns.” The clip mentions that these are ASHA workers raising slogans against Madhya Pradesh Chief Minister Shivraj Singh Chouhan. A Facebook page called ‘Madhya Pradesh Congress’, a fan page of the party, posted the clip on October 22. Since then, it has garnered more than 2.7 lakh views (archived link to the post).", "The video has been linked to the upcoming bypolls in Madhya Pradesh which will decide the fate of 28 seats in the state assembly.", "Another Facebook user posted this video gathering more than 6,000 views at the time of writing (archive).", "‘मामा नहीं कसाई है, कंस का जुड़वा भाई है’", "Posted by Vibha Bindoo Dangore on Thursday, 22 October 2020", "Since the last few days, this clip has been shared by multiple users and pages on Facebook.", "The logo of ‘MP Tak’ along with the graphic plate reading ‘Satna’ can be spotted on the screen. Alt News performed a keyword search and found a video posted by the YouTube channel of MP Tak on October 5, 2018. Its description states, “Asha workers in Satna protest by taking out a funeral procession of CM Shivraj Singh Chouhan.” The demonstration was held in October 2018.", "According to a photo story by The Times of India’s E-Times dated October 4, 2018, ASHA and USHA workers demonstrated outside the chief minister’s residence in Bhopal. They were dispersed from the area when the protest turned violent. A Nai Duniya article from October 3, 2018 also ran a story on the protest. According to this report, ASHA workers alleged that they were not paid their dues despite handling the same responsibilities as Anganwadi workers and helpers. “ASHA and USHA workers of the state are angry because their honorarium has not been increased. Their resentment began the day the state government only increased the honorarium of Anganwadi workers and helpers. Now, they too are demanding a hike in their wages along with regularisation of their jobs,” per the report.", "Thus a video of a protest held by ASHA and USHA workers against MP CM Shivraj Singh Chouhan in 2018 has been falsely linked to the upcoming by-elections in the state.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]