["On January 10, India Today broadcast a sting operation where first-year French degree program student at Jawaharlal Nehru University (JNU), Akshat Awasthi, confessed his involvement in the January 5 attack. Awasthi identified himself as an ABVP activist. India Today investigation revealed three names – Akshat Awasthi (ABVP activist), Rohit Shah, and Geeta Kumari (former JNUSU president and AISA activist) – who confessed the roles they played that fateful night. The second part of the investigation, broadcast on January 11, provided details of ABVP activist Komal Sharma’s alleged involvement.", "#JNUTapes | JNU’s 1st year student confesses to leading attacks on Jan 5 Watch LIVE with @rahulkanwal: https://t.co/4fqxBVUizL pic.twitter.com/zABFDyknuj", "— India Today (@IndiaToday) January 10, 2020", "Akhil Bharatiya Vidyarthi Parishad (ABVP) National General Secretary Nidhi Tripathi issued a statement distancing the student body from Akshat Awasthi and claimed that he is not a member of the organisation, “Akshat Awasthi is neither an office bearer, nor a karyakarta of ABVP, as claimed by IndiaToday”, reads the statement.", "Akshat Awasthi is neither an office bearer, nor a karyakarta of ABVP, as claimed by @IndiaToday. This is a smear campaign run by India Today to deviate everyone from the facts put forth by @DelhiPolice proving #LeftBehindJNUVoilence.", "– National General Secretary @nidhitripathi92", "— ABVP (@ABVPVoice) January 10, 2020", "Responding to ABVP’s denial, anchor Rahul Kanwal took to Twitter and posted images of Awasthi at “an ABVP rally” on November 12, 2019.", "Akshat Awasthi now says he’s ‘not in any way associated with the ABVP.’ Here he is on the front page of national newspapers at an ABVP rally. Go on. Zoom in. He’s the one holding the tricolour. #JNUTapes Weak defences won’t fly. pic.twitter.com/dQESc9fkzP", "— Rahul Kanwal (@rahulkanwal) January 10, 2020", "Right-wing website OpIndia published a report raising questions against India Today’s investigation and Awasthi’s affiliation with ABVP. The article claimed that the photograph shared by Rahul Kanwal pertained to a rally against hostel fee hike organised by JNUSU. It is noteworthy that ABVP is not a part of the JNU students’ union.", "OpIndia traced the image to November 11, 2019, published by Manorama. “The picture used by Manorama says that the picture is from the 11th of November 2019 when the police stopped JNU students who were staging a protest over the hostel fee-hike issue. The picture was taken by Kamal Singh of PTI,” said article which was also published by right-leaning website Swarajya.", "India Today sting on JNU violence: Here is how Rahul Kanwal passed off a JNUSU activist as an ABVP member", "A detailed fact-check by @UnSubtleDesihttps://t.co/jmHBgGn2Hq", "— OpIndia.com (@OpIndia_com) January 11, 2020", "In this report, Alt News will fact-check two separate claims namely, OpIndia’s assertion that Akshat Awasthi’s presence in a JNUSU rally would suggest that he’s associated with the Left and not ABVP, and ABVP’s assertion that Awasthi is not associated with the student body.", "With a keyword search on Twitter, we found that Awasthi’s image, where he is raising the tricolour, was shared by JNU ABVP account. According to ABVP, the photograph is part of a protest organised against the proposed fee hike in the varsity. “ABVP-JNU outrightly rejects the massive fee hike since very first day,” reads its description.", "#RollBackFeeHike ABVP-JNU outrightly rejects the massive fee hike since very first day. We struggled together with each student of JNU against JNU Admin over undemocratically massively increased hostel fees. @ABVPVoice @abvptoday @ANI @Jansatta @HRDMinistry @republic @loksabhatv pic.twitter.com/2CE8MP8xPn", "— ABVP JNU (@abvpjnu) November 12, 2019", "ABVP was a part of JNUSU protests but withdrew support on November 19, 2019. According to Economic Times, ABVP backed-out after Left parties accepted HRD ministry’s decision to set up a committee to look into the issue. Since then, the RSS-affiliated body has been protesting independent of the JNUSU protests under Left-backed parties.", "OpIndia declared Awasthi a JNUSU activist because of his presence in a protest against the fee hike organised by JNUSU. But OpIndia also proved that the photograph was shot on November 11. This was when ABVP was still supporting the JNUSU protests. The website’s assertion that Awasthi’s presence in the rally organised by JNUSU automatically excludes him from being a part of ABVP doesn’t hold water.", "Alt News was also able to independently locate multiple pictures and videos of Awasthi with ABVP members. In the image posted below, he is accompanied with individuals carrying saffron-coloured ABVP scarves.", "The above image was posted by one Shivam Chaurasia on November 21, 2019. “We are detained in Parliament Street Police Station.#ABVPMarchOn #RollBackFeeHike”, reads the accompanying message. It may be noted that on November 21, 2019, ABVP members were stopped by the police near Parliament Street police station for protesting against fee hike. This image was taken inside the police station.", "In a graphic shared on his Facebook profile, Chaurasia declared himself ABVP’s candidate for councillor.", "ABVP’s Office Secretary Nawnit Kumar shared a video of their detention where Awasthi can be spotted at 52 seconds.", "Moreover, Awasthi can be seen in another video posted by ABVP Secretary Manish Jangid that same day.", "Below is the part where Awasthi is spotted amidst chants of “ABVP zindabad” and “Kanhaiya Kumar murdabad”.", "In several images posted by ABVP members (Ayush Kasana, Nishul Khrub), Awasthi is seen walking with a group wearing saffron scarves.", "ABVP’s Secretary Manish Jangid [2] and ABVP member Bharat Sharma [3] were photographed alongside Awasthi [1] in the image below.", "The video below was taken at the same location as the image. Here, Awashti can be spotted standing behind a group of people holding an ABVP banner and chanting, “Kaun lada hai ABVP, kaun ladega ABVP.”", "While ABVP has denied association with JNU student Akshat Awasthi and vice-versa, Alt News has found multiple pictures and videos of Awasthi in protests led by ABVP as well as in photographs with prominent ABVP members and office-bearers, sloganeering in support of the student body.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]