["A photo of tinned pork with a ‘halal’ stamp has been shared hundreds of times in multiple posts on Facebook and Twitter. The claim is false; the photo has been doctored to include the ‘halal’ stamp; an Islamic food standards authority in Malaysia where the tinned pork is made said the product had not been certified halal.", "The photo was uploaded in this Facebook post on July 12, 2019, and shared more than 450 times after being posted by a page called ‘Revive Australia’, which has more than 18,000 followers.", "The caption states: “Halal certified pork. Anyone still not sure halal is a scam?”", "Below is a screenshot of the misleading post:", "Halal refers to the dietary standard in Islam, which prohibits Muslims from consuming certain food, including pork.", "The label on the tinned pork in the misleading post includes a doctored stamp for the Malaysian halal certification.", "The image has also been shared on Twitter here and here, as well as here on US based website Quora with a similar claim.", "The claim is false; the tinned pork pictured in the misleading posts has never been issued halal certification.", "A Google reverse image search found an almost identical photo here on the website of Malaysian food importer Ing Lee Trading, without the halal stamp.", "Below is a screenshot comparison of the photo in the misleading post (L) and the image on the Malaysian food importer’s website (R):", "The Department of Islamic Development Malaysia (JAKIM) denied having issued halal certification to the particular pork product in this statement published on its website and in this post on its official Facebook page in 2016.", "The statement translates to English states, in part: “In reference to the picture that has gone viral, JAKIM would like to assert that it has never produced halal logo for a HARAM product like the picture that is being circulated. The result of JAKIM’s investigation at two locations (Miri & Kuching) as informed by the complainant revealed that the product is NOT in the market.", "“JAKIM does not rule out the possibility that it is a picture that is purposefully edited by putting the halal logo there. If true, JAKIM strongly condemns the act because it can create prejudice and slander towards the Malaysian Halal Certification.”", "Below is a screenshot of the Malay-language statement:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]