["The claim was shared on Facebook here on March 5, 2021.", "Part of the Korean-language claim reads: “As of March 2021, South Korea's population stood at 50 million.", "“The number of people with high blood pressure was 11 million, that of those with diabetes stood at 10 million, with asthma at 1.37 million, with cancer at 2 million, with dementia and stroke together at 1 million.", "“This means 50 percent of South Koreans suffer underlying medical conditions.”", "The post circulated as South Korea continues to administer Covid-19 vaccines and combat the spread of the virus, as Yonhap News Agency reported here on March 9, 2021. Health officials have long warned that underlying medical conditions increase the risk of severe Covid-19.", "Identical claims were also published on Facebook here, here and here.", "However, the claim is misleading.", "A review of the figures stated in the posts found they are all outdated or inaccurate.", "The number of South Koreans with high blood pressure, for instance, is estimated to be 12 million as of 2020, according to the Korean Society of Hypertension. This figure is, in fact, larger than the purported statistic noted in the misleading claim.", "The Diabetes Fact Sheet 2020, an annual study published by the Korean Diabetes Association, also states that South Korea has 4.94 million residents living in diabetes, not 10 million as the misleading posts claim. The Korean Diabetes Association figure is based on 2018 data, which is the most recent available.", "Meanwhile, South Korea’s National Health Insurance Service (NHIS) said on October 29, 2021, that 2.78 million people visited hospitals between March and July 2020 for diabetes treatment. In 2019, that figure was 2.67 million, according to NHIS.", "South Korea’s Health Insurance Review and Assessment Service said on September 3, 2019, that about 1.46 million people visited hospitals in 2018 with symptoms of asthma, which is the latest and most credible number available. This differs slightly from the 1.37 million figure noted in the misleading posts.", "The misleading posts claim that 2 million people suffer from cancer does appear to be in line with official statistics. In January 2021, South Korea’s National Cancer Center stated that there are 2.01 million cancer patients as of 2018, which is the most recent year of data collection.", "Finally, the misleading post claims the total number of people with either dementia and who have suffered a stroke is 1 million. This figure is higher than official statistics.", "South Korea’s Ministry of Health and Welfare said that the number of people with dementia as of 2018 is roughly 750,000. Meanwhile, South Korea’s National Medical Center estimates the country had 120,584 stroke patients as of 2019. Both figures are the latest and most reliable sources to date.", "The overall claim that 50 percent of South Koreans suffer from underlying health conditions is also not supported by credible sources.", "In fact, a modelling study published here in The Lancet Global Health on June 15, 2021, found that an estimated 28 percent of South Korea’s population has at least one underlying health condition that could increase the risk of severe Covid-19.", "The study, which was conducted at the London School of Hygiene & Tropical Medicine, used data from another international study on global health and UN population estimates to determine the prevalence of underlying conditions noted by World Health Organization guidelines.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]