["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "via Ohio Secretary of State, May 2016", "Republican radio host and pundit Hugh Hewitt slammed the Democratic party on a July 20 MSNBC panel, charging that the party failed the Rust Belt economically and prompted liberal voters to jump ship.", "Hewitt was part of a panel that included former Vermont Gov. Howard Dean, a Democratic presidential candidate in 2004 and a former party chairman.", "\"A million Democrats deserted Howard’s party and joined my party because of Donald Trump in Ohio this year,\" Hewitt said.", "The 2016 Republican primary was remarkable, given the 17-candidate field. Is Hewitt’s \"million\" figure right? And is Trump the reason behind a massive party switch in the Buckeye State?", "In Ohio, party affiliation is determined by what ballot a voter requests in a primary election. The voter will continue to be affiliated with that party, unless he or she requests a different party’s ballot in another primary election.", "The Cleveland Plain Dealer reported that 5 percent of voters in Ohio who cast ballots in the March 2016 primary switched from the party they were affiliated with in 2012. But many more former Democrats requested Republican ballots than vice-versa.", "Ohio Secretary of State Jon Husted released the stats that showed that in total, 1.8 million Ohio voters joined or changed parties by voting last March.", "The GOP picked up almost a million new voters to its rolls in that primary, but 910,131 of those were previously unaffiliated. According to Husted’s data, 115,762 former Democratic voters swapped for Republican ballots.", "That’s not a million.", "We asked some political scientists for their opinions.", "\"There's an old saying in the social sciences: don't mistake correlation with causality,\" said L. Marvin Overby, a political science professor at the University of Missouri. \"I would be very surprised if the voter changes were motivated by a desire among Democrats to vote for Trump.  It seems more plausible that they opted to identify as Republicans to vote in the GOP primary for (Ohio Gov. John) Kasich and against Trump, especially given that the Democratic presidential primary wasn't very competitive.\"", "Ohio’s donkeys-turned-elephants might have been reacting to Trump’s candidacy, agreed Michael C. Munger of Duke University, but it’s impossible to know for certain.", "\"Trump did not even win Ohio. Kasich hammered him by 10 percentage points. It would be odd to think of them as Trump voters, then,\" Munger said. He concurred that it makes more sense that former Democrats crossed the aisle to cast votes against Trump.", "In that case, the phenomenon was due to Trump -- but not to his advantage.", "We reached out to Hewitt but did not receive a response by the time of this publication.", "Our ruling", "As part of an MSNBC panel, Hewitt said, \"A million Democrats deserted (Howard Dean’s) party and joined my party because of Donald Trump in Ohio this year.\"", "Without polling the Dems-turned-GOP, it’s not possible to know exactly why they switched parties. But data from the secretary of state showed that 115,762 Republican ballots were cast by former Democrats.", "An impressive number -- but not a million.", "We rate the statement Mostly False.", "https://www.sharethefacts.co/share/27d58c44-005c-4df3-abaa-9f0a0534306d", "Email interview, L. Marvin Overby, University of Missouri, July 20, 2016", "Email interview, Michael C. Munger, Duke University, July 20, 2016", "Plain Dealer, \"5% of Ohio voters switched parties in March 2016 primary,\" May 18, 2016", "Columbus Dispatch, \"‘Trump effect’ in Ohio: Democrats switched to vote in GOP primary,\" May 19, 2016", "Press release, Ohio Secretary of State Jon Husted, May 18, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]