["Democrats criticized Rick Perry for college costs the day the Republican governor gave his valedictory speech to Texas lawmakers.", "Among the beefs in a Jan. 15, 2015, email blast from the Democratic National Committee: \"College tuition rates in Texas jumped by 55% since 2003, putting the dream of earning a college degree further out of reach for many Texans.\"", "That year should ring a bell; it’s when Perry and the Republican-controlled Legislature agreed to deregulate public college tuition, handing control to appointed college and university governing boards.", "Committee's source", "We wondered how much tuition ultimately escalated.", "By email, Miryam Lipper, a committee spokeswoman, pointed out a September 2012 news story in the Dallas Morning News that said by the paper’s analysis, \"Texas students are paying 55 percent more for tuition and fees at state universities a decade after lawmakers lifted restrictions on costs.\" The story also said: \"State officials used to brag about the affordability of college, but the costs have ballooned since 2003, even when inflation is factored in.\"", "Updated data", "Seeking up-to-date information, we reached out to the Texas Higher Education Coordinating Board, where a staff spokeswoman, Kelly Carper Polden, pointed out a February 2014 board document she described as the most recent publicly available report on Texas tuition and fees. The document said, in part: \"From fall 2003 through fall 2013, the statewide average total academic charges for a student taking 15 SCHs at a public university has increased by 104 percent.\" An SCH is a semester credit-hour.", "According to the document, the board’s calculations were rooted in tuition and fees charged students. Then again, the board said, a \"student's actual charges may vary based on the student's classification and level of enrollment, the college the student attends within the university, the student's specific personal circumstances, or for other reasons deemed appropriate by the institution.\"", "Charts in the board analysis indicate the tuition and fees each year from fall 2003 through fall 2013 for nearly 40 institutions, most of them in the University of Texas or Texas A&M University systems. On average in fall 2003, tuition and fees were $1,934 for 15 semester credit-hours, according to the report. The average in fall 2013 was $3,951, the board said.", "By phone, Polden confirmed the board’s results didn’t take inflation into account. So we employed a U.S. Bureau of Labor Statistics inflation calculator to estimate that tuition and fees at the state’s public colleges and universities escalated 61 percent, in real terms, from fall 2003 through fall 2013.", "But that didn’t bring us to the 2014-15 school year. So we asked for comparable charges on average for a student as of fall 2014. By email, Polden said the fall 2014 statewide average for someone taking 15 SCHs was $4,091, lifting the raw average tuition increase since fall 2003 to 112 percent. Adjusted for inflation, we calculated, the increase was 64 percent.", "UT Austin", "Separately, we asked the University of Texas at Austin for its fall 2014 charge for that many credit hours. Spokesman Gary Susswein emailed the amount, $4,905, which we compared with the fall 2003 charge for that university of $2,721. Adjusted for inflation, the hike over the years came out to 40 percent.", "Out of governor's control?", "Worth mention: After signing tuition deregulation into law, Perry subsequently had no sway over tuition hikes except to appoint higher education governing boards. In recent years too, Perry called for $10,000, four-year degree programs and for institutions to freeze tuition so an entering student would pay the same tab each year while earning a degree.", "Our ruling", "The Democratic group, zeroing in on Perry, said Texas college tuition rates increased 55 percent since 2003.", "That figure is outdated--the increase through fall 2014 was 64 percent--and it's also worth clarifying the governor didn't directly control tuition, though he approved of the 2003 law deregulating rates and appointed ruling public college and university governing boards.", "We rate the statement Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Email, Miryam Lipper, assistant press secretary, Democratic National Committee, Jan. 15, 2015", "News story, \"Texas college tuition up 55% since 2003 deregulation, analysis shows,\" Dallas Morning News, Sept. 22, 2012, last updated Feb. 27, 2013 (accessed Jan. 21, 2015)", "Document, \"Overview, Tuition Deregulation,\" Texas Higher Education Coordinating Board, Feb. 13, 2014", "News story, \"Perry pushing tuition freeze, $10,000 degrees,\" Austin American-Statesman, Oct. 1, 2012", "Emails, Kelly Carper Polden, assistant director of communications, Office of External Relations, Texas Higher Education Coordinating Board, Jan. 22, 2015", "Email, Gary Susswein, director of University Media Relations, The University of Texas at Austin, Jan. 22, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]