["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In the final months of 2020, scientists around the world raced to develop a vaccine for the novel coronavirus, which at that point had reached more than 50 million cases and resulted in the deaths of at least 1.2 million people.", "On Nov. 9, the biopharmaceutical company Pfizer announced in a news release — not a peer-reviewed journal —that interim results testing the efficacy of vaccine candidate BNT162b2 showed a 90% success rate in protecting against COVID-19 infection, making it one of the first and most promising immunization potentials to date.", "And politicians were quick to weigh in. U.S. Vice President Mike Pence said in a tweet that the public-private partnership between U.S. President Donald Trump's administration and Pfizer led to the success of the vaccine:", "While former U.S. Ambassador to the United Nations Nikki Haley, whose policies closely align with Trump, furthered the notion that the vaccine was a part of the president’s Operation Warp Speed (OWS), an effort led by the Trump Administration to accelerate the testing of COVID-19 vaccines and therapeutics:", "These claims are half-truths and misrepresent the role that OWS played in developing this particular vaccine candidate. Although the very preliminary findings of the vaccine look promising, a detailed look at the reported findings revealed that there is cause to be cautious about its availability and timeliness.", "A deal between OWS and Pfizer was announced in a July news release that outlined a bid by the U.S. government to receive 100 million doses (with the option to acquire up to 500 million more doses) of a vaccine — pending approval by the U.S. Food and Drug Administration (FDA) — for $1.95 billion.", "“Today is a great day for science and humanity. The first set of results from our Phase 3 COVID-19 vaccine trial provides the initial evidence of our vaccine’s ability to prevent COVID-19,” said Dr. Albert Bourla, Pfizer Chairman and CEO.", "“We are reaching this critical milestone in our vaccine development program at a time when the world needs it most with infection rates setting new records, hospitals nearing over-capacity and economies struggling to reopen. With today’s news, we are a significant step closer to providing people around the world with a much-needed breakthrough to help bring an end to this global health crisis.\"", "OWS is a joint effort by the Trump administration and the U.S. departments of Defense (DOD) and Health and Human Services (HHS) in response to the COVID-19 pandemic, launched on May 15 to “accelerate the testing, supply, development, and distribution of safe and effective vaccines, therapeutics, and diagnostics” by January 2021. Part of its mission is to also accelerate the vaccine approval process from the typical 73 months to just 13 months. Generally, receiving approval for a new drug or therapy is a long and tenuous process that can sometimes last years.", "Department of Defense", "OWS offered $456 million to vaccine research and development projects by Johnson & Johnson for its Phase 1 clinical trials, as well as a total of $955 million to Moderna for late-stage clinical testing. However, the $1.95 billion allocated to Pfizer was for large-scale manufacturing and nationwide distribution. In short, the government intended to buy doses of a vaccine from Pfizer once an effective vaccine was made available, but it did not fund the research and development of Pfizer's vaccine.", "“Pfizer is proud to be one of various vaccine manufacturers participating in Operation Warp Speed as a supplier of a potential COVID-19 vaccine,” Sharon Castillo, a Pfizer spokesperson, told Snopes in an email. “While Pfizer did reach an advanced purchase agreement with the U.S. government, the company did not accept the Biomedical Advanced Research and Development Authority (BARDA) funding for the research and development process. All the investment for R&D and manufacturing has been made by Pfizer at risk.”", "Technically, the work conducted by Pfizer and its partner, German drugmaker BioNTech, is an expansion of OWS and was operating under an agreement to meet the goal of OWS to deliver 300 million doses of a vaccine in 2021. As part of the agreement, the U.S. government would receive 100 million doses after the successful manufacturing of the vaccine and its approval by the FDA. However, that is not to say that the government had any hand in the research or development of the vaccine. Rather, it just agreed to buy the vaccines from the companies once they had gone through final approval.", "“We made the early decision to begin clinical work and large-scale manufacturing at our own risk to ensure that product would be available immediately if our clinical trials prove successful and an Emergency Use Authorization is granted. We are honored to be a part of this effort to provide Americans access to protection from this deadly virus,” said Dr. Albert Bourla, Pfizer chairman and CEO, at the time.", "Pfizer and BioNTech have similar agreements with the European Union.", "The specific details about the Pfizer vaccine are not readily available. What we do know is that BNT162b2 is an mRNA-based vaccine that contained SARS-CoV-2 spike protein — the same protein that nearly all vaccination studies are targeting — that allows the virus to enter human cells and elicits an immune response from its host. The first doses administered to U.S. study participants, half of whom received the vaccine and the other half a placebo, were done so in May via intramuscular injection, which is similar to the flu shot. As part of a randomized placebo trial, two doses were each given three weeks apart with the vaccine not taking full effect until at least a week after the final dose. That means that a person couldn’t expect protection until about a month after they were immunized.", "A three-dimensional simulation of the coronavirus spike protein just before binding to the human cell receptor. University of Arkansas", "An analysis of the interim results suggested that the vaccine is 90% effective in preventing the disease in study volunteers who did not have evidence of a prior COVID-19 infection — a rate that is similar to the measles vaccine administered in early childhood. No safety concerns were observed, but as the trial continues those findings could change.", "That’s because the results are based on limited data from an early clinical trial, and it’s unclear whether the vaccine prevents infection or just reduces symptoms.", "“This is a very timely and encouraging development in the race to get an effective vaccine. It is difficult to fully evaluate the interim data without more information but it appears that the vaccine is able to protect against COVID-19 disease,” said Lawrence Young, a professor of molecular oncology at Warwick Medical School. “The big question is whether the vaccine can block virus infection and subsequent transmission. This additional data will be generated as further confirmed cases are identified and analyzed.”", "The “promising” results were met with both encouragement and skepticism by the broader scientific community, which by and large said that it remains “cautiously optimistic.” First and foremost, the results are interim and still await full trial results, meaning that these are non-peer-reviewed findings that were published midway through the clinical trial. Releasing the findings in the middle of a trial may further influence the integrity of the study, potentially biasing how future study participants respond or how their observations are reported. That could in turn make long-term follow-up with adequate randomization more challenging.", "There are other important limitations to the research that must be considered. Snopes read through the a 123-page study protocol document and found that while researchers describe the more than 43,000 participants as “ethnically diverse,\" they do not specify other characteristics that may make an individual’s infection more extreme, such as age or co-morbidities. And while it is written that study participants were between the ages of 18 and 85, their exact demographics were not known. Furthermore, individuals with a high risk of severe infection were excluded from the first phase of testing and the preliminary findings did not determine how long the vaccination lasts.", "NurPhoto / Contributor", "Even after addressing the limitations, the results of an effective vaccine will not be felt immediately.", "“With the best will in the world, this vaccine – or any other vaccine currently in trials – isn’t going to change things for the majority of us this winter,” said Elenor Riley, a professor of immunology and infectious disease at the University of Edinburgh.", "“So, we all need to accept that the current public health measures are going to remain in place at least until the end of the winter, possibly longer. But if this vaccine lives up to this early promise, and other vaccines work equally well, we may be able to look forward to a much better summer and autumn in 2021.”", "If the vaccine is proven to be robustly effective at the wider community level, experts warn that there must still be public trust and buy-in — a challenge given some political leaders have been quick to dismiss the severity of the outbreak.", "Then there is the logistical challenge of manufacturing and distributing vaccines globally. First doses must be prioritized for health care workers and vulnerable populations. And a logistical challenge lies in manufacturing and rolling out a vaccine that needs to be stored and maintained at very low temperatures (-94 to -112 degrees Fahrenheit).", "As the world waits, experts warn that the promise of a vaccine cannot allow the findings to “seed complacency” and cause people to shy away from public health guidance. On the cusp of the vaccine candidate announcement, most nations in the world saw massive upticks in new coronavirus cases reported each day in October and November, according to data published by Johns Hopkins Coronavirus Resource Center. On Nov. 4, 5, and 6, the Centers for Disease Control and Prevention reported over 100,000 new coronavirus cases each day", "Pfizer applied for an emergency use authorization (EUA) of the two-dose vaccine with the FDA on Nov. 20. At this point, researchers had collected two months of safety data required to use the drug in some cases. However, that does not constitute full approval of the drug. At the time of this writing, just 94 of the nearly 44,000 trial participants had contracted COVID-19 and the study is expected to continue until at least 164 people test positive.", "Though the long-term safety and efficacy data remains to be seen, it is estimated that the manufacturers could produce globally up to 50 million vaccine doses in 2020 and up to 1.3 billion doses in 2021 to be distributed on an as-needed basis if a EUA is granted.", "The Pfizer study is estimated to be completed by Dec. 11, 2022.", "Update [Nov. 20, 2020]: This article was updated to reflect Pfizer’s official filing of a EUA on Nov. 20.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]