["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In October 2020, some Democratic registered voters in Alaska and Florida received threatening emails to “Vote for Trump or else!” from senders who posed as representatives of the far-right group the Proud Boys, and/or supporters of U.S. President Donald Trump.", "Snopes obtained two such emails from registered Democratic voters in Alaska. In both cases, it appeared that they were sent from addresses affiliated with far-right extremist groups.", "One email (left) was sent to us from an Alaskan voter whom Snopes spoke with, and who asked to remain anonymous for safety reasons. They confirmed that the email they received was sent from the email address info@officialproudboys.com. A second email (right) was sent from a self-identified “Trump Digital Soldier.” (We have redacted sensitive information, such as email and home addresses).", "It's true that such emails were sent and received, though it is important to emphasize that there is no evidence to suggest the emails were sent by any group directly affiliated with Trump. U.S. officials reported that the emails were actually sent by unknown Iranian entities whose intention was to sow political discord among American voters.", "Even so, the emails distressed some recipients.", "“When I first received it, I was appalled, and then the further I read down I was just more thinking that this isn’t real. They wouldn’t do this. And then I saw that they had my address and it just kind of overwhelmed me,\" said Rebecca Garcia, who received the email on the right, in a phone interview with Snopes.", "Election officials in Alaska and Florida confirmed in an email to Snopes that some voters had received the emails, with both officials adding that there is no evidence that either state’s voter registration system had been compromised or breached. Tiffany Montemayor, public relations manager for the Alaska Division of Elections, said that Alaska’s voter registration list is a public document that may be obtained by individuals and groups, and is available both nationally and internationally. Similarly, Mark Ard, interim communications director for the Florida Department of State, told Snopes that information provided in the submission of a Florida voter’s registration application is public record.", "In most states, voter affiliation is considered public information, and some voter information is available to researchers, political campaigns, the general public, and sometimes for purchase, according to the Cybersecurity and Infrastructure Security Agency (CISA). Such information is built by organizations using official, publicly available government voter registration and history records and compiled into national digital databases called “voter files.” Aside from party affiliation, these files may include information from political organizations and credit bureaus, which will sometimes list an individual’s address, but they do not contain information about whether someone voted in an election or whom they voted for, according to a report by Pew Research Center.", "In short, it is possible for foreign entities to acquire information about where a person lives or the party with which they are affiliated, but they will not be able to determine whether or how a person votes in the 2020 election.", "“While public data files contain voting history, it does not include any information that discloses how a voter voted in any contest. The secrecy of the ballot is maintained throughout the voting process,” said Ard.", "According to the Cybersecurity & Infrastructure Security Agency, or CISA, malicious individuals will use fake personas to impersonate real accounts or groups to trick individuals into believing misinformation. This can include forging emails, a common tactic known as “email spoofing,” whereby an entity sends an email pretending to be from a domain or organization to disseminate false or inflammatory information. This can be done by hiding the origin of an email, or by setting up a domain with a slightly different name.", "In this case, there is no evidence to suggest that the Proud Boys were involved in the email campaign. Enrique Tarrio, the chairman of the Proud Boys, told CNN that the email \"is definitely not\" from the alt-right group and was part of a spoofing campaign.", "\"We have spoken to the FBI and are working with them. I hope whoever did this is arrested for voter intimidation and for maliciously impersonating our group,\" said Tarrio.", "Tarrio added that officialproudboys.com is the URL of the group's official website, but it has not been updated in weeks and was migrated to another domain. A search through the internet archival website Wayback Machine showed that the officialproudboys.com URL was last available on Oct. 17 and no longer active as of Oct. 22.", "As of this publication, the emails were under investigation by state and federal authorities. Snopes contacted Tina Jagerson at the FBI National Press Office, who declined to comment but referred to FBI Director Christopher Wray's remarks from a press conference on election security.", "During the Oct. 21 news conference, Wray did not explicitly address the emails, instead noting that the agency is “not going to tolerate foreign interference” in elections or any criminal activity that threatens the sanctity of American votes and public confidence in the outcome of the election and affirmed that American votes will be accurately counted.", "\"When we see indications of foreign interference or federal election crimes, we’re going to aggressively investigate and work with our partners, to quickly take appropriate action,” said Wray. “We’re also coordinating with the private sector — both technology and social media companies — to make sure that their platforms are not used by foreign adversaries to spread disinformation and propaganda.", "A news release issued by the Office of the Director of National Intelligence (ODNI) the following day confirmed that two foreign actors — Iran and Russia — had taken specific actions to influence public opinion related to the election. Reports published by CBS and Vice found that the source code embedded in seven analyzed emails concluded that the messages originated from IP addresses linked to servers in Saudi Arabia, Estonia, and the United Arab Emirates. ODNI did not directly link the emails to Russia, but noted that it is aware Russia obtained voter information in 2020 just as it had in 2016.", "“First, we have confirmed that some voter registration information has been obtained by Iran, and separately, by Russia. This data can be used by foreign actors to attempt to communicate false information to registered voters that they hope will cause confusion, sow chaos, and undermine your confidence in American democracy,” said Director of National Intelligence John Ratcliffe, who added that these were “desperate attempts by desperate adversaries” meant to “intimidate or undermine voter confidence.”", "“To that end, we have already seen Iran sending “spoofed” emails designed to intimidate voters, incite social unrest, and damage President Trump. You may have seen some reporting on this in the last 24 hours, or you may have been one of the recipients.”", "Ratcliffe noted that Iran was found to also be distributing other content to include a video that falsely implied that individuals could cast fraudulent ballots, even from overseas.", "Iranian Minister Alireza Miryousefi denied the accusation in an Oct. 21 tweet.", "“These accusations are nothing more than another scenario to undermine voter confidence, & are absurd. Iran has no interest in interfering in the U.S. election & no preference for the outcome. [The] U.S. must end its malign and dangerous accusations against Iran,\" continued Miryousefi.", "Mis- and dis-information attempts aimed at sowing voter distrust persisted in the weeks leading up to the 2020 presidential contest. The Elections Infrastructure Government Coordinating Council, a committee housed under the Department of Homeland Security, noted that this election cycle was faced with “unprecedented obstacles” that are not a partisan issue. Experts asked that Americans not be alarmed by intimidating or manipulative emails, and to not spread misinformation.", "“We will not tolerate foreign interference in our elections and will continue to work with our many partners to disrupt and impose cost and consequences on any adversary that attempts to interfere in our democratic processes. The efforts the President empowered us to put toward election security these last four years are working. I will now turn it over to my colleagues to address the activities,” said DNI Director John Ratcliff in a statement.", "If criminal activity is suspected, recipients can report information to their local FBI field office. A list of those can be found here.", "Nakashima, Ellen, et al.   \"U.S. Government Concludes Iran Was Behind Threatening Emails Sent to Democrats.\"\r\n    The Washington Post.   22 Oct 2020.", "Ewing, Philip.   \"U.S. Blames Iran for Threatening Election Emails, Says Russia May Interfere Too.\"\r\n    NPR.   21 Oct 2020.", "\"DNI John Ratcliffe’s Remarks at Press Conference on Election Security.\"\r\n    Office of the Director of National Secuirty.   22 Oct 2020.", "\"Joint Statement from Elections Infrastructure Government Coordinating Council Executive Committee.\"\r\n    Cybersecurity & Infrastructure Security Agency.   22 Oct 2020.", "Owen, Tess.   \"’Proud Boys’ Emails Threatening Florida Voters Appear to Use Spoofed Email Addresses.\"\r\n    Vice.   20 Oct 2020.", "Quinn, Melissa, Becket, Stefan, Kates, Graham.   \"Emails Threatening Florida Voters to ‘Vote for Trump or Else!’ Linked to Overseas Servers.\"\r\n    CBS News.   21 Oct 2020.", "\"Russian State-Sponsored Advanced Persistent Threat Actor Compromises U.S. Government Targets.\"\r\n    Joint Cybersecurity Advisory.   22 Oct 2020.", "\"Iranian State-Sponsored Advanced Persistent Threatens Election-Related Systems.\"\r\n    Joint Cybersecurity Advisory.   22 Oct 2020.", "\"FBI Director Christopher Wray’s Remarks at Press Conference on Election Security.\"\r\n    FBI.   21 Oct 2020.", "Devine, Curt, O’Sullivan, Donie, Sidner, Sara.   \"Election Officials in at Least Two States Contact Law Enforcement After Threatening Emails Sent to Voters.\"\r\n    CNN.   21 Oct 2020.", "DeSilver, Drew.   \"Q&A: The Growing Use of ‘Voter Files’ in Studying the U.S. Electorate.\"\r\n    Pew Research Center.   15 Feb 2018.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]