["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A fake news story about girls slated for execution in Saudia Arabia appears to be the same image as an Afghan judge hitting a woman with a whip in front of a crowd in Ghor province, Afghanistan, on Aug. 31, 2015. (Reuthers/Pajhwok News Agency)", "Don’t listen to the fake news that a group of girls in Saudi Arabia will be killed for dancing at a birthday party.", "\"Saudi Arabia to Behead 6 School Girls for Being With Their Male Friends Without Parents or a Guardian,\" stated the headline on religionmind.com on Oct. 23.", "That’s not true.", "We found the story after Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news. Religionmind.com is a fake news website about various religions.", "We attempted to contact someone at the website but did not get a reply. The \"about\" section of the website states that it tries to keep the content correct, \"yet we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability ... .\"", "Here’s what the fake news story said: Fathima Al Kwaini was celebrating her birthday at a friend’s house. Tipped off by an assistant of an Imam, police arrived to find the girls dancing with their friends including males. Police arrested the girls.", "The article then states that the girls were detained for more than a year and that a male-only Sharia panel concluded that they need to be \"executed in accordance with the Sharia law.\"", "A photo in the article does not back up the narrative. It appears to be the same as a photo by Reuters/Pajhwok News Agency on Aug. 31, 2015, showing an Afghan judge hitting a 22-year-old woman with a whip in front of a crowd in Ghor province, Afghanistan.", "The article attributed some of the information to \"HRW\" without explaining what the acronym stands for. We thought it might have been a reference to Human Rights Watch, an organization that tracks human rights abuses across the globe.", "A researcher at Human Rights Watch, Adam Coogle, told PolitiFact that the story is a fabrication.", "\"Gender mixing in Saudi Arabia can lead to criminal penalties but never the death penalty,\" he said.", "So far in 2017 there have been 133 executions in Saudi Arabia, nearly all for murder or drug smuggling.", "\"In terms of executions of children, unfortunately Saudi Arabia is one of the only countries in the world that continues to sentence child offenders to death, and some have eventually been executed, but I’ve never seen an execution of anyone who is under 18 at the time of the execution,\" he said.", "In the case of this headline, there is no evidence that these girls were beheaded for being with their male friends.", "We rate this Pants on Fire.", "Religionmind.com, \"Saudi Arabia to Behead 6 School Girls for Being With Their Male Friends Without Parents or a Guardian,\" Oct. 23, 2017", "Human Rights Watch, Saudi Arabia, 2016", "Human Rights Watch, \"Dispatches: A Court-Sanctioned Lashing in Afghanistan,\" Sept. 2, 2015", "PolitiFact, \"PolitiFact's guide to fake news websites and what they peddle,\" April 20, 2017", "Interview, Adam Coogle, Human Rights Watch Middle East researcher, Nov. 29, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]