["Posts circulating on Facebook claim that colloidal silver -- silver particles in liquid -- can prevent or treat the novel coronavirus. This is false; US regulators say it is not safe for use against any disease.", "“Colloidal Silver kills the Coronavirus! I take it every morning & give it to my pets,” says one post.", "“Colloidal silver beats the corona virus: clinical documentation,” says another post, which links to a website advertising colloidal silver products.", "The post also includes an image that says “colloidal silver kills over 650 pathogens including the coronavirus.”", "Other posts, such as this one, advertise a colloidal silver product and allege that it can be used as “a shield against the COVID-19 virus,” referring to the disease caused by the novel coronavirus, which has killed more than 5,000 people worldwide.", "But Dr Helene Langevin, director of the National Center for Complementary and Integrative Health, a US National Institutes of Health (NIH) division, said these claims are inaccurate.", "“There are no complementary products, such as colloidal silver or herbal remedies, that have been proven effective in preventing or treating this disease (COVID-19), and colloidal silver can have serious side effects,” Langevin said in an emailed statement.", "“If you believe you have been exposed to, or infected with, the coronavirus, immediately contact a medical professional.”", "The NIH website warns against taking the substance as a dietary supplement.", "“In fact, colloidal silver can be dangerous to your health,” the website says.", "Side effects can include a bluish-gray skin discoloration and poor absorption of some medicines, including antibiotics, according to the NIH.", "On March 9, 2020, the US Food and Drug Administration and the Federal Trade Commission filed joint warning letters to seven companies for selling fraudulent products claiming to treat COVID-19, including a vendor peddling colloidal silver.", "The companies were given 48 hours to correct their violations and report back to the agencies.", "The toxic properties of silver are outlined on the Centers for Disease Control and Prevention website, which says that people who breathe or consume silver for long periods of time can be susceptible to skin discoloration.", "AFP Fact Check has investigated more than 100 false and misleading claims about the novel coronavirus.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]