["A total of 129 people have been arrested so far over their alleged involvement in clashes that erupted between two communities in West Bengal’s Telinipara after members of one community allegedly taunted the other as “corona”.", "On May 13, Twitter user Anand Kumar posted a set of three images with the caption, “पश्चिम बंगाल के हुगली जिले के तेलीपारा में दलित हिन्दुओं के घरों को जलाया जा रहा है। (Houses of Dalit Hindus are being burnt in Telipara in Hooghly district of West Bengal -translated)”. The images show a bleeding man and woman and burning homes.", "A few more Facebook users posted the images with the same claim.", "Image of the injured man and woman", "Alt News found that the images are unrelated to the Telinipara clashes. With the help of Google reverse image search, we found that the first two images of a bleeding man and woman were tweeted by Twitter handle Voice of Pakistan Minority on May 11. “Gulab and his wife were attacked by neighbourhood goons in Rahimyar khan, Punjab,” said the tweet. It also alleged that Gulab’s wife was sexually assaulted in public.", "Once again attack on #Hindu community, Gulab and his wife were attacked by neighborhood goons in Rahimyar khan, Punjab. His wife was sexually assaulted in front of Public. Shame on you people who are torturing minorities in #Pakistan. @KashifMD @bilalfqi @NatashaFatah @AWGoraya pic.twitter.com/4m2wfeQJqB", "— Voice of Pakistan Minority (@voice_minority) May 11, 2020", "On May 12, Dubai-based Gulf News reported, “Blood running down Gulab’s face and his wife equally injured and her clothes torn, screamed and begged for help after being attacked in Pakistan allegedly because they come from a Hindu background.”", "Moreover, we found a tweet by Pakistan’s Punjab police which said that the couple was injured in a clash over a land dispute between them and a Muslim family. The medical reports of the injured are awaited after which further legal action will be taken, according to the tweet.", "یہ بنیادی طور پر زمین کی ملکیت کا تنازع ہے جس کے ہندو اور مسلم دونوں خاندان دعویدار ہیں جس پر فریقین باہم دست و گریبان ہوئے دونوں طرف سے زخمی ہونے والے افراد کی میڈیکل رپورٹ پر کاروائی جاری ہے جس کے بعد مزید قانونی کاروائی کی جائے گی.", "— Punjab Police Official (@OfficialDPRPP) May 11, 2020", "Image of the burning house", "The image of the burning house was posted by Facebook page Pakistani Hindu Refugee on May 11. It claimed that around 21 Hindu homes were burnt in Tharparkar district in Pakistan’s Sindh region. “The source says that some people, including children, are burnt and in critical condition. This is the condition of Pakistani Hindu in Pakistan.” reads the post.", "Around 21 houses of Hindus are burnt in Tadados, Tharparkar, Sindh, Pakistan.", "The source says that some people,…", "Posted by Pakistani Hindu Refugee on Monday, 11 May 2020", "While Alt News couldn’t independently verify the images of the burning houses, the photographs of the injured couple are from Pakistan. Therefore, unrelated images of an alleged attack on Hindu minorities in Pakistan were passed off as visuals of clashes between two communities in Telinipara, West Bengal.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]