["The photo was shared here on on March 11 by a Facebook page entitled 'iDefendPH', which has more than 23,800 followers. It was subsequently shared 225 times by March 26.", "It was also shared here on Twitter on March 10. The photo shows Sara Duterte holding a poster with photos of senatorial candidates who support her father’s administration.", "Below is a screenshot of the photo:", "The text seen on the poster being held by Sara Duterte, when translated to English, says: “ALL OF THEM ARE LIARS!... DON’T VOTE!”", "A Google reverse image search traced the photo back to this report of local news site abs-cbnnews.com dated October 15, 2018.", "The article is about Sara Duterte’s filing of her certificate of candidacy to run for re-election as mayor of the southern city of Davao.", "Below is a screenshot of the report:", "The misleading photo and the original image both contain these key details: a man wearing eyeglasses behind Sara Duterte, a smiling woman in a pink hijab and a woman whose face is visible from the nose up due to the form Duterte is holding.", "Through another reverse image search, AFP established the images included on the doctored poster in the misleading post also appeared in this report on Philippine news website, Philstar.com, published on February 13, 2019.", "Below is a screenshot of the Philstar.com photos. AFP has circled the photos of the candidates who appear in the doctored poster on the misleading post.", "The candidates are: Christopher ‘Bong’ Go, Jinggoy Estrada, Ramon ‘Bong’ Revilla Jr. and Imee Marcos.", "They have all been endorsed by the regional political party, Hugpong ng Pagbabago or Alliance for Change, which Sara Duterte heads.", "President Rodrigo Duterte has also announced his personal backing of Go and Marcos. Here is a report published by Philippine news site Inquirer.net on February 14, 2019, which states Duterte gave his support to Go and Marcos.", "Estrada has said he supports Duterte's administration but he was excluded from Duterte's senatorial lineup in February 2019. Here is a report published on February 15, 2019 by Philippine new site ABS-CBN News about Estrada's political position.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]