["About this rating", "In February 2019, an image supposedly showing an eagle catching a drone was widely circulated on Facebook along with the caption \"The Picture of the Century. Nature defeats Technology\":", "This photograph received hundreds of thousands of shares on Facebook, but many viewers weren't exactly sure what this photograph depicted. Was the image created with digital editing software? Did this really capture an eagle attacking the equipment of an amateur drone photographer?", "This is in fact a genuine photograph of an eagle catching a drone. It was taken by photographer Koen Van Weel in March 2016 and documents a trained eagle from the \"Guard from Above\" company wrapping its talons around a drone during a police exercise in the Netherlands. The image is available via Getty Images. where it is presented with the caption \"An eagle of the Guard from Above company, grasps a drone during a police exercise in Katwijk, on March 7, 2016. The bird of prey can get drones from the air by catching them with his legs.\"", "A 2016 video report from BBC News showed these eagles, and other birds of prey, in action with drones:", "With reports of near-misses with aircraft, invasions of privacy and security breaches, drones are not always welcome flyers.", "And as the number of drones in the sky increases, the authorities need to be sure there is a way to bring them down without any danger to those on the ground.", "BBC Click's Lara Lewington looks at the technology being used to bring troublesome drones down to earth including one very low-tech solution being tried by police in the Netherlands -- an eagle that goes after the unmanned vehicles as if they were its prey.", "While eagles and other birds of prey are certainly capable of taking down a drone, some groups have argued that these animals are being put in danger when tasked with that activity.", "Here's an excerpt from a National Geographic article arguing against the use of bald eagles to deter drones:", "The biggest problem is the very obvious danger to the eagles. As demonstrated by the Mythbusters crew, who are among the preeminent scientific experimenters of our time, drone blades, especially carbon fiber ones, can cause serious damage to an animal. If an eagle were to misjudge its attack, or if the drone operator were to take evasive or defense maneuvers, a bird could be struck by the blades and seriously injured or killed ...", "Even if birds are well trained and are unexpectedly effective at avoiding rotors, how many eagles are we willing to risk if something goes wrong?", "Seriously, bald eagles have been through enough. Bald eagles were taken off the Endangered Species List less than ten years ago, which is about 15 minutes in evolutionary time. Humans nearly wiped them out through a combination of pesticides (primarily DDT), habitat destruction, and illegal shooting. In 1963, bald eagles hit a population low in the United States of just 487 pairs. Since then they’ve battled back and are just now repopulating old territories and establishing a stable population", "Guards from Above wrote on their website that \"animal welfare is very important\" and noted that they are currently studying the possible impact on the birds' claws:", "In nature, birds of prey often overpower large and dangerous prey. Their talons have scales, which protect them, naturally, from their victims’ bites. The Dutch National Police has asked the Dutch Organization for Applied Scientific Research (TNO) to research the possible impact on the birds’ claws. The results are not yet known. Of course, we are continuously investigating any extra possible protective measures we can take in order to protect our birds.", "BBC News.   \"The Eagle that Chases Drones.\"\r\n    5 April 2016.", "Lund, Nicholas.   \"Let’s Not Force Eagles to Fight Rogue Drones.\"\r\n    National Geographic.   5 February 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]