["Visitors enter the Alamo on Monday, Oct. 2, 2017, in San Antonio. Portions of the building were blocked off from the public so Alamo staff members could monitor the decay of the building (ANA RAMIREZ, Austin American-Statesman).", "A website intended to defend the master plan for spiffing up the Alamo says tourists remain far from wowed by the historically revered site.", "We paused at this specific claim in point No. 3 on the Alamo Truth site, which is funded by Texas Land Commissioner George P. Bush’s political campaign: \"The Alamo has been consistently listed as one of the most disappointing landmarks in our nation.\" The point closes: \"It is our simple goal to improve the visitor experience for guests and all Texans, including our students.\"", "No doubt, the Alamo has ragged edges. It’s old, man.", "Has it consistently been named one of the country’s most disappointing landmarks?", "Bush, a Republican seeking re-election in 2018, has been overseeing redevelopment of the Alamo along with the private Alamo Endowment and San Antonio city officials including Mayor Ron Nirenberg, who has said, for instance, that he favors moving the cenotaph honoring defenders who died there from its place in front of the entrance to another spot on the site.", "Aide: Do a Google", "We inquired into how Bush reached his conclusion about the Alamo as a disappointment.", "Brittany Eck, a General Land Office spokeswoman, initially urged us to Google the words \"Alamo,\" \"disappointing\" and \"landmark.\" Eck said: \"We have routinely heard feedback from people who came to the Alamo, folks saying: ‘Is this all there is?’\"", "When we ran that web search in mid-October 2017, we landed several web posts describing the shrine from the Texas Revolution in unflattering ways, though positive statements also surfaced.", "We noticed that three Texas stories including a May 29, 2017, post by Austin Culture Map headlined \"Legendary Texas landmark dissed as worst tourist trap,\" keyed off a story published May 19, 2017, on the Business Insider website specifying each state’s worst tourist trap.", "\"Remember the Alamo?\" the Texas part of the tourist-trap story says. \"More like, spend a day at the Alamo and you'll remember to never go back. The building's remains are so small they consistently disappoint visitors.", "\"History buffs might get a kick out of it for an hour or so,\" the snippet closes, \"but looking at a picture will suffice for most.\"", "In contrast, a San Antonio Express-News rebuff of that story pointed out that as of May 2017, the Alamo, by one measure, was the most-Instagrammed Texas tourist site, far outpacing the Johnson Space Center.", "The Culture Map story further noted a May 8, 2017, commentary by Alyssa Morris of the Texas Architect, published by the Houston Chronicle. During an Alamo visit, Morris wrote, she noticed that few of the site’s original features remained aside from its iconic chapel and long barracks. \"But these buildings seem curiously out of place and ignored by the high-rises and parking lots of the modern metropolis that grew up around them,\" Morris wrote. \"I texted my co-worker: ‘I don't get the Alamo. There's so little educational information here. It refuses to teach me about itself.’\"", "In May 2015, our search showed, the Thrillist website listed the Alamo among nine \"disappointingly small\" tourist sites including Mount Rushmore, Plymouth Rock and the Mona Lisa. Its story said: \"The legendary last stand at the Alamo has achieved mythical status in American/Texas history, causing most people to picture the complex as a sprawling fortress. In reality, not so much -- at least not any more. The original part of this Catholic mission that everybody visits is pretty much an underwhelming 75ft by 62ft building.\"", "Also from our web search: Comments and ratings of the Alamo as a tourist site posted on the TripAdvisor.com website including, at the top of the comments when we peeked: \"It's a landmark. It's history. It's also in the middle of town and not that informative. We thought there would be more to see. Glad there are other activities in the area.\" Generally, still, the site says that 14,300-plus visitor reviews have led to the Alamo averaging better than a four-star rating (out of five possible stars).", "Our search at Eck’s nudge otherwise turned up mixed comments about the Alamo on a 2007 Democratic Underground thread of comments including: \"I went to see it during a day pass while I was in basic training. It was one of the great disappointments of my life.\" Six years later, also from our search, responses on neogaf.com about disappointing sites included this post about the Alamo: \"Look at it for 5 seconds, then cross the street to eat overpriced tacos.\"", "So, the Alamo has proved disappointing to some visitors and to writers for a couple of online publications.", "Documented disappointment", "Following up, Eck shared an undated document she described as compiling feedback about the Alamo fielded by elected officials and others; negative articles and reviews from online publications; deeper analysis of the TripAdvisor.com ratings of the Alamo plus screenshots of negative ratings including expressions of disappointment; and negative reviews of the Alamo posted on Yelp and Facebook.", "For our part, we also queried Douglass McDonald, CEO of the Alamo Endowment. By email, McDonald said the Alamo is on his personal list of \"the most disappointing historic sites in the United States. The commercialization of this area has compromised the most important historic site in Texas,\" McDonald wrote. By phone, McDonald called the Alamo the most compromised significant historic site in the nation. He asked: \"Can you imagine having Ripley’s\" Believe It or Not \"150 feet from the front door at Mount Vernon? Or an ice cream vendor 50 feet in front of Monticello?\"", "McDonald also emailed us an undated document he described as created in response to our queries. The document presents more than 30 individual comments posted online about the Alamo from September 2016 into September 2017, all on the negative side. Per the document, one person wrote: \"Very crowded and underwhelming. Go to say you have, but don't expect it to be earth shattering.\" Another: \"Glad it's free. Really not much to see. 20 minutes and you are done.\" And: \"We did the audio tour and it just wasn't interesting. Of course, you can't go to San Antonio without seeing The Alamo. It was disappointing.\"", "McDonald summed up: \"As a museum professional, all of this is disturbing, it should be disturbing to every Texan.\"", "Our ruling", "The campaign-funded website says: \"The Alamo has been consistently listed as one of the most disappointing landmarks in our nation.\"", "We’re persuaded that plenty of visitors have commented on the Alamo’s surprising small size and how quickly a visit can pass, fueling disappointment. Of late, though, it looks like only the Business Insider and the Thrillist listed the Alamo among the nation’s most disappointing landmarks.", "On balance, we rate this claim Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context. Click here for more on the six PolitiFact ratings and how we select facts to check.", "News story, \"Alamo Cenotaph rally turns against George P. Bush’s re-election bid,\" Austin American-Statesman, Oct. 14, 2017", "Phone interview and email, Brittany Eck, press secretary, Texas Land Commissioner George P. Bush, Oct. 16-17, 2017", "Top results of Google search by PolitiFact Texas of terms \"Alamo,\" \"disappointing,\" \"landmark,\" Oct. 18, 2017", "Story, \"The worst tourist trap in every state,\" Business Insider, May 19, 2017", "Phone interview and emails, Douglass McDonald, CEO, the Alamo Endowment, Oct. 17-18, 2017", "Phone interview, Gary L. Foreman, film producer, Oct. 17, 2017", "Document listing feedback about the Alamo from elected officials, in online publications and more (received by email from Brittany Eck, press secretary, General Land Office, Oct. 17, 2017)", "Document listing negative comments about the Alamo (received by PolitiFact Texas by email from Douglass McDonald, Oct. 17, 2017)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]