["“In Houston, megapastor Joel Olsteen not opening his 18,000 seat arena to the freezing homeless,” a February 16, 2021 Facebook post said, misspelling the pastor’s last name.", "Similar posts appeared on Facebook here and here and on Instagram here and here.", "Critics also took aim at the pastor in 2017, saying he kept the church shut to those in need of help after Hurricane Harvey hit Texas.", "Osteen is a celebrity preacher, and Lakewood Church services -- which are held in a stadium where the Houston Rockets NBA team used to play -- have drawn tens of thousands of worshipers per week.", "On February 14, 2021, the church tweeted that it is “a designated Warming Center beginning today for anyone in need of shelter.”", "Osteen wrote on Twitter two days later: “If you need a warm place to stay, Lakewood is open. Hundreds arrived last night & more today due to power outages.”", "Houston’s government confirmed the church’s announcement.", "A deadly winter storm system has hit huge swathes of the United States, sending temperatures plummeting.", "Power companies in Texas have implemented rolling blackouts to avoid grids being overloaded as residents cranked up electric heaters.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]