["About this rating", "As of June 2019, Lenion Richard Barnett has court-ordered rights to temporary, limited, supervised visitation of two boys described in a divorce settlement as being \"born to\" Barnett. His ex-wife, Jessica Stallings, conceived the eldest boy when she was below the age of consent, meaning a statutory rape was perpetrated against her in that instance.", "Despite two formal investigations of rape and incest allegations against Barnett, one of which led to the empanelment of a grand jury, Barnett has never been convicted, or even indicted, on charges of rape or incest.", "We have not found evidence that Barnett is the biological father of Stallings' eldest son, despite searching court records, as well as requesting such evidence from Stallings' attorney and Alabama's Ninth Judicial Circuit district attorney.", "In June 2019, news outlets throughout the United States, and beyond, reported on the case of Jessica Stallings, a 32-year-old Alabama woman who claimed she was suffering the consequences of the state's failure to legally prevent rapists from visiting or having custody over the children of their victims.", "On 12 June, for example, the Monroe, La., television channel KNOE posted an article with the headline \"Alabama Court Forces Rape Survivor to Allow Rapist to Have Visitation With Children,\" which reported that: \"A 32-year-old woman in Birmingham, Alabama says the state's laws have forced her to face the man she says raped her again and again.\"", "As part of an 11 June interview with Stallings, who in that instance was identified only by her first name, the Birmingham, Ala., television channel WIAT reported that:", "\"... [Stallings] was impregnated four times. At 14, she miscarried. At 16, she had a baby boy. At 18, she had her third child. He later died due to a disease common in cases of incest. At 19, Jessica had her youngest son. She says her family threatened her to ensure she stayed home and the nature of her children's conception remained secret ...", "\"Her accused rapist has been taking her to court, and winning, for visitation rights of her sons. The man that raped Jessica currently has visitation rights to her two children. The judge told Jessica for each visit she denied her rapist, she'd have to spend 48 hours in the county jail.\"", "A day earlier, on 10 June, the London Independent published a report with the headline \"Rape Survivor Fighting Rapist for Custody of Child in Alabama.\" That report was actually a re-publication of a 9 June article by the Washington Post, in which Stallings allowed her full name to be used. The Post reported that:", "\"...[Stallings] said she was 12 when her mother’s half brother began climbing into her bed at night. Before she turned 18, she had endured four pregnancies. The first ended in miscarriage, and one son died of a disease more likely to occur in cases of incest. Then her family forced her to marry her uncle, she said. Stallings later fled, and a court deemed the marriage illegal because of a 'familial relationship.'", "\"She built a stable home in Fort Payne, Ala., for her sons, now 15 and 12. But in the winter of 2017, she discovered that she was not yet free of the man she calls 'Uncle Lenny.' Despite DNA tests that proved incest, he maintained parental rights to the boys and fought Stallings for visitation. A judge ruled he was entitled to see them for three days during Christmastime.", "\"Her uncle — Lenion Richard Barnett Jr., 39 — could not be reached for comment, and his attorneys declined to speak about his case with Stallings. 'It’s sickening,' Stallings said. 'I’ve spent my entire life scared to death of my rapist, and now, I’m fighting him for custody of my children.'\"", "These accounts of Stallings' plight prompted widespread reaction on social media, as well as multiple inquiries from Snopes readers about the full facts surrounding the case.", "The news articles that surrounded Stallings' public statements in June 2019 contained a significant degree of accuracy. Stallings and Barnett were indeed engaged in a child-custody and visitation dispute, as of June 2019, and documentary evidence exists that demonstrates one of the children in question was born as a result of a statutory rape perpetrated against Stallings.", "However, in several instances those news reports failed to provide readers with important contextual information, or to fully reflect the nuance and complexity involved in what is a difficult, long-running legal saga involving very serious allegations of rape, assault, family breakdown, mental illness and drug abuse.", "2002-2009: Births, marriage, divorce", "(The following explication of the facts was taken from multiple Alabama court records, which Snopes obtained. Where there is a dispute or uncertainty over a claim or allegation, we note that. Snopes usually does not name survivors of rape and sexual assault, but we are naming Stallings in this article because she herself has decided to speak publicly).", "The visitation and custody dispute between Stallings and Barnett relates to two boys, aged 12 and 15 as of June 2019. Stallings gave birth to the younger boy in August 2006 and the older boy in July 2003. Stallings herself was born in April 1987, meaning she was 16 years old at the time her older son was born. Stallings turned 16 less than three months before giving birth to the boy, so by biological necessity she was 15 years old at the time of his conception. In Alabama, the age of consent is 16, as it was in 2002. These facts demonstrate that Stallings was, on at least one occasion, the subject of a statutory rape.", "She has alleged that Barnett raped her repeatedly throughout her teenage years. We asked Barnett's attorney whether he denied these allegations, but we did not receive a response in time for publication.", "According to a later court filing by Stallings, Barnett was not listed as the father of either boy on their birth certificates. (We asked Stallings' current attorney if we could view a copy of the birth certificates, but the attorney declined).", "In January 2008, Stallings and Barnett were married at the Jackson County Courthouse in Scottsboro, Ala. At the time, Stallings was 20 and Barnett was 27. By August, Stallings sued for divorce. In a court filing, her attorney at the time wrote that Stallings and Barnett had \"become incompatible in their tastes, natures, views, likes and dislikes and their outlooks have become widely separated and divergent\" to the extent that \"it is impossible for them to live together as husband and wife.\"", "In filing for divorce, Stallings did not state (as she later would) that she was coerced or pressured into marrying Barnett in the first place, nor did she make any allegation of rape against Barnett in any court filing associated with the divorce. (In March 2009, while the divorce was being processed, DeKalb County District Court records show that Stallings did apply for and obtain a restraining order against Barnett, claiming that he had sent her threatening text messages, had threatened to physically attack her and her boyfriend, had physically assaulted her in the past, and had threatened to kill her if she did not sign over custody of the children).", "Their divorce was finalized in November 2009. Under the terms of the divorce settlement, to which both Stallings and Barnett agreed, the two boys were described as \"born to the parties\" — that is, their children together. Barnett was given primary custody of the boys, while Stallings was given visitation rights on every second weekend, for a week around Christmas, a week during Spring Break and a week during June. Stallings and Barnett also divided up their custody of the boys on holidays such as Thanksgiving and on various birthdays.", "None of the June 2019 news articles about this case mentioned the fact that when Stallings and Barnett were divorced in 2009, Barnett — rather than Stallings — was given primary custody of the boys. Neither did the articles mention that, in filing for divorce, Stallings provided several grounds, but she never cited Barnett's alleged repeated rape as one of them. These facts certainly do not mean Stallings' 2019 allegations are not true, but they are relevant pieces of background information that would have provided readers with additional context and better reflected the complicated, long-running nature of Stallings' and Barnett's court battles.", "2010-2017: Barnett's criminal activities, Stallings gains custody", "According to court records, Barnett was arrested and indicted on several criminal charges between 2010 and 2012, in both Alabama and Tennessee, including theft, assault and reckless endangerment. In one August 2010 incident, the Hamilton County Sheriff's Office said Barnett had attacked a corrections officer and attempted to take the officer's weapon, while he was being transported to a mental-health hospital in Tennessee, before he fled into nearby woods. In 2014, Barnett was found not guilty \"by reason of mental disease and defect\" of two car thefts in Alabama, after he was diagnosed with depression and schizophrenia. His attorney in the theft case said Barnett had told her he had been hospitalized at three other psychiatric facilities in Alabama.", "Barnett's criminal activities and mental-health difficulties brought about a major development in the decade-long legal dispute between Stallings and Barnett, when Stallings petitioned the juvenile court in DeKalb County, seeking to change the custody arrangement in place between the two. The juvenile court records are sealed, but we have a reliable overview of what transpired after 2012, based on a summary published by the Alabama Court of Civil Appeals in April 2018:", "\"In April 2012, [Stallings] filed in the DeKalb Juvenile Court ('the juvenile court') an emergency motion for custody of the children; she also filed two form complaints, which initiated a separate action for each child, seeking to have the children declared dependent and in which she alleged that [Barnett] had been arrested in Tennessee, had recently been committed to and released from a mental-health-care facility, had a history of mental-health issues and drug use, and, at a recent visitation, had 'attempted to fight' the mother.\"", "So based on Barnett's arrests, incarceration, and hospitalization, Stallings sought in 2012 to have the juvenile court declare the children dependent — a step commonly taken by juvenile courts when a legal guardian or parent, for various potential reasons, can no longer take care of a child — and also asked the court to give her custody of the children. She succeeded in taking over primary custody of the two boys, with Barnett retaining certain visitation rights, essentially reversing the arrangement that had been in place since the 2009 divorce settlement.", "The boys appear to have lived primarily with their mother since 2012, but further legal wrangling began in 2015, when Barnett petitioned the juvenile court to vacate the custody arrangement it had ordered three years earlier. This particular dispute was rather technical in nature, centering on whether the juvenile court had properly disposed of the request for a dependency declaration, before resolving the custody dispute. Both parties argued their cases before the juvenile court until 2017, when the matter was elevated to the Alabama Court of Civil Appeals. In April 2018, that court sided with Barnett's argument and voided the juvenile court's 2012 order.", "2017-2019: A new custody battle", "In 2017, two separate but parallel proceedings began. On the one hand, Stallings reported to the DeKalb County Sheriff's Office an allegation that Barnett had repeatedly raped her. The Sheriff's Office and the office of Alabama's Ninth Judicial Circuit Court (which covers DeKalb County) launched an investigation into those allegations.", "Bob Johnston, chief deputy district attorney for the Ninth Judicial Circuit, told Snopes that, \"There was no new information that would justify an additional presentation to the grand jury.\" Stallings had made similar allegations of rape and incest against Barnett in 2015, allegations that she told the Washington Post she had made \"soon after the custody fight began.\" Those claims led to an earlier formal investigation and the empanelment of a grand jury. That grand jury decided not to indict Barnett in December 2015.", "On the other hand, Stallings took significant new steps, in civil court, to counteract Barnett's efforts to change the custody arrangement in place since 2012, when DeKalb County Juvenile Court gave Stallings primary custody of the two boys.", "In January 2018, she petitioned the DeKalb County Circuit Court to annul her marriage to Barnett (declare it \"void ab initio,\" or invalid from the outset), and thereby to also void the 2009 divorce decree. Stallings argued that the 2008 marriage had been incestuous, because Barnett is her mother's half-brother and therefore her own uncle \"by half-blood,\" which falls under Alabama's legal definition of incest.", "The DeKalb County Circuit Court agreed to temporarily pause enforcement of the divorce decree, but as of June 2019 it had not given a final or permanent judgement on the validity of the marriage (and therefore the divorce settlement). This was in contrast to claims in various news reports that the court had \"deemed the marriage illegal.\"", "When the Court of Civil Appeals gave its ruling in April 2018, Stallings escalated her efforts to obtain custody of the boys. Because the appeals court vacated the juvenile court's 2012 ruling (which gave Stallings primary custody), the only legitimate custody order in place would be the one contained in the 2009 divorce settlement, which gave Barnett primary custody. So while the court was considering Stallings' motion to declare the marriage (and divorce settlement) void, she filed another motion in April 2018, this time asking the court for pendente lite custody — that is, for her to be given temporary custody of the children while the court decided on her underlying request to declare the marriage and divorce decree void.", "At the end of May 2018, Circuit Judge Shaunathan Bell ordered that, until a further hearing in September, the children would remain placed with Stallings, with Barnett allowed four hours of supervised visitation per week, at a Fort Payne facility operated by the DeKalb County Children's Advocacy Center.", "In November 2018, Stallings and Barnett (through their respective attorneys) appeared to have come to a new unwritten arrangement in which Stallings retained primary custody of the boys, but Barnett was allowed a measure of unsupervised visitation rights. (No record of that agreement exists in the case docket, but Bell referenced it in a June 2019 ruling).", "On 30 May 2019, Barnett was arrested in Fort Payne, Ala., on suspicion of possession of a controlled substance and drug paraphernalia. As a result, Stallings filed a new motion, asking Bell to set aside the unwritten November agreement that allowed Barnett unsupervised visitation of the children, claiming that her 12-year-old son had been in Barnett's car with him when Barnett was arrested.", "We repeatedly asked Fort Payne Police Department for details of Barnett's arrest, making several requests for a copy of the incident report. Unfortunately, we did not receive a substantive response in time for publication, meaning we cannot verify the boy's having been present with Barnett at the time of the arrest.", "On 18 June 2019, Bell ordered Stallings and Barnett to return to the arrangement he had previously set down, meaning the boys would continue to be placed with Stallings for the foreseeable future, but Barnett would again be allowed four hours of supervised visitation per week. Bell scheduled what he called a final hearing on the underlying question of the validity of the 2008 marriage and 2009 divorce settlement, to take place on 12 August.", "The core claim made in multiple news reports in June 2019, and the claim submitted to Snopes for verification, was that a judge in Alabama had ordered a rape survivor (in this claim, Jessica Stallings) to allow the man who raped her (in this claim, Lenion Richard Barnett) to have visitation rights over her children.", "There is no doubt that DeKalb County Circuit Judge Shaunathan Bell has ordered that Barnett must temporarily be given limited rights to supervised visits with the two boys at the center of this case. (What the June 2019 news reports failed to mention was that Bell's order did not come out of the blue, but rather after a decade of intensive and difficult legal wrangling between Stallings and Barnett, beginning with a 2009 divorce settlement that actually gave Barnett primary custody of the boys).", "It's also true that Stallings' eldest son was conceived when she was under the age of consent, meaning that she can be accurately described as a survivor of statutory rape. Furthermore, Barnett has repeatedly claimed visitation rights over that boy, based on a 2009 divorce settlement that described the children as being \"born to\" Barnett and Stallings. Clearly, this could lead a reasonable person to conclude that Barnett has, by implication, admitted to perpetrating a statutory rape against Stallings.", "However, a man's claim or admission to being the legal father of a particular child, in the context of a custody dispute and divorce settlement, does not constitute physical evidence that he is the biological father of that child. DNA testing could establish Barnett's biological paternity of Stallings' eldest son, but it's not clear whether such DNA test results exist, or what they show, despite widely repeated claims in the June 2019 news coverage that DNA tests had \"proven incest.\"", "We asked Stallings' attorney to provide any documentation, including DNA test results, which demonstrate that Barnett is the biological father of the two boys in question. The attorney declined to do so. We later asked the same attorney whether she or Stallings had possession of any such DNA test results. Stallings' attorney told us that DNA testing had formed part of the criminal investigation into her client's allegations against Barnett, but that she herself was \"not privy\" to that investigation.", "We asked the the Ninth Judicial Circuit District Attorney Office whether, as part of the investigations into Barnett, a DNA sample had been taken from him, whether testing had been done to check if he was the biological father of the children in question, and what the results of those tests were. Chief Deputy District Attorney Johnston told us, \"It would be inappropriate for me to comment upon the evidence/lack of evidence ...\"", "In May 2018, Stallings' attorney argued in a court filing that:", "\"... DNA testing can establish the blood relationship between [Stallings] and [Barnett] as well as whether or not [Barnett] is the biological father of the children. It is the understanding and belief that there has been DNA seized as part of the criminal investigation.\"", "As of 24 June 2019, no DNA test results demonstrating that Barnett is the biological father of Stallings' eldest son had been submitted to the court as part of the ongoing custody dispute between the two, and neither Stallings' attorney nor the District Attorney's Office could provide Snopes such test results. Until and unless such results become available, we cannot verify the claim that Barnett perpetrated a statutory rape against Stallings, because we cannot verify whether Barnett is the biological father of Stallings' eldest son.", "This might seem an odd conclusion, given that Barnett himself has repeatedly claimed custody over both boys, based on a 2009 divorce settlement that described the children as being \"born to\" Barnett and Stallings. However, the specific claim of statutory rape is contingent upon Barnett's biological paternity of the eldest boy, and so far we have found no physical evidence of that.", "More broadly, Stallings has claimed that Barnett repeatedly raped her over the course of her teenage years. However, despite two formal investigations of those rape and incest allegations, one of which led to a grand jury being empanelled, Barnett has never been convicted, or even indicted, on charges of rape or incest.", "KNOE.  \"Alabama Court Forces Rape Survivor to Allow Rapist to Have Visitation With Children.\"\r\n  12 June 2019.", "Rankin, Malique.  \"Rape Survivor Says State's Laws Surrounding Parental Rights for Rapists Failed Her.\"\r\n  WIAT.  11 June 2019.", "Wax-Thibodeaux, Emily; Crites, Alice; Tate, Julie.  \"Rape Survivor Fighting Rapist for Custody of Child in Alabama.\"\r\n  The Independent.  10 June 2019.", "Wax-Thibodeaux, Emily.  \"In Alabama -- Where Lawmakers Banned Abortion for Rape Victims -- Rapists' Parental Rights Are Protected.\"\r\n  The Washington Post.  9 June 2019.", "Code of Alabama/Justia.com.  \"Title 13A, Chapter 6, Article 4, Section 13A-6-67 -- Sexual Abuse in the Second Degree.\"\r\n  Accessed 24 June 2019.", "DeKalb County Circuit Court (Alabama).  \"Jessica Lorraine Stallings vs. Lenion Richard Barnett, Jr. -- Plaintiff's Response to Defendant's Motion to Stay.\"\r\n  28 May 2018.", "DeKalb County Circuit Court (Alabama).  \"Jessica Lorraine Stallings vs. Lenion Richard Barnett, Jr. -- Complaint.\"\r\n  27 August 2009.", "DeKalb County Circuit Court (Alabama).  \"Jessica Lorraine Stallings vs. Lenion Richard Barnett, Jr. -- Divorce Decree.\"\r\n  12 November 2009.", "Atkinson, Janice.  \"Assault Suspect Still at Large.\"\r\n  Hamilton County Sheriff's Office (Tennessee).  20 August 2010.", "Willingham Thomas, Judge Terri.  \"L.R.B. v. J.C (2170306, 2170307) -- Opinion.\"\r\n  Alabama Court of Civil Appeals.  20 April 2018.", "DeKalb County Circuit Court (Alabama).  \"Jessica Lorraine Stallings vs. Lenion Richard Barnett, Jr. -- Motion to Void Judgment and Declare Marriage Void ab Initio.\"\r\n  5 January 2018.", "Code of Alabama/Justia.com.  \"Title 13A, Chapter 13, Article 3, Section 13A-13-3 -- Incest.\"\r\n  Accessed 24 June 2019.", "DeKalb County Circuit Court (Alabama).  \"Jessica Lorraine Stallings vs. Lenion Richard Barnett, Jr. -- Plaintiff's [Motion] for Pendente Lite Custody.\"\r\n  24 April 2018.", "DeKalb County Circuit Court (Alabama).  \"Jessica Lorraine Stallings vs. Lenion Richard Barnett, Jr. -- Order.\"\r\n  29 May 2018.", "DeKalb County Circuit Court (Alabama).  \"Jessica Lorraine Stallings vs. Lenion Richard Barnett, Jr. -- Order.\"\r\n  18 June 2019.", "DeKalb County Circuit Court (Alabama).  \"Jessica Lorraine Stallings vs. Lenion Richard Barnett, Jr. -- Motion to Set Aside Agreement and Suspend Visitation.\"\r\n  13 June 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]