["A 2012 story about former President Barack Obama’s birth certificate is, somehow, getting new traction as Facebook users share it. But we reluctantly welcome it to our archive of mistruths about the 44th president’s citizenship.", "The story, posted on Occupycorporatism.com, has this headline: \"Obama’s lawyers officially admit birth certificate is fake.\"", "It goes on to say that \"lawyers for the Obama Administration announced that Barack Obama’s long form birth certificate was a forgery\" and \"Alexandra M. Hill, representative defense attorney for Obama, made comments that brought the Tea Party members to question the legitimacy of Obama’s birth certificate.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This inaccurate story seems to stem from coverage of a 2012 lawsuit filed by two New Jersey residents challenging Obama’s eligibility to appear on the state’s presidential primary ballot.", "Plaintiff’s attorney Mario Apuzzo got to the heart of the complaint during an April 2012 court hearing:. \"\"What evidence does New Jersey have that this person who is running for president is who he is?\" Apuzzo said, according to an April 10, 2012, story in the Home News Tribune, a daily paper serving Middlesex County. .", "Presiding at the hearing, Judge Jeff Masin indicated how he would rule in the case, according to the Tribune, by saying that past court rulings determined that children who are born in the United States but have parents who are not from the United States are considered natural-born citizens. Masin said he would consider whether Hawaii-born Obama, whose father was not from the United States, needed to do more to prove to the state’s elections division that he qualifies to run for president. But he forwarned he would not be considering the authenticity of the birth certificate the president posted online as he made his decision.", "The Obama campaign sent a lawyer, Alexandra Hill, to that hearing.", "Describing Hill’s statements during that hearing, conservative columnist Diana West wrote later that month that Hill \"couldn’t have been more adamant about not citing the online birth certificate as a means of proving the president’s identity in this recent challenge.\"", "\"Indeed, she called the Internet image ‘legally irrelevant,’\" West wrote, \"arguing that New Jersey law doesn’t specifically call for a birth certificate to quality a presidential candidate for the ballot.\"", "But we couldn’t find any evidence that Hill admitted Obama’s birth certificate was fake, as the story we’re fact-checking claims. And this is already well-trodden territory. Back in 2012, Snopes debunked the allegation that Obama lawyers said his birth certificate was a forgery.", "Because — one more time now! — it’s not. Obama is not a Muslim from Kenya. According to the president and independent biographies, he’s a Christian who was born in Honolulu. And we’ve carefully documented his Hawaii birth certificate. You can read our guide here.", "We rate this story Pants on Fire!", "Occupycorporatism.com, Obama’s lawyers officially admit birth certificate is fake, April 20, 2012", "PolitiFact, All Obama birth certificate statements, visited Jan. 27, 2020", "Home News Tribune, Suit challenging Obama seems unlikely to gain, April 10, 2012", "Waycross Journal-Herald, Online birth certificate fraudulent?, April 21, 2012", "The Evening Telegram, Is Obama disowning online birth certificate?, April 27, 2012", "Snopes, Obama officially ineligible, June 6, 2012", "PolitiFact, Obama is Muslim, audience member says to Donald Trump — in 2015, Sept. 18, 2015", "PolitiFact, PolitiFact’s guide to Obama’s birth certificate, April 27, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]