["About this rating", "In July 2017, Sen. John McCain (R-Arizona) cast the decisive \"No\" vote to kill a bill that would have repealed key parts of the Affordable Care Act, also known as the ACA or Obamacare, seemingly stopping a years-long push to take down the health care law in its tracks.", "Not long after that, disreputable web sites with names like \"AmericanNews88\" and \"Spinzon\" published stories, in extremely broken English, that reported Sen. John McCain (R-Arizona) had admitted that his \"no\" vote on repealing the Affordable Care Act had been nothing but an accident:", "Representative John McCain stunned the whole nation by voting NO on the Obamacare annul on the Senate floor a few days ago, yet despite the fact that he made a flood of new fans from the left, he is currently saying he committed an error, and that his cerebrum tumor is to mind.", "“I quickly lost my faculties, and truly couldn’t recollect which route was up, and which was down,” said McCain, talking from his home, where specialists have put him on bedrest. “That is to say, obviously, to vote TO cancel it, similar to the arrangement. As I’ve specified some time recently. Nothing Republicans like accomplishing more than screwing the whole nation, thus normally I ought to have offered a go-ahead. I swear I did. This mind tumor is truly incurring significant damage.”", "These sites do not display disclaimers labeling their content as fiction, and in fact the name of at least one of them (AmericanNews88) is an overt nod to the white supremacist set. (\"H\" is the eighth letter in the alphabet, and \"88\" is shorthand for \"HH\", which stands for \"Heil Hitler\". It is frequently used in conjunction with the number \"14,\" which is short for \"14 words\", which generally references a phrase coined by white nationalist and pyramid prophesier David Lane: \"We must secure the existence of our people and a future for White Children.\").", "Both AmericanNews88 and Spinzon are in the ecosystem of \"news\" sites that frequently publish stories about former President Barack Obama and his family, as well touching on topics as diverse as the Clintons, migrants, and angry liberals. None of their stories appear to contain much truth, and some verge on outright slanderous. In the case of McCain's accidental \"no\" vote, the text is a nearly verbatim copy of a hoax story that was originally published by the entertainment web site EmpireNews.net on 29 July 2017.", "AmericanNews88 made a few changes, such as changing the word \"shocked\" to \"stunned,\" \"repeal\" to \"annul,\" and \"wave of new fans\" to \"flood of new fans,\" but the structure and sentiment of these two stories are otherwise identical.", "Empire News is a well-known fake news web site that has a long history of publishing misinformation. That web site, unlike the other tow, does have a disclaimer:", "Empire News is intended for entertainment purposes only. Our website and social media content uses only fictional names, except in cases of public figure and celebrity parody or satirization. Any other use of real names is accidental and coincidental.", "However, Sen. Ron Johnson (R-Wisconsin) truly did say that McCain's health may have been a contributing factor in the Senator's \"no\" vote:", "\"Again, I'm not gonna speak for John McCain — he has a brain tumor right now — that vote occurred at 1:30 in the morning, some of that might have factored in,\" he continued.", "Seemingly shocked, a radio host responded \"really?\" to Johnson's comments and asked if he really believed McCain's brain tumor might have factored into his judgment.", "\"Again, I-I-I don't know exactly what — we really thought — and again I don't want speak for any senator,\" Johnson responded. \"I really thought John was going to vote yes to send that to conference at 10:30 at night. By about 1, 1:30, he voted no. So you have talk to John in terms what was on his mind.\"", "A spokesperson for McCain issued a statement in response to Johnson's remarks:", "It is bizarre and deeply unfortunate that Senator Johnson would question the judgment of a colleague and friend. Senator McCain has been very open and clear about the reasons for his vote.", "Conway, Madeline.   \"Ron Johnson Suggests McCain's Brain Cancer Could Have Affected Health Care Vote.\"\r\n    Politico.   9 August 2017.", "Kaczynski, Andrew.   \"GOP Sen. Ron Johnson: McCain's Brain Tumor Might Have Been Factor in No Vote on Health Care.\"\r\n    CNN.   9 August 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]