["President Barack Obama has yet to formally roll out his 2014-15 budget, but it is already notable for one idea that won’t be in it. Something called chained CPI, or consumer price index, has become a flashpoint in the debate over the deficit and spending on entitlement programs. It is a technical shift that would affect everything from how much the government bumps up government payments to how it calculates the taxes we owe.", "Put simply, using chained CPI would save the government money (and cost you some money).", "The president included a version of chained CPI in last year’s budget. Excluding it this year avoids a fight within Democratic ranks over preserving the value of Social Security.", "The move caught the attention of the Sunday talk shows. David Gregory, host of NBC’s Meet the Press prodded his panel of analysts, saying both parties were in campaign mode.", "\"Yes. And it's all bad for the country,\" said David Brooks, a columnist for the New York Times. \"Chained CPI would save a trillion dollars in the second decade off the federal budget debt.\"", "We decided to take a closer look at Brooks’ figure. But first, a little bit about this thing called chained CPI.", "Seeking an accurate way to track inflation", "Chained CPI matters because so many bits and pieces of the government’s business are indexed to inflation. The list includes tax brackets, pension benefits, the cut-off point for tax credits, who’s eligible for food stamps, and most prominent of all, Social Security benefits.", "The aim of all this indexing is to keep everything in line with the actual cost of living. If a retiree has $100 to spend on groceries today, 15 years from now he or she should be able to buy the same amount of food even if prices went up.", "The problem is, economists generally agree that the way the government measures inflation today exaggerates inflation by a tiny bit. The technical problem is that as prices of some goods and services rise, people will change what they buy. Chained CPI adjusts for that.", "The Congressional Budget Office, the nonpartisan analysts for Congress, calculated that chained CPI is about one-fourth of 1 percent less than the measure in place today.", "It hardly sounds like much but over time, the impact builds. Depending on how much you earned, when you retire and how long you live, the Center for Budget and Policy Priorities, a group focused on preserving government programs for less affluent Americans, estimated it would reduce benefits by 1 to 2 percent over the course of the average retirement.", "Defenders of Social Security don’t like chained CPI because it reduces the amount of those monthly checks. Anti-tax groups don’t like it because shifting tax brackets would, bit by bit, increase people’s income tax bills.", "But from a deficit reduction perspective, chained CPI has plenty of fans. They often point to the CBO estimate that over 10 years, the change would reduce the accumulated deficit by $340 billion -- $216 billion in lower spending plus $124 billion in higher tax revenues. About half of that lower spending would come from Social Security.", "The source of the $1 trillion", "We tried to reach David Brooks to determine the source of his claim and we didn’t hear back. He did not get it from the CBO because that group has provided no estimate beyond 2023. (Brooks clearly spoke about savings taking place in the \"second decade.\")", "We found the $1 trillion figure in publications from the Committee for a Responsible Federal Budget, a group that advocates for aggressive steps to cut deficits. In a fact sheet, the group wrote, \"The chained CPI would reduce the deficit by over $1 trillion in the second decade.\"", "\"I will caution that the estimate is not an official CBO cost estimate,\" Jason Peuquet, a research fellow at the committee, told us.", "Peuquet said the number was derived from several government sources including the CBO and the Social Security Administration.", "\"So it is grounded in the best projections available.\" he said.", "But projecting so far out is perilous.", "CBO sometimes goes beyond a typical 10-year window, but it offers many caveats when it does. In a long-term projection for Social Security, for instance, CBO ran 500 different scenarios. It stood by the general direction of its conclusions but not the specific numbers.", "That said, the figure Brooks used might be close.", "Paul Van de Water, a senior fellow at the Center on Budget and Policy Priorities, compared the $1 trillion to the CBO’s estimate for using the chained CPI across all government activities.", "\"Under such a proposal, an estimate of $1 trillion for the second 10 years is probably in the ballpark,\" van de Water said.", "However, Van de Water underscored that there is a substantial difference between the across-the-board policy the CBO evaluated and what Obama had in his budget last year and is dropping this year.", "In 2013, the president exempted programs for low-income people and offered extra payments for Social Security recipients who had been on the rolls a long time. Van de Water said the total 10-year savings would have been about $100 billion less.", "When Brooks talked about the impact of the president’s new budget, he was not comparing it to the last one from the White House.", "\"Brooks is roughly accurate about the theoretical savings but has somewhat overstated the savings from the proposal that the Administration actually put on the table,\" Van de Water said.", "Peuquet also offered one reminder. He said that Brooks would have done better to have spoken of reducing deficits -- the government’s yearly gap between what it spends and what it takes in -- rather than the nation’s debt, which is the accumulated money it owes to lenders.", "Our ruling", "Brooks said that using the chained CPI would reduce U.S. debt by $1 trillion in the period of 11 to 20 years from now. That number did not come from the Congressional Budget Office, the one government body that members of both parties count on for impartial long-term projections.", "Also, the chained CPI estimate Brooks cited goes beyond what Obama proposed last year. In 2013, the president exempted programs for low-income people and offered extra payments for Social Security recipients who had been on the rolls a long time.", "Those caveats would bring down the savings, no matter what the real number is.", "We rate Brooks’ statement Half True.", "NBC, Meet the Press, Feb. 23, 2014", "Washington Post, With 2015 budget request, Obama will call for end to era of austerity, Feb. 20, 2014", "Congressional Budget Office, Using the chained CPI to index  Social Security, other government programs, and the tax code for inflation, April 18, 2013", "Congressional Budget Office, The 2012 long-term projections for Social Security, Oct. 2, 2012", "Congressional Budget Office, Supplemental Data for CBO's 2012 Long-Term Projections for Social Security, Oct. 2, 2012", "Congressional Budget Office, What would be the effect on the Deficit of Using the Chained CPI to Index Benefit Programs and the Tax Code?, April 18, 2013", "Committee for a Responsible Federal Budget, The case for the chained CPI, February, 2014", "Committee for a Responsible Federal Budget, Measuring up: The case for the chained CPI, March 19, 2013", "Committee for a Responsible Federal Budget, Entitlement reform should be in the President’s budget, Feb. 19, 2014", "Brookings Institution, A bipartisan case for chained CPI, May 9, 2013", "Brookings Institution, Money, illusion, chained CPI, and the benefits of inflation, April 17, 2013", "Factcheck.org, Chained explained, Dec. 11, 2012", "Social Security Administration, Social Security basic facts, July 26, 2013", "Center on Budget and Policy Priorities, Chained CPI Proposal Would Cut Social Security Retirement Benefits by About 2 Percent, on Average, April 23, 2013", "Committee for a Responsible Federal Budget, The President’s proposed chained CPI protections, April 12, 2013", "PolitiFact Florida, Medicare and Social Security -- not defense -- are driving debt, says Marco Rubio, Nov. 22, 2013", "PolitiFact Wisconsin, Social Security doesn't add to the federal deficit, U.S. Rep. Mark Pocan says, April 26, 2013", "Email interview, Paul Van de Water, senior fellow, Center on Budget and Policy Priorities, Feb. 23, 2014", "Email interview, Jason Peuquet, research fellow, Committee for a Responsible Federal Budget, Feb. 23, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]