["The photo was published here on Facebook on August 19, 2020.", "The post's caption reads: “Belarus”.", "Protests erupted in Belarus following the disputed re-election of President Alexander Lukashenko and the subsequent police crackdown, as AFP reported here and here.", "The photo was also shared with a similar claim in other languages, including Spanish, Azerbaijani and Georgian on Facebook; and Turkish, English, Chinese and Russian on Twitter.", "The photo also appeared in reports about Belarus protests that were published in news sites, such as 1stchannel in Georgia and Agenzia Nova in Italy.", "The claim, however, is false.", "A reverse image search found the same photo published on Reuters' website here. The caption reads: “Protesters hold candles during an anti-government rally in central Seoul on November 19, 2016, aimed at forcing South Korean President Park Geun-Hye to resign over a corruption scandal.”", "Below is a screenshot of the Reuters webpage:", "Below is a screenshot comparison of the photo in the misleading Facebook post (L) and the Reuters photo (R):", "The photo also appeared in this Reuters report, dated November 19, 2016, about protests in South Korea against Park.", "The photo was taken in central Seoul, as seen here on Google Street View.", "Below is a comparison of the photo in the misleading Facebook post (L) and the image on Google Street View (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]