["About this rating", "The National Institute of Health proposed a new policy that would allow researchers to receive federal funds to make part human, part animal embryos.", "The United States has not approved  crossbreeding humans and animals.", "On 5 August 2016, the web site The Real Strategy published an article about a proposal from the National Institutes of Health that was misleadingly titled \"Crossbreeding Humans with Animals Approved in United States\".", "The article contained a photograph purporting to show a hybrid creature:", "The United States has not approved crossbreeding humans and animals, and the above-displayed image was taken from the 2009 movie Splice.", "However, the NIH did recently make an announcement about lifting a moratorium on research using human stem cells to create part-human, part animal embryos:", "The National Institutes of Health is proposing a new policy to permit scientists to get federal money to make embryos, known as chimeras, under certain carefully monitored conditions.", "While it is true that the National Institutes of Health is considering funding chimera research, these projects are not aimed at \"crossbreeding\" humans and animals in attempt to create hybrid creatures like the fictional one pictured above. Instead, chimeras will be used to study disease and may eventually be used to generate human organs:", "Researchers might be able to better study heritable human diseases, and find drugs that work against these diseases, by using chimera animal models, several stem cell scientists wrote in a letter published in the journal Science last year.", "Perhaps the most widely discussed implication of the research is its potential to create animals that contain human organs, which could then be transplanted into patients. It might be possible to \"generate an unlimited supply of therapeutic replacement organs,\" by using pig or sheep chimeras, the Science letter said.", "The National Institutes of Health placed a moratorium on funding chimera research projects in September 2015 (even though no such funding had previously been provided) while they considered the ethical questions involved in such studies. In August 2016, they announced that they were considering lifting the moratorium and proposed changes to the existing stem cell guidelines.", "One notable change was the addition of a steering committee that would oversee funding requests for chimera projects:", "Because of the ethical concerns, though, at least some of the experiments would go through an extra layer of review by a new, special committee of government officials.", "That committee would, for example, consider experiments designed to create animals with human brain cells or human brain tissue. Scientists might want to create them to study neurological conditions such as Alzheimer's and Parkinson's diseases. But the experiments would undergo intensive scrutiny if there's any chance there might be a \"substantial contribution\" or \"substantial functional modification\" to an animal's brain.", "Carrie Wolinetz, the NIH's Associate Director for Science Policy, wrote:", "I am confident that these proposed changes will enable the NIH research community to move this promising area of science forward in a responsible manner.", "It's also worth noting that the changes are proposed, not approved.", "Wolinetz, Carrie.   \"Next Steps on Research Using Animal Embryos Containing Human Cells.\"\r\n    National Institute of Health.   4 August 2016.", "Rettner, Rachael.   \"Strange Beasts: Why Human-Animal Chimeras Might Be Coming.\"\r\n    Live Science.   5 August 2016.", "Kaiser, Jocelyn.   \"NIH moves to lift moratorium on animal-human chimera research.\"\r\n    Science Magazine.   4 August 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]