["The photo was published in this Facebook post on September 18, 2019.", "Below is a screenshot of the misleading post:", "The post’s Indonesian-language caption translates to English as: “Touched When President Joko Widodo inspected the location of forest and plantation fires in Riau.”", "Riau is a province in western Indonesia. Here is an AFP story about Jokowi’s visit to an area hard hit by forest fires in Riau on September 17, 2019.", "The same doctored photo was also published on Facebook here, here and here, where it has been shared more than 120 times; and also on Twitter here with a similar claim.", "The claim is false; the photo has been doctored to include a teardrop on Jokowi's face. The original photo was taken of the president while he inspected the forest fires in Riau.", "Keyword searches on Google found the original photo published in this September 17, 2019, post on the official Facebook page of the State Secretariat Ministry. The post is embedded below.", "The ministry’s post contains the original version of the doctored image.  It also includes two other photos that show the president talking to journalists.", "The post’s Indonesian-language caption translates to English as: “President Jokowi Emphasizes the Importance of Forest Fires Prevention.”", "Below is a screenshot comparing the doctored image (L) in the misleading post and the genuine photo on the ministry’s Facebook page (R) -- AFP has circled the teardrop on the doctored image:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]