["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Merry Christmas from the Schiffs and the whistleblower! A recent Facebook post claims the photo on a holiday card from U.S. Rep. Adam Schiff shows the man whose complaint spurred the impeachment inquiry into President Donald Trump grinning alongside the California Democrat and his family.", "\"News ABC doesn’t tell you,\" one poster wrote. \"The ‘Whistle Blower’ is dating Adam Schiff’s daughter, yet he doesn’t know who he is. Look at their family Christmas card. The ‘Whistleblower’ is featured proudly. You can’t make this stupidity up...!\"", "But, oh boy, you can.", "The Dec. 11 post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The photo is authentic, though — Schiff posted it on Facebook on Nov. 28, the date of a different holiday.", "\"Happy Thanksgiving from my family to yours!\" he wrote. \"With Eve, Alexa, and her boyfriend...\"", "Schiff’s post gives the first name of the boyfriend, and it’s the same first name as a CIA officer whose identity has been shared widely on social media as posts claim to out him as the whistleblower.", "But that person is not the man pictured in Schiff’s photo — nor does he resemble him. (Also, for the record, PolitiFact cannot confirm that person is the whistleblower.)", "Alexa Schiff’s boyfriend isn’t the first person to be confused with the CIA officer. We’ve already debunked multiple posts that claim photos of George Soros’ son, Alexander, is the alleged whistleblower. Another claim, that a photo of \"Obama’s White House staff\" shows the whistleblower, is also wrong.", "We rate this Facebook post Pants on Fire!", "Facebook post, Dec. 11, 2019", "Adam Schiff Facebook post, Nov. 28, 2019", "PolitiFact, That’s not the whistleblower posing with Democratic politicians, it’s George Soros’ son, Nov. 14, 2019", "PolitiFact, No, these photos don’t show the whistleblower posing with Democrats, Nov. 12, 2019", "PolitiFact, No, this isn’t a photo of the Ukraine whistleblower, Nov. 5, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]