["About this rating", "On 25 September 2014, Facebook users who frequent coupon and couponing -related communities began to report that Facebook groups devoted to sharing discount codes and coupons were being deleted en masse for unknown reasons.", "Blogs and groups devoted to couponing have been speculating about the Facebook coupon group deletion issue; however, not only are any potential reasons for such an action on the part of Facebook still not clear, there is no official confirmation that coupon groups have even been the subject of Facebook scrutiny at all.", "Since the rumor about Facebook couponing group deletions began to circulate, users from those communities have suggested that Facebook has taken action against groups in which prohibited activities are occurring. Among the violations cited in the rumors are the sale of coupons (which is often not permitted by the manufacturer), collusion to defraud through the misuse of coupons, or general information exchange about the misuse of coupons. Other shutdown reasons suggested by couponers include scammers' running rampant and selling counterfeit coupons, and the possibility of Facebook groups' being used for the purpose of commerce without a proper business page.", "One Facebook user suggested that the panic over couponing group deletion might be overstated, and that the fears may have stemmed from a single group deletion and not a large-scale action against coupon groups:", "I have not see ANY proof that this is true, just a bunch of rumors. I saw one screenshot showing that a coupon PAGE had been deleted but no groups. There's one group I'm in where two ladies sell inserts so if it's selling that they're targeting, that group should be gone, but it's not.", "Facebook's list of rules regarding page administration (including relevant portions regarding use of Facebook for advertising, commerce, and promotions) can be found here.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]