["About this rating", "Among the many natural wonders of the world, is there an icicle-laden mountain cliff that looks just like an elephant? An image making it's way around the internet in January 2018 would have you believe as much:", "Elephant's mountain", "Posted to pics on Reddit: https://t.co/e0G4j3Mu4c pic.twitter.com/mgGFSqWsmv", "— Popular Snoo (@theredditbot) January 27, 2018", "Yet, none of the posts of this image included information about where the alleged Elephant's Mountain is located. That's because it doesn't exist. Mirekis, the artist who created this image, did so using digital editing software.", "Mirekis posted the image to his Facebook page on 18 January 2018 along with a message in Polish saying that it was the second image in a series of seasonal landscape artworks. The message, automatically translated and edited for clarity, read:", "A to drugi obraz z serii ,,Nad przepaścią,, tym razem zimowy, do kompletu brakuje jeszcze wiosny i jesieni, myślę że ciekawie będą się wszystkie razem prezentować.", "And this is the second image of the series \"On the precipice,\" this time set in winter. The series is still missing spring and fall. I think it will be interesting to present all of them together.", "Mirekis also posted this image to his 500PX page (which is full of similar artwork), where he tagged it as \"surreal,\" \"fantasy,\" and \"photomanipulation.\"", "We reached out to Mirekis, who told us that \"Elephant's Mountain\" was a composite of several different images. The foreground of the image, which shows a field and a few scattered bushes, was taken from a photograph of a Rocca Malatestiana, a fortress on a mountain range in Italy:", "He used was created from two images from Pixabay to create the elephant-shaped cliff:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]