["A video of a train carrying trucks is viral on social media. Several Facebook and Twitter users have posted it with the claim that Prime Minister Narendra Modi is ensuring that there is no shortage of essential services during the coronavirus lockdown.", "On April 2, a Facebook user posted the viral video along with text in Hindi, “PM’s idea to fight Corona. Blessed be my country’s Prime Minister’s willpower that even during times of such adversity he has implemented an idea to ensure that there is no shortage of essential items (translated from PM’s idea to fight Corona. धन्य है मेरे देश के प्रधान की इच्छाशक्ति देखिए इस विपरीत परिस्थिति में भी आवश्यक वस्तुओं की उपलब्धता में कोई कमी ना आए इसका ध्यान रखते हुए क्या आईडिया लगाया है)”. This video has been viewed over 70,000 times. (archive link)", "PM’s idea to fight Corona 👏🏻👏🏻🙏🏻🙏🏻", "धन्य है 🙏मेरे देश के प्रधान की इच्छाशक्ति देखिए इस विपरीत परिस्थिति में भी आवश्यक वस्तुओं की उपलब्धता में कोई कमी ना आए इसका ध्यान रखते हुए क्या आईडिया लगाया है👏🏻👏🏻🙏🏻🙏🏻", "Posted by Tarun Tyagi on Thursday, 2 April 2020", "Alt News has received several requests to fact-check the viral video WhatsApp (+91 76000 11160) and on our official Android application.", "Alt News analysed the video using InVid, a video verification too, and found that it was also uploaded by a YouTube account in 2013.", "While we couldn’t authenticate where the video is from but it appears to be of Indian Railway’s roll-on roll-off (RORO) service. According to Indian Railways’ Annual Report (2011-12), the service was started in 1999 by Konkan Railways.", "In 2012, The Hindu Business Line reported that RORO is a service that enables loaded trucks to be carried directly on railway wagons between two destinations. According to the report, in 2011-12, Konan Railway Corporation carried more than 35,000 trucks through its RORO service which added Rs 35.64 crore to the revenue.", "Mumbai Mirror reported in 2018 that Indian Railways commenced RORO service on Central and Western Railways for the first time. According to the report, RORO service can carry 50 trucks at a time and save approximately 10 litres of diesel per kilometre.", "Thus, a video that could be traced back to at least 2013 was shared with the false claim that trucks carrying essential items are being transported in trains as per an initiative by PM Modi. However, the video is unrelated to the coronavirus pandemic.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]