["Election Day is less than a week away.", "Given concerns about abnormal mail delays, voters across the country are starting to ask whether it's already too late to drop their ballots in the mail.", "Joy Gaines-Friedler shared a message on Oct. 19 that she claimed contained an answer — straight from Michigan Gov. Gretchen Whitmer.", "\"From Governor Whitmer: As of today - do NOT mail-in your ballots,\" she wrote on Facebook. \"Please take them to a drop-off box, or to your clerk's office.\"", "Fact check:Cropping alters context of viral Obama campaign event photo", "Gaines-Friedler told USA TODAY that the post was a paraphrase of remarks Whitmer gave at a private fund-raiser held on Zoom.", "She clarified that Whitmer did not explicitly tell voters not to mail their ballots, as her original post implied. Rather, she \"said only 'We're asking you now to drop-off your ballots rather than mail them,'\" Gaines Friedler explained.", "Whitmer's office did not respond to a request for comment.", "But it's true that the Democratic governor has encouraged voters to deliver their absentee ballots in-person since mid-September.", "\"If you can, don't drop your ballot in the mail but go ahead and take it directly to your clerk's office,\" Whitmer told WWJ Newsradio on Sept. 16. \"That's an easy way to ensure that your ballot gets counted.\"", "Just this week, Michigan Secretary of State Jocelyn Benson encouraged the one million voters who have not returned their absentee ballots to take that ballot directly to their clerk or put it in the appropriate drop box.", "\"We are too close to Election Day, and the right to vote is too important, to rely on the Postal Service to deliver absentee ballots on time,\" Benson wrote in a statement on Tuesday. \"Citizens who already have an absentee ballot should sign the back of the envelope and hand-deliver it to their city or township clerk's office or ballot drop box as soon as possible.\"", "Fact check:Nikki Haley claim about Joe Biden's jobs plan is missing context", "That depends on where you live.", "Mail delivery times vary between states and counties. They have also been slowed during the pandemic.", "An investigation by USA TODAY mailed packages and letters in different states to test delivery times and saw the greatest number of delays in Michigan.", "An analysis by the Washington Post of mail delivery times in battleground states, including Michigan, also showed the U.S. Postal Service failed to deliver some first-class mail on time. (On-time delivery is defined as one to three days.) In Detroit, about 29% of mail for the week ending Oct. 9 arrived late.", "Different states also have different rules about how they count absentee ballots arriving after Election Day.", "The rule in Michigan was one of several that ended up in court.", "At first, a lower court ruled that ballots postmarked by Nov. 2 could be counted up to two weeks after Election Day. But an appeals court reversed that rule — so in Michigan, only absentee ballots received by 8 p.m. on Election Day will be counted.", "That's a large part of why Democrats like Whitmer have pushed voters to hand-deliver their ballots to county clerks or drop boxes, per the Detroit Free Press.", "For rules specific to each state, select the state and check the \"Deadline To SUBMIT A Mail-In Ballot\" on NPR.", "Despite state-by-state differences, experts concur that it's too late to vote by mail.", "A postcard from the U.S. Postal Service itself advised voters to “mail your ballot at least 7 days before Election Day,\" per the Washington Post.", "Likewise, David Fineman, chair of the nonpartisan Fair Elections Center and a former chair of the Board of Governors of the USPS, told NPR that voters who have not yet mailed their absentee ballot should not do so.", "\"Voters who have not mailed the ballot as of this date should not mail their ballots and should find another means to vote,\" he said.", "That's even more true in the over two dozen states, including Michigan, where ballots must be received by Election Day, Nov. 3, to be counted.", "Fact check:Joe Biden misspoke about his campaign's voter protection efforts", "We rate the claim that Michigan Gov. Gretchen Whitmer told voters not to mail their ballots MISSING CONTEXT, because it could be misleading without additional context. Whitmer has repeatedly urged voters to deliver their ballots in person rather than relying on the mail, but the user behind the post confirmed that Whitmer did not explicitly tell voters not to mail their ballots. This week, the Michigan Secretary of State's Office also said voters who have absentee ballots should \"hand-deliver it to their city or township clerk's office or ballot drop box as soon as possible.\" Likewise, experts nationwide concur that it's too late to rely on the mail.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]