["About this rating", "Incumbent U.S. President Donald Trump’s post-presidential life is facing hiccups as neighbors around his Mar-a-Lago private club in Palm Beach, Florida, have said they don’t want him to move there permanently once he vacates the White House at the end of his term in January 2021.", "A demand letter — sent by a lawyer in December on behalf of the DeMoss family, who are neighbors of the Mar-a-Lago property and run an international missionary foundation — to the town of Palm Beach and addressed to the U.S. Secret Service argued that Trump has no legal right to permanently reside in Mar-a-Lago after his presidency.", "Trump purchased the property in 1985. The letter said that based on an agreement Trump signed in 1993 that converted the Mar-a-Lago estate from a residence into a private club, members could not spend more than 21 days a year in the guest suites, and could not stay longer than seven consecutive days. The agreement took place when Trump’s finances were foundering and Mar-a-Lago maintenance costs were rising. Before the arrangement was sealed, Trump’s attorney assured the town council that Trump would not live at the club.", "But during his presidency, Trump traveled to Mar-a-Lago at least 30 times, based on a Washington Post tally, and spent at least 130 days there. Reginald Stambaugh, the attorney who wrote the letter, argued that Trump already violated the agreement for visitor stays at Mar-a-Lago.", "Stambaugh wrote that his clients had security and health concerns about the so-called “microwave security fence” on the property, and how the president’s use of the club would devalue neighboring properties. He alleged that an unidentified client was exhibiting symptoms of exposure as a result of the fence, “which is known to cause permanent brain trauma and other debilitating injuries.\" It is not clear when this fence was erected and if it was put up as part of Trump's security detail.", "The letter outlined the responsibility of the Palm Beach Town Council, as well as next steps for the Trumps:", "It is the Town Council's responsibility to right these wrongs and restore safety and security to the neighborhood by upholding its Use Agreement [...] In order to avoid an embarrassing situation for everyone and to give the President time to make other living arrangements in the area, we trust you will work with his team to remind them of the Use Agreement parameters [...] Palm Beach has many lovely estates for sale and surely he can find one which meets his needs.", "The full contents of the letter were shared by The Daily Mail.", "Given that Trump has legally switched his residence to Florida, and listed Mar-a-Lago as his address for voting in the 2020 elections, he has to prove he lives there for six months in the year. A spokesperson for the Trump Organization told CNN: \"There is no document or agreement in place that prohibits President Trump from using Mar-a-Lago as his residence.”", "Trump also signed an agreement giving development rights for Mar-a-Lago to the National Trust for Historic Preservation that saves historic sites. As a part of that deal, he agreed to relinquish his rights to develop the club or use it for “any purpose other than club use.”", "The next steps remain unclear. Palm Beach Mayor Gail Coniglio said the town council could take up the matter after a formal request is made to them, they need to “get some legal advice,” and “take a deeper dive into things.” But experts argue that if the club doesn’t comply, the town could sue, or fine Mar-a-Lago to enforce the regulations.", "We have reached out to Stambaugh and will update this post if we receive more information.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]