["Former FBI lawyer Lisa Page, left, arrives for a closed doors interview with the House Judiciary and House Oversight committees, Monday, July 16, 2018, on Capitol Hill in Washington. (AP)", "A story on Facebook said Lisa Page testified that her former bosses at the FBI instructed her to cover-up the fact that China, not Russia, hacked the Democratic National Committee server. But that isn't substantiated at all.", "\"Lisa Page squeals: DNC server was not hacked by Russians,\" said the July 17 headline by Your News Wire which frequently publishes fake news.", "This story was flagged as part Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) We found no credible evidence to back up the headline.", "Your News Wire largely drew from a story by The True Pundit about Page’s closed-door House hearings on July 13 and July 16. The True Pundit said the information came from \"federal sources\" and \"well-placed FBI sources.\"", "The True Pundit said that Page alleged that the upper echelon of the FBI concealed intelligence confirming Chinese state-backed \"assets\" had illegally acquired former Secretary of State Hillary Clinton’s 30,000 \"missing\" emails.", "In 2016, the U.S. intelligence community concluded that the Russian government directed the recent theft of emails from U.S. persons and institutions, including from U.S. political organizations.", "Despite that, Trump has questioned whether the Russian government tried to interfere in the U.S. election. In 2016, Trump said it could have been China who hacked emails of Democratic operatives and the Democratic National Committee. Or someone \"sitting on their bed who weighs 400 pounds.\"", "Page, a former FBI lawyer, has drawn attention from lawmakers because she and former FBI agent Peter Strzok exchanged anti-Trump text messages while having an affair. Both worked on the FBI's Russia investigation and for a brief time on Special Counsel Robert’s Mueller’s investigation. Strozak testified publicly for 10 hours on July 12.", "We don’t have access to Page’s testimony because it occurred in a closed-door session. News reports said Page didn’t answer reporters’ questions before or after her testimony and lawmakers revealed little. However, of the information that has emerged about her testimony and reported by the mainstream media, none of it indicated she blamed the Chinese.", "Conservative news outlets included Breitbart and The Daily Caller said that lawmakers indicated Page contradicted Strzok about their texts and focused on the issue of political bias at the FBI, but those articles didn’t indicate that she blamed China, either.", "The Washington Post reported that Republican lawyers said that Page provided new information that further convinced them that political bias marred the investigations of Hillary Clinton's emails and the Trump campaign's alleged ties to Russia. Page denied bias.", "Several right-wing websites have repeated the claim that Page contradicted the U.S. intelligence community and pointed the finger at China. We sent an email to Your News Wire and did not get a reply.", "PolitiFact evaluates information using on-the-record sources and information as of the time that a person or website makes a claim. At the time of this fact-check, we found no on-the-record credible information that Page blamed the hacking on the Chinese. We rate this headline Pants on Fire.", "Your News Wire, \"Lisa Page Squeals: DNC Server Was Not Hacked By Russia,\" July 17, 2018", "PolitiFact, Your News Wire, Accessed July 18, 2018", "PolitiFact, \"Pants on Fire! Trump tweet about White House, Russian hacking probe,\" Dec. 15, 2016", "PolitiFact, \"Did John Podesta deny CIA and FBI access to DNC server, as Donald Trump claims?\" July 11, 2017", "PolitiFact, \"FBI was not actively investigating Clinton emails during Page-Strzok text exchange,\" Feb. 12, 2018", "Washington Post, \"Former FBI lawyer 'cooperative' during House testimony,\" July 15, 2018", "The Hill, \"Former FBI lawyer Lisa Page gets closed-door grilling from House Republicans,\" July 13, 2018", "ABC News, \"Republicans say they have new leads after interview with former FBI lawyer Lisa Page,\" July 16, 2018", "CNN, \"Republicans praise Page's testimony one day after battle with Strzok,\" July 13, 2018", "The Hill, \"Former FBI lawyer Lisa Page gets closed-door grilling from House Republicans,\" July 13, 2018", "Breitbart, \"GOP Rep: Lisa Page’s Testimony on Texts Contradict Peter Strzok’s Statements,\" July 17, 2018", "The Daily Caller, \"GOP REP: LISA PAGE CONTRADICTED PETER STRZOK’S TESTIMONY,\" July 17, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]