["The photo was published here on Weibo on October 23, 2020.", "It has been shared more than 400 times.", "The post’s simplified Chinese-language caption translates to English, in part, as: “A braid pulled from Qianlong's head by Sun dianying. Back in the day, how majestic was the braid of Emperor Qianlong!”", "Emperor Qianlong is the longest serving leader in Chinese history, who ruled from 1735-96 during the Qing Dynasty, according to this report by Chinese state media Xinhua.", "Qianlong’s tomb was looted by Chinese warlord Sun Dianying in 1928, as reported here by Chinese state newspaper Global Times.", "The photo was also published such as here and here on Weibo, and also in articles including here and here alongside a similar claim.", "The claim is false.", "A keyword search found the image in this Weibo post by Xu Guangyuan, a Chinese scholar who is skilled in mausoleums and empresses of the Qing Dynasty. It was published on October 24, 2020.", "Xu’s Weibo post clarified the braid belongs to Consort Rong, one of the spouses of Qianlong.", "The post’s simplified Chinese-language caption states: “This is the hair braid of Emperor Qianlong's Consort Rong (Fragrant Concubine). It was unearthed from her underground palace on October 6, 1979. It is 85cm long in total. I oversaw it being put into the cultural relics warehouse!”", "Consort Rong, or Fragrant Concubine, was a prominent Uyghur concubine, as detailed in this article by China-based magazine The World of Chinese.", "Xu also published another Weibo post on October 24 that included another photo of what he claimed also shows Rong’s braid.", "The post’s caption reads in part: “It's absolutely true that this braid belongs to Consort Rong. It was discovered on October 6, 1979 when we entered her underground palace. It was 85cm long and was put into the warehouse, which was overseen by me. It has been on display for many years in the Yuling Tomb and Cixi's tomb of the Eastern Qing Tombs. Later, it was also displayed in Shanghai and the Palace of Eternal Longevity from the Forbidden City. These two exhibitions outside the Eastern Qing Tombs were both arranged by me.”", "Another reverse image search found the braid photo shown in the misleading post was published in this July 30, 2002 article on the news channel of Chinese technology company Sina.", "The article’s simplified Chinese-language headline reads: “Photos: Precious cultural relics of the Eastern Qing Tombs from the Qing Dynasty on display in Shanghai - The remains of Fragrant Concubine”.", "The photo was credited to a journalist called Sun Ping. The photo caption reads: “Fragrant Concubine's hair braid with a red string.”", "There are no credible reports that the braid of Chinese Emperor Qianlong was stolen by a Chinese warlord in the early 19th century.", "The misleading posts were also fact checked by Weibo and the fact-checking channel of Chinese state media site fjsen.com.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]