["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The first agency Donald Trump visited as president was the Central Intelligence Agency, and he had nothing but praise for the people who work there.", "\"Very, very few people could do the job you people do,\" Trump said.", "He vowed to give the CIA all the support they might ever need and dismissed any talk that they didn’t enjoy his respect.", "\"I have a running war with the media,\" he said. \"They are among the most dishonest human beings on Earth. And they sort of made it sound like I had a feud with the intelligence community. And I just want to let you know, the reason you're the No. 1 stop is exactly the opposite.\"", "In this fact-check, we examine whether the press created the storyline that there was friction between Trump and the intelligence community.", "A look at Trump’s own words reveal his readiness to deploy some harsh language. We count several specific instances when he publicly disparaged the intelligence community.", "On Dec. 9, 2016, the Washington Post reported that intelligence officials had concluded that Russia had interfered with the presidential election to undermine Democratic nominee Hillary Clinton.", "Citing an unnamed official, the article said, \"It is the assessment of the intelligence community that Russia’s goal here was to favor one candidate over the other, to help Trump get elected.\"", "The Trump transition team responded with a statement that discredited the intelligence agencies.", "\"These are the same people that said Saddam Hussein had weapons of mass destruction,\" the statement said.", "On Jan. 5, 2017, Trump had kinder words.", "\"The media lies to make it look like I am against ‘Intelligence’ when in fact I am a big fan!,\" he tweeted. Trump’s counselor, Kellyanne Conway, emphasized that point in a Jan. 22, 2017 interview on NBC’s Meet the Press. She noted a Jan. 6 statement from Trump in which he said, \"I respect the service of our great men and women in the intelligence community.\"", "But Trump’s language took a sharper tone when CNN reported on Jan. 10, 2017, about a file claiming that the Russians had embarrassing personal and financial information on Trump. According to reports, the file had actually been compiled by people working for Trump’s American political opponents and leaked to the press. CNN reported that intelligence officials also received the file and had briefed both Trump and President Barack Obama about its existence.", "On Jan. 11, Trump tweeted \"Intelligence agencies should never have allowed this fake news to ‘leak’ into the public. One last shot at me. Are we living in Nazi Germany?\"", "Intelligence agencies should never have allowed this fake news to \"leak\" into the public. One last shot at me.Are we living in Nazi Germany?", "Trump didn’t back down when he was asked about the Nazi comparison at a press conference later that day.", "\"I think it was disgraceful — disgraceful that the intelligence agencies allowed any information that turned out to be so false and fake out,\" he said. \"I think it’s a disgrace, and I say that — and I say that, and that’s something that Nazi Germany would have done and did do.\"", "Trump also tweeted his suspicions that intelligence officials were behind the leaked file.", "\"Totally made up facts by sleazebag political operatives, both Democrats and Republicans - FAKE NEWS! Russia says nothing exists. Probably released by ‘Intelligence’ even knowing there is no proof, and never will be.\"", "Throughout the campaign, Trump consistently expressed doubt that Russia had meddled in the election at all. Allegations that Russia had stolen emails off the Democratic National Committee server were circulating by September.", "When the issue came up in the first presidential debate, Trump said \"I don't think anybody knows it was Russia that broke into the DNC. I mean, it could be Russia, but it could also be China. It could also be lots of other people. It also could be somebody sitting on their bed that weighs 400 pounds, okay?\"", "Trump stuck to that line even after the heads of Homeland Security and the National Intelligence office said in early October that they believed Russia was behind the DNC hacking.", "By that point, intelligence officials had briefed Trump with the details behind their conclusions. His steadfast skepticism prompted retired Gen. Michael Hayden, former director of the CIA and the National Security Agency, to tell the Washington Post, \"it defies logic.\"", "National security historian Stephen Walt at Harvard University’s Kennedy School told us no other modern president has attacked the intelligence community in the way Trump has.", "\"Trump went well beyond the norm in this charge and now pretends he didn’t pick a fight with them, even though his remarks are a matter of public record,\" Walt said.", "Walt dismissed the idea that the press invented the friction between Trump and the intelligence community.", "Our ruling", "Trump said the media created the appearance that he had a feud with the intelligence community. Trump’s own words undercut that assertion. While he did call himself a \"big fan\" and respected the service of the members of the intelligence community, he also lashed out on several occasions. He said that intelligence officials had used Nazi-like tactics against him and belittled the agencies as a whole for their incorrect belief that Iraq had weapons of mass destruction.", "Trump also openly doubted their conclusions during the campaign that Russia was trying to interfere with the presidential election.", "The press did not invent Trump’s harsh words and dismissive tone. We rate this claim False.", "Donald Trump, Remarks at the CIA, Jan. 21, 2017", "Donald Trump, Tweet, Jan. 3, 2017", "Donald Trump, Tweet, Jan. 5, 2017", "Donald Trump, Tweet, Jan 5, 2017", "Donald Trump, Tweet, Jan. 6, 2017", "Donald Trump, Tweet, Jan. 8, 2017", "Donald Trump, Tweet, Jan. 11, 2017", "Donald Trump, Tweet, Jan. 13, 2017", "Donald Trump, Tweet, Jan. 13, 2017", "Donald Trump, Tweet, Jan. 13, 2017", "Donald Trump, Tweet, Jan. 15, 2017", "Donald Trump, Tweet, Jan. 15, 2017", "Donald Trump, Tweet, Jan. 15, 2017", "Washington Post, Secret CIA assessment says Russia was trying to help Trump win White House, Dec. 9, 2016", "USA Today, Trump bashes CIA, dismisses Russian hacking report, Dec. 9, 2016", "New York Times, Trump, Mocking Claim That Russia Hacked Election, at Odds with G.O.P., Dec. 10, 2017", "Federal News Service, Transcript: Donald Trump’s news conference, Jan. 11, 2017", "Washington Post, Trump's treatment of intelligence briefing stuns experts, Oct. 14, 2016", "CNN, Intel chiefs presented Trump with claims of Russian efforts to compromise him, Jan. 10, 2017 (updated Jan. 15, 2017)", "Office of the Directory of National Intelligence, Joint DHS and ODNI Election Security Statement, Oct. 7, 2016", "Email interview, Stephen Walt, professor of international affairs, Harvard University, Jan. 22, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]