["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A curious \"fun fact\" about the 1770s, Britian and lipstick went viral on social media.", "The Facebook post making the rounds claims that, in 1770, the British Parliament \"banned lipstick, saying it had the power to seduce men into marriage, which was classified as witchcraft.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Was the cosmetic really once banned under British law? We wanted to find out.", "It’s accurate that during the 16th century (and beyond) people had very strong opinions about makeup and its ability to deceive the eye. One 1711 letter written to British newspaper The Spectator about the use of makeup said that men who had married women who didn’t \"let their husbands see their faces until they are married\" were \"injured gentlemen.\"", "However maligned some men may have felt about the deception of painted lips, we could find no evidence that a lipstick ban ever made its way through Parliament at any time.", "A 2017 article by Racked, Vox’s now defunct fashion-focused website, dove into the rumors that a law passed in England in 1770, supposedly called the \"Hoops and Heels Act,\" that made it legal for a man to divorce his wife if she had tricked him into marriage using \"witchcraft\" to enhance her looks. The story says:", "\"Called the Hoops and Heels Act, it stated that any woman who tried to ‘seduce and betray into matrimony’ a man using ‘scents, paints, cosmetic washes, artificial teeth, false hair, Spanish wool, iron stays, hoops, high-heeled shoes, [or] bolstered hips’ would be tried for witchcraft and have her marriage voided if found guilty.", "\"Except it never happened. But generations of researchers have been fooled, some stating that the law was passed in 1774, others saying that it was voted down by Parliament, and another group claiming that under the counsel of their mistresses and wives, members of Parliament decided not to vote on it at all.\"", "So despite iterations of the claim proliferating the internet for years, there was no British law that instituted a lipstick ban.", "Fact-checking website Africa Check found that the closest thing to such a law came in a June 7, 1650, entry in the House of Commons Journal under the heading \"Immodest Dress.\"", "That entry says: \"An Act against the Vice of Painting, and wearing black Patches, and immodest Dresses of Women, be read on Friday Morning next.\"", "But officials with the United Kingdom’s National Archives told PolitiFact in an email that the bill never had a full reading, as far as they could see, and because of that \"it was likely introduced at the behest of a Puritan MP (member of parliament) but the Council of State chose not to pursue it.\"", "While 1770s society may have considered painted lips and makeup in general to be unladylike witchcraft, a law banning it never succeeded.", "Feminine trickery marches on. Pants on Fire!", "Facebook post, Oct. 23, 2019", "Africa Check, Ban on lipstick was attempted in 1650, not 1770 – but didn’t pass, Aug. 30, 2019", "Racked.com,  The Entirely False History of Women Tricking Men With Makeup, March 20, 2017", "House of Commons Journal, Vol. 6, June 7, 1650; Accessed Oct. 25, 2019", "Inventor Spot, The History of Lipstick And It's Slightly Gross Origins, Accessed Oct. 25, 2019", "Alpha History, 1770: WHAT LIES UNDER YOUR WIFE’S MAKE-UP?, Accessed Oct. 24, 209", "The Spectator, March 2, 1711 letter; Accessed Oct. 24, 2019", "Email interview, UK National Archives press office, Oct. 25, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]