["The post was published to Facebook by a New Zealand-based user here on August 26, 2020. It has been shared more than 380 times.", "The images featured in the post show a photo of a bee and a drawing of a one.", "Underneath the images is a caption that reads: “Bumblebees do not fly. While it appears they do, what is actually being witnessed is something called ‘acoustic levitation’. Inside a bumblebee there is a hollow cavity next to the larynx. When they beat their wings, they begin resonating energy within this cavity. Once that resonance matches the 7.83Hz of Earth’s magnetic field, it becomes a free-agent surrounded in an electromagnetic envelope, enabling levitation.”", "The claim was also shared hundreds of times here, here, here, and here on Facebook.", "However, the claim is false.", "According to biologists at Arizona State University (ASU) in the US, bees can fly because their wings “make short, quick sweeping motions” that generate enough lift to propel them through the air -- not because of “acoustic levitation”.", "“Their wings are not rigid, but twist and rotate during flight. Bee wings make short, quick sweeping motions front and back. This motion creates enough lift to make it possible for bees to fly,” the ASU article reads.", "In 2005, scientists at the California University of Technology in the US determined that the movement of bees’ wings creates an aerodynamic phenomenon called “leading edge vortices”, which creates pressure differentials that allow certain animals to fly.", "The researchers also found that the wingbeat frequency of bees is roughly 230Hz, or 230 cycles per minute. The determination is far greater than the 7.83Hz claimed in the false Facebook post.", "“Our analysis of honeybee aerodynamics reveals how the rapid low-amplitude wing motion of bees is sufficient to maintain the weight of the animal,” the study reads.", "While bees don’t use “acoustic levitation,” scientists have previously suspended small objects mid-air using the phenomenon, which uses soundwaves to counteract gravity.", "According to this article published by the US Department of Energy Argonne Laboratory, an “acoustic levitator” uses speakers to generate soundwaves that interfere with each other and create a standing wave.", "“At certain points along a standing wave, known as nodes, there is no net transfer of energy at all. Because the acoustic pressure from the sound waves is sufficient to cancel the effect of gravity, light objects are able to levitate when placed at the nodes,” the article reads.", "A demonstration of acoustic levitation from the Argonne Laboratory can be seen here on its YouTube channel.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]