["This Facebook post published on May 11, 2020 includes the misleading photo. It has been shared more than 350 times.", "It shows a red placard with images of Sri Lanka’s President Gotabaya Rajapaksa and Prime Minister Mahinda Rajapaksa.", "The Sinhala-language text at the top left-hand corner of the placard reads: “Our wishes to the president and the prime minister for eradicating corona from Lanka”.", "The post's Sinhala-language caption translates to English as: “What became of Shavendra Silva, Ajith Rohana and Anil Jasinghe / This is what happened to the war victory too”.", "Army commander Shavendra Silva, Deputy Inspector General Ajith Rohana and Director General of Health Services Anil Jasinghe are all members of Sri Lanka’s National Operation Centre for Prevention of the COVID-19 Outbreak (NOCPCO), which was established in March 2020 against the pandemic.", "Similar claims have been made on Facebook alongside an identical image, as seen here, here, here, here and here.", "It was also shared on Twitter here and here with a similar claim.", "However, the claims are false; the placard in the photo has been doctored to include the message about COVID-19.", "A reverse image search on Google found the original photo published in this article published on November 18, 2019 by Arab News, an English-language daily newspaper based in Saudi Arabia. The report's headline reads: “Rajapaksa wins Sri Lanka Presidency by big margin”.", "The photograph was credited to AFP. It can be found on AFP’s archive here.", "The photo's caption states: “Supporters of Sri Lanka Podujana Peramuna (SLPP) party presidential candidate Gotabaya Rajapaksa carry cut-out placards to celebrate in Colombo on November 17, 2019. Gotabaya Rajapaksa, who spearheaded the brutal crushing of the Tamil Tigers 10 years ago, stormed to victory on November 17 in Sri Lanka's presidential elections seven months after Islamist extremist attacks killed 269 people. Ishara S. KODIKARA / AFP”.", "Below is a screenshot comparison of the image in the misleading posts (L) and the AFP photo (R) with edited areas circled in yellow by AFP:", "As of May 13, 2020, Sri Lanka has not eradicated COVID-19. According to data published by the Health Promotion Bureau, the number of confirmed COVID-19 cases was 889; including nine deaths; 117 \"suspected and hospitalised\"; and 366 \"recovered and discharged\".", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]