["A video of a ship battling a storm in the sea is being circulated with the claim that it represents ongoing Cyclone Fani, which has recently hit Odisha, causing major destruction in the coastal areas. One Facebook user who goes by the name of Abhijit has captioned this video, “Cyclone Fani continues to strengthen as it tracks over the Bay of Bengal”. It has been shared close to 2,700 times and viewed over 57,000 times.", "Cyclone Fani continues to strengthen as it tracks over the Bay of Bengal….", "Posted by Abhijit Das Roy on Thursday, 2 May 2019", "Few more individual users along with a Facebook page, Bong Savage, have shared the video with a similar text.", "Using Invid, an image and video verification tool, Alt News found that the video of the ship caught up in the middle of a storm is at least two-years-old. We found an extended version of the same video uploaded, on Odnoklassniki, a Russian social media site, on November 17. 2016. The caption attached with the video reads, “Storm 12 points on the Beaufort scale (-Google translated)”. Moreover, Alt News found that the same video was uploaded on YouTube at least since December 2016. Suffice to Say, the video cannot be representative of a present event.  In conclusion, an old video of an oceanic storm in Russia was falsely shared as the impact of Cyclone Fani. We urge social media users to not post or forward videos/images related to Cyclone Fani that have yet not been authenticated as this can lead to unnecessary panic. Please be a responsible netizen.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]