["About this rating", "In early December 2017, a video that appeared to show a Boeing 737 Max passenger jet making a stomach-dropping vertical climb circulated on social media, along with the claim (which certainly appears valid at first viewing) that the plane launched itself at a 90-degree angle into the sky during takeoff:", "The video depicts the takeoff of the Boeing jetliner at the 2016 Farnborough International Airshow in the United Kingdom, an annual week-long exhibition and trade show. Although it is making a much steeper ascent than any commercial flight would with passengers on board, the 737 is likely not blasting off from the ground at a 90 degree angle like a space shuttle.", "A spokesman for Boeing declined to give us specifics about the maximum angle the plane in the video reached, but the sharp takeoff is a popular stunt at airshows when the planes are empty of the weight of passengers and luggage while showing off their maneuverability at the hands of experienced pilots. They also make for dramatic videos that attract views on social media. In a similar, widely-shared video produced by Boeing one year earlier, a 787 Dreamliner appears to go vertical during a rehearsal for an airshow in Paris:", "The pitch of the plane is most likely being made to look more dramatic than it is with the camera angle, airline pilot and AskThePilot.com blogger Patrick Smith told us that \"The angle you see in the video is unusually steep, but I’m sure it’s not 90 degrees.  The internet is bursting with airplane footage that looks scarier and more radical than it is, thanks to camera perspective, and this appears to be yet another example.\"", "Of a similarly dramatic 787-9 take off at the Farnborough airshow in 2014, former chief pilot and then-president of Boeing business jets Steve Taylor noted that \"The airplane is pitched to almost 30 degrees in that climb-out and it gives you a chance to see that beautiful wing\":", "As the technology publication Wired pointed out in 2014 upon review of the performance of the Boeing 787-9 at Air New Zealand, a take-off at that angle can look vertical, depending on the viewer's vantage point:", "They kicked off the demonstration with a spectacularly steep takeoff, pitching the plane up just shy of 30 degrees. Compared to the civilized, standard 10 to 20 degree pitch used on standard takeoffs, this looked damn near vertical. On one turn, Neville and Bryan banked 60 degrees. To put that in context, any bank angle above 45 degrees is considered an “upset,” putting the plane in a position that can lead to a loss of control. Then they showed off how fast the -9 can roll from side to side, and executed a touch and go: landing the plane, then taking off again immediately while banking hard to the right.", "Smith told us although it's not impossible for an airplane to hit a 90-degree angle while taking off, the the maximum steep climbs seen during airshows may reach 40 or 50 degrees momentarily:", "How steeply a plane can climb, in terms of what we call “deck angle,” depends on the plane’s weight, available engine power, the outside temperature, and other factors.  In normal passenger-carrying operations, around 20-degrees nose-up is the most you’ll see.  Under carefully controlled circumstances, however, such as at air shows and whatnot, you might see a jetliner hit 40 or 50 degrees, at least momentarily.  During a really extreme climb, for as long as the plane is able to maintain enough speed and power it won’t stall.  But for a commercial jetliner, even lightly loaded, this will be just a matter of seconds.  That’s why you see that 737 level off again pretty quickly.", "In other words, you probably needn't fret about a 90-degree climb the next time you fly — unless you're an astronaut.", "Davies, Alex.   \"Watch Test Pilots Push the New Boeing Jet to Terrifying Limits.\"\r\n    Wired.   15 July 2014.", "Patterson, Thom.   \"787 Dreamliner Has Eyepopping Rehearsal for Paris Air Show.\"\r\n    CNN.   26 June 2015.", "Krol, Charlotte.   \"Jaw-Dropping 'Zero Gravity' Vertical Take-Off Captured at Farnborough International Airshow.\"\r\n    The Telegraph.   21 July 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]