["This five-minute 54-second video shows an aerial view of a mass congregation. It was published on YouTube on March 20, 2020.", "The video’s Indonesian-language title translates to English as: “Chinese citizens flocked to convert to Islam due to corona”.", "Below is a screenshot of the misleading post:", "As of June 2, 2020, at least 84,597 people in China have been infected with COVID-19 and 4,645 people have died, according to this World Health Organization (WHO) tally.", "The same footage, which has been watched more than 13,000 times, was also shared on Facebook here, here, here and here, alongside a similar claim.", "The claim is false; the video actually shows an Eid-al-Fitr prayer in the Chinese city of Xining in 2015.", "A reverse image search on Google followed by a keyword search found a longer, higher-quality version of the video published here on Baidu Video, a Chinese video platform.", "The nine-minute 27-second video's Chinese-language title translates to English as: “Spectacular SD aerial video / Eid al-Fitr at Xining Dongguan Mosque”.", "Eid-al-Fitr marks the end of Ramadan, the Muslim holy month of fasting, which is celebrated by performing communal prayer as well as visiting family and friends.", "Dongguan Mosque, one of the largest mosques in northwest China, is located in Xining, Qinghai province.", "At the 11-second mark, text superimposed on the video reads: “Xining Dongguan Mosque/2015.7.17”.", "Below are two screenshot comparisons of scenes in the video in the misleading post (L) and the Baidu Video clip (R):", "The logo for Tencent, a Chinese online video platform, can be seen in the right-hand corner of both clips.", "The video has been removed from Tencent, but the Tencent link appears in this Weibo post, dated March 3, 2016, with the same video title: “Spectacular SD aerial video / Eid al-Fitr at Xining Dongguan Mosque”.", "Chinese portal Sina.com also published this report dated July 18, 2015, about Eid-al-Fitr celebrations across China, which fell one day earlier in some parts of the country, including Qinghai.", "Images of Dongguan Mosque, seen on Google Street View below, correspond with the video.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]