["The 10-minute 39-second video was published here on Facebook on November 9, 2020.", "It has been viewed more than 94,000 times.", "The video consists of four clips of varying lengths. The clips show crowds gathered for various protests.", "The post's Tagalog-language video caption translates to English as: \"WATCH THIS, PARENTS STAGED A RALLY at COMELEC FOR THE EXPULSION OF MAKABAYAN BLOC in CONGRESS!\"", "“Comelec” is the acronym for the Philippine Commission on Elections. Its main office is located in the capital Manila.", "“Makabayan bloc” refers to a coalition of opposition lawmakers in the House of Representatives.", "An identical video was shared on Facebook here and here; on YouTube here and here; and in blog posts here and here alongside a similar claim.", "The claim, however, is misleading.", "Reverse image searches of the video’s keyframes extracted using digital verification tool InVID-WeVerify, followed by several keyword searches on Google, found none of the clips show protests outside Comelec.", "First and second clips", "AFP found that the first and second clips in the video in the misleading post correspond to the videos seen in this November 7, 2020 Facebook post. It is captioned: “LEAGUE OF PARENTS OF THE PHILIPPINES LPP SERIES OF RALLIES AT DUTCH EMBASSY to call on Dutch Government to deport JOMA SISON so that he can face his crimes here in the Philippines.”", "Joma Sison is the founder of the Communist Party of the Philippines, currently in self-imposed exile in the Netherlands.", "The first clip matches the first nine seconds of this video; while the second clip matches this video in the same November 2020 Facebook post.", "Below are a set of screenshot comparisons showing the first and second clips in the video in the misleading post (L) and the identical videos seen in the November 2020 Facebook post (R):", "The location of the protests can be seen here on Google Street View.", "Third clip", "The third clip corresponds to the first six-minutes and 13-seconds of this video shared on Facebook on October 29, 2020.", "The video’s caption states it was taken in “Tomas Morato Circle”, a well-known memorial in the Philippine capital region.", "Below is a screenshot comparison of the the third clip in the misleading video (L) and the October 2020 video (R):", "The location of this video can be seen here on Google Street View.", "Fourth clip", "The fourth clip in the misleading video matches the first four minutes and three seconds of this Facebook video, posted online on November 7, 2020.", "Its caption reads, in part: “Press Conference of League of Parents of the Philippines with Liga Independecia Pilipinas and parents from Hands Off Our Children.”", "Below is a screenshot comparison of the fourth clip in the misleading video (L) and the November 2020 Facebook video (R):", "The press conference was also reported by Philippine newspaper Inquirer here.", "The August 23, 2019 article reads, in part: “Parents of missing students formed and launched their own group to combat the militant group's persuasion of the young students.", "“According to the League of Parents of the Philippines, they want to protect and protect students against groups allied with the Communist Party of the Philippines (CPP) and the New People's Army (NPA).”", "AFP was not able to find credible reports of protests outside the Philippine elections commission calling for the expulsion of opposition lawmakers in Congress in November or December 2020.", "Photos shared here by the Philippine Star on Facebook in January, however, show a protest over the same issue outside the commission in January 2020.", "The claim was also debunked by Philippine news organisation Vera Files here in November 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]