["Barack Obama was the first president to have a robust digital strategy. His team was active on social media, and they constantly uploaded new content and tools to the White House website.", "But after President Donald Trump was sworn in on Jan. 20, 2017, some critics of the new administration noticed that pages about issues of importance to Obama are no longer accessible on whitehouse.gov.", "\"The White House removed its climate change web page. And the health care, civil rights and LGBT sections,\" tweeted George Takei, the former Star Trek actor who now has a large online fanbase.", "Takei is correct that as of Jan. 23, whitehouse.gov doesn’t have any specific information about climate change, health care, civil rights or LGBT issues. But these changes are routine and reflect the differences between Obama’s and Trump’s priorities.", "Back in October, the Obama administration laid out how it would manage the digital transition. The National Archives and Records Administration would preserve every piece of content the Obama administration published online — everything from blog posts and Tweets to transcripts and Snapchat stories.", "The National Archives would also freeze and archive any content posted to whitehouse.gov, then the Obama administration would hand over the domain to the Trump administration. The archived content is now accessible at ObamaWhiteHouse.archives.gov, including pages about climate change, health care, civil rights and LGBT issues.", "So if we’re going to be nit-picky, it was the Obama administration that removed whitehouse.gov’s pages about these issues, along with every other piece of content their team ever published.", "The Trump administration started off with a blank slate. When populating the website with their own content, they did not create pages about the four issues Takei mentioned. They did, however, create six pages about issues that defined the Trump campaign: energy, foreign policy, jobs and economic growth, military, law enforcement, and trade.", "The Obama team handled the whitehouse.gov transition in the same manner as the George W. Bush and Bill Clinton administrations. (Their websites are archived at georgewbush-whitehouse.archives.gov and clinton4.nara.gov, respectively.)", "The National Archives treats whitehouse.gov as a presidential record and follows the relevant regulations to preserve the content for posterity, while \"the new administration is free to shape a ‘new’ White House website going forward,\" said Douglas Cox, a law professor and expert in information policy at the City University of New York.", "Cox added as an aside that while whitehouse.gov is well-preserved from administration to administration, the websites for federal agencies may not be. So there is a bigger concern that federal records produced by the agencies in prior administrations may get lost.", "When the Obama team took over whitehouse.gov, they completely replaced all of Bush’s policy pages with 24 of their own, reflecting the new administration’s agenda, said Macon Phillips, who oversaw the website changes as Obama’s director of new media during the 2008 transition.", "The change from Bush’s version of whitehouse.gov to Obama’s was dramatic in its own way. While Trump kept the same digital platform the Obama team used, Obama’s transition team was working with a brand new one.", "Here’s a screenshot of whitehouse.gov on the morning of Jan. 20, 2009, the day of Obama’s inauguration, next to a screenshot from that same evening (found using the Internet Archive’s Wayback Machine):", "Phillips said the fact that the Trump website doesn’t have pages about things like LGBT issues and climate change isn’t really about the new administration removing pages — it’s more that his team just hasn’t made those issues a priority.", "\"Whitehouse.gov should reflect the priorities and point of view of the president. It’s a tool of that office,\" said Phillips, who just ended three years as coordinator of the State Department’s International Information Programs Bureau.", "The Trump administration did keep one notable page from the Obama administration’s whitehouse.gov: the We the People page, where the public can sign electronic petitions. Under the Obama administration, any petition to garner 100,000 signatures in under 30 days would receive a response from the White House.", "A petition for Trump to release his tax returns got more than 271,000 signatures in four days. It’s unclear if the new administration will officially respond to the petition.", "Our ruling", "Takei said, \"The White House removed its climate change web page. And the healthcare, civil rights and LGBT sections.\"", "It is literally accurate that since Trump became president, whitehouse.gov no longer has specific issue pages about health care, civil rights, LGBT issues or climate change. This reflects a difference in priorities between the Obama and Trump administrations.", "But it’s important to keep in mind that when the Obama administration handed the whitehouse.gov domain to Trump’s team, it was a blank slate. All of the online content published during Obama’s term was purged and archived. They’re now available on a website set up by the National Archives, as was done at the end of the Clinton and Bush administrations.", "While Takei’s claim has truth to it, this additional context is important, so we rate this claim Mostly True.", "Twitter, George Takei tweets, Jan. 20, 2017", "Internet Archive Wayback Machine, search conducted Jan. 23, 2017", "National Archives, \"Archived Presidential White House Websites,\" Jan. 18, 2017", "National Archives, \"Presidential Records (44 U.S.C. Chapter 22),\"", "Obama Whitehouse.gov, \"Change has come to WhiteHouse.gov,\" Jan. 20, 2009", "Obama Whitehouse.gov, \"The Digital Transition: How the Presidential Transition Works in the Social Media Age,\" Oct. 13, 2016", "Obama Whitehouse.gov, \"The Obama Administration Digital Transition: Moving Forward,\" Jan. 17, 2016", "Snopes, \"Climate Ch-Ch-Ch-Changes,\" Jan. 20, 2017", "NPR, \"Digital Transition Of Power Is Not So Peaceful,\" Jan. 20, 2017", "Email statement, actor and activist George Takei, Jan. 23, 2016", "Phone interview, Macon Phillips, former White House director of digital strategy, Jan. 23, 2016", "Email interview, National Archives spokesperson Laura Diachenko, Jan. 23, 2016", "Email interview, CUNY law professor Douglas Cox, Jan. 23, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]