["“I don’t want to see any tweet hating on Muslims for slaughtering animals, about 1 million animals killed each day by KFC, McDonald’s, Burger King etc. too feed the rich & make hella money out of it. During Eid Muslims sacrifice them to feed the poor for Free & Y’all lose ur mind.”, reads a screenshot of a purported tweet by billionaire and Microsoft co-founder Bill Gates. Twitter user Enver Baig posted the screenshot with a message praising Gates for his tweet.", "Your tweet is highly appreciated hope people around the world understand ISLAM, which is a religion of peace n harmony.@BillGates @realDonaldTrump @narendramodi @ImranKhanPTI pic.twitter.com/uHesj0PP1B", "— Enver Baig (@SenatorEB17) August 14, 2019", "A few more individuals on WhatsApp and Twitter have shared this screenshot believing it to be true.", "With a keyword on search on Bill Gates’ Twitter timeline, we found that he has never tweeted anything related to Eid or slaughtering. It is important to note here that had Gates opined on the religious sentiments of any particular community, it would have certainly attracted media attention around the world.", "Furthermore, Alt News found that Twitter handle @WolfieBabiee was one of the earliest to post this message on August 10, 2019. The tweet has garnered over 48,000 retweets so far. The tweet was then falsely attributed to Bill Gates.", "I don’t want to see any tweet hating on Muslims for slaughtering animals, about 1 million animals killed each day by KFC, McDonalds, Burger King etc. too feed the rich & making hella money out of it. During Eid Muslims sacrifice them to feed the poor for Free & y’all lose ur mind", "— Kurdistani (@WolfieBabiee) August 10, 2019", "[UPDATE: Due to an inadvertent error while transcribing the text from the screenshot, Alt News had mistakenly concluded that the tweet exceeded the 280 characters limit on Twitter. We regret the error.]", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]