["About this rating", "One study found that, compared with meat eaters, vegans and vegetarians had a higher risk of fractures due to several factors, including possibly lower intakes of calcium and protein.", "Given that this is only one study conducted within a limited population, researchers also concluded that more research into vegans' and vegetarians' bone health was required.", "A study published on Nov. 23, 2020, found that non-meat eaters, especially vegans, were at higher risk of experiencing bone fractures. The study was published in the BMC Medicine journal and was conducted by the European Prospective Investigation into Cancer and Nutrition’s (EPIC) Oxford University cohort.", "According to the study, previous research showed vegetarians had lower bone mineral density (BMD) — a measure of the amount of minerals contained in a certain volume of bone, also known as bone mass — than non-vegetarians, but associating vegetarian diets with fracture risks was unclear.", "Nearly 55,000 men and women across the United Kingdom responded to questionnaires in the beginning of the study between 1993 and 2001, and again in 2010. Respondents were categorized as meat eaters, fish eaters (did not eat meat but ate fish), vegetarians (did not eat meat or fish, but ate one or both of dairy and eggs), and vegans (participants who did not eat meat, fish, dairy, or eggs).", "The study concluded:", "Overall, we found that compared with meat eaters, vegans had higher risks of total, hip, leg, and vertebral fractures, while fish eaters and vegetarians had a higher risk of hip fractures. These risk differences were likely partly due to their lower BMI (Body Mass Index), and possibly to lower intakes of calcium and protein.", "We should note that there were several caveats. The study stated that \"bone health in vegans requires further research,\" and the study authors were operating with some limitations:", "More studies are needed especially from non-European and contemporary populations to examine the generalisability of our findings and to explore possible heterogeneity by factors including age, sex, menopausal status, and BMI.", "Nutrient intake was also self-reported by the participants instead of measured by the researchers, which could sometimes make the data less reliable. One potential concern they identified was the ability to capture all fracture cases: \"The outcome data were ascertained based on hospital records, which reduced misreporting and selective loss to follow-up, although a possible limitation of this approach was that less serious fractures that did not require hospitalisation would not have been captured.\"", "Based on the results of this one study and its caveats, we can state that this claim is a mixture of truth and falsehood.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]