["“Just a reminder, the 1st image was the capitol’s security during a Black Lives Matter protest, the second is from today,” says a January 6, 2021 Facebook post.", "The claim also appears on Facebook here and on Instagram here and here.", "Trump supporters on January 6 stormed a long planned session of Congress meant to certify Joe Biden's victory in the 2020 election, which the president has repeatedly and falsely claimed was plagued by widespread fraud, including in a speech shortly before the Capitol was breached.", "Security forces have been criticized over the US Capitol break-in, while their failure to keep the Trump supporters out has been contrasted with the often heavy handed response faced by Black protesters in the country.", "But the photo in the post does not show greater preparedness at the building during protests against racism and police brutality that followed unarmed Black man George Floyd’s death in police custody in 2020 -- it was taken at the Lincoln Memorial, a landmark at the opposite end of Washington’s National Mall.", "The image was taken by ABC News. Its caption reads: “National Guard deployed on the steps of the Lincoln Memorial during peaceful protests,in Washington, June 2, 2020.”", "AFP Fact Check has debunked other false or misleading claims related to Floyd’s death and the protests that followed here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]