["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "USA TODAY NETWORK WISCONSIN", "Tiffany claimed that Wisconsin officials asked residents not to recreate outdoors or go to the doctor", "Officials from the Department of Health Services said that they recommended telehealth visits instead of in-person appointments, to combat the spread of COVID-19", "Officials from the Department of Tourism said that they want residents to enjoy the outdoors, and have provided a toolkit to help them do it safely.", "U.S. Rep. Tom Tiffany, a Republican who won an open seat in Congress in a May 11, 2020 special election, is off to Washington -- but still has his sights set on state government and how it is handling the coronavirus crisis.", "Tiffany, who spent nearly seven years as a state Senator before winning the seat, tweeted this on May 26, 2020:", "\"First the health secretary says don't go to hospitals or clinics, now the tourism secretary says don't recreate. What next, the education governor saying no school this fall?\"", "The tweet linked to an online article from a Madison-based TV station. It came on the day Democrat Gov. Tony Evers’ stay-at-home order originally was going to expire. (The order was lifted May 13, 2020 under a state Supreme Court ruling.)", "We can’t look into the future, of course, so we’ll have to set aside the bit about what school may look like this fall. But we can look back and see what Department of Health Services secretary Andrea Palm and the Department of Tourism secretary Sara Meaney said in regard to the COVID-19 outbreak.", "Did Palm say \"don’t go to hospitals or clinics?\" And did Meaney say \"don’t recreate\"?", "No.", "And: Not exactly.", "When we asked Tiffany for backup for the claim, his staff pointed to a May 24, 2020 story from WMTV, a Madison-based NBC news affiliate, as it related to tourism and Meaney. This is the article that was linked in his tweet.", "With a headline of \"Wisconsin tourism officials encourage people to not travel to seasonal homes,\" the article noted Memorial Day weekend is the unofficial start of summer and went on to say:", "Travel Wisconsin urged people to stay at their permanent residences when the 'safer at home' order was first announced in March and a month later the department's stance hasn't changed.", "\"Straight up answer, as the Wisconsin Department of Tourism we are not advising that people travel outside their home communities to recreate,\" Sara Meaney, Secretary of Wisconsin Department of Tourism, said.", "The rationale: As people travel to cabins and summer homes, it could help spread the coronavirus and potentially overwhelm small healthcare systems in northern communities.", "In the article, Meaney acknowledged the state can’t stop people from traveling, and suggested those who do travel within the state take personal precautions, such as using face masks, and call ahead to see if any restrictions are in place where they are going.", "When asked about the statement, Department of Tourism spokesman Craig Trost pointed us to an online toolkit focused on ways to stay safe while enjoying the outdoors.", "The toolkit, created with help from the Department of Health Services, includes guides to safely enjoying parks and trails, going boating, fishing, cycling, camping and walking, using ATVs and UTVs, as well as a guide to going to the beach.", "The toolkit includes this line: \"We encourage all land managers, communities, and businesses that support outdoor recreation to use these tools to help create a consistent statewide message inviting Wisconsinites to get outside, stay safe, and be well.\"", "So, while Meaney discouraged state residents from traveling Up North, the department does not say to avoid any kind of recreation. What’s more, state parks are still open for hiking, along with many boat launches, trails and other recreational sites.", "When it comes to hospitals and clinics, a Tiffany staffer said the congressman was \"referring to the cancellation of elective surgeries, DHS encouraging patients to use virtual doctor visits instead of in-person, and DHS recommending that dentists postpone all elective treatments.\"", "But those examples have problems as well.", "The April 2, 2020 news release from the Department of Health Services, cited by Tiffany, called on residents to use telehealth options during the COVD-19 public health emergency.", "Department spokeswoman Jennifer Miller said the agency has never advised against going to see a doctor, but has supported using telehealth -- that is, video visits and the like -- in some cases to get care.", "\"We want people to stay connected to their medical providers now more than ever, and to call their doctor especially if they are experiencing symptoms of COVID-19,\" she said in an email.", "Indeed, health facilities -- including dentist offices -- were declared essential during Evers’ stay-at-home order. That said, some hospitals limited elective surgeries and some doctors cut back on in-person visits due to concerns over the transmission of the coronavirus. Likewise, any dentist offices delayed routine things, such as teeth cleanings.", "Those decisions were made by the health care providers and institutions, though, not mandated by the state. And those institutions have started to take in-person appointments and schedule surgeries again.", "Tiffany claimed top state officials called on residents not to travel and not to see doctors.", "While the tourism secretary discouraged folks from traveling to cabins and tourist areas in parts of the state with fewer hospital beds, the department website is focused on safe travel -- not no travel. And when it comes to seeing doctors, the health secretary advocated using virtual visits where possible, but did not suggest residents avoid treatment.", "We rate the claim Mostly False.", "Tom Tiffany on Twitter, May 26, 2020", "WMTV, \"Wisconsin tourism officials encourage people to not travel to seasonal homes,\" May 24, 2020", "Wisconsin Department of Health Services, \"Wisconsin encourages patients and providers to use telehealth options for health care visits during COVID-19 public health emergency,\" April 2, 2020", "Email conversation with Jennifer Miller, Department of Health Services spokesperson, May 27, 2020", "Email conversation with Craig Trost, communications director for the Department of Tourism, May 26, 2020", "Wisconsin Department of Tourism, \"Outdoors COVID-19 Toolkit,\" May 27, 2020\nMilwaukee Journal Sentinel, \"Wisconsin hospitals and clinics are planning how to bring patients back after thousands of postponed doctor visits and surgeries,\" May 7, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]