["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Devastating photos of wildlife caught in Australia’s unrelenting wildfires are circulating all over social media.", "And while some reports have estimated that nearly half a billion animals have died from the fires, we found that many included in one viral multi-photo post were not taken this fire season.", "Some of the photos were taken during previous fires in different countries, too, like this photo of a deer standing amid burned rubble in California.", "On its own, the viral deer image is uncaptioned. But it was posted as part of a photo gallery that included a post that reads in part, \"Huge wildfire in Australia has resulted in deaths of more than 480 milion animals.\"Australia’s bushfires. We rated that post Mostly False after finding that many of the images are several years old and weren’t taken in Australia to begin with.", "The image was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "After conducting a reverse-image search, we found that the deer image was taken by photographer Josh Edelson on Nov. 10, 2018, in Paradise, Calif.", "This photo shows the aftermath of the deadly Camp Fire that killed over 85 people and burned hundreds of thousands of acres in Northern California in 2018.", "This image is authentic, but it does not show destruction from Australia’s wildfires. Given the context in which it has been presented, we rate this viral image Mostly False.", "Facebook post, Jan. 4, 2020", "CNN, Millions of animals are dying from the Australian fires, and the environment will suffer for years to come, Jan. 7, 2020", "University of Sydney, A statement about the 480 million animals killed in NSW bushfires since September, Jan. 3, 2020", "PolitiFact, Several photos of animals in viral post not from Australia fires, or this year, Jan. 7, 2020", "Tin Eye, reverse-image search, Jan. 7, 2020", "Getty Images, US-FIRE-CALIFORNIA-ENVIRONMENT-WEATHER, Nov. 10, 2018", "SF Gate, Camp Fire: Death toll rises to 42 as coroner’s recovery crews find more bodies, Nov. 12, 2018", "PBS, Camp Fire: By the Numbers, Oct. 29, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]