["Around February 16 several Twitter and Facebook users copy-pasted a text that alleged Swedish climate change activist Greta Thunberg advised the Chinese government to stop using chopsticks to save trees.", "The full text reads, “I like the Chinese on this one. Greta Advised the Chinese to quit chopsticks to save trees. Chinese asked Greta & her friends to go back to school to learn that they’re made of Bamboos & that’s grass. And advised her not to use tissues to wipe her butt as they’re made from trees.”", "Twitter account @SortedEagle was among those who posted the claim.", "Columnist Rakesh Thiyya also shared this on Twitter.", "Similarly, Facebook page ‘Hindu‘ with over 80,000 followers made the same claim.", "Several Facebook users have posted this claim in the form of a screenshot of @SortedEagle‘s tweet. Whereas many others shared the image shared by Facebook page ‘Hindu’.", "This slideshow requires JavaScript.", "Alt News performed an advance keyword search on Twitter to check if Greta has tweeted about the alleged ban on chopsticks. We were unable to find any such tweet.", "No media reports suggest such a claim was made by Greta. The viral text suggests that China “advised her not to use tissues to wipe her butt as they’re made from trees” which is too absurd to be true.", "In 2006, BBC reported that the Chinese government is introducing a 5% tax on disposable wooden chopsticks in a bid to preserve its forests. In 2013, The Washington Post reported that Bo Guangxin, head of a major forestry group, told Chinese parliamentarians that China uses 20 million trees each year to feed the country’s disposable chopstick habit. In the same year, even South China Morning Post reported on the same.", "Last year, Norway-based Faktish, US-based Snopes and Reuters debunked this claim (1, 2, 3). As per Snopes and Reuters, the earliest posting of this hoax goes back to January 15, 2020 (IST) by Twitter user @Geoloong.", "Faktish stated that a Quora user posted “What do you think about Greta Thunberg asking China to ban chopsticks?” on January 20, 2020. As of today, the responses to this question has over 10 million views. Shorty after January 20, several Russian-language blogs made the viral claim (1, 2, 3 and 4).", "Reuters reported that last year the same claim was viral with a slight variation. The country was changed from China to Japan. The report added that the claim was also shared in Dutch and Danish on Facebook.", "Thus, in the backdrop of the Delhi police’s arrest of Bengaluru-based activist Disha Ravi, for allegedly editing the toolkit on farmers’ protest shared by Greta, several Indian social media users have revived a 2020 hoax that Greta asked the Chinese government to stop using chopsticks to save trees.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]