["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Sens. Tammy Baldwin, D-Wis., and Bernie Sanders, I-Vt., rallied in Milwaukee for Democrats ahead of the Nov. 6, 2018 elections. (Michael Sears/Milwaukee Journal Sentinel)", "One of the statistical claims Tammy Baldwin likes most, in debates or elsewhere on the campaign trail, is a slam on the tax reform measure that President Donald Trump signed into law in December 2017.", "Baldwin, a Wisconsin Democrat, is running against Republican Leah Vukmir in the Nov. 6, 2018 election, aiming to win a second term in the U.S. Senate.", "Baldwin recited the statistical claim again on Oct. 22, 2018 during a rally for Democrats in Milwaukee that featured U.S. Sen. Bernie Sanders, I-Vt. Referring to Vukmir, she said:", "All our Tammy Baldwin and Leah Vukmir fact checks in the U.S. Senate race.", "\"You know, my opponent backed that plan, where 83 percent of the benefits go to the top 1 percent of individuals and large multinational corporations on the corporate side.\"", "Is the GOP-backed law that favorable to the rich?", "Our colleagues have three times rated as Half True claims that are similar to Baldwin’s. Each claim cited an analysis of the tax law by the nonpartisan Urban Institute-Brookings Institution Tax Policy Center.", "The analysis found that by 2027, the law would deliver 82.8 percent of its benefits to the top 1 percent of the income spectrum.", "All our Tony Evers and Scott Walker fact checks in the governor’s race.", "However, in earlier years, the distribution of benefits would look very different, as PolitiFact National reported:", "For instance, in 2018, according to the center’s analysis, the bill would deliver 20.5 percent of the benefits to the top 1 percent — vastly less than the 83 percent figure the DNC touted.", "And as late as 2025, the center projected, 25.3 percent of the benefits would flow to the top 1 percent.", "Like us on Facebook. Follow us on Twitter: @PolitiFactWisc.", "The main reason: By 2027, a number of key tax provisions that benefit middle-income taxpayers will have expired unless Congress extends them. In addition, the new tax law changed how inflation was calculated, in a way that will be less generous to taxpayers as time goes on.", "(The Tax Policy Center said its work doesn’t allow for figuring out the cumulative gains and losses over the 10 years of the tax law. Its study published only single-year results and only for three years.)", "Baldwin’s statement is slightly different in that she refers not only to the top 1 percent of individuals but also large multinational corporations as enjoying 83 percent of the benefits of the law. But she, too, relies on the Tax Policy Center’s analysis.", "As it turns out, Baldwin’s phrasing doesn’t really make her claim materially different than the similar ones we’ve fact checked — at least with regard to how the analysis that she relies on was done.", "Joseph Rosenberg, a senior research associate at the Tax Policy Center, told us: \"Corporations legally pay taxes. But a corporation is just an entity that is truly owned by individuals who bear the economic burden of the tax.\"", "Kyle Pomerleau, an economist with the nonpartisan Tax Foundation, had a similar take. He told us: \"When thinking about the distributional impact of tax changes, you should only look at how it ultimately affects people, as corporations are little pieces of paper in a filing cabinet somewhere — they can’t really feel the burden of any tax.\"", "In other words, despite the variation in phrasing, Baldwin’s statement isn’t any more accurate than the previous statements we’ve checked.", "Baldwin says that under the Republican tax reform law, \"83 percent of the benefits go to the top 1 percent of individuals and large multinational corporations.\"", "Even though her statement mentions corporations, it isn’t materially different than three similar statements we’ve checked.", "In a nutshell, the analysis that all four statements rely on found that by 2027, the law would deliver 82.8 percent of its benefits to the top 1 percent of the income spectrum. However, in earlier years, the distribution of benefits would look very different, with much smaller percentages of the benefits  — 20 to 25 percent — going to the top 1 percent.", "Baldwin’s statement is partially accurate but leaves out important details  — our definition of Half True.", "YouTube, Tammy Baldwin campaign rally remarks (1:12:30), Oct. 22, 2018", "Email, Tammy Baldwin campaign spokesman Bill Neidhardt, Oct. 26, 2018", "Email, Leah Vukmir campaign spokesman Jahan Wilcox, Oct. 25, 2018", "PolitiFact Texas, \"Lloyd Doggett says 80 percent of Republican-sought tax cuts flow to wealthiest 1 percent,\" Oct. 20, 2017", "PolitiFact National, \"Nevada TV ad cherry-picks tax cut benefits to top 1%,\" July 10, 2018", "PolitiFact National, \"DNC offers one-sided view on who gets tax bill's benefits,\" Jan. 16, 2018", "Urban Institute-Brookings Institution Tax Policy Center, \"Distributional Analysis of the Conference Agreement for the Tax Cuts and Jobs Act,\" Dec. 18, 2017", "FactCheck.org, \"Democrats’ Misleading Tax Line,\" Jan. 26, 2018", "Interview, Joseph Rosenberg, senior research associate with the Urban Institute-Brookings Institution Tax Policy Center, Oct. 26, 2018", "Email, Cato Institute director of tax policy studies Chris Edwards, Oct. 26, 2018", "Email, Tax Foundation economist and Center for Quantitative Analysis director Kyle Pomerleau, Oct. 26, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]