["Rep. Steve Scalise, R-La., talks about the federal response to COVID-19 on ABC News. (Screenshot)", "About $1 trillion remains to be disbursed, but a large share of it has been allocated or is scheduled to be spent.", "Most of the unspent money was approved in late December, and it takes time to distribute it.", "As the economy recovers, some of the money might not be spent.", "House Democrats are forging ahead with a vote on a $1.9 trillion package to address the coronavirus and fix the economic damage that cost about 10 million people their jobs. Rep. Steve Scalise, second in command of the House Republicans, said that he and his colleagues support spending more to overcome the pandemic, but that the Democratic plan is chock full of unneeded giveaways.", "\"There's over a trillion dollars of money unspent from previous relief bills that were bipartisan,\" Scalise, R-La., said Feb. 21 on ABC’s This Week. \"The money's still sitting in a bank account and we're going to pass $1.9 trillion of additional spending to bail out failed states, to raise the minimum wage? What does that have to do with COVID?\"", "The claim that there is $1 trillion left over from earlier efforts is a top Republican talking point. Scalise led with the same argument in a Feb. 19 op-ed.", "His source is the COVID Money Tracker, a project of the Committee for a Responsible Federal Budget, a group focused on reducing federal deficits. The tracker’s latest number shows that out of $4.1 trillion approved by Congress, about $3 trillion has been committed or disbursed.", "But in a Jan. 27 blog post, the budget group warned that figuring out how much money remains is complicated. It’s not, they wrote, as though the money is \"sitting in budget accounts waiting to be allocated.\"", "\"Much of it is already allocated or scheduled to be spent, and a small portion will never be spent,\" they wrote.", "A large fraction of the nominally unspent money comes from the Response and Relief Act, passed in late December.", "\"These funds will take some time to disburse and even more time to appear in the data,\" they said.", "About a fifth of the money that Scalise counted will be spent over several years, primarily in the form of Medicaid dollars and a lending program called Economic Injury and Disaster Loans.", "Part of the uncertainty, the committee’s analysts wrote, is that some of the money allocated in earlier bills might never be spent. For example, the CARES Act that passed in March extended unemployment benefits at an estimated cost of $250 billion. But as of right now, that seems to overshoot the need, they said. The amount of the excess would make Scalise’s $1 trillion number a bit lower.", "Setting aside the December relief package, about 80% of previously allocated funds have been spent, they said.", "The federal government has its own COVID-19 relief spending tracker. It counts dollars differently than the one Scalise used, and it hasn’t been updated since the end of December. By its accounting, out of a total of $2.4 trillion that Congress approved, about $500 billion remains unspent and unobligated.", "If federal dollars go unspent, that might suggest that certain programs need to be redesigned. Molly Reynolds, a senior fellow in governance studies at Brookings, a Washington research group, said it could be that the way Congress set up a program made it too hard for the money to get to the people and businesses that needed help.", "That, however, is a separate question from the size of the relief bill.", "\"Ultimately, it may be the case that unspent funds mean that the next package should be smaller, but I don’t think that’s the first conclusion one should necessarily draw from any existence of unspent funds,\" Reynolds said.", "Even money that Washington has disbursed can be held up at the state level. Massachusetts has spent about half of the $2.7 billion it got through the CARES Act, the Boston Globe reported. Missouri officials left about $13 million for small farms and businesses unused.", "Scalise said, \"There's over a trillion dollars of money unspent from previous relief bills ... still sitting in a bank account.\"", "Scalise’s point-in-time figure is in line with one running tally, but he oversimplified the status of the funds. A large share of the total is already allocated or scheduled to be spent. A key factor is that Washington is getting up to speed in disbursing funds approved in late December.", "The money is not sitting in budget accounts, but neither has it reached its final destination..", "We rate this claim Half True.", "ABC News, This Week, Feb. 21, 2021", "Washington Post, We already went ‘big’ on coronavirus relief. More of the same won’t solve the problem., Feb. 19, 2021", "Committee for a Responsible Federal Budget, COVID Money Tracker, accessed Feb. 22, 2021", "Committee for a Responsible Federal Budget, How Much COVID Relief Money Is Left?, Jan. 27, 2021", "Committee for a Responsible Federal Budget, What’s New in COVID Money Tracker?, Jan. 27, 2021", "Committee for a Responsible Federal Budget, What's in the $1.9 Trillion House COVID Relief Bill?, Feb. 18, 2021", "USASpending.gov, COVID-19 spending, Dec. 31, 2020", "USA Facts, The $2 trillion CARES Act, April 5, 2020", "Boston Globe, More than $1 billion in federal stimulus cash still unspent, Feb. 14, 2021", "The Missourian, Millions in CARES money for businesses, farms unspent, Feb. 9, 2021", "Email exchange, Molly Reynolds, senior fellow, Governance Studies, Brookings Institution, Feb. 22, 2021", "Email exchange, John Buhl, director of medial relations, Committee for a Responsible Federal Budget, Feb. 22, 2021", "Email exchange, Lauren Fine, communications director, Office of House Republican Whip Steve Scalise, Feb. 22, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]