["“We need to bring more awareness to these horrific tragedies,” reads a Facebook post shared more than 24,000 times since June 8, 2020. “Children are disappearing by the thousands I’m sure into child trafficking, sex Trafficking, Organ Harvesting, Cheap Labor, used for experimental drugs/ treatments...”", "Two images included in the post appear to depict children covered with foil blankets and held in steel cages.", "The post further claims that the minors are being kept in privately-owned facilities that are untraceable in the US.", "A reverse image search on Google located the two pictures in an article by Forbes entitled Disturbing Pop-Up Art Installations Depict Kids In Cages, which credits the images to a US-based immigration centre known as the Refugee and Immigrant Center for Education and Legal Services (RAICES).", "In June 2019 (as reported here and here) RAICES launched a public art activism project across New York City known as the #NoKidsInCages campaign, calling attention to the treatment of immigrant children at the US border.", "The campaign, which used sculptures to depict children huddled on the floor of a tiny cage and draped in a foil blanket, urged Americans to pressure legislators to pass the Keep Families Together Act in order to avoid children being separated from their families at the border.", "Zero-tolerance policy", "On April 6, 2018, US President Donald Trump’s administration announced a “zero-tolerance policy” on immigrants aimed at prosecuting people entering the country illegally. The policy led to the forceful separation of children from their parents, with the adults and minors held in separate detention facilities. Criticism followed from lawmakers and human rights groups.", "Democratic Senator Jeff Merkley told CNN that he saw children being held in “wire-mesh, chain-linked cages” when he visited a detention center on the South Texas border.", "Days after announcing his policy, Trump signed an executive order rescinding forceful family separation, but a 2019 Human Rights Watch report indicated that migrant children were still being separated from their families at the border.", "#NoKidsInCages", "The #NoKidsInCages campaign emerged from these immigration realities in the US and the artistic works depicting children held in cages were intended to push for better legislation.", "The pictures have nothing to do with actual child trafficking as purported in the Facebook post.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]