["About this rating", "On. Feb. 22, 2021, 31 House Democrats sent a letter to Biden asking him to support proposals to expand the number of people who must approve the use of nuclear weapons beyond just the president.", "Nothing in the letter mentioned Biden's mental fitness or indicated that the request was a result of his election. Rather, it referenced the behaviors and threats of \"past presidents\" as reasons for the proposed change.", "In late February 2021, conservative commentators including Fox News Channel personality Sean Hannity claimed a group of U.S. House Democrats were urging President Joe Biden to relinquish his authority as the only American who can start a nuclear war because of his mental fitness.", "The alleged request, according to Hannity, was an example of bipartisan support for stripping the 78-year-old president of executive functions because of his supposedly declining health. (See here for the most recent medical summary of Biden's health, as of this writing, authored by his doctor in December 2019.)", "The claim was multi-pronged and alleged that Biden's cognitive functioning was the sole motivator for members of his own party to supposedly submit a formal request to change U.S. nuclear policy.", "Under provisions outlined in the Constitution, the president is the only American with legal authority to authorize the use of nuclear weapons. The commander-in chief can, of course, seek advice from people close to him before making such a decision, though no federal statute requires the president to take that step.", "\"The President does not need the concurrence of either his military advisors or the U.S. Congress to order the launch of nuclear weapons,\" reads a 2020 congressional record outlining the command-and-control structure.", "That said, it was true that more than 30 House Democrats authored a letter in February 2021 asking the president to support legislative proposals to change the existing system so that no single person (the president) can start a nuclear war, according to letter authors and news reports.", "Rep. Jimmy Panetta, a Democrat serving central-western California, led the request, according to Politico and his official Twitter account. We reached out to his office for a copy of the document and to learn his motivation for spearheading the initiative, but we have not heard back on those inquiries. We will update this report when, or if, we do.", "To author the memo to Biden, Panetta partnered with Rep. Ted Lieu, another Democrat from California, according to their social media posts. Sharing the below-displayed screenshots of the letter, Lieu tweeted on Feb. 24: \"No one person should have the ability to start a nuclear war.\"", "In short, the letter asked the president to support legislation to change the current structure because \"past presidents\" have threatened using the authority to attack other countries when their own administration or U.S. military officials felt they were not exercising good judgement.", "Additionally, the letter proposed ideas for a new system. Those recommendations included establishing guidelines so that officials in the presidential line of succession, such as the vice president and House speaker, must weigh in on the matter; Congress must declare war and authorize any potential strike before it can happen; and military officials must sign off on any potential launch.", "\"As president, you will have the final say on any changes to U.S. nuclear policy,\" the letter reads. \"We respectfully request that you, as president, review ways in which you can end the sole authority you have to launch a nuclear attack, and to install additional checks and balances into the system.\"", "Let this be clear: Nowhere in the document did its authors say they were pushing for the above-mentioned changes because of Biden, whether due to his health or because of any other reason.", "In addition to Panetta and Lieu, 29 lawmakers signed the letter, all of whom are House Democrats. They were Donald Beyer (Virginia); Katherine Clark (Massachusetts); Peter DeFazio (Oregon); Eleanor Holmes Norton (District of Columbia); Ro Khanna (California); Barbara Lee (California); Chellie Pingree (Maine); Bobby Rush (Illinois); Thomas Suozzi (New York); John Garamendi (California); Earl Blumenauer (Oregon); Steve Cohen (Tennessee); Dwight Evans (Pennsylvania); Jared Huffman (California); Daniel Kildee (Michigan); James McGovern (Massachusetts); Mark Pocan (Wisconsin); Michael San Nicolas (Guam); Bonnie Watson Coleman (New Jersey); Nydia Velazquez (New York); Andre Carson (Indiana); Jim Costa (California); Bill Foster (Illinois); Pramila Jayapal (Washington); Rick Larson (Washington); Ilhan Omar (Minnesota); Ayanna Pressley (Massachusetts); Mikie Sherrill (New Jersey); and Peter Welch (Vermont).", "Linking to a news report featuring the letter, Panetta advertised the letter in a Feb. 25 Facebook post as an effort to eliminate problems with the current system that threaten people's safety. \"What some may not realize is there are inherent risks in our present system, as was made apparent by our ex-president,\" Penetta said, referring to former President Donald Trump.", "Snopes reached out to Biden's press office for the president's response to the Democrats' letter and whether his administration would support legislation that would relinquish the president's command authority to launch nuclear weapons, but we did not receive a response.", "In sum, while it was true 31 House Democrats signed a Feb. 22 letter asking Biden to expand the number of people who must sign off on a nuclear launch, nothing in the memo — or any other evidence — showed the request was a result of Biden's mental fitness. Rather, the letter explicitly mentioned how threats and behaviors of \"past presidents\" supposedly warranted the proposed changes to the country's command-and-control structure. For those reasons, we rate this claim a \"mixture\" of truth and false information.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]