["About this rating", "The bill would allow a court to order an individual to surrender their firearms and to authorize law enforcement agents to search an individual's property for firearms and confiscate them if necessary.", "The order could only be issued on the basis of evidence that an individual posed a significant danger to herself/himself or others, due to mental health issues or for other reasons; the order would be temporary.", "In the spring of 2018, Colorado state legislators debated a proposed a law which would allow for the creation of an \"extreme risk protection order,\" whereby a court — if it believes an individual poses a significant threat to him or herself or to others — could order that individual to hand over their guns.", "In response, the right-wing Facebook page \"1776 We the People\" posted a meme labelling the proposal a \"gun confiscation bill,\" and claiming that it would \"strip our second amendment rights away from us.\" The 5 May post that accompanied the meme read:", "A sad day in the Colorado State House as the Democrat majority voted in lockstep to STRIP our second amendment rights away from us. The so-called Red Flag bill threatens every law-abiding gun owner in Colorado and sets a precedent for other states to follow.", "The meme itself reads: \"House Democrats passed gun confiscation bill HB18-1436 on third reading\" and features a photograph of Alec Garnett, a Democratic state representative and one of the bill's main sponsors:", "The bill does allow for the lawful confiscation of a person's firearms, but only under very narrow circumstances, only on a temporary, emergency basis, and in the interest of protecting the safety of gun-owners and those around them. House Bill 1436 is similar to a law passed in Oregon in August 2017, which also mandated the extreme risk protection order (ERPO) and which also prompted similarly exaggerated descriptions from advocates for liberal gun laws.", "In reality, this is how the ERPO would work in Colorado, according to the most up-to-date version of the bill as of 9 May 2018:", "Temporary ERPO (seven days)", "Continuing ERPO (182 days)", "Ending or renewing an ERPO", "The ERPO set out in H.B. 1436 does not \"strip away\" any rights wholesale. In only one instance (the initial temporary ERPO) is it possible for a court to order the confiscation of firearms without hearing evidence from the person who owns them (an \"ex parte\" hearing.) Even then, that order only lasts a maximum of seven days.", "At every stage after that, the burden of evidence and proof is on the person requesting the confiscation. If a petitioner doesn't present good enough evidence for a 182-day ERPO, it won't be issued and the gun owner will get their guns back. If a petitioner doesn't present good enough evidence at a termination hearing, the ERPO will be ended and the gun owner will get their guns back. If the petitioner doesn't request a renewal and also convince the judge, for the third time, then the ERPO won't be renewed, and — you guessed it — the gun owner will get their guns back.", "Similarly, a petitioner must submit their evidence to the court along with an affidavit, signed under oath and on penalty of perjury. This means that if they are found to have knowingly, deliberately misstated the facts in their request for an ERPO, they could face a perjury conviction, a felony which could land them in prison for between two and six years.", "This is likely to discourage anyone who might otherwise attempt to abuse the ERPO or use it to harass someone who is not genuinely a threat.", "Finally, the \"1776 We the People\" page is right to point out that the bill was passed by a Democratic majority in the Colorado House of Representatives, but it omits that one of its three main sponsors is a Republican — Rep. Cole Wist, who in 2016 got an A rating from the National Rifle Association, which describes him as a \"solidly pro-gun candidate.\"", "On 4 May, the Democratic-controlled House passed the bill by 37 votes to 23, with only two Republicans voting in favor of it. H.B. 1436 will now go before the Republican-controlled state Senate, where its chances of passing into law appear slim. Wist himself told his House colleagues that the bill is \"likely to die when it leaves this chamber.\"", "MacGuill, Dan.  \"Did Oregon's Governor Sign a 'Gun Confiscation' Law?\"\r\n  Snopes.com.  24 August 2017.", "Garnett, State Rep. Alec; Wist, State Rep. Cole; Court, State Sen. Lois.  \"House Bill 18-1436 -- Concerning Creation of an Extreme Risk Protection Order.\"\r\n  Colorado General Assembly.  Reengrossed 4 May 2018.", "Colorado Revised Statutes.  \"Title 18, Article 8, Part 5, Section 502 -- Perjury in the First Degree.\"\r\n  Colorado General Assembly.  2017.", "Colorado Revised Statutes.  \"Title 18, Article 1.3, Part 4, Section 401 -- Felonies Classified, Presumptive Penalties.\"\r\n  Colorado General Assembly.  2017.", "Colorado Revised Statutes.  \"Title 18, Article 8, Part 5, Section 501 -- Misdemeanors Classified, Drug Misdemeanors and Drug Petty Offenses Classified, Penalties, Definitions.\"\r\n  Colorado General Assembly.  2017.", "Paul, Jesse.  \"Colorado 'Red Flag' Gun Bill Passes Democratic-Controlled House -- But With Almost No GOP Support.\"\r\n  Denver Post.  4 May 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]