["About this rating", "A gif of a snail turning its head and seemingly watching a car drift around a bend in a road is a genuine, undoctored piece of footage.", "It's unclear if the snail was reacting to the sight of the car, the vibrations of the vehicle, or if the movement was coincidental.", "An animated GIF purportedly showing a snail watching a race car drifting around a bend in a road is frequently shared on social media:", "This brief clip is often followed by comments questioning the authenticity of the footage, including those from viewers curious whether snails even have the ability to see a car traveling at this distance. Others appeared skeptical because the clip was reminiscent of the animated movie \"Turbo,\" a film about a small snail with a big dream of moving fast:", "While this clip may appear to be taken straight from a cute animated flick, this is a real video of a snail captured during an auto race. This video was first posted to the YouTube page of World Rally Championship (WRC) Paraguay driver Victor Lopez in May 2019, and the original clip (which can be viewed below) contains about 10 extra seconds of footage:", "While this video appears to be authentic (the WRC Rally Paraguay Victor López YouTube page doesn't seem to dabble in online trickery), what exactly it shows is open to interpretation.", "We doubt that this snail was actually \"watching\" this car drift around the bend. While snails do have eyes (attached to two tentacles protruding from their heads), their sense of sight isn't particularly adept, as Snail-world.com writes:", "The sense of sight of snails is useful but only detect changes in the intensity of light to recognize whether it is night or day. They can move their tentacles up or down to improve their ability to see. However, they are practically deaf since they have no ears nor ear canal. To compensate this absence of hearing they have an excellent associative thought which helps them remember the places where they were or where the objects of their surroundings are.", "Robert Nordsieck, author of The Living World of Molluscs website, notes that a snails' sense of sight varies depending on the species. Generally speaking, however, snails have cup-shaped eyes that function like a pinhole camera, giving snails the ability to see light and dark, but they aren't great at distinguishing sizes and shapes:", "How a cup-shaped eye is constructed clearly limits its visual abilities. Cup shaped eyes can only tell the difference between light and dark and also they can see where the light comes from. But they cannot distinguish forms and they can certainly not see any pictures.", "The following image comparison from London's Natural History Museum shows the difference between how humans and common garden snails see the world:", "In sum, this is a genuine clip of a snail at the side of an auto race, but we're not convinced the snail was actually \"watching\" the race. If the snail truly saw this car drifting around a turn, it's unlikely the critter knew what it was seeing. It's also possible that this snail was oblivious to the HRC race taking place just over this ridge, and that the video merely shows the snail reacting to vibrations or engaging in a coincidental movement at the moment a car zoomed by below.", "Hendry, Lisa.   \"How Do Other Animals See the World?\"\r\n    Natural History Museum.   15 July 2016.", "Nordsieck, Robert.   \"The Eyes of Snails.\"\r\n    The Living World of Molluscs.   Retrieved 21 October 2019.", "Snail-world.com.   \"Snail Anatomy.\"\r\n    2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]