["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate and former Vice President Joe Biden speaks during a community event on Aug. 7, 2019, in Burlington, Iowa. (AP/Neibergall)", "There’s no evidence that Joe Biden owns a private island near Little St. James, Jeffrey Epstein’s island in the U.S. Virgin Islands.", "There’s no evidence that former Vice President Joe Biden owns a private island near Little St. James, the spot in the U.S. Virgin Islands where the late financier Jeffrey Epstein was accused of running a sex trafficking ring before he died in jail in 2019.", "But that hasn’t stopped the spread of images on social media that make this false claim.", "The image is the latest in a series of online rumors linking high-profile celebrities, journalists and politicians to Epstein or Ghislaine Maxwell, the woman facing charges for allegedly recruiting victims for Epstein to sexually abuse. \"Do you want to know who owns this private island that is next to Epstein’s and has Maxwell’s sub(marine) sitting in it? Joe Biden!\" it says.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Reuters and AFP have already found it to be inaccurate.", "Public property records for the U.S. Virgin Islands, a U.S. territory, show no results as of Aug. 11 for Joe Biden. They do show results for Biden’s younger brother James and his wife Sara.", "James Biden bought an acre of land with ocean views on nearby Water Island in 2005 and later resold a third of it to a lobbyist, according to a January report from Politico. Google Maps shows Water Island is slightly over 8 miles from Little St. James, which Epstein purchased in 1998.", "The Politico report said it was not clear whether Joe Biden was aware of his brother’s dealings related to the Water Island property. The former vice president has vacationed elsewhere on the island at least three times, the report said. But there’s no sign of any ownership by Joe Biden.", "There’s no reference to any Caribbean property in Biden’s financial disclosures from 2020 and 2019 or his federal tax returns from 2018, 2017 and 2016, as other fact-checkers have noted. Those forms are available on his campaign website. PolitiFact also found no credible reports of Biden owning a Caribbean island on Google or the Nexis news database.", "Biden campaign spokesperson Andrew Bates told AFP that Biden \"does not and never has\" owned any property in the U.S. Virgin Islands or anywhere else in the Caribbean.", "Biden and his wife Jill own two properties in Delaware, where Biden served as a senator for decades. They have their primary residence in Wilmington, and another home in Rehoboth Beach. They also rent a home in McLean, Va., according to the Washington Post.", "According to Google Maps, the nearest islands to Epstein’s Little St. James are Great St. James Island, which Epstein also bought in 2016, and Dog Island. As AFP first reported, Google Maps shows no obvious buildings or other signs of habitation on Dog Island.", "The Facebook image also says the FBI found \"multiple skeletons\" in the water around Epstein’s island. PolitiFact previously examined online claims that the bones of children were found on Epstein’s island. We rated those claims False.", "A Facebook post says Biden owns a private island next to Epstein’s.", "There’s no public evidence that’s the case. The recorder of deeds for the U.S. Virgin Islands, which includes Esptein’s Little St. James, shows no results in its database for Joe Biden.", "We rate this post Pants on Fire!", "Facebook post, July 20, 2020", "Various searches on the U.S. Virgin Islands recorder of deeds database, Aug. 11, 2020", "Various searches on Google Maps, Aug. 11, 2020", "Various searches on Google and Nexis, Aug. 11, 2020", "Property records searches for Sussex County, Delaware, Aug. 11, 2020", "Biden for President, \"Financial Disclosures & Tax Returns,\" accessed Aug. 11, 2020", "Check Your Fact, \"Fact Check: Does Joe Biden Own an Island Near Jeffrey Epstein’s Little St. James?\" Aug. 7, 2020", "AFP, \"Joe Biden does not own island next to sex offender Jeffrey Epstein’s hideaway,\" July 31, 2020", "Reuters, \"Fact check: Joe Biden does not own island in the U.S. Virgin Islands,\" July 15, 2020", "Politico, \"Lobbyist bought tropical land from Biden’s brother,\" Jan. 28, 2020", "The New York Times, \"Epstein’s Island, ‘Little St. Jeff’s’: A Hideaway Where Money Bought Influence,\" Aug. 28, 2019", "Forbes, \"Here's How Much 2020 Presidential Candidate Joe Biden Is Worth,\" Aug. 28, 2019", "PolitiFact, \"No, the ‘bones of children’ were not discovered on Jeffrey Epstein’s private island,\" Sept. 4, 2019", "PolitiFact, \"How do the Democrats running for president really live? A look at their homes, wealth,\" Aug. 22, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]