["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former Secretary of State Hillary Clinton shakes hands at a presidential campaign event in North Las Vegas, Nev., on Aug. 18, 2015. (Getty Images)", "Hillary Clinton is contrasting her plan to overhaul federal assistance for tuition at public colleges with her potential GOP rivals by saying Republicans haven’t even considered the issue.", "\"Not one of the 17 GOP candidates has discussed how they'd address the rising cost of college,\" said in an Aug. 23, 2015, tweet. \"Disappointing, but not surprising.\"", "What is a little surprising to PolitiFact Florida is that Clinton’s tweet omits at least one candidate who has made college costs a major platform plank — the Sunshine State’s Sen. Marco Rubio.", "Rubio said as much by tweeting back the same day, saying Clinton \"can't lecture me on student loans. I've had student loans & I have a plan to modernize higher ed.\" He then linked to a statement on his website excoriating Clinton for planning to put tax dollars into an \"outdated system.\"", "Clinton’s own idea is a 10-year, $350 billion plan called the \"New College Compact.\" Clinton proposed in August to allow students to attend public colleges without taking out loans to pay tuition. Families would be required to contribute and federal spending would be expanded, but with controls on spending by colleges and universities. Clinton’s campaign has not offered many details beyond the price tag and told PolitiFact Florida they had nothing to add to her tweet.", "Rubio has been talking about the issue since at least February 2014, when he made a major policy speech about controlling crippling college debt. He repeated his positions in a July speech after he declared his candidacy.", "His plan includes several specific ideas:", "Some other candidates have also brought up tuition increases, student debt and federal spending on higher education. In June, New Jersey Gov. Chris Christie laid out several ideas for reforming post-secondary education with an eye on reining in costs.", "Christie suggested itemized tuition bills that detailed what the money was paying for; allowing students to pay just for classes and not facilities or add-ons; and letting students obtain private financing for college with an option to pay it back with a percentage of earnings after graduation. He also floated ideas of providing tax credits for apprenticeship programs and for donating to debt reduction organizations that help students pay for schooling in exchange for community service.", "Carly Fiorina, the former technology executive, said in a July Q&A on Breitbart.com that student debt was out of control because \"the federal government under Democrats has nationalized the student loan business.\" She suggested letting private banks compete for student loans. She also said the accreditation process should allow for more for-profit universities and online courses.", "Sen. Rand Paul of Kentucky said in April 2015 he thought college tuition should be tax deductible, although he did not offer specifics of how that plan should work.", "Former Florida Gov. Jeb Bush earlier in August sparred with Clinton on Twitter about tuition, while Ben Carson, a former pediatric neurosurgeon, in February wrote a Washington Times editorial suggesting needy people should get jobs if they require help paying for college.", "Other candidates have been even less vocal on the subject, saying simply that college costs are a problem that have been dealt with, or nothing at all.", "Our ruling", "Clinton said, \"Not one of the 17 GOP candidates has discussed how they'd address the rising cost of college.\"", "While some Republican hopefuls haven’t had much to say on the issue, it’s not accurate to say none of them have. Rubio has made higher education spending a major plank of his campaign, and other candidates like Christie and Fiorina have set forth ideas and positions. Other candidates have at least mentioned the subject at times.", "We rate Clinton’s statement False.", "Twitter, Hillary Clinton tweet, Aug, 23, 2015", "Twitter, Marco Rubio tweet, Aug. 23, 2015", "Hampton Roads Daily Press, \"Gilmore’s Tuition Plan,\" Dec. 15, 1998", "Inside Higher Ed, \"Santorum and Higher Ed,\" March 9, 2012", "Marco Rubio press release, \"Rubio Proposes Ideas For Higher Education Reform At Miami-Dade College,\" Feb. 10, 2014", "U.S. News & World Report, \"Marco Rubio Calls for 'Student Investment Plan,' More Choice in Higher Education,\" Feb. 10, 2014", "Washington Times, \"The payoff of a good education,\" Feb. 3, 2015", "Cleveland Plain Dealer, \"Gov. John Kasich's budget gives colleges more money, allows tuition increase of 2 percent for one of two years,\" Feb. 2, 2015", "Columbus Dispatch, \"Kasich warns colleges to cut the fat, or else,\" Feb. 11, 2015", "Los Angeles Times, \"Rand Paul tells college students tuition should be tax deductible,\" April 10, 2015", "Milwaukee Journal-Sentinel, \"Scott Walker moves to limit future UW tuition increases to inflation,\" April 13, 2015", "U.S. News & World Report, \"Walker Plan to Tie Tuition to the CPI Has Already Failed,\" April 15, 2015", "Huffington Post, \"Will Lindsey Graham’s Pro-Lender Views Connect with Graduates with Student Loans?,\" May 1, 2015", "Huffington Post, \"Will Rick Santorum's Stance on Student Loans Benefit Borrowers?,\" May 12, 2015", "Center on Budget and Policy Priorities, \"Years of Cuts Threaten to Put College Out of Reach for More Students,\" May 13, 2015", "Washington Post Wonkblog, \"Rick Perry promises to ‘do something’ about student debt. But what did he do in Texas?,\" June 5, 2015", "Des Moines Register, \"Christie explains why colleges 'drunk on cash' drive him crazy,\" June 12, 2015", "Business Insider, \"Marco Rubio has a wild plan to have investors pay for college and make money off students' future earnings,\" July 7, 2015", "The Advocate, \"Gov. Bobby Jindal bemoans higher-education tuition increases as he presides over a state with one of worst records in nation on moderating them,\" July 12, 2015", "The Hill, \"Jindal blasts Clinton's ‘failed’ economic ideas,\" July 12, 2015", "Breitbart.com, \"Ask Carly: Education,\" July 27, 2015", "PolitiFact, \"Hillary Clinton says 'not one' GOP presidential contender backs path to citizenship,\" May 7, 2015", "Wall Street Journal, \"Hillary Clinton Proposes Debt-Free Tuition at Public Colleges,\" Aug. 10, 2015", "PolitiFact Florida, \"PAC accuses Rubio of favoring for-profit colleges in education plan,\" Aug. 12, 2015", "The Atlantic, \"The 2016 U.S. Presidential Race: A Cheat Sheet,\" Aug. 12, 2015", "PolitiFact, \"Jeb Bush, Hillary Clinton and college affordability: a Twitter battle,\" Aug. 14, 2015", "MarcoRubio.com, \"Here’s How We Modernize Our Antiquated, Broken Higher Education System,\" accessed Aug. 23, 2015", "MikeHuckabee.com, \"Common Sense Education,\" accessed Aug. 25, 2015", "Interview with Brooke Sammon, Rubio spokeswoman, Aug. 24, 2015", "Interview with Joshua Schwerin, Clinton spokesman, Aug. 25, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]