["The video was shared on YouTube on January 20, 2021. It has been viewed more than 450,000 times.", "\"PRES. DUTERTE CURSES AT TITO SOTTO AND VILMA SANTOS FOR BEING CORRUPT,\" the Tagalog-language caption reads.", "The clip circulated online following news reports that Senator Vicente Tito Sotto and House of Representatives Deputy Speaker Vilma Santos Recto filed bills to renew the operating licence of Philippine broadcaster ABS-CBN.", "ABS-CBN was forced off air in May 2020 after proposals to extend its franchise languished in Congress. Duterte had accused the network of failing to broadcast his 2016 campaign advertisements. The move attracted criticism from press freedom advocates.", "The 10-minute video begins with Duterte spewing Tagalog-language profanities. A voiceover can then be heard saying: \"President Rodrigo Duterte without hesitation cursed at senators and congress members who put their interests and personal agenda first. This was after Tito Sotto at the Senate and Vilma Santos Recto at the House of Representatives filed bills to revive the franchise of ABS-CBN. Duterte fumed at ABS-CBN after it accepted payment for his campaign ads in the 2016 national elections but did not air them on TV. Here is President Duterte's full statement.\"", "The video then loops a clip showing Duterte speaking at an event.", "An identical video was also shared here, here and here on Facebook; and in blogs here and here alongside a similar claim.", "The claim is false.", "Keyword searches on Google found the video corresponds to a speech Duterte gave on May 19, 2017 in Davao City during the launch of a housing project for members of the armed forces and the police.", "The official transcript of his speech here indicates Duterte was criticising ABS-CBN for not airing his campaign adverts in 2016.", "Below are screenshot comparisons of frames from the misleading video (L) and Duterte’s 2017 speech (R):", "Duterte spoke about franchises in a January 18, 2021 speech after Sotto and Santos filed their bills, but he did not mention the legislators or criticise them as the misleading posts allege.", "“You do not pay your taxes correctly, that’s what happens to you. So there will be no opening,” he said. “I assure you that all franchises will not be implemented -- I will not implement those until they settle their full accounts with the government.”", "Local media, including CNN Philippines and Inquirer.net, also reported that Duterte's criticism was directed towards ABS-CBN.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]