["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This image shared on Facebook says that the daughter of a former White House employee posed as a victim of a mass shooting. We rate this Pants on Fire!", "As the survivors and family members of victims of mass shootings recover and grieve, their pain is increased by accusations that they’re not real survivors or family members of victims. According to conspiracy theorists whose claims often go viral, they are crisis actors playing parts in a fabricated tragedy.", "Add to that false narrative the skepticism of President Donald Trump’s critics and you get a social media post like like this one.", "It features two photos. The first is of Trump leaning over a person in a hospital bed. The second is of Ivanka Trump standing with her arm around a girl’s shoulder. The text says: \"This little girl is Emma Breier, daughter of former Trump appointee Kimberly Breier. Wasn’t it sweet of her to pose as a victim in El Paso with Uncle Donny??\"", "This Aug. 12 post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We’ll cut to the chase: The photo of patient is in the Miami Valley Hospital in Dayton, not El Paso. Our reporting shows she is a survivor of the mass shooting outside a bar in Dayton on Aug. 4 that left 10 people dead, including the suspect. She is an adult, though, not a little girl as the Facebook post suggests, and there is no evidence that she is a crisis actor, much less the daughter of a Trump appointee.", "The first photo was published among others on The White House’s Instagram page on Aug. 7 with this caption: \"The President and First lady met with survivors and family members in Dayton, Ohio, this afternoon.\"", "Sharon Howard, a spokesperson for the Miami Valley Hospital, would not comment directly on the Facebook post’s allegations. But she told us that all of the hospital’s patients are adults and all of the photos the White House released following the president’s visit are legitimate.", "While Trump was at the hospital, Howard said, he met with the three patients who were still checked in following the shooting, and he met with their families, first responders and the medical team that treated the patients.", "He did not meet with any other patients while he was there, she said.", "Ivanka Trump posted the second photo on Twitter on Aug. 7 and tweeted: \"Thank you @WHAAsstSecty Kim Breier for your friendship and service. While Jared and I will miss working with you, we are happy that Emma will now get to see more of the mom she is so proud of!\"", "On Facebook, Ivanka Trump’s photo was cropped to exclude the image of Kimberly Breier, the assistant secretary of state for the western hemisphere, who resigned this month.", "These images are of two different people.", "We rate this Facebook post Pants on Fire!", "Facebook post, Aug. 12, 2019", "The Guardian, \"Anger as grinning Trump gives thumbs-up while Melania holds El Paso orphan,\" Aug. 9, 2019", "White House Instagram post, Aug. 7, 2019", "Ivanka Trump tweet, Aug. 7, 2019", "The Washington Post, \"Kimberly Breier resigns as assistant secretary of state for Western Hemisphere,\" Aug. 7, 2019", "Interview with Sharon Howard, director of communications, Miami Valley Hospital campuses, Aug. 13, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]