["Ahead of the Madhya Pradesh (MP) by-elections on November 3, a clip of chief minister Shivraj Singh Chouhan was shared on Twitter and Facebook. “What is this excise officer doing? What are they there for? Supply alcohol to such an extent in the state so that they drink and stay drunk,” Chouhan can be heard saying in the clip (Translated from क्या कर रहा है ये आबकारी अमला..कायके लिए बैठा है ये …दारू इतनी फैला दो पूरे प्रदेश में की पिये और पड़े रहे.)", "This was tweeted by Twitter users @BramhRakshas and @sara75165335. (archived links 1 and 2)", "मामा तो गयो….! 😂😂😂 pic.twitter.com/AxSIDqrkPT", "— ब्रह्मराक्षस (@BramhRakshas) November 1, 2020", "Some Facebook users posted the video as well.", "The claim was debunked by Chouhan in June itself when it was similarly viral. He wrote, “Strict legal action will be taken against those who are sharing a fake video by Congress’s dirty tricks department on Twitter and WhatsApp. This is the original video. There is no place for cheap politics in Madhya Pradesh!”", "कांग्रेस के डर्टी ट्रिक्स डिपार्टमेंट द्वारा जारी किए गए फेक वीडियो जो भी ट्वीट और व्हाट्सएप्प पर शेयर कर रहा है, उसके खिलाफ कड़ी कानूनी कार्रवाई की जायेगी।", "यह ओरिजिनल वीडियो है। मध्य प्रदेश में ओछी राजनीति की कोई जगह नहीं! https://t.co/6RIFzi5fGQ pic.twitter.com/76YImjHhxY", "— Office of Shivraj (@OfficeofSSC) June 14, 2020", "The video was widely shared back in June, including by Facebook page AAP News and Congress members Pushpak Bakshi and Rajkumar Ahir. Their posts gained over 4 lakh views.", "The ten-second video was originally posted by Chouhan in January when Congress leader Kamal Nath was the chief minister. In the video, Chouhan can be seen criticising Nath’s move to open liquor stores in the state while more pressing issues remained unaddressed.", "चारों तरफ त्राहि – त्राहि मची है। किसानों की धान नहीं बिक रही, कर्जा माफ नहीं हो रहा, युवाओं को बेरोजगारी भत्ता नहीं मिल रहा है। विकास के काम भी ठप्प हैं। ऐसे में शराब की उपदुकानें खोलकर सरकार युवा पीढ़ी को बर्बाद करने पर अमादा है। हम चुप नहीं रहेंगे, लड़ेंगे। #MP_मांगे_जवाब pic.twitter.com/eZ863NGY9W", "— Shivraj Singh Chouhan (@ChouhanShivraj) January 12, 2020", "The video begins with Chouhan saying, “… rice isn’t selling, debt isn’t being waived, unemployment support isn’t there, rapes committed, people’s demands aren’t being fulfilled, development is at an all-time low, farmers and the poor are crying and this government is busy opening liquor stores…”", "The next section includes the phrases heard in the viral video. It is highlighted in bold text. Around the 58-second mark, he says “If the license holder wants to open a store, he can open one or more stores. Do you want to drown MP’s youth in a sea of alcohol? Why do we need liquor stores? They are acting as per instructions of liquor mafia. Lives will be destroyed, bribes have increased as well. No matter how much I have to fight I won’t let this ruin MP. I have written letters to the CM who is of the opinion that illicit liquor will stop because of this move. What is this logic? Where is the excise officer? What is he there for? Why doesn’t he stop the sale of illicit liquor? Alcohol will ruin the youth of this state. The farmers can’t ask for a loan waiver, youth don’t ask for unemployment support, the poor should not talk about Sambal Yojana, nobody should ask for money from the chief minister, and that’s why supply alcohol to such extent in the state so that they drink and stay drunk.”", "On January 12, Outlook reported that Chouhan wrote a letter to Kamal Nath criticising his decision to allow liquor license holders to open sub-shops by paying extra. Nath rebutted by stating that MP has five liquor shops per lakh population as compared to 12 per lakh in BJP-ruled Uttar Pradesh.", "Thus, the video has been mispresented on social media to claim the opposite of what Shivraj Singh Chouhan meant. He was speaking against setting up liquor shops in the state but his words were distorted to falsely suggest that the Chief Minister, ahead of MP by-polls, was supporting the sale of illicit liquor.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]