["About this rating", "In early January 2021, a video that appeared to depict a dog climbing a ladder was posted to the TikTok video platform. TikToker @vincematteson uploaded the clip of the golden retriever with the words: \"ORIGINAL DOG CLIMBING LADDER VIDEO #goldenretrieverlife #goldenretrieverdad #goldenretriever.\" The video was subsequently taken and uploaded by another TikTok user, where it was viewed millions of times. It featured a golden retriever named Ace, plus another dog named Bo who appeared to remain safely at ground level.", "The video was recorded by Vince Matteson. In the video, he said: \"I'm up here taking down the lights. I turn around. Ace climbs up this whole ladder by himself and is now on top of the roof.\"", "The first half of the video showed holiday lights on the rooftop. While working on removing the lights, Matteson said he noticed the dog nearby.", "The second half of the viral clip depicted home security footage from a Wyze camera. The timestamp on the video was Jan. 7, 2021, just two weeks after Christmas. In the video, Ace can clearly be seen scaling what appeared to be a Little Giant ladder.", "It was originally unclear how Ace made it down from the \"woof,\" as Matteson put it. The other TikTok user who took his video did not provide a link to a second video that showed Ace being carried down the ladder:", "This was not the first time that Ace and Bo were involved in backyard hijinks, as seen in another video:", "More videos with Ace and Bo were available on @vincematteson's TikTok.", "This wasn't the first time a video of a dog scaling a ladder went viral.", "In 2018, a video was posted to Reddit that appeared to show a dog climbing down a ladder. The video may have been reversed, meaning it may have originally shown the dog climbing up the ladder. A commenter said: \"Reversed or not. How the fuck do you train a dog to climb a ladder? Unbelievable.\"", "A YouTube video from 2016 depicted another dog climbing a ladder. Its video title said it was captured in Athlone, Ireland:", "There are quite a few others on YouTube as well, including this one from 2017.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]