["About this rating", "A Microsoft PowerPoint file that made the rounds of the Internet in 2003 presented the viewer with a chilling slide show: four pictures of a pretty young woman with her friends and family, a post-accident photograph of the charred remains of a car, nine images of a horribly disfigured woman pursuing her daily routine (sharing time with her father, receiving medical treatment, eating, reading), and finally a reproduction of a \"Don't Drink and Drive\" poster from the Texas Department of Public Safety bearing pre- and post-disfigurement photos of the young woman under the legend \"Not everyone who gets hit by a drunk driver dies\":", "This was one of the cases we really wished would have turned out to be someone's sick idea of hoax.  Unfortunately, the story was all too real.", "The slide show documented what happened to Jacqueline Saburido, a 20-year-old woman who had taken a break from attending college in Venezuela to come to the United States and study English.  Her HelpJacqui website described the horrific accident that turned her life upside-down:", "Early on Sunday morning September 19, 1999, Jacqui — then 20 years old — and four friends were on their way home from a birthday party. Reggie Stephey, an 18-year-old high school student, was on his way home from drinking beer with some buddies. On a dark road on the outskirts of Austin, Texas, Reggie's SUV veered into the Oldsmobile carrying Jacqui and the others. Two passengers in the car were killed at the scene and two were rescued.", "Within minutes, the car caught fire. Jacqui was pinned in the front seat on the passenger side. She was burned over 60% of her body; no one thought she could survive. But Jacqui lived. Her hands were so badly burned that she no longer can use them. She lost her hair, her ears, her nose, her left eyelid and much of her vision. She has had more than 40 operations since the crash and has many more to go.", "A May 2002 profile in The Austin American-Statesman also described the terrible extent of Jacqui's injuries:", "At a distance Jacqui looks old. Up close, ageless.", "She has a baggy neckchin and thin crumpled lips. Her cheeks are splotchy and rough in places, smooth in others.", "Where her right ear should be, she has a slender crescent of cartilage around a pea-size black hole. On the left side, she has only a hole. Her nostrils are ragged, torn. A flap of skin hides her left eye. For more than two years, the eyeball floated naked in the socket, mostly blind but perpetually staring behind a clear plastic goggle. Her right eye sees behind a veil of scar.", "Her burned skin can't sweat or protect her from heat and cold. It feels hot and tight, like having a sunburn.", "Scars run down her body, halting at her knees and before her size 7-1/2 feet, which the fire never touched. She has learned to use her feet like hands — her toes stroke a blanket's softness and test shower water.", "Her fingers are amputated between the knuckle and the first joint. On her right hand, they are fused together like a mitten.", "Nerve damage has left parts of her body numb. She can make out some texture with the bottom of her right palm. Her left hand feels only pinpricks — \"like a thousand needles,\" she says. Her hands hurt every day, but Jacqui doesn't take painkillers.", "(The other driver, Reggie Stephey, was arrested and charged with two counts of intoxication manslaughter.  He was found guilty in 2001 and served seven years in prison.)", "As Jacqui's web site noted, she continued to receive medical treatment for her extensive injuries in Louisville, Kentucky, where she and her father Amadeo lived, and specialists were performing a series of skin grafts and working to rebuild her right hand.  Jacqui was eventually able to resume her studies and enroll in intensive English classes, and she established a private bank account to receive donations to help pay her living and medical expenses.   On 24 November 2003, Jacqui garnered national attention when she appeared as a guest on The Oprah Winfrey Show, and then again in 2009 when Orpah counted down her most memorable guests of the past 25 years:", "Jacqueline Saburido passed away at the age of 40 in April 2019, but she left behind a legacy of inspiring \"hope among a legion of followers across the globe\" in her roles as a motivational speaker and anti-drunken driving spokeswoman:", "“I thought she was the bravest, most courageous person I have ever met,” said Janet Lea, former senior vice president of the Sherry Matthews Group, which organized the campaign for TxDOT. “With all of her injuries, she was still wickedly funny and also willing to speak to anybody who would listen to her about the dangers of drinking and driving.”", "The TV spot, with Saburido’s before and after images, “was a real punch in the gut,” Lea said. “It just went nuts. She got thousands and thousands and thousands of letters and was interviewed by media all over the world.” An educational kit, which included a video and a teacher’s guide, was sent to every middle and high school in Texas.", "Bentley Nettles, executive director of the Texas Alcoholic Beverage Commission, said: “Jacqui did not let the tragic circumstances of her accident diminish her, instead using her life story as a lesson on the importance of preventing drunken driving. We are eternally grateful for Jacqui’s bravery, her compassion and her drive to help others.", "Saburido was featured in safety campaigns as far away as Australia, her scarred face persuading a generation of students that drunken driving has consequences.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]