["The footage was published in a Facebook post here on May 11, 2020. It has been viewed more than 24,000 times.", "The one-minute 12-second video shows several women conversing with an officer wearing the uniform of India’s Railway Protection Force (RPF), a security force established to protect the national railway system.", "The post's Hindi-language caption translates to English as: “This is the Gujarat model in the times of corona. The railway police of Gujarat is collecting money from migrant labourers, who were walking along the railway tracks to their hometowns.”", "Gujarat is a state on the western coast of India.", "Millions of migrant workers, mostly from rural India, attempted to travel to their hometowns after losing their city jobs during a nationwide COVID-19 lockdown, AFP reported here on May 11.", "The video was also shared here, here, here and here on Facebook, and here, here, here and here on Twitter, alongside a similar claim.", "The claim is false.", "A reverse image search on Google using keyframes extracted with InVID-WeVerify, a video verification tool, found an earlier version of the footage posted here on Twitter on July 17, 2019.", "Piyushji Railway police taking bribe @PiyushGoyalOffc @narendramodi @AmitShah pic.twitter.com/rkKUCZNmzi", "“Piyushji Railway police taking bribe,” says the tweet tagging Indian Prime Minister Narendra Modi, railways minister Piyush Goyal and home minister Amit Shah.", "Corresponding footage was also published here in a video report on the YouTube channel of ABP Asmita, a Gujarati-language broadcaster, on July 11, 2019.", "The video's title states: “Surat railway police take money from woman bootlegger, video viral”.", "Surat is a city in Gujarat, where alcohol is illegal.", "Below are two sets of screenshot comparison of the footage in the misleading post (L) and the ABP Asmita video report (R):", "DeshGujarat, a Gujarat-based news site, stated in this July 2019 article that a police officer linked to the video had been dismissed from the RPF.", "“A Railway Police Force (RPF) jawan (personnel)  whose video taking bribe from liquor trafficker women on railway track was viral has been sacked from the service. RPF senior DSC SR Gandhi issued order to sack Tandel. It is learnt that the video is old and Tandel was in latest serving at Surat railway station,” reads the first paragraph of the report.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]