["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Teacher Yan Han helps students as she teaches a kindergarten class at East Voyager Academy in Charlotte.", "Don’t let anyone fool you: your kid’s 85 score is still a B and his 50 is still an F.", "But you might not know that from the media coverage of a recently filed bill on education policy in North Carolina. Parents and news consumers were left confused by vague headlines and misleading tweets.", "House Bill 145 deals with the state’s method for assessing the effectiveness of individual public schools — and doesn’t affect student grade scales at all. The state currently assesses schools on a 15-point scale and the bill aims to re-establish that method next year.", "So, why the confusion?", "The bill uses a letter-based measurement system and language — grade, scale, performance — often associated with student grades and report cards. The bill also gives the impression things are changing because it shows a 10-point scale with the numbers crossed-out.", "Still, the bill never uses the word \"student.\" And it clearly refers to a system that’s meant to offer a glimpse of the effectiveness of a school’s administration and teachers by calculating academic achievement and growth.", "Unfortunately, some of the media coverage didn’t convey that reality.", "MISLEADING REPORTS", "Many TV stations reported on the bill with misleading headlines or descriptions.", "The first line of a WNCN story says the bill might change the grading scale used \"in state public schools.\" This gives the impression the scale is applied by teachers to students, not by the state to the school. Anchor Angela Taylor then described the bill by saying it would change \"your child’s school performance scores.\"", "The NBC affiliate in Charlotte, WCNC, used a WRAL story to report on the bill.", "WCNC’s headline says \"NC lawmakers consider bill that would change school grades.\"", "The Charlotte station’s tweet may have added to the confusion. The tweet included a photo of a person holding a pencil accompanied by the caption: \"The new bill under consideration would adjust the current grading scale, making a score of 85 an A and a score of 70 a B.\" The station has 215,000 followers.", "The tweet didn’t specifically say the bill affected students. But it was so vague that readers might come to that conclusion.", "The story now includes an editor’s note on both WCNC and WRAL websites. It says: \"This new scale applies to the grades schools receive based on performance. It would not change the scale used to grade students.\"", "WRAL later changed its headline to say: \"Bill would keep school performance grades on 15-point scale.\"", "Fox affiliates used similar headlines in stories about the bill. Charlotte-based Fox 46 used a bare-bones headline saying the bill \"would change grading scale.\"", "REACTION", "Reaction to the stories was also misleading.", "Lt. Gov. Dan Forest tweeted a WBTV story with the headline, \"NC General Assembly mulling over changing school grading scales.\" Forest tweeted a comment about the story that mentioned students.", "\"Instead of lowering our expectations for our education system, we should be raising our standards for our students so that they can compete in a 21st Century global economy,\" he said.", "Andrew Siciliano, the host of an NFL show on DirecTV, tweeted that the bill directly affects students. He has 157,000 followers on Twitter.", "\"North Carolina wants to give your kid an \"A\" with an 85. Embarrassing,\" he tweeted, along with a link to a story by WRAL.", "Karen Zatkulak, a reporter at Asheville-based WLOS, asked NC Education Superintendent Mark Johnson about the bill during an interview. Her question, which comes around the 7:45 mark of a Facebook video, doesn’t clarify whether the bill affects students or schools.", "Johnson says he’s not aware of the bill and wants to talk to legislators about it. But he adds: \"I don’t know if we necessarily want to make our grading scale less rigorous in order to give more students As,\" Johnson responds.", "Thursday afternoon, pundits on the Fox News show, \"The Five,\" also talked about the bill as if it would affect students.", "\"I think failing is good for character,\" host Jesse Watters said. \"Now you can pass with what, a 40 percent? That’s pathetic. That’s why the Chinese are taking over.\"", "WHAT THE BILL SAYS", "Not only is the bill inconsequential for students, it also makes no major changes to the state’s grading scale for schools.", "The bill’s effects — and some of the public’s misinterpretations on social media — are detailed on a blog operated by Justin Parmenter, a teacher in Charlotte.", "The North Carolina State Board of Education assesses school effectiveness on a 100-point scale. Current law requires the state to grade schools on a 15-point scale:", "The bill makes it seem like the state currently operates on a 10-point grading scale. That’s because HB 145 is a version of a bill passed several years ago granting the state permission to operate a 15-point scale for schools, said Drew Elliot, communications director for NC DPI.", "A law from 2013 \"originally set out a 10-point scale for school report cards. However, that scale was never used because it has been superseded by an annual waiver, usually in the budget bill, since the inception of the School Performance Grades,\" Elliot said.", "HB 145 would make the 15-point scale permanent, \"obviating the need for the annual waiver,\" Elliot said.", "OUR RULING", "A lot of people — some media outlets, politicians, pundits and a sports reporter — got this one wrong. Not only does the bill not affect students’ grades, it also makes no major changes to the state system used to give parents an idea of a school’s effectiveness. We rate this claim False.", "This story was produced by the North Carolina Fact-Checking Project, a partnership of McClatchy Carolinas, the Duke University Reporters’ Lab and PolitiFact. The NC Local News Lab Fund and the International Center for Journalists provide support for the project, which shares fact-checks with newsrooms statewide. To offer ideas for fact checks, email [email protected].", "House Bill 145, aka \"15-Point Scale For School Performance Grades.\"", "Webpage, \"NC School Report Cards: Frequently Asked Questions,\" on ncpublicschools.org.", "Email correspondence with Drew Elliot, communications director for the NC Department of Instruction.", "Story by CBS17, \"NC General Assembly mulling over changing school grading scales,\" posted Feb. 25, 2019.", "Video of interview between NC Superintendent Mark Johnson and WLOS reporter Karen Zatkulak, posted on Facebook.", "A tweet by NBC Charlotte, \"The new bill under consideration would adjust the current grading scale, making a score of 85 an A and a score of 70 a B,\" posted Feb. 26, 2019.", "A story by WRAL, \"Bill would keep school performance grades on 15-point scale,\" posted 6:59 a.m. Feb. 26, 2019.", "A tweet by NC Lt. Gov. Dan Forest, \"Instead of lowering expectations for our education system, we should be raising our standards for our students so that they can compete in a 21st Century global economy,\" posted Feb. 26, 2019.", "A tweet by Andrew Siciliano, \"North Carolina wants to give your kid an \"A\" with an 85. Embarrassing,\" posted Feb. 26, 2019.", "Blog post by Justin Parmenter, a teacher in Charlotte, \"Misinformation about NC school grades dominates the airwaves–and Lt. Gov. Dan Forest’s Twitter account,\" posted Feb. 27, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]