["“CM H.D.Kumaraswamy instructs to transfer DGP Neelamani Raju” The news from Kannada channel BTV spread like wildfire. The news came on the heels of reports about Mamata Banerjee being unhappy with the DG-IGP over having to walk at the swearing-in ceremony of Karnataka Chief Minister, Kumaraswamy. So eager were sections of mainstream media to carry the breaking news of Karnataka’s first female DG-IGP at the behest of Mamata Banerjee that there was no difference between fake news websites like Postcard News and mainstream media like Financial Express , Zee News and DNA. No one bothered to check the facts.", "CM H.D.Kumaraswamy instructs to transfer DGP Neelamani Raju: https://t.co/YS6lVPhyj0 via @YouTube", "— BtvNews (@btvnewslive) May 24, 2018", "In no time, the news of the transfer was viral on social media. For most BJP supporters, it was a chance to kill two birds with one stone. It was a news that targeted both Mamata Banerjee and Kumaraswamy, leaders of the opposition. Needless to say, PM Modi’s echo chamber i.e the people he follows on Twitter took the lead in outraging about the transfer of Neelamani Raju.", "The news was also shared by right wing website, Swarajya without any independent check. Later, they updated their report stating that Karnataka DGP has refuted the news about the transfer.", "And Its First High Profile Transfer, DGP Who ‘Insulted’ Mamata By Making Her Walk, Transferredhttps://t.co/UkcZhhUqaC", "— Swarajya (@SwarajyaMag) May 24, 2018", "Smita Prakash of premier news agency, ANI also shared the DNA article. She later acknowledged that the report is inaccurate and deleted the tweet.", "The fake news was busted by The News Minute which confirmed that no such transfer order has been issued. “I am only the CM designate, not the CM until the floor test is over. I cannot make decisions about who should be transferred. Neelamani Raju has not been transferred now,” said Kumaraswamy, according to the report by The News Minute.", "Once again we see that in the hurry to break news, particularly one that is so sensational, sections of the mainstream media missed out on a basic fact check. If they had bothered to crosscheck with Karnataka Police or Karnataka government, they too would have found out that the news was fake. When mainstream media echos Postcard News, who do we trust?", "Donate Now", "Follow @free_thinker", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]