["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Sept. 29, 2014, file photo, U.S. Rep. Jim Renacci, R-Ohio, speaks in Independence, Ohio. Renacci failed to disclose nearly $50,000 in political contributions while registered as a Washington lobbyist starting in the lat", "U.S. Sen. Sherrod Brown’s first TV attack ad portrays his opponent U.S. Rep. Jim Renacci as a fan of lobbyists working in government.", "\"The U.S. Congress. There’s 68 teachers, 15 farmers, four pilots but only one lobbyist,\" says the narrator as a cash register cha-ching sound is heard in the background. \"That's right, Jim Renacci has been a lobbyist even while in Congress. And what's he done? He voted to make it easier for lobbyists to hold key government positions and harder to investigate conflicts of interest.\"", "Text on the screen shows this is a reference to the 112th Congress. That timeframe refers to January 2011 to January 2013.", "Democrats have long portrayed Renacci as a lobbyist. But what this ad omits is that while he was registered to lobby, there is no evidence he actually lobbied. And in fact, it wouldn’t make sense for a member of Congress to work as a lobbyist at the same time. The ad also gives viewers no context about the votes cited.", "Brown is one of several Democratic incumbents defending a seat in a state that Donald Trump won in 2016. Trump endorsed Renacci during the primary.", "Before being elected to Congress, Renacci primarily worked in the private sector. He owned and operated over 60 entities, according to his Congressional biography, including nursing facilities, a CPA firm, real estate and auto dealerships. (He later said it was his experience losing his dealership in the auto industry bailout when General Motors closed his dealership that prompted him to run for Congress.)", "He also served as president on the Wadsworth City Council and then served as mayor from 2004 to 2008.", "In 2008, Renacci and two other individuals registered as lobbyists for Smokehouse International Group LTD, named for Smokerise Drive, the street on which Renacci and other partners had offices. They intended to lobby in areas including defense, aviation, homeland security, and trade, according to their Senate lobbyist registration forms. Renacci filed documents with the House a handful of times between 2008 and 2011 stating that he gave no political contributions while a lobbyist. His campaign spokesman, James Slepian, said that it was a mistake to file the forms since he wasn’t lobbying and that it was handled by a lawyer.", "Slepian told us previously that two business associates wanted to form the firm and Renacci agreed to help because of his background as a CPA. The firm \"never got off the ground,\" Slepian said, \"but as a precautionary measure, one of the partners registered all three of them as lobbyists, just in case they ever took on any lobbying clients.\"", "Brown’s campaign pointed to his lobbyist registration and a March article by the Associated Press.", "The AP quoted Renacci’s attorney, Laura Mills, as stating that Renacci never lobbied. She said that he asked her office to deactivate his lobbyist registration in 2009 before he entered Congress.", "But the AP found that Mills didn't file the companion form required to deactivate Renacci's registration until 2011, a few months after he took office.", "Members of Congress can’t lobby Congress or the executive branch on behalf of any private organization or individual \"as that would conflict with a Member‘s general obligation to the public,\" according to the House Ethics manual.", "In addition to it being banned, it defies logic that as a House member Renacci would want to lobby himself and his colleagues as a lobbyist. As a member, he already had the power to draft legislation and seek support from other members for his priorities.", "This part of the ad references two votes by Renacci. The first one is fairly circuitous.", "The campaign pointed to Renacci’s vote on a procedural maneuver related to HR 921 on Nov. 16, 2016. The resolution related to a bill to ban U.S. bank transactions in connection with export of commercial aircraft to Iran. The resolution passed, with all of the Republicans voting in favor and all of the Democrats voting against it.", "If the resolution had been defeated, then the minority party — the Democrats — would have had the opportunity to decide what legislation to consider next.", "On the Democrats’ plate: the No Lobbyists on Presidential Transition Teams Act, HR 6324.", "That bill, introduced by Rep. John Sarbanes, D-Md., would have prohibited the use of funds to the president-elect \"for any services or facilities provided by registered lobbyists.\" The bill was in response to a move by Trump to put lobbyists in his transition team.", "The ad doesn’t explain that Renacci never took a direct vote on lobbyist bill -- in fact, it never received any vote.", "Joshua Huder, a senior fellow in the Government Affairs Institute at Georgetown, said that the Brown ad is relying on a hypothetical scenario about a tenuous connection. Members in the majority rarely vote \"no\" on a previous question because that would be handing off power to the minority. That’s something that leadership strongly discourages.", "The ad also cited Renacci’s vote in favor of a change to House Ethics Rules on Jan. 6, 2015. The vote passed along partisan lines: All of the Democrats voted against it, while all but four Republicans voted for it.", "The new rules proposed by Rep. Steve Pearce, R-N.M., said that a person who is a subject to a preliminary or second-phase review by the Office of Congressional Ethics shall be informed of the right to counsel and that the person’s constitutional rights can’t be denied.", "Slepian said that Renacci \"believes in due process as enshrined in our Constitution and this measure was brought forth to ensure that due process rights are not eroded by bodies within our government.\"", "The rule change drew objections in 2015 from Craig Holman, a lobbyist at the liberal watchdog group Public Citizen. At the time, he felt the rules would inhibit the ethics committee’s investigations.", "But now that more three years have passed, Holman told PolitiFact that the House rules didn’t \"seem to have made much of a difference.\"", "Brown’s TV ad said, \"Jim Renacci has been a lobbyist even while in Congress\" and \"voted to make it easier for lobbyists to hold key government positions and harder to investigate conflicts of interest.\"", "Renacci misfiled paperwork about his lobbying activities, but there’s no convincing evidence he actually worked as a lobbyist while a member of Congress.", "The statement about a vote to help lobbyists hold government positions was not a direct vote. The ad is using circuitous logic on this point.", "Another vote involved a rule change that drew concerns from a government watchdog at the time, but the watchdog told PolitiFact that it ultimately didn’t make much difference.", "The statement omits critical evidence that would give a different impression. We rate this statement Mostly False.", "Office of the Clerk House of Representatives, Lobbying contributions search, Accessed May 22, 2018", "Democratic Speaker Nancy Pelosi, 114th Congress Previous Questions, Dec. 5, 2014", "Committee on Ethics, House Ethics manual, Accessed May 23, 2018", "Congress.gov, House Resolution 921 Roll Call 579, Nov. 16, 2016", "Congress.gov, H.R.6324 - No Lobbyists on Presidential Transition Teams Act, Introduced Nov. 16, 2016", "Congress.gov, H.Res.5 - Adopting rules for the One Hundred Fourteenth Congress, Jan. 6, 2015", "WOSU, \"Sherrod Brown Launches Reelection Push With Attack Ad Against Renacci,\" May 18, 2018", "AP, \"Records: US Rep. Jim Renacci didn't report $50,000 in donations as registered lobbyist,\" March 28, 2018", "The Hill, \"House quietly changes ethics rules,\" Jan. 13, 2015", "Roll Call, \"Pearce Pushed House Rule Change to Provide 'Protection' in Ethics Cases,\" Jan. 13, 2015", "USA Today, \"House edits rules to help members facing ethics probes,\" Jan. 6, 2015", "Columbus Dispatch, \"Campaign ad watch,\" (Accessed in Nexis) May 19, 2018", "Washington Post The Fix, \"There are a whole lot of new rules governing the U.S. House. Here are the ones you need to know about,\" (Accessed in Nexis) Jan. 7, 2015", "PolitiFact, \"Rep. John Boccieri portrays challenger Jim Renacci as a menacing trade lobbyist,\" Nov. 1, 2010", "PolitiFact, U.S. Rep. Jim Renacci Truth-O-Meter and U.S. Sen. Sherrod Brown Truth-O-Meter, Accessed May 23, 2018", "Interview, James Slepian, spokesman for U.S. Rep. Jim Renacci’s campaign, May 23, 2018", "Interview, Preston Maddock, spokesman for U.S. Sen. Sherrod Brown’s campaign, May 22, 2018", "Interview, Joshua Huder, Government Affairs Institute senior fellow at Georgetown University, May 22, 2018", "Interview, Craig Holman,  government Affairs lobbyist for Public Citizen, May 22, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]