["About this rating", "A meme purportedly featuring actor John Wayne's thoughts on white supremacy has been circulating on the internet for several years:", "It first appeared in an interview with Playboy magazine that was published in May 1971:", "Playboy: Angela Davis [a Communist professor in the San Francisco Bay Area] claims that those who would revoke her teaching credentials on ideological grounds are actually discriminating against her because she's black. Do you think that's true?", "Wayne: With a lot of blacks, there's quite a bit of resentment along with their dissent, and possibly rightfully so. But we can't all of a sudden get down on our knees and turn everything over to the leadership of the blacks. I believe in white supremacy until the blacks are educated to a point of responsibility. I don't believe in giving authority and positions of leadership and judgment to irresponsible people.", "Wayne elaborated on his views about ethnicity and racism, saying that he believed that black people had the right to attend college as long as they passed the requisite tests, and that he did not believe that the black community was disadvantaged.", "When asked about his own hiring practices, Wayne said that while he did not discriminate against black actors or crew members, he didn't seek them out either:", "PLAYBOY: But isn't it true that we're never likely to rectify the inequities in our educational system until some sort of remedial education is given to disadvantaged minority groups?", "WAYNE: What good would it do to register anybody in a class of higher algebra or calculus if they haven't learned to count? There has to be a standard. I don't feel guilty about the fact that five or 10 generations ago these people were slaves. Now, I'm not condoning slavery. It's just a fact of life, like the kid who gets infantile paralysis and has to wear braces so he can't play football with the rest of us. I will say this, though: I think any black who can compete with a white today can get a better break than a white man. I wish they'd tell me where in the world they have it better than right here in America.", "PLAYBOY: Many militant blacks would argue that they have it better almost anywhere else. Even in Hollywood, they feel that the color barrier is still up for many kinds of jobs. Do you limit the number of blacks you use in your pictures?", "WAYNE: Oh, Christ no. I've directed two pictures and I gave the blacks their proper position. I had a black slave in The Alamo, and I had a correct number of blacks in The Green Berets. If it's supposed to be a black character, naturally I use a black actor. But I don't go so far as hunting for positions for them. I think the Hollywood studios are carrying their tokenism a little too far. There's no doubt that 10 percent of the population is black, or colored, or whatever they want to call themselves; they certainly aren't Caucasian. Anyway, I suppose there should be the same percentage of the colored race in films as in society. But it can't always be that way. There isn't necessarily going to be 10 percent of the grips or sound men who are black, because more than likely, 10 percent haven't trained themselves for that type of work.", "This Playboy interview contained one other quote that is frequently shared in meme form:", "Playboy.   \"This Is What John Wayne Told Playboy About Blacks and American Indians in 1971.\"\r\n    24 August 2012.", "Williams, Frank.   \"'Duke' Wayne Fuels Firefighters' Tensions.\"\r\n    Los Angeles Times.   7 December 1996.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]