["About this rating", "Back in his talk radio hosting days, Jason Lewis criticized women who dress in \"prostitute-like outfits\" and \"look like some slut.\"", "We found no instance of Lewis' advocating the imposition of a mandatory (i.e., legislatively established) mode of dress for women.", "In late July 2018, Facebook users circulated a meme bearing the image of U.S. Rep. Jason Lewis (R-Minnesota) with text stating that he had \"called for a dress code for American women\":", "The meme referenced comments Lewis made in 2012, five years before he assumed office, when his primary occupation was hosting the syndicated talk radio program \"The Jason Lewis Show.\" Those comments resurfaced on 18 July 2018, when CNN published excerpts from Lewis' former radio program (which ended in 2014) in the lead-up to Lewis's bid for reelection in the 2018 November midterms.", "In recordings from March 2012 released by CNN, Lewis \"repeatedly expressed disbelief that people could no longer refer to women as 'sluts',\" even if those women were sexually active or dressed provocatively:", "\"Well, the thing is, can we call anybody a slut? This is what begs the question. Take \"Sandra Fluke out of it, take Rush [Limbaugh] out of it for a moment ... Does a woman now have the right to behave — and I know there's a double standard between the way men chase women and running and running around — you know, I'm not going to get there, but you know what I'm talking about. But it used to be that women were held to a little bit of a higher standard. We required modesty from women. Now, are we beyond those days where a woman can behave as a slut, but you can't call her a slut?\"", "\"Now Limbaugh's reasoning was, look, if you're demanding that the taxpayers pay for your contraception, you must use a lot of them and therefore, ergo, you're very sexually active and in the old days, what we used to call people who were in college or even graduate school who were sexually active, we called them sluts.\"", "\"But have we really got to the point where you can't refer to Madonna as a slut without being sued? I mean, Madonna has had a series of lovers, as have many in Hollywood. Now in the old days, what did we call this? Madonna dresses up in these sorts of prostitute-like outfits on stage, and she goes there and she sings and she shows half of her body. What did we call those people? 30 years ago? 40 years ago? 50 years ago? You can't do that today, it's too politically incorrect?\"", "Lewis was referring to a then-current controversy over comments made by fellow conservative radio host Rush Limbaugh, who had termed Sandra Fluke, then a law student at Georgetown University, a \"slut\" and a \"prostitute\" for speaking before a House committee in support of mandatory insurance coverage for contraceptives.", "Although Lewis may have been, in a very broad sense, suggesting a \"dress code\" for women by criticizing figures such as Madonna for \"running around [in] slutty outfits\" and making statements such as \"Only we can tell our young women, 'don't look like some slut and you won't get hit on,'\" we found no instance of his advocating the imposition of a mandatory (i.e., legislatively established) mode of dress for women.", "We reached out to Lewis's spokespeople and received no response, but Lewis campaign spokeswoman Becky Alery told CNN that Lewis's comments as a radio host were old news: \"This has all been litigated before, and as Congressman Lewis has said time and time again, it was his job to be provocative while on the radio.\"", "Kaczynski, Andrew.   \"A GOP Congressman Once Lamented Not Being Able to Call Women 'Sluts' Anymore.\"\r\n    CNN.   18 July 2018.", "Brodey, Sam.   \"There Are New Recordings from Jason Lewis’ Lightning-Rod Past as a Talk Radio Host. Will It Matter This Time?\"\r\n    MinnPost.   26 July 2018.", "Cottle, Michelle.   \"Meet Minnesota's Mini-Trump.\"\r\n   The Atlantic.   12 August 2016.", "DeBonis, Mike.   \"Paul Ryan Backs Rep. Jason Lewis, Who Faces Drumbeat of Revelations from His Talk-Radio Career.\"\r\n    The Washington Post.   27 July 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]