["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On an episode of Politically Speaking, a podcast from St. Louis Public Radio, O’Fallon Rep. Nick Schroer spoke about legislation he sponsored known as the \"Missouri Stands for the Unborn Act\". The bill, which would ban abortion once a fetal heartbeat or brain activity is detected, is considered one of the \"strongest pro-life\" bills in the nation.", "Interviewer Jason Rosenbaum asked Schroer how he responds to opponents of his bill who say this will prompt women past the 6 to 8 week mark in their pregnancy when a heartbeat or brain activity could be detected to obtain a dangerous abortion.", "Schroer responded by saying statistics that measured the number of women who died from illegal abortions prior to the nationwide legalization of abortion in Roe v. Wade in 1973 were fabricated and overestimated.", "Schroer said, \"There are statistics out there that show the number of women who died from illegal abortions prior to Roe v. Wade, that number has skyrocketed since with women dying more with legal abortions.\"After further investigation, we found that Schroer’s claim was misleading.", "We reached out to Schroer to find out where he got the information about the number of women dying from legal abortions.", "In his reply, Schroer said, \"This quote was meant to pull in the numbers of female babies as well.\"", "\"Since Roe v. Wade, the number of babies killed, male and female, has skyrocketed per this information. Whether mother or female baby, the amount of life lost as a result of abortion since Roe has skyrocketed,\" he said.", "None of that is clear from Schroer’s answer on the podcast, and it has nothing to do with the question he was asked -- which was about pregnant women.", "So what do we know about outcomes of pregnant women seeking an abortion pre-Roe v. Wade? And have deaths of pregnant women seeking an abortion been increasing or decreasing?", "Karissa Haugeberg, assistant professor of history at Tulane University, said, \"It can be difficult to get at precise deaths due to illegal abortions because many physicians and pathologists obscured the cause of death on death certificates to protect providers and women’s families.\"", "Many of these deaths would be reported as a miscarriage or other complication in the pregnancy.", "The Guttmacher Institute outlines the number of abortion deaths prior to Roe v. Wade, with abortion being the official cause of death for almost 2,700 women in 1930, 1,700 women in 1940 and over 300 women in 1950. The institute also says the actual number was likely much higher.", "In her book \"When Abortion Was a Crime,\" Leslie J. Reagan said, \"The same developments that finally reduced the mortality associated with childbirth reduced the mortality due to abortion.\" Medical developments such as the use of blood transfusions and antibiotics made every medical procedure, including abortion, more safe. Antibiotics were widely introduced in", "After Roe v. Wade, the number of deaths caused by abortions continued to drop. The Center for Disease Control’s 1992 Abortion Surveillance report outlined the number of deaths from legal and illegal abortions from 1972, one year before Roe v. Wade, to 1990. Over this time period, the number of deaths from both legal and illegal abortions dropped. In 1972, the case-fatality rate was 4.1 percent; by 1976, it had dropped to 1.1 percent.", "According to the CDC, \"in 2014, the most recent year for which data were available, six women were identified to have died as a result of complications from legal induced abortion.\"", "Schroer said the number of women dying from legal abortions has \"skyrocketed\" compared to illegal abortions prior to Roe v. Wade.", "Schroer said he was talking about pregnant women and female fetuses, though that wasn’t the question he was asked and is extremely misleading to listeners. The number of women who have died from abortions has steadily decreased, even prior to the decision in Roe v. Wade.", "We rate this claim Pants On Fire.", "Rep. Nick Schroer on St. Louis Public Radio’s Politically Speaking, March 1, 2019", "Email, Nick Schroer, April 9, 2019", "Email, Karissa Haugeberg, April 15, 2019", "Lecture, Karissa Haugeberg, \"Legal History of Abortion in the U.S.\", December 4, 2018", "Rachel Benson Gold, Guttmacher Institute, \"Lessons from Before Roe: Will Past be Prologue?\" March 1, 2003, accessed April 16, 2019", "Reagan, Leslie J. \"When Abortion Was a Crime: Women, Medicine, and Law in the United States, 1867-1973.\" Berkeley: University of California Press, 1997, Pg. 162, accessed April 15, 2019", "Centers for Disease Control, \"Abortion Surveillance - 1992,\" May 3, 1996, Accessed April 14, 2019.", "Centers for Disease Control, \"Abortion Surveillance - United States, 2015,\" Nov. 23, 2018, accessed April 14, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]