["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Steven Costantino in 2012 when he was Gov. Chafee's secretary of Health and Human Services.", "Steven M. Costantino, a former House Finance Committee chairman, was more than a hundred miles away, working in Vermont’s state government, when newly disclosed public records and emails fueled a wave of recent headlines on the $75 million 38 Studios boondoggle.", "From the other side of the Green Mountains, he could feel the spotlight.", "The state’s financing of the upstart video-game company, to the tune of $75 million in loan guarantees, lured 38 Studios from Massachusetts to Providence in 2010, but left Rhode Island taxpayers vulnerable in the company’s 2012 bankruptcy.", "Amid the torrent of new headlines about 38 Studios, Costantino, who is now commissioner of the Department of Vermont Health Access, issued the following statement on Sept. 27:", "\"My only involvement in the matter in RI was because of my former position in the RI legislature. I did not play any role in bringing the company to RI as did others in government. I was tasked with handling the legislation affecting the company by my superiors.\"", "Costantino acknowledges he was involved with the legislation, but denies \"any role,\" compared with what \"others in government\" did, to \"bring\"  Curt Schilling’s 38 Studios to Rhode Island.", "How can he have been both involved and not involved?", "Unfortunately, the former lawmaker did not respond to our request for an interview, leaving us to sort out this contradiction on our own.", "The freshly released emails and deposition transcripts hark back to early 2010 when Rhode Island’s courtship of 38 Studios began to get serious. The documents give the public a window into which state officials were driving the 38 Studios deal.", "Costantino comes across as a behind-the-scenes facilitator, helping to lay the groundwork for the public financing. The comments recorded in the depositions and other records show that Costantino:", "Developed the idea for guaranteeing 38 Studios’ loans.", "He was the first to advocate for 38 Studios’ receipt of a $75-million state guaranteed loan, according to Keith Stokes, chairman of the R.I Economic Development Corporation at the time. And J. Michael Saul, then the EDC’s finance director, recalls that Costantino proposed the expansion of an existing loan guarantee program during a visit to 38 Studios’ headquarters in Maynard, Mass.", "\"And at the conclusion of the meeting,\" Saul testified, \"he turned to me and asked me the question: If we were to increase the $50-million (loan program) to $125 million would this -- I’m paraphrasing here -- would this be helpful to get this done?\"", "In another email, an EDC lawyer, Robert I. Stolzman advised Carcieri’s chief of staff Andrew Hodgkin that he had sent him several documents including a draft \"authorizing the RIEDC to guarantee 38 Studios’ debt (at the suggestion of House Finance Chairman Costantino, the … draft  reflects a larger authorization for this as a Jobs Creation Guaranty Program).\"", "Costantino, in his deposition in 2014, did not to dispute anything in the Stolzman note.", "Was among just a few lawmakers in the loop.", "Only House Speaker Gordon Fox, Senate President M. Teresa Paiva-Weed, Sen. Daniel DaPonte, and Costantino knew about the 38 Studios transaction when the General Assembly approved the bill for the guarantees in 2010, according Marcel A. Valois, the EDC’s former director.", "Another email from Stolzman, the EDC’s lawyer, suggests that Sharon Reynolds, the House fiscal adviser, and Costantino were privy to certain background and \"summary information\" on the \"38 Studios transaction\"  before Governor Carcieri.", "Shielded the 38 Studios transaction from public scrutiny.", "During a videotaped discussion of the bill on the House floor on April 13, one lawmaker asked about the origins of the loan guarantee legislation and who was behind it.", "\"There's always conversations with lobbyists and small businesses,\" Costantino said. He didn’t name 38 Studios.", "Later on in June of 2010, Costantino told Stolzman he hadn’t told a Providence Journal reporter about his visit to 38 Studios. And Costantino said he wanted to know what EDC staffers were saying about the deal.", "Steered the legislation for 38 Studios’ guaranteed loan.", "In two separate April 2 emails with the numerals \"38\" noted in the subject line, Stokes mentions Costantino’s role in scheduling the legislation, advising others that \"Steven Costantino wants to move on it next week\" and that Costantino has advised him that House Speaker Fox wants to post the item for hearing.", "Our ruling", "In his defense, Costantino issued a statement in which he said:  \"I did not play any role in bringing the company to RI as did others in government. I was tasked with handling the legislation affecting the company by my superiors.\"", "In other words: Don’t blame me, I was just doing my job.", "But the records and comments of people involved illustrate that Costantino played a key part in Rhode Island's courtship of 38 Studios. The legislation he helped pass, offering valuable loan guarantees, was his idea, according to one former EDC official.", "During the process, Costantino shielded his idea from the type of full political scrutiny that might have killed it. He did this by not naming 38 Studios on the House floor when he was asked who was pushing for the loan-guarantee program.", "When the deal was done, the CEO of Schilling's company thanked all members of the General Assembly and singled out five elected officials by name, including the former House Finance Committee chairman.", "Costantino played a pivotal role in creating the 38 Studios mess. In some ways, the record shows he bears as much responsibility as the other elected government officials who \"tasked\" him.", "We rate his statement False.", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "Email from Sean Sheehan, spokesman for Steven M. Costantino, commissioner of Department of Vermont Health Access, Sept. 28, 2015", "Interview Sean Sheehan, spokesman for Steven Costantino, commissioner of Department of Vermont Health Access, Oct. 7, 2015", "Deposition transcript, Steven M. Costantino, former chairman Rhode Island House Finance Committee, commissioner Vermont Department of Health Access, July 22, 2014", "Deposition transcript, Marcel A. Valois, director of Rhode Island Economic Commerce Corp. Aug. 15, 2014", "Deposition transcript, Keith Stokes, former executive director of Rhode Island Economic Development Commission, Feb. 11, 2015.", "Deposition transcript, J. Michael Saul, former finance director of RIEDC, November, 2013", "ProvidenceJournal.com, \"Ex-house Finance Chair Costantino denies playing role in bringing 38 Studios to RI,\" Sept. 28, 2015, accessed Oct. 1, 2015", "Email from Robert I. Stolzman to Sharon Reynolds, \"Subject: RIEDC/38 Studios,\" April 1, 2010", "Memorandum from Keith Stokes to Governor Donald L. Carcieri, \"RE: 38 Studios,\" April 1, 2010", "ProvidenceJournal.com, \"Costantino didn’t disclose 38 Studios connection when pushing House bill,\" Sept. 25, 2015, accessed Oct. 8, 2015", "Email from Robert I. Stolzman to Keith Stokes, Melissa Chambers, Michael Saul and Fred Hashway, \"Subject: RIEDC/38 Studios,\" June 16, 2010", "Emails from Keith Stokes, executive director, Rhode Island Economic Development Corp., to J. Michael Saul, finance director of Rhode Island Economic Development Corp., \"Subject: 38\" and \"Subject: Re 38,\" April 2", "Rhode Island Economic Development Corporation, embargoed press release,\"Rhode Island Economic Development Corporation Board Authorizes First Use of New Jobs Creation Program,\" July 2010", "Rhode Island Economic Development Corporation, \"38 Studios Loan Guarantee Agreement Fact Sheet,\" July 2010", "Providence Journal, \"The rise and fall of 38 Studios in Rhode Island,\" Sept. 25, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]