["Democratic presidential candidate former Vice President Joe Biden pumps his fist on stage with his running mate Sen. Kamala Harris, D-Calif. (AP Photo/Andrew Harnik)", "There’s no evidence that the Democratic vice presidential nominee supports a tax to pay for slavery reparations, or even direct payments as reparations.", "On the day of the only scheduled vice presidential debate for 2020, a Facebook post attacking Sen. Kamala Harris, Joe Biden’s running mate, was shared widely.", "Alluding to compensation for slavery, the Sept. 25 claim read:", "\"GET READY TO PAY A FEDERAL TAX ON YOUR HOME FOR REPARATIONS!!, YES!!, KAMALA HARRIS SAID THAT!!\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Harris — the first Black woman and first person of Indian descent to be on a major-party presidential ticket in the United States — has stated her support for studying reparations, but has stopped short of endorsing direct payments. We found no evidence that she has supported any tax for reparations.", "Since 1989, Democrats have introduced bills that call for studying reparations for African Americans to address the nation’s legacy of slavery.", "House leaders have said they expect to pass this year, for the first time, a proposal creating a federal commission to craft an official government apology and remedy plan. Biden, the Democratic presidential nominee, supports a study.", "Black Americans constitute about 13% to 14% of the nation’s population, but own less than 3% of the nation’s wealth, according to testimony to a House committee given in 2019 by William Darity Jr., a professor of public policy and African American studies at Duke University. \"Reparations designated specifically for Black American descendants of slavery must be enacted\" to move Black wealth roughly, from less than $3 trillion to between $13 trillion and $14 trillion, he said.", "Before ending her own run for the Democratic presidential nomination in December 2019, Harris, a California senator, supported studying reparations. But she did not call for them to take the form of payments. We looked through her interviews and comments she made during her campaign and found no statements from her in support of direct payments or a tax on homes to fund such payments.", "Asked in a February 2019 interview if Black people should get reparations, Harris said: \"I think there has to be some form of reparations, and we can discuss what that is.\"", "In another February 2019 interview, she cited a proposal to help families generally, saying: \"I’m proposing the LIFT Act. Give people who are making $100,000 or less as a family a tax credit, which will benefit and uplift 60% of Black families who are in poverty.\"", "An interviewer in March 2019 noted that Harris had floated the idea of mental-health funding as a form of reparations. Harris again steered away from direct payments: \"I think that the word, the term reparations, it means different things to different people,\" she said. \"But what I mean by it is that we need to study the effects of generations of discrimination and institutional racism and determine what can be done, in terms of intervention, to correct course.\"", "In April 2019, Harris said in response to a question that if elected president, she would sign a bill to study paying reparations.", "In an August 2019 interview, Harris repeated her support for a study, but said: \"If we're talking about writing a check, I don't think it is that simple. And frankly, I don't support an idea or a notion that after all this, we're going to say, 'OK, I'm going to write you a check, and then be quiet.' Because that won't solve the problem, which is the systemic issues that are present and will continue to exist.\"", "A Facebook post claims Harris proposed a federal tax on homes to pay for slavery reparations.", "There’s no evidence to support that claim. We rate the statement False.", "Facebook, post (archived here), Sept. 25, 2020", "The Root, Kamala Harris interview (17:15), Feb. 26, 2020", "YouTube, theGrio interview of Kamala Harris, Feb. 24, 2019", "YouTube, Kamala Harris speech, April 5, 2019", "NPR, \"Sen. Kamala Harris On Reparations,\" March 14, 2019", "Des Moines Register, \"Kamala Harris on reparations for slavery: 'It can't just be, 'Hey ... write some checks,’\" Aug. 11, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]