["The August 2, 2020 post tells the story of Captain Elli, who, during the Civil War, “heard the moans of a soldier who lay severely wounded on the field.” That “Confederate soldier” turned out to be the captain’s son, and he then created “Taps” to celebrate his son’s memory at the funeral.", "Elli asked a bugler “to play a series of musical notes he had found on a piece of paper in the pocket of the dead youth's uniform. This wish was granted. The haunting melody, we now know as ‘Taps’ used at military funerals was born,” the post reads.", "Similar Facebook posts can also be found, here, and on an “All American Patriot” page here.", "“It is a heartwarming and poignant story, but false,” wrote Jari Villanueva, a “Taps” historian and professional bugler. Villanueva is one of the few specialists in “Taps” and its history. He wrote a paper, found on the state of Virginia’s website, about the melody’s origins and dedicated an article to the “Taps Myth” on his blog.", "“The story of Captain Robert Ellicombe (or Ellison, or Elli) and his Confederate son is a myth, a fake, a tall tale, a good anecdote to tell around the old campfire, but a story that, outside of the fact it takes place at Harrison’s Landing, holds no truth whatsoever,” he wrote.", "Taps, according to the historian, was adapted by General Daniel Butterfield in 1862 from an already existing bugle melody called “Tattoo” or “Scott Tattoo” from 1835. Similarities can be found in both melodies. The full story of “Taps” can also be found on the Arlington National Cemetery’s page, here.", "This version of the story concurs with historical transcripts. In New York State and the Civil War, published in 1962, Oliver Norton, the bugler who helped Butterfield with the melody, is quoted: “One day, soon after the seven days’ battles on the Peninsular, when the Army of the Potomac was lying in camp at Harrison’s Landing, General Daniel Butterfield, then commanding our Brigade, sent for me, and showing me some notes on a staff written in pencil on the back of an envelope, asked me to sound them on my bugle... After getting it to his satisfaction, he directed me to sound that call for ‘Taps’ thereafter in place of the regulation call.”", "“The myth has been around for a long time,” Villanueva told AFP by email, “Butterfield is credited with ‘Taps’ but he is not mentioned in the ‘Taps myth.’”", "Butterfield never had children, Villanueva confirmed to AFP -- making the rest of the story baseless.", "EDIT: This post was updated on September 15, 2020 to change the header image", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]