["About this rating", "A Missouri couple who became notorious for brandishing weapons at protesters of racial injustice outside their home in June 2020 became the center of another internet scandal after reporters at the local paper in St. Louis uncovered that the couple had previous run-ins with a neighboring synagogue.", "Mark and Patricia McCloskey were nicknamed “Ken and Karen” in 2020 after widely circulated videos and photographs were shared on social media showing the couple holding firearms and allegedly pointing the weapons at protesters outside of their mansion in a gated community. An affidavit released in early July showed that the husband and wife had previously pulled a gun in defense of their property.", "Controversy found the couple again when the St. Louis Post-Dispatch published an August 2020 report describing the legal affairs of the couple spanning the last few decades, including accusations that Mark McCloskey destroyed beehives that had been placed on his property by the neighboring Central Reform Congregation (CRC) in 2013. The story picked up steam after Forward, a Jewish nonprofit magazine, and The Times of Israel published similar articles.", "Snopes readers sent us the following meme that pulled components of quotes from the Forward article, and asked if it was true:", "It is true that the Missouri-based synagogue illegally placed several beehives on the property of its neighbors, the McCloskeys. A dispute between the two neighboring parties ensued in April 2013, and at some point, the beehives were destroyed. But we were unable to find direct evidence proving that the McCloskeys physically destroyed the hives or killed the bees.", "Snopes contacted Rabbi Susan Talve, who has been with the congregation since its founding in 1984. She confirmed that the synagogue had placed several beehives along a large brick wall located between the McCloskey property and the synagogue, which her organization thought was the property line.", "“It turns out that the McCloskeys' property extends a short distance beyond the wall into what we thought was our backyard. Shortly after we put the hives up, Mark McCloskey came and destroyed the casing and the hives,” said Talve, adding that one of the synagogue’s staff saw Mark McCloskey with a chainsaw.", "Snopes asked Talve for further evidence that might prove the allegations, and for the contact information of the lawyer representing the synagogue, but did not receive either by the time of publication.", "A back-and-forth email exchange between Snopes and Talve eventually revealed that there is no direct evidence that the McCloskeys physically destroyed the beehives. Rather, the couple required that the beehives be moved off of their property in spring 2013, and moving the hives caused the bees to die, according to a beekeeper that the rabbi reportedly spoke with.", "\"I remember that he came violently destroying the protection for the hives that the photos show. The beekeeper said it looked like he tried to harm the hives. They did not survive the destruction or the move,\" said Talve. When we asked again whether Mark McCloskey had physically or directly destroyed the beehives, she did not directly answer the question.", "Research conducted by the U.S. Department of Agriculture in 2019 suggested that bees are vulnerable to stress caused by hive relocation, which could lead to colony losses — and smaller colonies are especially susceptible. However, effective transportation strategies like thermoregulation and noise reduction can limit hive loss. In fact, millions of bees from around the country partake in a faux-annual migration.", "Each year, hives are transported in semi-trucks from around the country to the almond fields of California to help pollinate a diverse variety of important crops like almonds, berries, and citrus.", "“Commercial pollinators can pollinate crops all over the country by taking advantage of variation in growing seasons. Hives may be moved multiple times and several thousand miles per year,\" wrote Dacotah Melicher, a computational biologist who has conducted research under the U.S. Department of Agriculture Agricultural Research Service, in a news release.", "In a blog published by the nonprofit group NorCal Bee Informed Partnership, experts wrote that moving hives can be stressful and a “daunting process,\" but doing so is possible “with a little preparation and forethought.\"", "Image courtesy of Mark McCloskey", "In an email to Snopes, Mark McCloskey — who owns the Missouri-based personal-injury practice McCloskey Law Center with his wife, Patricia — told a much different story. Mark maintained that he \"never touched\" the beehives and did not destroy them. He did not respond to an email from Snopes regarding allegations made by Talve that he had taken a chainsaw or sledgehammer to the beehives, but did confirm that he had \"removed the exterior wall.\" No official police report was filed, and there were no charges pressed.", "In a letter provided to Snopes by Mark McCloskey that is dated Oct. 24, 2000, Jerry Altman, a representative for the CRC, wrote to the McCloskeys, and acknowledged the property line discrepancy when the synagogue was built in 2000.", "“As the two of you likely know well, your northern property line extends 10 feet north of the brick wall,” read the letter. “We commit to you that we will not make any landscaping improvements within this 10-foot area without your approval but will keep our improvements to the north of our property line as you can see, we are now doing.”", "Mark McCloskey told Snopes that the large wooden structure seen in the below photo was built by CRC, and that the synagogue had posted a “no trespassing” sign on it.", "The McCloskeys responded with their own note that read:", "Attention! This is private property.", "This structure constitutes a trespass.", "If the remainder is not fully removed and all evidence of its construction cleaned, removed and abated by 10:00 a.m. Monday April 8th, a restraining order will be obtained and we will seek damages and attorneys’ fees.", "Owners Mark and Patricia McCloskey\nOne Portland Place (314) XXX-XXXX", "“We put a notice on the structure telling whoever built it to remove it. I then got a call from the CRC asking me if I liked bees. I said that I loved bees, but the CRC has three acres of ground and its own garden. Why, I asked, did they put their bees on my property? No reason was given, and the structure was not removed,” said Mark McCloskey.", "Mark McCloskey added that he removed the exterior walls pictured below after the time in the first notice had passed but that he \"never touched the beehives, let alone destroyed them.\" Subsequent letters that Mark McCloskey shared with Snopes show disputes between him and the congregation over lawn maintenance and other accusations of trespassing.", "Image courtesy of Mark McCloskey", "Mark and Patricia McCloskey made their first court appearance in St. Louis on Aug. 31, 2020, after being charged with felony unlawful use of a weapon for displaying a handgun and assault rifle during the June 28 protest outside of their home. The couple pled not guilty on Oct. 15.", "The McCloskeys were indicted by a grand jury later in October but a circuit judge disqualified the previously assigned circuit attorney from prosecuting the case in December after ruling that evidence suggested: “initiated a criminal prosecution for political purposes.” In February 2021, U.S. Attorney Richard Callahan was appointed as a special prosecutor to the case and the trial is expected to occur in November 2021. Missouri Gov. Mike Parson has promised to issue pardons if the couple is convicted.", "Kohler, Jeremy.   \"The St. Louis Couple Charged With Waving Guns at Protesters Have A Long History of Not Backing Down.\"\r\n    St. Louis Post-Dispatch.   19 Aug 2020.", "Eshman, Rob.   \"The Rabbi Who Is Neighbor to Mark and Patricia McCloskey Speaks Out: ‘They Are Bullies.’\"\r\n    Forward.   24 Aug 2020.", "TOI Staff.   \"St. Louis Couple Who Aimed Guns At Protestors Had Run-Ins With Local Synagogue\"\r\n    The Times of Israel.   12 July 2020.", "Currier, Joel.   \"McCloskeys Make First Court Appearance In St. Louis Gun Case.\"\r\n    St. Louis Post-Dispatch.   31 Aug 2020.", "Siegel, Robert.   \"Bees Travel Cross Country For The California Almond Harvest.\"\r\n    NPR All Things Considered.   9 March 2017.", "Melicher, Dacotah. Et al.   \"Long-Distance Transportation Causes Temperature Stress in the Honey Bee, Apis mellifera.\"\r\n    Environmental Entomology.   30 March 2019.", "Melicher, Dacotah.   \"Road Trip: How Hive Transportation Puts Stress on Honey Bees.\"\r\n    Entomology Today.   1 April 2019.", "Sallman, Ben.   \"The Basics of Moving Hives.\"\r\n    Bee Informed.   12 Nov 2013.", "Olmos, Dori, Byers, Christine.   \"McCloskeys Appear in Court on Charges, Hearing Postponed.\"\r\n    KSDK 5 On You Side.   6 Oct. 2020", "2020.  \"St. Louis Couple Who Pointed Guns at Protesters Plead Not Guilty to Felony Charges.\"\r\n    CBS News.   14 Oct. 2020.", "Update [Oct. 6, 2020]: This article was updated to reflect the first court appearance of Mark and Patricia McCloskey as they presented their case to a grand jury.", "Update [Oct. 15, 2020]: This article was updated to include the McCloskeys' Oct. 15 not guilty plea and to include their next court appearance on Oct. 28.", "Update [May 19, 2021] The article was updated to include updated court proceedings through May 2021.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]