["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Family and friends who lost loved ones to opioid overdoses leave protest messages written on pill bottles outside the headquarters of Purdue Pharma in 2018. (AP)", "• West Virginia has seen an overdose spike during the pandemic.", "• For the period from April through June, responses by emergency medical services for suspected overdoses rose 33% compared to the same period a year earlier. But for May and June alone, the number rose 47%, which is close to the 50% Miller cited.", "Has the coronavirus pandemic also sent drug overdoses soaring? That’s what Rep. Carol Miller, R-W.Va., said in a July 30 tweet.", "Miller tweeted, \"In West Virginia alone, overdoses have increased by 50% during the #COVID-19 pandemic. We must stop the illegal drug flow across our Southern Border. That’s why I added an amendment to 2021 government funding to #BuildTheWall. Sadly, House Democrats voted this down.\"", "We’ve previously rated Mostly True the statement by fellow West Virginia Republican Rep. David McKinney that \"$53 million a week is coming across the border in drugs.\" We’ve also rated True the statement that West Virginia has the highest overdose rate of any state.", "In this article, we’ll focus on Miller’s assertion that the pandemic and the economic dislocation that has followed have driven an increasing number of overdoses in West Virginia.", "We found evidence in two West Virginia media reports published not long before Miller’s tweet that supports the idea that the state has seen a rise in overdoses since the pandemic.", "In late June, the Charleston Gazette-Mail reported on increases in overdoses. West Virginia Public Broadcasting did so in early July. (Both outlets are PolitiFact West Virginia partners.)", "Both news reports cited data from the West Virginia Department of Health and Human Resources showing that emergency responses for suspected overdoses had increased by close to 50%. At the time of those reports, the agency had recorded 923 emergency responses for May 2020, compared with 650 in May 2019. That was a 42% increase.", "The article also reported a more than fivefold increase for June in average weekly overdoses that are reversed by naloxone, a medication used to rapidly reverse opioid overdoses. Overdoses reversed by naloxone averaged 16 per week in June 2020, compared with norms of three per week and 12 per month, according to the article.", "Miller’s office referenced the articles when we inquired, but because the articles had appeared several weeks before Miller’s tweet, we looked for state Health Department data that was available closer to the date of her statement. The data for each month are updated on the 15th day of the following month, Allison Adler, the department’s director of communications, told PolitiFact, but the updates could include some earlier months.", "Counting all the updates made as of Aug. 15, the number of overdoses in April 2020 held steady compared with the previous year, but the numbers did spike in May and June. Emergency response for suspected overdoses increased by 64% in May and 30% in June.", "So for the three months combined, the number increased by 33% from a year earlier, but during May and June alone, the numbers rose by 47%, which is close to Miller’s figure. July numbers were on par with those in 2019, but Miller wouldn’t have known about that data point when she sent her tweet.", "The department also offers another metric: emergency room visits related to overdoses. These increased by 12% in May and June compared to the year prior. (It would later rise by 28% in July.)", "This pattern has been echoed elsewhere in the United States.", "The New York Times has reported that drug overdose deaths rose to record numbers in 2019, and are already 13% higher than average in 2020, according to mortality data from local and state governments covering 40% of the U.S. population. The Association of American Medical Colleges also reported that suspected drug overdoses rose 18% from mid-March through May, which would be consistent with the notion that the pandemic is pushing overdoses higher.", "Miller said, \"In West Virginia alone, overdoses have increased by 50% during the #COVID-19 pandemic.\"", "For the three months from April through June, EMS responses rose by 33%. Looking just at May and June, the increase was 47%.", "We rate her statement Mostly True.", "Carol Miller, tweet, July 30, 2020", "Centers for Disease Control and Prevention, 2018 Drug Overdose Death Rates, accessed August 10, 2020", "WV Public Broadcasting, \"Overdose Incidents Rose Sharply Around Ohio Valley During Pandemic,\" July 13, 2020", "Charleston Gazette Mail, \"'How are we going to keep people alive?' Behind the pandemic, overdoses are rising across West Virginia,\" June 20, 2020", "WV DHHR, data dashboard, accessed August 10, 2020", "Association of American Medical Colleges, COVID-19 and the opioid crisis: When a pandemic and an epidemic collide, July 27, 2020", "New York Times, \"In Shadow of a Pandemic, U.S. Drug Overdose Deaths Resure to Record,\" July 15, 2020", "PolitiFact, Does West Virginia lead the nation in overdose drug death rate? Yes, March 23, 2018", "PolitiFact, What is the value of drugs that come to the U.S. border?, Nov. 18, 2019", "Email interview with Allison Adler, director of communications for the West Virginia Department of Health and Human Resources, Aug. 4, 2020", "Email interview with Tom Moran, spokesman for Carol Miller, Aug. 11, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]