["The claim and photo were published on Facebook here on September 10, 2020.", "The post’s Urdu caption translates to English as: “Sad news. Unknown people murdered Gul Panra in Peshawar.”", "The same photo of Gul Panra was also posted alongside similar claims on Facebook here and here, and on Twitter here, here and here.", "However, the claim is false.", "“I am alive and well by the grace of Allah,” Panra told AFP by phone on September 15, 2020. “Just for getting likes and shares, people are posting my photos with unrelated news on social media, which is sad.”", "The photo being shared in the false social media posts was taken from Panra’s official Instagram account here.", "Below is a screenshot comparison of the photo in the misleading post (L) and Panra’s original post on Instagram(R):", "False claims about Panra’s death circulated a day after a transgender woman also named Gul Panra was killed in Peshawar on September 9, 2020, as AFP reported here.", "\"A group of four transgender (women) were returning home after performing at a wedding function when unidentified gunmen opened fire on their vehicle, killing Gul Panra on the spot,\" said Hassan Jehangir Wattoo, a senior police official in Peshawar, according to AFP’s report.", "Dawn, a Pakistani English-language newspaper, also reported on the murder here.", "On September 14, 2020, local police took to Twitter to announce that “the main suspect in the murder of transgender (woman) Shakeel aka Gul Panra has been arrested.”", "The tweet also carries an image featuring a photo of police with the detained suspect and a seperate photo of the victim, who does not resemble the singer Gul Panra.", "Below is a screenshot comparison the image in the police tweet (L) and a photo of singer Gul Panra from her official Instagram account (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]