["The \"Owen\" page in Gov. Raimondo's presentation to GE.", "As she tried to bring General Electric to Rhode Island, one of Gov. Gina Raimondo’s more interesting sales pitches involved \"Owen.\"", "A character in various General Electric television ads, Owen is a young man thrilled about the prospect of working as a programmer for the old-line industrial and financial services company looking to become a Silicon-Valley-style data giant.", "Page 14 of Rhode Island’s PowerPoint presentation to GE portrays \"Bay State Owen,\" who earns a $109,000 salary, and \"Ocean State Owen,\" who makes $93,000.", "The governor’s Massachusetts Owen pays $2,300 per month for rent while Rhode Island Owen only pays $1,500.", "The headline is \"Owen in MA vs. Owen in RI\" and the sub-headline proclaims: \"Advantage: Rhode Island.\"", "Initially, we thought Raimondo was saying Owen does better if he works in Rhode Island. We weren’t the only ones judging from the comments online.  When we did the math, we concluded it was definitely not financially advantageous for Owen to work in Rhode Island.", "Even after paying $800 more for rent in Massachusetts, the bespectacled software developer still earns $500 more per month, according to numbers in the brochure that Raimondo says she shared with GE.", "Subtracting rent, Owen would make $81,400 per year in Massachusetts versus $75,000 in Rhode Island.", "Raimondo’s claim became a lightning rod for some commenters posting on providencejournal.com. Taking Owen’s side, one commenter on providencejournal.com: \"This page actually shows MA being better than RI.\" That wasn’t the only one.", "But Raimondo wasn’t making a pitch to prospective employees. She was trying to court Owen’s employer.", "Raimondo’s point was that GE can pay Owen $16,000 less if the company sets up its headquarters in Rhode Island.", "The \"Rhode Island advantage\" isn’t for Owen. It’s for GE.", "Raimondo’s spokeswoman, Marie Aberger, confirmed this and provided source information for the numbers on salary and rent:", "The numbers check out. The mean yearly wage for software programmers in Massachusetts is about $109,000 per year and about $93,000 in Rhode Island, according to the federal Bureau of Labor Statistics. The rent data came from Zillow.", "Our ruling", "There are lots of factors, beyond salaries and rental costs, that govern which state is best for GE or best for Owen.", "But when looking only at Owen’s prospective salary and rental costs, it’s clear Rhode Island is more advantageous for GE, which was the target of Raimondo’s presentation. The ruling is True.", "The question that can’t be answered, of course, is how much Owen might value living in Boston’s Seaport district as opposed to, say, Providence’s West End.", "ProvidenceJournal.com, \"Raimondo details Rhode Island’s pitch to GE,\" Jan. 26, 2016, accessed Jan. 29, 2016.", "ProvidenceJournal.com, \"GE:RI made great pitch for headquarters; may bring some jobs here,\" Jan. 13, 2016, accessed Jan. 29, 2016.", "Rhode Island Commerce Corp., \"The RI Proposition: Opportunities and Advantages in the Ocean State,\" September 2015, accessed Jan. 29, 2016.", "Marie Aberger, press secretary for Gov. Gina Raimondo, email, Feb. 1, 2016.", "BLS.gov, \"Metropolitan and nonmetropolitan area occupational employment and wage estimates, Boston, Cambridge, Quincy,\" May 2014, accessed Feb. 2, 2016.", "BLS.gov, \"Metropolitan and nonmetropolitan area occupational employment and wage estimates,", "Providence, Fall River, Warwick,\" May 2014, accessed Feb. 2, 2016.", "Zillow.com, \"Market Overview: Rentals, Boston Metro,\" December 2015, Feb. 3, 2016.", "Zillow.com, \"Market Overview: Rentals, Providence Metro,\" December 2015, Feb. 3, 2016.", "YouTube.com, \"What’s the matter with Owen ‘Zazzies’ -- GE,\" Sept. 8, 2015, accessed Feb. 2, 2016.", "YouTube.com, \"What’s the matter with Owen? ‘Hammer’ -- GE,\" Sept. 8, 2015, accessed Feb. 2, 2016.", "YouTube.com, \"What’s the matter with Owen? ‘Big News’ -- GE,\" Sept. 8, 2015, accessed Feb. 2, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]