["About this rating", "On Jan. 7, 2018, Oprah Winfrey was honored with the Cecil B. deMille Award at the Golden Globes and used the opportunity to deliver a speech about women's empowerment, the \"Me Too\" movement, and changes on the horizon.", "As political pundits speculated that Oprah was eyeing a presidential run (host Seth Meyers even opened the show with an \"Oprah 2020\" joke), others claimed that her message was hypocritical, using a photograph purportedly showing her kissing Hollywood producer Harvey Weinstein (who has been accused of sexual assault by several high-profile women) as proof:", "The photograph of Oprah kissing Harvey Weinstein is real, although it was taken several years before Weinstein's alleged sexual misconduct was made public; it was taken at the 19th Annual Critics' Choice Movie Awards in January 2014 by photographer Kevin Mazur, and it is available here via Getty Images.", "Others took the criticism of Winfrey a step further, claiming that the photograph actually shows the famous television host nibbling or sucking on Weinstein's ear:", "The first rule of Anti-Sexual Assault Club is to not put a sexual assaulter's earlobe in your mouth at the head table.", "Am I the first person on planet Earth to blow up this picture? Ewww!!", "We compared this blown-up image with the photograph from Getty, and it does not appear to be doctored, but neither is it proof that his earlobe was actually in her mouth. The photograph, as best as we can tell, shows Oprah kissing Weinstein near his ear, not suckling it. We also examined contemporary reports on the 2014 Critics Choice Awards and couldn't find any mention of Winfrey and Weinstein engaging in inappropriate canoodling during the awards show, something that surely would have made the gossip pages if it had been true.", "However, even if this were true, it still would have been long before Weinstein was outed and ostracized as an alleged serial predator. Although Harvey Weinstein became the face of sexual harassment at the end of 2017, that was not the case in 2014. At that time, he was known mostly as a prolific producer who had worked with a number of well-respected actors and actresses. There certainly is much to be said about how an alleged predator was able to have a successful decades-long career (especially since this was apparently an \"open secret\"), but it is unclear whether Oprah knew about it at that time.", "What we do know, however, is that she called Weinstein's behavior \"hideous\" in an October 2017 statement:", "I've been processing the accounts of Harvey Weinstein's hideous behavior and haven't been able to find the words to articulate the magnitude of the situation. Filmmaker James Schamus captured so much of what I've been feeling when he said:", "\"This is the story of one predator and his many victims; but it is also a story about an overwhelming systemic enabling, and until that story is fully told we will fall far short of stopping future depredations on a similar scale.\"", "https://www.hollywoodreporter.com/…/filmmaker-james-schamus-…", "Thanks to the brave voices we've heard this week, many more will now be emboldened to come forward EVERY time this happens. I believe a shift is coming.", "This is not the first time that Weinstein's behavior has been used to attempt to smear a celebrity retroactively. A doctored photograph attempting to make it appear as though showing President Barack Obama bestowed the Presidential Medal of Freedom on the producer also made the usual fake-news rounds just after stories about him began to appear in October 2017.", "Gajanan, Mahita.   \"The Internet Is Ready for an Oprah and Tom Hanks White House In 2020.\"\r\n    Time.   8 January 2017.", "Garber, Megan.   \"In the Valley of the Open Secret.\"\r\n    The Atlantic.   17 October 2017.", "CBS News.   \"Oprah Winfrey Says Harvey Weinstein Scandal is 'Triggering a Lot of Unreleased Pain.\"\r\n    17 October 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]