["The claim was posted here on Facebook on February 14, 2021 with a photo showing Ali Sadpara with Major General Dr. Ehsan Mehmood Khan of the Pakistani army.", "The Urdu-language caption translates to English as: “The world’s biggest operation is successful. Thank God. The biggest news that Pakistani army has announced Muhammad Ali Sadpara is alive after 216 hours, the world’s biggest record. Greater Pakistan.”", "Muhammad Ali Sadpara was part of the team that completed the first ever winter ascent of Nanga Parbat and is the only Pakistani to have climbed 8 of the fourteen 8,000-metre peaks in the world, as reported by Pakistani media outlet Dawn News.", "On February 5, 2021, Ali Sadpara’s team of climbers lost contact with their base camp while attempting to climb the world’s second-highest mountain, K2, AFP reported here.", "The K2 mountain is located in northern Pakistan in the Karakoram range which spans the border between Pakistan and China.", "The same claim and photo have been shared in multiple posts on Facebook here, here, here, here, here, here, here, here, here, here, here, here, here, here, here, here and here.", "Separately, a video posted here on YouTube on February 12, 2021, which has been viewed more than 100,000 times, also claims that Ali Sadpara has been found through satellite imagery.", "The Urdu-language narration at the start of the video translates to English as: “Hello viewers and welcome to Historical Facts’ new video. Ireland has found Ali Sadpara. He’s been identified in satellite imagery. Pakistani Air Force's C130 ready for rescue mission, now what are we waiting for? Big operation by Pakistani Army and Pakistani Air Force. Made the unachievable achievable. Whole country is filled with happiness.”", "The claims, however, are false.", "Ali Sadpara’s social media team said on Twitter on February 15, 2021 as part of a thread: “The government and other stakeholders are still putting their best efforts to find our missing climbers. A meeting of apex committee regarding SAR [Search And Rescue] will be held on 17th Feb. in Gilgit. Please avoid any premature statements and keep away from fake reports. Management”.", "We're sorry for the lack of updates on Ali Sadpara official social media. As Ali's mangmnt we've been too focused on the rescue efforts of past days to pay attention to anything else. We have been both inundated by love and support, but also by fake news that distressed us all.", "A reverse image search on Google found the photo seen in the Facebook posts was posted here by local travel agency Alpine Adventure Guides’ Twitter account in March 2019 when Ali Sadpara climbed the Makalu mountain, the 5th tallest mountain in the world.", "Below is a screenshot comparison between the photo in the misleading Facebook post (L) and the 2019 photo from Alpine Adventure Guides’ Twitter post (R).", "According to a February 15, 2021 report from Dawn News, some tents and sleeping bags were located through satellite imagery, however, it transpired that they did not belong to Ali Sadpara and his group of climbers.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]