["OG&E's Mustang Energy Center power plant in Oklahoma City on Jan. 10, 2018. (AP/Sue Ogrocki)", "For months, President Donald Trump has been touting the benefits of the tax law he signed in December. But in early June, he began expanding his argument beyond lower tax bills to lower energy bills.", "On June 7, Trump tweeted, \"$3 billion payoff: 101 utilities cut rates, credit GOP tax cuts.\" The tweet linked to a Washington Examiner article that in turn cited research by Americans for Tax Reform, a group supportive of the tax cut.", "“$3 billion payoff: 101 utilities cut rates, credit GOP tax cuts” https://t.co/x1a1OJuRgd", "This isn’t the first time the White House has relied on Americans for Tax Reform for evidence of real-world impacts from passage of the tax bill. Previously, we looked at Trump’s statement that \"since we passed tax cuts, over 3 million workers have gotten tax cut bonuses — many of them thousands and thousands of dollars.\" That talking point, gleaned from the group’s research, rated Mostly True.", "The energy rate-cut list — which is a sub-list of the broader one we checked previously — attracted the White House’s attention not long after it hit its 100th item.", "For the utilities on the group's list that provided an estimate of savings per customer, most said rate-payers would save about $1 to $4 on their bill per month.", "Americans for Tax Reform cited a large number of company news releases and news articles, so we don’t quarrel with the number (which had already grown to 102 a day later).", "That said, we will provide some additional information that helps put the list in fuller context.", "It shouldn’t be surprising to see a lot of investor-owned utilities lowering rates after the corporate tax reduction. And it also shouldn’t be surprising that the companies specifically cited the tax changes as the reason for the rate cut. In most cases, experts said, utilities would have been required to do so by their regulators.", "The tax law has an impact on privately owned utilities — often called \"investor-owned utilities,\" or IOUs for short — but not on public utilities.", "Investor-owned utilities pay corporate taxes, so the tax law’s lowering of the top corporate rate from 35 percent to 21 percent should save this type of utility a substantial amount of money.", "By contrast, publicly held utilities do not pay corporate taxes, so they are unaffected by this provision of the tax bill. Public utilities include rural electric cooperatives, municipally owned utilities, and federal or state power authorities.", "Among electricity utilities, about two-thirds of Americans are served by investor-owned utilities, while about a third receive their power from public utilities. For water utilities, a few of which appear on the group's list, public utilities are dominant.", "So while 101 utilities cutting their rates may seem like a large number, your ability to benefit from a rate cut depends on which utilities happen to serve your area.", "It’s also worth pointing out that many of these rate cuts were preordained by existing energy regulations.", "\"Utilities are natural monopolies, and because of that, they’ve been regulated for well over 100 years,\" said Manny Teodoro, a political scientist at Texas A&M University who has studied energy issues. \"It’s a recognition that a pure monopoly will result in a lack of competition and abusive pricing.\"", "For that reason, under longstanding regulations, utilities need to go back to energy regulatory bodies whenever they seek to modify their rates, in order to provide reasons for the change. And if a utility happens to benefit from a tax change, there’s a good chance it will be required under existing regulations to lower their rates to account for that.", "\"Rates are set by public utility commissions through rate-making processes that would clearly identify the reasons for the rate change, up or down,\" said Billy Pizer, a Duke University public policy professor who studies energy.", "This doesn’t undercut the larger point of the tally, but it does suggest that the rate cuts required two elements to materialize — the tax cut, which Trump touted, and the longstanding regulations that require companies to share the tax gains with ratepayers rather than just with shareholders. And the latter is an aspect Trump didn’t get into.", "Trump tweeted, \"101 utilities cut rates, credit GOP tax cuts.\"", "The list comes from a organization that strongly supported the tax bill. The tally of rate cuts is well-documented, and the group acknowledges that it is not comprehensive.", "That said, it’s worth noting that public utility customers will not see the same types of rate cuts cited in the list, which is about one-third of Americans. Trump’s tweet seeks full credit for the tax law, while glossing over the role of energy regulations that mandate that utility savings be passed along to customers.", "We rate the statement Mostly True.", "Donald Trump, tweet, June 7, 2018", "Americans for Tax Reform, \"Thanks to GOP Tax Cuts, Utilities Are Lowering Rates,\" June 7, 2018", "Washington Examiner, \"$3 billion payoff: 101 utilities cut rates, credit GOP tax cuts,\" June 07, 2018", "American Council for an Energy-Efficient Economy, \"Utility Regulation and Policy,\" accessed June 8, 2018", "Reuters, \"Largest U.S. electric companies by megawatts, customers,\" April 29, 2014", "New York Times, \"Cities Weigh Taking Over From Private Utilities,\" March 13, 2013", "Email interview with Severin Borenstein, chair in business administration and public policy at the University of California-Berkeley's Haas School of Business, June 9, 2018", "Email interview with Robert S. Mudge, principal with the Brattle Group, June 9, 2018", "Email interview with Billy Pizer, Duke University public policy professor, June 8, 2018", "Interview with Manny Teodoro, political scientist at Texas A&M University, June 8, 2018", "Email interview with Peter Fox-Penner, director of Boston University's Institute for Sustainable Energy, June 8, 2018", "Email interview with Janice A. Beecher, director of the Institute of Public Utilities at Michigan State Universities, June 8, 2018", "Email interview with John Kartch, vice president for communications at Americans for Tax Reform, June 8, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]