["About this rating", "On 27 April 2012, the Daily Mail published an article reminiscent of a 1995 Weekly World News article and a gender-switched version of the 1996 film The Dentist, reporting that a dentist in Poland had extracted all her ex-boyfriend’s teeth after he dumped her for another woman:", "Anna Mackowiak, 34, is facing jail after taking her revenge on 45-year-old Marek Olszewski when he turned up at her surgery with toothache just days after breaking up with her.", "She gave him a heavy dose of anaesthetic and plucked his teeth out.", "She then wrapped his head and jaw in a bandage to stop him opening his mouth and said there had been complications and he would need to see a specialist.", "The dentist, who works in Wroclaw, Poland, said: ‘I tried to be professional and detach myself from my emotions. 'But when I saw him lying there I just thought, \"What a b******\".'", "The article went on to state that the dentist was being investigated for medical malpractice and could face three years in jail.", "The story of the vengeful dentist was picked up and reprinted by a number of U.S. news outlets, including Fox News, the Los Angeles Times, the San Francisco Chronicle, Huffington Post, Yahoo! News, MSN, the New York Post, and the New York Daily News.  However, many readers expressed skepticism about this report, and with good reason: it proved to be nothing more than a fabrication.", "On 2 May 2012, the Polish publication Gazeta Wroclawska noted that no dentist by the name of Anna Mackowiak was working in the city of Wroclaw, as stated in the original Daily Mail article.  That same day, Polish television news channel TVN4 also reported that authorities in Wroclaw had no knowledge of a dentist by that name or any dental malpractice issue similar to the one described, and that the story was apparently an Internet joke with no basis in reality.", "MSNBC also investigated and found that no Polish authorities were aware of any such case:", "\"Lower Silesia Police Department has not been notified about such an event and is not investigating such a case,\" Pawel Petrykowski of the Provincial Police Headquarters in Wroclaw said.", "A legal adviser for Poland’s Chamber of Physicians and Dentists, which handles disciplinary matters, said the organization is not investigating and has never investigated any such case, and added that there is no dental practitioner named Anna Mackowiak listed in Poland’s central register of dentists.", "\"No information about this kind of misconduct has been provided to the Supreme Chamber,\" the legal advisor, Marek Szewczycski, said in an email. \"The Supreme Chamber is also not aware of any actions of this kind being taken by the Regional Chamber of Physicians and Dentists in Wroclaw, which would be the competent authority in case of a possible professional misconduct committed by a dental practitioner from Wroclaw.\"", "The Daily Mail reporter responsible for the story admitted he hadn't written it and professed to be unable to identify its origins:", "The article appears under the byline of staff reporter Simon Tomlinson.", "But Tomlinson said he does not know where the story came from and distanced himself from it when questioned about its origins.", "\"I've drawn a bit of a blank,\" he said in an email. \"The (Daily) Mail Foreign Service, which did the piece for the paper, is really just an umbrella term for copy put together from agencies. My news desk isn’t sure where exactly it came from.\"", "Tennant, Erin.   \"Story of Vengeful Jilted Dentist Was Too Good to Be True.\"\r\n    MSNBC.com.   8 May 2012.", "Tomlinson, Simon.   \"Dentist Pulled Out All Boyfriend's Teeth After He Dumped Her.\"\r\n    Daily Mail.   27 April 2012.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]