["About this rating", "After a devastating pedestrian bridge collapse at Florida International University on 15 March 2018, the National Transportation Safety Board opened an investigation in order to determine exactly what went wrong and who was ultimately responsible for the disaster.", "Some corners of the Internet couldn't wait for the results of this report, however, and claimed that the true culprit was painfully obvious: women.", "An article published in the days following the bridge collapse reported that the Munilla Construction Management, one of the companies that worked on the FIU-Seawater Bridge, was a \"female led construction company.\" Another article claimed that the bridge was constructed by an \"all-women engineering team,\" while a video based off these two articles took this claim one step further and stated that this bridge was constructed by an \"all-female company.\"", "These articles both contained a collage of female construction workers and multiple paragraphs explaining why women just aren't meant to do construction:", "Florida has been having its bad stroke of luck as of late. First the horrible tragedy in Parkland, and now this; Florida International University’s “instant bridge,” spontaneously collapsing earlier on Thursday. The two companies responsible for the poorly constructed bridge were MCM and Figg, both have a sketchy history when it comes to construction, but for today’s purposes, we’re going to focus on MCM, because there’s a valuable lesson that can be learned here.", "That lesson is this; there are some things that women shouldn’t do. There are some things women can’t do. One of these is construction.", "The collages featured in these articles show female MCM employees, but not necessarily women who worked on the Florida bridge. Most of these photographs were pulled from the company's social media posts celebrating women's diversity and not from a post about the project in Florida.", "Miami-Dade County Commissioner Jose Pepe Diaz did post several images from the construction site on the morning the bridge was put into place. Those photographs showed various politicians and construction company heads, almost all of which were male:", "Although the headline for this article blared that \"A Female-Led Construction Company Built the Florida Bridge That Collapsed,\" the text was void of evidence to prove such a claim. In fact, the body of article outright contradicted its title (emphasis ours):", "Though MCM is owned by five brothers, a lot of people one rung down the ladder from them are women. Some of the construction workers are even women.", "Here's a photograph of MCM's board of directors:", "MCM's board of directors clearly aren't all-female. But what about the construction crew? The web sites Squawker and Sandra Rose both claim that a woman named Leonor Flores was the project manager for the FIU bridge:", "The lead engineer on the foot bridge project is a female, Leonor Flores, who is a graduate of FIU.", "This claim, however, appears to be based on a misreading of an article published by the university's official web site on 14 March 2018. The web site quoted Flores, who was a Florida International University graduate and who works for MCM, about how she hopes her daughter pursues mathematics in school. The site mentions the new FIU bridge (the article was published before the collapse), but it never said that Flores was working on this particular project:", "Leonor Flores ’98 is a project executive and one of 63 FIU alumni who work for MCM, the construction firm building the FIU-Sweetwater UniversityCity Bridge, which will further connect FIU and its northerly neighbor, the City of Sweetwater. She was excited to share her work with her family, especially (her daughter) Michelle, who is interested in STEM (science, technology, engineering and math) in school.", "Michelle said she might want to follow in her parents’ footsteps and go to FIU when the time comes, and that it was fascinating to see her mom’s work in action. “I’m interested in the architecture and the design of the bridge, and the math portion of it,” she said.", "Said Leonor: “It’s very important for me as a woman and an engineer to be able to promote that to my daughter, because I think women have a different perspective. We’re able to put in an artistic touch and we’re able to build, too.”", "FIU added a statement at the top of their article to clarify that Flores did not work on the bridge project \"in any capacity.\"", "The only other piece of \"evidence\" provided by these web sites that MCM employed an \"all-female\" team for this project came from a tweet that the company sent on International Women's Day:", "MCM hailed Flores and her all-women design team in celebratory social media posts on Twitter.com in the hours before the deadly collapse.", "This single sentence gets multiple things wrong; Flores was not affiliated with the bridge project, the tweet was not sent in the \"hours before the deadly collapse\" and it did not celebrate an \"all-women design team.\"", "Munilla Construction Management is not an \"all-female\" company and they did not use an \"all-female\" engineering team to construct the ill-fated FIU-Sweetwater Bridge. This claim is based on social media posts celebrating International Women's Day and a misreading of a news article. In other words, there is no basis for this claim.", "The misguided argument posed by these web sites would perhaps have been better served if they had focused on FIGG Bridge Designs, another company that worked on the Florida project and whose chief executive officer actually happens to be a woman, although the company does not exclusively hire women. Linda Figg, daughter of company founder Eugene Figg, was not mentioned in either article. Regardless, the company's lead engineer on the project, Denney Pate, was a man.", "The Miami Herald reported that a plethora of issues could have caused the FIU-Sweetwater UniversityCity Bridge to collapse. Although it will likely be some time before the National Transportation Safety Board finishes its investigation, we would be willing to bet that the biological sex of the engineers is not listed as a cause of the tragedy on the final report.", "Madan, Monique.   \"Investigation of What Caused the FIU Bridge Collapse is Only Just Beginning.\"\r\n    Miami Herald.   16 March 2018.", "Kiah, Clara-Meretan.   \"Community Gathers to Watch 950-Ton Bridge Move Across Southwest 8th Street.\"\r\n    FIU News.   14 March 2018.", "Ellen Klas, Mary.   \"Bridge Designer Left State Voice Mail About Cracks Days Before FIU Bridge Collapsed.\"\r\n    Miami Herald.   16 March 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]