["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Hillary Clinton's Senate record has been attacked during her 2016 presidential bid. (Tampa Bay Times)", "As Jeb Bush reels off his accomplishments as governor cutting taxes and slashing state jobs, he says he’s ready to put his record up against Hillary Clinton’s.", "A day after his announcement speech at Miami Dade College, Fox News’ Sean Hannity asked Bush to comment on the Democrat’s record.", "Hannity: \"Can you name in a serious way one specific Hillary accomplishment, or what would you say that's good about her?\"", "Bush: \"She's smart. I think she's smart. I think she loves her country. I don't ascribe bad motives for people that I don't agree with. But as a senator, I think she passed -- she has her name on three laws in eight years.\"", "There is some truth to Bush’s claim about laws passed, but it doesn’t tell the full story about her legislative accomplishments as a senator.", "Laws with Clinton’s name", "Clinton was first elected as a senator from New York in 2000 and re-elected in 2006. She resigned to become secretary of state, so her Senate tenure was from January 2001 to January 2009.", "Bush’s spokesman sent us a list of three bills Clinton sponsored that became law. These laws were uncontroversial matters that passed by unanimous consent in the Senate and voice vote in the House and then were signed by President George W. Bush:", "S. 1241:  A bill to establish the Kate Mullany National Historic Site in the State of New York. Bush signed the bill Dec. 3, 2004.", "S. 3613: A bill to name a post office the \"Major George Quamo Post Office Building.\" Bush signed the bill Oct. 6, 2006.", "S. 3145: A bill to designate a highway in New York as the Timothy J. Russert highway. Bush signed the bill July 23, 2008.", "But there are other ways that Senators can influence legislation even if they don’t end up as the sponsor of the final version:", "Co-sponsored bills: There were 74 bills that became law that Clinton co-sponsored. For example, she was one of 54 cosponsors on the Lilly Ledbetter Fair Pay Act, signed in January 2009 by President Barack Obama. (The fact that she co-sponsored these bills doesn’t tell us much about her role in their passage, but Bush referred to bills that \"she has her name\" on, so it’s worth noting those she co-sponsored.)", "She co-sponsored one version but another version passed: For example, she co-sponsored S.1, the American Recovery and Reinvestment Act in January 2009 while the version that passed was H.R. 1.", "Sponsored amendments: She put forward amendments that influenced laws sponsored by others. She sponsored three amendments on a bill for security and disaster funding. The amendments passed in 2007 and the bill passed in 2008.", "Two experts who study Congress -- Norman Ornstein, a scholar at American Enterprise Institute, and Sarah Binder, a political science professor at George Washington University and Brookings Institution scholar -- said that the number of sponsored or co-sponsored bills signed into law isn’t a thorough measure of effectiveness or productivity for a member of the Senate.", "\"Offering amendments on the floor, holding hearings, contributing to oversight, helping to negotiate agreements, pushing federal agencies to be responsive to constituents back home -- all of these might contribute to making a senator ‘effective,’ but none of these endeavors of course would show up in a count of bills sponsored or passed or enacted,\" Binder said.", "As for Bush’s claim about the number of laws \"she has her name on,\" Binder said that it’s fair game to also look at the number of bills Clinton co-sponsored.", "\"Because ‘have her name on’ is so vague, I don't see the grounds on which to exclude co-sponsored bills,\" she said.", "Ornstein said that the names that go on bills of any real significance are the committee chairs -- for example the Dodd-Frank 2010 banking reform bill. Sen. Chris Dodd and U.S. Rep. Barney Frank were the major figures behind the law, but other senators also had roles and don’t have their names on the bill.", "Meanwhile, the Affordable Care Act \"does not have Al Franken's name on it, but a really important provision, the medical-loss ratio, was his handiwork,\" Ornstein said. \"Effectiveness can be a behind-the-scenes role, adding a serious amendment, working inside to get the language exactly right. By any reasonable standard, including the private comments of her colleagues on both sides of the aisle when she was in the Senate, she was very effective.\"", "Our ruling", "Bush said that as a senator, Clinton had her name \"on three laws in eight years.\"", "Bush used vague language here, so it’s fair game to look at the three sponsored bills and the 74 co-sponsored ones that passed. Also, congressional experts warn that legislative influence goes beyond having your name as a sponsor or co-sponsor. Senators weigh in with amendments, debate and negotiations.", "The statement is partially accurate, but leaves out important details so we rate this claim Half True.", "https://www.sharethefacts.co/share/57684e12-55f1-4abd-aa03-85984b69d701", "Fox News, Sean Hannity interview with Jeb Bush and clip about Hillary Clinton’s laws, June 16, 2015", "GovTrack.us, Search of bills sponsored and co-sponsored by Sen. Hillary Clinton, January 2001-January 2009", "GovTrack.us, \"Dodd Frank Wall Street Reform and Consumer Protection Act,\" July 21, 2010", "Congress.gov, H.R. 2638, Sept. 30, 2008", "Congress.gov, SA 2474  SA 2438  SA 2390, July 25-26, 2007", "U.S. Library of Congress, S. 1828 Influenza Vaccine Security Act of 2005, Introduced Oct. 6, 2005", "U.S. Library of Congress, S. 1283 Lifespan Respite Care Act of 2005, Introduced June 21, 2005", "U.S. Sen. Lindsey Graham, Press release about Tricare, Sept. 29, 2006", "The Hill, \"Jeb knocks Hillary’s record in the Senate and at State,\" June 16, 2015", "USA Today, \"Can Hillary be elected commander in chief?,\" July 18, 2005", "Niagara Falls Reporter, \"Mountain views: Principi Hero behind BRAC process,\" Aug. 30, 2005", "Houston Chronicle, \"Career switch imperils teacher’s social security,\" May 2, 2002", "PolitiFact, \"Clinton’s work has been low profile,\" Jan. 7, 2008", "PolitiFact Fact Sheet, \"Clinton. Obama. Their bills,\" March 28, 2008", "PolitiFact, \"Dan Sullivan says Sen. Mark Begich has only passed one law,\" Sept. 22, 2014", "PolitiFact, \"How many bills has Ted Cruz passed in the Senate? 1,\"  March 29, 2015", "PolitiFact Florida, \"Group says Connie Mack has passed only one bill in Congress in seven years,\" Aug. 6, 2012", "Interview, Matt Gorman, Jeb Bush campaign spokesman, June 17, 2015", "Interview, Joshua Schwerin, Hillary Clinton campaign spokeswoman, June 17, 2015", "Interview, Sarah Binder,  political science professor at George Washington University and Brookings Institute scholar, June 17, 2015", "Interview, Norman Ornstein, scholar at American Enterprise Institute, June 17, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]