["The image was posted on Facebook here on May 6. It has been shared more than 150 times", "The image, which purports to show a section of an article on a website called worldhealth.net, has the following bullet point circled in red: “People who get flu shots will be the first to die in an actual global pandemic because they have been made vulnerable to infections\".", "The text overlay in the image reads: “Study from 2017 showed those who got a flu shot would be the most vulnerable during any global pandemic.”", "Below is a screenshot of the misleading post:", "The image was also shared hundreds of times here and here on Twitter and here on Facebook alongside an identical claim.", "The misleading claim circulated online as the novel coronavirus, which casues the disease COVID-19, continued to spread globally. As of May 10, the virus has infected more than 3.9 million worldwide, and killed at least 274,316 people according to this report by the World Health Organization (WHO).", "The claim in the posts is misleading. Global health agencies and epidemiologists have said that flu vaccinations strengthen people's immune systems. There is also no evidence that the flu vaccine, which protects people from infections caused by influenza viruses, makes people more vulnerable to the SARS-CoV-2 virus, commonly known as the novel coronavirus, according to scientists.", "-- Flu vaccine --", "According to the US Centers for Disease Control and Prevention (CDC), flu is a “contagious respiratory illness caused by influenza viruses that infect the nose, throat, and sometimes the lungs. It can cause mild to severe illness, and at times can lead to death.”", "The health agency advises people above the age of six months who do not have allergies to ingredients in the vaccine to get a seasonal influenza vaccine. These vaccines work by causing the body to develop antibodies against a specific virus -- in this case, against the influenza viruses -- that has been used to make the vaccine.", "Contrary to the misleading claim, the CDC says that influenza vaccines make people stronger by cutting the risk of flu illness by between 40 and 60 percent.", "While \"weakness\" is listed as a side effect of the shots, such “life-threatening” side effects are “very rare”, according to the CDC.", "A spokesperson for Australia’s Department of Health also told AFP in an email on May 8: “Vaccines strengthen the immune system by training it to recognise and fight against specific germs. The flu vaccination does not make recipients more vulnerable to other infections.”", "Professor Catherine Bennett, the chair of epidemiology at Australia’s Deakin University, too told AFP in an email dated May 7: “The flu shot elicits a very specific response to the strains of virus covered by the vaccine. The vaccine does not weaken the immune system, or alter the recipients risk of contracting other infections.”", "-- Flu vaccine and COVID-19 --", "The flu vaccine only protects people against infections caused by influenza viruses. It has no direct link with COVID-19, which is caused by the SARS-CoV-2 virus.", "The World Health Organization (WHO) says that two groups of people, namely people over 60-years-old and those with underlying medical conditions, are at a higher risk of getting COVID-19. It does not class people who have received a flu vaccine as vulnerable to the disease.", "As of May 2020, there is currently no vaccine for COVID-19, it says.", "The Australian Department of Health also says there is currently no vaccine for COVID-19, but advises people to have the influenza vaccine because \"the combination of both diseases could be life threatening\".", "“Vaccines are specific to the particular illness for which they have been developed. A vaccine against one virus won’t confer immunity against another virus or pathogen. This is why there is no universal vaccine that protects against all infections,” according to the Australian Department of Health spokesperson. “There is no vaccination for COVID-19, but there is one for influenza (flu). It is recommended for Australians to get a flu vaccine as both influenza and COVID-19 cause serious respiratory illness. The combination of both diseases could be life threatening, especially for vulnerable people.”", "AFP Fact Check has debunked another false claim linking flu vaccination with COVID-19 here.", "-- Deleted article --", "The image in the misleading posts appears to be a screenshot of this now-deleted article on worldhealth.net, a US-based non-commercial health site.", "An archived version of the article can be viewed here.", "Worldhealth.net did not respond to requests for comment from AFP at the time of publication.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]