["“You Can Be Fined $1,500 If Your Passager Is Using A Mobile Phone, Starting Next Week,” claimed an article, shared a combined 244,000 times, that was published on the website Canada Eh? on July 5, 6 and 19 and on a second website on July 9.", "Canada Eh? is part of a network of websites which appear to be local Canadian pages but are not, and have been debunked by AFP Fact Check for false claims about food recalls and immigation.", "Traffic rules in Canada are governed by provincial authorities and enforced by either provincial and municipal police or the Royal Canadian Mounted Police (RCMP).", "In certain provinces, it is legally possible for a person to be charged with distracted driving if a passenger is holding a device in a way that impairs the driver’s concentration, but no province could give AFP an example of this happening.", "Similarly, no province has a $1,500 fine for distracted driving, according to this Canadian Automobile Association website.", "Alberta", "The penalty for distracted driving in Alberta is $300 and three demerit points.", "“Hypothetically, the driver or passenger could be fined if the passenger used a cell phone in a way that impaired the driver’s ability to drive safely,” Mark Jacka, Chief of Staff to Alberta’s Minister of Transportation told AFP by email.", "Jacka said, “Alberta’s distracted driving laws have not recently changed, this is not a ‘new’ rule.”", "British Columbia", "“B.C.’s Motor Vehicle Act and its regulations do not address passenger distraction; the focus is on drivers and the use of electronic devices while driving or operating a motor vehicle,” a spokesperson from the Government of British Columbia told AFP by email.", "“The province took action two years ago to strengthen the rules,” the spokesperson added, saying “distracted drivers face a ticket, 4 penalty points and a Driver Penalty Point Premium.”", "British Columbia’s supreme court also ruled in 2019 that “the mere presence of a cell phone within sight of a driver is not enough to secure a conviction,” meaning a passenger using a mobile device that does not distract the driver would not be sufficient grounds for a charge.", "The fine for a driver’s first distracted driving offense in British Columbia is $368 plus $252 for ICBC’s driver penalty point premiums and four demerit points.", "Manitoba", "“Under Manitoba’s Highway Traffic Act and Drivers and Vehicles Act, drivers who are caught using a hand-operated electronic device while driving receive a three-day license suspension and a seven-day suspension for a subsequent offense within 10 years,” a spokeswoman for the Government of Manitoba told AFP by email.", "“Drivers also receive a $672 fine and five demerit points. Penalties can increase depending on the severity of the case,” the spokesperson said, adding that: “There is nothing in the Highway Traffic Act or the regulation for hand held operated devices to indicate that this applies to passengers.”", "New Brunswick", "“In New Brunswick a driver is not charged for a passenger using a mobile device. Our provisions apply only to a driver using a device. Currently the minimum fine is $172.50 and 3 points are assessed,” a spokesperson for the Government of New Brunswick told AFP.", "Newfoundland and Labrador", "James Cadigan of the Royal Newfoundland Constabulary sent AFP this excerpt from the Newfoundland and Labrador Highway Traffic Act by email:\n\n\t“A person shall not drive a motor vehicle on a highway while holding, or using a hand-held wireless communication device or other prescribed device that is capable of receiving or transmitting telephone communications, electronic data, email or text messages.”", "“As you can see, this is not directed at the passenger of a vehicle,” added Cadigan.", "A first offence of distracted driving would attract a $300 fine and 4 demerit points in Newfoundland and Labrador.", "Northwest Territories", "“This is incorrect for the NWT,” said a spokeswoman for the Government of the Northwest Territories by email in response to the claims made in the article.", "The fine for a driver’s first distracted driving offense in the Northwest Territories is $322 and three demerit points.", "Nova Scotia", "“There is nothing in the Motor Vehicle Act that prohibits a passenger from using a mobile phone,” a spokesperson for the Government of Nova Scotia told AFP by email.", "The fine for a driver’s first distracted driving offense in Nova Scotia is $233.95", "Nunavut", "Nunavut’s Traffic Safety Act, which was reviewed and amended in 2018, states that “no person shall drive a vehicle on a highway while holding or using a hand-held electronic device”", "“Distracted driving laws in Nunavut prohibit the driver from using handheld devices. They do not mention the passenger's use of mobile devices,” a spokesperson for the Government of Nunavut told AFP by email.", "There is no formal penalty for distracted driving in Nunavut. Drivers could either be charged with violations of the Traffic Safety Act or a $115 fine for careless driving.", "Ontario", "In the case of a passenger holding a device that distracts a driver, “that is something that the courts may say is potential, so a driver could still be charged,” said Kerry Schmidt of Ontario Provincial Police in this Twitter video.", "Schmidt told AFP by email that he had no record of a driver being charged in this way in Ontario.", "The fine for a driver’s first distracted driving offense in Ontario is $615 and three demerit points.", "Prince Edward Island", "“Claims that drivers can be fined $1500 and given 3 demerit points if their passenger is using a mobile phone - incorrect and untrue for the province of Prince Edward Island,” a spokeswoman for Prince Edward Island told AFP by email.", "The fine for a driver’s first distracted driving offense in Prince Edward Island is $575 and five demerit points.", "Québec", "Québec’s Highway Safety Code makes no mention of passengers leading to distracted driving penalties and no mention of a driver facing charges for a passenger using a mobile device.", "When asked by AFP by email, a spokesman for Quebec’s Justice Department did not give any examples of drivers being fined in the way suggested by the post.", "A first offence of distracted driving in Quebec would see a fine of $300 being issued with five demerit points.", "Saskatchewan", "“If a driver is observed watching videos on a phone, even if the phone is mounted or, conceivably, held by another passenger, it is conceivable that they’d get a distracted driving ticket,” a spokesman for the Government of Saskatchewan told AFP by email", "”In practice, most tickets related to cell phone use while driving have been issued to a driver with a phone in their own hand and these penalties are not new (or taking effect next week),” he said, concluding, “I still regard the story as false.”", "Saskatchewan’s distracted driving penalties were strengthened on February 1, 2020 and the fine for a driver’s first offense is $580 and four demerit points.", "Yukon", "Distracted driving laws in Yukon apply to “drivers only,” a spokesman for the Government of Yukon told AFP. A driver could be charged for being distracted by a passenger’s device only if “the driver has the device in their possession” they added.", "The fine for a driver’s first distracted driving offense in Yukon is $500 and three demerit points.", "AFP Fact Check previously debunked claims about distracted driving penalties in BC and Alberta here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]