["About this rating", "A poster advertising an inclusiveness training for LGBT students used the acronym \"LGGBDTTTIQQAAPP.\"", "The acronym was used facetiously as a way to attract participants to the training.", "A months-old photograph purportedly showing a flyer for a \"LGGBDTTTIQQAAPP\" inclusiveness training session hosted by the Elementary Teachers' Federation of Ontario (ETFO) was recirculated on social media in November 2017 after it was featured in an article in the Daily Mail:", "This image was originally posted by the web site Louder with Crowder in August 2017 and was widely circulated on social media accompanied by derisive comments mocking the seemingly ever-expanding acronym used to refer to gender and sexual minorities. Some who saw the flyer were apparently so perplexed by the 15 letters at the top (which according to the flyer stands for Lesbian, Gay, Genderqueer, Bisexual, Demisexual, Transgender, Transsexual, Twospirit, Intersex, Queer, Questioning, Asexual, Allies, Pansexual and Polyamorous) that they questioned whether or not the image was real.", "This is indeed a flyer used to publicize an ETFO-run inclusiveness training session. However, the acronym LGGBDTTTIQQAAPP was used somewhat facetiously in order to publicize the training. A representative for the Durham chapter of the ETFO told us:", "Yes, the poster is genuine. The intent of the title was to draw workshop participants (teachers) by acknowledging that keeping track of diverse LGBTQ identities can be overwhelming, especially as our students are continuously identifying new ones. In our union, we use LGBTQ as an umbrella term for all marginalized sexual and gender identities.", "Others questioned the claim on the flyer that \"some surveys suggest that as much as half of the public secretly identifies as LGBT to some extent.\" The poster does indeed link to a survey in which Britons were asked first to describe their sexuality and then to rate themselves on a scale between a 0 and 6 -- with 0 being \"completely heterosexual\" and 6 being \"completely homosexual.\" The survey did not measure gender identity at all.", "Only 46 percent of 18- to 24-year-olds rated themselves as a 0 (\"completely heterosexual\"). However, when asked how to best describe their sexuality, 83 percent of that same group chose \"heterosexual.\" This doesn't necessarily show that the group \"secretly\" identifies as LGBTQ. It may only show that the words given to describe sexual identity do not always match up exactly with individuals' sexual feelings and experiences.", "Interestingly, that very disconnect points toward part of the reason that the LGBTQ acronym seems to constantly grow. Not only are cultural attitudes about gender and sexuality quickly changing, but language itself continues to expand to describe something that is often difficult to put into words -- namely, human sexuality and gender identity.", "Update [Aug. 26, 2022]: Updated headline, SEO.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]