["About this rating", "On 25 July 2018, an image purportedly showing a large lenticular cloud over the Giza Pyramids was posted on the \"Pics\" section of Reddit:", "This is not a genuine photograph of the Giza Pyramids below a striking cloud formation, but rather a composite of at least two different images that has nonetheless also been posted in the travel section of news sites such as The Telegraph, in odd news articles from websites such as The Metro, and was made available via stock photography web sites such as Getty Images and Alamy (where it was offered without a clear indication that it showed a creative work and not a genuine photographic subject).", "Both Getty and Alamy stated that the image was originally posted by The RooM Agency. That posting, too, failed to indicate the image's real origins.", "The lenticular cloud shown in this graphic did not form over the Giza Pyramids but instead near Mauna Kea, Hawaii, in 2005. The original photograph was taken by Peter Michaud of the Gemini Observatory and is available via NASA's \"Astronomy Picture of the Day\" web site, where it is posted with the following information:", "Can a cloud do that? Actually, pictured above are several clouds all stacked up into one striking lenticular cloud. Normally, air moves much more horizontally than it does vertically. Sometimes, however, such as when wind comes off of a mountain or a hill, relatively strong vertical oscillations take place as the air stabilizes. The dry air at the top of an oscillation may be quite stratified in moisture content, and hence forms clouds at each layer where the air saturates with moisture. The result can be a lenticular cloud with a strongly layered appearance. The above picture was taken near Mauna Kea, Hawaii, USA.", "This cloud formation was superimposed over a separate photograph of the Giza Pyramids available via Shutterstock, which featured a pretty, albeit mundane, sky. Although we're certain several other images show the pyramids from the same approximate angle and distance, the small camel rider in the bottom right corner of these pictures indicates that this is indeed the source photograph:", "Here's one more look at how two separate images, one featuring a large lenticular cloud that formed over Hawaii in 2005 and the other showing the Giza Pyramids under a blue sky, were combined to create the viral photograph:", "Waugh, Rob.   \"'Alien Throne' Made of Metal Could be Hidden Inside the Great Pyramid.\"\r\n    The Metro.   15 January 2018.", "Telegraph.   \"African Adventures You Must Have in Your Lifetime – Including the Paradise Islands Tourism Forgot.\"\r\n    28 Jun 2018", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]