["About this rating", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "In June 2020, as protesters called for the defunding of police departments in the aftermath of the death of another Black man while in police custody, a quote attributed to director James Cameron started to circulate on social media:", "The quote reads: \"Cops think all non-cops as less than they are, stupid, weak and evil. They dehumanize the people they are sworn to protect and desensitize themselves in order to do that job.\"", "This is a genuine quote from Cameron.", "This quote comes from the 2010 book \"The Futurist: The Life and Films of James Cameron\" by Rebecca Keegan. The full passage involves Cameron and collaborator Stan Winston discussing a story problem with the \"Terminator 2\" script. At the time, the T-100 was little more than a \"blob of goo\" and Winston urged Cameron to give the character a more recognizable form.", "Here's the excerpt from \"The Futurist\" (emphasis ours):", "During the writing process, he was in his living room excitedly explaining the T-1000 to his friend and collaborator Stan Winston when Winston raised a concern. \"I don't know who the bad guy is,\" Winston said. \"I need a specific character, a specific image.\" To Winston, what Cameron was describing sounded like a blob of goo, not an iconic evildoer. \"From a story standpoint, I thought it was a problem,\" Winston later recalled in an interview for the picture-book history of his story, \"The Winston Effect.\" Cameron respected Winston's instincts for creating memorable characters, and he started reconsidering how he would shape this one. Later that same night, the effects artist got a phone call from his friend. \"I've got it!\" Cameron said. \"He's a cop!\" The form the T-1000 would take for most of the movie was a Los Angeles police officer. This solved the storytelling dilemma Winston had raised and also gave Cameron an opportunity to underline a central theme in both of the Terminator movies - how people, especially those in violent jobs, like soldiers and cops, can become barbarized. \"The Terminator films are not really about the human race getting killed of by future machines. They're about us losing touch with our own humanity and becoming machines, which allows us to kill and brutalize each other,\" he says. \"Cops think all non-cops as less than they are, stupid, weak, and evil. They dehumanize the people they are sworn to protect and desensitize themselves in order to do that job.\"", "In a sad twist of fate, this theme of dehumanization was illustrated in the real world a few months before the film's release in 1991 when police officers were filmed beating an unarmed Black man named Rodney King on the streets of Los Angeles. The incident, which sparked riots and mass protests, was filmed by amateur cameraman George Holliday.  A few months before Holliday filmed the King beating, he captured some footage of the \"Terminator 2\" crew filming at the same location.", "Cameron told Los Angeles Times:", "That, to me, is the most amazing irony considering that the LAPD are strongly represented in \"Terminator 2\" as being a dehumanized force... What the film is about, on the symbolic level, is the dehumanization we do on a daily basis.\"", "Here's a newspaper clipping from Los Angeles Times:", "Tue, Jul 2, 1991 – Page 67 · The Los Angeles Times (Los Angeles, California) · Newspapers.com", "Honeycutt, Kirk.   \"Terminator's Generator: James Cameron Says He Uses Violence to Make a Point.\"\r\n    Los Angles Times.   2 July 1991.", "Keegan, Rebecca.   \"The Futurist: The Life and Films of James Cameron.\"\r\n    Three Rivers Press.   2010.", "Ximenez de Sandoval, Pablo.   \"Meet the Man Who Recorded the World’s First Viral Video.\"\r\n    El Pais.   25 May 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]