["About this rating", "26 June 2019 Update: The Associated Press has reported that Beth Chapman has died at age 51. Details here.", "In September 2017, reality TV star and wife to “Dog the Bounty Hunter,” Beth Chapman, revealed she had been diagnosed with Stage 2 throat cancer. At the time, Chapman had surgery and underwent a rocky recovery period, but by November 2017 the family announced that she was cancer free. A year later, however, her cancer returned, and the family confirmed that Chapman had undergone emergency surgery “to clear a throat blockage that was obstructing her airways.” She has been active discussing her battle with cancer on social media since then.", "On 7 April 2019, Duane “Dog” Chapman confirmed that his wife had again been hospitalized, this time due to a buildup of fluid in her lungs:", "Several dubious websites or social media pages have created clickbait that apparently generated rumors Chapman had passed away. For example, a 7 April 2017 YouTube video from the account “StarsNews” ran with the confusing title: “Sad News Dog the Bounty Hunter's Wife Beth Chapman May Passed Away Expected Soon …,” which has received over 1.5 million views and which, based on the comments on the page, several people took to mean that Beth Chapman had passed away. The image used as the thumbnail for that video has been shared on Twitter with the text “RIP Beth” and on other accounts.", "Factually speaking, however, Chapman was hospitalized and released. On 7 April 2019, a lawyer for the Chapman family told People that “Beth was hospitalized yesterday. She’s now resting at home.” Indeed, since that time she has posted updates regularly to social media. For example, on 14 April 2019, Chapman posted a picture of herself on Instagram with the statement, “Don’t forget the reason for the season”:", "On 20 April 2019, another misleading item appeared on the website “everydaydevotional.com” with the headline “Beth Chapman Death 2019: Did Beth Chapman Die from Dog the Bounty Hunter?” Opening the article, the reader is presented with the bolded text “positively yes.” That answer, however, misleadingly referenced a question from the body of the text — “is Beth Chapman alive?” — and not the headline question. Similar to the StarsNews YouTube video, several commenters on the page took this to mean that she had passed away. The same day as that dubious post, though, Chapman posted to her Twitter account.", "Because the rumors of her death appear to stem from dubious clickbait websites with misleading or confusing statements, and because Chapman is still active on social media, and because no member or representative of the Chapman family has suggested she lost her battle with cancer, we rank rumors of Beth Chapman’s death as false.", "Honolulu Star-Advertiser.   “Beth Chapman Diagnosed With Stage 2 Throat Cancer.\"\r\n    14 September 2017.", "Fernandez, Alexia.   “Dog the Bounty Hunter Reveals Wife Beth Chapman Is Cancer Free.”\r\n    People.   28 November 2017.", "Helling, Steve, and Natalie Stone.   “Dog the Bounty Hunter's Wife Beth Chapman Undergoes Emergency Surgery.”\r\n    People.   27 November 2018.", "DeSantis, Rachel.   “Dog the Bounty Hunter's Wife Beth Chapman Resting After Hospitalization Amid Cancer Battle.”\r\n    People.   7 April 2019.", "Updated story to reflect that Beth Chapman died on June 26, 2019.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]