["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The duel between leading U.S. Senate candidates in Ohio is feisty as ever, with polls showing Democratic former Gov. Ted Strickland and incumbent Republican Sen. Rob Portman neck-in-neck.", "Strickland’s latest tactic against Portman is to call him out for serving the billionaire class at the expense of Ohio’s regular Joes.", "A campaign fundraising email from Strickland’s campaign manager portrays Portman in the grips of dark outside spending, while Strickland takes in small donations from voters.", "\"While Rob Portman relies on his super PAC and a handful of billionaires to do his dirty work, we don’t have a super PAC,\" wrote campaign manager Rebecca Pearcey, \"and quite frankly, we don’t want one that spends millions to spew out lies and distortions.\"", "We recalled a similar claim by presidential candidate Bernie Sanders, whose own statement about not having a super PAC was fact-checked in the early months of the Democratic primary. We applied the same test to Strickland’s campaign rhetoric.", "Portman has an affiliated super PAC, meaning it’s dedicated solely to supporting him and opposing Strickland. Fighting for Ohio (though it’s registered in Alexandria, Va.) has spent more than $1.68 million against Strickland so far, according to the Center for Responsive Politics.", "Top contributors to Fighting for Ohio include Kenneth Griffin, founder and CEO of global investment firm Citadel ($250,000); Paul Singer, hedge fund manager of Elliott Management Corporation ($250,000); Edyth Lindner, widow of Carl Lindner, former owner of the Cincinnati Reds and Chiquita Brands ($100,000).", "Yes, Portman is funded by billionaires. But Strickland’s appeal for cash neglects to mention how he also benefits from outside spending.", "Senate Majority PAC is an unaffiliated funder that pledges its support to Democrats running for the Senate. The PAC mostly pays for TV and digital attack ads against Republican candidates. In this election season, the PAC has lasered in on four major Senate battlegrounds: New Hampshire, Pennsylvania, Nevada and Ohio.", "Donors to the Senate Majority PAC include George Marcus, real estate broker at Marcus & Millichap ($1 million); Fred Eychaner, Newsweb Corporation founder ($1 million); and actor/director Seth MacFarlane ($500,000).", "Anyone can register an unaffiliated super PAC with the Federal Election Commission. This means even if the Senate Majority PAC’s love for Strickland was unrequited, there’s not much Strickland can do about it. It’s illegal for a candidate to coordinate with a super PAC, according to the Federal Election Commission rules. But such rules are rarely enforced — since 1999, commissioners have only launched three investigations on candidate-super PAC contact.", "Unlike Sanders, who filed a cease-and-desist order against a PAC backing him, Strickland hasn't disavowed the $1.75 million that the Senate Majority PAC has spent so far on the race targeting Portman. Strickland for Senate spokesman David Bergstein retweeted the Senate Majority PAC earlier this year.", "Donations from non-profits and ad buys aren’t reported to the Federal Election Commission, further complicating the question of whose pockets are deeper.", "\"The picture can change in an instant, and we may not know who’s truly ponying up the money on an ad to support a candidate,\" said Sheila Krumholz, the executive director at the Center for Responsive Politics. \"There’s a lot of disingenuousness when candidates are saying, ‘You have more money,’ ‘No, you have more money.’ \"", "Our ruling", "A Strickland for Senate fundraising email said, \"While Rob Portman relies on his super PAC and a handful of billionaires to do his dirty work, we don’t have a super PAC.\"", "Strickland doesn’t have a super PAC solely focused on his campaign like the pro-Portman Fighting for Ohio. But big spenders still have Strickland’s back. It isn’t credible to say he’s impervious to the influence of dark money while still enjoying its benefits.", "The claim is partially accurate but takes things out of context. We rate this claim Half True.", "https://www.sharethefacts.co/share/9d083367-2a63-48c5-9f3e-dd98d6775c7b", "Phone and email interviews, David Bergstein, spokesman for Strickland for Senate, May 26, 2016", "Phone interview, Sheila Krumholz, Executive Director, Center for Responsive Politics, May 26, 2016", "Phone and web interviews, Michawn Rich, Communications Director, Portman for US Senate, May 24, 2016", "Web story, \"D.C.-based group spends big on Strickland,\" The Washington Free Beacon, Mar. 30, 2016", "Fact-check, \"Is Bernie Sanders the only presidential candidate without a super PAC?\" PolitiFact.com, Sept. 30, 2015", "Article, \"Ohio Senate race could break campaign spending records,\" Akron Beacon-Journal, Apr. 2, 2016", "Blog, \"The big spender always wins?\" Center for Responsive Politics, Jan. 11, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]