["“Greeting staff at @TeamTrump HQ this morning, a reminder that the media doesn’t select the President,” Tim Murtaugh tweeted on November 8, 2020.", "Two photos were attached to the tweet. One showed an image of a front page of The Washington Times that read: “PRESIDENT GORE,” followed by: “Florida pushes Gore over the top with bare majority.” The second showed dozens of copies of the image on the walls of the Trump campaign headquarters.", "The tweet was later deleted, but screenshots of the photo of the front page remained and were shared on other social media platforms, including on Facebook.", "However, the image is a doctored version of a real front page by The Washington Times, a newspaper based in the US capital.", "“These photos have been doctored,” the conservative-leaning newspaper replied to Murtaugh on Twitter. “The Washington Times never ran a ‘President Gore’ headline.”", "The doctored photo was based on a November 8, 2000 copy of The Washington Times. The original copy that was falsified read: “PRESIDENT BUSH,” followed by: “Florida pushes Texan over the top with bare majority,” according to a photo by a Twitter user who said they had a physical copy.", "However, other printed versions of the November 8, 2000 Washington Times edition featured the headlines “No President Yet,” and “Down to the Wire.”", "The falsified headline tweeted by Murtaugh was based on the “PRESIDENT BUSH” version, as it is the only one that reports 207 seats for House Republicans, and 189 for House Democrats.", "While the headline was doctored in the image tweeted by Murtaugh, other text on the front page was not, CNN reporter Andrew Kaczynski pointed out on Twitter. One article read:", "“George W. Bush, the son of the president who was vanquished by the Clinton-Gore team eight years ago, avenged his father early this morning by defeating Al Gore, creating only the second father-son presidential dynasty in history.”", "On the night of November 7, 2000, news organizations including ABC, CBS, NBC, CNN, Fox and the Associated Press predicted Democrat Al Gore had won the race. But Bush’s victory was eventually called by most media on November 8.", "An agonizingly long recount in the key battleground state of Florida was eventually halted by the US Supreme Court weeks later, definitively giving the presidency to Republican Bush.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]