["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Georgia state Rep. Allen Peake, R-Macon, and supporters of his legislation to provide a form of medical marijuana to seizure patients, huddle after the bill passes one chamber of the state Legislature. Photo Credit: Ben Gray/AJC.", "An important debate is ongoing in the Georgia Legislature concerning the use of a form of medical marijuana to treat certain forms of seizures.", "The state’s House of Representatives overwhelmingly passed House Bill 885, which would allow for the use of medical research cannabis in specific cases. The bill’s supporters are anxiously hoping the Georgia Senate will adopt the legislation. The Atlanta Journal-Constitution’s new Legislative Navigator gives it a 27 percent chance of passing this session.", "The bill’s primary sponsor, Rep. Allen Peake, R-Macon, offered what appeared to be a persuasive argument to support the legislation.", "\"(In Colorado), 100 percent of children have seen diminished seizure activity,\" Peake told fellow House members in the discussion before the bill was passed.", "PolitiFact Georgia wondered whether Peake’s statement was correct.", "Peake and other leading House Republicans did not plan to advocate this session on legislation that involves medical marijuana, particularly in an election year. Peake said he was persuaded to get involved after meeting a 4-year-old girl from his area named Haleigh Cox who suffers from a severe seizure disorder.", "Peake said he received the information he used to base his claim from the Realm of Caring, a Colorado-based organization that has attempted to provide care to patients suffering from cancer, AIDS, Parkinson’s disease and other conditions through the use of medicinal cannabis oil. Some Georgians have moved to Colorado to seek treatment for their children. Peake clarified his statement, saying that it was actually 98 percent of patients who had diminished seizure activity.", "Marijuana contains about 60 chemical components called cannabinoids. The cannabinoid that the bill’s proponents are considering is cannabidiol. It would be ingested and not smoked, the bill’s supporters say. It would not include THC, which is the element in cannabis that causes smokers to get high.", "The form of cannabidiol used at the Realm of Caring is named Charlotte’s Web, after a 5-year-old girl whose recovery from a rare condition is credited to the substance. Charlotte’s Web is a rich amber and as thick as cold honey. It smells like marijuana and tastes like raw plants. A month’s supply of the oil can cost $150 to $250, and some families say they receive financial help from nonprofit groups.", "Heather Jackson, the executive director of the Realm of Caring Foundation, said Peake was correct that every patient studied in the first set of tests, \"harvests\" is the term she used, had a reduction in seizures. The Realm of Caring is in its second harvest and has seen less than a handful of nonresponders, which accounts for Peake’s revised 98 percent total.", "The New York Times, though, reported in December that there is \"scattered medical research\" to substantiate claims cannabis oils helped reduce seizures, citing a 2012 study on the American Epilepsy Society’s website. Other researchers have also cautioned there is not enough research on its medicinal benefits.", "The American Epilepsy Society wants \"well-controlled studies\" it believes will lead to a better understanding of the effectiveness of cannabidiol and other forms of medical marijuana on epilepsy patients.", "Amy Brooks-Kayal, a Colorado-based neurology physician who is first vice president of the American Epilepsy Society, said there’s not enough information to determine what the dosage should be or how it interacts with other medicines. The AES, which claims about 3,500 members, said although cannabidiol offers hope, these are only anecdotal reports. Robust scientific evidence for the use of marijuana, it said, is lacking.", "\"There haven’t been good studies with cannabidiol with children with epilepsy,\" Brooks-Kayal said.", "The federal Food and Drug Administration has authorized trials of an established British drug, Epidolex, that comes from marijuana. Some experts who believe Epidolex is a better option say it’s unclear whether Charlotte’s Web is free of potentially harmful impurities.", "Jackson offered us two studies in defense of the treatment. In one study, all 11 children studied showed a reduction in weekly motor-type seizures, the study concluded. After three months, five of the 11 children were seizure-free, the study found. The paper, introduced at the American Epilepsy Society’s annual meeting in December, acknowledged the sample size was small.", "In the other study, two Stanford University researchers asked parents whose children were using cannabidiol to fill out a survey detailing its impact on their children. Sixteen of the 19 parents reported reduced seizure frequency. Three parents said their children were free of seizures. The most often reported side effects were better mood, increased alertness, better sleep and drowsiness. Common side effects with other forms of treatment were not found, the parents said. Jackson said 13 of those 19 parents had children who were using Charlotte’s Web.", "Jackson said they are doing more research.", "Jackson, whose son has used the treatment, said in the cases in which Charlotte’s Web did not result in fewer seizures for the patient, \"there is less than a 1 percent chance that a child in this intractable epilepsy population will find one that will work.\" Charlotte’s Web, she said, has performed better than other forms of treatment.", "\"There is not a treatment in the world that will work for all,\" Jackson told us. \"However, it is important to note that there is not a pharmaceutical in the world that works for even 5 percent of the epilepsy population. So the numbers are quite staggering actually.\"", "Peake said he was not deterred by questions or concerns about the research.", "\"The anecdotal evidence is so strong that a parent, in conjunction with their doctor, should have the personal choice to make that decision,\" Peake said.", "To sum up, Peake said \"every child in Colorado\" who has been given medical marijuana for treatment for seizures has had diminished seizure activity. Peake then said it’s actually 98 percent, citing newer data.", "There are very few studies out there. They do show medical marijuana has a positive impact on seizure activity. But not at the levels Peake said.", "His statement is partially accurate. But it needs a lot of context to be fully understood.", "We rate it Half True.", "Video of Georgia House of Representatives floor debate, March 3, 2014.", "American Epilepsy Society report, \"Slim evidence for Cannabinoids for Epilepsy,\" 2012.", "American Epilepsy Society position statement on medical marijuana, Feb. 28, 2014.", "Atlanta Journal-Constitution, \"Experts vouch for medical marijuana’s benefits,\" Feb. 10, 2014.", "Atlanta Journal-Constitution, \"Medical marijuana bill passes house,\" March 3, 2014.", "Atlanta Journal-Constitution Legislative Navigator review of House Bill 885.", "CBS News, \"Medical marijuana ‘benefits’ often not backed by science,\" Dec. 13, 2013.", "Georgia House Bill 885. www.legis.ga.gov/legislation/en-US/Display/20132014/HB/885", "Interviews with state Rep. Allen Peake, March 5, 2014.", "Interview with Heather Jackson, executive director, Realm of Caring Foundation, March 5, 2014.", "The New York Times, \"Families See Colorado as New Frontier on Medical Marijuana,\" Dec. 5, 2013.", "Study on Charlotte’s Web presented at the American Epilepsy Society’s annual meeting, December 2013.", "Telephone interview with American Epilepsy Society 1st Vice President Amy Brooks-Kayal, March 6, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]