["About this rating", "On 21 March 2017, the web site The Last Line of Defense published a story that appeared to report that U.S. Representative Trey Gowdy (R-S.C.) arranged for the body of Vince Foster to be exhumed as part of an investigation into former Secretary of State Hillary Clinton:", "For the first time in history, a US Congressman has asked that a body be exhumed in connection with an investigation by a House intelligence committee. Judge Harmon Watson agreed to issue the order for a work crew in Fairfax, Virginia to exhume the body of Vince Foster for autopsy.", "The order came just minutes after evidence turned up in the case of a murdered reporter who had an “if anything ever happens to me” letter delivered to his publication that implicated Hillary Clinton in a 23-year-old crime, which put it right around the time of Foster’s supposed “suicide.”", "Foster’s body has already been removed from the ground and is currently being transferred to the Naval Hospital in Norfolk to undergo an autopsy to look for a very specific cause of death. That information is being kept a closely guarded secret for now by Gowdy and the other federal prosecutors, since only the killer would know.", "Foster took his own life on 20 July 1993, and the circumstances surrounding his death in part formed the basis of long-circulating conspiracy theories that Clinton associates were often found dead under mysterious circumstances. Foster's death was ruled a suicide in multiple investigations.", "The claim about Gowdy's purported order was picked up by several dubious sites, but there is no truth to it; the story originated with The Last Line of Defense (The Resistance), an openly fake news outfit whose disclaimer states:", "The Resistance may include information from sources that may or may not be reliable and facts that don’t necessarily exist. All articles should be considered satirical and any and all quotes attributed to actual people complete and total baloney. Pictures that represent actual people should be considered altered and not in any way real.", "The image used to illustrate TheLastLineOfDefense.org's article was from 2014 (not March 2017), and was published as part of a news report about finding the identities of unnamed dead individuals.", "TheLastLineOfDefense followed up this fake news piece with another one positing that a post-exhumation autopsy of Foster's remains had prompted doctors to issue a ruling changing the manner of his death from suicide to homicide:", "Forensic specialists examined the body last night at the Naval Hospital in Norfolk, Virginia, concluding that the cause of death for Mr. Foster should be changed from suicide to homicide.", "LT Col. James McFitting, head of the hospital’s forensics lab, told reporters in his office that Foster had not one but two gunshot wounds, both of which would have been fatal. There would be no way he could have pulled the trigger himself a second time. The wounds were also in the back of his head, meaning unless he reached all the way around to make it look like a murder and fired two identical guns at the same time, the original story was impossible.", "The site then put out yet another article in the series holding that Foster's exhumed body had been stolen from the morgue:", "Vince Foster is back in the news today after it was discovered that his body, which was exhumed to be autopsied at the request of Congressman Trey Gowdy, had disappeared from the morgue. The autopsy, which concluded yesterday, had already determined that the cause of Foster’s death should be ruled a homicide.", "The problem is, without the body to be used for further forensic analysis, it will be nearly impossible to connect the dots back to Clinton. The bullets, which were scheduled for extraction today, won’t be able to be matched to registered firearms of Clinton “security” teams as Gowdy had hoped and the ballistics experts won’t be able to determine things like if the shooter was right or left handed or his or her height.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]