["By Angelo Fichera", "Posted on May 31, 2019", "Musician Ted Nugent posted a 1989 video of a now-deceased woman who called for “making America Muslim.” He wrongly described her as “the new congresswoman from Michigan.”", "Sharifa Alkhateeb died in 2004. But the Muslim scholar’s words are still present — including in a video from 30 years ago that was widely spread on social media in recent days, in which she calls for spreading the Islamic faith across America.", "But the video, posted by the verified account of musician Ted Nugent, has gone viral with an erroneous caption wrongly identifying the speaker as “the new congresswoman from Michigan.”", "“Listen very closely to the new congresswoman from Michigan what the enemies of America believe especially on Memorial Day so we don’t let them continue to destroy the wonderful American system of individual freedom that so many died for. Dear God in heaven!” his caption reads.", "Michigan does have a “new congresswoman” who is Muslim: Rep. Rashida Tlaib, who became one of the first two Muslim women elected to Congress last year. But, as we said, the video doesn’t show Tlaib or any other member of Congress.", "The video of Alkhateeb — a writer, scholar and founder of the North American Council for Muslim Women — is from the August 1989 Muslim Americans Political Awareness Conference. The full video of the conference is available on C-SPAN. Tlaib, who was born in 1976, was 13 at the time of Alkhateeb’s speech.", "In the video, Alkhateeb advocates for her peers to “look at all of the other people who are sharing this country with us as potential Muslims” and refers to a “long-range process of making America Muslim, all of America Muslim.”", "The video with the false caption has garnered nearly 100,000 shares and 2.8 million views. Some users wrote comments noting that it was from 1989, but many posted words betraying an apparent belief in the falsehood.", "“Whoever is voting for this trash needs to remember what the cowards did on 9/11,” one reads. Another: “Amazing that people like this are not just allowed, but apparently voted into positions of power.”", "“First mistake was letting Obama bring them here!” one man wrote, referring to President Barack Obama. (Alkhateeb was born in Philadelphia and was an American citizen.)", "Nugent, an ardent supporter of President Donald Trump, has shared misinformation before, including a recent meme about climate change that showcased a fabricated cover of Time magazine.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Gajanan, Mahita. “Ilhan Omar and Rashida Tlaib Just Became the First Muslim Women Elected to Congress.” Time. 7 Nov 2018.", "“Politics & Contemporary Social Issues.” C-SPAN. 5 Aug 1989.", "Schudel, Matt. “Sharifa Alkhateeb Dies.” The Washington Post. 27 Oct 2014.", "“Tlaib, Rahida.” Office of the Historian, U.S. House of Representatives. Accessed 31 May 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]