["About this rating", "On 4 May 2016, the web site Biz Standard News published an article reporting that televangelist and pastor Creflo Dollar, the founder of the non-denominational World Changers Church, had received a \"divine message\" instructing him to endorse Republican candidate Donald Trump for president:", "Creflo Dollar recently announced that he had received a divine message telling him to get behind Trump.", "“God came to me in a dream last night and said that Trump is his chosen candidate,” Dollar said. “God apologized for the mixed messages he was sending. I now know that Trump has been touched by the hand of God.”", "There was no truth to this report, as Biz Standard News (i.e., BS News) is an entertainment web site that does not publish factual stories.  The Biz Standard News article didn't receive much attention when it was first published in May 2016, but rumors about Creflo's endorsement of Trump went viral a few months later when WordOnDaStreet.com mistook this fake news story as real news and rehashed the article on their web site on 19 August 2016. Soon, media outlets such as Centric TV were falsely reporting that Creflo Dollar had endorsed Donald Trump.", "Biz Standard News's disclaimer notes that the site's content is satirical in nature:", "The Business Standard News is a satirical site designed to parody the 24-hour news cycle. The stories are outlandish, but reality is so strange nowadays they could be true.", "A spokesman for Dollar told the Atlanta Journal-Constitution that Creflo Dollar \"never endorses\" political candidates, and on 24 August 2016, Centric TV issued a correction which included a statement from the Pastor:", "\"Any reports stating that I have endorsed Donald Trump for President are false. I have not endorsed any candidate and do not plan to. This rumor originated on a satirical website and is 100% untrue.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]