["About this rating", "Amidst the plethora of misleading preventatives and cures for the COVID-19 coronavirus disease offered online during the pandemic of early 2020 was a video posted to Facebook that suggested consuming bananas could ward off infection by the novel coronavirus:", "However, the video did not stem from any reputable news agency, nor did it offer anything documenting that the consumption of bananas was an effective preventative against COVID-19. It misleadingly combined clips from a January 2020 ABC Australia news segment and a February 2020 Wall Street Journal news video about efforts by scientists at the University of Queensland and the National Institutes of Health to develop a coronavirus vaccine, interspersed with added inserts and overlays about bananas that touted the supposed health benefits of the fruit, as follows:", "Bananas are one of the most popular fruits worldwide. such as Vitamin C. All of these support health. people who follow a high fiber diet have a lower risk of cardiovascular disease. Bananas contain water and fiver, both of which promote regularity and encourage digestive health. Research made by scientists and the University of Queensland in Australia have proven that bananas improve your immune system due to the super source of Vitamins B-6 and helps prevent coronavirus. Having a banana a day keeps the coronavirus away.", "It is true that bananas, consumed in moderation, are fairly good sources of fiber, dietary potassium, vitamin B6, and vitamin C, all of which are important components of a healthy diet.", "However, other than contributing in a modest way to general good health, the consumption of bananas does not specifically do anything to \"prevent coronavirus,\" nor have scientists at the University of Queensland asserted any such claim.", "The most effective methods to protect yourself against contracting COVID-19 do not involve eating any specific food, but rather maintaining a safe distance from others who might spread the virus to you and regularly following basic sanitary/hygienic procedures:", "o Wash your hands regularly for 20 seconds, with soap and water or alcohol-based hand rub\no Avoid close contact (1 meter or 3 feet) with people who are unwell\no Stay home and self-isolate from others in the household if you feel unwell\no Don't touch your eyes, nose, or mouth if your hands are not clean", "WebMD.   \"The Health Benefits of Bananas.\"\r\n    3 February 2017.", "Ferguson, Vicky.   \"Ask the Dietitian: Bananas Do Contain Some Vitamin C.\"\r\n    The Grand Rapids Press.   13 October 2010.", "World Health Organization.   \"Basic Protective Measures Against the New Coronavirus.\"\r\n    Accessed 22 March 2020.", "National Institutes of Health.   \"Potassium.\"\r\n    Accessed 22 March 2020.", "Ipatenco, Sara.  \"How Much B6 Is in a Banana?\"\r\n    SFGate.   26 October 2012.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]