["About this rating", "On July 29, 2019, an obscure website called End of the Age Headlines published an article headlined \"Obama Will Claim Kenyan Citizenship to Keep from Being Tried for Treason.\"", "That article read (in its entirety) as follows:", "LLEGAL COMMANDER IN CHIEF: Barack Obama will soon admit to having been born in Kenya, in an attempt to avoid being prosecuted for treason. It’s already been proven that his birth certificate is a phony. Q has even said that he will claim Kenyan citizenship to keep from being charged for treason. Now, if he claims Kenyan citizenship, that means he was a false president, in which case every decision this man has made is now null and void, including the two Supreme Court justices!", "Everything stated in that brief article was incorrect:", "In fact, the End of the Age Headlines article was cribbed from a piece published by the Right Wing Watch website, which revealed that the \"Obama Will Claim Kenyan Citizenship to Keep from Being Tried for Treason\" rumor was based on nothing more than wild and unsupported speculation delivered in a YouTube video by a \"radical right-wing conspiracy theorist\":", "During his recent appearance on Tiffany FitzHenry’s YouTube program, radical right-wing conspiracy theorist and so-called “firefighter prophet” Mark Taylor claimed that Barack Obama will soon admit to having been born in Kenya in an attempt to avoid being prosecuted for treason.", "“I don’t think the guy is American,” Taylor said. “It’s already been proven that that birth certificate is a phony.”", "Taylor insisted that the issue of Obama’s birth certificate is vitally important because it is the key to effectively negating his entire presidency, citing the QAnon conspiracy theory which claims that high-ranking intelligence officials in the Trump administration are leaking information about a secret plan to take down a global network of satanic pedophiles that includes prominent Democratic Party entertainment, political and business figures.", "Larson, Carlton F.W.   \"Five Myths About Treason.\r\n    The Washington Post.   17 February 2017.", "Mantyla, Kyle.   \"Obama Will Claim Kenyan Citizenship to Keep From Being Tried for Treason.\"\r\n    Right Wing Watch.   16 April 2019.", "End of the Age Headlines.   \"Obama Will Claim Kenyan Citizenship to Keep from Being Tried for Treason.\"\r\n    29 July 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]