["By Angelo Fichera", "Posted on March 28, 2018", "Q: Did an ISIS leader have former President Obama on speed dial?", "A: No. That story was first shared on a website that calls its work satire.", "When we did a Google search for the name “Asam al Alasam,” the search engine’s first result was for a plastics fabrication firm in Dubai — an early indicator that, no, the name doesn’t belong to an ISIS leader, let alone the “ISIS Supreme Leader in Iraq.”", "Nevertheless, some online stories said the fictitious leader was found to have former President Barack Obama “on speed dial.” (For the record: The name of the head of ISIS is Abu Bakr al-Baghdadi.)", "Facebook users flagged the stories as potentially false, and they are. Still, some on the social media site commented with remarks such as, “If true, treason!” and “Place both of these traitors in Jail!”", "The story appeared on the website dailyworldupdate.com — which describes its work as satire — on March 11. The site’s “About” page indicates it’s connected to America’s Last Line of Defense, a source of many false stories called satire, but often shared by other websites and treated as fact. Specialnewsusa.com posted the story March 12 and included no disclaimer about it being satire.", "Among the other alleged contacts in the “unlocked iPhone X,” the stories said, were Canadian Prime Minister Justin Trudeau and Malcolm Reynolds, the name of a fictional character from the TV show “Firefly.”", "The story went on to add that Attorney General Jeff Sessions’ office “says the FBI will begin looking into it as soon as all of their resources aren’t focused on how Trump may have colluded with Russia.”", "There were no such announcements by the Department of Justice.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label false stories flagged by readers on the social media network.", "“Abu Bakr Al-Baghdadi News.” Al Jazeera. Accessed 27 Mar 2018.", "“BREAKING: Captured ISIS Leader Had Obama On Speed Dial.” specialnewsusa.com. 12 Mar 2018.", "“Firefly (TV series 2002-2003).” IMDb.com. Accessed 27 Mar 2018.", "U.S. Department of Justice. “Justice News.” Accessed 27 Mar 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]