["In 2012, President Barack Obama toured the TransCanada Stillwater Pipe Yard in Cushing, Okla. (AP file)", "President Barack Obama and many other Democrats think there’s little to be gained by building the Keystone XL pipeline.", "On Nov. 18, Senate Democrats voted down a proposal to build the oil pipeline -- which would stretch from Canada to Steele City, Neb., where it would connect with an existing pipeline that goes to Texas' coast.. But the issue isn’t going anywhere. When the new Republican-led Senate takes over in January, it will likely be at the top of their priorities list.", "Obama and other Keystone critics have argued that the pipeline would have a negative environmental impact, while having little benefit for the United States. For example, constructing the pipeline would result in few permanent American jobs.", "\"Understand what this project is,\" Obama said at a Nov. 14 press conference in Burma. \"It is providing the ability of Canada to pump their oil, send it through our land, down to the Gulf, where it will be sold everywhere else. That doesn't have an impact on U.S. gas prices.\"", "Two days later, in Brisbane, Australia, Obama described Keystone XL as \"a pipeline shipping Canadian oil to world markets, not to the United States.\"", "Predicting the effect of the pipeline on gas prices is a little tricky. Experts tend to agree that it could impact gas prices, but the effect would be indirect and minimal. But in this fact check, we’re going to focus on the export question -- whether or not, as Obama said, Keystone XL’s primary destination is beyond the United States.", "We found that Obama’s off the mark.", "Crude oil", "In recent years, the United States has become a net-exporter of refined oil products, like gasoline, jet fuel and asphalt (meaning it exports more products than it imports), according to the U.S. Energy Information Administration. However, it is a net-importer of the crude oil it uses to make those products.", "Keystone XL would transport crude oil from Canada’s tar sands through the Midwestern United States down to the Gulf Coast, and there are refineries all along the proposed route. (The map is from TransCanada, the pipeline operator.)", "America gets more crude oil from Canada than any other country. Nearly all of Canada’s exports go to the United States, and this accounts for about a third of America’s total crude oil imports. Much of its oil already makes it to the United States by rail and existing pipelines.", "We asked several energy economics experts, and they believe that quite a bit -- if not most -- of the Keystone XL crude oil will be bought and used by American refineries.", "\"It’s difficult to say with any certainty, but it is most likely that most would be refined in the U.S.,\" said Kenneth Medlock, an expert in energy economics at Rice University in Texas.", "A recent State Department report argues that it would not be \"economically justified\" for Canada to primarily export its Keystone XL oil to countries other than the United States, when there are plenty of American refineries to consume it.", "Some independent refineries -- particularly those in the upper Midwest, but also in Texas -- are in desperate need of crude oil, said Charles Ebinger, a senior fellow in energy security at the Brookings Institution. Currently, the refineries have to import crude from places like Venezuela and Mexico -- though it would be cheaper and better for overall energy security to buy from a North American source, rather than pay high transport costs.", "On Nov. 17, TransCanada told Reuters, it \"makes no business sense for our customers to transport oil down to the U.S. Gulf Coast, pay to export it overseas but then pay to transport millions of barrels of higher-priced oil back to the U.S. refineries to create the products we rely on.\"", "Ebinger added that many American refineries are geared to use heavy crude, which is what Keystone would transport from Canada’s tar sands.", "There would, though, likely be oil coming through the Keystone XL pipeline in excess of what the American refineries would be able to use, noted Eric Smith, an energy economist at Tulane University. This excess oil could go to other countries capable of refining it. Still, most Keystone oil would stay in North America.", "Refined products", "Some Keystone XL critics have focused on the fact that American refineries could export some of the products they make with the Canadian crude oil, such as gasoline, diesel fuel or asphalt. They argue that because products made in the United States, using Keystone XL oil, will leave the country, the pipeline wouldn’t improve domestic energy security or independence.", "Anti-Keystone XL environmental group Tar Sands Action (part of the larger 350.org) said in a Keystone XL fact sheet, that American refineries will process the oil but, \"much of the fuel refined from the pipeline’s heavy crude oil will never reach U.S. drivers’ tanks.\"", "However, American oil refineries’ product exports are \"not sensitive\" to the addition of a new pipeline, the State Department study says. Export trends are more dependent on demand -- both domestically and abroad -- as well as the cost of natural gas and foreign refining capacity. American oil refineries are already increasing their exports, and that trend could continue independent of Keystone XL.", "\"Refined product export levels have already increased and some of the crude used is from foreign sources,\" the report says. \"As this may already be occurring, it may continue with or without (Keystone XL).\"", "Further, the report says, \"The economic viability of exports does increase the demand for crudes in the United States,\" but, \"this demand does not depend on the proposed project.\"", "Even if exports are increasing, the majority of oil products refined in the United States stay in the United States. For example, in 2013, Gulf Coast area refineries produced about 946,000 barrels of finished motor gasoline per day. They exported about one-third of that -- 323,000 barrels per day.", "In January, Our friends at the Washington Post’s Fact Checker looked at an ad by liberal PAC NextGen Climate that said, \"(China is) counting on the U.S. to approve TransCanada’s pipeline to ship oil through America’s heartland and out to foreign countries like theirs.\" A spokesman for NextGen told Fact Checker that they were referring to refined product exports, rather than crude oil. Fact Checker gave the ad its lowest rating of Four Pinocchios.", "Even if Keystone XL isn’t built, experts said Canada will find other ways to transport their oil to the United States. Canada already sends crude from the oil sands into the United States by rail and other pipelines.", "\"I have no doubt that Canada will develop alternate means of monetizing its crude oil, whether that be via expanded rail shipments or by building pipelines to one or both of its coasts,\" Smith said.", "The longer that politicians debate Keystone XL, the more time Canada has to figure out these alternate means.", "\"Keystone XL is rapidly becoming irrelevant,\" said Michelle Foss, energy economist at the University of Texas’ Bureau of Economic Geology.", "Our ruling", "Obama said, Keystone XL allows \"Canada to pump their oil, send it through our land, down to the Gulf, where it will be sold everywhere else.\"", "The general consensus among experts, as well as the State Department, is that American refineries would be the primary buyers of crude oil transported through the Keystone XL pipeline, by a vast margin. Some Keystone XL critics have a point that American refineries would likely export some of the products that they make with crude oil transported by the pipeline. The State Department says, however, that product exports are already increasing, and that trend would likely continue independent of a new pipeline. Additionally, American refineries tend to keep more products in the country than they export.", "We rate Obama’s claim Mostly False.", "White House, Obama press conference transcript, Nov. 14, 2014", "State Department, Keystone XL Project impact statement, January 2014", "State Department, Keystone XL Project impact statement market analysis, January 2014", "Energy Information Administration, Canada analysis, Sept. 30, 2014", "Energy Information Administration, Import and Export data, Nov. 14, 2014", "Energy Information Administration, Gulf Coast refinery data, 2013 annual", "TransCanada, \"Keystone XL is good for Montana, good for the U.S.\" June 2014", "TransCanada, \"Energy Security is National Security,\" accessed Nov. 19, 2014", "Tar Sands Action, Keystone XL facts, accessed Nov. 19, 2014", "New York Times, \"A New American Oil Bonanza,\" Aug. 28, 2014", "Washington Post, \"As House approves Keystone pipeline bill, Obama veto grows more likely,\" Nov. 14, 2014", "Washington Post, \"The Keystone XL pipeline isn’t about lowering your gas prices,\" Nov. 17, 2014", "Washington Post, \"Obama’s claim that Keystone XL crude would go ‘everywhere else’ but the United States,\" Nov. 20, 2014", "Washington Post, \"Four Pinocchios for an over-the-top ad attacking the Keystone XL pipeline,\" Jan 31, 2014", "Reuters, \"In Keystone XL debate, Obama's warning on oil exports rings only half true\"", "FactCheck.Org, Pipeline Primer, March 10, 2014", "Slate, \"Liberals Were Wrong: Drilling for Oil Really Did Bring Down Gas Prices,\" Nov. 18, 2014", "Interview,  Charles Ebinger, energy economist at Brookings, Nov. 18, 2014", "Email interview, Michelle Foss, chief energy economist at the University of Texas’ Bureau of Economic Geology, Nov. 18, 2014", "Email interview, Eric Smith, energy economist at Tulane University, Nov. 18, 2014", "Email interview, Kenneth Medlock, energy economist at Rice University, Nov. 18, 2014", "Email interview, White House spokesman Frank Benenati, Nov. 18, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]