["About this rating", "In September 2017, social media users voiced their offense at rumors that \"liberals\" were organizing a boycott over Hobby Lobby's cotton decor products because the items were purportedly offensive to black people:", "VIRAL:Insane Liberals Claim Hobby Lobby Sells Racist Decor of fake cotton buds on branches\nHow can this be stopped?https://t.co/SVvQeJywpq", "— Deplorable Linda G. (@GartrellLinda) September 18, 2017", "Help is on the way for people that were offended by Hobby Lobby’s ‘offensive’ cotton decoration. Don't forget to send me your paper currency pic.twitter.com/u0ON7QPAkD", "— MAGAmike (@jmsb1955) September 18, 2017", "According to tweets and Facebook posts, \"liberals\" were \"organizing a boycott\" against Hobby Lobby, and the chain had come \"under fire\" over a cotton stalk home decor product sold by the company. Images included with those posts furthered the impression that large groups of people were protesting Hobby Lobby and the cotton decor products:", "Riots About To Erupt At Hobby Lobby After Racist Thugs Find Out What’s Now Being Sold In Their Stores", "Over the weekend, liberals lost their minds after seeing what the conservative craft store Hobby Lobby had on their shelves. No, it was not a depiction of violence or even a vile sexual scene it was a vase full of well, raw cotton.", "Yes, that is what has pushed the left over the edge after the “disturbing” image of raw cotton was posted on Facebook. Apparently, now selling cotton as a decoration is racist and must be removed from Hobby Lobby’s shelves immediately. If you think this is a joke it isn’t and sadly it shows exactly where we are as a country.", "Over the last several years, the left has been doing all they can to divide the country and it has worked. Now everyone is a racist if you don’t agree with them, white men are sexists, and all President Trump supporters are white supremacists. Seriously, Alice’s Wonderland makes more sense than these liberals running amuck in America, however, this is the world we live in. Which is why what happened in Hobby Lobby over the weekend really doesn’t surprise anyone.", "Wow, talk about ungrateful!", "However, all coverage of the purported controversy pointed back to a single Facebook post that was shared to Hobby Lobby's Facebook wall on 14 September 2017 by user Daniell Rider:", "On 20 September 2017, the Killeen Daily Herald interviewed Ridell about the social media controversy. She stated that her post was intended as a \"message as a consumer to a retailer\" and added that she began receiving \"rude\" messages, threats, and racial epithets from other social media users presumably offended by her post:", "Rider, 38, said she shops at Hobby Lobby because she loves crafting, but had never seen the raw cotton displayed as a decoration.", "“It shocked me,” she said. “I was just taken aback by it because I had never seen it before.”", "Rider said she at first posted the picture of the cotton on her personal Facebook page.", "“Then, the more I thought about it, I thought, well I’m a consumer and it’s a décor that I don’t agree with,” Rider said about her decision to also put the post on Hobby Lobby’s Facebook page, where it went viral.", "[Soon] it had about 295,000 comments, 106,000 reactions such as likes, and more than 22,000 shares.", "She started getting rude posts on her Facebook page and her messenger inbox exploded with comments.", "“I started to try to respond to a few of them, but then I realized that people weren’t wanting to have a conversation about it; they were just wanting to tell me how they feel, as mean as possible,” Rider said.", "Rider said she has received death threats of people saying they want to “cut her head off,” and many calling her the “N-word.” Rider said she has read and re-read her post to see where she offended a specific person or race and did not find anything.", "“I didn’t attack anyone ... Everyone is entitled to their opinion. Sometimes it is OK to agree to disagree, but division comes through hate,” Rider said, adding she was still kind to everyone who sent her hate mail.", "Rider sounded sincere about her Hobby Lobby cotton decor complaint, but she also identified herself as an individual speaking solely on her own behalf. We were unable to find any indication that any group (\"liberal\" or otherwise) took similar offense, that any person or group had organized a boycott against Hobby Lobby over the issue, or that anything other than Rider's single Facebook post suggested the chain was \"under fire\" over the cotton stalks. The vast bulk of social media commenters expressing offense were directing their ire at Rider's remarks, not at Hobby Lobby.", "Watson, Jennifer.   \"Killeen Woman Who Posted About Hobby Lobby Cotton Speaks Out.\"\r\n    Killeen Daily Herald.   20 September 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]