["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Could the average Wisconsin taxpayer buy only a pizza with savings from Gov. Scott Walker's \"tax plan\"?", "In a Mary Burke TV ad released Oct. 8, 2014, the narrator begins by asking:", "\"What’s $11 buy you in Wisconsin? How about a pizza?\"", "Sounds good. We're hungry.", "Then the ad quickly turns to one of Burke's key campaign themes -- that Gov. Scott Walker favors big business and the well-to-do over average folk.", "Under Walker's \"tax plan,\" the narrator continues, \"the average Wisconsin taxpayer got just $11 a month. But corporations got $610 million in tax cuts. Millionaires got at least $1,400 per year.\"", "The ad ends with \"Scott Walker -- Millions for them, pizza for you.\"", "Doesn't sound quite as tasty any more.", "Burke’s reference to a \"tax plan\" suggests Walker has had only one, when there have been several measures affecting income and property taxes.", "And, notably, she expresses each dollar amount differently -- a small per-month figure for the average taxpayer, versus a large lump sum for corporations and a large per-year figure for millionaires.", "So let’s slice up Burke's claim into its three pieces and see what we have.", "Average taxpayer: $11 per month", "When the narrator speaks about the average taxpayer and Walker’s tax plan, a footnote appears on the screen referencing the Legislative Fiscal Bureau, the state’s nonpartisan budget scorekeeper, and a date: July 28, 2014.", "But the footnote doesn’t give the viewer a clear idea of what Burke is citing -- or that it just provides a partial picture.", "A memo issued by the bureau on that day details two state income cuts signed into law by Walker in 2013. It says a taxpayer with an adjusted gross income of $40,000 to $50,000 will save an average of $133 in 2014.", "That comes to about $11 per month.", "Walker’s campaign, meanwhile, noted that the same memo pegs the average savings -- rather than the savings for the average taxpayer -- slightly higher, at $189 per year.", "That would be about $16 per month.", "The larger point, however, is that besides income tax cuts, Walker has approved a number of property tax relief measures. These are ignored by Burke, who made a broad claim but then supported it only by citing reductions in one type of tax.", "When Walker claimed that his various income and property tax cuts amount to $322 in the 2014 tax year for the average family, our rating was Mostly True. That comes to about $27 per month.", "We found that the income and property tax cuts would save the median-income family at least that much in 2014, although not every average family would save that much, particularly if they are not property owners.", "Corporations: $610 million", "Burke overstates the second part of her claim -- that corporations got $610 million in tax cuts.", "That figure is based on another fiscal bureau memo, which calculates tax savings over Walker’s full four-year term. The memo describes those tax reductions as being \"targeted to businesses,\" not necessarily corporations, which suggests large operations.", "In other words, some of the tax cuts apply to small businesses as well.", "For example, $126 million of the $610 million comes from reducing the state tax on the production earnings of manufacturers and agricultural businesses. Businesses organized like limited liability companies -- whose shareholders pay the firm's tax as personal income tax -- benefit from the reduction.", "Millionaires: $1,400 per year", "The third part of Burke’s claim goes back to the 2013 income tax cuts. The fiscal bureau estimated that people with an adjusted gross income of $300,000 or more would see a tax decrease averaging $1,402 in 2014.", "It’s worth noting that the $133 decrease for what Burke described as the average taxpayer was a reduction of 8 percent, while the the reduction for millionaires is 2.32 percent.", "And, again, she uses an annual figure for the millionaires, but a monthly one for the average folks.", "Our rating", "Burke said that under Walker's \"tax plan, the average Wisconsin taxpayer got just $11 a month. But corporations got $610 million in tax cuts. Millionaires got at least $1,400 per year.\"", "The $11 refers only to income tax cuts, when in fact the typical taxpayer has also enjoyed property tax reductions. The $610 million applies to small businesses as well as corporations. And it’s correct that millionaires got at least $1,400 per year in tax reductions. In short, the claim uses different figures that when mashed together are misleading.", "For a statement that is partially accurate, but takes things out of context, our rating is Half True.", "To comment on this item, go to the Milwaukee Journal Sentinel’s web page.", "YouTube, Mary Burke campaign \"Pizza\" TV ad, Oct. 8, 2014", "Email interview, Mary Burke campaign spokeswoman Stephanie Wilson, Oct. 9, 2014", "Email interview, Gov. Scott Walker campaign spokeswoman Alleigh Marre, Oct. 9, 2014", "Wisconsin Legislative Fiscal Bureau, income tax reduction memo to state Sen. Jennifer Shilling, July 28, 2014", "Wisconsin Legislative Fiscal Bureau, tax law changes since January 2011 memo to state Sen. Jennifer Shilling, July 16, 2014", "PolitiFact Wisconsin, \"Scott Walker says tax cuts amount to $322 for average family,\" Sept. 26, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]