["About this rating", "French designer Louis Vuitton (1821-1892), whose initials are enshrined in the name of the multi-billion-dollar fashion conglomerate LVMH, began his career as an apprentice malletier (trunk maker) in Paris in the 1830s.", "Over time, he parlayed his artisanship into a successful business catering to upper-class Parisians, opening his first independent shop in 1854. By the time of his death in 1892, the Louis Vuitton brand was synonymous with luxury, a reputation built upon by his son and subsequent generations of the Vuitton family.", "According to an assortment of memes making the social media rounds since early 2019, that brand was tainted by its alleged participation an 19th- and early 20th-century phenomenon known as \"human zoos.\" These were zoo-like exhibitions of so-called \"primitive\" peoples displayed in world's fairs and traveling shows in Europe and the United States during the era of global colonialism. Though they were more often known at the time by the quasi-scientific name \"ethnological exhibitions,\" these displays came to be seen as emblematic of the racism and inhumanity underlying the colonialist mindset.", "The memes allege that Louis Vuitton \"sponsored\" such exhibitions in major cities throughout the world:", "While you’re now complaining about gucci and last year it was Prada and Moncler, did you know that in the late 1800s and in the early 1900s Louis Vuitton sponsored human zoos were black People were looked at as exotic circus like creatures.\nHere is a picture of a Louis Vuitton pic.twitter.com/a28f6iUx1v", "— Thywill Brown (@Brownthywill) February 12, 2019", "The posts failed to make clear whether the allegation is meant to apply to Louis Vuitton, the man, or Louis Vuitton, the company, or both. They also failed to provide any real evidentiary support for the allegation.", "Some of the posts, such as the Facebook message above (since deleted), included a link to the blog \"Brand Memory,\" which contains an article mentioning that Louis Vuitton showcased products at several world's fairs and at the 1931 Paris Colonial Exposition, at which, the article says, \"human zoos\" were exhibited.", "But the article doesn't claim that the company (Louis Vuitton was long deceased by 1931) actually played any part in such zoos. The mentions appear in these paragraphs describing a 2010 Carnavalet Museum retrospective on the evolution of the Vuitton style (emphasis added):", "The next room deals with transport – with the miniature of a stagecoach and all the types of traveling trunks such as Tea Cases, the car trunk – and with World Fairs, which led to so many creations! Louis Vuitton attended them from 1867 and won many prizes there. During the great 1900 Fair, Georges Vuitton is in charge of the organization of the traveling objects and leather goods section. Therefore, he is outside the competition. Nevertheless, he displays – as we learn it – his own exhibition in a blue carousel reminding you of the Big Wheel. Posters, maps and trunks are there to testify the influence of the World Fairs. But you can also see a magnificent mockup of the 1878 Palais du Trocadéro.", "Then, we discover the design and Africanism of the beginning of the 20th century. If the Arts Décoratifs are more visible on the Louis Vuitton collection pieces (such as perfume flasks), the ethnical inspirations are directly perceptible on the trunks: crocodile leather, objects made of ivory… This style was to reach its peak for the colonial exhibition in 1931, whose map lets us perceive the festive aspect of it as well as the \"human zoos.\"", "Though the sentence above is poorly translated and vague, it's clear enough that the clause referring to \"human zoos\" applies to the 1931 Colonial Exposition as a whole, not the Louis Vuitton pavilion, which existed but had no evident connection to displays of live human beings. According to a museum press release, in keeping with the colonial theme, the Vuitton pavilion showcased Africa-themed products (mainly trunks) and artifacts such as masks and totems. (The photograph that appears in the social media posts shows that pavilion. It was not, contrary to what the Facebook meme claims, a \"Louis Vuitton store exhibition\" in St. Louis.)", "In point of fact, according to historical accounts, the only display in the Colonial Exposition of 1931 rightly described as a \"human zoo\" (namely, a group of indigenous New Caledonians — \"Kanaks\" — sensationally billed as \"polygamous savages and cannibals\") was relegated to an offsite location miles away from the main exposition grounds. People (mainly artisans) from other indigenous groups intermingled with visitors and represented their cultures in the exposition proper (in the Bois de Vincennes), but the Kanaks found themselves confined to the Jardin d'Acclimatation (in the Bois de Boulogne), which at that time also housed an actual zoo with crocodiles and other exotic animals.", "Infamously, the Jardin d'Acclimatation had housed a succession of mocked-up \"native villages\" since 1877, populated at various times by colonized indigenous peoples. The Kanak exhibition would be the last of its kind there before the venue was turned into an amusement park. In what some might perceive as an ironic development, the headquarters of the Fondation Louis Vuitton, a non-profit entity founded by LVMH to promote international arts and culture, was erected in 2014 in close proximity to where those \"human zoo\" exhibitions of previous centuries once stood.", "But we found nothing in any of the historical sources we examined to connect Louis Vuitton to any such displays — not at the 1931 Paris Colonial Exposition, not at world's fairs where the company was known to have displayed its wares, and not in traveling shows in the United States or other parts of the world. While it could be argued that the company engaged in cultural appropriation over the course of its long history, and perhaps even profited from the trappings of colonialism, the charge that Louis Vuitton sponsored or facilitated \"human zoos\" stands unproven.", "We reached out to the Louis Vuitton company and the Fondation Louis Vuitton for comment on this subject, but did not receive replies.", "Creed, Barbara and Hoorn, Jeannette. Body Trade: Captivity, Cannibalism and Colonialism in the Pacific.\r\n   Abingdon, UK: Routledge, 2013.   ISBN 9781136713088.", "Holborow, Olivia.   \"Louis Vuitton.\"\r\n   Vogue.   21 June 2012.", "Sánchez-Gómez, Luis A.   “Human Zoos or Ethnic Shows? Essence and contingency in Living Ethnological Exhibitiona.”\r\n   Culture & History Digital Journal.   December 2013.", "Schofield, Hugh.   “Human Zoos: When Real People Were Exhibits.”\r\n   BBC News.   27 December 2011.", "Brand Memory.   \"Voyage en Capitale: Louis Vuitton and Paris at the Carnavalet Museum.\"\r\n   7 February 2011.", "Fondation Louis Vuitton.   \"Our Missions.\"\r\n   Accessed 13 March 2019.", "FrenchMoments.eu.   \"When the Jardin d’Acclimatation Was a Human Zoo.\"\r\n   15 May 2019.", "Le Jardin d'Acclimatation.   \"More Than 150 Years of History.\"\r\n   Accessed 15 March 2019.", "LVMH.com.   \"Le Jardin d'Acclimatation.\"\r\n   Accessed 15 March 2019.", "Musée Carnavalet.   \"Voyage en Capitale: Louis Vuitton et Paris.\"\r\n   October 2010.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]