["This Facebook post includes a map of Australia which purports to show how much land is Chinese-owned. It has been shared more than 7,100 times.", "Below is a screenshot of the misleading post:", "The text around the map reads: “FOR SALE AUSTRALIA. ATTENTION WORLD! There are a few FARMS and PUBLIC UTILITIES still left so YOU BETTER BE QUICK!”", "The text above the map states: \"Look and weep...you cannot buy land in China only lease. Our zoos can't even own Pandas...all pandas are leased by zoos and must return to China every 4 to 5 years. Yet our traitorous governments of both persuasions sell off our COUNTRY to our biggest economic threat...China! Wake up Australia before it's too LATE!!\"", "The same image was also shared on Facebook here and here, and on Twitter here and here with a similar claim.", "The claim is false; the map significantly overstates the proportion of Australian farmland held by China.", "According to Australia's Register of Foreign Ownership of Agricultural Land, published here by the Australian government on June 30, 2018, just 13.4 percent of Australian land in 2017-18 had “a level of foreign interest”, and 80 percent of this was on a leasehold basis, ruling out complete ownership as the map suggested.", "Below is a screenshot of this section of the report, with the relevant figure highlighted in red by AFP:", "The report lists the United Kingdom as the largest foreign agricultural land holder in Australia, with 2.6 percent; followed by China with 2.3 percent; and the United States with 0.7 percent.", "Below is a screenshot of this section of the report, with the relevant section highlighted in red by AFP:", "Below is a screenshot of the section the report which lists countries in order of how much agricultural land they hold in Australia by hectares:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]