["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Food trucks wait on site at local polling locations as long lines form on Election Day, Tuesday, Nov. 3, 2020, in Atlanta. (AP)", "Georgia lawmakers have introduced dozens of measures that would overhaul rules for in-person and absentee voting.", "Georgia HB 531 would make it a misdemeanor to give voters in line food or water. The state House passed the bill.", "Existing Georgia law states that it is a crime to give gifts to voters.", "After Joe Biden narrowly won Georgia, and the Democrats won a pair of Senate races, Republican lawmakers there have proposed dozens of measures that would overhaul how Georgia voters cast ballots in future elections.", "One sweeping elections bill, Georgia House Bill 531, would limit the locations of absentee ballot drop boxes, require more identification for absentee voting and limit weekend early voting.", "Facebook posts said the state legislation \"makes it a misdemeanor to give food or water to voters waiting in line.\"", "The Facebook post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) In this case, the post is accurate. A state bill would expressly ban giving food or water to voters in line, which is more explicit than existing law that broadly bans gifts to voters.", "Georgia is one of many states where Republican lawmakers have introduced bills that restrict voting access, despite the fact that Republican election officials said the 2020 election was secure.", "Georgia HB 531 has a section that prohibits \"any money or gifts, including, but not limited to, food and drink, to an elector.\" Such giveaways will be banned within 150 feet of a building where people are voting, within any polling place or within 25 feet of any voter standing in line.", "The bill would make a violation a misdemeanor that carries a maximum fine of $1,000 and maximum imprisonment of up to one year in jail. The bill passed the House 97-72 on March 1 and awaits a vote in the Senate.", "For years, voting rights advocates have organized efforts to give away bottles of water or food near voting sites where residents sometimes wait in line for hours to vote. Voters in black-majority neighborhoods have had disproportionate waiting times.", "\"Ideally no one would wait (to vote) more than 30 minutes, but that’s not the reality,\" said Andrea Young, executive director of the ACLU of Georgia.", "Generally, some of the larger food events are organized by those with ties to the left, although they make the food available to anyone.", "Pizza to the Polls told PolitiFact that it delivered more than 7,000 boxes of pizza and more than 65,000 snacks during the general election and Senate runoff. The group was co-founded by a 2016 Obama field organizer but says it is nonpartisan: \"Ain’t nothing partisan about trying to make voting less of a drag,\" it says on its website. Chef José Andrés’ World Central Kitchen, as part of its Chefs for the Polls project, brought tacos, sandwiches and pizza to lines of voters in Georgia in 2020, the Atlanta Journal-Constitution reported. The group is also nonpartisan, but Andres supported Biden’s candidacy.", "Existing Georgia law bans giving gifts \"for the purpose of registering as a voter, voting, or voting for a particular candidate.\" That provision doesn’t mention food or water directly, but the Secretary of State Brad Raffensperger has interpreted it to include food or water.", "In February, the Georgia elections board referred for investigation to prosecutors a couple of cases in which candidates gave food or water to voters.", "Matthew Wilson bought four pizzas and passed out slices to those in line to vote in 2018, according to Reporter Newspapers. Wilson, a Democrat who won his race for state representative, said he distributed the pizza after getting permission from a poll manager. Kelly Rose, a Democrat who lost a state senate race, told PolitiFact that her team handed out water, oranges and chips at a 2020 polling site. \"A woman passed out one day we were there,\" Rose told PolitiFact. Rose said she didn’t campaign at the site and didn’t break the law. (A state law bans soliciting votes within 150 feet of a building where voting takes place.)", "We reached out to the chief author of HB 531, Republican Rep. Barry Fleming, to ask why the state needs a law to ban giveaways to voters in line when state law already bans gifts, but we didn’t hear back.", "Facebook posts state that the Georgia House passed a bill that \"makes it a misdemeanor to give food or water to voters waiting in line.\"", "HB 531, which passed the House March 1, bans giving food and drinks to electors within 150 feet of a building where people are voting, within any polling place or within 25 feet of any voter standing in line. A violation is considered a misdemeanor.", "We rate this claim True.", "RELATED: Fact-checking misleading attacks on the HR 1 voting rights bill", "Facebook posts about HB 531, March 2021", "Georgia Legislature, GA HB531, 2021", "Georgia code, 21-2-570, 2010", "Georgia code, 21-2-414, 2010", "Georgia Public Radio, What Is Happening With Voting Bills In Georgia? Feb. 25, 2021", "Atlanta Journal-Constitution reporter Mark Niesse, Tweet, March 2021", "Atlanta Journal-Constitution, Voting restrictions bill passes House, March 2, 2021", "Snopes, Would Georgia Bill Outlaw Giving Food, Water to Voters Waiting in Line? March 6, 2021", "Brennan Center, Georgia’s Proposed Voting Restrictions Will Harm Black Voters Most, March 6, 2021", "Fair Fight Action, Line warming activities, Oct. 18, 2020", "Atlanta Journal Constitution, World Central Kitchen feeds metro Atlanta voters, Oct. 13, 2020", "NPR, Why Do Nonwhite Georgia Voters Have To Wait In Line For Hours? Too Few Polling Places, Oct. 17, 2020", "ABA Journal, Election Law Blogger Responsible for Free Ben & Jerry’s, Nov. 5, 2008", "Secretary of State Brad Raffensperger, Press release about election fraud cases, Feb. 26, 2021", "Secretary of State Brad Raffensperger, Press release about line warming, Dec. 29, 2020", "Chefs for the Polls, Accessed March 8, 2021", "Reporter Newspapers, State Rep. Wilson accused of 2018 election violations for giving pizza to voters, March 3, 2021", "Roll Call, Long lines at the polling place? This group sends pizza, June 23, 2020", "Joe Biden, Campaign press release, Oct. 30, 2020", "PolitiFact, Here’s why Georgia’s Republican officials are confident in their presidential election results, Jan. 5, 2021", "Pizza to the Polls, Twitter message exchange with PolitiFact, March 8, 2021", "Telephone interview, Kelly Rose, Georgia state senate candidate, March 9, 2021", "Telephone interview, Ari Schaffer, Georgia Secretary of State spokesperson, March 8, 2021", "Telephone interview, Andrea Young, ACLU of Georgia executive director, March 8, 2021", "Email interview, Seth Bringman, Fair Fight Action spokesperson, March 8, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]