["Devon Archer (far left) is pictured with Joe and Hunter Biden. (Screenshot from Twitter)", "President Donald Trump is doubling down on a photo he says shows Joe Biden and his son posing with a Ukrainian gas executive as evidence Biden knows more than he has let on.", "\"The Biden family was PAID OFF, pure and simple! The fake news must stop making excuses for something that is totally inexcusable,\" he tweeted. \"Sleepy Joe said he never spoke to the Ukrainian company, and then the picture came out where he was playing golf with the company boss and Hunter.\"", "The photo, which was first aired by Fox News on Sept. 30, shows Joe and Hunter Biden playing golf in the Hamptons in 2014. According to Trump, one of the men is the \"company boss\" of Burisma, the energy company where Hunter served as a board member while his father was vice president. Trump tweeted a doctored Nickelback music video Oct. 2 that includes the image juxtaposed with an interview in which Joe Biden says he had never talked to his son about his business dealings abroad.", "That video was quickly removed from both Twitter and YouTube due to a potential copyright infringement for the Nickelback music. But now Trump is re-upping the claim amid an ongoing impeachment inquiry against him for his own dealings with Ukraine.", "We reached out to the White House for more information about the source of Trump’s claim, but they did not comment on the record.", "Trump’s tweet is misleading on two fronts.", "• The photo shows the Bidens with another American board member of Burisma.", "• Biden hasn’t said whether or not he’s spoken with Burisma officials.", "Trump claimed that the photo of the Bidens shows them posing \"with the company boss\" of Burisma. Our research shows otherwise.", "In a previous story, we found that the man on the far left of the frame is Devon Archer. In 2008, Hunter Biden joined with Archer — a former senior adviser for the presidential campaign of John Kerry in 2004 — in a string of investment and consulting firms.", "The Wall Street Journal reported in May 2014 that the two had joined Burisma as board members. That role is different from \"boss\" or \"executive,\" as Trump has claimed in separate tweets about the photo of Archer. Board members are not typically involved in day-to-day operations of a company.", "While Joe Biden was vice president, firms run by his son and Archer \"pursued business with international entities that had a stake in American foreign policy decisions, sometimes in countries where connections implied political influence and protection,\" the New York Times reported in May.", "The fourth man in the photo that Trump tweeted is Ralph Pascucci, founder of Netrex Capital Markets LLC, a New York investment banking firm. He is also a principal of Sebonack Golf Club in Southampton, N.Y., where the Bidens spent a week in August 2014.", "(Screenshots from Twitter and Netrex)", "We reached out to Joe Biden’s presidential campaign for more details, but they did not comment on the record.", "Taras Burdeinyi is the current CEO of Burisma and Mykola Zlochevsky is the founder and owner. In 2014, Alan Apter was the chairman of the board of directors and reportedly brought on Biden and Archer.", "In his tweet, Trump claimed that Joe Biden said he \"never spoke to the Ukrainian company\" where his son served as a paid board member. But that mischaracterizes what the Democratic presidential candidate actually said.", "In his Nickelback video, Trump showed a clip of Biden saying he had \"never spoken to my son about his overseas business dealings,\" contrasting that with the photograph of the golf group. That’s different than claiming he had never spoken to Burisma.", "RELATED STORY: Trump’s Ukraine call, a whistleblower and the Bidens: What we know, what we don’t", "Biden knew his son worked for the Ukrainian energy company. Beyond that, there’s little we know.", "Hunter Biden told the New Yorker magazine in July 2019 that he discussed Burisma with his father one time in December 2015. The Biden campaign says the discussion was not substantive.", "Trump claimed Joe Biden \"said he never spoke to the Ukrainian company\" where his son, Hunter, served as a board member. He also claimed a photo of the Bidens shows them posing with \"the company boss\" of Burisma.", "The photo that Trump is referencing doesn’t show a Ukrainian executive of the company. It shows Devon Archer, a former board member and Hunter Biden’s longtime business partner. Also, Biden never said he had never spoken to Burisma — he said he’d never spoken to his son about his overseas business dealings. We could find no evidence that Biden ever made the former claim.", "Trump’s statement is not accurate. We rate it False.", "Bing reverse image search, accessed Oct. 7, 2019", "Burisma Holdings management, accessed Oct. 7, 2019", "FamilyTreeNow.com, accessed Oct. 8, 2019", "Fox News, \"Joe, Hunter Biden seen golfing with Ukraine gas company exec back in 2014, photo shows,\" Sept. 30, 2019", "Google Maps, accessed Oct. 8, 2019", "Google reverse image search, accessed Oct. 7, 2019", "Netrex Capital Markets team, accessed Oct. 8, 2019", "New York magazine, \"Will Hunter Biden Jeopardize His Father’s Campaign?\" July 1, 2019", "The New York Times, \"Biden Faces Conflict of Interest Questions That Are Being Promoted by Trump and Allies,\" May 1, 2019", "The New York Times, \"From Humble Beginnings to a Magnificent View,\" Sept. 18, 2008", "PolitiFact, \"Donald Trump’s boasts about former Ukrainian prosecutor’s fairness ring false,\" Sept. 26, 2019", "PolitiFact, \"Timeline: The Trump impeachment inquiry,\" Oct. 3, 2019", "PolitiFact, \"Trump’s Ukraine call, a whistleblower and the Bidens: What we know, what we don’t,\" Sept. 23, 2019", "PolitiFact, \"Who is the ‘Ukraine gas exec’ playing golf with the Bidens in Trump’s Nickelback post?\" Oct. 3, 2019", "Press release from Burisma, May 12, 2014", "TinEye, accessed Oct. 7, 2019", "Tweet from Donald Trump, Oct. 2, 2019", "Tweet from Donald Trump, Oct. 6, 2019", "The Wall Street Journal, \"Biden's Son, Kerry Family Friend Join Ukrainian Gas Producer's Board,\" May 13, 2014", "Washington Examiner, \"Bidens in Hamptons to Begin Third Vacation in Month,\" Aug. 12, 2014", "Yandex reverse image search, accessed Oct. 7, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]