["About this rating", "On 3 September 2017, the web site America's Freedom Fighters published a story that purported to directly link undocumented immigrants in San Diego, California to a local Hepatitis A outbreak:", "The ultra liberal city of San Diego, California which incidentally is inundated with illegal aliens is facing a health crisis and authorities have declared PUBLIC HEALTH EMERGENCY.", "A public health emergency was declared Friday over an outbreak of ‘hepatitis A’ that has been linked to at least 15 deaths and 400 hospitalizations.", "It also closed on a more explicitly anti-immigrant note:", "These kind of problems are typical in liberal cities.", "Build the wall.", "God Bless.", "San Diego County officials did declare a local health emergency on 31 August 2017 in response to a hepatitis outbreak, but there is no indication whatsoever that it originated or was spread by the city's local undocumented population. A spokesperson for the county's Health and Human Services department, Craig Sturak, told us:", "The primary population being impacted is the homeless and/or drug-using individuals on the street. I am not aware of any connection to undocumented immigrants.", "Sturak confirmed to us that 15 people had died in connection to the outbreak as of 29 August 2017. However, he also said that 263 people — not 400 — had been hospitalized out of 378 cases. San Diego City Council member Chris Ward, whose district includes the downtown area (which has a high concentration of the local homeless population), told us in a statement:", "Like local health officials, I have seen no evidence of any connection and would strongly caution against spreading unsubstantiated rumors that serve to undermine our ability to respond to this health crisis effectively.", "Fellow council member David Alvarez, who has sparred with Mayor Kevin Faulconer regarding the city response to the issue, told us:", "There's no validity to this. It's just individuals who are looking to scapegoat using vulnerable populations, whether it's our homeless community or our immigrant communities. It's not surprising in the age of [President Donald] Trump, to be honest. But still shameful.", "The disease is a liver infection that, according to the Centers for Disease Control, is \"usually transmitted by the fecal-oral route, either through person-to-person contact or consumption of contaminated food or water.\"", "Following the emergency declaration by public health officer Wilma Wooten, the city began installing hand-washing stations in  at least thirty locations around the city, including more than a dozen downtown. Street-cleaning crews will also be directed to remove \"all feces, blood, bodily fluids or contaminated surfaces\" with a mix of high-pressure water and bleach.", "The outbreak was traced back to November 2016, but according to Wooten, vaccination efforts and distribution of hygiene kits did not quell the spread of the infection. Experts reportedly did not gauge the speed of the outbreak until March 2017.", "Alvarez has called for Faulconer to declare a homeless state of emergency, saying that it would allow the city to bypass some regulations in order to designate some buildings as temporary housing. An advisor for Faulconer, Jonathan Herrera, countered by saying that Faulconer had already done so in 2016 and 2017.", "On 30 August 2017, the California state assembly's Joint Committee On Legislative Audit approved a request by state Sen. Ben Hueso (D) to investigate whether the county has employed enough public nurses to deal with the outbreak.", "We have reached out to the San Diego Regional Task Force on the Homeless seeking comment. The group reported in April 2017 that there were 9,116 people locally as \"living in the streets or in shelters,\" up 5 percent compared to 2016. Alvarez told us that the task force did not ask for individuals' immigration status while compiling its data.", "Halverstadt, Lisa. \"County, City Say They’re Taking Steps to Move Quickly on Hepatitis A Outbreak.\"\r\nVoice of San Diego. 1 September 2017.", "Centers for Disease Control and Prevention. \"Viral Hepatitis.\"", "Sisson, Paul. \"County Declares Health Emergency for Hepatitis Outbreak.\"\r\nSan Diego Union-Tribune. 1 September 2017.", "Warth, Gary. \"Alvarez Asks Mayor to Declare Homeless State of Emergency; Mayor's Office Says He Already Has.\"\r\nSan Diego Union-Tribune. 31 August 2017.", "Updated with additional information and comments from City Council member David Alvarez. Rating changed to False.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]