["The composite image was published on Facebook here on January 19, 2021.", "“Bastard communists have taught us that Akbar was great. The reality was absolutely opposite,” the Hindi-language caption reads.", "The superimposed text above the black-and-white photo reads, “Real Akbar” and the text above the colour photo reads “Leftists’ Akbar”.", "The post circulated as scholars continue to raise concerns about the misrepresentation of the Islamic Mughal's empire by right-wing groups in India who seek to promote Hindu nationalism, as noted in analyses here and here.", "The image was also shared alongside similar claims on Facebook here, here, and here; and on Twitter here, here and here.", "The claim, however, is false.", "A reverse image search on Google found that the black-and-white photo in fact shows Mirza Shah Abbas, the son of the last Mughal emperor, King Bahadur Shah Zafar.", "The photo was published on Indian Culture, an online initiative by the Indian Ministry of Culture, and is dated circa 1850-1860, hundreds of years after Akbar reigned in the 16th century.", "Below is a screenshot comparison photo shared in the misleading posts (L) and the photo published on the Indian government website (R):", "The photo was also published by the University of London’s School of Oriental and African Studies. The image is dated 1858 and is captioned: “The King of Delhi’s Two Sons”.", "Moreover, cameras had not yet been invented during Akbar’s time as ruler of the Mughal empire from 1556-1605.", "The second photo of the modern-day portrayal of Akbar shared in the misleading social media posts shows Indian actor Rajat Tokas, who played the Mughal emperor in the television series Jodha Akbar. The show aired from 2013 to 2015.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]