["The photos were published in this Facebook post on August 6, 2019.", "It has been shared more than 10,000 times.", "Below is a screenshot of the misleading Facebook post:", "The post’s Hindi-language caption translates to English as: “Amit Shah ji, time does not stay the same always. His name is Akid Ibrahim and he has served as Sudan’s home minister in 1995. He too was very proud of his position perhaps.”", "Amit Shah refers to India’s home minister and chief of India's ruling Bharatiya Janata Party (BJP).", "The images were also published here, here, here and here on Facebook and on Twitter here, here, here and here alongside a similar claim.", "The claim is false; two of the photos show an emaciated man taken by a BBC journalist covering a hunger crisis in northern Kenya in March 2019; the other photo shows a former Sudanese military personnel.", "A reverse image search on Google combined with keyword searches found the photos of the emaciated man were published on Twitter here on May 19, 2019, by BBC correspondent Roncliffe Odit, alongside two other photos of the same man.", "Odit’s tweet is embedded below:", "#WeCannotIgnore#BeyondPressConfrences #TurkanaDrought #KenyaDrought pic.twitter.com/uymClJvVbd", "Below is a screenshot comparison of the photos in the misleading post (L) and the corresponding photos in Odit’s tweet (R):", "A keyword search on Google found a photo of the same man used in this BBC report published on March 19, 2019.", "Below is a screenshot of the BBC report:", "The man pictured in military uniform is Lieutenant General Omar Zain al-Abdin, the former head of Sudan’s military council’s political committee. An image of General al-Abdin speaking on Sudan TV was published in the AFP archive here on April 12, 2019.", "The photo’s caption states: “Lieutenant General Omar Zain al-Abdin, the head of the new Sudanese military council’s political committee, addresses a press conference on April 12, 2019 in the capital Khartoum, one day after Sudan’s army ousted the Arab-African country’s veteran president Omar al-Bashir. Sudan’s military council pledged talks with ‘all political entities’ and vowed the new government will be ‘civilian’, adding that it will allow no security breaches.”", "Below is a screenshot comparison of the photo of General al-Abdin in the misleading post (L) and the image of him speaking on Sudan TV (R):", "AFP Kenya previously debunked false social media posts which claimed one photo of the emaciated man showed someone who was found in an underground prison after being jailed by ousted Sudanese president Omar al-Bashir.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]