["About this rating", "David Garrow's dense and rigorous 2017 book profile of Barack Obama's pre-presidential years, titled Rising Star: The Making of Barack Obama, was in all respects an extremely deep dive into Obama's early life, as recounted in a Politico review:", "[Garrow] interviewed more than a thousand of Obama’s friends and colleagues, and Obama himself for eight hours, and unearthed documents from every stage of the president’s life: his undergraduate poetry and his law school exams, an unpublished policy manuscript he co-wrote, his evaluations as a professor at the University of Chicago, his annual tax payments to the IRS, an opposition-research dossier from his 2004 U.S. Senate primary campaign, letters he wrote to his most serious girlfriends and even the diaries they kept of their years with him, including frank (though not lurid) accounts of sex.", "Among the tidbits reported on heavily by various news outlets at the time was the “unpublished policy manuscript” Barack Obama wrote with his friend and Harvard Law classmate Rob Fischer sometime around April 1991. The manuscript, titled “Race and Rights Rhetoric,” was written for Harvard Law professor Martha Minnow’s Law and Society class, and the two young men hoped it would become a chapter of a book. That chapter would have broached the idea that talking about minority rights in terms of “universal rights” could be counterproductive and instead suggested the possibility that these discussions could be more productive if framed in the more commonly held American notions of “equality of opportunity,” as described by Garrow:", "\"Race and Rights Rhetoric\" was 144 highly polished pages, seemingly all written in one consistent voice, and not that of a trained economist. \"This chapter evaluates the utility of rights rhetoric ... as a vehicle for black liberation,\" because the authors believed that such a focus \"has impeded, rather than facilitated\" the achievement of \"black empowerment.\" They observed that \"it has become increasingly apparent that the strategies rooted in the Sixties have not led blacks to the promised land of genuine political, economic and social equality,\" because once that decade was in the past, \"political mobilization ... ground to a halt as blacks became increasingly reliant on lawyers and professional civil rights leaders and organizations with only minimal institutional presence in local communities.\"", "Although \"private property arrangements and resulting inequities in wealth and power do not devolve from divine providence,\" it was inescapably true that Americans have \"a continuing normative commitment to the ideals of individual freedom and mobility, values that extend far beyond the issue of race in the American mind.", "As an example of this line of thought, Obama and Fischer described what they called the “unfounded optimism of the average American” and used Donald Trump as an extreme caricature of what some people’s conception of upward mobility looked like, as summarized (with direct excerpts) by Garrow:", "The depth of this commitment [to personal liberty and opportunity] may be summarily dismissed as the unfounded optimism of the average American -- \"I may not be Donald Trump now, but just you wait; if I don't make it, my children will.\" But \"those of us on the political left\" often forget \"the degree to which coalition and consensus-building among the American electorate has necessarily preceded any major federal program to reform or restructure America's economic and political landscape.\"", "Therefore African Americans needed to understand how \"the indiscriminate use of rights rhetoric in conventional political battles only adds fuel to the suspicion of the average white that all claims of right are nothing more than hypocritical attempts on the part of blacks to disguise their pluralist self-interest in the language of prophecy.\" Thus \"rights rhetoric will be effective to the extent that it conforms to the aspirations of a color-blind society,\" and African Americans should grasp the pragmatic need for \"a shift away from rights rhetoric and towards the language of opportunity.\"", "Because of the reference to Donald Trump, Barack Obama’s presidential successor, some news outlets highlighted this excerpt, suggesting in somewhat misleading headlines that Obama was praising Trump as an archetypical example of the American Dream:", "Young Obama Said the American Dream Is to Be Donald Trump (Vice News, 12 May 2017)", "As a Harvard Law Student, Barack Obama Said Becoming Donald Trump Was The American Dream (Complex, 13 May 2017)", "In Law School, Obama Co-wrote a Paper Referring to Trump as the American Dream (AOL, 13 May 2017)", "While some of these articles clarified Obama and Fischer’s meaning in their text, the headline claims presented were a mischaracterization of Obama and Fisher’s argument, which was a call for pragmatism in discussions of racial equality and progress. As one example of this pragmatic approach, Obama and Fischer suggested reframing the quest for racial equality as part of the American concept of equality of opportunity. The invocation of Donald Trump's name was not, as implied by headlines, used to provide an example of the “American Dream,” but rather an example of the “unfounded optimism of the average American” (i.e., the expectation that they or their children would become economically well-off someday) -- a concept Obama and Fischer suggested could be tapped into as a way to bring about more fruitful discussions of racial equality.", "Garrow, David J.   Rising Star: The Making of Barack Obama.\r\n     HarperCollins, 2017.   ISBN 0008229384.", "Greenberg, David.   \"Why So Many Critics Hate the New Obama Biography.\"\r\n    Politico.   19 June 2017.", "Peyser, Eve.   \"Young Obama Said the American Dream Is to Be Donald Trump.\"\r\n    Vice News.   12 May 2017.", "Mansfield, Aaron.   \"As a Harvard Law Student, Barack Obama Said Becoming Donald Trump Was the American Dream.\"\r\n    Complex.   12 May 2017.", "AOL.   \"In Law School, Obama Co-Wrote a Paper Referring to Trump as the American Dream.\"\r\n    13 May 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]