["About this rating", "This piece lamenting that the \"American Dream ended last night in Ohio\" has been circulating online since November 2012, the \"last night in Ohio\" line referring to President Barack Obama's having won the electoral vote of that state in the previous night's presidential election and thus clinched his re-election bid. (Later versions of the piece replaced the phrase \"last night\" with \"on November 6th, 2012\" for clarity):", "Franklin Graham, the CEO of the Billy Graham Evangelistic Association, delivered the remarks at the Jacksonville Pastors' Conference in January of 2015:", "The American Dream ended last night in Ohio.", "The second term of Barack Obama will be the final nail in the coffin for the legacy of the white Christian males who discovered, explored, pioneered, settled and developed the greatest Republic in the history of mankind.", "A coalition of Blacks, Latinos, feminists, gays, government workers, union members, environmental extremists, the media, Hollywood, uninformed young people, the forever needy, the chronically unemployed, illegal aliens, and other fellow travelers has ended Norman Rockwell's America.", "The US Constitution has been replaced with Saul Alinsky's 'Rules for Radicals' and Chicago shyster David Axelrod, along with international socialist George Soros, will be pulling the strings on their black puppet to bring us into the New World Order.", "The Republicans ran two candidates who couldn't even win their own home states, while circus clown Chris Christie helped Obama over the top with a glowing 'post-Sandy' tribute that elevated the phony 'Commander-in Chief' to Mother Teresa status.", "People like me are now completely politically irrelevant; I will never again comment on or concern myself with the aforementioned Republican coalition, which has surrendered our culture, our heritage and our traditions without a shot being fired.", "You will never again outvote the people who gave Obama four more years. It will take individual acts of defiance and massive displays of civil disobedience to get back the rights we have allowed them to take away. It will take zealots, not moderates; zealots who will never 'reach across the aisle' to RINOs, to right this ship and restore our beloved Country to it's former status.", "Those who come after us will have to risk 'their lives, their fortunes and their sacred honor' to bring back the Republic that this generation has timidly frittered away due to white guilt and political correctness.", "My wife and I will now put our anti-ACLU Nativity Scene on display, and start wishing everyone a \"Merry Christmas\". And enjoy the rest of our lives in our 50’s-throwback Village of (Redacted) Lakes, here in (Redacted) Harbor.", "Atlas has Shrugged, and John Galt has left the building.", "Although many readers have forwarded this piece to us for evaluation, from our standpoint there's nothing much to analyze. This item is an opinion piece, someone's subjective expression of political vitriol; it's not an item containing information that could be examined for its truth value.", "The only factual element to this item is its attribution, which is incorrect: These words were not delivered at the Jacksonville Pastors' Conference in January 2015 by Franklin Graham, the president and CEO of the Billy Graham Evangelistic Association. This item had already been circulating anonymously for more than two years prior to that event, attributed to no particular individual or publication. (From what we can tell, someone later added the salutation \"Semper Fi\" to the text, which prompted someone else to include a header stating that the piece was \"written by a USMC Vet.\")", "One thing we can say is that it has been a common phenomenon, across many eras, for people to view the world as it was during their childhoods and formative years as a Golden Age when most everything \"right\" and \"good,\" and to consider subsequent political and social changes as harbingers of the irreversible corruption and ruination of that Golden Age.", "In early 2021, the piece gained a new lease of life when internet users once again falsely attributed it to Graham, this time positioning its pronouncements in the context of the presidency of Joe Biden:", "-->", "Brack, Elliott.   \"Legislator Offers Teens No-Nonsense Advice.\"\r\n    The Atlanta Journal and Constitution.   14 June 2000   (p. J3).", "[Updated] April 5, 2021: Added mention of new iterations of the message in 2021.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]