["New Zealand stunned India in the semifinal of the ICC World Cup 2019 played at Manchester. Following the sensational win by the Kiwis, social media was abuzz with the claim that an umpiring blooper had possibly cost India the match. A screenshot of the live broadcast of the match, taken right before MS Dhoni was run-out by a direct throw from the deep by Martin Guptill, has been circulated by social media users, alleging that Lockie Ferguson had bowled an illegal delivery because there were six players outside the inner circle.", "ICC rules state that only five fielders are allowed outside the 30-yard circle in the third powerplay of an innings, which is between overs 41-50 i.e the final ten overs of the innings. Some prominent social media users and influencers have drawn attention to this supposed error by the umpires who failed to take into account the fielding positions of the New Zealand players ahead of the delivery.", "CNN News18 anchor Anand Narasimhan posted the screenshot with a message, “Glaring umpiring error? Could they afford this in a World Cup semi final? 6 players outside the circle… how long did they play like that in P3?”.", "Glaring umpiring error? Could they afford this in a World Cup semi final? 6 players outside the circle… how long did they play like that in P3? #INDvNZL #Dhoni pic.twitter.com/Hb5UlA4tsI", "— Anand Narasimhan (@AnchorAnandN) July 10, 2019", "Several other individuals have posted the screenshot on Twitter to suggest that such an umpiring error did take place during the match.", "In P3 (41-50) over, Only 5 players are allowed outside the 30 yard circle. Period! #INDvNZ #MSDhoni #TeamIndia pic.twitter.com/ogA12Cwxkc", "— MS Dhoni Fans Official (@msdfansofficial) July 10, 2019", "MS Dhoni Fans official, a Facebook page with close to 6 lakh followers, was one of the earliest to post this image. A YouTube video titled, “देखिये,Dhoni थे नोटआउट मेहनत से नही अम्पायर की बईमानी से जीता है न्यूज़ीलैण्ड,सबूत देख होश उड़ जायेंगे“, has garnered more than 11 million views.", "Prominent media outlets like The Indian Express, India Today, Aaj Tak and Wion have also published articles giving credence to the theory of a possible violation of fielding restriction during the third powerplay of the Indian innings.", "Alt News found that there was an error in the graphic of the field setting shown by the broadcaster before the ball was delivered off which Dhoni was dismissed. In the course of the article, we shall analyse the field setting of each delivery starting from the first ball of the 49th over to the ball on which Dhoni was run-out by Guptill. We have corroborated the exact field setting for these three balls with visual, images and live commentary. It may be noted here that the fielders standing outside the 30-yard circle and their fielding positions are discussed in the context of the 49th over in the third powerplay, with an exception for the third ball.", "In a screenshot of the broadcast taken right before the first ball, one can see that there are five fielders outside the circle. The fielding positions were third man, deep fine leg, deep point, deep square leg and long-on. On the first ball of the 49th over, Dhoni hit Ferguson for a six.", "Now, the man at mid-wicket is moved back and deep fine leg is brought inside the circle [This is corroborated by Ian Smith’s commentary before the third ball of the 49th over was bowled]. The second delivery from Ferguson to Dhoni is fuller and straighter, and results in a dot.", "The field setting before the third ball, when Dhoni lost his wicket in the 49th over, was deep point, deep fine leg, deep square leg, deep mid-wicket and long-on. While the graphic shown during the broadcast showed the short fine leg shifting to deep fine leg, the shifting of the fielder placed at the third man position to short third man position as described by commentator Ian Smith wasn’t shown.", "Right before the third ball, Ian Smith can be heard saying, “has come across to Ferguson and said bring up the third man, send back fine leg. Williamson wasn’t really involved in the conversation. Ferguson shifting his own man here.”", "pic.twitter.com/NuLGLIC8Ef", "— Karan Gurjar (@Gurjar077) July 10, 2019", "The video posted below demonstrates the error. The fielder at the short fine leg can be seen moving towards the deep fine leg position. The error in graphics broadcast during the match has been highlighted with a circle. The graphics did not show the real-time movement of the third man coming inside the 30-yard circle.", "The fielder at short third man is also seen in one of the frames in the video, as Ferguson takes the run-up towards the pitch. You can see the legs of that fielder [on the top-left corner] in one frame while the other shows him running towards the stumps as Dhoni is running towards the non-striker’s end.", "In the comparison posted below, the graphic of the field setting seen at the start of the 49th over is placed on top of the graphic of the field setting broadcasted before the 3rd ball of the over.", "Simply put, mid-wicket moved to deep mid-wicket after the first ball was bowled, which was correctly displayed in the graphic. However, the movement of the third man fielder to short third man position was not displayed on the graphic in real-time. Hence, it showed 6 men outside the 30-yard circle whereas there were actually 5 men. There was no umpiring error. There was a graphical error in the broadcast.", "The error by the broadcaster has been highlighted with a yellow circle in the second image, posted below.", "In another tweet, Anand Narasimhan posted a clarification acknowledging the fact that the third man was moved inside the circle before the third delivery and that there was no fielding violation.", "He tweeted, “Trent Boult was making the fielding changes & before Ferguson ran in, 3rdman was moved up”. It may be noted that Narasimhan’s tweet which raised doubt over a possible violation of the field restrictions has been retweeted more than 3,700 times, whereas the clarification has only garnered close to 100 retweets at the time of writing this article.", "#Dhoni Here is the clarification. Apparently thirdman moved into the circle just before the delivery was bowled and their was NO fielding violation. Trent Boult was making the fielding changes & before Ferguson ran in, 3rdman was moved up… #CWCUP2019", "— Anand Narasimhan (@AnchorAnandN) July 10, 2019", "An error in graphics by the broadcasters, which is evident from the commentators’ explanation regarding the changes in field placement during the 49th over of the semifinal between New Zealand and India was widely shared on social media with the false claim that a major fielding violation had gone unseen by the umpires. The claim has become a major talking point on social media, with several prominent Twitter handles tweeting about the half-baked conspiracy theory and mainstream media outlets validating the same. Moreover, it may be noted that the legality of the delivery is irrelevant in the case of a run-out, the manner of dismissal of MS Dhoni.", "Graphics by Ronak Shukla and Smit Bhatt", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]