["“Pitbull speaks on the rehearsal of Event 201 and how Cxxxd19 was planned out,” reads the text shared with a video clip of Armando Christian Perez, known professionally as Pitbull, discussing the pandemic in a February 6, 2021 Facebook post.", "More examples of the video can be found on Facebook, on YouTube here, here, and here, and on Twitter.", "Some versions of the video contain a watermark that makes it clear the footage is from the program Drink Champs. The show stars American hip hop and reggaeton artist N.O.R.E and DJ EFN, and airs on the hip hop cable channel Revolt TV. It is also broadcast as a podcast.", "A search of the show’s website reveals that the full video of the episode featuring Pitbull was uploaded on September 26, 2020. Most of the episode features the Miami-based rapper discussing his music and life, but at the 1 hour 37 minute mark he pivots and spends about five minutes discussing the Covid-19 pandemic. That segment has been reshared thousands of times in February 2021.", "In it, the rapper calls the current situation a “scamdemic, plandemic” and references previously debunked claims as evidence that the global pandemic was planned.", "“There’s a rehearsal that went on before this whole shit -- it’s called Event 201,” Pitbull says. “It was ran by the John Hopkins University, which is in kahoots with Bill Gates, Melinda Gates Foundation. And this was a complete rehearsal of what we did right now.”", "Event 201 was held in October 2019, but the organizers have repeatedly dismissed claims that the exercise predicted the current pandemic, which has killed nearly 2.4 million people worldwide.", "In a 2020 statement, the Johns Hopkins Center for Health Security, which organized the event, said: “For the scenario, we modeled a fictional coronavirus pandemic, but we explicitly stated that it was not a prediction. Instead, the exercise served to highlight preparedness and response challenges that would likely arise in a very severe pandemic.”", "Tara Kirk Sell, who co-led the Event 201 exercise and helped write the script, told AFP in August 2020: “This is basically modeling and thinking through what kind of challenges we would face.”", "“We had identified many of those challenges ahead of time,” which “just means that we’re good at our jobs,” she said.", "Gates, whose foundation helped host Event 201, has remained a target for conspiracy theories, including the false claim that he aims to put microchips into people via Covid-19 vaccines.", "In a February 2021 update to its policy regarding harmful Covid-19 misinformation, Facebook said it specifically prohibits content stating that “Covid-19 was predicted, including in ‘Event 201’’s pandemic exercise in October 2019.”", "Pitbull also claims that following the Event 201 meeting, “all the main CEOs in the world -- major companies -- resign. About a thousand and some change.” He goes on to specifically mention Disney, Hulu, Microsoft, Nike, Wells Fargo and Boeing, saying, “That’s the tail wagging the dog.”", "AFP first examined misleading claims about resignations in April 2020.", "Of the companies referenced by Pitbull, the top executives at Microsoft, Nike and Wells Fargo have remained constant throughout the pandemic.", "Satya Nadella has been Microsoft’s CEO since 2014, Nike CEO John Donahoe took over the role in January 2020, and Charles W. Scharf was named CEO of Wells Fargo bank in September 2019.", "Disney, Hulu and Boeing did change leadership during the pandemic.", "Boeing CEO Dennis Muilenburg was fired over the handling of the 737 MAX crisis that saw the planes grounded following two deadly crashes.", "AFP has debunked hundreds of false or misleading claims about the coronavirus, available here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]