["“AT&T got a contract to do forensic audit on Dominion voting machines and those machines were being moved to Nashville this past week,” says a December 27, 2020 Facebook post.", "“The explosion ‘just happened’ to be at the AT&T location where they ‘just so happen’ to control the cooling system for the super computer and house the dominion voting machines and drives for forensic audit,” it says.", "The claim also appears on Facebook here, here, on Twitter here and here and on Reddit here and here.", "An explosion ripped through downtown Nashville on Christmas Day, killing the man suspected of setting off the bomb in the southern city, according to federal prosecutor Don Cochran.", "Dominion Voting Systems has been repeatedly targeted by US President Donald Trump and his supporters with unfounded accusations of involvement in election fraud. AFP Fact Check has debunked other inaccurate claims about the company here.", "AT&T said it is not conducting an audit of the firm.", "“That is not true,” Jim Greer, AT&T associate vice president for corporate communications, told AFP by email when asked about the audit claim.", "And Dominion said the claim is false.", "“This is another bizarre lie being spread by known conspiracy theorists. It has zero credibility, and should be ignored by any credible media outlet,” a spokesperson for the company said by email.", "The posts also falsely link President-elect Joe Biden’s brother-in-law to Dominion.", "“Dominion voting is owned by Cerberus Capital Management.... Cerberus is run by Staple Street Execs. Joe Bidens Brother in Law, Steven Owens, is the cofounder of Staple Street Execs along with William Kennard,” they say.", "Dominion was “acquired by its management team and Staple Street Capital,” according to this 2018 statement. Staple Street was co-founded by Stephen Owens -- not the husband of Biden’s sister Valerie, whose name is Jack Owens.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]