["About this rating", "The Senate confirmation hearings for President Trump's second U.S. Supreme Court nominee, Brett Kavanaugh, got off to a raucous start on 4 September 2018, with Democrats interrupting to call for adjournment and protesters being hauled from the chamber for causing loud disruptions.", "The demonstrations were organized by groups opposed to what they characterized as Kavanaugh's \"extreme\" views on issues such as women's rights, LGBT rights, and access to healthcare. One senator described the scene as \"pandemonium.\"", "NPR reporter Brian Naylor provided this account of those events:", "There were frequent disruptions by demonstrators inside the hearing room, often interrupting the Democrats' interruptions. Many expressed concerns over the fate of Roe v. Wade, the 1973 Supreme Court decision that legalized abortion. At one point, a protester could be heard shouting \"more women are going to be subject to back-alley abortions.\" And outside the hearing room a group of women dressed in bonnets and red robes from The Handmaid's Tale stood silently. U.S. Capitol Police say they arrested a total of 70 demonstrators Tuesday.", "The Fox News Channel's Shannon Bream live-tweeted from the hearing, sharing videos of several of the protests:", "more protests #KavanaughHearing pic.twitter.com/XBPtNHzv4y", "— Shannon Bream (@ShannonBream) September 4, 2018", "Shortly thereafter, Bream tweeted that Kavanaugh's daughters had been escorted from the hearing room:", "Judge Kavanaugh’s children just left the hearing room with escorts.", "— Shannon Bream (@ShannonBream) September 4, 2018", "At the start of the hearing, Kavanaugh had introduced members of his family, including his two daughters, Margaret and Liza, who sat behind him with their mother, Ashley Kavanaugh. This photograph of them was taken during one of the more tranquil moments in the hearing:", "Embed from Getty Images", "Speculation about why Kavanaugh's family left the chamber when they did started almost immediately. Most of it centered on the protests, but a social media meme shared later that day said Kavanaugh's daughters were ushered out of the room \"due to hecklers harassing them\":", "This claim is at odds with press accounts of what happened, however. Some conservative news outlets did portray the departure of Kavanaugh's children as an abrupt response to the loud protests (which they claimed \"scared\" the girls), but none reported that the children themselves (rather than the hearing in general) had been heckled. This is how the Washington Examiner couched it:", "As Democratic senators fought to delay the hearing of Supreme Court nominee Brett Kavanaugh, and as spectators jarringly heckled the process, his two young daughters were rushed from the hearing room, according to sources.", "The two, Margaret and Liza, were taken out by their mother, Ashley, as the hearing got “hot,” said one insider.", "“It was very unpleasant for young children,” said the insider.", "And the New York Post reported that:", "In the morning, Kavanaugh introduces wife Ashley and daughters Liza and Margaret.", "But later, as the protests heated up, Kavanaugh’s daughters were escorted out, according to Fox News.", "“I’m sorry your daughters had to endure the political circus of this morning,” said Sen. Ted Cruz (R-Texas).", "In contrast to accounts linking the girls' departure to the protests, however, CNN reported that it was planned in advance: \"A source close to Kavanaugh tells CNN 'that was always the plan, they’d stay for an hour and go back for intros' later in the day.\"", "And, according to the New York Post, Margaret and Liza Kavanaugh did, in fact, return later in the day to hear testimony in support of their father by Condaleeza Rice and others.", "Even if it were planned all along, the precise timing of Kavanaugh's daughters' departure could have had something to do with the raucous atmosphere in the hearing room, of course. But there is no evidence that the Kavanaugh children were themselves targeted for heckling by protesters, or that they left for that reason. Indeed, if they had been subjected to personal harassment, one would have expected the committee chairman, Sen. Charles Grassley, to issue a statement condemning it.", "Bedard, Paul.   \"Kavanaugh's Daughters Rushed Out of Chaotic, 'Hot' Hearing.\"\r\n     Washington Examiner.   4 September 2018.", "Nailor, Brian.   \"Kavanaugh Hearings, Day 1: Protesters Focus on Roe; Attempted Handshake Goes Viral.\"\r\n    NPR.   4 September 2018.", "Rocha, Veronica et al  \"Live Updates: The Kavanaugh Hearing.\"\r\n    CNN.   4 September 2018.", "Schultz, Marisa.   \"Chaos Breaks Out at Start of Kavanaugh's Confirmation Hearings.\"\r\n    New York Post.   4 September 2018.", "C-SPAN.   \"Supreme Court Nominee Brett Kavanaugh Confirmation Hearing, Day 1.\"\r\n    4 September 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]