["About this rating", "On 15 June 2018, Incredibles 2 — the sequel to the hugely successful 2004 animated movie Incredibles — was released to good reviews. Not long after that, the reviews were augmented by concerns in widely shared blog posts and social media warnings that certain scenes might trigger epileptic seizures.", "On 16 June, the non-profit Epilepsy Foundation issued a warning about the film:", "Members of our community have expressed concerns about flashing lights in the new Disney Pixar movie \"Incredibles 2,\" and, in certain instances, people having experienced a seizure during the movie. We stand with our epilepsy warriors and their families as they voice their concerns about the movie and appreciate the efforts some theaters have already made to post warning signs for people waiting to see the movie.", "According to the Epilepsy Foundation, around three percent of people with epilepsy have a condition known as photosensitive epilepsy, in which intense flickering lights and other visual stimuli can trigger seizures, migraines, and headaches. Among the common causes of these seizures are \"intense strobe lights,\" \"video games or TV broadcasts containing rapid flashes or alternating patterns of different colors,\" and even natural sunlight, \"especially when shimmering off water, flickering through trees or through the slats of Venetian blinds.\"", "Over the course of the movie's opening weekend, members of the public shared photographs of a boilerplate warning posted in movie theaters in various parts of the country by various companies including AMC and Cinemark:", "So I went to see The Incredibles 2 and I saw this sign outside the theatre. I want thank @AMCTheatres for this. With a wife that is diagnosed with Epilepsy I greatly greatly appreciate this! Thank you AMC Cherry Hill pic.twitter.com/90Ts26Lrg2", "— Lost Boy Kirby (@TLBKirby) June 18, 2018", "Major shoutout to the Jordan Creek movie theater for posting epilepsy warning signs for Incredibles 2. Thanks for lookin out for those of us with epilepsy. ❤️ pic.twitter.com/CVX3wboGHo", "— Kelsey Culbertson (@kels_culbs) June 16, 2018", "I saw The Incredibles 2 today and the theater had warnings about the epilepsy scenes at the ticket areas when I got there. Btw it was a great movie, I totally recommend it, but those with epilepsy might want to be cautious if they go to see it. pic.twitter.com/ODmY8KFQUJ", "— Whip [Colin WK] (@Whip_YT) June 17, 2018", "Thank you to everyone for retweeting this, writing articles, and signal boosting my message! My goal of having signs at the ticket counter was reached so that people can be warned about the flashing lights in Incredibles 2. pic.twitter.com/JljozWlojd", "— Veronica Lewis (@veron4ica) June 17, 2018", "Film curator Colin Geddes shared what appears to be a memo sent by Ken Caldwell, Senior Vice President at Walt Disney Studios Motion Pictures, to movie theaters showing Incredibles 2. The memo is dated 15 June 2018, suggesting that Disney took action on the epilepsy risk on the same day the movie was released:", "It has come to our attention that some lighting effects in Incredibles 2 may affect photosensitive viewers. Out of an abundance of caution, we recommend that you provide at the box office and other appropriate places a notice to your customers containing the following information:", "\"INCREDIBLES 2 contains a sequence of flashing lights which may affect customers who are susceptible to photosensitive epilepsy or other photosensitivities.\"", "Bring the kids! This notice sent to exhibitors today from Disney #incredibles2 “INCREDIBLES 2 contains a sequence of flashing lights which may affect customers who are susceptible to photosensitive epilepsy or other photo sensitivities.” pic.twitter.com/N2g0vQ8lsL", "— Colin Geddes (@colingeddes) June 16, 2018", "You can find details here and here about the specific elements in the film that have caused most concern.", "Lewis, Veronica.  \"The Real Villain in 'Incredibles 2' -- Strobe Lights.\"\r\n  Veroniiiica.com.  14 June 2018.", "The Sleep of Reason.  \"Warning: The Incredibles 2 is Not Epilepsy Safe.\"\r\n  Tumblr.com.  14 June 2018.", "Epilepsy Foundation.  \"Epilepsy Foundation Advises Viewer Caution Related to Flashing Lights in 'Incredibles 2' and Asks Disney Pixar to Post a Warning on Its Digital Channels.\"\r\n  Epilepsy Foundation.  16 June 2018.", "Epilepsy Foundation.  \"Photosensitivity and Seizures.\"\r\n  Epilepsy Foundation.  18 November 2013.", "Rawden, Jessica.  \"Theaters Are Adding Signs to Warn Epileptic Fans About 'Incredibles 2.'\"\r\n  CinemaBlend.com.  17 June 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]