["By Angelo Fichera", "Posted on February 3, 2021", "Social media posts falsely claim that the November election in Myanmar was conducted using Dominion Voting Systems, the company that was the focus of bogus theories about the 2020 U.S. presidential election. The company said its systems aren’t used in Myanmar, and there’s no indication that the country uses any voting machines.", "A false narrative pushed in the aftermath of the U.S. presidential election — that a voting systems company had somehow facilitated massive fraud to the detriment of former President Donald Trump — is now being recycled to suggest a similar tale in Myanmar.", "But that insinuation is also bunk. The Southeast Asian nation does not use Dominion Voting Systems, contrary to claims on social media.", "The erroneous claim surfaced online Feb. 1, following news that Myanmar’s military had staged a coup and detained the country’s civilian leader, Aung San Suu Kyi, and other members of her party. The military, which is closely aligned with the country’s major opposition party, announced that it would impose a state of emergency for a year.", "Suu Kyi’s party handily won the election in November, but the military has claimed that widespread irregularities could have led to fraud — despite a national election commission saying there is no evidence to back up that allegation — as the Associated Press reported.", "On Twitter and Facebook, some users suggested the Myanmar military’s election fraud claim is somehow related to Dominion.", "“The White House is freaking out after Myanmar Military arrests political leaders for Election Fraud in their November 8 elections. Myanmar used Dominion Voting Systems,” a Facebook post reads. The post included a 2012 photo of former President Barack Obama and then-Secretary of State Hillary Clinton meeting with Suu Kyi.", "A spokesperson for Dominion told us in a statement that “Dominion had absolutely no involvement whatsoever in Myanmar in any capacity.”", "“Neither Dominion’s machines nor its software had any role in Myanmar’s elections or the ongoing political unrest there,” the spokesperson added.", "Allegations of election fraud lodged against Dominion in the U.S. have been repeatedly debunked, including by audits of the underlying paper ballots. Some organizations that provided a platform to baseless claims about the company have since distanced themselves from those claims or apologized, following threats of legal action by the company.", "There is also no evidence that Myanmar used technology from Smartmatic, another election systems company that was the focus of baseless allegations about vote switching, as we’ve reported. One viral tweet claimed “Myanmar’s Nov election: Used Dominion & Smartmatic” — and seemed to suggest the U.S. should have taken steps similar to Myanmar’s coup.", "But there is no indication that Myanmar even used voting machines for its election.", "A report by the International Institute for Democracy and Electoral Assistance on Myanmar’s 2020 election makes no mention of any voting machines — let alone Dominion or Smartmatic systems — being used. Nor does a report outlining observations from the election by the Myanmar-based People’s Alliance for Credible Elections.", "The former report, on page 21, outlines a process by which a voter “marks the candidate” with a “voting stamp,” then folds the ballot and inserts it into a ballot box. It makes no references to machines being used to count votes.", "Tun Myint, an associate professor of political science at Carleton College in Minnesota, likewise told us in a phone interview that he was not aware of machines being used in the elections. Myint is a native of Myanmar (also known as Burma) whose studies focus on the country and on Southeast Asia.", "Myint described the process like the one outlined in the reports, pointing out that news photos of the military leader, Min Aung Hlaing, voting in the November election show him casting his paper ballot into a ballot box.", "“The infrastructure is not there,” he said, of villages and towns using machines to facilitate elections.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“2020 General Election in Myanmar – Fact Sheet.” International Institute for Democracy and Electoral Assistance. 14 Jul 2020.", "“2020 General Elections Observation Preliminary Findings.” People’s Alliance for Credible Elections. 9 Nov 2020.", "Fichera, Angelo. “Audit in Michigan County Refutes Dominion Conspiracy Theory.” FactCheck.org. 18 Dec 2020.", "Hale Spencer, Saranac. “Baseless Conspiracy Theory Targets Another Election Technology Company.” FactCheck.org. 25 Nov 2020.", "Lifson, Thomas. “Statement.” American Thinker. 15 Jan 2021.", "Milko, Victoria. “EXPLAINER: Why did the military stage a coup in Myanmar?” Associated Press. 2 Feb 2021.", "“Myanmar military seizes power, detains elected leader Aung San Suu Kyi.” Reuters. 1 Feb 2021.", "Myint, Tun. Associate professor of political science, Carleton College. Phone interview with FactCheck.org. 2 Feb 2021.", "“President Obama’s Asia Trip | November 17-20, 2012.” Obama White House. 2012.", "Rieder, Rem. “Trump Tweets Conspiracy Theory About Deleted Votes.” FactCheck.org. 13 Nov 2020.", "Sone Win, Pyae. “Myanmar election commission rejects military’s fraud claims.” Associated Press. 29 Jan 2021.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]