["About this rating", "Two Muslim organizations captured the attention of millions of people worldwide in October and November 2018, when they raised more than $200,000 for the victims of a mass shooting at Pittsburgh's Tree of Life synagogue on 27 October that claimed 11 lives.", "Shortly after the massacre, CelebrateMercy, a Muslim non-profit organization based in Cincinnati, and MPower Change, a Muslim social justice grassroots organization, jointly set up a crowd-funding campaign on the website LaunchGood with the initial aim of raising $25,000 for the families of those killed at the synagogue.", "That cross-community gesture of solidarity struck a chord with the public and was widely covered in the news media. As donations poured in, the campaign's target amount was repeatedly increased and eventually reached a goal of $150,000 which was met within just two days of the Tree of Life shooting. When donations were closed on 4 November, the campaign had raised $238,634.", "A few weeks later, right-wing web sites claimed that almost all that money had never made it to its intended recipients, but had instead been either kept by the Muslim groups or transferred to a mosque.", "For example, the Conservative Review web site posted an article with the headline \"Islamists in Pittsburgh pocket cash raised for Jewish community in wake of mass shooting,\" adding:", "Islamic groups in Pittsburgh appear to have pocketed hundreds of thousands of dollars from fundraisers set up in the wake of the horrific October mass shooting at the Tree of Life Synagogue, which killed eleven Jews and injured several congregants and police officers who responded to the scene.", "According to the left-wing The Forward, the Islamic group Celebrate Mercy has already funneled $155,000 -- of over $238,634 that was raised supposedly for the victims of the shooting and the greater Jewish community of Pittsburgh — into the Islamic Center of Pittsburgh. Though the Forward article states that a document was posted signed by a representative of Celebrate Mercy, the director of the Islamic Center, and a “Tree of Life representative detailing exactly how the funds will be distributed to victims and their families,” the link to the document is dead.", "The right-wing Gateway Pundit web site followed suit, posting an article with the headline \"Islamic Group Raises $238,634 Following Pittsburgh Synagogue Shooting -- $155,000 Went to Local Mosque, Only $10,000 Went to Synagogue.\"", "The conservative web site Townhall.com also reported that the money intended for victims of the shooting had gone to the Islamic Center of Pittsburgh instead, in an article that the  anti-Islamic commentator Pamela Geller reposted on her own web site.", "Those articles grossly misrepresented the facts surrounding the transfer of donations to the Tree of Life synagogue. The Islamic Center of Pittsburgh gave two separate checks, for $155,000 and $84,534, to the Tree of Life synagogue on 21 November, six days before the articles were posted.", "(Due to additional donations sent in by check or through CelebrateMercy's website, as well as the deduction of processing fees by LaunchGood, the amount received by Tree of Life was actually $900 greater than the total raised through the LaunchGood campaign.)", "On 25 November, two days before all three articles were published, CelebrateMercy's founding director Tarek El-Messidi posted an update to the crowd-funding page, announcing the $155,000 transfer: \"We are pleased to report that -- on November 21st -- the Islamic Center of Pittsburgh gave a $155,000 check to the Tree of Life synagogue (the funds raised by this campaign).\"", "On 28 November, Tree of Life's president Sam Schachner and Rabbi Hazzan Jeffrey Myers wrote open letters of thanks to the Islamic Center of Pittsburgh, CelebrateMercy, and MPower Change, describing the donations as \"a powerful act of love.\" We obtained copies of both letters, which can be read below.", "The letters were addressed to Wasi Mohamed, Executive Director of the Islamic Center of Pittsburgh, who acted as an intermediary in the transfer of the funds. Schachner and Myers wrote:", "We cannot thank The Muslims Unite for Pittsburgh Synagogue Campaign enough for extending your support to us during this time of tragedy...The outpouring of support from our local communities, the nation, and indeed the world, has shown us that love and kindness will always win over darkness. This is a remarkable time our history, and we draw our strength by coming together. Your gift is a powerful act of love. Thank you for joining with others and proving that we're stronger together.", "Those letters definitively confirmed what the Muslim groups behind the crowd-funding campaign had said all along -- that 100 percent of the money raised would go to the Tree of Life synagogue. Those transfers had already taken place by the time the Gateway Pundit, Conservative Review, and Townhall published their articles.", "Furthermore, a 25 November article from the progressive Jewish community web site The Forward, an article cited by the Conservative Review itself, contained a link to a document signed by Tree of Life's financial controller Stacey Hausman on 21 November which acknowledged the transfer of funds.", "That document was a three-way agreement between CelebrateMercy, the Islamic Center of Pittsburgh, and Tree of Life, about how the first $155,000 would be transferred to Tree of Life and distributed among the families of those killed and injured in the synagogue shooting. Contrary to the Conservative Review's claim, the link to the document was not dead at the time the Conservative Review published their article:", "CelebrateMercy, a nonprofit corporation and public charity ... will grant $155,000 to the Tree of Life Or L'Simcha (TOLOLS) ... through the Islamic Center of Pittsburgh ... to be used to support victims and the families of victims in the tragic October 27, 2018 attack on their house of worship ...", "TOLOLS agrees to distribute 100% of the granted funds to the killed victims' families as well as wounded survivors from the TOLOLS, Dor Hadash, and New Light Congregations. Families of the 11 killed victims will each receive at least $10,000 for their short-term expenses related to the tragedy, especially funeral and memorial service expenses. The remaining $45,000 can be distributed to wounded survivors, to assist with ongoing medical bills and/or therapy.", "So by the time the Conservative Review, Gateway Pundit, and Townhall had published their articles on 27 November, a document was already available online that outlined in detail how the funds would be transferred to Tree of Life,  a document signed by a representative from Tree of Life. The agreement also made it clear that the money was not being \"funneled\" to the Islamic Center of Pittsburgh (as the Conservative Review claimed) but rather that the Center was acting as a temporary intermediary in the transfer of collected monies.", "In their 28 November letter of thanks, the synagogue's president and rabbi also confirmed what CelebrateMercy and MPower Change had consistently outlined as the intended purpose of the additional $84,534 raised through the crowd-funding campaign: Tree of Life committed to using it for \"projects that will help foster Muslim/Jewish collaboration, dialogue and solidarity,\" on the condition that the initial $155,000 proved sufficient to meet the needs of the victims and their families.", "Dale, MaryClaire.   \"Synagogue Suspect Pleads Not Guilty as Funerals Continue.\"\r\n    Associated Press.   1 November 2018.", "Schachtel, Jordan.   \"Islamists in Pittsburgh Pocket Cash Raised for Jewish Community in Wake of Mass Shooting.\"\r\n    Conservative Review.   27 November 2018.", "Hoft, Jim.   \"Islamic Group Raises $238,634 Following Pittsburgh Synagogue Shooting -- $155,000 Went to Local Mosque, Only $10,000 Went to Synagogue.\"\r\n    Gateway Pundit.   27 November 2018.", "Pink, Aiden.   \"Muslims Have Raised Lots of Money for Jews Recently. Here's Where It's Going.\"\r\n    The Forward.   25 November 2018.", "Vespa, Matt.   \"WOW: Money Raised After Pittsburgh Shooting Went to an Islamic Center with Terror Ties.\"\r\n    Townhall.   27 November 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]