["By Eugene Kiely", "Posted on March 26, 2017", "At an Oval Office ceremony, President Donald Trump boasted that Charter Communications “has just committed to investing $25 billion” and creating 20,000 jobs in the U.S. — the latest example of companies, he said, that are investing in the U.S. “following my election victory.”", "But Charter’s plans to add 20,000 jobs have been in the works for nearly two years — the result of a merger with Time Warner Cable and Bright House Networks.", "The $25 billion in investments was also part of a commitment the company made before the election, an industry analyst told us.", "Trump made the jobs announcement at the White House with Charter CEO Tom Rutledge and Texas Gov. Greg Abbott. The president joked with Rutledge about the size of the investment.", "Trump, March 24: Today I am thrilled to announce that Charter Communications has just committed to investing $25 billion — with a B, $25 billion — you’re sure that’s right, right? With a B, right — $25 billion here in the United States, and has committed further to hiring 20,000 American workers over the next four years.", "The president said Charter’s announcement is the latest example of companies “that have recently announced billions of dollars in investment and thousands of jobs coming into the United States following my election victory.”", "But, as we have written a few times before, Trump has taken credit for job creation that actually was already in the works. That’s the case with Charter.", "The company had been promising to add 20,000 jobs for nearly two years as part of its efforts to win federal and state approval for its $55 billion merger with Time Warner Cable and $10.4 billion purchase of Bright House Networks.", "In June 2015, The Hollywood Reporter quoted Rutledge as saying the company would relocate overseas call center jobs to the U.S. as part of the cable company’s effort to improve service quality. In all, the company would need 20,000 new employees, Rutledge said.", "“Quality can save you money, so we are believers in hiring people to work for us and not sending calls offshore — hiring actual employees and training and investing in them as opposed to contractors,” Rutledge said.", "The promise of 20,000 jobs was repeated as the company went through the process of receiving federal and state approvals for the merger.", "In January 2016, for example, Charter issued a press release touting the public benefits of a merger a week after the New York Public Service Commission approved its deal to buy Time Warner Cable and Bright House Networks — a “significant step,” as Rutledge put it, toward final approval of the merger. In the release, the company said it would create 20,000 jobs — “including thousands of jobs brought back to the United States” — if the merger received final approval.", "“We understand the importance of demonstrating why the transactions are in the public interest, which is why we continue to engage with regulators, stakeholders and the public about the benefits New Charter will bring to customers — including fast unlimited broadband, increased broadband buildout, a commitment to the Open Internet, innovative video services and 20,000 new jobs, including thousands of jobs brought back to the United States,” the corporate release said.", "Charter completed the takeover of Time Warner Cable and Bright House Networks in May 2016 after the merger was approved by the Department of Justice and the Federal Communications Commission.", "At a June 23, 2016, Senate oversight committee hearing, Kathleen “Kip” Mayo, the company’s executive vice president for customer relations, told senators that the company would relocate jobs from overseas call centers to the U.S.", "“As part of our transaction with Time Warner Cable, Charter expects to hire 20,000 American workers, many of whom will fill customer service jobs that are currently outsourced to call centers located in other countries,” she said.", "Nevertheless, Trump took credit for the 20,000 jobs.", "The White House issued a press release — “President Trump Delivers on Jobs for the American People” — that not only touted the 20,000 jobs, but specifically noted that Charter “will be opening a brand new call center in McAllen, Texas, where the company will create 600 new American jobs.”", "The Texas governor spoke at the White House about the McAllen call center, praising Trump for “living up to his campaign promise” to create more jobs and “returning jobs from overseas back to the United States.”", "But the McAllen, Texas, jobs, too, were in the works before Trump won the presidency.", "Rutledge, Charter’s CEO, discussed moving call center jobs from overseas to the U.S. in a second quarter earnings call with industry analysts on Aug. 9, 2016. He cited the McAllen call center as an example.", "“We’ve already began in-sourcing efforts for the new company. The process of in-sourcing will take several years and will require that we hire 20,000 people, train them and equip them with trucks, tools and test equipment and house them in new and expanded facilities,” Rutledge told the analysts. “That process has already started as we are building Charter’s first Spanish language call center in McAllen, Texas with approximately 600 seats.”", "We asked Charter spokesman Justin Venech what’s new about the White House announcement. Although the company previously announced the 20,000 U.S. jobs, Venech said, the time frame for the hiring is new. It will happen over four years, he told us. But that’s not much different from the time frame of “several years” that Rutledge gave analysts last August.", "Venech also said the $25 billion investment is new. But the Hartford Courant reported that the Connecticut-based company was expected to make such a large investment over the next several years.", "“Market analysts were expecting the company would spend roughly $30 billion on capital expenditures, such as buying cable boxes and maintaining its network, through 2020,” the paper wrote.", "We asked Craig Moffett — a telecommunications industry analyst for MoffettNathanson who participated in Charter’s Aug. 9, 2016, earnings call — if he saw anything new in the White House announcement about the company’s 20,000 jobs and $25 billion investment.", "“No,” Moffett told us. “The entire announcement appears to be a restatement of commitments that were first made informally as early as 2015, and made more formally in early 2016, at least six months before the election.”", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]