["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "While campaigning on Hillary Clinton’s behalf, President Barack Obama has told people not to take their right to vote for granted, \"Don’t boo, vote!\"", "At a Nov. 2 rally in North Carolina, Obama told the story of a 100-year-old woman from the town of Belhaven, N.C., whose voter registration status had been challenged by Republicans just a few weeks prior. The woman, Grace Bell Hardison, contested the challenge, and her county elections board upheld her status as a registered voter.", "\"And you better believe she's going to vote,\" Obama said. \"But this 100-year-old woman wasn't alone in being targeted. The list of voters Republicans tried to purge was two-thirds black and Democratic. That didn’t happen by accident. It's happening in counties across the state. Now, there was a time when systematically denying black folks the right to vote was considered normal, as well.\"", "Two days after Obama spoke, a federal judge ordered three North Carolina counties to restore voter registrations for about 4,000 individuals whose registration had been revoked within 90 days of the election. The NAACP brought the lawsuit.", "Still, we were curious about Obama’s claim that Republicans in North Carolina tried to purge a list of voters that was two-thirds black and Democratic.", "In his remarks, it was unclear if Obama was talking about the state as a whole or a smaller area. A spokesman told us that he was referring specifically to Belhaven, the town where Hardison lives.", "For the local area, Obama’s numbers are close to on target, according to figures we received from the Beaufort County Elections Board.", "Ricky Radcliffe, a Republican who unsuccessfully ran for Belhaven mayor in 2015, and three of his associates submitted 138 voter registration challenges to the election board. Radcliffe had sent out mailers for his campaign to Belhaven residents based on voter registration information, and 138 of the mailers returned as undeliverable, so he and his associates contested their registration status.", "Of these 138 people who had their voter registrations challenged, 80 were black Democrats. That’s about 58 percent — just shy of the two-thirds Obama said.", "It appears that black people were at least slightly overrepresented in this group; black people of all political parties make up about 66 percent all the Belhaven challenged voters. But the town of Belhaven overall is about 54 percent black.", "We don’t have city-level political party data for Belhaven, so we can’t know if Democrats were overrepresented, too.", "Obama used this case to support his claim that Republicans are stopping black Democrats from voting in counties \"all around the state\" of North Carolina.", "Of North Carolina’s 100 counties, just three were involved in the most recent legal proceedings over voter roll purges: Beaufort, which we already discussed, Moore and Cumberland.", "Moore County removed 374 voters from the rolls, and 14.4 percent were black Democrats. Black people of all parties made up about 18 percent of the removed voters and 14 percent of the Moore County population overall.", "Jay Delancy, director of the Voter Integrity Project, an anti-voter fraud advocacy group that brought the challenges in Moore County, told us that his group strips out race and party when it looks for potentially fraudulent voter registrations in order to avoid bias.", "We were unable to get data from Cumberland County in time for publication.", "We were, though, able to get data for North Carolina overall. The state elections board told us that there were 6,612 total voters removed from the rolls in 2016, though many were re-added due to the recent court order. A plurality of those removed, 25.7 percent, were black Democrats. For comparison, white Republicans accounted for 18.44 percent.", "Black people are overrepresented among those removed from the rolls in 2016, compared to the North Carolina voting population at large, and white voters are underrepresented.", "Race", "Voter roll challenges", "North Carolina voters", "Black", "37.07 percent", "22.23 percent", "White", "50.69 percent", "69.54 percent", "Other", "12.24 percent", "8.23 percent", "Obama’s remarks may give a listener the impression that Republicans have tried to remove a selection of voters that’s two-thirds black and Democratic statewide, and that’s not the case, based on the state’s data.", "It’s worth noting that a federal appeals court found in July that North Carolina’s strict voter identification law was designed to \"target African-Americans with almost surgical precision,\" potentially making it harder for black people to vote. The court struck down the law.", "Our ruling", "Obama said, \"The list of voters Republicans tried to purge was two-thirds black and Democratic.\"", "Obama’s phrasing left the scope of his claim open for interpretation. One could think he was speaking of the state of North Carolina as a whole, in which case his claim would be incorrect, as about 25.7 percent of the statewide list of people removed from the voter registration rolls were black Democrats.", "But Obama’s staff told us he was talking specifically about just 138 challenges in the town of Belhaven, N.C. Of those challenges, 58 percent were black Democrats — just under two-thirds. Republicans did bring these challenges.", "We rate Obama’s claim Half True.", "White House, Remarks by the President at Hillary for America Rally, Nov. 2, 2016", "U.S. District Court for the Middle District of North Carolina, NAACP lawsuit, filed Oct. 31, 2016", "N.C. State Board of Elections, NC Voter Statistics Results, as of Oct. 29, 2016", "Moore County Board of Elections, list of removed voters, Nov. 7, 2016", "Associated Press, \"Judge: North Carolina counties must restore voters removed in 'insane' process,\" Nov. 4, 2016", "Email interview, White House spokesman Eric Schultz, Nov.  3, 2016", "Email interview, Beaufort County Board of Elections Director Kellie Hopkins, Nov. 3, 2016", "Email and phone interviews, Voter Integrity Project Director Jay Delancy, Nov. 3, 2016", "Email interview, North Carolina State Board of Elections data analyst Brian Neesby, Nov. 7, 2016", "Email interview, North Carolina ACLU communications director Mike Meno, Nov. 3, 2016", "Email and phone interviews, Director of Strategic Initiatives at Forward Justice J. Anthony Holbert, Nov. 3, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]