["About this rating", "In early June 2017 social media warnings began to circulate about a purported ISIS or Daesh-created WhatsApp group called \"Interschools\" (or \"Interschool\"), which users purportedly could not leave once they joined:", "Message from a friend:", "There is a whatsapp group called 'Interschools'. If invited, don't join the group, it belongs to Daesh (ISIS). If you join the group you will not be able to exit from it. Be vigilant, please inform others. Send this to your relatives and children on whatsapp so that they will also be careful. Forwarded as received.", "This warning was quite similar to perennial forwarded rumors about Facebook's implementing a user fee  or the unveiling of a premium messaging service called  \"WhatsApp Gold.\" The claim also bore resemblance to earlier rumors that ISIS used Paris-themed profile photographs to target users, that \"one ring\" phone calls were possibly \"from ISIS,\" or that ISIS was targeting children in the United States to join a group called \"Daesh.\" And the \"Interschools\" warning was nearly identical to an earlier warning about a WhatsApp group called \"Firdaus we ascend.\"", "As presented, the warning (like others of its ilk) made little sense.  What advantage would a jihadist militant group gain from enticing random people into joining a WhatsApp group, how could they prevent members from leaving, and what danger would this posit to those who were so entrapped?", "No evidence exists (outside of the circulation of spurious and anonymous warnings) that ISIS maintains a WhatsApp group intended to ensare innocent victims for some nefarious purpose, nor that any process exists by which a WhatsApp group creator can prevent members from leaving the  group once they have joined it.  The WhatsApp FAQ provides simple instructions for exiting a group:", "Exiting a group", "If you exit a group, you will be removed from the group but will still see it in your Chats list, and you will be able to read the chat history. If you are the only group admin and you exit a group, a participant is chosen at random to become the new admin. To exit a group:", "1. On the chats screen swipe the name of the group to the left.\n2. Tap More and then Exit Group.\n3. Confirm by tapping Exit Group.", "Moreover, as noted above, the \"Interschools\" warning was merely a slight variant of an unfounded rumor that had circulated less than two months earlier:", "There is a watsapp group called ‘Firdaus we ascend’, if invited, don’t join the group, it belongs to Daesh. If you join the group you will not be able to exit from it, be vigilant, please inform others – send it to your relatives and children on WhatsApp so that they remain careful.", "The \"Interschools\" WhatsApp warning is one of countless recent social media warnings alerting users to supposed ways in which ISIS or Daesh might recruit or target victims, yet none of these rumors ever seems to make very much sense from the perspective of those are allegedly perpetrating them.", "WhatsApp.   \"How Do I Use Group Chat? Exiting a Group.\"\r\n    Accessed 5 June 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]