["A news story about California farmers losing money because of a labor shortage has drawn attention on Facebook because it lays the blame on President Donald Trump’s immigration policies.", "A June 28, 2017, post on LeftScoop.com ran under the headline, \"Over $13 million worth of crops have ROTTED in California, all because no one is willing to work jobs vacated by migrants.\" The link has been shared more than 90,000 times in three weeks.", "Facebook users flagged the story as potentially being fabricated, as part of the social media giant’s efforts to combat fake news.", "In this case, the story isn’t fake.", "But it’s not accurate, either.", "The post is largely comprised almost entirely of uncredited passages from two legitimate news sources. It then adds anti-Trump sentiment for effect. We emailed the website that created the post, LeftScoop.com, to ask about the post and why the site did not include its sources but didn’t get a reply. The post was removed shortly after our inquiry.", "The LeftScoop.com article starts by using several slightly edited paragraphs from a June 22 story from the Santa Barbara Independent, a weekly alternative newspaper based in Santa Barbara, Calif. \"Labor shortage leaves $13 million in crops to rot in fields,\" the newspaper article’s headline read. The LeftScoop.com post also borrows from a 2017 Mother Jones article.", "The Independent’s story said that the county’s agricultural industry has suffered labor shortages from 15 to 26 percent annually for five consecutive years. It cited Grower-Shipper Association of Santa Barbara and San Luis Obispo Counties statistics that said $13 million worth of strawberries, broccoli and other produce were plowed under, up from $4.4 million worth five years ago. Other outlets have cited the Independent story when writing about the subject.", "LeftScoop.com’s post implied Trump was largely to blame for the lost crops because he had scared off Mexican migrant workers with his tough policies, causing the labor shortages.", "That’s wrong.", "Claire Wineman, the Grower-Shipper Association’s president, told us Santa Barbara County has been experiencing the same lack of workers felt by agricultural areas across California and the United States.", "The dollar figure in the story came from an annual survey the Grower-Shipper Association sent to local farmers, asking them to quantify how much gross revenue they estimated they had lost due to a lack of a sufficient number of field workers. The total from 68 respondents amounted to $13.5 million for the 2015 calendar year.", "Trump took office Jan. 20, 2017.", "\"We absolutely have been experiencing labor shortages over the last few years,\" Wineman said. The Independent’s story, she said, did a fair job of describing the reasons, which go back years before Trump took office.", "One thing the Independent story (and therefore the LeftScoop.com post) did misrepresent was in the headline, Wineman said. The survey didn’t determine whether the crops went unharvested and rotted in the fields.", "\"We didn’t survey what happened, we only asked how much revenue was not realized because of a lack of workers,\" Wineman said. \"We just don’t know that.\"", "LeftScoop.com said, \"Over $13 million worth of crops have ROTTED in California, all because no one is willing to work jobs vacated by migrants.\"", "The post, which has since been removed, is almost entirely copied from uncredited articles from two more reputable news outlets.", "There is a labor shortage in central California’s agricultural corridor, but that $13 million is just for Santa Barbara County, not the whole state, as was implied. The association that determined the total also noted there was no data on whether the crops had really been left to rot in fields. The dollar figure was measured through a survey of farmers’ potential lost revenue.", "As for the reasons for the shortage, LeftScoop.com drastically oversimplifies the issue in the text by interjecting that Trump’s immigration policies are to blame for a lack of migrant workers. For starters, the data is from 2015, more than a year before Trump became president.", "This post is partially accurate, but not much more. We rate it Half True.", "LeftScoop.com, \"Over $13 Million Worth Of Crops Have ROTTED In California, All Because No One Is Willing To Work Jobs Vacated By Migrants,\" June 28, 2017", "PolitiFact, \"Has Barack Obama deported more people than any other president in U.S. history?,\" Aug. 10, 2012", "Pew Research Center, \"More Mexicans Leaving Than Coming to the U.S.,\" Nov. 19, 2015", "PolitiFact, \"Interior deportations down, at a 9-year low, border group says,\" Aug. 5, 2016", "Pew Research Center, \"U.S. immigrant deportations declined in 2014, but remain near record high,\" Aug. 31, 2016", "PolitiFact, \"Trump right on Obama's deportation numbers, wrong about nobody talking about it,\" Oct. 21, 2016", "Los Angeles Times, \"Wages rise on California farms. Americans still don’t want the job,\" March 17, 2017", "PolitiFact, \"Is illegal immigration the lowest in 17 years, as Trump said?,\" April 25, 2017", "Pew Research Center, \"5 facts about illegal immigration in the U.S.,\" April 27, 2017", "Los Angeles Times, \"Desired for their labor, rejected as neighbors. Farmworkers in California face hostile communities,\" June 2, 2017", "Santa Barbara Independent, \"Labor Shortage Leaves $13 Million in Crops to Rot in Fields,\" June 22, 2017", "Mother Jones, \"Trump’s Crackdown on Immigration Is Terrible News for Anyone Who Eats Food,\" June 26, 2017", "New York, \"Trump Administration Considering Plan to Expand and Expedite DHS Deportation Powers,\" July 15, 2017", "USA Today, \"Immigration arrests up, deportations down under Trump,\" July 17, 2017", "U.S. Department of Homeland Security, \"Yearbook of Immigration Statistics 2015,\" accessed July 18, 2017", "Interview with Kelsey Brugger, Santa Barbara Independent reporter, July 20, 2017", "Interview with Claire Wineman, Grower-Shipper Association of Santa Barbara and San Luis Obispo Counties president, July 20, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]