["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Alliance Defending Freedom Tweet of Aug. 3, 2015", "Covertly filmed videos showing fake brokers discussing terms for procuring fetal tissue have prompted federal efforts to defund Planned Parenthood, led to a statewide inquiry into how the group disposes of such tissue in Georgia and apparently created some confusion among voters.", "One reader forwarded us a Tweet from the Alliance Defending Freedom that shows two national maps side by side, wondering how mammograms play into the abortion debate.", "The first map purports to pinpoint the 8,000-plus mammography facilities licensed by the U.S. Food and Drug Administration.", "The second map lacks a single dot, to show the number of licensed facilities run by Planned Parenthood.", "\"Zero Planned Parenthood facilities are licensed to do mammograms,\" the Tweet read. \"Planned Parenthood, women don’t need you!\"", "Our reader wanted to know, is it a false flag to talk about essential women’s health care such as mammograms in the debate over Planned Parenthood? PolitiFact has been down this road before, but it’s worth a repeat trip given the defunding debate stirred by those stealth videos.", "The anti-abortion group Center for Medical Progress says its videos show Planned Parenthood proposes to illegally sell fetal tissue, something that Planned Parenthood adamantly denies.", "PolitiFact recapped the facts in that controversy here.", "Two state agencies have since reported that abortion clinics in Georgia are properly disposing of aborted fetuses and fetal tissue. Among the 12 clinics found to be following state law was the sole facility run by Planned Parenthood Southeast in the state, in Augusta.", "But on the federal level, the effort by congressional Republicans to strip $500 million in annual funding to Planned Parenthood has drawn more ire on both sides of the issue.", "Critics of Planned Parenthood say the videos show the organization has questionable practices. Supporters denounce the effort as an effective cut to women’s health care, citing the gynecological, referral and medical services the agency also provides.", "Casey Mattox, the senior counsel at the anti-abortion Alliance Defending Freedom, said he was attempting to cut off that debate by using the maps to point out that Planned Parenthood does not provide mammograms.", "\"You can’t go there and actually get a mammogram, which is what most people assume when they hear you can go there and get cancer screenings for breast health,\" Mattox said. \"That is, at best, misleading, if not directly false.\"", "Mattox pointed us to the Food and Drug Administration’s list of facilities licensed to perform mammograms under the Mammography Quality Standards Act. The agency certifies the facilities across the nation and in military bases worldwide.", "The list, updated weekly, includes more than 8,700 facilities. A representative from the FDA did not get back to us by deadline, but a search of the list does not yield any facilities with the official \"Planned Parenthood\" name in its title.", "Planned Parenthood spokeswoman Liz Clark confirmed why: The organization does not provide mammograms at any of its health centers.", "(One caveat: some clinics have brought in mobile mammography vans to clinic sites for special events. But none of the machines were a permanent part of a Planned Parenthood center).", "So Mattox is correct, by Planned Parenthood’s own acknowledgement, that the organization does not provide mammograms.", "But does that mean there is no need for Planned Parenthood when it comes to accessing the tests?", "The answer to that is far less clear but provides the context that shows why the overall argument is muddled.", "Planned Parenthood provided 487,029 breast exams or breast care services in 2013, the most recent year available.", "Based on those clinical exams and a doctor assessing risk factors, the group refers patients for mammograms and/or specialist follow-ups for procedures such as biopsies and, in some cases, financial assistance, Clark said.", "In that regard, Planned Parenthood functions mostly as a privately paid OB-GYN would in referring a patient for a service the doctor’s office didn’t provide.", "\"Focusing on one narrow data point to create a false ‘gotcha’ moment ignores the larger picture of how Planned Parenthood both provides and connects millions of people to health care in communities across the country,\" Clark said.", "\"The graphic is misleading because I wouldn’t walk into a mammogram facility to get a mammogram without first visiting my OB-GYN for an exam and a referral -- which is what Planned Parenthood provides,\" she added.", "Mattox said there is no reason, though, that Planned Parenthood must serve as the referring agency. According to the Charlotte Lozier Institute, there are more than 13,000 clinics nationwide that provide comprehensive health care for women and could at least provide referrals and, in some cases, the mammograms themselves.", "The pressure to \"defund\" Planned Parenthood is actually to redirect the federal money to those other facilities, Mattox said.", "\"It’s nothing unique to Planned Parenthood if all they are doing is a referral,\" he said. \"There are other health center options, with licenses that can do this directly on site. If you go to Planned Parenthood, you need to know you are not going to get that.\"", "Dr. Otis Brawley, the chief medical officer at the American Cancer Society, agrees that Planned Parenthood does not need to be the referring physician for a mammogram.", "But the standard is for a doctor to provide the clinical, physical exam and then refer the patient for the screening at a mammography center – and it has been since 1970, Brawley said.", "Various risk factors determine referrals, as does the patient’s age. For women between 20 and 40, a doctor will order a mammogram if an abnormality is detected or suspected during the physical exam.", "For women older than 40, even a normal exam generally triggers a screening mammogram, Brawley said.", "\"I’ve personally had patients who went to Planned Parenthood and got a referral that was also a voucher, so that the mammogram was paid for as well,\" Brawley said. \"The first step is always to see a doctor, but there are cases where the referral was also a way for Planned Parenthood to reimburse the outside facility for the mammogram screening.\"", "Our ruling", "Covert videos showing discussions of fetal tissue sales have reignited the abortion debate nationally and in Georgia.", "In an effort to debunk defenders that Planned Parenthood provides essential women’s health services in addition to abortions, an anti-abortion group claimed that none of the organization’s clinics is licensed to provide mammograms.", "Federal data and Planned Parenthood’s own documents back up the claim from the Alliance Defending Freedom.", "However, that narrow bit of information ignores that Planned Parenthood physicians perform the clinical exams that lead to referrals for a mammogram or other specialized breast care.", "The physical exam is a necessary step in the process of getting the screening, although ADF has a valid point that other physicians could provide that piece of the process.", "That puts the claim in the realm that won’t make either side happy: partially accurate but misleading without additional details. We rate the claim Half True.", "Alliance Defending Freedom Twitter post, Aug. 3, 2015", "The Atlanta Journal-Constitution, \"Georgia abortion clinics dispose of tissue properly, state finds,\" Aug. 17, 2015", "The Atlanta Journal-Constitution, \"Georgia abortion providers dispose of fetal remains properly, state finds,\" Aug. 12, 2015", "Planned Parenthood, 2013-2014 Annual Report, December 2014", "PolitiFact, \"97% of Planned Parenthood's work is mammograms, preventive care, O'Malley says,\" Aug. 3, 2015", "PolitiFact, \"Barack Obama, critics clash on whether Planned Parenthood provides mammograms,\" Oct. 30, 2012", "U.S. Food and Drug Administration, FDA Certified Mammography Facilities, accessed Aug. 18, 2015", "Alliance Defending Freedom, Department of Health and Human Services Freedom of Information response, June 4, 2012", "The Charlotte Lozier Institute, \"Planned Parenthood and Federally Qualified Health Centers,\" July 31, 2015", "Phone and email interview, Casey Mattox, senior counsel, Alliance Defending Freedom, Aug. 18, 2015", "Phone and email interview Liz Clark, spokeswoman, Planned Parenthood Federation of America, Aug. 18, 2015", "Phone and email interview, Dr. Otis Brawley, chief medical officer, American Cancer Society, Aug. 19, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]