["Multiple Facebook posts, for example this one which has been shared hundreds of times since it was posted January 13, 2019, contain a video which shows tigers mauling a man.", "The post is captioned: “Tiger attack on people in a picnic at Daringbadi, Odisha.”", "Another January 12, 2019 Facebook post shares the same video with a caption saying: “Picnic party attacked by the wild tigers today at Daringibadi, Kandhamal Dist., Odisha, India.”", "The same video and claims have been posted on YouTube, for example here and here, where they have been viewed tens of thousands of times.", "A reverse image search using keyframes from the misleading video obtained through Invid found that the footage actually showed a 2017 incident in China, which was widely reported in local and international media at the time.", "Here is an AFP report on the January 29, 2017, incident. The story is headlined: “Tiger kills man at China zoo as horrified visitors watch.”", "“A tiger killed a visitor to a wildlife park in eastern China on Sunday after the man apparently entered its enclosure, the second such attack in just six months,” the report datelined Shanghai said.", "“The incident occurred at the Youngor Wildlife Park in the city of Ningbo, about 200 kilometres (125 miles) south of Shanghai, according to media reports which added that one tiger in the enclosure was shot dead as a result,” the AFP report said.", "The exact same footage that is used in the misleading Facebook post was published on YouTube on January 29, 2017, by China Global Television Network (CGTN) as part of its coverage of the Youngor Wildlife Park incident.", "Here is another media report on the incident in Britain's Telegraph which says the victim, identified only by his surname of Zhang, climbed a wall to enter the tiger enclosure before he was attacked. He later died in hospital, the report says.", "The misleading Facebook posts prompted an investigation by forest officials and police in Daringbadi, according to this January 12, 2019 local media report.", "Authorities said that nobody was injured in a tiger attack in Daringbadi in January 2019, according to the Orissa Post report.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]