["This video, which has been viewed more than 89,000 times on Instagram since it was posted on April 11, has a caption that says: \"Good evening friends. We have news from abroad. Enjoy. I found it hard to translate what they say in the clip because they speak very quickly. But it primarily says that Prabowo is superior to Jae... That's what the clip basically about.\"", "Below is a screenshot of the Instagram post:", "“Jae” references Widodo. On social media, Subianto supporters frequently refer to the incumbent using the terms “Jae” or “Jaenudin Nachiro”. Here is a December 6, 2018, Detik.com story on the issue.", "The text running across of the bottom of the video says in English: \"SUBIANTO MAY ENTER INDONESIAN RACE.\"", "Entering that text into a Google search, AFP traced the clip back to this February 27, 2018, footage posted on the Bloomberg website.", "The exact same footage that is used in the misleading Instagram post appears in the original Bloomberg report from 0:07 to 1:04.", "Below is a side-by-side comparison of screenshots of the video in the misleading Instagram post and the actual Bloomberg clip:", "Neither the original Bloomberg report not the clip in the misleading Instagram post say that Subianto \"is superior to\" Widodo.", "The newscaster says: “Former general Prabowo Subianto may enter the race in Indonesia, which would be a rerun of the bitter 2014 race won by Joko Widodo.”", "The Indonesian word \"unggul\" used in the Instagram caption can also be translated to \"leading ahead of\".", "The news program does not mention any survey putting the challenger ahead of the incumbent.", "Subianto and Widodo are running in the presidential election on April 17, 2019. Here is the election commission’s website that lists the candidates.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]