["About this rating", "In the summer of 2020, readers asked Snopes about the accuracy of online articles that claimed Ford Motor Co., while receiving millions of taxpayer dollars for providing law enforcement agencies with vehicles, was at the same time donating millions of dollars — through the Ford Foundation — to fund efforts to \"defund the police.\"", "For example, on July 7, right-leaning website 100% Fed Up posted an article with the headline, \"Revealed: Ford Motor Co. Donates Millions to 'Defund the Police' Movement While Making Millions From Selling Vehicles to Police Departments.\" The article claimed that:", "\"Ford Motor Company currently provides about 65 percent of police vehicles in the US... Meanwhile, in New York City, the Ford Foundation is proudly taking part in the Defund the Police movement on its website: 'We’ve seen our grantees at the forefront of the change that’s taken place over the last few days — from the City Council of Minneapolis’s pledge to dismantle the police department to reimagine public safety, to Mayor Garcetti’s commitment to divest $250 million of the LAPD’s budget.'", "\"...As the Foundation’s campaign gains traction, how will owners of America’s 3,000 Ford dealerships feel about the association of their brand with efforts to Defund the Police in their own hometowns? And how will the Defund efforts carried out by the Foundation impact the sale of those new high-tech police vehicles the Ford Motor Company is rolling out?\"", "That post was largely copied and pasted from an earlier article on The National Pulse, a right-leaning website whose editor is Raheem Kassam, a former activist in the far-right U.K. Independence Party who now co-hosts the \"America's Voice\" show called \"War Room\" with Steve Bannon, former senior adviser to U.S. President Donald Trump.", "In a July 8 \"War Room\" segment, Kassam neatly summarized the duplicitousness of which he and others accused the Michigan-based company:", "\"...Henry Ford III, who's also on the board of Ford Motors, he's out there saying that the American story has systemic racism and violence at its heart, and that the police need to be defunded as a result of this. And all the while, the Ford Motor Company — upon whose board he also sits —  coins in hundreds of millions, if not billions and billions of dollars from the taxpayer, by selling police cruisers to the police, to your local police force, to national — to federal law enforcement agencies — taking from the taxpayer, on one hand, and giving money to defund the police, on the other...\"", "The National Pulse article also formed the basis of a similar post on the website LawOfficer.com.", "The claim that Ford's income from providing vehicles to law enforcement agencies was linked to the Ford Foundation's donations to nonprofit and activist groups was false. The two entities are separate and mutually independent, as Ford explained in a statement provided to 100% Fed Up, The National Pulse and LawOfficer.com. The statement read:", "\"Ford Motor Company and the Ford Foundation are completely separate entities and have operated independent of each other since the mid-1970s. Ford has no control of the Ford Foundation’s grant-making policies or decisions. Ford’s charitable arm is the Ford Motor Company Fund. Ford is proud to be America’s long-time leader in producing police, emergency and first responder vehicles. Our Police Interceptor vehicles are by far the top choice of law enforcement and other emergency services agencies across the country.", "\"To be clear, Ford believes racism, abuse of power and repression in law enforcement must be addressed and stamped out wherever they exist. Good law enforcement agencies and officers play a critical positive role in our communities, but safety and fairness must be inclusive of all, everywhere. Contrary to some misinformed stories online, neither Ford Motor Company nor the Ford Motor Company Fund has provided funding to any campaign to 'defund the police.' Rather, through technology and innovation, Ford will continue to play a positive role in promoting more safety and accountability in policing and produce even safer police vehicles. Ford will continue to work closely with local and state police associations across the country on positive solutions.\"", "All three websites later updated their reports to reflect the clarification provided by Ford.", "The claim that the Ford Foundation has donated millions of dollars towards the aim of \"defunding police\" has an element of truth to it. The foundation has given grants to several groups and initiatives which have supported or promoted the rhetoric of defunding or abolishing police forces, whatever the precise details of their respective proposals around law enforcement and criminal justice.", "For example, as Kassam alluded to in his broadcast, the Ford Foundation has provided funding for the Black Youth Project, also known as BYP100. That group has repeatedly promoted the rhetoric of defunding and abolishing the police. In 2019 and 2020, the foundation gave BYP100 a total of $815,000 in grants. The Ford Foundation also provided further, indirect funding for BYP100, through the \"Transforming movements fund\" administered by Borealis Philanthropy, a philanthropic intermediary.", "Through various funds overseen and administered by Borealis, the Ford Foundation has also indirectly funded other groups and projects which have explicitly called for defunding, divesting, or abolishing police, such as: the Black Lives Matter Global Network; the Center for Neighborhood Leadership (now known as Poder in Action); and Freedom, Inc.", "Information about the groups and projects supported by the Ford Motor Company Fund can be found here.", "100 Percent Fed Up.  \"Revealed: Ford Motor Co. Donates Millions to 'Defund the Police' Movement While Making Millions From Selling Vehicles to Police Departments.\"\r\n  7 July 2020.", "Rachmuth, Sloan.  \"Revealed: Ford Motors Makes Millions From Police Cruisers While the Ford Foundation Donates Millions to 'Defund the Police.'\"\r\n  The National Pulse.  7 July 2020.", "BBC News.  \"UKIP's Steven Woolfe and Raheem Kassam to Stand for Leadership.\"\r\n  5 October 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]