["By Eugene Kiely and Rem Rieder", "Posted on September 25, 2020", "In the past 48 hours, President Donald Trump repeatedly has refused to commit to a peaceful transfer of power if he loses, claiming that mail-in voting is a “disaster” and “out of control” and suggesting without evidence that Democrats are going to steal the election.", "The president repeatedly sows doubt about mail-in voting, echoing what intelligence officials have said is a Russian strategy to undermine public trust in the election.", "At a Sept. 23 press briefing, the president said “we’re going to have to see what happens,” when he was asked if he would commit to a peaceful transfer of power. “Get rid of the ballots,” he said, and there would be a “very peaceful … continuation” of power.", "“The ballots are out of control,” he said of mail-in ballots. “You know it. And you know who knows it better than anybody else? The Democrats know it better than anybody else.” He doubled down the next day, saying mail-in ballots are “a whole big scam” when asked if he would only accept the election results if he wins.", "“We want to make sure the election is honest, and I’m not sure that it can be,” he told reporters on Sept. 24. “I don’t know that it can be with this whole situation — unsolicited ballots. They’re unsolicited; millions being sent to everybody. And we’ll see.”", "We have been tracking the president’s remarks about mail-in voting. In late July, we wrote a story — “The President’s Trumped-Up Claims of Voter Fraud” — recapping his numerous false, misleading and unsupported claims to date about mail-in ballots. At the time, Trump had suggested the 2020 election should be postponed, claiming mail-in voting this year will result in the “most INACCURATE & FRAUDULENT Election in history.”", "Since then, the president has ramped up his attacks on mail-in voting on a near-daily basis. His attacks come despite a U.S. intelligence bulletin issued to law enforcement agencies on Sept. 3 warning that Russia wants “to undermine public trust in the electoral process” by “amplifying criticisms of vote-by-mail,” as first reported by ABC News.", "At a Sept. 17 hearing, FBI Director Christopher Wray warned that “the steady drumbeat of misinformation … will contribute over time to a lack of confidence of American voters and citizens in the validity of their vote.”", "Here we recap the many stories we have done this year on the president’s false, misleading and unsupported statements about the potential for voter fraud.", "We also reviewed his statements about mail-in ballots this month and found he has been repeatedly spreading misinformation in particular about foreign governments making up “counterfeit ballots” and Democrats sending out “unsolicited ballots” to rig the election. He also has been repeatedly spreading false information about Nevada, saying he will “win this state easily,” if not for mail-in ballots — even though Trump lost Nevada in 2016 and is trailing in the polls there again this election.", "In June, we wrote about Trump’s unfounded claim that “MILLIONS OF MAIL-IN BALLOTS WILL BE PRINTED BY FOREIGN COUNTRIES,” resulting in a “RIGGED” election.", "At the time, experts told us there are numerous logistical hurdles, such as reproducing ballots in multiple jurisdictions, and security safeguards, such as bar codes and signature checks, that would prevent a foreign government from slipping large numbers of fraudulent ballots past election officials. Those safeguards make such a plan highly unlikely to result in fraudulent votes being cast, experts say, and certainly not enough to sway a presidential election.", "Richard L. Hasen, a professor of law and political science at the University of California, Irvine School of Law and author of “The Voting Wars,” told us that the kind of massive fraud described by Trump is “farcical.”", "After we wrote our story, U.S. intelligence officials in a background briefing with reporters said they have not seen any foreign attempts to counterfeit mail-in ballots.", "Similarly, Deputy Attorney General Jeffrey A. Rosen said in an Aug. 26 discussion with the Center for Strategic & International Studies: “We have yet to see any activity to prevent voting or to change votes, and we continue to think it would be extraordinarily difficult for foreign adversaries to change vote tallies.”", "Regardless, the president continued to repeat unfounded claims about millions of foreign-made counterfeit ballots. Using Factbase, a nonpartisan website that tracks Trump’s public comments, we found he has made at least five such claims so far in September.", "Trump on ‘counterfeit ballots’", "And if foreign countries want to, this is an easy system to break into because they’ll do counterfeit ballots. They’ll do counterfeit ballots by the millions. – Sept. 23, White House meeting with state attorneys general", "And, you know, when they talk about Russia, China, and all these others, they will be able to do something here because paper ballots are very simple — whether they counterfeit them, forge them, do whatever you want. It’s a very serious problem. — Sept. 22, remarks to reporters", "But Chris, you don’t see any activity from China, even though it is a FAR greater threat than Russia, Russia, Russia. They will both, plus others, be able to interfere in our 2020 Election with our totally vulnerable Unsolicited (Counterfeit?) Ballot Scam. Check it out! – Sept. 17 tweet, in response to Wray’s testimony that day about Russian interference in the 2020 election and resulting in a Twitter warning label (“Learn how voting by mail is safe and secure”)", "Unsolicited Ballots are uncontrollable, totally open to ELECTION INTERFERENCE by foreign countries, and will lead to massive chaos and confusion! – Sept. 17 tweet, resulting in a Twitter warning label", "The biggest problem we have right now are the ballots. Millions of ballots going out; that’s the biggest problem. When you talk about other countries, whether it’s China, Russia, or many others that get mentioned, they’re in a much better position with these paper ballots to do something than they would ever be under the old system. And that’s our biggest problem.” — Sept. 16, White House briefing", "For more, see “Trump’s Shaky Warning About Counterfeit Mail-In Ballots,” June 25.", "On Sept. 10, we wrote about the president’s false claim that Democrats are mailing out “80 million unsolicited ballots” so they can “harvest” votes to elect Democratic presidential nominee Joe Biden in November.", "As we wrote at the time, mail ballots will be sent automatically to eligible registered voters in only nine states and the District of Columbia. That’s about 44 million ballots — not 80 million — and they will be going to Republicans as well as Democrats and independents. Three of those states (Colorado, Oregon and Washington) have done the same thing in past elections, and two others (California and Utah) have done something similar.", "We don’t know where he got the 80 million figure, but voting experts expect that in total about 80 million mail-in ballots will be cast in the 2020 election — including by voters who request a ballot to vote, as is the case in most states.", "After we wrote our story, the president continued to push the baseless claim that Democrats are sending out “80 million unsolicited ballots,” or less specific claims about the Democrats sending out millions or tens of millions of “unsolicited ballots” to steal the election, despite there being no evidence of such widespread voter fraud.", "“We have not seen, historically, any kind of coordinated national voter fraud effort in a major election, whether it’s by mail or otherwise,” FBI Director Wray said at a Sept. 24 hearing, noting that historically it has occurred at the “local level from time to time.”", "The president has made at least 14 claims in the past two weeks about “unsolicited ballots.”", "Trump on ‘unsolicited ballots’", "Yeah, I think it’s a better name, Josh, because they said “universal ballots” and they had 15 different names. Didn’t mean — people said, “How does that have to do with being universal?” Unsolicited. Eighty million unsolicited ballots being sent all over the place. — Sept. 23, White House meeting with state attorneys general", "We need nine [Supreme Court] justices. You need that. With the unsolicited millions of ballots that they’re sending, it’s a scam; it’s a hoax. …  Because what they’re doing is a hoax, with the ballots. They’re sending out tens of millions of ballots, unsolicited — not where they’re being asked, but unsolicited. And that’s a hoax, and you’re going to need to have nine justices. – Sept. 22, speaking to reporters on South Lawn of White House", "And when you see them cheating on the other side, I don’t say if, when. When you see them cheating with those ballots, all those unsolicited ballots, those millions of ballots, you see them. Anytime you do, report them to the authorities. – Sept. 21, at a rally in Swanton, Ohio", "You have ballots that you go out and you can get, you could request as you know, you can request them and that’s fine. But if you’re not requesting them, when you get millions, about 80 million, they say, all over the United States, where the hell are they going? – Sept. 21, at a rally in Dayton, Ohio", "They used to say universal, but nobody knows what that means. Unsolicited, meaning people didn’t solicit these ballots. People are saying, hey, what’s going on? I just got a whole batch of ballots. They have no idea who they’re sending them to. You know they’re sending them to the wrong people. – Sept. 20, “Life, Liberty & Levin” on Fox News", "But, uh, so I, I think that, uh, yeah, they’re gonna do something, Dan. Something’s gonna happen, but you know what they’re doing? They’re trying to screw it all up with the ballots. So they have — I guess I’ve heard numbers from 50 to 80 million unsolicited ballots. That’s unsolicited. People aren’t asking for ’em. – Sept. 20, “The Dan Bongino Show”", "When you solicit, when you go out — it’s called “absentee” or “solicit.” When you go out and you request a ballot — you want to say, “I want to vote because I can’t be in Florida or I can’t be someplace.” You request. So you’re sending something in, it’s handled professionally, they send it back — it’s a whole thing. That’s much different than “unsolicited,” when you get millions of ballots. I heard numbers like 80 million ballots. – Sept. 18, White House briefing", "The big Unsolicited Ballot States should give it up NOW, before it is too late, and ask people to go to the Polling Booths and, like always before, VOTE. Otherwise, MAYHEM!!! Solicited Ballots (absentee) are OK. @foxandfriends — Sept. 17 tweet, resulting in a Twitter warning label", "The worst campaign, most dishonest campaign I’ve ever seen, and the ballots, and well you see were that these unsolicited ballots. — Sept. 17, Clay Travis interview", "Take a look at what’s happened over the last year with this same kind of thing, except in a very small setting with very few ballots going out, so that’s much easier; not 53 to 80 million going out. — Sept. 16, White House press briefing", "The Unsolicited Mail In Ballot Scam is a major threat to our Democracy, & the Democrats know it. Almost all recent elections using this system, even though much smaller & with far fewer Ballots to count, have ended up being a disaster. Large numbers of missing Ballots & Fraud. — Sept. 12 tweet", "In the country they’re going to send out 80 million unsolicited, in other words people that don’t even know what a ballot is, all of a sudden here comes the ballot. … A lot of people use the word absentee. Get an absentee ballot where you request it, it comes to you, you vote and you send it back. That’s different. But they’re just sending out — all over they’re sending out 80 million ballots. — Sept. 12, Jeanine Pirro interview on Fox News", "They send 80 million ballots out. Where are they going? Who are they sending them to? Are they sending them to certain areas and not other areas? Are they sending them to Democrat areas? These are all controlled by Democrat governors, like your politically motivated governor. … They should make people — if you register, if you want a solicited ballot, that’s where you ask for it. You have to sign papers. You get it ’cause you can’t be there. That’s one thing. When they sent 80 million ballots to people, they have no idea where they’re going. – Sept. 12, at a rally in Minden, Nevada", "Sending out 80 MILLION BALLOTS to people who aren’t even asking for a Ballot is unfair and a total fraud in the making. Look at what’s going on right now! — Sept. 10 tweet", "For more, see “Trump’s Latest Bogus Talking Point on Voter Fraud,” Sept. 10.", "During September, Trump has repeatedly assailed mail-in voting in Nevada, with Democratic Gov. Steve Sisolak a particular target of his criticism. Trump has repeatedly said that Sisolak, whom he called a “political hack,” is “in charge of ballots.”", "But that isn’t the case. As is true elsewhere, the actual mechanics of the election under Nevada state law are overseen by the secretary of state. And in this case that is Barbara Cegavske — a Republican. She is the state’s third-highest elected official and doesn’t work for the governor.", "Sisolak provoked the president’s ire in August when he signed a bill passed by the Democratic-controlled Legislature calling for mail ballots to be distributed to all active registered voters during a state of emergency or declaration of disaster, such as the COVID-19 pandemic. So those voters will automatically receive them for the November election. These would be the “unsolicited ballots” that Trump fumes about.", "The bill was passed in the wake of limited polling places and long lines during Nevada’s primary in June because of the pandemic.", "Heightening the tension between the two men, Sisolak criticized Trump as “reckless and selfish” for holding a large indoor political rally in Henderson, Nevada, on Sept. 13 in violation of state rules. Trump charged that Sisolak tried to prevent him from holding rallies at other sites. While two planned rallies were cancelled, there is no evidence Sisolak was involved in those decisions.", "Here are the president’s distorted claims this month about the governor and his baseless warnings of a “100% rigged” general election in Nevada:", "Trump on ‘rigged’ Nevada election", "The governor of Nevada should not be in charge of ballots. The ballots are going to be a disaster for our country. And the governor of Nevada should not be in charge of ballots. When he won’t let us meet and congregate [for a rally] and do, really, a friendly protest, he should not be in charge of the ballots. You’re going to have problems with the ballots like nobody has ever seen before. — Sept. 15, speaking to reporters", "How can you have a [Nevada] governor with that kind of a take in charge of the ballots? So, you’re going to have millions of ballots. The man that tried to prevent us from getting a [rally] site. … Now, this is the same guy that’s going to be in charge of the ballots, OK. Do you think that’s fair? It’s millions of ballots are going out. He’s the governor of the state. Do you think it’s a fair thing, because I’m winning that state easily. But the one thing he can’t beat, if they cheat on the ballots. — Sept. 15, “Fox & Friends”", "We had great rallies this past weekend, after the Governor of Nevada worked very hard to cancel all of our venues. Despite the fact that he controls the state, he failed, but would have rather done rally outside. Can you imagine this man is in charge… …of the Ballots in Nevada!? Not fair, Rigged Election! @GovSisolak, will use every trick in the book to cheat with Ballots. — Sept. 14 tweet", "But you have a governor that just to have a rally made it very tough. So if he’s in charge of millions of ballots, you’re gonna a problem with this state. We’re gonna win this state easily, but when they send out millions of ballots to people that they don’t even know who they’re sending them to, or maybe they do know, and maybe that’s even worse, you’re gonna have a big problem with the state…. It’s a terrible thing. People wanna go to the poll or they wanna do a solicited ballot where they request a ballot, and they make a request, and they sign something, and it comes back, and they do it that way. But sending out millions of unsolicited ballots are, it’s unacceptable. … So you have a political hack who’s in charge of millions of ballots. That never works. — Sept. 12, interview with KTVN in Reno, Nevada", "He’s a, he’s a political hack. Let me just tell you. He’s in charge of ballots. There’s no way he’s gonna be honest about it. It, it’s a rig. It’s a rig. 100% rigged. I have no doubt about it in my mind. … The governor totally controls it. The governor’s the one who made it very difficult, and he controls it, and that’s okay. He wants to play that game, we’ll play the game. You know what the game is? The game is he’s also controlling ballots, and it’s a crooked operation. As far as I’m concerned, this is a rigged election. — Sept. 13, Las Vegas Review-Journal interview", "He’s playing games with ballots and I hope they’re watching him. I hope law enforcement is watching this guy. He’s a political hack. He’s got your state totally shut down and it’s really terrible. — Sept. 13, Latinos for Trump event in Las Vegas, Nevada", "I think we’re gonna win. I hope it’s gonna be in the evening of the 3rd, of November 3rd, and you know, the mail-in ballots, in this case of Nevada, they don’t even have to have their ballot in until seven days after the election, and I’m saying, “What is going on over here?” —Sept. 3, interview with WPXI in Pittsburgh", "As part of his attacks on Nevada’s new law that the governor signed, Trump has falsely charged that Nevada doesn’t require mail-in ballots to be signed and doesn’t require verification of the ballots that are signed. As we have reported, that is not the case.", "The law requires mail-in ballots to include valid voter signatures, which must be verified by election officials. The measure spelled out in more detail than previous laws the procedures for dealing with suspect signatures and provisions for allowing voters to verify them. But it did not change the signature requirement.", "Here are Trump’s false remarks in September about the signature requirements for mail-in voting in Nevada:", "Trump on Nevada’s signature requirement", "And, I mean, some of the states, they have no signature necessary, no verification necessary. Nevada, you don’t have to verify the signature. There’s no verification. It is a disgrace that this can happen. — Sept. 23, White House meeting with state attorneys general", "Now they have a new thing where they don’t want to verify signatures because that makes it easier to – so you don’t have to verify a signature. You see that one in Nevada. – Sept. 20, “Life, Liberty & Levin” on Fox News", "You have — in Nevada, you have a governor that signs something where he doesn’t even want verification of the signature. So what does that mean? So he doesn’t even want verification of the signature. So I think it’s going to be a terrible time for this country. — Sept. 18, White House press briefing", "Ballots with bad signatures. Ballots with no signatures. And in the case of Nevada, they don’t even want verification of the signature. It’s a disgrace. — Sept. 16, White House briefing", "They even have a provision where you don’t have to verify signatures. What is going on? — Sept. 3, campaign rally in Latrobe, Pennsylvania", "For more, see “Trump’s False Claim About Mail Ballot Signatures in Nevada,” Sept. 24.", "Here’s a list of other stories we have done this year on Trump’s distorted attacks on mail-in voting:", "Trump’s False Statement About Counting Ballots in Pennsylvania, Sept. 22. At a rally in Fayetteville, North Carolina, Trump falsely claimed that a Pennsylvania court had permitted election officials “to take as long as they want” to count mail-in ballots.", "Trump’s Bad Advice for Mail-In Voters, Sept. 4. Elections officials and voting experts say Trump gave bad advice when he encouraged mail-in voters to show up at polling places on Election Day and cast an in-person ballot if poll workers can’t confirm that their mail-in ballot was received.", "Trump Campaign Exaggerates Potential for Mail-in Voting Fraud After Election, Aug. 14. The Trump campaign claims there’s a potential for “massive fraud” in Nevada because the Postal Service doesn’t postmark the state’s prepaid return ballot envelopes. That’s false. USPS policy is to postmark all ballots.", "Trump’s Absentee vs. Mail-In Ballot Spin, June 19: Trump continues to draw false distinctions between mail-in and absentee ballots, claiming the former are rife with voter fraud while the latter — which he has used as president — require a voter to go through “a very strict process. The equivalent of going to a voting machine, or maybe even sometimes better.”", "More False Mail-In Ballot Claims from Trump, May 27: Trump falsely claimed that California will send mail-in ballots to “anyone living in the state, no matter who they are or how they got there” and “people that aren’t citizens.” California plans to send every registered voter in the state a mail-in ballot for the November general election, due to the potential threat of COVID-19.", "Trump’s False Tweet About Michigan Absentee Ballot Applications, May 20. Trump — in a tweet he later deleted — falsely claimed in May that Michigan’s Democratic secretary of state was “illegally” sending “absentee ballots to 7.7 million people” for this year’s primary and general elections.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]