["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A screenshot from an ad by the Coalition to Stop the Proposed Tax Hike Amendment.", "Currently, Illinois taxes all individual income at a flat rate of 4.95%.", "Approval of a constitutional amendment on the 2020 ballot would allow a new graduated rate structure to take effect, raising taxes for those earning more than $250,000.", "Corporations that do business in Illinois would also see their flat income tax rate increase under the plan.", "Most small businesses pass their profits on to their owners, so that money gets taxed at the individual level instead of the corporate rate.", "This means small business owners making more than $250,000 will pay more if voters approve the amendment. But they won’t see any more of an increase than those who make the same amount in other professions.", "Just 3% of Illinois taxpayers overall earn enough to see an increase under the plan, according to the Illinois Department of Revenue.", "An ad from a group opposing a constitutional amendment to change the way Illinois taxes income warns voters the proposal would hit large and small businesses alike.", "\"If approved, it would let the politicians immediately implement their plan to increase taxes on small businesses, farmers and large employers,\" the narrator says in an ad from the Coalition to Stop the Proposed Tax Hike Amendment.", "Currently, Illinois taxes all individual income at a flat rate of 4.95%. The amendment’s approval would allow a new graduated rate structure to take effect in 2021, raising taxes for those earning more than $250,000.", "Corporations that do business in Illinois would also see their flat-rate income tax rate increase from 7% to 7.99% under the plan. But most businesses, especially small ones, don’t pay the corporate tax. Instead, they operate as pass-through entities, which means their profits flow directly to the people who own them and get taxed as individual income.", "Just 3% of Illinois taxpayers overall earn enough to see an increase under the plan, according to the Illinois Department of Revenue. We wondered how different the picture could be for small businesses and their owners.", "Based on the way the tax plan is written, the ad is correct that corporations and at least some small businesses operating as pass-through entities would be affected, said Carol Portman, president of the nonpartisan Taxpayers’ Federation of Illinois.", "\"But who exactly is going to be impacted by that tax increase is where the rub is,\" Portman said. \"It's not an across the board increase on all small businesses. It's not an across the board increase on all farmers.\"", "Publicly available federal data isn’t specific enough to show how many small businesses would be affected, experts said. And state data analyzed by Democratic Gov. J.B. Pritzker’s administration has its own limitations.", "The data does suggest only a small share of Illinois’ 1.2 million small businesses would be affected by the tax plan, for the same reason most individuals wouldn’t see an increase: only those earning more than $250,000 would pay the plan’s higher rates. That’s 189,000 taxpayers overall, according to state data published by the Center for Tax and Budget Accountability, which supports the plan.", "A spokeswoman for the coalition pointed to individual income tax data from the Internal Revenue Service for upper-income tax returns reporting different kinds of business income.", "\"Based on IRS data, there are more than 100,000 small businesses in our state, including sole proprietorships, partnerships and S Corporations, that would be impacted by the proposed rates,\" spokeswoman Lissa Druss wrote in an email.", "Druss explained the coalition reached that figure by adding up the number of upper-income tax returns for different categories of pass-through income, then making reductions to account for data limitations. For instance, the IRS doesn’t have an income bracket beginning at $250,000. Instead, its upper-income brackets begin at $200,000, which makes it difficult to determine which taxpayers would be affected.", "Experts suggested an even bigger problem with the published IRS data.", "\"The table doesn’t tell you anything about small businesses,\" said Eric Toder, co-director of the Urban-Brookings Tax Policy Center and a former director of research at the IRS. \"It tells you about the number of tax filers who have some business income.\"", "The dataset doesn’t show how many separate filers have income from the same business, from how many separate businesses individual filers are drawing income, or how much of those filers’ income is coming from other sources such as wages, Toder said. Filers may also have multiple kinds of business income, so adding up the categories risks counting the same taxpayer twice.", "Pritzker has led the push to switch Illinois to a graduated income tax. So we also reached out to his administration to ask for its numbers.", "Cameron Mock, chief of staff for the Governor’s Office of Management and Budget, shared an analysis he conducted for the governor’s team based on 2016 data from the state’s Department of Revenue.", "That analysis estimated at least 95% of small businesses in the state will see no increase under the plan based on the number of them reporting less than $250,000 in net income, along with an assumption that a small share of owners whose businesses net less still make enough from other sources to push them over that threshold. But here too the numbers are not an exact match.", "Mock only counted the nearly half million Illinois businesses that file with the state as either partnerships or S-Corporations, which are businesses that pass along their incomes — and most of their tax bills — to shareholders. He did not count sole proprietors, because the state does not have data identifying them. S-corporations and partnerships may also have multiple owners splitting up the profits, but the analysis assumed just one individual was paying taxes for each because state data does not show how many separate taxpayers derive income from them, Mock said.", "J. Fred Giertz, an economist with the Institute of Government & Public Affairs at the University of Illinois, said the fact small business income is largely taxed at the individual level means it doesn’t matter that available data can’t tell us exactly how many would be affected.", "\"There's no particular reason why you should say, ‘I really feel sorry for the small business owner who's making a million dollars but I don't feel sorry for the opthamologist or the corporate lawyer who's making the same amount of money,’\" Giertz said. \"If you think the tax is good then they should be paying the tax. If you don't think that people above $250,000 should be paying the higher tax, it should not apply to anyone.\"", "The coalition’s ad says approving the amendment \"would let the politicians immediately implement their plan to increase taxes on small businesses, farmers and large employers.\"", "Corporations will see an increase in their flat-rate income tax under the plan that takes effect if the amendment is approved. But only a wealthy subset of small businesses, which generally pass their profits to shareholders, would be affected — and data suggests that portion would be small.", "We rate this claim Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Ad, Coalition to Stop the Proposed Tax Hike Amendment, Aug. 21, 2020", "Public Act 101-0008, Illinois General Assembly", "\"A(nother) Business Income Tax Primer,\" Taxpayers’ Federation of Illinois, September/October 2019", "Emails and phone interviews: Sam Salustro, spokesperson for the Illinois Department of Revenue, Sept. 18 - Sept. 29, 2020", "Phone interviews: Carol Portman, president of the Taxpayers’ Federation of Illinois, Sept. 10 & Oct. 1, 2020", "2020 small business profile for Illinois, U.S. Small Business Administration", "\"Small Businesses Won’t Suffer Because of the Fair Tax,\" Center for Tax and Budget Accountability, May 12, 2020", "Phone interview: Allison Flanagan, research associate at the Center for Tax and Budget Accountability, Sept. 11, 2020", "Emails and phone interviews: Lissa Druss, spokesperson for the Coalition to Stop the Tax Hike Amendment, Sept. 9 & 11, 2020", "Individual income tax data for Illinois in tax year 2017, Internal Revenue Service", "Email and phone interview: Eric Toder, co-director of the Urban-Brookings Tax Policy Center, Sept. 16 & Oct. 1, 2020", "Phone interview: Richard Prisinzano, director of policy analysis at the University of Pennsylvania's Penn Wharton Budget Model, Sept. 22, 2020", "Phone interview: Cameron Mock, chief of staff for the Governor's Office of Management and Budget, Sept. 18, 2020", "Analysis of Illinois Department of Revenue data for tax year 2016 by Cameron Mock for the Governor's Office of Management and Budget", "Phone interviews: J. Fred Giertz, economist with the Institute of Government and Public Affairs at the University of Illinois, Sept. 17 & Oct. 1, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]