["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• A photo shows members of the D.C. National Guard at the Lincoln Memorial, not the Capitol.", "• The central claim of the post is valid. During the June 2020 Black Lives Matter Protests, police used riot control tactics meant to dominate the crowd. During the Jan. 6 insurrection at the Capitol, law enforcement was filmed treating the pro-Trump mob with relative restraint. ​", "A social media post pairs two photos in order to highlight the stark differences in the police response to the Black Lives Matter protests and the violent insurrection at the Capitol on Jan. 6, 2021.", "One of the photos shows rows of D.C. National Guard troops in riot gear stationed at the steps of a building.", "The second shows a few police officers in bike helmets heavily outnumbered by a mob of Trump supporters.", "\"Just a reminder, the 1st image was the capitol’s security during a Black Lives Matter protest, the second is from today,\" reads the post.", "The post contains a factual error: The first photo depicting rows of National Guard troops was taken at the Lincoln Memorial, not the Capitol. ABC News Correspondent Martha Raddatz took the photo on Jun. 2, at the height of the Black Lives Matter protests and posted it to Twitter.", "\"Your Lincoln Memorial this evening,\" reads the original caption.", "A similar photo posted to Getty Images possesses a caption specifying that it was taken at the Lincoln Memorial and not the Capitol.", "Despite this inaccuracy, the central thrust of the post has validity. There were documented differences in the way police handled the violent attack on the Capitol and the Black Lives Matter protests in the summer of 2020.", "After Minneapolis police killed George Floyd, police deployed harsh riot control tactics on protesters calling for justice and police brutality in Washington, D.C. and across the nation. In some cases, law enforcement officers rushed peaceful protesters with shields, sprayed them with chemical irritants, and shot them with rubber bullets.", "By contrast, law enforcement members were photographed and filmed displaying relative restraint during the storming of the Capitol, helping rioters down the steps and, in one instance, pausing to snap a selfie with an insurrectionist.", "\"The speed of the escalation of force was markedly slower (during the insurrection) than what we saw during Black Lives Matter,\" said Michael Sierra-Arévalo, a professor at the University of Texas-Austin who studies policing.", "A grave exception occurred when a Capitol Police officer shot and killed a woman as she attempted to break into the Speaker’s Lobby on Jan. 6.", "A post on Facebook seeks to compare police presence at the U.S. Capitol on Jan. 6, 2021, with police response to Black Lives Matter demonstrations in D.C. in June 2020. But it shows a picture taken in front of the Lincoln Memorial and says, \"Just a reminder, the 1st image was the capitol’s security during a Black Lives Matter protest.\"", "That’s wrong, though the central thrust of the post — that police presence on Jan. 6 was far lighter than that over the summer — has merit. The statement contains an element of truth but ignores critical facts that would give a different impression.", "We rate this claim Mostly False. ​", "A Facebook post, Jan. 6, 2021", "Alafair Burke, Tweet, Jan. 6, 2021", "Interview with Michael Sierra-Arévalo, professor of sociology at the University of Texas-Austin, Jan. 7, 2021", "Martha Raddatz, Tweet, Jun. 2, 2020", "PolitiFact, Black Lives Matter protests and the Capitol assault: Comparing the police response, Jan. 8, 2021", "Timothy Burke, Tweet, Jan. 6, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]