["About this rating", "Photographs supposedly showing official merchandise from Concordia University of Michigan that featured the school's acronym, C.U.M., went viral on social media in November 2020:", "This rumor also spread via a viral TikTok video:", "While the above-displayed media does feature genuine products that are available to purchase on websites such as PrepSportswear.com, these products are not official school merchandise.", "For starters, the name of the school at the center of this rumor isn't actually \"Concordia University of Michigan.\" This school's name is \"Concordia University of Ann Arbor,\" a satellite campus of Concordia University Wisconsin located in the town of Ann Arbor, Michigan. The official acronym for this school is CUAA — not CUM.", "Here's a screenshot of the school's Twitter bio, which features a banner for CUAA Athletics:", "We were also unable to find any products featuring the lewd acronym on the school's official apparel page.", "Lisa Liljegren, Concordia University Wisconsin's assistant vice president of strategic communications, told Mashable that the items emblazoned with the crude acronym were not officially affiliated with the school:", "\"We have no idea how this happened ... It was a surprise to us as well that someone put a video out on TikTok of that cap, and that just kind of blew up overnight.\"", "Prepsportwear.com sells a variety of merchandise featuring the logos of high schools and universities, but these products aren't necessarily affiliated with the respective schools. In fact, this website allows users to \"create your own team store\" featuring custom designs and logos.", "At the bottom of PrepSportswear.com's page featuring this crude merchandise, a disclaimer reads:", "\"This store is not affiliated with, sponsored or endorsed by Concordia University Cardinals. You have the ability to pick from an assortment of product colors. Design colors may not be identical to that of official licensed merchandise. All products in this store are exclusively produced and fulfilled by Prep Sportswear.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]