["On February 23, BJP leader Kapil Mishra made a provocative speech targetting protesters against the Citizenship Amendment Act (CAA). Since then, north-east Delhi has witnessed widespread communal riots which have so far taken the lives of at least 10 persons, including a cop. Amidst the violence, a 28-second video has gone viral where one can see a bus driver being attacked by a mob. One of the attackers, sporting a skull cap, is attacking the driver with a wooden log.", "Twitter user @sharmaAvl posted the viral video and tweeted (archive link), “This is the horror being played on the streets of Delhi right now. Did you see the skull cap? They have turned this country into Syria, where Hindus are shit scared. My relatives living in Maujpur haven’t stepped out of their home since 3 days.” So far, the video has garnered over 1 lakh views.", "This is the horror being played on the streets of Delhi right now.", "Did you see the skull cap?", "They have turned this country into Syria, where Hindus are shit scared.", "My relatives living in Maujpur haven’t stepped out of their home since 3 days.", "pic.twitter.com/sPKvNjGwey", "— Aviral Sharma (@sharmaAvl) February 25, 2020", "The video was also shared by Shilpa Nair, Kerala BJP State Communications member (archive link), Shashank Singh (@pokershash) founder of Fact Hunt (archive link) and @oyevivekk (archive link) amid ongoing violence in Delhi.", "Alt News performed a keyword search on YouTube and found that ABP Mahja uploaded a bulletin which reported about the incident on February 18.", "According to ABP Mahja, the incident took place in Kannad, Aurangabad, Maharashtra, Using this as a clue, Alt News performed another keyword search and found a February 21 report by Times of India. According to the report, 18 people were booked for allegedly assaulting Sudhakar Shamrao Shirsath (bus driver) and the bus conductor of a state transport bus near Hotel Amrapali, Aurangabad-Nashik road on February 18.", "Alt News reached out to Kannad police sub-inspector, BP Rout. He said, “The accused attacked the bus driver because he bumped into their car. There is no communal angle is this incident.” The cop also informed that reports of 18 persons booked by the police are incorrect. They were taken in for questioning, not arrested.", "We also found Shirsath’s FIR on Maharasthra police’s official website. Even his statement doesn’t state that the attack on him was communal in nature. He said that the attackers took his phone and about Rs 6,000 in cash from the conductor.", "The viral video is not related to CAA protests. Instead, it shows an altercation that followed after the bus driver bumped into a car on February 18 in Maharashtra’s Aurangabad.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]