["The collage was posted on Facebook on February 18, 2021.", "It shows a photo of a bridge that has Tagalog-language caption which translates to English as: \"bridge without a river\"; and another photo showing children submerged in water, captioned: \"river without a bridge\".", "The post features Tagalog-text on top reading “LP brand”, referring to the Filipino opposition Liberal Party, and shows pictures of LP leaders, former Filipino president Benigno Aquino III and current Vice President Leni Robredo.", "An identical photo collage was also shared on Facebook here, here and here alongside similiar claims.", "The Aquino III administration has been a frequent target of misleading claims that purport to compare its projects to Rodrigo Duterte’s.", "These claims, many of which AFP Fact Check has previously debunked, range from bridge reconstruction, river cleanup and railway projects.", "However, one photo in the collage has been shared in a misleading context.", "Schoolchildren photo", "A reverse image search on Google followed by keyword searches found the photo of the children submerged in water in fact corresponds to this Indonesian-language video report posted on March 24, 2018 on Indonesian news website Medcom.id.", "“Students in Serdang Bedagai, North Sumatra, have to directly cross fast-moving Buaya River to go to school,” the video’s Indonessian description reads. “The students hope for a bridge they could walk over to get across the river and arrive at school without getting their uniforms wet.”", "The video report features one student being interviewed.", "“If there is a flood, I sometimes go to school, sometimes not,” the child is quoted saying in Indonesian.", "Below is a screenshot comparison of the photo in the misleading collage (L) and its corresponding frame in the Medcom.id video report (R):", "A photo showing the same schoolchildren, taken from a slightly different angle, also appears with the same details in this report by Indonesia news website iNews.id.", "Bridge photo", "Further reverse image and keyword searches on Google found the photo in the collage that shows a \"bridge without a river\" appears in this report by Filipino media organisation Rappler.", "The report was published on April 21, 2016 during the presidency of Aquino III.", "“An average photo of a national road in Paku, Bontoc in Southern Leyte made rounds on Facebook on April 16,” the report reads. “What made it different from other national roads is that some netizens pointed out it is a ‘bridge with no river.’”", "According to the Rappler report, social media users suggested the bridge shows evidence of corruption. A public works official defended the project, saying not all bridges are constructed for rivers only, the report added.", "Below is a screenshot comparison of the photo of the bridge in the misleading collage (L) and the photo from the Rappler report (R):", "The location of the bridge can be seen here on Google Street View.", "The misleading claim has also been debunked by Filipino fact-checking organisation Vera Files.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]