["The photos were published here on Facebook on October 12, 2020. The post has been shared more than 300 times.", "The caption, written in a mixture of Korean and Burmese, translates to English as: “Large fire at Ulsan tower. After Project K’s performance, who stepped on the (visual) image of the Shwedagon Pagoda, Ulsan tower in South Korea caught fire. More (incidents) will be coming.”", "A fire broke out at a 33-storey tower block in the southern South Korean city of Ulsan on October 8, as reported here by AFP on October 9.", "The same photos of the fire were published here, here, here and here on Facebook alongside a similar claim.", "The claim, however, is false.", "Project K, a Myanmar boy band founded in 2016, published this post on their official Facebook page here about their performance at the Asia Song Festival in Ulsan. It states they performed at the festival at 8pm on October 10, 2020, two days after the fire at the tower block.", "Part of the Burmese post translates to English as: “We, Project K, were officially invited to participate in Asian Song Festival in South Korea in October, 2020. We, Project K, performed at the festival at 8pm Korean local time (5:30pm Myanmar time) on October 10, 2020.”", "A video of the group’s performance can be seen here on the Asia Song Festival’s official YouTube channel. The video was published on October 13.", "The first two images in the misleading posts directly correspond with images published in media reports about the fire in Ulsan on October 8.", "The first image in the misleading posts corresponds with an image in this report by Australian news outlet news.com.au.", "Below is a screenshot comparison of the first image in the misleading posts (L) and the image published by news.com.au (R):", "The second photo in the misleading post corresponds with the image in this report about the same fire by Korea JoongAng Daily, an English-language newspaper in South Korea.", "Below is a screenshot comparison of the second image in the misleading post (L) and the photo in the Korea JoongAng Daily report (R):", "The images all correspond with Google Satellite imagery of the Samhwan Art Nouveau commercial and residential building.", "The third image in the misleading post shows the Project K’s performance, as seen in this video on the Asia Song Festival’s official YouTube channel.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]