["The photos were published on Facebook here on November 17, 2019, just one day before a violent standoff between pro-democracy demonstrators and police at Hong Kong Polytechnic University. Here is an AFP report about the campus siege.", "The misleading Facebook post has been shared more than 2,300 times. Its traditional Chinese-language caption translates to English as: “Equal use of force?”", "Below is a screenshot of the misleading Facebook post:", "The same images were also published here, here and here on Facebook; and here and here on Twitter with a similar claim. The police sniper photo was also included in tweets related to unrest in Hong Kong here, here and here.", "The photos have been shared in a misleading context; one of the photos does show a Hong Kong protester carrying a bow and arrow, but the other image shows a police sniper in Cologne, Germany.", "A reverse image search found the photo of the police sniper was published here by Reuters in September 2018.", "The photo’s caption reads: “A sniper is seen on the roof opposite the Cologne Central Mosque before it's official inauguration in Cologne, Germany, September 29, 2018. REUTERS/Wolfgang Rattay”.", "Below is a screenshot of the Reuters photo:", "Reuters reported here on September 30, 2018 that police snipers lined the rooftops around Cologne Central Mosque to provide extra security for its opening, which Turkish President Recep Tayyip Erdogan attended.", "The Reuters photo corresponds with the mosque's location on Google Street View here.", "AFP's report on the mosque's opening was published here on September 30, 2018.", "Another reverse image search on Google found the other photo was published here on Reuters’ website on November 15, 2019. The image was credited to Reuters photographer Thomas Peter.", "Below is a screenshot of the photo on Reuters' website:", "The photo caption states: \"Protesters race with bows as they practice running away from riot police, on the roof of a bus shelter near the Cross Harbour Tunnel, which was blocked after demonstrators occupied the nearby Hong Kong Polytechnic University, in Hong Kong, November 15, 2019. Protesters have turned several universities into fortresses, stockpiled with petrol bombs and bows and arrows, amid some of the worst violence in the former British colony in decades. REUTERS/Thomas Peter.\"", "The photo corresponds with Google Street View images of Hong Chong Road in Hung Hom here. The Google Street View imagery is embedded below.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]