["About this rating", "Hasbro announced that the Mr. Potato Head toy would be getting a rebrand and linked to an article stating that the   \"Mr.\" was being dropped from \"Mr. Potato Head\" so that the toy could \"break away from traditional gender norms.\"", "Hasbro later clarified that the Mr. (and Mrs.) Potato Head toys would be rebranded as the \"Potato Heads\" line, but they would still be identified as Mr. and Mrs. on packaging.", "Mr. Potato Head, the ubiquitous American toy that comprises a plastic potato featuring holes into which a variety of plastic parts representing body features and clothing can be attached (e.g., ears, eyes, nose, mouth, shoes, hat, pants) has been distributed by Hasbro since 1952. The following year, Hasbro introduced a Mrs. Potato Head version to the world.", "In February 2021, however, Hasbro's Twitter account announced that the \"iconic Mr. Potato Head [is getting] a 21st-century rebrand\" and linked to a Fast Company article about the change that stated that the \"Mr.\" was being dropped from \"Mr. Potato Head\" so that the toy could \"break away from traditional gender norms\":", "The iconic Mr. Potato Head is breaking away from gender norms", "The toy giant Hasbro is rebranding its iconic Mr. Potato Head toy by dropping the “Mr.” from the name. On the surface, it may seem like a subtle shift, but it is designed to break away from traditional gender norms, particularly when it comes to creating Potato Head families -- how toddlers frequently play with the toy, according to Hasbro’s research. But starting this fall, when the new brand is unveiled, kids will have a blank slate to create same-sex families or single-parent families. It’s a prime example of the way heritage toy brands are evolving to stay relevant in the 21st century.", "This means the toys don’t impose a fixed notion of gender identity or expression, freeing kids to do whatever feels most natural to them: A girl potato might want to wear pants and a boy potato might wear earrings. Hasbro will also sell boxed sets that don’t present a normative family structure. This approach is clever because it allows kids to project their own ideas about gender, sexuality, and family onto the toy, without necessarily offending parents that have more conservative notions about family.", "As reports that \"Mr. Potato Head is going gender neutral\" began to spread, Hasbro then tweeted again later in the day to clarify that the Mr. (and Mrs.) Potato Head toys would indeed be rebranded as the \"Potato Heads\" line, but they would also still be identified as \"Mr.\" and \"Mrs.\" on the packaging:", "This second announcement predictably left consumers confused about Hasbro's intentions:", "This claim was originally rated True when published based on available information, then changed to Mixture after Hasbro issued a clarifying tweet.", "David Mikkelson founded the site now known as snopes.com back in 1994 as a creative outgrowth of his wide-ranging interests in a variety of subjects (particularly folklo ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]