["About this rating", "A meme originally published on a conservative group's Facebook page in 2013 reappeared online in October 2018, with the user responsible claiming that it didn't matter whether the content was accurate.", "On 2 October 2018, Sean O'Brien shared a graphic first posted by Constituting America bearing a picture of Patrick Henry alongside the statement, \"The Constitution is not a document for the government to restrain the people: it is an instrument for the people to restrain the government.\"", "The meme was accompanied by a statement from O'Brien:", "Never Forget this, EVER!!! There are people accusing me of this quote being fake. I can assure you, there is some evidence that Patrick Henry did say this, and if you want to call it fake, you're really missing the actual message of it. Who said it isn't as relevant as the message itself!!!", "However, the claim that Henry -- a self-taught lawyer who became one of the country's founding fathers -- actually made this statement had already been debunked by the time it was featured on Constituting America's page. In February 2012, author Thomas S. Kidd cited it as one of several quotes falsely attributed to Patrick Henry. Kidd, who was then an associate professor of history at Baylor University and is currently a distinguished professor there, wrote:", "This is a more complex misquotation, because it sounds like something Henry might have said -- maybe during the 1790s, after he opposed the Constitution's adoption, when he was hoping to restrict the new government's powers? The problem is that this quotation seems to have been entirely fabricated, and quite recently at that. The earliest reference I have found to this quotation is in two books published in 2003. But why create a bogus quotation when Henry actually said similar things about the need to restrain government? In any case, this is also frequently cited on social media sites and in political books.", "As Buzzfeed reported in 2015, the earliest published use of the quote spotted online was in 1999. Kentucky Sen. Rand Paul misattributed the statement to Henry both on the Senate floor and in public speeches.", "We contacted another author who wrote a biography of Patrick Henry, Harlow Giles Unger, whose book Lion of Liberty: Patrick Henry and the Call to a New Nation was released in 2010. He told us:", "Although the statement is factually correct and reflects both the purpose of the Constitution and the deeply held views of Patrick Henry, I have no idea who actually said it. Henry may well have made a similar statement, but I have I have no evidence to support his using the exact words of the statement in question.", "We also reached out to Constituting America asking if they had any documentation that would show that Henry actually made the statement depicted in the graphic. They have yet to respond.", "Kidd, Thomas S. \"Misquoting Patrick Henry: The Internet and Bogus Sayings of the Founders.\"\r\n    Huffington Post. 1 February 2012.", "Apper, Megan and Kaczynski, Andrew. \"Rand Paul Uses Fake Patrick Henry Quote In South Carolina Speech.\"\r\n   Buzzfeed. 8 June 2015.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]