["This post was published on the Facebook page of Dr.dew clinic, a private hospital in the Thai city of Udon Thani on January 30, 2020.", "Below is the screenshot of the misleading post:", "The post’s Thai-language caption translates to English as: “Vitamin D can help prevent coronavirus infection?”", "The post reads, in part: “Other than Pm2.5, coronavirus is another important problem that is strongly affecting the health of Thai people. Many people are aware of the measures to reduce infection risks, but few realize Vitamin D can help in preventing viral infection.", "Vitamin D is effective against diseases in the respiratory tract, especially lung infection. Research shows that children with Vitamin D deficiencies are more at risk of influenza than normal people. The amount of recommended daily intake is 3000 IU per day.", "\"Sources of Vitamin D include high-fat fish such as salmon and tuna. Bathing in the morning sun can also increase Vitamin D to your body.”", "The novel coronavirus has killed more than 2,760 people and infected more than 81,000 others, mostly in mainland China, as reported here by AFP on February 28.", "There are so far 40 recorded cases in Thailand, according to this Ministry of Health tweet published on February 26.", "Thailand situation on COVID-19, 26 Feb, 2020.#COVID19 #ไวรัสโคโรนาสายพันธุ์ใหม่2019 pic.twitter.com/o7gXQMXZPR", "A similar claim about the effectiveness of vitamin D on preventing novel coronavirus has also been shared here, here, here, here and here on Twitter and here on YouTube.", "The claim is misleading; Thai health experts told AFP vitamin D does not protect humans from coronavirus or other viral infections.", "During a phone conversation with AFP on February 25, Dr. Thiravat Hemachudha, the Head of the Center for Emerging Infectious Diseases Health Science Center at Thailand’s Chulalongkorn University said: “Statements that claim Vitamin D can prevent coronavirus or other viral infections are not true.", "“These beliefs, which emerged during the ’80s, laud Vitamin D’s healing qualities by claiming this and that, such as improving the body’s immunity system even against cancer.", "Vitamin D from natural sources such as sunlight or what we call solar therapy can help, but not Vitamin D absorbed from supplements.”", "AFP contacted the Dr.dew Clinic for comment on February 24.", "A representative said via Facebook Messenger: “There has been research during influenza outbreak that shows children with Vitamin D deficiency has a higher chance of falling ill, while another research says Vitamin D can reduce inflammation in the respiratory tract. We assume that this may reduce the risk of coronavirus infection because it is also a respiratory tract infection as well.”", "“However there is no direct research on how Vitamin D acts against coronavirus infection.”", "The World Health Organization (WHO) has published this Q&A page about the novel coronavirus. In response to the question; \"Is there a vaccine, drug or treatment for COVID-19?\" it states in part: \"Not yet. To date, there is no vaccine and no specific antiviral medicine to prevent or treat COVID-2019. However, those affected should receive care to relieve symptoms. People with serious illness should be hospitalized. Most patients recover thanks to supportive care.\"", "Below is a screenshot of the information on the WHO's site:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]