["A picture of Canadian Prime Minister Justin Trudeau surrounded by members of the Sikh community has been shared on social media. It is being claimed that Trudeau participated in farmers’ protest in Canada. Facebook page ‘K9media’ shared the image and wrote, “Canada – #Prime Minister of Canada during farmers’ protest.” The post drew 1,400 likes as of this writing.", "कनाडा – #किसानों के धरनें पर कनाडा का प्रधानमंत्री", "Posted by K9media on Thursday, 3 December 2020", "The picture has also been shared on Twitter against the backdrop of Trudeau’s support to the ongoing farmers’ movement.", "कनाडा – #किसानों के धरनें पर कनाडा का प्रधानमंत्री ! pic.twitter.com/GgYoXpDaqZ", "— Rajesh Ranjan tyagi (@RajeshR71176567) December 3, 2020", "It is widely circulating on Facebook as well.", "A simple Google reverse image search led us to a report by Hindustan Times published in November 2015. HT Punjab also tweeted these pictures of Canadian PM Justin Trudeau’s Gurudwara tour on November 12, 2015. According to the tweet, Trudeau went to a gurdwara in the capital of Ottawa on the occasion of Diwali.", "Canadian PM @JustinTrudeau visits temple, gurdwara on #Diwalihttps://t.co/LuvpQzkJsy pic.twitter.com/ZYZmpRdSJG", "— HT Punjab (@HTPunjab) November 12, 2015", "Reuters had uploaded the image on November 11, 2015.", "A picture Canadian Prime Minister Justin Trudeau’s visit to a gurdwara in November 2015 was falsely shared as him participating in farmers’ protest in Canada.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]