["The image was published on Facebook here on December 20, 2019. It has been shared more than 1,300 times.", "It shows Indian Congress Leader Priyanka Gandhi among protesters holding Hindi-language placards at a demonstration.", "Below is a screenshot of the misleading Facebook post:", "The Hindi-language placard circled in red translates to English as: “Remove CAB and make India a Muslim nation”.", "CAB is an acronym for the Citizenship Amendment Bill, which is now referred to as the Citizenship Amendment Act after India passed the legislation on December 11, 2019.", "Under the new bill, India will grant citizenship to immigrants from Afghanistan, Bangladesh, and Pakistan, as long as they are not Muslim. Critics say the exclusion of Muslims from the bill is discriminatory. The bill has resulted in violent protests across the country, as reported by AFP here.", "Priyanka Gandhi the General Secretary of the Indian National Congress party, can be seen in the bottom right corner of the image, wearing a green jacket.", "The same image was shared here on Facebook.", "But the image has been doctored to include a manipulated placard.", "The photo was taken at a protest against alleged police brutality in New Delhi, India, following violent police response to the citywide anti-citizenship bill protests.", "A reverse image search on Google found a similar photo from the same rally published in this December 16, 2019 report by Indian news agency UNI.", "Below is a screenshot of the UNI photo:", "The report states the photo was taken at a December 16, 2019, protest in New Delhi, India.", "It reads in part: “Congress General Secretary Priyanka Gandhi Vadra with supporters sitting on a dharna near the India Gate in protest against the Citizenship Amendment Act and Sundays alleged police crackdown in the Jamia Millia Islamia, in New Delhi on Monday.”", "The Hindi-language placard held by a protester translates to English as: “Don’t give us batons, bullets, but give food and employment.”", "Below is a screenshot comparison of the placard circled in the misleading post (L) and the UNI photo (R):", "Reuters also published this photo of the same event on December 16, 2019, which appears to show the same placard. Below is a screenshot of the Reuters photo:", "The placard in this photo reads the same as the UNI photo: “Don’t give us batons, bullets, but give food and employment.”", "Gandhi’s attendance at the anti-police brutality protest in Delhi was reported by Indian media.", "Indian national newspaper Times of India stated Gandhi led a two-hour sit-in protest outside India Gate in Delhi, one day after police clashed with students at an anti-citizenship bill protest in New Delhi’s Jamia Millia Islamia University, as reported by AFP here on December 16, 2019.", "The Times of India report reads in part: “Congress leaders led by Priyanka Gandhi Vadra staged a sit-in at the India gate on Monday in a show of solidarity with the students from Jamia Millia Islamia and several other universities across the country protesting the contentious amended citizenship law.”", "Indian Congress party workers also shared images of Gandhi at the protest on their Twitter accounts, including here and here.", "Smt. @priyankagandhi leads Congress protest at India Gate against violence on students. #BJPBurningBharat pic.twitter.com/GQzcwvsi2s", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]