["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "As Americans exhaustively discuss (and often lament) in every presidential election year, the United States does not choose its chief executive based on whichever candidate receives the largest number of votes in a national election, but via an electoral college system under which each of the individual states holds a separate election to select a slate of electors who cast their votes for president.", "This unique approach means that sometimes -- as happened in 2000 and again in 2016 -- the candidate who receives the most votes nationwide does not ultimately win the overall election. When that phenomenon occurs (and sometimes even when it doesn't), partisans of the losing candidate start ruminating about ways to \"game\" the electoral college system to install their preferred choice in the White House regardless.", "One example of this trend's playing out in 2020, when U.S. President Donald Trump apparently lost both the popular and the electoral vote, yet he, and many of his supporters, claimed victory nonetheless and asserted claims (without credible evidence) that substantial election fraud had taken place. Some voices proclaimed that states in which Republicans controlled the state legislature should choose electors favoring Trump, no matter how the residents of those states may have voted:", "The scheme proposed here reflects a fundamental misunderstanding of how the U.S. electoral college system and electoral law function, however.", "When the framers of the U.S. Constitution outlined the workings of the electoral college system, they didn't specify how presidential electors should or must be chosen, leaving it up to the various state legislatures to each decide for themselves how to appoint their electors:", "\"Each State shall appoint, in such Manner as the Legislature thereof may direct, a Number of Electors, equal to the whole Number of Senators and Representatives to which the State may be entitled in the Congress ...\"", "This passage meant that state legislatures could opt to choose electors themselves, or appoint a commission to designate electors, or hold a lottery, or flip a coin, or employ whatever other method they saw fit. However, it does not mean that, as suggested by the above tweet, state legislatures now have carte blanche to simply ignore election results and choose whichever presidential electors they want.", "After the U.S. Constitution was ratified and went into effect in 1788, states generally used a combination of selection by legislatures and selection by popular vote for designating their electors. By 1864, though, every state had adopted laws establishing the practice of popular voting for electors.", "For the most part, each political party submits a list of electors who are pledged to vote for that party's candidate to state elections officials, and after the election the state appoints the electors submitted by the party of whichever presidential candidate received the most votes. The website of the National Conference of State Legislatures (NCSL) describes this process:", "The U.S. Constitution does not specify procedures for the nomination of candidates for presidential elector. The two most common methods the states have adopted are nomination by state party convention and by state party committee. Generally, the parties select members known for their loyalty and service to the party, such as party leaders, state and local elected officials and party activists. In some states, the electors’ names appear on the ballot along with the names of the candidates for president and vice president. However, in most states, electors' names are not printed on the ballot. When a voter casts a vote for a candidate for President of the United States, s/he is in actuality casting a vote for the presidential electors who were selected by that candidate's party.", "[W]hen a candidate for president wins a state's popular vote, that party's slate of electors will be the ones to cast the vote for president of the United States in December. For example, Florida has 29 electoral votes. If President Donald Trump wins the state’s popular vote on Nov. 3, the 29 electors nominated by the Republican Party in Florida will be selected. These 29 people will gather on Dec. 14 to cast their votes for president of the United States.", "Although the wording of Article II of the Constitution (quoted above) allows that any state's legislature could opt for a different method of picking electors in the future, it does not empower any legislature to ignore both their state's elections results and their existing laws and, willy-nilly, designate whomever they want as electors. (In reference to the NCSL passage quoted above, for example, Democratic legislators in Florida could not decline to recognize Donald Trump as the winner in that state's election and appoint electors chosen by the Democratic party instead.)", "Any state's legislature could, theoretically, pass a law setting out a new method for designating presidential electors other than popular vote. However, they would have enact such a law prior to Election Day; they could not retroactively change, or just disregard, their current laws to defy the will of voters. State election laws and regulations must be established and in place prior to Election Day -- they cannot be improvised or instituted on an ad hoc basis after the fact. Otherwise, every presidential election would descend into chaos, with state legislatures controlled by one party refusing to appoint electors pledged to the other party's candidate, as the Lawfare blog observed:", "The legal theory that would allow state legislatures to go rogue and appoint electors without regard for the popular vote rests on an argument made by Chief Justice William Rehnquist in Bush v. Gore, for himself and two other justices. On this view, a legislature is unconstrained in its power to set the manner by which electors are selected -- meaning that even after an election, the legislature could ignore the results and select a different slate altogether. A recent opinion by Justice Brett Kavanaugh suggests that Rehnquist’s argument may be again on the rise.", "But advocates for this view need to recognize that between Bush v. Gore and today, the Supreme Court has unanimously decided that presidential electors are not actually “electors” but are instead bound to the people’s vote. That principle that cabins elector discretion must also constrain legislatures -- at least if the country is to avoid an abomination that the Framers expressly rejected.", "That said, the law is only relevant to the extent that is it enforceable. If Republican-dominated legislatures were determined to find excuses for ignoring their states' election results, a Republican-controlled Senate were willing to facilitate the scheme, and a conservative judiciary were compliant in upholding the results, then such a plot might indeed succeed.", "Correction [Nov. 11, 2020]: Corrected to note that it wasn't until 1864 that every state chose electors via popular vote.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]