["Georgia congressman and U.S. Senate candidate Paul Broun has been a loud voice in the push to reduce government control of education policy. He has criticized the federal Education Department as being a bloated bureaucracy with excessive spending and salaries.", "In this vein, Broun and other Republican members of the House narrowly approved the Student Success Act, aimed at lessening the federal government’s power to set national education standards. The bill would reverse many of the provisions of the 2002 No Child Left Behind law.", "After the vote, Broun touted the approval of his amendment to the bill, requiring more DOE transparency on jobs and salaries.", "\"While fat-cat bureaucrats at the (U.S.) Department of Education are getting paid an average salary of $102,000 a year, teachers in Georgia are getting paid half of that,\" Broun said in a press release. \"My amendment would hold the Department of Education accountable for their costly salaries, and force the government to take a closer look at how scarce education dollars ought to be spent.\"", "Broun used a similar phrase the day before when announcing House approval of his amendment. And again last week during a campaign event in Marietta:", "\"Those fat-cat bureaucrats that have never taught a child to read have an average salary across the department of over $101,000 a year,\" Broun said.", "PolitiFact knows that teachers work hard for their money. But was Broun correct that a teacher’s Peach State pay was half that of federal education workers? We decided to hit the books and find out.", "The average Georgia public school teacher’s salary for the 2012-2013 school year was $52,956.27, according to Matt Cardoza, spokesman for the state Department of Education.", "For the federal salary figure, Broun used information from the Heritage Foundation, a Washington-based conservative think tank, along with a database of federal employees’ salaries, his spokeswoman told us.", "For 2011, the latest year of information Broun referenced, there were 4,620 employees listed in the database for the federal Education Department.", "The Heritage Foundation’s \"The Foundry\" blog featured a story about the U.S. DOE in 2010 and cited the department’s average employee salary -- not including executive salaries -- of $103,000 for that year.", "The majority of federal civilian, white-collar employees are classified and paid on the General Schedule (GS), according to the U.S. Office of Personnel Management. The GS pay schedule has 15 grades and 10 steps in each grade. Pay varies by geographic location. GS grades 8-12 are considered midlevel positions.", "We contacted the Heritage Foundation for background on its reported 2010 salary figure. Lindsey Burke, an education fellow at the organization, provided us with the DOE’s salaries and expenses overview chart for full-time workers. The organization considered the employees at the GS15 level downward, but did not include any executive-level salaries.", "They then used the government’s standard salary table to determine the pay for each of those levels and averaged those figures to ultimately produce the average employee annual salary. The $103,000 figure is also listed on the DOE overview chart as the average, nonexecutive employee salary for the 2010 budget.", "A spokesman for the U.S. DOE provided us the same Salaries and Expenses overview table, this time from the fiscal 2014 budget request. The department lists the average employee level as GS12 for the fiscal years 2012-2014. For those years, the average, nonexecutive employee salary was $103,773; $104,198 and $105,020.", "In looking at these figures, it is important to consider other variables that influence the salary figures.", "The Bureau of Economic Analysis notes that the skill and education levels for federal jobs tend to be higher because of the job requirements in the federal government. The BEA also noted in recent years that the federal government is hiring more highly skilled workers who tend to make more money. Many of the lower-paid positions have been contracted out to the private sector.", "It is also important to consider the high cost of living in the Washington area. The cost of all basic necessities is higher in the Washington area than in Atlanta, one of Georgia’s largest and most expensive cities. Groceries are 10 percent more; utilities, 11 percent more; transportation, 6 percent more; and the most expensive item, housing, is 170 percent more expensive in D.C. than in Atlanta, according to the CNN Money cost of living calculator, one of many that makes city comparisons.", "So does Broun’s claim get a passing grade?", "Broun said that Georgia teachers make half of what average federal Education Department employees make. On just the numbers, he is very close to accurate.", "But Broun fails to take into account the high education and experience level that federal employees at this level typically possess, as well as the high cost of living in the Washington, D.C., area versus residing in Georgia.", "Broun’s statement is accurate but needs some clarification.", "We rate his claim Mostly True.", "U.S. Rep. Paul Broun email newsletter, \"Broun amendment passes,\" sent July 19, 2013", "YouTube video, \"House passes Broun amdt to increase govt. transparency,\" published July 19, 2013", "U.S. Rep. Paul Broun press release, \"House passes Broun amendment to increase government transparency and accountability,\" July 18, 2013", "Marietta Daily Journal, \"What can Broun do for you?\" Jon Gillooly, Aug. 26, 2013", "GovTrack.us, H.R. 5: Student Success Act, Broun’s amendment", "Email interview, Christine Hardman, spokeswoman, U.S. Rep. Paul Broun, Aug. 7-8, 2013", "Email interview, Matt Cardoza, spokesman, Georgia Department of Education, Aug. 9, 2013", "Email interview, Jim Bradshaw, spokesman, U.S. Department of Education, Aug. 26-27, 2013", "Email interview, Lindsey Burke, Will Skillman Fellow in Education, the Heritage Foundation, Aug. 27-28, 2013", "The Hill, \"House votes 221-207 to limit federal control over education,\" Pete Kasperowicz, July 19, 2013", "Heritage Foundation, \"The Foundry\" blog, \"A department only Washington could love,\" Rachel Sheffield, July 13, 2010", "Asbury Park Press, DataUniverse, Federal employees 2011 annual pay database", "U.S. Department of Education, Salary and Expenses Overview, Fiscal Year 2014 budget request", "U.S. Office of Personnel Management, \"General schedule classification and pay\"", "Bureau of Economic Analysis, FAQs, contributing factors to public/private-sector compensation", "CNN Money, Cost of Living Calculator", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]