["Prime Minister Narendra Modi issued a 21-day lockdown on March 24, barring essential services. Since then, there have been reports of the police adopting harsh measures to keep the restriction of movement in place.", "A 30-second video has now gone viral with the claim: “Indian police is just nothing. See Spanish police beating people who are violating curfew.” A Twitter user posted the viral video on March 25. (archived tweet)", "Indian police is just nothing. See Spanish police beating people who are violating curfew 😎😍 pic.twitter.com/s2AeNycavp", "— विमाँशु (@vimanshu0) March 25, 2020", "Similarly, several other Facebook and Twitter users have shared the viral video. Alt News has received multiple requests to fact-check the viral video on WhatsApp (+91 76000 11160) and on our official Android application.", "Alt News analysed the viral video using InVid video verification tool. A reverse-image search on Yandex led to a July 2019 article by n.com.do, a Spanish news website, which carried the viral video. According to the report, the incident shows three men dressed like the police beat up a man. It also explained how a trend has emerged in Mexico where civilians dress up as policemen and punish people allegedly involved in robberies and other crimes.", "Investigative journalist Nuria Esperanza Piera Gainza also shared the article by n.com.do.", "VIDEO: A nalgadas con tabla presuntos policías castigan a joven ladrón https://t.co/y8R8OUJeGM #NDigital pic.twitter.com/XhJqApOoPO", "— Nuria Piera (@nuriapiera) July 15, 2019", "Another Spain-based news outlet La Opinión reported on this incident in July last year.", "VIDEO: A nalgadas con tabla presuntos policías castigan a joven ladrón | La Opinión https://t.co/0kglnKS0qD pic.twitter.com/Q4Kk1dqFG8", "— La Opinión (@LaOpinionLA) July 15, 2019", "The video, therefore, predates the coronavirus pandemic. The first confirmed case in China, the origin of the virus, was reported months later in November 2019. However, it is noteworthy that the video has been shared at a time when questions are being raised on the harsh measures adopted by the Indian police on migrant workers attempting to get to their home states on foot. The lockdown has left thousands of them without food and a means of transportation. The police have also reportedly used excessive force on citizens stepping out to purchase essentials.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…"]