["Republican U.S. Sen. Ron Johnson is once again in the crosshairs of a national conservation group for his voting record.", "The League of Conservation Voters has run a series of television ads against Johnson, a first-term senator who is facing a 2016 rematch with Democrat Russ Feingold. The ads have aired in anticipation of possible action by Republicans in Congress to undo Obama Administration regulations limiting carbon emissions.", "The $1.6 million campaign includes an ad called \"Disappear,\" and another dubbed \"Lakes.\"", "Both make variations of the same claim: That \"Ron Johnson led the fight to let polluters release unlimited amounts of carbon pollution.\" The second ad includes this addendum: \"... and took nearly $225,000 from polluters.\"", "Turns out the environmental groups are doing a bit of recycling.", "Support for the legislation", "We checked a similar claim in 2013 when the League of Conservation Voters aired an ad that said Johnson had taken \"more than $100,000 from oil and gas and voted to let them keep spewing unlimited carbon pollution into our air.\"", "We rated the claim True. Johnson voted twice to prohibit the EPA from regulating any carbon emissions. And, at the time that ad aired, he had received $109,550 from oil and gas interests since his first campaign in 2010, according to the nonpartisan Center for Responsive Politics, which tracks campaign contributions.", "The same votes are cited in the most recent ads.", "But the wording varies a bit. It says Johnson \"led the fight,\" which is problematic.", "The group’s backup for the ad cites two measures that Johnson voted in favor of -- one in 2011 and one in 2013 -- that would have blocked the EPA from strengthening the carbon emission standards. However, he was not a sponsor or co-sponsor of either amendment, so it’s hard to consider him a leader.", "The group also noted Johnson \"has co-sponsored legislation, written to President Obama, and spoken to the media regarding his opposition to the Clean Power Plan.\"", "The bill the group cites, the Affordable Reliable Energy Now Act, was introduced May 13, 2015. Johnson is among 35 co-sponsors. That’s nearly two-thirds of the 54 senators who are Republican.", "The letter cited was written to Obama June 4, 2014. It called on him to withdraw the EPA carbon rules. Johnson was one of 41 Republican senators who signed.", "Finally, the group cites a quote from Johnson in a June 18, 2014 article posted by the liberal blog Talking Points Memo. In it, Johnson said he'd be \"totally supportive\" of using government funding legislation to block the EPA rules.", "\"I'm a manufacturer. You actually need power if you're going to manufacture things,\" he said. \"Let's not drive, artificially, the cost of power up -- that's a self-inflicted wound. That's what this administration is doing and I have no idea why they'd want to do that.\"", "He was one of a half dozen GOP senators quoted in the story.", "So, while Johnson took the steps, the group provides little evidence he was out in front or somehow spearheading them.", "Campaign contributions", "Finally, the ad offers a new figure for campaign cash (nearly $225,000) and instead of \"oil and gas,\" describes the contributors as \"polluters.\"", "According to same campaign contribution database we previously reviewed, Johnson received  $133,600 from the oil and gas industry, $63,428 from the mining, and $22,700 from electric power utilities. That tallies out to $219,728.", "Johnson campaign spokesman Brian Reisinger called the ads a \"false partisan attack\" and said they distorted Johnson’s position \"that we can protect our economy and environment at the same time with a balanced national energy policy.\"", "Our rating", "The League of Conservation voters launched TV ads that claim Johnson \"led the fight to let polluters release unlimited amounts of carbon pollution and took nearly $225,000 from polluters.\"", "Much of the ad’s content is recycled. The claim, however, is puffed up a bit this time because it says Johnson \"led\" the effort. We did not find much evidence of that.", "That knocks the claim down to Mostly True.", "League of Conservation Voters ad, \"Lakes,\" Sept. 2015", "League of Conservation Voters ad, \"Senator Ron Johnson ‘Action’ ad,\" Aug. 14, 2013", "League of Conservation Voters ad backup", "League of Conservation Voters press release, July 27, 2015", "Center for Responsive Politics, Open Secrets.org campaign contribution database", "PolitiFact Wisconsin, \"Sen. Ron Johnson voted for ‘unlimited carbon pollution’ environmental group says,\"Aug. 29, 2013", "U.S. Senate, roll call vote 54, April 6, 2011", "U.S. Senate, roll call vote 76, March 22, 2013", "S.1324 - Affordable Reliable Electricity Now Act of 2015", "Talking Points Memo, \"Shutdown wars return? GOP senators want to block Obama’s climate change rules,\" July 18, 2014", "Emails, Seth Stein, spokesman, League of Conservation Voters, Oct. 5, 2015", "Emails, telephone interview, Brian Reisinger, spokesman, Sen. Ron Johnson campaign, Oct. 6, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]