["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Reports have estimated that 27 percent to 58 percent of illegal immigrants have overstayed their visas. (AP photo)", "Although building a wall on the Mexican border gets most of the headlines, U.S. Sen. Ted Cruz, R-Texas, says other steps also must be taken to keep illegal immigrants from settling in the United States.", "\"Forty percent of illegal immigration doesn’t come across the border; it’s people coming legally on visas and overstaying their visas,\" the presidential candidate said during a recent interview on \"The John Fredericks Show,\" broadcast from Portsmouth.", "Cruz pledged to develop a program to record and store biometric information on visas to help track the entry and departure of visitors to the United States. Biometrics refer to characteristics such as fingerprints, eye recognition and DNA.", "We decided to examine Cruz’s statement that 40 percent of illegal immigrants are people who have overstayed their visas - a claim often cited by Republicans. Two of Cruz’s rivals for the GOP nomination, U.S. Sen. Marco Rubio of Florida and former Florida Gov. Jeb Bush, also have mentioned the statistic this year.", "When we asked Cruz’s campaign for the source of the statistic, a spokesman referred us to PolitiFact Texas’ 2013 fact-check of a similar statement made by U.S. Rep. John Carter, R-Texas.", "Carter’s statement was based on a 2006 report by the Pew Research Center that estimated \"nearly half of all the unauthorized migrants now living in the United States entered the country legally through a port of entry such as an airport or a border crossing point where they were subject to inspection by immigration officials.\" While the source data gave an estimate that ranged from 33 percent to 50 percent, the report went middle-of-the-road and called it 45 percent.", "Pew relied on a 1997 study by the Immigration and Naturalization Service. The INS report concluded that in 1996, 41 percent of illegal immigrants had entered the United States legally. The problem is that neither the INS nor its successor, the Department of Homeland Security, have provided updated statistics on overstayed visas since that aging study. Subsequent estimates have been based on taking that core 1996 data and adapting it to current trends.", "In 2003, the INS reprocessed the data and estimated that 33 percent of the illegal immigrant population in the nation in 2000 had overstayed their visas. A 2004 report from the General Accounting Office, based on 2000 data, gave estimates on visa overstays ranging from 27 percent  to 57 percent. The GAO cautioned that its methodology in reaching the figures was \"complex, indirect and marked by weaknesses.\"", "Robert Warren, a former INS demographer whose work was a part of that 1997 report, is among those who have published updated estimates based on the old data.", "Warren, now a senior fellow at the nonpartisan Center for Migration Studies, theorized in a 2014 study that because it has gotten harder in recent years to enter the U.S. through its southern borders, the percentage of illegal immigrants overstaying their visas has increased and in 2012 may have been 58 percent.", "But because there’s no new hard data, no one knows for sure. \"They’re all ballpark estimates,\" said Marc Rosenblum, an analyst with the Migration Policy Institute.", "Our ruling", "Cruz said that 40 percent of illegal immigrants in the U.S. are \"people coming legally on visas and overstaying their visas.\"", "This widely cited statistic is based is an estimate based on research going back to the 1990s. The federal government hasn’t provided updated statistics on overstayed visas, and subsequent research has focused on adapting the old data to new trends. Estimates in those reports have ranged from 27 percent to 58 percent of illegal immigrants overstaying their visas.", "So Cruz is using what research shows to be an acceptable middle figure. But he would be more accurate to refer to the 40 percent figure as an estimate rather than a fact.", "We rate his statement Mostly True.", "Sen. Ted Cruz, Interview on The John Fredericks Show, Dec. 17, 2015 (comment at 2:00 mark of tape).", "Email from Rick Tyler, national spokesman for Cruz, Dec. 22, 2015.", "Interview with Robert Warren, senior fellow at the Center for Migration Studies, Dec. 23, 2015.", "Interview with Marc Rosenblum, Migration Policy Institute’s U.S. Immigration Policy Program deputy director, July 27, 2015.", "U.S. Government Accountability Office, \"Overstay Tracking: A Key Component of Homeland Security and a Layered Defense,\" May 2004.", "Pew Research Center, \"Modes of Entry for the Unauthorized Migrant Population Fact Sheet,\" May 22, 2006.", "PolitiFact Florida, \"Rubio says 40 percent of illegal immigrants stayed in the U.S. after their visas expired,\" July 29, 2015.", "Wall Street Journal, \"Many in U.S. Illegally Overstayed Their Visas,\" April 7, 2013.", "U.S. Government Accountability Office, \"Overstay Enforcement: Additional Actions Needed to Assess DHS’s Data and Improve Planning for a Biometric Air Exit Program,\" July 2013.", "PolitiFact Texas, \"John Carter claim that 40 percent of nation's illegal residents came by plane and overstayed visas draws on 2006 estimate,\" Aug. 31, 2013.", "PolitiFact Texas, \"Visa overstayers comprise 38 percent to 50 percent of unauthorized U.S. residents, per 2006 calculations,\" April 28, 2014.", "U.S. Department of Homeland Security, \"2013 Yearbook of Immigration Statistics,\" August 2014.", "U.S. Department of Homeland Security, \"Immigration Enforcement Actions: 2013,\" September 2014.", "Pew Research Center, \"As Growth Stalls, Unauthorized Immigrant Population Becomes More Settled,\" Sept. 3, 2014.", "Journal on Migration and Human Security, \"Beyond DAPA and DACA: Revisiting Legislative .", "Reform in Light of Long-Term Trends in Unauthorized Immigration to the United States,\" 2015.", "U.S. Immigration and Naturalization Service, \"Estimates of the Unauthorized Immigrant Population Residing in the United States: 1990 to 2000,\" accessed Dec. 22, 2015.", "Interview with Mark Krikorian, Center for Immigration Studies executive director, July 27, 2015.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]