["By D'Angelo Gore", "Posted on January 31, 2019", "The recent five-week partial government shutdown will reduce real U.S. gross domestic product by $3 billion, on net, the Congressional Budget Office estimates. At least twice, House Majority Leader Steny Hoyer has said CBO put the cost at $11 billion, neglecting to explain that the agency figures the economy will regain $8 billion of that this year.", "For example, Hoyer said this at his news briefing this week:", "Hoyer, Jan. 29: I think you probably saw the CBO report about the cost of the shutdown. $11 billion is their estimate. Those are direct costs as opposed to indirect which I think were very substantially greater. And the real cost was the extraordinary undermining of confidence of not only federal employees, but also contractors with the government and the American people themselves.", "He also said “the five-week Trump-McConnell shutdown directly cost our economy at least $11 billion in GDP” in a statement released Jan. 28.", "Both times, the No. 2 House Democrat left out the other part of CBO’s analysis.", "The nonpartisan budget analysts say the partial government shutdown — which lasted from Dec. 22, 2018, until Jan. 25, 2019 — “dampened economic activity mainly because of the loss of furloughed federal workers’ contribution to GDP, the delay in federal spending on goods and services, and the reduction in aggregate demand” in the private sector.", "It “reduced GDP in the fourth quarter of 2018 by $3 billion,” and is expected to “on net, reduce GDP in the first quarter of 2019 by $8 billion,” CBO’s report says.", "But CBO also projects that most of that $11 billion loss will be negated once previously unfunded agencies receive their appropriations and federal workers get back pay.", "For the “remainder of 2019,” the report says, “GDP will be boosted by $8 billion,” and “about $3 billion in forgone economic activity will not be recovered.”", "So, overall, $3 billion in real GDP is how much CBO expects the economy to lose based on an estimated annualized real GDP of $21.16 trillion.", "Unlike Hoyer, some other Democrats, such as Sens. Chuck Schumer and Tammy Duckworth in their own Jan. 29 news briefing, have made that important detail known.", "Now, it’s true CBO’s estimate doesn’t include “more difficult to quantify” indirect economic costs, as the budget office notes. It also stipulates that its estimates of the shutdown’s effects “are subject to considerable uncertainty” for various reasons.", "To that last point, members of the Trump administration, including Treasury Secretary Steve Mnuchin and National Economic Council Director Larry Kudlow, have argued that, in the end, any losses will be recovered in full or nearly so.", "“With respect, once again we disagree with the CBO,” Kudlow said in a Jan. 29 Fox Business interview with Maria Bartiromo. “I don’t think we’re going to lose anything. This is completely temporary. None of the incentives in the economy have been changed by this.”", "The same day, Mnuchin, whom Bartiromo also interviewed, had a slightly different take.", "“Kevin Hassett, [chairman of the White House Council of Economic Advisers], is working on final numbers for us,” Mnuchin said. “I think his view is that there’s no question that there was some cost, but those costs will be recovered as money comes back into the system … he views that it will almost all be recovered.”", "But CBO is not alone in projecting economic losses due to the shutdown.", "Analytics firm S&P Global Economics, based on its own analysis, figured the “U.S. economy lost at least $6 billion dollars by the close of business” on Jan. 25. It’s not clear if the economic group projects that any of those billions will be recouped.", "Either way, citing CBO’s estimate of $11 billion in lost real GDP, without mentioning an estimated $8 billion will be gained back, amounts to telling half the story.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]