["A disturbing video of a man violently forcing himself on a woman in broad daylight while another is filming the sexual assault is being shared with the claim that both the men hail from the Muslim community. Khushi Singh, a Twitter user, posted the video with a message that reads, “Pure Horror Atleast 2 Peacefuls Beating a Girl, they trying to torn her Cloth, and this might ended into Gang Rape Location – Unknown Help to trace these B*stards Please don’t feel shame to RT”. Singh alleged that the perpetrators were Muslims by calling them “peacefuls”, a pejorative term commonly used on social media for the Muslim community. Singh’s tweet garnered more than 300 retweets and nearly 17,000 views at the time of writing this article. We are not posting the video here due to its graphic nature.", "Alt News found that both the perpetrators did not hail from the Muslim community. The incident had taken place in the jurisdiction of Zafarabad police station in Uttar Pradesh and the men arrested were Hriday and Kallu.", "In a reply to a tweet that carried a clip of the molestation, Jaunpur police posted a video statement issued by the City’s Superintendent of Police. Addressing the media, SP VK Mishra said, “A video had gone viral of a minor girl being beaten by a young man in a village that lies under the jurisdiction of Zafarabad police station. In the video, the man was brutally slapping the girl. Police had registered FIR against Chhattu alias Hriday, son of Kailash and Kallu, son of Gomti. The girl was herding goats when the duo arrived on a motorcycle and started harassing her. Both the men have been arrested.”", "थाना जफराबाद अंतर्गत लड़की के साथ मारपीट व अश्लील हरकत की वायरल वीडियो के मुकदमें में नामजद दोनो अभियुक्तों की गिरफ्तारी के संबंध में जिलाधिकारी व पुलिस अधीक्षक जौनपुर की संयुक्त बाईट। pic.twitter.com/SJGCyFE4Kg", "— JAUNPUR POLICE (@jaunpurpolice) July 1, 2019", "Moreover, Uttar Pradesh.org, a UP-based news website also identified the accused as Hriday Nishad alias Chhattu Nishad and Sandip Nishad alias Kallu Nishad.", "SP Mishra also gave a statement to ANI where he said, “A video has been made viral in which a Dalit boy is beating up and molesting a minor girl. We have taken cognizance of it and registered a case.”", "In conclusion, a video of a minor being harassed in UP’s Jaunpur district was given a communal narrative to falsely suggest that the crime was committed by members of the Muslim community. Recently, an assault on a tribal woman in Madhya Pradesh was also shared with communal overtones.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]