["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ben Carson speaks at a news conference Nov. 16, 2015, in Henderson, Nev. Carson called for Congress to cut off funding for resettlement of Syrian immigrants in the U.S. (AP Photo)", "In the wake of the terrorist attacks in Paris, many have suggested that, given the lack of proper screening, accepting Syrian refugees would be akin to inviting in the enemy.", "\"There is currently no ability to vet these people. By letting refugees into our country without vetting we are putting America at risk,\" Republican candidate Ben Carson wrote in an official statement posted on Facebook on Nov. 16.", "Is Carson right that we don’t vet the refugees? Well, it’s more that we can’t, Carson spokesperson Doug Watts told us.", "\"There is no foolproof and effective way of vetting these people,\" Watts said. \"That’s his opinion, shared by millions of others, and confirmed by thousands of felonies occurring at the hands of both legal and illegal immigrants.\"", "But Carson said we don’t vet refugees, and that isn’t correct. Carson has a point that the system isn’t foolproof, but the ability to screen refugees does exist.", "How we vet refugees", "Let’s begin with an overview of the refugee admissions process, which has been in place since 1980 and was retooled after 9/11.", "Before refugees even face U.S. vetting, they must first clear an eligibility hurdle. The United Nations High Commissioner for Refugees — or occasionally a U.S. embassy or another NGO — determines who counts as a refugee, who should be resettled (about 1 percent) and which countries would take them. This can take four to 10 months.", "Once the cases are referred to the United States, refugees are vetted through a process that involves multiple federal intelligence and security agencies. Typically, about half of refugees are approved, according to the State Department.", "Refugees undergo several rounds of security clearance checks. Their names, biographical information and fingerprints are run through databases coordinated by the FBI, the State Department, the Department of Homeland Security and the Department of Defense.", "For Syrian refugees, there’s one additional step. Their filings with the UN and initial documents submitted to the U.S. program are reviewed. Information about where they came from, what caused them to flee and what their experiences were like are cross-referenced with classified and unclassified information.", "According to Buzzfeed, Syrian refugees are also being vetted through a secret national security screening program. The program, the Controlled Application Review and Resolution Process, is specifically used to screen people deemed potential national security threats.", "While the checks are being conducted, trained DHS officers interview refugees in person. (Most interviews with Syrian refugees happen in Amman, Istanbul and Cairo.) Refugees who’ve been cleared by the officer, the State Department and the background checks then undergo medical screenings, a match with a sponsor agency, \"cultural orientation\" classes and one final security clearance.", "This process typically takes one to two years, if not longer, and happens before a refugee ever gets onto American soil.", "Gaps and challenges", "There are undoubtedly challenges to vetting refugees, with intelligence and national security officials highlighting the paucity of data in particular.", "The head of the National Counterterrorism Center told Congress in October that the intelligence in Syria is \"not as rich as we would like it to be,\" while FBI Director James Comey told Congress that there are \"gaps\" in data availability.", "\"If someone has never made a ripple in the pond in Syria in a way that would get their identity or their interest reflected in our database, we can query our database until the cows come home, but there will be nothing show up because we have no record of them,\" Comey said in a House Committee on Homeland Security hearing on Oct. 21.", "The lack of U.S. relationships with Syrian government and law enforcement and the use of fake passports and fraudulent documents are also causes for concern, according to Jessica Vaughan of the Center for Immigration Studies, which describes itself as \"low immigration, pro-immigrant.\"", "\"The country is in chaos and the identities and claims of the applicants are nearly impossible to verify. We can check our databases and fingerprint repositories, and so on, but if we have collected little information on Syrians, it will not help,\" Vaughan said", "The case against alarm", "Challenges, however, don’t translate into \"no ability\" to vet at all.", "\"No system is foolproof. If we really wanted a foolproof system, we would shut down immigration entirely,\" said David Martin, a University of Virginia professor who’s previously held posts at DHS and the State Department. \"The alarm is way overblown.\"", "Experts and advocates pushed back on the notion that we accept refugees with no intelligence at all. In contrast to refugees worldwide, Syrians tend to have identity documents and the reasons they give for missing documents (i.e. a barrel bomb dropping on their house) can be verified, according to the State Department.", "There’s no real precedent of a terrorist slipping in through the U.S. refugee system. The concerns stemming from the Syrian passport found in connection to the Paris attacks don’t apply here, experts said. That’s because the European vetting process for refugees arriving by sea is extremely chaotic and not comparable to the processes used by the UN and United States.", "In the United States, very few resettled refugees — three since 9/11, according to the Washington Post Fact Checker — have been implicated in terrorist situations. Daryl Grisgraber of Refugees International pointed out that the Tsarnaevs came to the United States as children from Chechnya and applied for asylum, but were radicalized here.", "\"We’ve also resettled thousands in recent years from the Central African Republic, Somalia, and the Democratic Republic of Congo, all of which have faced similar terrorist threats and have unstable governments that present challenges for the vetting process. But we’ve done this successfully time and time again without incident,\" said Geoffrey Mock, the Syrian country specialist for Amnesty International USA.", "And finally, refugees are subject to the highest level of security checks of any category of traveler to the United States. So for ISIS to take advantage of the refugee program \"makes no operational sense,\" said Anne Speckhard, a counterterrorism expert at Georgetown University. It would be more likely for ISIS to find Europeans who could travel to the United States on business or tourist visas.", "\"Given how easy it is to send a European extremist to the U.S. via Europe, why would an ISIS guy in Syria wait the three years it takes to get refugee status?\" she said.", "Our ruling", "Carson said, \"There is currently no ability to vet these people,\" referring to Syrian refugees.", "The United States vets refugees through a process that involves multiple federal and international groups and that typically takes one to two years. Refugees undergo security checks, interviews, medical screenings and other steps.", "Carson has a point that there is some concern over insufficient data, though some say the concern is exaggerated. Even if there are gaps and challenges in the vetting process, it’s a far cry to say there’s no ability at all to vet refugees.", "We rate Carson’s claim Mostly False.", "Facebook, \"Official Statement from Dr.Ben Carson,\" Nov. 16, 2015", "Email interview with Doug Watts, spokesperson for Ben Carson, Nov. 17, 2015", "Government Publishing Office, \"Public Law 96-212,\" March 17, 1980", "State Department, \"U.S. Refugee Admissions Program FAQs,\" May 31, 2013", "State Department, \"U.S. Refugee Admissions Program,\" accessed Nov. 17, 2015", "United Nations High Commissioner for Refugees, \"Resettlement Flow Chart,\" accessed Nov. 17, 2015", "United Nations High Commissioner for Refugees, \"Frequently Asked Questions,\" Nov. 17, 2015", "Refugee Council USA \"Security Screening of Refugees Admitted to the United States,\" Nov. 17, 2015", "State Department, \"Background Briefing on Refugee Screening and Admissions,\" Nov. 17, 2015", "PolitiFact, \"Jeb Bush: 'It takes almost a year for a refugee to be processed in the United States',\" Nov. 15, 2015", "C-SPAN, \"Homeland Security Threats,\" Oct. 8, 2015", "C-SPAN, \"National Security Threats,\" Oct. 21, 2015", "Email interview with Jessica Vaughan, director of policy studies at the Center for Immigration Studies", "Interview with David Martin, professor of immigration and international law at the University of Virginia, Nov. 17, 2015", "Email interview with Geoffrey Mock, Syrian country specialist for Amnesty International USA, Nov. 17, 2015", "Interview with Daryl Grisgraber, senior Middle East advocate for Refugees International, Nov. 17, 2015", "Email interview with Anne Speckhard, associate professor of psychiatry at Georgetown University, Nov. 17, 2015", "Interview with Shelly Culbertson, policy analyst at the RAND Corporation, Nov. 17, 2015", "PolitiFact, \"Donald Trump says if you're from Syria and a Christian, you can't come to the U.S. as a refugee,\" July 20, 2015", "Congressional Research Service, \"Immigration: Terrorist Grounds for Exclusion and Removal of Aliens,\" Jan. 12, 2010", "Congressional Research Service, \"Refugee Admissions and Resettlement Policy,\" March 6, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]