["About this rating", "In January 2018, amid a brief government shutdown and a furor over the potential deportation of recipients of the Delayed Action for Childhood Arrivals act, or DACA, a months-old meme reappeared featuring a photograph of House Minority Leader Nancy Pelosi (D-California) and a quote about how building a wall on the southern United States border \"will violate the right of millions of illegals\":", "The graphic proved popular in some conservative circles, where it was shared along with messages that insult Pelosi as dumb, clueless, or out of touch. It was also frequently attached to comments asserting (inaccurately) that the rights of \"illegals\" couldn't be violated since illegal immigrants don't have any rights to violate:", "This fake quote originally appeared in August 2017, after U.S. President Donald Trump threatened a government shutdown in order to secure funding for a border wall. Nancy Pelosi released a statement in response which labeled the wall \"immoral\" (emphasis ours):", "\"Last night, President Trump yet again threatened to cause chaos in the lives of millions of Americans if he doesn’t get his way.  Make no mistake: the President said he will purposefully hurt American communities to force American taxpayers to fund an immoral, ineffective and expensive border wall.", "“President Trump’s multi-billion dollar border wall boondoggle is strongly opposed by Democrats and many Republicans. Democrats will stand fast against the immoral, ineffective border wall and the rest of Republicans’ unacceptable poison pill riders.\"", "This fake quote began to circulate shortly after Pelosi released that statement:", "The argument might be made that this particular meme paraphrases Pelosi's attitude toward the wall. However, it naturally became incorrectly presented as though it was a direct quote from House Minority Leader:", "The idea that undocumented people can't have their rights violated because they have no rights to begin with is false. Undocumented people may not enjoy all of the Constitutional rights given to American citizens, but they do have some protections under the law. Furthermore, referring to undocumented people as \"illegal\" is not accurate, as the violation in and of itself is civil, not criminal:", "In fact, a 2006 study showed that roughly 45% of undocumented immigrants originally entered the US legally, but then remained in the country without authorization after their visas had expired.", "The penalty for this type of violation of immigration law is deportation, and according to the ACLU, \"civil removal proceedings far outnumber criminal prosecutions and remain the primary manner in which the federal authorities enforce the immigration laws.\"", "If, however, an undocumented immigrant is deported and then returns to the US without permission, then that \"illegal re-entry\" constitutes a federal offense with different tiers of accompanying prison time.", "Even so, undocumented individuals do have rights in the United States, despite concerted disinformation and propaganda efforts to obscure them. The Supreme Court ruled in 2001, for instance, that the due process clause (that is, the 14th Amendment) applies to \"all persons within the United States, including aliens, whether their presence is lawful, unlawful, temporary, or permanent.\"", "Epstein, Jennifer.   \"Trump Threatens Government Shutdown Over Border Wall Funding.\"\r\n    Bloomberg. 22 August 2017.", "Detrow, Scott.   \"Republicans And Democrats Seek Path To DACA Deal In Coming Weeks.\"\r\n    NPR. 4 January 2018.", "Contreras, Raoul.   \"Yes, Illegal Aliens Have Constitutional Rights.\"\r\n    The Hill. 29 September 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]