["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Featuring photos of furniture boxes and men in uniform handling guns, a recent Facebook post suggests that fears of Muslims immigrants are well founded.", "\"If you have doubts about Muslim migration, this may clear them up,\" reads the post, which was published on April 15. \"Border guards found 52 tons of guns and ammunition in 14 Conex containers disguised as furniture. This ‘furniture’ is from Muslim immigrants who have come to America.\"", "This post was flagged — and rightly so —  as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This claim has been around for a while, and debunked by more than one news organization. We’ll add ourselves to the list.", "In the image, the back of one of the men’s uniforms says \"O.E.A,\" not, say, \"DEA,\" the acronym for the U.S. Drug Enforcement Administration, or \"CBP,\" short for U.S. Customs and Border Protection.", "There is an American OEA—the Office of Economic Adjustment at the U.S. Department of Defense—but it’s not them, either. The image of the authorities pictured are Greek and the photos date back to 2015, when the Hellenic Coast Guard seized 5,000 shotguns and half a million rounds of ammunition found aboard a ship heading to Libya.", "You can see video the the coast guard posted of the discovery here.", "The arms were concealed by furniture and gym mats, according to 2015 story in the Independent. The ship sailed from a port in Turkey near the Syrian border and was intercepted near Crete.", "\"Greek media reportedly suggested that an offshoot of Islamic State, based in the nearby city of Sirte, was to be the final recipient,\" the story says. \"But the Turkish government claimed the weapons were destined for the Sudanese police force and were fully documented.\"", "According to a 2015 Reuters story, a Turkish foreign ministry spokesman said the ship was also carrying building materials for Libya.", "We rate this Facebook post as Pants on Fire.", "Facebook post, April 15, 2019", "Independent, \"Greek coastguards seize huge shipment of arms and ammo ‘bound for Libya,’\" Sept. 6, 2015", "YouTube, HellenicCoastguard post, Sept. 2, 2015", "Reuters, \"Greek coast guard seizes Libya-bound ship carrying weapons,\" Sept. 2, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]