["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "At a recent candidate forum in Atlanta’s mayoral race, John Eaves touted his credentials as a force for broad economic development. The former Fulton County chairman said he understands what the job requires.", "\"I’ve been there, done that,\" Eaves said. \"The current city mayor has been virtually absent in terms of regional cooperation the last eight years. As mayor of Atlanta, I’ll continue to work with regional partners.\"", "Term limits have the current mayor Kasim Reed stepping down after two terms. During his time in office, Atlanta proper has attracted new jobs. But did Reed aim to advance the city’s future without regard for the surrounding cities and counties?", "A 2013 blog post faulted Reed for failing to attend many meetings of the Atlanta Regional Commission. Between 2010 and August 2013, he missed 24 meetings out of 36 total. Only one other member of the commission board had a worse attendance record.", "That is one yardstick, but there are others to measure Reed’s presence in regional issues.", "One of Reed’s top priorities has been the deepening of the Port of Savannah, about 250 miles from the city. In 2015, the Georgia Port Authority said the port supported about 370,000 jobs across the state. Reed is credited for working with Republican lawmakers and the state’s Republican governor to push the project forward. The Trump administration has included $50 million for the nearly $1 billion effort, far short of what state and local officials sought, but a modest victory in a budget cutting environment.", "Reed has also promoted expansion of Hartsfield Jackson Atlanta International Airport, an anchor for economic development in the region. Reed struck an agreement with Delta Airlines to keep the company in Atlanta for the next two decades.", "In the latest Bureau of Labor Statistics report, the Atlanta region led among the nation’s 12 largest metropolitan areas in the rate of job growth, and ranked third overall for the number of jobs added in the past year.", "Companies that have moved to the region include Mercedes-Benz and State Farm, both of which located just outside the city of Atlanta. Symbolic of regional cooperation, the groundbreaking ceremony for the Mercedes-Benz headquarters building featured Gov. Nathan Deal, Reed and Sandy Springs Mayor Rusty Paul.", "Reed touts his push for half-a-cent increase in the Atlanta sales tax to finance a $2.6 billion expansion of the regional subway system, the Metropolitan Atlanta Rapid Transit Authority. While the work would take place inside the city, the MARTA system extends out to the surrounding cities.", "His work on regional transportation links to Eaves’ criticism of Reed. Eaves led a group of Fulton County mayors to craft a joint transportation investment plan. According to one news report, Reed chafed at having a vote that was equal to that of mayors from much smaller communities.", "Through a spokeswoman, Eaves said, \"Over the course of my tenure establishing the Mayors’ Council, Reed did not really play a role, giving off the general sense that he was more important than the other 14 mayors.\"", "But Reed did participate and remained open to a compromise approach hammered out by the group.", "Eaves said Reed has been virtually absent from regional cooperation over his eight years in office. This seems to be rooted in Reed’s attitude toward a mayors’ initiative led by Eaves. There is also some evidence that Reed failed to faithfully attend meetings of Atlanta’s Regional Commission.", "However, in terms of promoting major development activity that boosted jobs across the region, Reed was deeply involved and can take credit for playing a key role.", "Reed might have rubbed some local officials the wrong way, but for residents, tangible results matter more than style.", "There’s a sliver of truth. We rate this claim Mostly False.", "Atlanta Journal Constitution, Atlanta mayoral contenders wrestle over how to be a regional leader, Sept. 13, 2017", "Perspicacious Conservative, We teach our kids that if you skip class, you’ll fail…, Dec. 17, 2013", "Invest Atlanta, Site Selection, accessed Sept. 18, 2017", "Atlanta Journal Constitution, Kasim Reed on Port of Savannah discord: ‘Let’s not get pulled into this crap’, March 12, 2014", "Atlanta Journal Constitution, Deal, Reed say Savannah port expansion a priority, Dec. 3, 2012", "Reporter Newspapers, Mercedes-Benz USA breaks ground on new Sandy Springs headquarters, Sept. 26, 2016", "WABE, Atlanta Commits To Having Only One Commercial Airport, May 2, 2016", "Smith and Howard, The Port of Savannah: Exporting Cargo, Importing Jobs, April 2016", "U.S. Bureau of Labor Statistics, Atlanta Area Employment – July 2017, Aug. 30, 2017", "Know Atlanta, YEAR IN REVIEW: ATLANTA’S CORPORATE RELOCATIONS IN 2016, March 30, 2017", "Atlanta Journal Constitution, Trump bumps up funds for Savannah harbor deepening, but short of hopes, May 24, 2017", "Saporta Report, Fulton’s transportation stance nears consensus despite differences among mayors, Feb. 16, 2016", "National Black Caucus of State Legislators,  Cities Can Solve Our Nation’s Transportation Problems, 2013", "Email interview, Lynn-Anne Huck, spokeswoman, Eaves for Mayor, Sept. 19, 2017", "Email interview, Jenna Garland, press secretary, Atlanta Mayor Kasim Reed, Sept. 19, 2017", "Photo credit: Jody Clayborn, Atlanta skyline, via Flickr Creative Commons License", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]