["About this rating", "On 2 December 2017, the Ladies of Liberty web site published an article reporting that Robert Mueller, the former FBI director who now heads the Special Counsel investigation of Russian interference in the 2016 United States elections, would soon be resigning his position due to the disclosure of his long-term affair with House Minority Leader Nancy Pelosi:", "Robert Mueller’s steamy, 13-year affair with House Minority Leader Nancy Pelosi is going to cost him more than a little bit of embarrassment and his marriage, according to a trusted source inside the Department of Justice. Mueller will also be forced to resign from his position as Special Prosecutor for the FBI, nullifying everything that investigator has uncovered as fruit of the poisonous tree.", "Pelosi, who says her husband was well-aware of the affair, swears that Mueller was just a friend whose company she enjoyed on long, lonely working nights and weekends in Washington. The California “progressive” says her husband was afforded the same freedom to explore “pleasures of the flesh.”", "Nothing in this report was true. This story originated with Ladies of Liberty, a site that is part of a network of fake news sites dedicated to spreading political misinformation under the guise of proffering \"satire.\"", "Mueller did not step down from the Special Counsel's office until May 2019, after his report on the investigation into Russian interference had been completed and delivered.", "Eagleton, Loreli.   \"Mueller Will Be Forced to Resign Over Pelosi Affair.\"\r\n    Ladies of Liberty.   2 December 2017.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]