["About this rating", "Attempting to assign any kind of status to this 2007 collection of purported quotes by Hillary Rodham Clinton poses something of a problem.  All of them have appeared in print as things the former first lady and current U.S. senator from New York supposedly said (although some of them are missourced in the example reproduced above), but they are stripped of explanatory context (and/or accompanied by misleading explanations), and they range from scripted public statements to spontaneous private utterances, from reports by mainstream journalists to revelations by unnamed or anonymous sources to mere hearsay repetition of rumor.", "We have attempted to trace each entry back to its first print source, provide a reasonably full context for the given quote, and note where the print source came by its information:", "While this quote is included in more than one book about the Clintons, its original source was a January 1994 American Spectator article by David Brock, who interviewed four state troopers who had worked for the Clintons while Bill Clinton was governor of Arkansas.  The quote was taken from information provided by Arkansas state trooper Larry Patterson:", "The troopers were also objects of Hillary's wrath. Patterson recalled the early morning of Labor Day in 1991, when Hillary came out of the mansion, got in her car, and drove off. Within a minute or so of leaving the gate, her aging blue Cutlass swung violently around and came charging back onto the grounds, tires squealing in the dust. \"I thought something was terribly wrong, so I rushed out to her. And she screamed, 'Where is the goddamn f -- -ing flag?' It was early and we hadn't raised the flag yet. And she said, 'I want the goddamn f -- -ing flag up every f -- -ing morning at f -- -ing sunrise.'\"", "But in 1998, David Brock himself expressed skepticism about the validity of some of the claims he made in his American Spectator \"Troopergate\" article and doubts about the truthfulness of the sources he depended on for it:", "I guess that I should confess that as the author of the infamous piece, I think \"proving Troopergate\" may be a tall order. I was as sure of that story when I wrote it as any journalist can be of any story. But in the years since then, the troopers have greatly damaged their credibility.", "I'm sure you remember that during the Senate Whitewater hearings, the troopers made fools of themselves with improbable claims about the circumstances of Vincent Foster's death. One of the two troopers who went on the record with me, Larry Patterson, helped promote the infamous Clinton Chronicles, a crackpot video accusing [Bill Clinton] of drug running and murder. Patterson was also recently cited as a source for The Secret Life of Bill Clinton, by British journalist Ambrose Evans-Pritchard. So I've had occasional pangs of doubt: Is it possible that they took me for a ride, embellishing their account for fame and fortune?", "\"You sold out, you mother f**ker! You sold out!\"", "Attorney Joseph Califano worked in the Pentagon under Robert McNamara (who was Secretary of Defense during the Kennedy and Johnson administrations), served as an aide to President Lyndon B. Johnson, and held the cabinet position of Secretary of Health, Education, and Welfare in the Carter administration, and he remained involved in national politics while in private practice.  In 1970, when Senator Walter Mondale (then chairman of the Subcommittee on Migratory Labor, under the Senate Committee on Labor and Public Welfare) was conducting an investigation into migrant labor problems, Califano was retained by Coca-Cola chairman and CEO Paul Austin to represent that company.  (Coca-Cola was involved in the issue Mondale was investigating due to its 1960 acquisition of Minute Maid, whose Florida groves employed migrant farm workers.)   According to Califano's 2004 memoir (Inside: A Public and Private Life), Hillary Rodham, then a first-year law student at Yale, was present at the Senate hearings and chastised him for daring to represent corporate interests:", "On July 24, 1970, at 10 A.M., the hearings were held in the Senate Caucus Room in the Russell Building, the scene of many great Senate confrontations, include the McNamara muzzling-the-military hearings, which I had lawyered almost ten years earlier.  As [Paul] Austin, [Coca-Cola food division head] Luke Smith, and I entered the Caucus Room on that steamy Washington morning, it was so jammed with spectators that many were standing and sitting on the floor. A large number were student interns working on the Hill that summer, angry about Nixon's bombing Cambodia, dispirited about the four students killed at Kent State University that May.  Many in that room had been among the 100,000 young Americans who had earlier that summer clogged the city to protest the war. Anti-establishment fervor, at a fever pitch that July, was palpable in the hearing room.", "About half way down the aisle, a young woman with dark hair and thick-rimmed glasses abruptly came in front of me and said, \"You sold out, you motherfucker, you sold out!\" I kept walking, pretending to ignore her. Two and a half years later, at 11:00 A.M. on Monday March 19, 1973, that same young woman walked into my office at Williams, Connolly & Califano for a job interview. It was Hillary Rodham, who was graduating from Yale Law School later that year. Neither of us mentioned the incident in the Senate Caucus Room. I offered her a job, but she decided to go to Arkansas rather than practice law in Washington.", "An endnote indicates Califano confirmed the date and time of Hillary Rodham's 1973 interview at his firm through a notation in his daily calendar, but how he recognized her from having encountered her fleetingly on a single occasion years earlier is not explained.  (No other reference to her appears in the book, and Califano said the Senate incident wasn't mentioned by either party during the interview.) Possibly he crossed paths with Hillary Rodham at other times, or had other opportunities for learning about who she was, that were not mentioned in his memoirs.", "\"It's been said, and I think it's accurate, that my husband was obsessed by terrorism in general and al-Qaida in particular.\"", "On 16 April 2004, Dateline NBC aired an interview with New York's junior senator, Hillary Rodham Clinton, conducted by Katy Couric.  The following question-and-answer exchange regarding the 9/11 Commission (which was then investigating the September 11 terrorist attacks upon the United States) was part of that interview:", "Couric: \"How do you feel when people say, 'Well the Clinton administration should've done this, they should've responded more forcefully to the USS Cole. There were many things that could've been done prior to the Bush administration taking over, things that weren't done.'\"", "Clinton: \"I think that is one of the questions that this commission should help us answer. It's been said, and I think it's accurate, that my husband was obsessed by terrorism in general and al-Qaida in particular.  And they did a lot. But there's always room for analysis about what more could've or should've been done. And I think that's true with the Bush administration.\"", "Chapter 4 of the 9/11 Commission Report (\"Responses to Al Qaeda's Initial Assaults\"), issued a few months later, noted:", "[White House Terrorism Advisor Richard] Clarke hoped the August 1998 missile strikes [launched by the Clinton administration against Bin Ladin camps in Afghanistan] would mark the beginning of a sustained campaign against Bin Ladin. Clarke was, as he later admitted, \"obsessed\" with Bin Ladin, and the [August 1998] embassy bombings [in Kenya and Tanzania] gave him new scope for pursuing his obsession. Terrorism had moved high up among the President's concerns, and Clarke's position had elevated accordingly.", "\"I have to admit that a good deal of what my husband and I have learned [about Islam] has come from our daughter.\"", "The first U.S. presidential reception celebrating Eid al-Fitr, the Muslim fast-breaking festival that marks the end of the holy month of Ramadan, was held at the Old Executive Office Building on 20 February 1996.  On that occasion, First Lady Hillary Rodham Clinton addressed about 180 Muslims in attendance, including members of the American Muslim Council.  The web site truthinmedia.org reported the following about her remarks at that reception:", "I have to admit that a good deal of what my husband and I have learned (about Islam) has come from my daughter,\" said Hillary Clinton, addressing the members of the American Muslim Council (AMC) at the first-ever White House celebration of Eid al-Fitr (a Muslim religious holiday) on February 20, 1996. \"(As) some of you who are our friends know, she (Chelsea) took a course last year in Islamic history.\"", "Chelsea has been educating her parents about Islam ever since, the First Lady explained. As she accepted the two AMC gifts of Qur'an, the Muslim holy book, Mrs. Clinton said: \"I am honored to have these gifts ... one for my husband, and one for me, as Chelsea already has her copy.\"", "As the Washington Post noted of that same event:", "American Muslims marked a milestone in the growth and acceptance of Islam in the United States with the first presidential reception to celebrate the end of the holy month of Ramadan.", "\"It's only fitting that, just as children and families of other faiths come here to celebrate their holy days ... [Muslims] come here, too,\" first lady Hillary Rodham Clinton said at the family event in the Old Executive Office Building.", "The reception marked the day Muslims call Eid al-Fitr — the feast of the fast-breaking. It signals the end of Ramadan, a month of self-reflection and self-imposed discipline during which observant Muslims do not eat or drink during daylight hours.", "Clinton called the Eid \"an American event\" and said White House recognition of the holiday was \"historic and overdue.\" She said Muslims — who number as many as 5 million in the United States — were the latest immigrant group to enrich the United States by contributing to its religious heritage.", "About 180 Muslims attended the reception. Besides African American converts, immigrant Muslims from the Middle East, India, Pakistan, Indonesia and elsewhere were in attendance.", "Khaled Saffuri, assistant executive director of the American Muslim Council, a Washington-based public-policy agency, said the Clinton White House has been more welcoming to Muslims than any previous administration. \"We have asked before for recognition of the Eid, but our request always went unanswered,\" he said.", "\"F**k off! It's enough that I have to see you shit-kickers every day, I'm not going to talk to you too!! Just do your G*damn job and keep your mouth shut.\"", "This quote is taken from Christopher Andersen's 2004 book, American Evita:", "[Hillary] also resented [the state troopers'] constant presence and the loss of privacy that entailed. At times, a simple \"Good morning, Mrs. Clinton\" could provoke an attack. \"Fuck off!\" she would bark. \"It's enough that I have to see you shit-kickers every day. I'm not going to talk to you, too. Just do your goddamn job and keep your mouth shut.\"", "The endnotes for the corresponding chapter reference a number of conversations and print articles but don't indicate which might have been the source for this putative quote.", "\"If you want to remain on this detail, get your f**king ass over here and grab those bags!\"", "This quote appears in Joyce Milton's 1999 book, The First Partner, but no source is provided for it — the statement is simply reported (without detail) as a comment the First Lady purportedly made to an unnamed \"agent\":", "One [Secret Service] agent, who politely explained to Mrs. Clinton that his duties did not include toting suitcases from their airplane to their limo, was shocked when she replied, \"If you want to remain on this detail,\" get your fucking ass over here and grab those bags.\"", "\"Get f**ked! Get the f**k out of my way!!! Get out of my face!!!\"", "This statement is taken from the 2003 book Hillary's Scheme, where it is quoted from a February 2000 article published in the supermarket tabloid Star and attributed to an unidentified \"informed source\":", "Star has learned that on nearly a dozen occasions in the last three months, Hillary has viciously lashed out at numerous Secret Service agents for getting in her way — or for simply doing their jobs ... A young Secret Service officer stationed at the South Portico says he did nothing more than smile and say, 'Good morning, Mrs. Clinton.' Mrs. Clinton brushed by him, actually shoving him out of her way, an informed source tells Star. As she did, she snapped at him and cursed, 'Get f____d!'", "That officer made a report of Mrs. Clinton's behavior to his superiors and Star has learned that about 10 other similarly ugly incidents have also been reported in recent months. In other cases she is reported to have said such things as: 'Get the f___ out of my way!' Or, 'Get out of my face!'", "\"Stay the f**k back, stay the f**k away from me! Don't come within ten yards of me, or else! Just f**king do as I say, Okay!!!?\"", "This quote is taken from (the 1998 edition of) former FBI agent Gary Aldrich's 1996 book, Unlimited Access.  The passage in which it appears is part of a section detailing President Clinton's supposed habit of sneaking out of the White House to evade his Secret Service detail while on his way to trysts at a nearby hotel and is attributed to an unnamed source identified as \"a senior law enforcement officer with more than twenty years' service in a federal agency\":", "My source used the term \"the first family\" rather than simply \"the president\" because he says Hillary Clinton is as bad as the president. She has told her Secret Service Protective Detail agents in public to \"Stay the f--k back, stay the f--k away from me! Don't come within ten yards of me, or else!\" When the agents have tried to explain to the first lady that they cannot effectively guard her if they must remain so far away, her reply is, \"Just f--king do as I say, okay?\"", "In 1997, David Brock, author of the American Spectator \"Troopergate\" article cited above, wrote of Aldrich's book:", "In his best-selling exposé on the Clinton White House, Aldrich reported as fact a wild rumor about Bill Clinton sneaking out of the White House to a Marriott hotel to meet women for trysts. Because Aldrich had been assigned to the White House during the first two years of the Clinton presidency, I had asked him about this piece of gossip, which I'd heard while I was digging for damaging material for my own book. He told me then that he knew nothing about the rumor.  [After Unlimited Access was published,] I called Aldrich, who verified that I, in fact, was the sole source for his supposed scoop.", "My public comments, other glaring holes in the book, and Aldrich's loopy tales of X-rated ornaments on the White House Christmas tree led the mainstream press to deep-six Unlimited Access. But as someone who tries hard to practice credible journalism from a conservative perspective, I was outraged when conservative outlets ... let Aldrich brazen it out and perpetrated a hoax on the public by celebrating Unlimited Access as legitimate and well-researched.", "\"Many of you are well enough off that [President Bush's] tax cuts may have helped you. We're saying that for America to get back on track, we're probably going to cut that short and not give it to you. We're going to have to take things away from you on behalf of the common good.\"", "On 28 June 2004, New York senator Hillary Clinton appeared at a San Francisco fund-raising event for California senator Barbara Boxer, where she explained that Democrats hoped to overturn tax cuts enacted by the Bush administration that they felt had unfairly favored the wealthy over middle- and lower-class taxpayers.  Senator Clinton was not addressing her remarks to the general public; she was speaking to a group of mostly well-off Democratic supporters who had paid several thousand dollars each to attend the event:", "Headlining an appearance with other Democratic women senators on behalf of Sen. Barbara Boxer, who is up for re-election this year, Hillary Clinton told several hundred supporters — some of whom had ponied up as much as $10,000 to attend — to expect to lose some of the tax cuts passed by President Bush if Democrats win the White House and control of Congress.", "\"Many of you are well enough off that ... the tax cuts may have helped you,\" Sen. Clinton said. \"We're saying that for America to get back on track, we're probably going to cut that short and not give it to you. We're going to take things away from you on behalf of the common good.\"", "\"Why do I have to keep proving to people that I am not a liar?!\"", "In his 2005 book about Bill Clinton in the White House, The Survivor, John F. Harris (a Washington Post national correspondent who covered the Clinton administration for six years) wrote of Hillary Clinton's 2000 campaign for a seat representing New York in the U.S. Senate:", "One way that [Hillary] was not like her husband was in how she responded to the rigors of political combat. Criticism might make him indignant in the moment, but he regarded it as part of the game; he was resilient. She, however, was sensitive. Beneath a tough exterior, criticism was personal and painful to her. During one sordid moment in summer 2000, a character from the president's Arkansas past surfaced, leveling charges of anti-Semitic utterances by Hillary Clinton. The alleged episode was more than a quarter century old, from Clinton's unsuccessful 1974 campaign for Congress. Hillary Rodham, not yet married to Clinton, supposedly hurled the epithets at a campaign staff aide in an argument. An angry dressing-down was certainly plausible; crude religious epithets were not. After denying them heatedly in public, she privately began to sob to an aide, \"Why do I keep having to prove that I am not a liar?\"", "The endnotes to Harris' book indicate his source for this quote was an interview with an unnamed Hillary Clinton adviser.", "\"Where's the miserable c*ck sucker?", "This quote appears in Edward Klein's 2005 book, The Truth About Hillary. As with much of the information contained in that work, the documentation behind this quote is rather weak:  no details of when, where, or other context are provided, and the source was apparently an interview subject who was simply repeating a rumor he'd heard rather than relating an account of something he'd witnessed:", "Another time, it was reported, she had burst into a room looking for her husband, and shouted at a Secret Service officer, \"Where's the miserable cocksucker?\"", "\"No matter what you think about the Iraq war, there is one thing we can all agree on for the next days — we have to salute the courage and bravery of those who are risking their lives to vote and those brave Iraqi and American soldiers fighting to protect their right to vote.\"", "On 28 January 2005, the following statement on the upcoming Iraqi elections was posted to Senator Hillary Rodham Clinton's web site at clinton.senate.gov:", "\"No matter what you think about the Iraq war, there is one thing we can all agree on for the next days - we have to salute the courage and bravery of those who are risking their lives to vote and those brave Iraqi and American soldiers fighting to protect their right to vote. They are facing terrorists who have declared war on democracy itself and made voting a life and death process. We hope this vote succeeds and pray for a safe election day.\"", "\"Put this on the ground! I left my sunglasses in the limo. I need those sunglasses. We need to go back!\"", "This passage is taken from Dereliction of Duty, a 2003 book by Air Force Lt. Colonel Robert Patterson (who served as a military aide to President Clinton for two years):", "On a similar trip, as we lifted off a helicopter pad in Marine One en route to Air Force One for the journey home, Hillary suddenly shouted, \"Put this back on the ground! I left my sunglasses in the limo.\" By this time, however, Marine One was safely scooting to an awaiting 747. The required support for even a helicopter flight was involved and extensive. The Secret Service, White House Communications Agency, and administration staff were pulling down communications lines, lifting barricades, and driving off in vehicles.", "\"Ma'am,\" my fellow military aide responded, \"we can't safely do that.\"", "\"I need my sunglasses. We need to go back!\"", "The onboard Secret Service agent chimed in, \"Yes, ma'am, the milaide is correct. That wouldn't be wise.\" She acquiesced, but not without obvious disdain in her eyes.", "\"A right-wing network was after his presidency ... including perverting the Constitution.\"", "During a Barbara Walters interview with Senator Hillary Rodham Clinton that was aired on the ABC news magazine program 20/20 on 8 June 2003 (corresponding with the upcoming release of the latter's new book, Living History, the next day), the following question-and-answer exchange took place:", "Walters: \"If I asked you straight out, was there and is there a right wing conspiracy to destroy your husband's Presidency, would you today say yes?\"", "Clinton: \"I would say that there is a very well financed right-wing network of people that was after his Presidency from the very beginning. Really stopped at nothing, even to the point of perverting the Constitution in order to undermine what he was trying to do for the country.\"", "This statement echoed a similar remark Hillary Clinton had made five years earlier (27 January 1998) during an interview with Matt Lauer aired on NBC's The Today Show:", "Lauer: \"I'm sure you like [Democratic political strategist James Carville], especially at this time. He has said that [the Monica Lewinsky scandal] is war between the president and Kenneth Starr. You have said, I understand, to some close friends, that this is the last great battle, and that one side or the other is going down here.\"", "Clinton: \"Well, I don't know if I've been that dramatic. That would sound like a good line from a movie. But I do believe that this is a battle. I mean, look at the very people who are involved in this, they have popped up in other settings. This is the great story here, for anybody willing to find it and write about it and explain it, is this vast right-wing conspiracy that has been conspiring against my husband since the day he announced for president. A few journalists have kind of caught onto it and explained it, but it has not yet been fully revealed to the American public. And, actually, you know, in a bizarre sort of way, this may do it.\"", "In the aforementioned book The Survivor, John F. Harris recounts Hillary Clinton's addressing her 1998 statement during the first televised debate of the 2000 Senate campaign in New York:", "[Hillary] grasped control of the race for good one September evening in Buffalo. It was the first televised debate between her and [Republican candidate Rick] Lazio. Buffalo native Tim Russert, the NBC newsman, was on hand to moderate. It was a crackling evening of charge and countercharge, of the conventional political sort, when Russert took the debate in a personal direction. He recalled the day, nearly three years back, when she had blamed the newly erupted Lewinsky scandal on a \"vast right-wing conspiracy.\" Since the Lewinsky allegations had turned out to be true, he asked her, did she regret having misled the nation? Seemingly taken aback by the bluntness of the question, she grabbed a breath and slowly and deliberately answered. \"That was a very painful time for me, my family, and our country,\" she said. \"Obviously, there's a great deal of pain involved with that.\"", "\"Son of a bitch.\"", "In American Evita, Christopher Andersen wrote the following about Senator Clinton's 2003 Thanksgiving holiday visit with U.S. Troops in Afghanistan and Iraq:", "After she left the dining hall [at Bagram Air Base in Afghanistan], Hillary learned the stunning news: President Bush had made an unannounced, lightning-swift trip to Iraq, where he served Thanksgiving dinner to American troops before chowing down with them. For security reasons, the top-secret mission remained under wraps until the President was safely on his way home. Back in the U.S., video of the President's surprise visit — and his emotional reaction when the troops leaped to their feet to cheer  him — preempted virtually all television programming for hours. It was a major news event, and an undeniable coup for the President. Hillary put on a dignified front in front of the troops, but when she thought she was out of earshot she mumbled her reaction to Bush's preemptive visit: \"Son of a bitch.\"", "As throughout Andersen's book, the endnotes for the corresponding chapter reference a number of conversations and print articles but don't indicate which might have been the source for this putative quote.", "\"What are you doing inviting these people into my home? These people are our enemies! They are trying to destroy us!\"", "John F. Harris wrote in The Survivor that:", "Far more than her husband, [Hillary] harbored deep suspicion about the motives and tactics of political opponents. One day that fall [of 1993] she got word that a political aide, Rahm Emanuel, who was helping to try to pass the NAFTA legislation, had planned an event for the White House East Room. Many wavering legislators would be invited to hear a bipartisan delegation, including former Republican secretary of state James A. Baker, speak in support of the measure. Emanuel expected praise for creative use of the elegant White House social room, something he believed the administration had been too shy in using to win support for its goals. Instead, he picked up the phone to hear the first lady calling from Camp David, nearly sobbing in anger: \"What are you doing inviting these people in my home?\" she said. \"These people are our enemies. They are trying to destroy us.\"", "Harris' endnotes indicate his source for this quote was interviews with (unnamed) West Wing aides.", "\"I mean, you've got a conservative and right-wing press presence with really nothing on the other end of the political spectrum.\"", "During an interview with First Lady Hillary Rodham Clinton conducted by Steve Scully (aired on the C-SPAN cable channel on 17 January 1997), the following question-and-answer exchange took place:", "Scully: \"Do you think there's a bias in the press?\"", "Clinton: \"No, I don't think there's a bias but I think there are a lot of factors at work that are very interesting and that, as an observer of the press, I find worth thinking about. There certainly is an advocacy press. There is a very effective, well-organized advocacy press that is, I think, very up front in its right-wing, conservative inclinations and makes no apologies. And I have no problem with that. That's absolutely their right.", "There's not something comparable to that. If there were left in the United States something called the left wing or the liberal press, there's no balance there. I mean, you've got a conservative and/or right-wing press presence with really nothing on the other end of the political spectrum, so that most of what is left in what you might call the middle or the establishment or the mainstream tries to be objective and tries to be thoughtful. But it is difficult sometimes to strike the right balance when you get constantly — and I have friends in the press who tell me they get constant faxes from the, you know, right-wing think tanks and the right-wing publications, and there's a, you know, real concerted advocacy effort which is quite effective. There's nothing really to counterbalance that. So I don't know that there's a bias in the mainstream press, but I think it's difficult to get a well-argued presentation of issues that is really reflective of different points of view in the media today.", "Hillary Clinton did not really say (as claimed in the text accompanying this quote) that the \"mainstream media are all conservatives in her opinion\" (in fact, she stated twice during this portion of the interview that she didn't believe there was a bias in the mainstream press), but rather that she thought there was no liberal or left-wing equivalent to what she termed the political \"advocacy press.\"", "\"Come on Bill, put your dick up! You can't f**k her here!!\"", "This is another quote that originated with David Brock's January 1994 American Spectator article and was taken from information provided by Arkansas state trooper Larry Patterson:", "When [Bill] Clinton spent an inordinate amount of time speaking with an attractive woman at a public event — apparently a common occurrence — several troopers said they have heard Hillary complain bitterly. \"She would say, Come on Bill, put your dick up. You can't f--k her here,\" as Patterson remembered the unforgettable phrasing.", "(As noted above, David Brock later expressed skepticism about the truth of Patterson's accounts.)", "\"You know, I'm going to start thanking the woman who cleans the restroom in the building I work in. I'm going to start thinking of her as a human being.\"", "These words were spoken by First Lady Hillary Rodham Clinton during an interview with Michael Kelly for a 1993 New York Times magazine piece, but the context presented here is completely misleading:  Ms. Clinton did not say this about herself; she offered it as a hypothetical example of something someone else might think to himself:", "If you break down the Golden Rule or if you take Christ's commandment — Love thy neighbor as thyself — there is an underlying assumption that you will value yourself, that you will be a responsible human being who will live by certain behaviors that enable you to have self-respect, because, then, out of that self-respect comes the capacity for you to respect and care for other people.", "And how do we just break this whole enterprise down in small enough pieces? Well, somebody says to themselves: 'You know, I'm not going to tell that racist, sexist joke. I don't want to objectify another human being. Why do I want to do that? What do I get out of that kind of action? Maybe I should try to restrain myself.'", "Or maybe somebody else says: 'You know, I'm going to start thanking the woman who cleans the restroom in the building that I work in. You know, maybe that sounds kind of stupid, but on the other hand I want to start seeing her as a human being.'", "\"You show people what you're willing to fight for when you fight your friends.\"", "At the end of January 1993 (just weeks after being inaugurated for his first term of office), President Clinton arranged a weekend retreat for his cabinet and senior White House staff at Camp David to discuss the direction he hoped his administration would take.   After the President spoke, according to journalist Bob Woodward (as reported in his 1994 book, The Agenda), First Lady Hillary Clinton \"took the floor to address some practical questions\":", "The problems from the 12-year Republican mess would not be solved overnight, she said. The administration would have to communicate to people that the country was going on a journey — a long journey, with milestones along the way to mark progress.", "Let me tell you how this guy works and how we operated in Arkansas, she said. During his first term as governor, he set about attacking all the problems at once. He was the darling of the reform-minded, liberal press. But he didn't communicate a vision or describe the journey he intended. In 1980, she said, when Clinton lost his bid for reelection as governor, the lack of a coherent story had disconnected him from the people he was trying to help. In 1983, when he came back, they had devised a simple story, with characters, with an objective, with a beginning, middle, and end. And it had all come from a moral point of view.", "They had taken on education reform, the hardest issue, whose benefits would not be seen for a generation. Talk about a long journey, she said. They realized the need for a story, complete with enemies and villains. They even villainized the teachers' union, which had been their ally, for resisting \"accountability\" when it opposed teacher testing.", "\"You show people what you're willing to fight for when you you fight your friends,\" Hillary said. Though the battle was long and a painful political experience, there were benchmarks of progress every two years or so along the way: Class sizes shrank, teacher testing was implemented, reading scores improved slightly. \"It took years to see results,\" she said. But by the end of Clinton's time as governor, people understood his commitment to education was genuine. Isolated initiatives worked less well, she added. \"People have got to understand where he wants to take the country.\"", "Woodward doesn't cite specific sources in his book, noting in the Acknowledgements section at the end that \"virtually all the information in this book comes from my own reporting.\"", "\"We are at a stage in history in which remolding society is one of the great challenges facing all of us in the West.\"", "Although this quote is cited in some books as such, it did not come from a commencement address delivered by First Lady Hillary Rodham Clinton at the University of Texas (UT) at Austin in 1993.  (According to the Houston Chronicle, the 1993 commencement speaker at that school was the university's president, Robert Berdahl, not Hillary Clinton.)  Rather, this is a sentence taken from Hillary Clinton's appearance at UT on 6 April 1993, where she was honored by the Liz Sutherland Carpenter Distinguished Lectureship and gave a talk entitled \"Remolding Our Society,\" which opened thusly (as recorded in Michael Lerner's The Politics of Meaning):", "We are at a stage in history in which remolding society is one of the great challenges facing all of us in the West. If one looks around the Western world, one can see the rumblings of discontent, almost regardless of political systems, as we come face to face with the problems that the modern age has dealt us.", "And if we ask, why is it in a country as wealthy as we are, that there is this undercurrent of discontent, we realize that somehow economic growth and prosperity, political democracy and freedom, are not enough — that we lack meaning in our individual lives and meaning collectively; we lack a sense that our lives are part of some greater effort, that we are connected to one another.", "All of us face a crisis of meaning. Coming off the last years when the ethos of selfishness and greed were given places of honor never before accorded them, it is certainly timely to ask about this problem.", "This problem requires all of us to play a role in redefining what our lives are and what they should be ...", "\"The only way to make a difference is to acquire power.\"", "This quote is found in another Christopher Andersen work about the Clintons, his 1999 book Bill and Hillary: The Marriage:", "As her senior year drew to a close, Hillary pondered what to do after graduation. Even though she adhered generally to his anti-establishment philosophy (\"You know, I've been on this kick for twenty-five years,\" she would say after becoming First Lady), Hillary turned down an offer to work with [Saul] Alinsky as a paid community organizer in Chicago. \"She just didn't think she could bring about real social change that way,\" said her political science professor, Alan Schechter. According to Schechter, who gave Hillary's senior thesis an A, she wrote that \"organizing the poor for community actions to improve their own lives may have short-term benefits for the poor but would never solve their major problems. You need much more than that. You need leadership programs, constitutional doctrines.\"", "\"The only way to make a real difference,\" Hillary told one friend, \"is to acquire power.\" According to Schechter, his prize pupil decided the best way to accomplish this was by finding a way to \"use the legal system\" as an agent of change.", "As is common in Andersen's books, the endnotes for the corresponding chapter reference a number of conversations and print articles but don't indicate which might have been the source for this putative quote.", "\"We just can't trust the American people to make those types of choices ... Government has to make those choices for people\"", "This quote comes from a conversation relayed by Rep. Dennis Hastert of Illinois, then the chairman of the Republicans' House task force on health care, at a 1993 meeting with Hillary Clinton (as reported in David Brock's The Seduction of Hillary Rodham):", "Dennis Hastert ... began meeting in February [1993] with Clinton administration officials as part of an effort to craft a bipartisan approach to [health care] reform.  One evening in June 1993, a group of Republican congressmen, including Hastert, met with Hillary at the Alexandria home of Republican Representative John Kaisch of Ohio. One of Hastert's ideas under discussion that night would have allowed employers the option of establishing medical savings accounts for their employees as an alternative to a government-managed system. Under Hastert's plan, employers would put the money they were willing to spend into tax-deferred accounts. Employees would be encouraged to buy high-deductible catastrophic care policies and pay for rudimentary services with the remainder of the money. At the end of the year, the unused funds could be rolled over tax-free into the next year and, like an IRA, be withdrawn at retirement. Hastert and other advocates believed that as people shopped around for insurance and spent their own money to purchase care, costs would be controlled and competition enhanced. But critics said the accounts would benefit healthier people, who would spend less than what employers contributed, and hurt the poor, who might pay higher premiums as healthier and wealthier people formed their own insurance purchasing pools.", "Hastert soon concluded that there was little common ground on which to negotiate with the administration. \"I guess the straw on the camel's back was a meeting that I had one evening with Mrs. Clinton,\" Hastert recalled:", "I mentioned ... to the first lady about medical savings accounts and just right away she said, \"We can't do that.\" And I said, \"Well, why?\" And she said, \"Well, there's two reasons.\" And I said, \"Well, what are they?\" [And she said] \"The first reason is with the medical savings account, people have to act on their own and make their own decisions about health care. And they have to make sure that they get the inoculations and the preventative care that they need, and we just think that people will skip too much because in a medical savings account if you don't spend it, you get to keep it or you can ... accumulate it in a health care account. We just think people will be too focused on saving money and they won't get the care for their children and themselves that they need. We think the government, by saying, 'You have to make this schedule. You have to have your kids in for inoculations here, you have to do a prescreening here, you have to do this' — the government will make better decisions than the people will make, and people will be healthier because of it.\" I said, \"Well, part of that's an education process. People have to understand that [if] they behave in a certain way, they're going to save money, [with the] preventive medicine issue — you get the prescreenings, if you can inoculate your kids you save money on it. I mean, they're not sick. You save money.\" She said, \"No. We just can't trust the American people to make those types of choices ... Government has to make those choices for people.\"", "\"I am a fan of the social policies that you find in Europe.\"", "In a 3 March 1996 Booknotes discussion with Brian Lamb about her recent published book, It Takes a Village: And Other Lessons Our Children Teach Us, First Lady Hillary Rodham Clinton said:", "Lamb: \"You talk about both the French and the Germans [in your book]...\"", "Clinton: \"Right.\"", "Lamb: \"... as having some things that are better than what we do here [in the U.S.].\"", "Clinton: \"And other cultures as well.\"", "Lamb: \"How about the Germans?\"", "Clinton:  \"Well, I am a fan of a lot of the social policies that you find in Europe, and I know that they, too, are going through a rethinking about how to afford some of their policies. But in my conversations with people like Chancellor [Helmut] Kohl or President [Jacque] Chirac, they are not talking about cutting back on their support for families to the extent that they are talking about doing some other things that would free up some dollars for the economy. That's because they see raising children as a social obligation, not just a parental obligation, even though parents have the primary responsibility, so that the kind of leave policies that they have for employees, particularly young mothers taking care of babies — the health-care policy in Germany that is a public-private mixture is something that I think is worth looking at.", "\"The visiting nurses program in England where people come into the home to try to make sure the parents know what they're doing, and that's for everybody from Princess Di down to a single teen-age mother. There's just more of a recognition that the entire society has a stake in making sure parents do as good a job as they can.\"", "Aldrich, Gary.   Unlimited Access.\r\n    Washington, D.C.: Regnery Publishing, 1998.   ISBN 0-89526-454-4   (p. 139).", "Andersen, Christopher.   American Evita: Hillary Clinton's Path to Power.\r\n    New York: HarperCollins, 2004.   ISBN 0-06-056254-4   (pp. 90, 258-259).", "Andersen, Christopher.   Bill and Hillary: The Marriage.\r\n    New York: William Morrow, 1999.   ISBN 0-688-16755-1   (p. 100).", "Brock, David.   \"Living with the Clintons.\"\r\n    The American Spectator.   January 1994.", "Brock, David.   The Seduction of Hillary Rodham.\r\n    New York: Free Press, 1996.   ISBN 0-684-83451-0   (p. 333-334).", "Brock, David.   \"Confessions of a Right-Wing Hit Man.\"\r\n    Esquire.   July 1997   (p. 52).", "Brock, David.   \"Letter to the President.\"\r\n    Esquire.   April 1998   (p. 60).", "Califano Jr., Joseph A.   Inside: A Public and Private Life.\r\n    New York: Public Affairs, 2004.   ISBN 1-58648-230-0   (p. 212-213).", "Clinton, Hillary Rodham.   \"Statement of Senator Hillary Rodham Clinton on the Iraqi Elections.\"\r\n    http://clinton.senate.gov/news/statements/details.cfm?id=233875   28 January 2005.", "Couric, Katie.   \"Hillary Clinton Talks Politics and Future.\"\r\n    Dateline NBC.   16 April 2004.", "Fouhy, Beth.   \"San Francisco Rolls Out the Red Carpet for the Clintons.\"\r\n    San Diego Union-Tribune.   29 June 2004.", "Harris, John F.   The Survivor: Bill Clinton in the White House.\r\n    New York: Random House, 2005.   ISBN 0-375-50847-3   (pp. 98-99, 382-383).", "Kelly, Michael.   \"Saint Hillary.\"\r\n    The New York Times.   23 May 1993   (Magazine; p. A1).", "Klein, Edward.   The Truth About Hillary.\r\n    New York: Sentinel HC, 2005.   ISBN 1-59523-006-8   (p. 15).", "Lerner, Michael.   The Politics of Meaning: Restoring Hope and Possibility in an Age of Cynicism.\r\n    New York: Perseus Books, 1996.   ISBN 0-201-15489-7   (p. 311-312).", "Limbacher, Carl.   Hillary's Scheme.\r\n    New York: Three Rivers Press, 2003.   ISBN 1-4000-5295-5   (p. 89).", "Milton, Joyce.   The First Partner: Hillary Rodham Clinton.\r\n    New York: William Morrow, 1999.   ISBN 0-688-15501-4   (p. 259).", "Patterson, Robert.   Dereliction of Duty.\r\n    Washington, D.C.: Regnery Publishing, 2003.   ISBN 0-895-26140-5   (pp. 71-72).", "Woodward, Bob.   The Agenda: Inside the Clinton White House.\r\n    New York: Simon & Schuster, 1994.   ISBN 0-671-86486-6   (pp. 108-110).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]