["The one-minute, 33-second clip was published on Facebook here on September 4, 2019. It has been shared more than 5,000 times.", "The text on the right hand side of the video states: “Germany’s premier football team Borussia Dortmund honors Prophet.”", "Below is the screenshot of the misleading Facebook post:", "The post's Indonesian-language caption translates to English as: “Mashallah, hundreds of thousands of spectators of the German League, forming a ‘configuration’ to honor Prophet Muhammad PBUH. German is one of European countries which has the fastest development of Islam because of local convert Ustaz Pierre Vogel. Its government also lets citizens choose their beliefs.”", "Borussia Dortmund is a football club based in the German city of Dortmund.", "“Mashallah” is an Arabic phrase which means this is what God wills. It is also used to express praise.", "“PBUH” means peace be upon him.", "“Ustaz” is a title given to a Muslim preacher. Pierre Vogel is a former German boxer and convert to Islam. He is described as “Germany's most influential Salafist preacher”, in this article published by Britain's Daily Telegraph newspaper.", "The same video was published on Facebook post here, here and here with a similar claim.", "The video is being shared in a misleading context; it actually shows football fans at a Saudi Professional League match in Jeddah, Saudi Arabia.", "AFP found this 57-second high-definition video published on the official YouTube channel for an Arabic language media site on February 21, 2015. It shows the same scene as the first 57 seconds of the video in the misleading posts. The video is embedded below.", "The video's Arabic title translates to English as: \"‘Dear prophet messenger of God’ message by Al Ittihad’s Saudi club fans.”", "The caption states: “Al Ittihad fans raise ‘Dear Prophet Messenger of God’ message during a match in the Saudi league.”", "Below is a screenshot comparison between the video in the misleading posts (L) and the 2015 YouTube video (R):", "An Arabic-speaking AFP journalist analysed the footage. The Arabic letters formed by the spectators translate to English as: “Dear Prophet Messenger of God.”", "AFP’s Arabic sports department found the footage shows a match between two Saudi Professional League football clubs -- Al Ittihad and Al Shoulla -- on February 20, 2015, at the King Abdullah Sports City stadium in Jeddah.", "The match, as well as the display of the Arabic message, was reported in Arabic-language media, including here, here and here.", "Images of the King Abdullah Sports City stadium correspond with the stadium in the video in the misleading posts.", "Below is a screenshot comparison of the high-quality YouTube video of the crowd spelling out the Arabic phrase (top) and a photo from the stadiumguide specialist website (bottom).", "The area shown in the video has been outlined in red by AFP on the photo at the bottom. Note in particular the triangle forms in the roof of the stadium. The lights are also configured in the same pattern.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]