["About this rating", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "As protests erupted across the United States in May 2020 after the death of an unarmed black man named George Floyd while in the custody of Minneapolis police officers, the internet was flooded with videos and photographs showing the sometimes chaotic scene.", "While much of this media gave genuine glimpses of these protests, a number of miscaptioned pieces of footage also made their way into the mix. The following video, for instance, was viewed millions of times as it circulated along with the claim that it showed two officers in Minnesota attempting to arrest a black man only to find out that he was an FBI agent:", "This video, however, does not show the attempted arrest of an FBI agent. On the contrary, this video reportedly shows a police \"encounter with [a] black male\" in Rochester, Minnesota, and is unrelated to the protests in 2020.", "This video was originally posted to Instagram by @thisisnike1 on May 31:", "Its timing coincided with the Floyd protests, but the original post included a caption explaining that this incident had been filmed \"over a year\" ago and that it involved the Rochester Minnesota Police Department. The original caption made no mention of the person in this video being an FBI agent. A version posted to YouTube by this account identified the person simply as a \"black male\":", "‪Somethin’ been telling me to hold on to this video over a year now, ok. “Some days we make it home or some days we make it 6 feet deep.” Imagine getting killed at home, while jogging, playing, minding your own business or just damn breathing #BeingBlackInWhiteAmerica!! This incident happened a year ago. The Minnesota police department been corrupt. Can’t even smoke a damn cigarette in peace.", "Soon after this video was posted, it was re-captioned and shared along with the claim that it showed the attempted arrest of an FBI agent. It's unclear where this rumor originated. The above-displayed video makes no mention of this person being an FBI agent and when his wallet is pulled out by the police officer it does not show an FBI badge.", "This rumor may have started with @thisisnike1, the account that originally posted the video. A screenshot supposedly showing a deleted tweet shows a message from @thisisnike1 reading \"[he is an] FBI agent.\" This appears to have been a joke, however, as this account has retweeted a number of people explaining that this person was not actually an FBI agent:", "In sum, this video was originally shared with a caption stating that this incident took place over a year earlier (i.e., in 2019, not 2020) and that it featured an encounter between police and an unidentified black male. There's nothing in the video or the original caption indicating that this person was an FBI agent.", "We reached out to @thisisnike1 and will update this article if more information becomes available.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]