["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Women’s issues were a major theme of the Democratic National Convention’s second day — the same day the party officially nominated Hillary Clinton, making her the first female presidential nominee from a major party.", "Convention speakers contrasted Clinton with her opponent, Donald Trump, whose comments about women have been widely noted.", "\"Her opponent said a woman should be ‘punished’ for exercising her right to choose and then picked a running mate who believes Roe vs. Wade belongs, to quote him, ‘in the ash heap of history,’\" said California Sen. Barbara Boxer, speaking of Trump and his vice presidential pick, Indiana Gov. Mike Pence.", "Trump’s position on abortion is hard to pin down. Throughout this election cycle, he has said he is against abortion, with exceptions. But in prior years, he has called himself \"very pro-choice.\" So it’s easy for Trump’s opponents on either side of the issue to criticize his position.", "Along the same lines, Boxer’s claim that Trump said women should be \"punished\" for having an abortion is a selective reading of Trump’s comments, which have shifted. He did say that women should be punished for having an abortion, but he walked back his comments the very same day.", "\"He said it, she heard it,\" Boxer Press Secretary Peter True said.", "What Trump said", "Trump made the comments at issue during a March 30, 2016, conversation with MSNBC’s Chris Matthews. Here are two relevant portions of the conversation. (Read more here.)", "MATTHEWS: \"No, should the woman be punished for having an abortion?\"", "TRUMP: \"Look...\"", "MATTHEWS: \"This is not something you can dodge.\"", "TRUMP: \"It’s a — no, no...\"", "MATTHEWS: \"If you say abortion is a crime or abortion is murder, you have to deal with it under law. Should abortion be punished?\"", "TRUMP: \"Well, people in certain parts of the Republican Party and conservative Republicans would say, ‘yes, they should be punished.’ \"", "MATTHEWS: \"How about you?\"", "TRUMP: \"I would say that it’s a very serious problem. And it’s a problem that we have to decide on. It’s very hard.\"", "…", "MATTHEWS: \"Do you believe in punishment for abortion, yes or no as a principle?\"", "TRUMP: \"The answer is that there has to be some form of punishment.\"", "MATTHEWS: \"For the woman.\"", "TRUMP: \"Yeah, there has to be some form.\"", "MATTHEWS: \"Ten cents? Ten years? What?\"", "TRUMP: \"I don’t know. That I don’t know. That I don’t know.\"", "The gist is that Trump said he believed there should be \"some form of punishment\" for the woman. But he quickly walked back those comments.", "What Trump said later", "After an outcry about his remarks that same day, Trump’s campaign released a statement saying he meant that the person who performed the abortion would face consequences if Congress passed a law banning the procedure.", "The statement read:", "\"If Congress were to pass legislation making abortion illegal and the federal courts upheld this legislation, or any state were permitted to ban abortion under state and federal law, the doctor or any other person performing this illegal act upon a woman would be held legally responsible, not the woman. The woman is a victim in this case as is the life in her womb.\"", "In a March 31 Fox News interview, Trump said it’s possible he \"misspoke\" in his conversation with Matthews, adding that it had been a \"convoluted discussion.\"", "\"If, in fact, abortion was outlawed, the person performing the abortion, the doctor or whoever it may be that is really doing the act is responsible for the act, not the woman is responsible,\" Trump said. \"So, that's the way I have always felt.\"", "As our friends at Snopes have noted, it’s not like Trump is or was a forceful advocate for punishing women for abortion who then flipped his position suddenly. Trump was responding to a hypothetical question that Matthews posed — a question he first tried to dodge — about laws banning abortion that don’t currently exist. He retracted the comment soon after.", "Our ruling", "Boxer said Trump \"said a woman should be punished for exercising her right to choose.\"", "Trump did say something to this effect, but within a matter of hours, he clarified his comments. Trump said he meant doctors should be punished for providing abortions, not women who undergo the procedure.", "In rating this claim, we find Trump’s comments contradictory. Yes, he mentioned punishment, but his campaign retracted that statement. There’s no evidence this was a long-held position.", "Boxer’s statement is partially accurate but leaves out important details, so we rate it Half True.", "https://www.sharethefacts.co/share/6e3732c3-0674-40c9-b479-b615b7a35c81", "PolitiFact Wisconsin, \"In Context: Transcript of Donald Trump on punishing women for abortion,\" March 30", "PolitiFact, \"Do Donald Trump, Hillary Clinton agree on Planned Parenthood funding?\" May 1, 2016", "PolitiFact Texas, \"Ted Cruz ad, assailed by Trump, leaves out Trump's declared shift on abortion,\" Feb. 17, 2016", "Trump campaign, statement on abortion, March 30, 2016", "CQ, Fox News interview with Trump, March 31, 2016", "Snopes, \"Clinic to Clink,\" March 30, 2016", "Email interview, Boxer spokesman Peter True, July 26, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]