["According to a social media claim, Jignesh Mevani was slapped by a ‘nationalist’ in Begusarai – “बेगूसराय से एक बढ़ीया ख़बर आ रही है। वामपंथी जीग्नेश मेवाणी को बेगूसराय के कीसी राष्ट्रवादीने थप्पड़ों से नवाज़ा है। (A good news is coming from Begusarai. Leftist Jignesh Mevani was slapped by a Begusarai nationalist.)” The message is being circulated with a picture that shows Mevani in a scuffle with a crowd of people. The claim comes in the backdrop of the Gujarat MLA’s recent visit to the constituency to campaign for the candidature of CPI’s Kanhaiya Kumar.", "A similar message and the image have been shared by several Twitter users.", "Fake news website Dainik Bharat piblished an article on the alleged incident.", "The photograph of Mevani in a tussle with a crowd of people is an old image that was shared by the MLA himself in 2018.", "The 50 lakh Dalits of Gujarat did not have any slight confidence in this BJP Govt. So we will give antitrust proposal to Gujarat Governor against this Anti Dalit Guj Govt and request for president’s rule in Gujarat.#Democracy_Killed pic.twitter.com/CRA2joOOIb", "— Jignesh Mevani (@jigneshmevani80) February 18, 2018", "The same image was also published by Oneindia on February 18, 2018.", "Last year in February, Mevani was part of a Dalit protest triggered by the suicide of prominent Dalit activist Bhanubhai Vankar. The protest over land rights led to the detention of the independent legislator’s by the state police. The viral image pertains to this incident.", "Social media claims asserting that Jignesh Mevani was beaten during his visit to Begusarai are, thus, baseless. The lack of media reports on the alleged incident was suggestive of the same.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]