["Has teen drinking in Florida really declined precipitously? (Wikimedia commons)", "As the Legislature considers changing rules for Florida’s burgeoning craft beer industry, one advocacy group is saying it’s important to maintain the state’s downward trend in teen alcohol abuse.", "During debate at the Senate commerce and tourism committee about whether to let breweries sell 64-ounce growlers, Susan Pitman, a board member for a collection of drug abuse prevention groups called the Florida Coalition Alliance, urged lawmakers to consider limiting pour sizes in beer-tasting rooms.", "Pitman said that preventing alcohol abuse demands regulation of these tasting rooms.", "\"While the country as a whole has seen a decline in youth drinking, the state of Florida is a leader, with double-digit drops in 30-day teen alcohol use,\" she said.", "Pitman’s arguments may have had some impact; sponsor Sen. Jack Latvala, R-Clearwater, agreed to revisit his bill.", "But in the meantime, we wondered: Has the declining drinking rate of Florida’s minors really dropped as much as Pitman said? (We considered checking whether Florida’s decline made it a \"leader\" among states, but we backed off after we learned that the state and national numbers -- which also are on the decline -- aren’t precisely comparable.)", "Pitman, who also serves as executive director of Jacksonville-based Drug Free Duval, told PolitiFact Florida that she got her talking point from the Florida Youth Substance Abuse Survey. That’s an annual questionnaire given to middle and high school students in order to collect data about risky behaviors, such as smoking and drug use.", "The survey is coordinated by the state departments of Children and Families, Education, Health, Juvenile Justice and the Governor's Office of Drug Control. The 2014 report is drawn from answers from almost 70,000 Florida students from all 67 counties.", "There are several questions measuring alcohol use, including binge drinking and whether kids have ever tried alcohol. But in the category Pitman cites -- the percentage of children who had used alcohol during the past 30 days -- the data show a distinct decrease over the last decade.", "Grade", "2004", "2014", "Decline, 2004-2014", "Middle schoolers", "20.3 percent", "10.1 percent", "10.2 points", "High schoolers", "42.0 percent", "28.4 percent", "13.6 points", "That’s a double-digit drop for both categories, providing strong evidence for Pitman’s claim.", "The only caveat is that there’s a different data set that leads to slightly different results.", "Every two years, the Centers for Disease Control and Prevention undertakes a survey for the Youth Risk Behavior Surveillance System. It’s conducted every odd-numbered year during the spring semester for grades 9-12 and for middle schoolers. The 2013 data was culled from more than 13,000 forms filled out in schools across the United States.", "The CDC survey doesn’t offer 30-day alcohol data for middle schoolers, but it does for high schoolers. For Florida, the survey found that between 2003 and 2013, alcohol use by high schoolers during the previous 30 days dropped from 42.7 percent to 34.8 percent. That’s a decline of a little under 8 percentage points -- a bit shy of a double-digit drop.", "Our ruling", "Pitman said Florida has seen \"double-digit drops\" in alcohol use among teens.", "A survey conducted by the state does show double-digit drops for both middle- and high-schoolers over the last decade, though the decline for high schoolers in a survey by the Centers for Disease Control and Prevention found a decline of about 8 percentage points.", "The statement is accurate but needs additional information, so we rate it Mostly True.", "Florida Channel, Senate commerce and tourism committee hearing, March 16, 2015", "University of Michigan Institute for Social Research, \"Monitoring the Future National Survey Results for Drug Use,\" 2014", "Florida Department of Children and Families, \"2014 Florida Youth Substance Abuse Survey,\" February 2014", "Centers for Disease Control and Prevention, \"Youth Risk Behavior Surveillance — United States, 2013,\" June 13, 2014", "PolitiFact Rhode Island, \"Marijuana legalization opponent says alcohol use by young people has been increasing,\" March 13, 2015", "Florida Department of Children and Families, \"2014 Florida Youth Substance Abuse Survey ATOD Prevalence Tables,\" accessed March 17, 2015", "National Institute on Alcohol Abuse and Alcoholism, \"Underage Drinking,\" accessed March 17, 2015", "Centers for Disease Control and Prevention, Youth Risk Behavior Surveillance System, accessed March 17, 2015", "Interview with Brittany Behm, Centers for Disease Control and Prevention spokeswoman, March 16-17, 2015", "Interview with Susan Pitman, Florida Coalition Alliance board member, March 17, 2015", "Interview with Sally Finn, Drug Free Duval community and development director, March 17, 2015", "Interview with Katryne Lukens-Bull, University of Florida Center for Health Equity and Quality Research research administrator, March 17, 2015", "Interview with Alexis Lambert, Florida Department of Children and Families communications director, March 17, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]