["Amidst heated trade negotiations and talks of a trade war with their southern neighbor, a July 9 headline on Canadian news website MTL Blog reported, “75% of Canadians Have Stopped Travelling To The U.S. Because Of Trump’s Trade War.” The article has since been shared thousands of times, including in several large Canadian and US Facebook groups.", "The numbers that the Montreal blog referred to come from a poll by Canadian pollster Nanos taken for The Globe and Mail and CTV News. The poll asked 1,000 Canadians about their intentions to avoid US destinations this summer. To this, 57 percent of respondents answered that they were “likely to stop or cut back travel to the US,” while 16 percent of respondents declared they were “somewhat likely” to do so.", "Those intentions did not bear out when compared to actual border crossings.", "Customs and Border Protection (CBP) shared numbers with AFP indicating that more Canadians travelled to the US in June 2018 than June 2017. A total of 3,230,777 Canadian citizens crossed the land border in June 2018, compared to 2,940,442 Canadian citizens the year before.", "While complete numbers for July are not yet available, CBP told AFP there were 2,954,675 border crossers from July 1 to July 27, compared to 3,668,969 in July 2017. Even without the final weekend of July, this drop in crossings is only 19 percent, not 75 percent as reported.", "While some Canadians certainly struck the US from their vacation destination list this summer, this does not reflect a general trend.", "Just cancelled a family trip to Nashville. Keeping my money in Canada #boycottusa . Obviously no Florida this year. Hope more Canadians take the time to support our own.@realDonaldTrump", "Brigitte Bélanger-Warner, a Canadian working for the Virginia Tourism Corporation, told AFP that “although numbers are not in yet, key spots for Canadians in Virginia, such as Virginia Beach, have not seen a drop in reservations. For now there really is no trend.”", "Overall, the boycott largely remained isolated to an online hashtag as it was not promoted by Canadian institutions or politicians.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]