["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Facing international condemnation for a recent underground nuclear weapon test, the North Korean Foreign Ministry released a statement accusing the United Nations Security Council of hypocrisy.", "\"There is a limit to our patience,\" its Foreign Ministry said in a statement carried on the official Korean Central News Agency. \"The nuclear test conducted in our nation this time is the Earth's 2,054th nuclear test. The five permanent members of the U.N. Security Council have conducted 99.99 percent of the total nuclear tests.\"", "As a matter of policy, PolitiFact does not take totalitarian dictatorships at their word. Beyond that, we were simply curious which countries have done nuclear weapons testing, and how much. So we decided to check this claim.", "According to a report from the Natural Resources Defense Council, there have been 2,051 nuclear tests worldwide since 1945 done by the five permanent members of the U.N. Security Council:", "U.S. - 1,030", "Russia/U.S.S.R - 715", "U.K. - 45", "France - 210", "China - 45", "There have been only a handful of other tests, although there are doubts about the exact number.", "In 1974, India tested a nuclear device, although it produced a relatively small explosive yield. India claimed to have detonated five more nuclear devices in May 1998.  In response to the Indian tests, Pakistan announced that it had exploded five nuclear devices a couple weeks later.", "It has been widely speculated that India and Pakistan exaggerated the number and size of the explosions for political reasons. Nonetheless, that's the number of announced nuclear tests.", "Since then, North Korea is the only country to perform an announced test. Its first came in 2006. And then on May 26, 2009, North Korea announced that it had successfully conducted its second underground nuclear test, in defiance of international warnings.", "(There has also been some speculation that Israel may have conducted a test in 1979, but those claims have never been substantiated.)", "So arguably, there have been as many as 13 nuclear tests conducted by countries other than the five permanent members of the U.N. Security Council, said Carey Sublette, creator of the Nuclear Weapon Archive, which tracks nuclear testing via public records. By Sublette's count, there have been a total of 2,054 nuclear tests. That means 99.37 percent of all the tests were done by the five permanent members of the U.N. Security Council, he said.", "\"It's about right,\" Sublette said of the figures cited by North Korea. \"If it's off, it's only off by a few (tests).\"", "We aren't inclined to quibble with fractions of one percent. We find North Korea's claim to be True.", "Natural resources Defense Council,\n\nTable of Known Nuclear Tests Worldwide: 1945-69 | 1970-96", "The Nuclear Weapon Archive,\n\nA Guide to Nuclear Weapons", "NRDC Notebook, \"Known Nuclear Tests Worldwide, 1945-98,\" by Robert S. Norris and William M. Arkin of the Natural resources Defense Council, 2005", "AP,\n\n\"Report: NKorea test-fires short-range missile\"\n\nMay 29, 2009", "Interview with Carey Sublette, creator of the Nuclear Weapon Archive, May 29, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]