["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The U.S. has supported the proposed   Turkmenistan-Afghanistan-Pakistan-India natural gas pipeline since discussions of it began in the 1990s.", "Construction of the pipeline began in 2015, but it is far from completion.", "Under Biden, the State Department says it supports energy infrastructure cooperation among Afghanistan and its neighbors. But experts say they are aware of no tangible assistance from Biden’s administration or previous administrations on construction.", "President Joe Biden’s day-one decision to halt construction of the Canada-to-Nebraska Keystone XL oil pipeline has sparked criticism, including false claims of conspiracies.", "A post widely shared on Facebook takes a different tack, suggesting Biden’s actions are contradictory. The lower-case post reads: \"biden cancels our pipeline but helps build afghanistans pipeline? help me understand\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The allusion is to the long-planned Turkmenistan-Afghanistan-Pakistan-India pipeline, which has received verbal support from the U.S. but, according to experts, no tangible assistance.", "\"The TAPI pipeline has been supported by the Clinton, Bush, Obama and Trump administrations, but the U.S. has not spent any money on it,\" said Barnett Rubin, senior fellow at New York University’s Center on International Cooperation and former director of the center’s Afghanistan Pakistan Regional Program. He is also a former senior adviser to the U.S. State Department’s special representative for Afghanistan and Pakistan.", "The Keystone XL pipeline was to have transported crude oil from Canada to Nebraska, where it would connect with another leg stretching to Gulf Coast refineries. Biden said with a Jan. 20 executive order that he was revoking the pipeline’s construction permit for economic and environmental reasons.", "The post we’re checking appeared several days after a Feb. 6 article suggested, without evidence, that under Biden, the U.S.  had brokered a Feb. 6 meeting in Turkmenistan in support of TAPI, which would carry natural gas from Turkmenistan through Afghanistan to Pakistan and India.", "Two other articles citing that article connected TAPI to Biden’s cancellation of the Keystone XL.", "We asked the State Department if the Biden administration has helped build the pipeline or has taken a position on the pipeline. A State Department spokesperson said the U.S. \"has long supported efforts by Afghanistan and its Central Asian neighbors to strengthen their connectivity, boost economic coordination and improve regional transportation infrastructure, including energy infrastructure.\"", "On. Oct. 9, weeks before Biden’s election, the U.S., Turkmenistan and Afghanistan issued a statement regarding a videoconference that representatives of the three governments held the previous day to discuss a variety of issues. The statement said the nations intend to \"work together to identify and implement infrastructure projects,\" including TAPI.", "We interviewed two other experts on Afghanistan: Marvin Weinbaum, director of Afghanistan and Pakistan Studies at the nonpartisan Middle East Institute in Washington, D.C., and a former Afghanistan specialist at the State Department; and Jason Campbell, a RAND Corp. international security policy researcher and former country director for Afghanistan in the Office of the Secretary of Defense for Policy.", "Both said they are not aware of any money or other tangible assistance given by the U.S. for construction of the pipeline.", "They said progress on construction has been slow for a variety of reasons, including concerns about security in the region.", "\"The joke goes, it’s just a pipe dream,\" said Weinbaum. \"But it’s one that should be taken seriously, in terms of its potential.\"", "A widely shared Facebook post claimed Biden \"helps build Afghanistan’s pipeline.\"", "The U.S. has long supported the long-planned Turkmenistan-Afghanistan-Pakistan-India natural gas pipeline, which would traverse Afghanistan.", "Asked about the claim, the State Department said only that the U.S. has long supported regional cooperation in the area, including on energy infrastructure.", "Experts said no administration, including Biden’s, has provided tangible assistance on construction of the pipeline.", "We rate the statement False.", "Facebook post, Feb. 15, 2021", "Email, Barnett Rubin, senior fellow at New York University’s Center on International Cooperation and former director of the center’s Afghanistan Pakistan Regional Program; and former senior adviser to the U.S. State Department’s special representative for Afghanistan and Pakistan, Feb. 17, 2021", "Interview, Marvin Weinbaum, director of Afghanistan and Pakistan Studies at the Middle East Institute and former Afghanistan specialist at the State Department, Feb. 18, 2021", "Eurasianet, \"Taliban vows to guarantee safety of trans-Afghanistan gas pipeline,\" Feb. 6, 2021", "Washington Examiner, \"Biden kills pipelines at home but promotes them for the Taliban,\" Feb. 8, 2021", "Independent Sentinel, \"After Cancelling Keystone, Looks Like Biden’s Promoting a Taliban Pipeline,\" Feb. 10, 2021", "U.S. State Department, \"Joint Statement on Afghanistan – Turkmenistan – United States of America Trilateral Meeting,\" Oct. 9, 2020", "Email, State Department spokesperson Stephanie Newman, Feb. 18, 2021", "Voice of America, \"Construction Begins on Afghanistan Section of International Gas Pipeline,\" Feb. 23, 2018", "Interview, RAND Corp. international security policy researcher and former country director for Afghanistan in the Office of the Secretary of Defense for Policy Jason Campbell, Feb. 18, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]