["The photos, which show Sri Lanka Transport Board buses, were published on Facebook here on November 15, 2020.", "The Sinhala-language text superimposed on the image translates to English as: “Look at the state of the brains of intellectuals appointed by the 6.9 million", "\"They have taken steps to dunk old CTB [Ceylon Transport Board] buses in the sea, because they are not being sold in auctions. If these were repaired and given to schools, could have been used as classrooms at least, without destroying the sea.", "\"Sir isn't a fail, he is an extreme fail.”", "The use of “Sir” in the text is a reference to Sri Lankan President Gotabaya Rajapaksa.", "The post’s caption translates as: “They could have been sold off for scrap metal!”", "The text image was also shared alongside a similar claim on Facebook here, here, here, here and here.", "The claim, however, is misleading.", "A reserve image search found the photos in fact show old buses that were submerged in order to create an artificial reef to support marine life.", "They were published on Facebook here by The Pearl Protectors, a local environmental conservation group, on November 14, 2020.", "The post’s caption reads: “In another measure towards improving the marine fauna population in the deep seas, several old buses that were decaying in bus depots for years, were sunk in the deep waters off Trincomalee. This is a measure taken to regenerate marine life.”", "The Morning, a Sri Lankan media outlet, also reported on the old buses being used to restore marine life in an article published here on November 18, 2020.", "Building artificial reefs with old and unused vehicles to restore marine life is a known practice.", "In October 2020, for instance, the Sri Lanka Navy sunk two decommissioned ships to create a reef, as seen here on Facebook.", "Old military tanks in Lebanon and aged metro trains in the United States have also been submerged in similar conservation projects.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]