["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Florida Legislature is split on what to do about Medicaid expansion, but House Speaker Steve Crisafulli said that isn’t the case for many constituents.", "\"If you go into a federal program like that, you will soon find out what it means to be married to Washington. There's folks that are not in this chamber today because of that very issue,\" he told radio station WUSF’s Health News Florida. \"People spoke in those districts, and we feel like Medicaid expansion isn’t necessarily a very popular issue on the street.\"", "The Florida House and Senate are currently debating whether to expand the program to insure the very poor as part of contentious budget negotiations. Crisafulli, R-Merritt Island, opposes Medicaid expansion and was speaking broadly about how discussing it had doomed some candidates’ political ambitions. His office said he \"was speaking as a matter of his perspective.\"", "But we at PolitiFact Florida thought his statement can be verified or contradicted by public opinion polls. And since it's such a critical issue in Florida, we decided to take a look.", "It’s all in the wording", "The Legislature is debating whether to accept billions from the federal government to increase the number of people eligible for Medicaid as part of the Affordable Care Act. More than 800,000 currently uninsured Floridians would join the program’s rolls.", "The federal government would pay 100 percent of the expansion at first, gradually shifting to 90 percent by 2020. (The U.S. Supreme Court ruled in 2012 the expansion was optional for states; 28 states and the District of Columbia have expanded the program as of April 2015.) The Florida Senate now favors an expansion while the House opposes it.", "Senators have proposed the Florida Health Insurance Affordability Exchange Program, which would create a state-run private insurance exchange for low-income Floridians with federal dollars. Residents using the exchange would pay premiums and be required to either have a job or attend school. The House has not set forth a proposal of their own.", "Several polls over the years have looked at whether Floridians favor making the program larger. In 2013, three polls showed support for expansion as high as 62 or 63 percent, although one from the James Madison Institute was as low as 30 percent. One 2014 University of Florida poll put approval of expansion at 67 percent.", "That’s a pretty wide range, but it likely had a lot to do with how the poll questions were worded, according to Alan Reifman, a Texas Tech University professor who specializes in social science research methodology.", "The James Madison Institute poll’s question focused on how the state’s budget would grow with a bigger Medicaid program, with no mention of how many Floridians would be covered or that the federal government would be paying the lion’s share, Reifman said.", "A Public Policy Polling question that included state and federal costs, plus the number of people who would benefit through coverage and new jobs was \"probably the most balanced question-wording of those I’ve seen,\" he said. That poll tallied 62 percent in favor of expansion.", "Updated for March 2015, the Public Policy Polling survey used a shorter question focusing on federal funding, but still found 58 percent in favor of expansion.", "Joan Alker, executive director of the Center for Children and Families at the Georgetown University Health Policy Institute, said wide support for expansion in most polls shows that once people understand the issue and how expansion would be implemented, attitudes tend to shift.", "A state solution like what the Senate is offering tends to be particularly popular in Florida, she said. What’s generating headlines from Tallahassee now isn’t so much overwhelming voter opposition, but rather an ideological debate in the Legislature.", "\"This is not a partisan issue in the strictest sense,\" Alker said. \"This is a fight within the Republican Party.\"", "In April 2015, Gov. Rick Scott’s Let’s Get to Work PAC released a poll that referred to \"significantly expanding the federal Medicaid program under Obamacare here in Florida.\" Scott has recently renewed opposition to the expansion and is threatening to sue Washington over pressure to accept federal expansion money.", "His PAC’s contentious poll wording may have influenced responses, Reifman said, and sampled likely voters, which favors Republicans. That poll found a 44-44 percent split between those who favored and opposed expansion.", "Partisan attitudes were more apparent when Let’s Get to Work polled a sample of 500 Republican primary voters -- they opposed Medicaid expansion by 75 percent.", "Our ruling", "Crisafulli said, \"Medicaid expansion isn’t necessarily a very popular issue on the street.\"", "He was speaking broadly about how constituents don’t want the expansion. Several polls give the edge to a majority of Floridians favoring the expansion, although results vary depending on how the questions are worded. A recent conservative poll found that Republicans don’t like the expansion by a wide margin.", "Taken together, those numbers present a more nuanced picture than what Crisafulli suggested. We rate the statement Half True.", "WUSF/Health News Florida, \"Crisafulli: Medicaid Expansion Not Popular 'On the Street',\" April 17, 2015", "American Cancer Society Cancer Action Network, \"A Look at Voters’ Attitudes toward Accepting Federal Funds to Broaden Access to Health Coverage Through Medicaid,\" Jan. 23, 2013", "Tampa Bay Buzz blog, \"Poll: 62% of Florida voters support Medicaid expansion,\" Feb. 8, 2013", "Tampa Bay Buzz blog, \"New poll challenges notion Floridians support Medicaid expansion,\" Feb. 21, 2013", "Public Policy Polling, \"Florida Survey Results,\" Feb. 22-24, 2013", "The Hill, \"Poll: Majority supports Medicaid expansion in South,\" May 21, 2013", "Professor Alan Reifman’s Review of Health Care Polls, \"State Polls on Medicaid Expansion,\" Aug. 13, 2013", "University of Florida, \"UF poll reveals support for state Medicaid expansion, changes to Affordable Care Act,\" Feb. 27, 2014", "The Daily Beast, \"New Poll Shows Voters in Red States Want to Expand Medicaid,\" April 8, 2014", "Gainesville Sun, \"Florida to suffer most for not expanding Medicaid, studies show,\" Aug. 19, 2014", "Tampa Bay Buzz blog, \"Poll: Medicaid expansion remains 'very popular' in Florida,\" March 26, 2015", "Orlando Sentinel, \"PPP Poll: Floridians support Medicaid expansion, marriage equality,\" March 26, 2015", "Public Policy Polling, \"Majority of Florida voters support Medicaid expansion,\" March 26, 2015", "Let’s Get to Work, \"Florida Statewide Survey,\" April 8-12, 2015", "Orlando Sentinel, \"Scott pollster: Public split on Medicaid expansion,\" April 15, 2015", "Politico, \"Florida Playbook,\" April 15, 2015", "Tampa Bay Times, \"Gov. Rick Scott sues feds over health care money, Medicaid expansion,\" April 16, 2015", "Bradenton Herald, \"Medicaid is expanding in other states -- just not Florida,\" April 20, 2015", "Interview with Alan Reifman, Texas Tech University Human Development and Family Studies professor, April 17, 2015", "Interview with Michael Williams, Steve Crisafulli spokesman, April 18, 2015", "Interview with Joan Alker, Georgetown University Health Policy Institute’s Center for Children and Families executive director, April 20, 2015", "Interview with David Biemesderfer, Florida Philanthropic Network president, April 20, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]