["About this rating", "On Sept. 5, 2018, The New York Times took \"the rare step of publishing an anonymous Op-Ed essay\" attributed to a Trump administration official. The anonymous author claimed to be part of a \"resistance\" consisting of \"many of the senior officials in [Trump's] administration [who] are working diligently from within to frustrate parts of his agenda and his worst inclinations\" and maintained that U.S. President Donald Trump was \"acting in a manner that is detrimental to the health of our republic,\" painting a picture of dysfunctional chief executive who governed based on ephemeral whims and impulses, rather than thorough and consistent reasoning:", "From the White House to executive branch departments and agencies, senior officials will privately admit their daily disbelief at the commander in chief’s comments and actions. Most are working to insulate their operations from his whims.", "Meetings with him veer off topic and off the rails, he engages in repetitive rants, and his impulsiveness results in half-baked, ill-informed and occasionally reckless decisions that have to be walked back.", "“There is literally no telling whether he might change his mind from one minute to the next,” a top official complained to me recently, exasperated by an Oval Office meeting at which the president flip-flopped on a major policy decision he’d made only a week earlier.", "The publication of the controversial Op-Ed piece (which was followed up by the publication of similarly anonymous full-length book titled \"A Warning\") sent journalists, government officials, and pundits scurrying to fathom the identity of \"Anonymous,\" much as they had spent decades trying to unmask the mysterious source known as \"Deep Throat\" who provided information key to unraveling the Watergate", "When Trump himself was later asked by a reporter whether a search to root out Anonymous was underway, the president confidently stated that no such search was really necessary, because he already knew the identity of the writer:", "Q: Is there a search under way for Anonymous? Remember Anonymous?", "A: Yeah, there is. It's not so much a search. I know who it is. I can't tell you that, but I know ... but we won't get into it. People know it's fraud, I know who it is.\"", "https://youtu.be/qpdvEwIBz4k\n\nMany commentators at the time questioned why if Trump -- who had demonstrated a penchant for loudly disparaging and discrediting those who defied or spoke poorly of him -- knew the identity of Anonymous, he didn't publicly out that person and ostentatiously dismiss the employee from the administration. As later events would prove, Trump didn't take those steps because, contrary to his claims, he had no idea who Anonymous was.", "On Oct. 28. 2020, Anonymous self-revealed via Twitter, disclosing himself to be Miles Taylor, a security expert who served as a policy adviser in the U.S. Department of Homeland Security (DHS) from 2017 to 2019 and was chief of ctaff to DHS Secretary Kirstjen Nielsen (who resigned from that position in April 2019, followed by Taylor a few months later):", "After (and only after) Taylor revealed himself, Trump engaged in the expected rounds of disparagement and discrediting, declaring Taylor to be a “sleazebag” and a “low-level employee” who had never worked in the White House and had been “quickly removed from his job a long time ago” (even though Taylor was clearly involved in meetings with Trump and said that he had resigned, not been fired, from his DHS position).", "Trump also tweeted and retweeted claims that Taylor was merely a \"staffer\" and not a \"senior administration official\" and labeled him as a scammer ... while not refuting that Taylor nonetheless had been able to speak from a position of direct knowledge as a member of the Trump administration, or disputing the truthfulness of anything Taylor wrote:", "https://twitter.com/realDonaldTrump/status/1321568122017517568\nhttps://twitter.com/realDonaldTrump/status/1321568126635368448", "https://twitter.com/realDonaldTrump/status/1321858569466114048\nhttps://twitter.com/realDonaldTrump/status/1321858573278695425", "Key to these tweets was that Trump, as he has often done when his association with persons working for or with him turns negative, attempted to distance himself by declaring that he didn't know, and had \"never even heard of,\" Taylor. But of course, if Trump had \"never even heard of\" Taylor until the latter's self-reveal as Anonymous, then Trump must have been lying or completely mistaken when he much earlier proclaimed that he knew for a fact who Anonymous was.", "As usual, the denouement to this story was Trump's calling for the prosecution of Taylor, without citing any particular law that the latter might have broken.", "Sources linked within article.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]