["\"This Week\" host George Stephanopoulos interviews Democratic presidential candidate Hillary Clinton on Dec. 6, 2015. (Screengrab)", "Democratic presidential candidate Hillary Clinton defended her call for stricter gun control in the wake of the mass shooting in San Bernardino, Calif.", "Clinton’s Republican rivals have criticized her for pushing gun control following a terrorist attack. But lax firearms laws, Clinton said on ABC’s This Week, allow people on the no-fly list to purchase guns, just as they enabled Dylann Roof, accused of killing nine African-Americans in a Charleston, S.C., church attack in June.", "\"(Roof) should have never have been given a gun, but the universal background check was not fast enough,\" Clinton said Dec. 6. \"We should be able to approach both of these with some sense of, you know, unity about how we prevent terrorist attacks and how we prevent the wrong people from getting ahold of guns.\"", "Is Clinton right that this system didn’t catch the Charleston shooter in time? She omits some important details in her description, but it largely checks out.", "How Roof obtained a gun", "Under current federal law, the FBI performs background checks on would-be gun buyers in South Carolina and 29 other states through its National Instant Criminal Background Check System (the rest of the states do their own background checks). If the check isn’t denied or completed in three days, the gun seller can proceed with the sale.", "What happened in Roof’s case comes down to clerical errors.", "Here’s how FBI Director James Comey explained why Roof’s background check wasn’t finished in time to prevent his purchase of a .45-caliber Glock pistol.", "Roof tried to buy a handgun in West Columbia, S.C., a suburb of Columbia, on April 11. A West Virginia-based FBI examiner began vetting him the next business day, April 13, and found that Roof had been arrested for a felony drug charge March 1 (the charge was later corrected as a misdemeanor). Because the records didn’t show a conviction, the examiner couldn’t deny the purchase but continued to look into Roof’s criminal history.", "Roof’s rap sheet mistakenly listed the neighboring county’s sheriff office as the agency that arrested him, leading the FBI examiner to request more information on Roof from the wrong county sheriff’s and prosecutor’s offices. The examiner then contacted the West Columbia police, who replied they had no records of Roof’s arrest. Had the database listed the correct police station (Columbia) or included the report in which Roof admitted to possessing drugs, things would have turned out different, according to Comey.", "\"If a NICS examiner saw that, Roof would be denied permission to buy a gun. But the examiner never saw that,\" he said.", "When the three days were up on April 16, the case was still listed as \"pending\" and Roof was able to purchase the gun. Two months later, on June 17, Roof allegedly shot and killed nine worshippers and injured one in a historically black church in Charleston.", "Clerical error or ‘Charleston loophole’", "Both sides of the gun debate came to very different conclusions about this news. Clinton and some advocates for tighter gun laws argued Roof was abetted by the three-day time limit for background checks, dubbing it the \"Charleston loophole.\" Supporters of gun rights say the onus is actually on the FBI and its botched paperwork.", "Daniel Webster, the director of the Center for Gun Policy and Research at Johns Hopkins University, agrees with Clinton that the FBI would have been able to catch Roof’s conviction if it had more than three days to track down the details.", "\"The follow-up investigation found that the FBI analyst doing the check was still in the process of tracking down the information on the case and hadn’t given up because of the clerical error,\" Webster said.", "CNN reported that FBI examiners officially denied Roof’s gun purchase application a week after the shooting, when he was already in custody.", "Usually when the FBI denies a gun purchase after the fact, the agency notifies the Bureau of Alcohol, Tobacco, Firearms and Explosives, which then retrieves the firearm.", "In 2014, the FBI denied approximately 1.1 percent, or 91,000, of would-be gun purchases within three days. Of the transactions that required more than three days to vet, the FBI referred 2,511 for retrieval.", "Back in 2000, the Government Accountability Office reported it took an average of 25 business days for the FBI to determine whether a gun purchase should have been denied. We could not find more recent data.", "Our ruling", "Clinton said the Charleston shooter \"should have never have been given a gun, but the universal background check was not fast enough.\"", "Dylann Roof admitted to a drug offense a few weeks before he tried to buy a gun, so the FBI said he should have been denied one.", "However, it wasn’t the three-day time limit by itself that undermined Roof’s background check. There were clerical errors in the FBI’s database that prevented the examiner from seeing Roof’s drug admission.", "Clinton’s characterization misses some important information about Roof’s case. We rate it Mostly True.", "Note to readers: A previous version of this fact-check incorrectly said Roof \"admitted to a felony drug offense\" before attempting to buy a gun. That is not what the FBI news release said. The release said that a police report about his arrest included Roof's admission to possessing illegal drugs, which Comey said would have been enough to deny the sale of the handgun. The story has been updated to reflect that point.", "ABC, \"'This Week' Transcript: Hillary Clinton and Jeb Bush,\" Dec. 6, 2015", "Email interview with Josh Schwerin, spokesperson for Hillary Clinton, Dec. 6, 2015", "New York Times, \"Background Check Flaw Let Dylann Roof Buy Gun, F.B.I. Says,\" July 10, 2015", "FBI, \"Statement by FBI Director James Comey Regarding Dylann Roof Gun Purchase,\" July 10, 2015", "Email interview with Daniel Webster, Director of the Center for Gun Policy and Research at Johns Hopkins University, Dec. 6, 2015", "CNN, \"FBI says Dylann Roof should not have been cleared to purchase a weapon,\" July 10, 2015", "U.S. Dept. of Justice, \"National Instant Criminal Background Check System (NICS) Operationn 2014,\" accessed Dec. 6, 2015", "Bureau of Justice Statistics, \"Data Collection: Firearm Inquiry Statistics (FIST) Program,\" accessed Dec. 6, 2015", "U.S. Government Accountability Office, \"Gun Control: Implementation of the National Instant Criminal Background Check System,\" Feb. 29, 2000", "FBI, \"Reasons NICS Background Checks are Denied or Delayed,\" accessed Dec. 6, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]