["About this rating", "On 26 November 2018, President Trump incorrectly stated that three border patrol agents had been \"very badly hurt\" during an altercation with a group of migrants from Central America. While U.S. Customs and Border Protection Commissioner (CBP) Kevin McAleenan and Department of Homeland Security Secretary Kirstjen Nielsen both reported that no border patrol agents were seriously injured during the melee, some of the president's more ardent supporters started circulating an image purportedly showing a bloodied border patrol agent in an apparent attempt to bolster President Trump's claims.", "The Facebook page Trump Train Conductor posted the photograph with the caption: \"At the U.S./Mexico Border Chula Vista ,Ca. This is what's going on folks . A Border agent was hit by rock throwing from the other side ??☝️️✌️️through strength.\" Facebook user Donald Newland added another element to the rumor when he suggested that networks such as CNN and MSNBC were refusing to report on the agent's injuries:", "This photograph likely won't be aired by CNN, MSNBC, or \"Face News\" anytime soon, because it does not document a current event. If those networks did decide to display this years-old photograph, it would likely be as part of a segment covering the spread of misinformation about the caravan of refugees who were seeking asylum in the fall of 2018.", "This photograph has been circulating online since at least March 2013, when it was published by the website \"Homeland Security Today\" as part of an article  focused on general rock throwing incidents. The website did not provide any specifics about the identity of this border patrol agent or the nature of his injuries, stating only that the photograph had been provided by U.S. Customs and Border Protection: \"The photos that accompany this report that were made available by CBP show just a few of the CBP personnel who have been injured from being struck in the face and head.\"", "In fact, the photograph was taken in 2013 (not 2018) in Texas (not California) and depicted an injury caused by rock-throwing drug smugglers (not asylum seekers).", "U.S. Customs and Border Protection Commissioner Kevin McAleenan said in a statement that no border patrol agents were seriously injured while engaged in preventing over 1,000 individuals from entering the United States along the border between Mexico and California on 26 November 2018 (emphasis ours):", "I wanted to provide an opportunity to discuss the events yesterday in San Diego, and provide an update of the incident involving elements of the caravan and their attempts to unlawfully enter the United States. Yesterday, U.S. Customs and Border Protection agents and officers in San Diego effectively managed an extremely dangerous situation involving over 1,000 individuals who sought to enter the U.S. unlawfully in large groups. They did so safely and without any reported serious injuries on either side of the border. Yesterday’s incident involved large groups of migrants ignoring and overwhelming Mexican law enforcement, then attempting to enter the United States through vehicle lanes at San Ysidro and El Chaparral, and then through breaches in the international border fence between ports of entry. Elements of the group also engaged in dozens of assaults on agents and officers. Four agents were hit with rocks, but were wearing protective gear and did not suffer serious injuries.", "Homeland Security Today.   \"Potentially Lethal Attacks Pose Risks to CBP Personnel on SW Border.\"\r\n    27 March 2013.", "Forgey, Quint.   \"Contradicting Border Chief, Trump Claims 3 Officers ‘Very Badly Hurt’ by Migrants.\"\r\n    Politico.   26 November 2018.", "U.S. Customs and Border Protection.   \"Statement from Commissioner McAleenan on Incident at San Ysidro Yesterday Afternoon.\"\r\n    26 November 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]