["About this rating", "On the first night of the Republican National Convention (RNC) on Aug. 24, 2020, a video supposedly showing violence on the streets of the United States was aired. The video, entitled \"Catalina and Madeline,\" featured two sisters from Chicago discussing their support of U.S. President Donald Trump and their fear about the potential of violent protests in Democratic nominee Joe \"Biden's America\":", "https://www.youtube.com/watch?v=q2glnyGI5y8&feature=youtu.be&t=241", "Around the four-minute mark of the above-displayed video, clips showing fires and protests start appearing on the screen as one of the women says: \"This is a taste of Biden's America. The riot, the crime. Freedom is at stake now. This is going to be the most important election of our lifetime.\"", "Although some of the clips in this segment truly show protests that took place in America after the death of George Floyd, a Black man who died in police custody (arguably, those protests took place in \"Trump's America,\" not Biden's, since Trump has been serving as the President of the United States since January 2017), one of the clips comes from an entirely different country.", "At the 4:15 mark, an image of a large fire on a street appears (shown in the screenshot at the top of this article).", "This scene was not filmed in the United States. The above-displayed fire actually occurred in October 2019 in Barcelona, Spain. CCMA, a news outlet from Catalonia, was the first to highlight the mistake.", "This footage is available via Shutterstock where it is presented with the caption: \"Young rebel riot revolutionary anarchist stands on trash and fire showing fuck as protest for independence on demonstration about the proces[s] and political prisoners Demonstrator burns garbage bins in.\"", "While the Shutterstock caption does not identify the location of the video, Buzzfeed News noted that footage of the same fire is available via Getty Images along with a caption identifying the location of the chaotic scene:", "Demonstrators set on fire a barricade in a clash with police on October 16, 2019 in Barcelona, Spain. Earlier in the week, the Spanish Supreme Court sentenced nine Catalan separatist leaders to between 9 and 13 years in prison for their role of the 2017 failed Catalan referendum on independence.", "CCMA.   \"An Image of the Post-Sentencing Riots in Barcelona Sticks to the Trump Convention.\"\r\n    25 August 2020.", "Sandoval, Edgar.   \"Protests Flare in Brooklyn Over Floyd Death as de Blasio Appeals for Calm.\"\r\n    The New York Times.   30 May 2020.", "CNN.   \"Protesters and Police Clash in Chicago.\"\r\n    30 May 2020.", "Lytvynenko, Jane.   \"RNC Video Showing Rioters in 'Biden’s America' Is Actually Spain.\"\r\n    Buzzfeed News.   26 August 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]