["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A few days before Donald Trump dominated Super Tuesday, the Republican frontrunner was being rebuked left and right for declining to denounce former Ku Klux Klan leader David Duke.", "The controversy began Feb. 24, when Duke said that he supports Trump’s candidacy and told listeners of his radio program to \"get active\" for Trump. Two days later, Trump disavowed Duke in a news conference.", "But Trump, who claims to have the \"world’s greatest memory,\" seemed to have forgotten this by Feb. 28. When CNN’s Jake Tapper asked him about Duke, Trump claimed ignorance four times:", "\"Well, just so you understand, I don't know anything about David Duke. okay? I don't know anything about what you're even talking about with white supremacy or white supremacists. So, I don't know.", "\"I don't know, did he endorse me or what's going on, because, you know, I know nothing about David Duke. I know nothing about white supremacists. And so you're asking me a question that I'm supposed to be talking about people that I know nothing about. …", "\"I don't know any -- honestly, I don't know David Duke. I don't believe I have ever met him. I'm pretty sure I didn't meet him. And I just don't know anything about him.\"", "Later that day, Trump tweeted a video of his earlier disavowal of Duke, and blamed his failure to do it again on CNN on \"a very bad earpiece.\"", "As fellow fact-checkers at the Washington Post and Factcheck.org have pointed out, Trump knew enough about Duke to denounce him several times over the past two decades.", "Duke mentions this election", "Trump, as we previously noted and as he acknowledged himself, renounced Duke just two days before he told Tapper he knew nothing about the white nationalist.", "When a reporter asked about Duke’s support on Feb. 26 (without identifying Duke as a former Klansman), Trump said, \"I didn’t even know he endorsed me. David Duke endorsed me? Okay, all right, I disavow, okay?\"", "And a few months ago, in August 2015, Trump \"repudiated\" an earlier expression of support from Duke in a Bloomberg interview:", "John Heilemann: \"We’ve heard this week that David Duke — former Grand Dragon of the Ku Klux Klan — has come out and said he’s in support of your candidacy. So my first question is why do people like that like Donald Trump? And second, how do you feel about the David Duke quasi-endorsement?\"", "Trump: \"I don’t know the answer to the first. Who knows why? But I don’t need his endorsement. I certainly wouldn’t want his endorsement. I don’t need anybody’s endorsement. I’m not looking for…\"", "Heilemann: \"Would you repudiate David Duke?\"", "Trump: \"Sure, I would do that if it made you feel better. I would certainly repudiate. I don’t know anything about him. Somebody told me yesterday, whoever he is, he did endorse me. And actually I don’t think it was an endorsement. He said I was absolutely the best of all the candidates. But I wouldn’t want him …\"", "2000 Trump: Duke is ‘a big racist’", "Fifteen years ago, when Trump was flirting with a White House bid as a Reform Party candidate, he named Duke as a cause of concern at least three times.", "In 2000, former wrestler and then-Minnesota Gov. Jesse Ventura broke with the Reform Party because he didn’t want to be associated with the Reform Party’s presidential candidate Pat Buchanan, whom Duke supported.", "\"Buchanan is an anti-abortion extremist and an unrealistic isolationist,\" Ventura told the New York Daily News on Feb. 12, 2000. \"The latest I hear is that he's now getting support from David Duke. I can't be a part of that and I won't be part of that.\"", "Before he called it quits, Ventura said he consulted with Trump. After Ventura left the party, Trump also named Duke as one of the Reform's \"biggest problems\" on NBC’s Today Show.", "\"Well, you've got David Duke just joined — a big racist, a problem. I mean, this is not exactly the people you want in your party,\" Trump said on Feb. 14, 2000.", "He announced that day that he wouldn’t seek the nomination of the Reform Party, naming Duke as one of his reasons.", "\"Now I understand that David Duke has decided to join the Reform Party to support the candidacy of Pat Buchanan,\" Trump wrote in a statement. \"So the Reform Party now includes a Klansman,  Mr. Duke, a Neo-Nazi, Mr. Buchanan, and a Communist, Ms. Fulani. This is not company I wish to keep.\"", "A few days later, Trump himself quit the party and repeated his earlier statement.", "\"Although I am totally comfortable with the people in the New York Independence Party, I leave the Reform Party to David Duke, Pat Buchanan and Lenora Fulani. That is not company I wish to keep,\" Trump wrote in a Feb. 19, 2000, New York Times op-ed.", "1991 Trump: A vote for Duke is ‘an anger vote’", "Even earlier, Trump appeared on CNN on Nov. 19, 1991, and discussed Duke’s defeat in the Louisiana governor’s race and his possibly running against then-President George H.W. Bush. (Duke declared his candidacy as a Republican about a month after Trump’s interview.)", "Larry King: \"Did the David Duke thing bother you? Fifty-five percent of the whites in Louisiana voted for him. Four hundred New Yorkers contributed.\"", "Trump: \"I hate seeing what it represents, but I guess it just shows there's a lot of hostility in this country. There's a tremendous amount of hostility in the United States.\"", "King: \"Anger?\"", "Trump: \"It's anger. I mean, that's an anger vote. People are angry about what's happened. People are angry about the jobs. If you look at Louisiana, they're really in deep trouble. When you talk about the East Coast — it's not the East Coast. It's the East Coast, the middle coast, the West Coast.\"", "King: \"If he runs and Pat Buchanan runs, might you see a really divided vote?\"", "Trump: \"Well, I think if they run, or even if David Duke — I mean, George (H.W.) Bush was very, very strong against David Duke. I think if he had it to do again, he might not have gotten involved in that campaign because I think David Duke now, if he runs, takes away almost exclusively Bush votes and then a guy like (Mario) Cuomo runs. I think Cuomo can win the election.\"", "King: \"But Bush morally had to come out against him.\"", "Trump: \"I think Bush had to come out against him. I think Bush — if David Duke runs, David Duke is going to get a lot of votes. Whether that be good or bad, David Duke is going to get a lot of votes.\"", "Our ruling", "Trump said, \"I don't know anything about David Duke.\"", "Trump seems to have forgotten that he knew enough about Duke to denounce him twice this election cycle. In 2000, he knew enough to criticize Duke’s racism. And in 1991, he knew enough to say he hated what votes for Duke represented.", "We rate Trump’s claim Pants on Fire!", "\"I don't know anything about David Duke.\"", "Buzzfeed, \"David Duke Urges His Supporters To Volunteer And Vote For Trump,\" Feb. 25, 2016", "CNN, State of the Union, Feb. 28, 2016", "Washington Post Fact Checker, \"Donald Trump and David Duke: For the record,\" March 1, 2016", "Factcheck.org, \"Trump’s David Duke Amnesia,\" March 1, 2016", "Twitter, @realDonaldTrump, Feb. 28, 2016", "Youtube, \"Trump \"disavows\" former KKK leader's support,\" Feb. 26, 2016", "Youtube, \"Donald Trump: The Full 'With All Due Respect' Interview,\" Aug. 27, 2015", "CQ search", "Nexis search", "New York Daily News, \"VENTURA WON'T GO TO THE MAT, BAILS ON PEROT,\" Feb. 12, 2000", "NBC, \"Donald Trump Says He Will Not Run for President in 2000,\" Feb. 14, 2000", "Donald J. Trump Presidential Exploratory Committee, \"Statement of Donald J. Trump,\" Feb. 14, 2000", "New York Times, \"What I Saw at the Revolution,\" Feb. 19, 2000", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]