["Twitter user Sergeant Bikash posted a video of a masked man firing gunshots while a group of policemen are seen moving tactically in the facility. The accompanying message read, “Gun attack at shopping Mall at Amsterdam, Holland this morning. World changes”. According to the claim, the video shows a ‘gun attack’ at a shopping mall in Amsterdam, Netherlands.", "Gun attack at shopping Mall at Amsterdam, Holland this morning. World changes. pic.twitter.com/A7yySaW3C4", "— Sergeant Bikash (@bikash63) October 25, 2019", "Many other people on Facebook and Twitter shared the video with an identical claim.", "Alt News found that the video depicts a counter-terrorism exercise carried out by the German police on October 15, 2019. We Google searched the word –“polizei“- imprinted on the vest worn by the cops and found an article published by Russian Television network Russia Today or RT on October 16, 2019.", "RT reported, “Nuremberg’s central train station was shut down on Tuesday evening as 300 German police officers took part in a counter-terrorism exercise on-site, with cops taking turns at playing armed attackers targeting rail passengers.”", "German police officers took part in ‘largest in 20 years’ counter-terrorism drill amid security concerns over right-wing extremists https://t.co/LjDU16pJRw pic.twitter.com/G2EEwvSxcx", "— RT (@RT_com) October 17, 2019", "Hundreds more in support staff were involved in the drill informed the Middle Franconia Head of Police Roman Fertinger who dubbed the exercise as the “largest in 20 years.” The exercise is seen in the background of a gunman attack on eastern Germany’s synagogue. Two people were killed by the attacker after attempting to enter the synagogue where dozens were observing a Jewish holiday. However, the Bavarian Interior Minister Joachim Hermann stressed that the exercise had been planned for months and that it was not directly a consequence of the attack outside a synagogue in Halle. He was quoted saying that they are a consequence of the threat scenarios we have in Germany.", "In conclusion, a video of a mock drill carried out by the German police was shared on social media with the false claim that a gun attack took place at a shopping mall in Amsterdam, Netherlands.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]