["A video of a man attempting suicide by touching a live transformer is being circulated on social media with the claim that an LIC (Life Insurance Corporation) employee in Surat committed suicide after the government’s decision to sell off the company’s stake. One Sanjay Gadhia who in his Twitter bio claims to be the in-charge of the social media department of INC’s Gujarat Pradesh Congress Committee tweeted the video. It garnered more than 500 retweets before Gadhia took it down. “नरेन्द्र मोदी के LIC कंपनी बेचने के निर्णय से नाखुश होकर गुजरात के सूरत शहर में कर्मचारी की LIVE खुदकशी।”, reads the Hindi message posted with the video.", "Multiple users on Twitter have quote-tweeted Gadhia’s video and made similar claims. Two on Facebook have shared the video with the identical text.", "Alt News has also received requests on its official app to fact-check the video.", "You can watch the video posted below by another Facebook user who shared it with a caption in Malayalam which says that a BJP activist committed suicide in Rajasthan. “എന്റെ മരണം ഈ രാജ്യത്തിന് വേണ്ടിയെന്നും ഇതിൽ നിന്നും പാഠം പഠിക്കണമെന്നും അമിത്ഷായോടും മോദിയോടും ഓർമപ്പെടുത്തിക്കൊണ്ട് ഒരു ബി.ജെ.പി.പ്രവർത്തകൻ മോദിയുടെ തട്ടകമായ രാജസ്ഥാനിൽ ഇലക്ട്രിക് ട്രാൻസ്ഫോർമറിൽ കയറി ആത്മഹത്യ ചെയ്ത ദാരുണാന്ത്യം രാജ്യത്തെ നാണം കെടുത്തി,” reads the message.", "*നാണംകെട്ട ഭരണകൂടം.* 😭😭😭😭😭😭😭 *എന്റെ മരണം ഈ രാജ്യത്തിന് വേണ്ടിയെന്നും ഇതിൽ നിന്നും പാഠം പഠിക്കണമെന്നും അമിത്ഷായോടും മോദിയോടും ഓർമപ്പെടുത്തിക്കൊണ്ട് ഒരു ബി.ജെ.പി.പ്രവർത്തകൻ മോദിയുടെ തട്ടകമായ രാജസ്ഥാനിൽ ഇലക്ട്രിക് ട്രാൻസ്ഫോർമറിൽ കയറി ആത്മഹത്യ ചെയ്ത ദാരുണാന്ത്യം രാജ്യത്തെ നാണം കെടുത്തി.* *അഭിമാനമായ ഇന്ത്യയെ വെട്ടി പരിക്കേൽപ്പിച്ചതിൽ മനംനൊന്ത് രാജസ്ഥാനിലെ തന്നെ പ്രധാന BJP പ്രവർത്തകനാണ് ആത്മഹത്യ ചെയ്തത്. ( വീഡിയോ കാണുക.)", "Posted by IřFàn BèèTèè on Wednesday, 15 January 2020", "The Malayalam text is viral on Facebook.", "A keyword search on Google revealed that the video is from Madurai, Tamil Nadu. It shows an army man’s attempt to commit suicide by holding a high tension terminal in a transformer on Madurai district collectorate on January 7, 2020. He was rushed to Government Rajaji Hospital where he was treated.", "P Muthu, a 25-year-old army man posted in Rajasthan, had appeared before the Revenue Divisional Officer (RDO) after his wife committed suicide. Muthu married Thenisha from Nilakottai in Dindigul district three-and-a-half months ago. According to a report by The Times of India, there was a dispute in the family over dowry. She consumed poison and was subsequently admitted to a private hospital for first-aid. On January 6, Thenisha was shifted to GRH where she died. A case was registered with the Nilakottai police under 174-CrPC and an inquiry was carried out along with an RDO inquiry in progress. Muthu came out of the RDO office and went straight to the transformer and climbed on to it. His relatives and others tried to pacify him.", "This claim was earlier fact-checked by news website News Meter when the same video was shared with the false narrative of a farmer committing suicide in Amravati, Andhra Pradesh.", "In conclusion, a video of an army man who attempted to commit suicide in Madurai, Tamil Nadu, is being shared with the false narrative that an LIC employee from Surat wanted to commit suicide after government’s move to sell the company’s stake. It is noteworthy that LIC is likely to go public in the next financial year.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]