["About this rating", "In late June 2018, a series of investigative news reports exposed the fact that Juan Sanchez, the chief executive of non-profit Southwest Key, was making a salary of $1.5 million while his organization had scored $458 million in federal grants to shelter detained children who had been taken from their parents at the southern U.S. border.", "The reports came amid widespread outrage over U.S. President Donald Trump's \"zero tolerance\" immigration policy and as viral stories often do, resulted in a number of memes that spread throughout social media:", "Introducing pic.twitter.com/aYaDYIY38z", "— Samuel L. Jackson (@SamuelLJackson) June 21, 2018", "Although memes are not always factual, the one shared by actor Samuel Jackson is. The figures were taken from a 19 June 2018 Bloomberg report:", "The nonprofit, Southwest Key Programs Inc., is to be paid more than $458 million in fiscal 2018, according to the data — the most among the organizations, government agencies and companies that run a detention and care system for immigrant children on behalf of the Department of Health and Human Services. Southwest Key has about a dozen facilities in Texas, including a site at a former WalMart Inc. store in Brownsville that has drawn attention from members of Congress and national news organizations. [...]", "Southwest Key rapidly increased the compensation of its CEO, Juan Sanchez, from about $269,000 in 2010 to more than $786,000 in 2015, the most recent year for which its tax returns are available through the website Guidestar.org. His compensation nearly doubled to $1.5 million in 2016, according to tax records for an Austin charter school he founded.", "We independently confirmed with tax records publicly available through the non-profit tracking site Guidestar.org and public financial data posted by the Department of Health and Human Services (HHS), which oversees programs for unaccompanied immigrant children, that the figures reported by Bloomberg are accurate. Sanchez's salary and money awarded to his non-profit both ballooned in recent years. In fiscal year 2017, Southwest Key was awarded more than $285,000,000 and about $211,000,000 in 2016. Sanchez's salary roughly doubled from 2015 to 2016.", "The Austin-based charity runs 27 immigrant children's shelters in Texas, Arizona and California, according to an archived version of its web site (which is currently down). It has been awarded almost half of the $948 million budgeted for the care of unaccompanied immigrant children by HHS.", "Southwest Key became the focus of heightened scrutiny in June 2018 amid outcry over Trump's \"zero tolerance\" policy enacted in April 2018. Under the policy, all adults who cross the border between ports of entry were charged with federal offenses and their accompanying children were taken from them. Many of those children were placed at Southwest Key facilities, including Casa Padre, a converted WalMart in Brownsville, Texas reportedly holding 1,500. As people began asking questions about the welfare and whereabouts of the children, unpleasant answers began emerging.", "Among those providing those answers has been Antar Davidson, a 32-year-old whistleblower who worked at Estrella del Norte, a Southwest Key shelter in Tucson, Arizona from February 21 to 12 June 2018.", "Davidson described scenes of chaos after \"zero tolerance\" went into effect. The facility was unprepared for the stream of younger children that began around May. The children, he said, were traumatized, disoriented, and acting out, running around, throwing things and fighting.", "\"It was really a big mess,\" he told us in a phone interview. Davidson, who is of Brazilian descent, said he would hold classes for the martial art form capoeira. But during classes, \"some little six or seven year old would run in and an employee would be chasing them down.\" Many times, he said, the children had to be physically restrained by staffers. Training for situations requiring restraint increased in frequency when the younger children started showing up.", "Davidson, who quit his job out of disillusionment, confirmed a story first reported by the Los Angeles Times. At one point he was asked to translate for a group of Brazilian siblings, aged six, ten and 16, who had been separated from their parents. The distraught, crying children, who were clinging to each other, were separated and placed in different parts of the facility because they were of different ages and genders. He was told to prevent them from hugging, because the shelter has a strict \"no touching\" policy.", "The result of the \"zero tolerance\" policy has been that more than 2,000 children have been taken from their parents at the border. The Trump administration has provided no information on how they will be reunified. Wrenching news stories and audio published by ProPublica of weeping children calling for their parents after being separated drew public outrage. In response, Trump signed an executive order on 20 June 2018 that does not reunite families already separated but seeks to change laws limiting the amount of time children can spend in detention, which could result in families being in detention indefinitely.", "We attempted to contact Southwest Key for comment and received no response.", "Emily, Jennifer.   \"Texas Nonprofit has Received $1.5 billion in Federal Money to Run Shelters for Immigrant Children.\"\r\n    Dallas Morning News.   20 June 2018.", "Haigh, Marilyn.   \"This Texas Nonprofit Houses Nearly Half of America's Undocumented Children in Custody.\"\r\n    Texas Monthly.   20 June 2018.", "Hennessy-Fisk, Molly.   \"'Prison-Like' Migrant Youth Shelter Is Understaffed, Unequipped for Trump's 'Zero Tolerance' Policy, Insider Says.\"\r\n    Los Angeles Times.   14 June 2018.", "Kotch, Alex.   \"Sources: Wealthy Founder of Nonprofit Housing Migrant Children Asks Staff for Money.\"\r\n    The Young Turks.   19 June 2018.", "Wayne, Alex, et al.   \"Trump’s Immigrant Child Detentions Mean $458 Million for Nonprofit.\"\r\n    Bloomberg.   19 June 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]