["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former Georgia House Minority Leader Stacey Abrams addresses the 110th NAACP National Convention, Monday, July 22, 2019, in Detroit. (AP)", "President Donald Trump riffed on a familiar theme of accusing Democrats of wanting to give rights to undocumented immigrants, singling out Georgia’s Stacey Abrams.", "Speaking at a rally in Tupelo, Miss., on Nov. 1, Trump recounted how Georgia Republican Brian Kemp beat Abrams in the 2018 race for governor.", "\"Stacey Abrams wants to give illegal aliens the right to vote. Do you believe this?\" Trump asked.", "Trump, who has made multiple inaccurate statements about noncitizens voting, then pivoted to a broad attack on Democrats wanting to give immigrants in the country illegally free health care and even \"more advantages than our own military has.\" (See a related fact-check.)", "Trump’s attack on Abrams does not reflect her position. Other iterations of the attack by Trump and Kemp were deemed  \"misleading,\" a \"distortion\" or \"wrong\" in fact-checks by journalists since last year.", "The gist of the fact-check: Abrams mentioned undocumented immigrants in a long list of groups that made up the \"blue wave\" supporting her campaign, but she never asked anyone ineligible to vote to cast a ballot.", "Noncitizens cannot vote in federal elections, but they can vote in some local elections in a few jurisdictions. When asked by a reporter earlier this year during a discussion of municipal voting rights if she would support noncitizens voting in some cases, Abrams made a distinction between municipal elections and federal elections, and she said she wasn't arguing for it but \"wouldn’t oppose it.\"", "The Trump campaign pointed to a comment Abrams made Oct. 9, 2018, in front of supporters at a campaign event. Abrams was speaking about the diversity of the \"blue wave,\" referring to a groundswell of Democratic voters.", "Abrams said: \"The blue wave is African American. It’s white, it’s Latino, it’s Asian, Pacific Islander. It is disabled. It is differently abled. It is LGBTQ. It is law enforcement. It is veterans. It is made up of those who have been told they are not worthy of being here. It is comprised of those who are documented and undocumented. It is made up of those who have been told they’re successful and those that have been told they are left behind. But the real wave is when we come together and we tell Georgia we are here and we are not going anywhere.\"", "Abrams didn’t actually say she wanted undocumented immigrants to cast ballots for her, which would have been illegal.", "A few days later, a clip of Abrams’ comments was publicized by the Washington Free Beacon and then spread to other media.", "Over the next few weeks, Abrams and her campaign argued she wasn’t calling for ineligible voters to cast ballots.", "\"I've never once argued for anyone who is not legally allowed to vote in the state of Georgia to be allowed to vote,\" Abrams said. \"What I said that day is that this is a state that should be looking out for everyone in our state, and I would hope that anyone running for governor should believe in all of Georgia.\"", "Kemp pounced on her comments in an interview on Fox News and later said during a debate that Abrams had \"called on illegals\" to vote for her.", "Abrams disputed his characterization and criticized the state’s \"exact match\" law that placed the registrations of tens of thousands of voters on hold, largely of African Americans. \"I am one of the foremost experts in the state on expansion of voting rights,\" she said. \"I have never in my life asked for anyone who was not legally eligible to vote to be able to cast a ballot.\"", "A spokeswoman for Abrams’ organization, Fair Fight Action, told PolitiFact that Abrams was referring to the resistance against Trump, including his administration’s policies on immigration.", "\"Undocumented people are a part of that resistance, because they deserve human dignity that Donald Trump is trying to take away,\" said spokesman Seth Bringman.", "The Trump campaign also pointed to comments Abrams made in January 2019 during an interview on PBS when she was asked about her view on cities allowing some noncitizens to vote in local elections. Abrams sounded open to the reasons for a noncitizen voting in a local election but said she was \"not arguing for it or against it.\"", "\"I think there’s a difference between municipal and state and federal,\" she said. \"Part of municipality — I’m not arguing for it or against it, but I will say, having been deputy city attorney, there’s a very — the granularity of what cities decide is so specific, as to, I think, allow for people to be participants in the process without it somehow undermining our larger democratic ethic that says that you should be a citizen to be a part of the conversation.\"", "The reporter followed up: \"So, in some cases, you would be supportive of noncitizens voting?\"", "\"I wouldn’t be — I wouldn’t oppose it,\" Abrams said.", "Trump said, \"Stacey Abrams wants to give illegal aliens the right to vote.\"", "Trump’s attack on Abrams is overly broad. In her unsuccessful bid for governor, Abrams spoke about the diversity of the \"blue wave\" in Georgia and mentioned a long list of groups including undocumented immigrants. She didn’t say they should be given the right to vote, and that has not been her documented position.", "Later, Abrams said she \"wouldn’t oppose\" noncitizens voting in municipal elections, but she specified that it was different from state or federal races. It would be possible for listeners to wrongly assume from Trump’s claim that Abrams wants noncitizens to vote in all elections.", "This statement rates Mostly False.", "Factbase, Speech: Donald Trump Holds a Political Rally in Tupelo, Mississippi, Nov. 1, 2019", "Stacey Abrams for governor, Comments to supporters, Oct. 9, 2018", "New York Times, 15 False or Misleading Claims in Trump’s Georgia and Tennessee Rallies, Nov. 4, 2018", "Atlanta Journal-Constitution, The right to vote becomes a heated battle in Georgia governor’s race, Oct. 21, 2018", "Atlanta Journal-Constitution, The Jolt: Kemp said to look at what’s ‘buried deep on Page 50.’ So we did. Oct. 22, 2018", "Politico, Abrams, Kemp spar over voting and immigration in Georgia governor debate, Oct. 23, 2018", "National Review, A Blue Wave of ‘Undocumented’ Voters? Oct. 17, 2018", "Breitbart, Democratic Candidate Stacey Abrams: ‘Undocumented’ Immigrants Are Part of the ‘Blue Wave’ Oct. 12, 2019", "C-SPAN, Georgia debate, Oct. 23, 2018", "TIME, Read the Full Transcript of Stacey Abrams' Rebuttal to President Trump's State of the Union, Feb. 6, 2019", "U.S. District Court Northern District of Georgia, Lawsuit filed against Brian Kemp, 2018", "Associated Press, AP FACT CHECK: Kemp wrong on Abrams comments, Oct. 25, 2018", "PolitiFact, Georgia’s 'exact match' law and the Abrams-Kemp governor's election, explained, Oct. 19, 2018", "PolitiFact, Can noncitizens vote in San Francisco, Takoma Park elections? Oct. 15, 2018", "PolitiFact, Donald Trump's Pants on Fire claim that millions of illegal votes cost him popular vote victory, Nov. 28, 2016", "PolitiFact, Donald Trump's False claim veterans treated worse than illegal immigrants, Sept. 9, 2016", "PolitiFact, Trump tweets that 58,000 noncitizens voted in Texas. That hasn't been proven, Jan. 28, 2019", "Email interview, Seth Bringman, Fair Fight Action spokesman, Nov. 4, 2019", "Statement from the President Donald Trump re-election campaign, Nov. 5, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]