["By Lori Robertson", "Posted on July 19, 2016", "Donald Trump told Fox News that he “recommended” that the Republican National Convention be held in Ohio, saying, “I wanted it to be here.” But Trump announced his intention to run for president nearly one year after the Republican National Committee had selected Cleveland for the site of the convention.", "We haven’t found evidence that he pushed the RNC to pick Ohio before its July 2014 selection. We reached out to Trump’s campaign and the RNC communications office, asking if either had evidence of Trump recommending Ohio or Cleveland as the site of this year’s convention, but we have not received a response. The Cleveland 2016 Host Committee press office referred us to the RNC, saying the city’s host committee wouldn’t be privy to conversations Trump may have had with RNC members.", "RNC Convention Site Selection Committee member Sandy Boehler, from North Dakota, represented the Midwestern region on the committee, along with another member and an alternate. Boehler told us in an email, “I was never contacted by Trump camp.”", "Our fact-checking colleagues at PolitiFact.com didn’t find any support for the claim either, and quoted one site selection committee member, Steve Duprey of New Hampshire, as saying, “It’s possible he said something to somebody, but I never heard of it.”", "Trump made the claim in a July 18 interview with Fox News’ Bill O’Reilly when discussing Ohio Gov. John Kasich’s decision not to attend the convention:", "Trump, July 18: I wanted it to be here. And we had lots of choices. I wanted it to be in Ohio. I recommended Ohio. And people fought very hard that it be in Ohio. It’s a tremendous economic development event and you look at the way it’s going so far, it’s very impressive. I wanted it to be here. The Republicans wanted it to be here.", "It is possible that Trump voiced an opinion to someone with the Republican Party. Trump wasn’t a presidential candidate at the time: He declared his candidacy in a June 16, 2015, speech; the RNC site selection committee announced that its pick was Cleveland on July 8, 2014. The final decision was between Cleveland and Dallas, but the state of Ohio had a strong chance of getting the nod from the beginning — three of the original eight cities under consideration were in the Buckeye State.", "The RNC elected the members of the site selection committee in late January 2014. We searched news articles on Nexis from January 2014 through August 2014, looking for anything that mentioned Trump, Cleveland and the convention, but we found nothing indicating that Trump had commented on the site selection. Trump did speak at the Conservative Political Action Conference in March 2014, so he was active politically, even if he wasn’t running for office.", "We did find news articles on other prominent figures lobbying for Cleveland’s selection. The day before the RNC’s announcement, Roll Call ran a story on Republican leaders from Ohio working with the host committee and putting “the full-court press” on the RNC selection committee “for months.” And the Knoxville News-Sentinel wrote about local Tennessee businessman Jim Haslam contacting Republican officials to urge the city’s selection. Haslam’s son Jimmy owns the Cleveland Browns, and his son Bill is the governor of Tennessee.", "We’ll update this item if we receive any information indicating that Trump recommended Ohio or Cleveland to the RNC.", "https://www.sharethefacts.co/share/b2ab5c0d-0784-4c00-b4a0-b61f83eaf170", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]