["About this rating", "At 110-years-old, Alfred “Alfie” Date was recognized as Australia’s oldest man — and for his adorable penchant for knitting pint-sized sweaters for penguins in need.", "In the past, wildlife organizations like Penguin Foundation have asked the public for assistance in knitting sweaters, or “jumpers,” for penguins affected by oil spills to wear temporarily. Knitted sweaters are placed on the birds to act as a barrier to keep them from reaching their oily feathers with beaks until rescue staff can wash them clean.", "“When little penguins become oiled, they will try to preen and clean the toxic oil from their feathers, and ingesting it can kill them,” wrote the Penguin Foundation. “It also damages their delicate feathers, which exposes their skin to extreme temperatures and they are left cold, heavy, and unable to swim or hunt for food.”", "And among the Penguin Foundation’s most well-known and admired knitting aficionados was Date, who was known for knitting sweaters for the aptly named “little penguins” endemic to the waters surrounding Australia and New Zealand.", "Date first went viral in February 2015 when 9 News in Australia reported that the then-108-year-old man spent his days knitting sweaters for the organization. Date went viral again in February 2021 when a woman by the name of Marjorie Bosworth shared a Facebook post of the man and his knitting needles paired alongside a group of penguins in adorable little sweaters. At the time of writing, the post had been shared more than 101,000 times.", "Penguin Foundation’s Knits for Nature penguin jumper program has been in operation for over two decades and has received more than 100,000 penguin jumpers. (It is unclear whether the above photos are those that were made by Date or another contributor.)", "At the age of 110 years old, Date was the oldest living man and the second oldest living person in Australia at the time of his May 2, 2016, death, reported The Daily Telegraph at the time.", "“The Penguin Foundation is saddened to hear of the recent passing of Mr. Alfred Date. Mr. Date was a wonderful contributor to the ‘Knits for Nature’ program, and provided us with many woolen jumpers to protect Phillip Island’s little penguins in the event of an oil spill,” wrote the Penguin Foundation at the time.", "“We feel very privileged to have played a small part in Mr. Date’s celebrated and incredibly rich 110 years of life, and our thoughts are with his family at this time.”", "Before you get your needles out, the Penguin Foundation advised on Jan. 14, 2021, that it had closed the Knits for Nature program for the time being.", "“Thanks to you we now have more than enough little penguin rehabilitation jumpers to rely upon in the event of an oil spill and are asking our community to please stop knitting jumpers,” wrote the foundation on Facebook.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]