["Former governor of Cross River state made a number of claims to argue that Nigeria's education system is in crisis, we checked his claims.", "Nigeria’s education system is in crisis, presidential hopeful Donald Duke declared on his Facebook page @RealDonaldduke in July 2018.", "In an earlier post to his half a million followers, the former governor of Cross River state made a number of claims to argue that Nigeria could be “depriving children of an education”.", "“Nigeria has over 10 million out-of-school children, the highest number in the world,” he said.", "“According to Unicef, 30% of pupils drop out of primary school and only 54% transit to junior secondary schools,” Duke further noted.", "Unicef is the United Nations Children’s Fund, which works to improve the lives of children and mothers in developing countries.", "But are Duke’s claims correct?", "“30% of pupils drop out of primary school.”", "Duke has not responded to Africa Check’s request for the Unicef stats he quoted.", "We found them on an undated Unicef Nigeria web page. It reads: “According to current data, 30% of pupils drop out of primary school and only 54% transit to Junior Secondary Schools.”", "We asked Unicef communication specialist Eva Hinds to clarify. She said the numbers were old.", "\"The outdated webpage you are referring to has been disconnected from our site some time ago but it has not been permanently deleted,” she said. “I have asked this action to be taken now.\"", "A few days later, Unicef deleted the page. The original page is archived here.", "So what is the dropout rate?  Dr Ricardo Sabates, an academic at the University of Cambridge’s Research for Equitable Access and Learning Centre, directed Africa Check to reliable databases such as that by the Institute for Statistics, the official data agency of the United Nations Educational, Scientific and Cultural Organisation.", "One way to measure the school dropout rate is to look at how many kids in a group who enter the first grade make it all the way to the final grade. This “cohort survival rate” was 64.38% in 2009, the year the institute last has data on, meaning about 35% - more than Duke’s figure - had dropped out.", "“Only 54% transit to junior secondary schools.”", "In 1999, the government introduced a plan to ensure all Nigerian children of primary and secondary age get free and compulsory basic education.", "Parents or officials who prevent this education may be punished under the Universal Basic Education Act of 2004.", "The 2016/17 Multiple Indicator Cluster Survey found the transition rate of pupils from primary to junior secondary school to be 49%. This is the number of children in the first grade of secondary school compared with the number in the last grade of primary school the previous year.", "To arrive at this estimate, more than 37,000 household members aged 25 to 49 were interviewed across Nigeria.", "We thus rate Duke’s claim as exaggerated as he suggested more children make it to secondary school than actually do.", "The current government has pledged to raise the rate to 75% by 2019.", "The transition rate has however dropped from 74% in 2011 to 49% in 2017. Reasons for this include teachers' welfare, poor implementation of the basic education plan and school charges such as for exams. This is according to Dr Abdulrahman Maigida, a lecturer at the University of Port Harcourt and a specialist in educational history and policy.", "“This situation also leaves the country with the burden of an unproductive or unskilled populace,” Maigida told Africa Check.", "“Nigeria has over 10 million out-of-school children, the highest number in the world.”", "On another page of its website, Unicef notes that “Nigeria still has 10.5 million out-of-school children - the world’s highest number”.", "In an August 2017 fact-check, Africa Check found that Unesco’s Institute for Statistics had revised this figure, which was based on 2010 enrolment data from Nigeria. It was an estimate based on the 2011 Multiple Indicator Cluster Survey by the National Bureau of Statistics.", "But with new population estimates the number was revised to 8.7 million in 2014.", "The 10.5 million figure is dated and new interventions may have changed the existing data, Azuka Menkiti, an education specialist with Unicef in Nigeria reportedly said in May 2018.", "Alexander Onukwue, the education policy lead of Eduplana Nigeria, said politicians should use accurate data in public. The organisation campaigns for education funding and teachers’ development.", "“It is based on this data they’ll make promises and if such are faulty or incorrect, then they'll give us questionable education policies,” Onukwue said.", "Edited by Lee Mwiti", "Further reading:", "https://africacheck.org/factsheets/factsheet-grading-nigerias-progress-in-education/", "https://africacheck.org/reports/nigeria-girls-school-worldwide-activist-malala-claimed/", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]