["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A post shared on Facebook shows Trump next to two people who appear to be wearing Ku Klux Klan garb and carries a headline saying the KKK endorses his re-election.", "The post is from an article on a website that says it publishes only satire.", "A photo of Trump with hooded klansmen was made by an artist who poses celebrity lookalikes for her work.", "A reader suggested we check a Facebook post that showed a poorly constructed image of President Donald Trump next to two people in what appear to be Ku Klux Klan robes and hoods.", "Below the image was this headline:", "\"The KKK officially endorses Trump 2020.\"", "The post is from a March 2019 article on NPC Daily, which includes another photo of what appears to be Trump with hooded KKK members. The letters \"NPC\" stand for the author of the site, Neville Percival Croft. And the klansmen photo is from artist Alison Jackson, who uses celebrity lookalikes for her work.", "A bio box for Croft below the NPC article ends with a disclaimer:", "\"This entire site is satire.\"", "Former KKK leader David Duke of Louisiana in 2016 publicly endorsed Trump’s candidacy for president. Trump at the time received criticism for not disavowing Duke’s support when asked about it on CNN by journalist Jake Tapper. Days later, Trump issued a tweet about the matter saying, \"I disavow.\"", "Trump has been criticized for not condemning white nationalists, such as when he said there was \"blame on both sides\" after a 2017 white nationalist rally and counterprotest in Charlottesville, Va., turned violent.", "But there is no indication that Trump has received the official endorsement of the KKK, which, according to the Southern Poverty Law Center, has become less visible and more fractured in recent years compared with other movements propelled by white supremicist thought.", "An image shared on social media claimed: \"The KKK officially endorses Trump 2020.\"", "The image is from a March 2019 article on a website that publishes only satire. While Trump was infamously endorsed by a former KKK leader in 2016, we do not find evidence that the organization has issued a formal endorsement of the president in his run for reelection in 2020.", "We rate the claim False.", "NPC Daily, \"The KKK officially endorses Trump 2020,\" March 12, 2019", "Facebook, post, Feb. 9, 2020", "W Magazine, Alison Jackson’s Photos of Celebrity Lookalikes Take Fake News to Another Level, March 10, 2019", "Southern Poverty Law Center, Ku Klux Klan, accessed Feb. 17, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]