["About this rating", "In the days before the Jan. 6, 2021 attack on the U.S. Capitol, several altercations took place on flights where supporters of President Donald Trump argued with other passengers, including heckling Sen. Mitt Romney as he arrived in Washington, D.C. These instances prompted airlines and unions representing flight attendants to express concern about in-flight security as some of the rioters began to leave the D.C. area.", "In response to these past incidents, and due to upcoming flights leaving the D.C. area, American Airlines has put protocols in place that include increased staffing at airports in the area, and suspending alcohol service on its flights to and from the region. They added that their crew members would not be staying in hotels in the downtown area.", "The Association of Flight Attendants-CWA (AFA) International, a union that represents nearly 50,000 flight attendants at 17 airlines, released a statement saying the rioters should not be allowed on flights. Citing examples of altercations on various flights, they said:", "Air travel is safe because everyone follows a strict set of rules, based on the spirit that ‘we’re all in this together.’ The mob mentality behavior that took place on several flights to the D.C. area yesterday was unacceptable and threatened the safety and security of every single person onboard. It will not happen again. There’s a reason that there are strict penalties and fines for failing to comply with crewmember instructions. Enforcement keeps everyone safe.", "Our first priority in aviation safety and security is to keep any problems on the ground. Some of the people who traveled in our planes yesterday participated in the insurrection at the Capitol today. Their violent and seditious actions at the Capitol today create further concern about their departure from the DC area. Acts against our democracy, our government, and the freedom we claim as Americans must disqualify these individuals from the freedom of flight.", "The union representing American Airlines flight crews, the Association of Professional Flight Attendants (APFA), said, “We are incredibly concerned about recent politically motivated incidents on board passenger aircraft. Regardless of one's political beliefs, the cabin of a commercial aircraft must, out of necessity, be a calm environment for the safety of everyone onboard.”", "Paul Hartshorn Jr., an APFA spokesperson, added that banning people who participated in the riots would be a \"Herculean\" task.", "\"If the airline is aware of someone that has been abusive on the ground, involved in rioting, and destruction of property and dangerous behavior, that if the airline was aware of it, they absolutely should not be allowed to fly home from Washington on our airline. I believe, again, that that's very difficult to monitor,\" he said.", "The in-flight alcohol ban appears to be temporary. Due to the pandemic, American Airlines had stopped serving alcohol in the main cabin on Mar. 24, 2020, but it was still available in first class. Now, even that has been banned for D.C. area flights.", "Other airlines are also following suit. Officials with Delta and United said they were taking additional security measures in the region. American and United said they were working closely with law enforcement. Full details about this were not immediately available. We reached out to American Airlines to learn more and will update this post if we get more information.", "Given the range of measures introduced in response to violence at the Capitol and politically motivated altercations on flights surrounding these events, we rate this claim as “True.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]