["About this rating", "The U.S Army Corps of Engineers originally considered a Dakota Access Pipeline route north of Bismarck but abandoned the idea, citing eleven miles of additional pipeline length and dozens more crossings.", "\"Mostly white\" residents of Bismarck did not refuse to accept the threat to their water supply, and the project was not subsequently forced upon tribes at Standing Rock because white people rejected the risk.", "On 29 October 2016, rumors appeared on social media that the contested Dakota Access pipeline was originally slated to pass through Bismarck, and had been re-routed across the Standing Rock Reservation when the city's mostly white residents refused to accept the risks the pipeline posed to their drinking water:", "The Sioux are literally being forced at gunpoint to accept ecological risks that North Dakota's white residents refused. — terrycloth warrior (@suntzufuntzu) October 29, 2016", "The tweets made a very specific claim about the Dakota Access pipeline's contentious route: that the pipeline was only routed across the disputed territory because Bismarck's white residents were unwilling to allow their own water supply to be threatened.", "According to another tweet, the Sioux were \"literally being forced at gunpoint\" to allow the pipeline to cross their land when residents of Bismarck had simply been given the option to refuse it.", "Articles about the claim referenced an 18 August 2016 story in the Bismarck Tribune as their source. The piece was published not long after the start of protests at Standing Rock, but some nuance was lost in subsequent citations of the article:", "The U.S. Army Corps of Engineers evaluated the Bismarck route and concluded it was not a viable option for many reasons. One reason mentioned in the agency’s environmental assessment is the proximity to wellhead source water protection areas that are avoided to protect municipal water supply wells.", "In addition, the Bismarck route would have been 11 miles longer with more road crossings and waterbody and wetland crossings. It also would have been difficult to stay 500 or more feet away from homes, as required by the North Dakota Public Service Commission, the corps states.", "The Bismarck route also would have crossed an area considered by federal pipeline regulators as a “high consequence area,” which is an area determined to have the most significant adverse consequences in the event of a pipeline spill.", "According to that source, the U.S. Army Corps of Engineers (not the residents of Bismarck) considered and rejected an alternate route through the city in DAPL's early planning stages. The plan was quickly abandoned, not because the Sioux were considered to be less valuable than their neighbors in Bismarck, but because the alternate route ran an additional eleven miles and included several more water crossings. Additionally, the decision to abandon that route came from a planning party, and did not appear to have anything to do with one set of residents being heard while a second set was ignored.", "A 25 July 2016 environmental assessment prepared on behalf of the Army Corps of Engineers contained what appeared to be the source material for the Bismarck claims:", "Early in the routing phase of the DAPL Project, Dakota Access considered but eliminated an alternative centerline that originated in Stanley, North Dakota, within Mountrail County, where it connected to customer receipt points and headed southwest through Williams County and crossed the Missouri River approximately 8.5 miles east of the Yellowstone River and Missouri River confluence. The centerline then headed southeast across the state and crossed Lake Oahe approximately 10 miles north of Bismarck, where it then headed south again and entered South Dakota approximately 35 miles east of Lake Oahe in McIntosh County. In addition to other evaluation criteria listed in Table 2.1, the route alternative was in proximity to and/or crossing multiple conservation easements, habitat management areas, National Wildlife Refuges, state trust lands, waterfowl production areas, and private tribal lands.", "Both early reports and Army Corps of Engineers documents showed that an early, scrapped plan did propose a pipeline route north of Bismarck, but the Army Corps of Engineers opted to re-route it via Lake Oahe, citing a shorter pipeline, fewer water crossings, and reduced proximity to residential areas.", "The decision appeared to have been unrelated to objections from residents of Bismarck, and no plan was ever solidified to route the pipeline north of the city before its residents shut it down.", "Dalrymple, Amy.   \"Pipeline Route Plan First Called For Crossing North Of Bismarck.\"\r\n    Bismarck Tribune.   18 August 2016.", "DeCourcey, Danielle.   \"Two Tweets Show The Big Double Standard In The Standing Rock Debate.\"\r\n    attn:.   1 November 2016.", "U.S. Army Corps of Engineers.   \"Dakota Access Pipeline Project Crossings Of Flowage Easements And Federal Lands.\"\r\n    25 July 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]