["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In April 2020, the above-displayed image started circulating online, supposedly showing a crop circle resembling a logo for Microsoft Windows ringed with the \"crown\" shape of coronaviruses.", "This picture was shared by some social media users who claimed it was a piece of \"protest art\" that appeared somewhere in the United Kingdom. This image, however, is a digital manipulation.", "The fake image was created by doctoring a genuine photograph of a crop circle that was reportedly created in a wheat field in Wiltshire, England, in the summer of 2004. Here's a look at the original photograph (left) and the doctored image (right):", "The Temporary Temple, a group that archives crop-circle images, has a few other images that show this real crop circle from various angles.", "Although crop circles may have once conjured up images about mysterious alien visitors, these displays typically have earthly origins. Crop circles may be created by hoaxers, artists, or even advertisers. In 2014, for instance, the technology company NVIDIA created a crop circle resembling a computer chip:", "Instead — surprise! — it was a stunt intended to attract publicity to the release of a mobile processor used in automobiles, tablets and cell phones made by the computer graphics company NVIDIA, according to its president and CEO, Jen-Hsun Huang.", "\"It is true. The NVIDIA marketing team is behind this phenomenon,\" Huang said as he stood in front of a picture of the manicured field. \"What you're looking at here is 310 feet in diameter. It is what people call a crop circle.\"", "While we have been unable to dig up much information about the 2004 crop circle in Wiltshire, England, this community does have a rich crop circle history. In the 1970s, pranksters Doug Bower and Dave Chorley captured the attention of extraterrestrial enthusiasts when they created crop circles there.", "Smithsonian Magazine reported:", "When Doug Bower and his co-conspirator Dave Chorley first created a representation of a “flying saucer nest” in a wheat field in Wiltshire, England, in 1976, they could not have foreseen that their work would become a cultural phenomenon.", "[...]", "Before today’s circle-makers entered the picture, there had been scattered reports of odd patterns appearing in crops, ranging from 17th century pamphlets to an 1880 account in Nature to a letter from astronomer Patrick Moore printed in 1963 in New Scientist. In Australia, the mid- to late-1960s saw occasional reports of circles in crops, and they were often ascribed to UFO landings. At around the same time in England, the Wiltshire town of Warminster became a center of UFO-seeking “sky watches” and gave birth to its own rumors of crop circles, or “saucer nests.” None of these, unfortunately, was photographed.", "It was such legends that Bower had in mind when, over a drink one evening in 1976, he suggested to his pal Chorley: “Let’s go over there and make it look like a flying saucer has landed.” It was time, thought Doug, to see a saucer nest for himself.", "The digitally manipulated image of a crop circle resembling the Microsoft Windows logo and the crown of the coronavirus was frequently shared on social media by those alleging some sort of connection between former Microsoft CEO Bill Gates and the COVID-19 coronavirus disease pandemic. For example, one prevalent (albeit nonsensical) conspiracy theory holds that Gates is using COVID-19 to implement microchips into people via vaccines. You can read more about \"ID2020\" here.", "BBC.   \"Wiltshire Crop Circle Brings Hundreds to Farm.\"\r\n    7 January 2014.", "Radford, Benjamin.   \"Crop Circle Was a Publicity Stunt: Why 'Experts' Were Fooled.\"\r\n    Live Science.   7 January 2014.", "Irving, Rob and Peter Brookesmith.   \"Crop Circles: The Art of the Hoax.\"\r\n    Smithsonian Magazine.   15 December 2009.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]