["About this rating", "In early May 2018, a number of news outlets warned parents of a purportedly popular \"deodorant challenge\" that gave one teenager second-degree burns:", "Various strange, and sometimes dangerous, trends have come and gone in school playgrounds and on social media over the years. There was the mannequin challenge. Then it was the backpack challenge. Then the infamous Tide-pod challenge.", "But the “deodorant challenge” is the latest to worry parents, as kids who take part are seriously injuring themselves.", "Mom Jamie Prescott from South Gloucestershire, England, posted on Facebook after the deodorant challenge left her daughter, who is in the ninth grade, with second-degree burns on her arm, according to Yahoo News.", "The stories noted that the challenge one of the latest to worry parents, not that it necessarily injures teenagers. Coverage of the Deodorant Challenge was fairly widespread, but across the board, its supporting evidence traced back to one single 4 May 2018 Facebook post shared by one parent in the UK:", "Outlets covering the \"Deodorant Challenge\" typically referenced other news sites as proof that the trend was genuinely popular, and only reported on a individual child in Britain injured by the fad (vaguely suggesting that parents had been \"warned\"):", "A mother has warned others about a 'horrendous' playground game sweeping South West schools, a game which left her daughter with severe second degree burns.", "Jamie Prescott's recent social media post about her year 10 daughter's injuries after playing \"The Deodorant Challenge\" has gone viral, and the mother wrote about how the game is \"doing the rounds\" in the area.", "Fears about the \"Deodorant Challenge\" actually appeared before May 2018, although they were perhaps perhaps likelier to be shared in a post-Tide Pods era. Roughly a year earlier, British and American news sites and morning chat shows reported that a separate child had \"burned her own arm repeatedly using an aerosol deodorant because 'it looks really cool.'\"", "On YouTube, a handful of videos referenced the trend (several clips from news stations), and more nebulous references to the Deodorant Challenge (or Aerosol Challenge) appeared in 2014 and 2015. In April 2018 the journal Burns Open published a concise item about \"burns challenges,\" grouping a number of purported social media fads involving intentional infliction of discomfort on the skin. Authors wrote that the Deodorant Challenge was not common, new, or anything approaching a fad:", "[Research demonstrated that] two participants of the deodorant challenge in US, a 14 and a 45 years old, who had performed the challenge out of curiosity. The oldest linked case report was set back in 1991 in a 8.5 year old male, who performed a similar act with an air freshener, whilst another case report noted two adolescents performing it in 2003.", "Blog posts and news reports about the Deodorant Challenge appear to pop up annually, with at least two students in the UK reporting topical burns from the use of an aerosol spray. News outlets seem to be responding to viral popularity of stories about imagined stupidity among teenagers and millennials (eating Tide Pods, snorting condoms, getting confused by analog clocks) rather than any actual danger to children who, like adults, are mainly not inclined to burn their own skin.", "Chen, Joyce.   \"Deodorant Challenge' Is the Latest Craze That's Hurting Teens.\"\r\n    Today.com.   6 June 2017.", "Chu, Verena et al.   \"Burns Challenges – A Social Media Dictated Phenomena in the Younger Generation.\"\r\n    Burns Open.   April 2018.", "Gray, Rebecca.   \"Warning After Spray-Can Web Craze Dare Burns Hole in Arm of Girl, 12.\"\r\n    Evening Times of Glasgow.   22 April 2015.", "Harper, Paul.   \"Mum Issues Chilling Warning About the ‘Deodorant Challenge’ Playground Craze Where Children Spray Aerosol Onto Their Skin Until It Burns.\"\r\n    The Sun.   26 May 2017.", "Mal, Nisha.   \"This Is Why Your Child Shouldn't Take Part in the Deodorant Challenge.\"\r\n    GetSurrey.co.uk.   8 May 2018.", "Malloy, Tomas.   \"The Deodorant Challenge: Mum's Warning About 'Horrendous' Playground Game Sweeping South West Schools.\"\r\n    SomersetLive.co.uk.   6 May 2018.", "Malloy, Tomas and Janet Hughes.   \"Mum Fears Daughter, 10, Will Need Skin Graft After Joining Playground Game Sweeping Through Schools.\"\r\n    GloucestershireLive.co.uk.   7 May 2018.", "Quackenbush, Casey.   \"A Teenager Was Left With Second-Degree Burns After Taking Part in 'The Deodorant Challenge.'\"\r\n    TIME.   Accessed 9 May 2018.", "Shipman, Alex.   \"'Deodorant Challenge' Leaves Teen with Second-Degree Burns.\"\r\n    Fox News.   8 May 2018.", "Young, Sarah.   \"Deodorant Challenge: The Social Media Craze That’s Burning Children’s Skin.\"\r\n    Independent.   30 May 2017.", "Deccan Chronicle.   \"Bizarre New Trend Called 'Deodorant Challenge' Poses a Grave Threat to Children.\"\r\n    8 May 2018.", "WDTN-TV [Dayton].   \"Mom Warns Parents About 'Deodorant Challenge' After Daughter Suffers Burns.\"\r\n    8 May 2018.", "Oddity Central.   \"Crazy Aerosol Challenge Has Teens Burning Themselves with Sprays Just for Kicks.\"\r\n    8 January 2018.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]