["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In a Nov. 18, 2020, interview on the Fox News show “Fox & Friends,” White House Press Secretary Kayleigh McEnany said that COVID-19 guidelines were “Orwellian\" (relevant comments begin at the 04:00 mark in the video below):", "https://video.foxnews.com/v/6210628183001#sp=show-clips", "McEnany had been asked by anchor Steve Doocy to comment on recent “suggestions and guidelines” from a “number of governors” who suggested that, in advance of the Thanksgiving holiday, people do not need to gather in large groups, particularly with those from outside of their bubble.", "“I think a lot of the guidelines you’re seeing are Orwellian,” said McEnany, instead pointing to guidelines issued on Nov. 12 by the Centers for Disease Control and Prevention (CDC) that did not specifically suggest limiting group sizes but did recommend hosting a virtual Thanksgiving meal.", "“The American people know how to protect their health. We’ve dealt with COVID for many months,” continued McEnany. “But it’s Orwellian in a place like Oregon to say, ‘If you gather in numbers more than six, we might come to your house and arrest you, and you get 30 days of jail time.’ That’s not the American way. We don’t lose our freedom in this country. We make responsible health decisions as individuals.”", "The term “Orwellian” refers to George Orwell’s dystopian novel \"1984,\" which describes Big Brother, an oppressive government regime that watches and controls the public. Described by The New York Times as the “most widely used adjective derived from the name of a modern writer,” \"Orwellian\" has been used to characterize overbearing governments and draconian policies characterized by propaganda and disinformation.", "The comment came a day after Oregon Gov. Kate Brown issued an executive order that described a statewide freeze that limited at-home and social gatherings, restricted restaurants to take-out only, and closed non-essential businesses like gyms and museums. Though the governor is encouraging voluntary compliance, the freeze measures are enforceable by law and could be punishable by 30 days in jail or a fine of $1,250 or both.", "“I expect local law enforcement to continue to use an education first approach, but Oregonians need to understand that these rules are enforceable under law,” said Brown in a news release. “A large majority of Oregonians continue to do the right thing to protect themselves, their loved ones, and their neighbors. However, when Oregonians don’t take COVID-19 seriously and don’t take steps to reduce the spread of the disease, they put all of us at risk.”", "Snopes contacted Brown's office and received the following statement from Press Secretary Elizabeth Merah:", "Since March, the Governor’s executive orders have had the force of law — they have always been punishable, both through criminal penalties and civil penalties. That’s not changing.", "What has changed, in a very urgent way, is the dangerous threat that COVID-19 poses to our communities, and the urgency every single Oregonian needs to take to help stop its spread. This virus spreads through individual contact — and individual behaviors can make a huge difference in stopping its spread. However, if people aren’t going to take this virus seriously, we are prepared to offer consequences. The Governor’s recent statement on partnering with law enforcement is a punctuation mark to hold people accountable in making smart choices that can save another’s life.", "The Oregon State Police will be working with local law enforcement to enforce the Governor’s orders, in the same way local law enforcement officers respond to noise complaints for loud parties, for example, and issue citations. If a violation is cited criminally, under ORS 401.990, it is a class C misdemeanor, which is punishable by up to 30 days in jail, a fine of up to $1,250, or both. A prosecutor can also opt to reduce the citation down to a class A violation, which has a lower fine. If a violation is pursued by the Oregon Health Authority under ORS 431A.010(d), it is a civil penalty, and the statutory maximum is $500 a day per violation.", "These measures to stop the spread of COVID-19 are a necessity to give Oregon a fighting chance to flatten the curve and save lives.", "In general, measures introduced by the Oregon governor were broadly sweeping and impacted businesses and faith-based institutions, whereas those issued by the CDC mainly spoke to how to “make Thanksgiving safer.” For one, Oregon issued a “freeze period” from Nov. 18 to Dec. 2 that limited at-home and social gatherings to a maximum of six people from no more than two households. On the other hand, the CDC did not restrict gatherings to a specific number of attendees but rather recommended that people “limit the number of guests.”", "As many states experienced upticks in cases in the weeks leading up to the 2020 holiday season, Oregon reported more than 59,000 positive COVID-19 cases.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]