["About this rating", "The Facebook page for the conservative group Turning Point USA frequently posts photographs they claim show the ill effects of socialism. The following image, for instance, was shared on social media with the hashtag #socialismsucks:", "The above-displayed image has little to do with \"socialism\" or the importance of free markets. This image actually shows a shopping aisle that was nearly cleared of supplies after a natural disaster.", "This photograph was taken on March 15, 2011, by Associated Press photographer Mark Baker at a supermarket in Moriyama, Japan. The country had just experienced a magnitude-9 earthquake and a devastating tsunami that left thousands of people dead and destroyed more than 100,000 buildings.", "In the aftermath of the disaster, Japan suffered shortages of food, gasoline, medicine, and other supplies, which led to long lines and empty shelves at grocery stores.", "NPR reported:", "Shortages of food and gasoline were being felt in parts of Japan on Thursday nearly a week after a deadly earthquake and tsunami, as people hoarded basic items fearing that supplies would soon dry up...", "...Shoppers in the Tokyo metro area, 150 miles from the crippled Fukushima Dai-Ichi nuclear power plant, had cleaned some supermarket shelves of items such as rice, bread and yogurt.", "Store managers in Aomori, on the northern tip of Japan's main Honshu island, told NPR that the area had been hit by a combination of hoarding by shoppers and a breakdown of the supply chain. That chain normally is fed by ports, roads and railways, many of which are now heavily damaged in wake of last week's disaster...", "...Along the coast, people must stand in line for food, gasoline and kerosene to heat their homes. In the town of Kesennuma, 55 miles north of Sendai, they lined up to get into a supermarket after a delivery of key supplies, such as instant rice packets and diapers.", "This is at least the second time that Turning Point USA has miscaptioned a photograph of an empty shopping aisle and passed it off as if it showed the ill effects of socialism.", "CNN.   \"2011 Japan Earthquake - Tsunami Fast Facts.\"\r\n    11 March 2011.", "Oskin, Becky.   \"Japan Earthquake & Tsunami of 2011: Facts and Information.\"\r\n    Live Science.   13 September 2017.", "NPR.   \"Food, Gas Shortages Amid Relief Efforts In Japan.\"\r\n    17 March 2011.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]