["Although President-elect Joe Biden won't take over the nation's highest office until January, he has already assembled a task force to handle the coronavirus, tapping experts who will be ready to jump into action once he is sworn into office.", "And the rumors and misinformation about his task force are already being circulated.", "A screenshot of a Distributed News article posted on Instagram last week wrongly claims that a member of Biden's recently assembled task force recommended withholding food stamps and aid from those who refuse to get the COVID-19 vaccine when it's available.", "The post was shared on Instagram by Angela Stanton-King, who was released from federal prison after being pardoned by President Donald Trump in February after she gave birth while incarcerated.", "She ran for Congress as a Republican in the late-Rep. John Lewis' district in Georgia and was defeated by Georgia Democratic Party Chair Nikema Williams. Stanton-King calls herself a criminal justice expert and is a former reality television star.", "\"The elderly, the poor, and the blacks,\" Stanton-King said in the caption. \"First to go! This is what Democrats wanted...\"", "Stanton-King did not respond to an Instagram message seeking comment on her post.", "More:Fact check: What's true and what's false about coronavirus?", "The website Distributed News routinely publishes false information. A media bias site ranked Distributed News as \"tin foil hat\" on its conspiracy level scale.", "Distributed News does not have a way to contact its authors or the page in general, so seeking comment for this article wasn't possible.", "The website's post incorrectly says that Dr. Luciana Borio, an infectious disease doctor who is part of Biden's task force, wants to bar people who refuse the vaccine from receiving food stamps and rent assistant.", "More:Fact check: Dr. Anthony Fauci did not say masks contributed to Spanish flu deaths", "\"A prominent member of Biden's Covid-19 taskforce, a CIA-linked operative named Luciana Borio, says that people who refuse to be vaccinated should be deprived of food stamps and rent assistance,\" Distributed News wrote.", "Although Borio is vice president of a nonprofit called In-Q-Tel that equips the CIA and other intelligence agencies with the latest information technology, she isn't employed by the CIA.", "Borio and 20 other members of a working group met in July to discuss the virus and authored a 47-page paper on the public's role in COVID-19 vaccination. Monica Schoch-Spana and Emily K. Brunson were the co-chairs for the group.", "The working group was not affiliated with Biden's campaign; it was a collaboration between Texas State and Johns Hopkins universities.", "The paper doesn't mention withholding needed aid at all.", "It recommends public health agencies partnering with organizations already offering services to vulnerable populations, like the WIC nutrition program, clinic services or free food programs.", "\"Bundling services (eg, food security, rent assistance, free clinic services) that are already being provided to particularly vulnerable populations in the context of COVID (eg, older adults, low-income adults, Black and minority communities) could be a way to build trust and streamline vaccine provision,\" the recommendation says.", "This approach is aligned with what some health agencies have done as they battle the pandemic.", "The Metro Nashville Health Department went to public housing complexes in late spring to offer coronavirus tests to residents. The virus posed a significant risk for those living in public housing across the country, many of whom lost their jobs because of the pandemic or still were required to report to work in person.", "A spokesperson for Biden's campaign didn't respond to a request for comment on the task force.", "On Biden's website, he and Vice President-elect Kamala Harris outline their approach to curbing the pandemic.", "Harris recommends forming a COVID-19 Racial and Ethnic Disparities Task Force that will specifically focus on disparities in public health and economic response.", "Biden has previously released plans for helping older Americans and those with disabilities during the pandemic. He wants to pass the Coronavirus Relief for Seniors and People with Disabilities Act, which will grow access to home and community-based services.", "The claim that a Biden task force member recommended withholding rent assistance and food stamps from those in need is FALSE. PolitiFact also debunked this claim.", "Reach Brinley Hineman at bhineman@tennessean.com and on Twitter @brinleyhineman.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]