["About this rating", "In March 2017, social media users began sharing an article published by Resistance Report, a left-leaning news and opinion web site, purporting to list \"nine terrifying bills\" advanced by Congressional Republicans while Americans were \"distracted\" by claims and counter-claims regarding the Trump administration's alleged ties to Russia:", "The Republican-led Congress is wasting no time forcing through the most horrendous bills seen in decades while America’s eyes are on Russia.", "With both houses of Congress solidly under Republican control, there’s little in the way to stop House Speaker Paul Ryan (R-Wisconsin) and Senate Majority Leader Mitch McConnell (R-Kentucky) from sending bills to President Trump’s desk that embody the most dangerous aspects of radical right-wing ideology.", "The list has since grown to 10 bills (with the addition of legislation to place new sanctions on Iran) and gone viral, with more than one version in circulation. Value judgments aside (we invite readers to make up their own minds about how \"horrendous\" or \"dangerous\" these bills are), we can verify that the following 10 pieces of legislation were, in fact, introduced by Republicans, and are, in fact, real, although their content has in some cases been misrepresented, and not all of these bills have any clear shot at passage.", "Here is the full list, with brief summaries and links to sources for more information:", "Introduced on 3 February 2017 by Rep. Matt Gaetz (R-Florida) and three Republican cosponsors, the body of H.R. 861 is only one sentence long: \"The Environmental Protection Agency shall terminate on December 31, 2018.\" The text of the bill does not stipulate what would become of existing EPA regulations and their enforcement, but Gaetz has indicated that he intends jurisdiction to fall to individual states.", "H.R. 610, aka the \"Choices in Education Act of 2017,\" would change how federal tax dollars are distributed to qualified states for education spending, mandating that all such monies be awarded in block grants, a portion of which must go into voucher programs for use by parents to pay for private and home schools. The bill was introduced by Rep. Steve King (R-Iowa), with three Republican cosponsors. Supporters say the legislation is intended to widen educational options for all Americans, though critics maintain it amounts to at least a partial defunding of public schools.", "Like H.R. 861, which would get rid of the EPA, H.R. 899 calls simply for the \"termination\" of the Department of Education by the end of 2018. It was introduced by Rep. Thomas Massie (R-Kentucky), with six Republican cosponsors (including Rep. Matt Gaetz, who introduced the bill to terminate the EPA). President Trump's Secretary of Education, Betsy DeVos, has stated she would be \"fine\" with having herself \"worked out of a job.\"", "House Joint Resolution 69, introduced by Rep. Don Young (R-Alaska) on 7 February 2017 and passed by the House nine days later, would negate U.S. Fish and Wildlife Service regulations prohibiting certain types of non-subsistence hunting for purposes of predator control on federally protected lands in Alaska. Supporters of H.J.R. 69 say the reversal is necessary to redress an \"illegal jurisdictional power grab\" by the federal government.", "According to Reuters, Congressional Republicans tried more than 60 times to repeal or modify the Affordable Care Act (\"Obamacare\") while Obama was still in office. Candidate Trump promised to rid of Obamacare if he won, and it was a major plank in the 2016 Republican Party platform. Not unexpectedly, Rep. Bill Flores, a Texas Republican, re-introduced H.R. 370, a bill to repeal the Affordable Care Act, on 8 January 2017, eight weeks after Trump was elected. It contained no details pertaining to what might be offered as an alternative to the ACA, or when.", "Rep. Diane Black (R-Tennessee) introduced H.R. 354, the \"Defund Planned Parenthood Act of 2017,\" on 6 January. Like another version introduced (and passed by the House) in 2015, the bill would prohibit distribution of federal funds to Planned Parenthood Federation of America or any of its affiliates or clinics for a period of one year, unless they certify that no funds will go toward providing abortions (except in cases of rape, incest, or life-threatening conditions). H.R. 354 has 133 cosponsors (all Republicans), even though the use of federal funds for abortion services is already prohibited by law, and even though Planned Parenthood claims abortions comprise only 3 percent of its total services (a disputed figure) and only around 10 percent of its clients receive abortions.", "Many states have enacted so-called right-to-work laws, which prohibit labor unions and employers from requiring workers to join unions to get or keep jobs. The National Conference of State Legislatures (NCSL) explains:", "Currently, 28 states and Guam have given workers a choice when it comes to union membership. Labor unions still operate in those states, but workers cannot be compelled to become members as a requirement of their job. Kentucky became the 27th right-to-work state when it enacted HB 1 on Jan. 9, 2017. Missouri became the 28th by enacting SB 19 on Feb. 2, 2017.", "Unlike many other items on their agenda, the Republican sponsors of H.R. 785 are keen on handing over the power to decide this matter to the federal government instead of the states. Opponents say passage of the bill would lead to lower wages and greater unemployment nationwide, not to mention create an unfair situation in which non-dues-paying employees reap the benefits of union activities.", "H.R. 83, introduced by Rep. Lou Barletta (R-Pennsylvania) and cosponsored by nine Republicans, would punish so-called \"sanctuary cities\" (such as San Francisco, Los Angeles, New Orleans, and New York City) who refuse to comply with certain federal immigration policies, such as handing over undocumented immigrants for deportation. The bill provides that any local jurisdiction that does not comply with federal immigration regulations \"shall be ineligible to receive Federal financial assistance for a minimum period of one year.\" Confusingly, two days after H.R. 83 was introduced on 23 January 2017, President Trump signed an executive order designed to do the same thing. Critics argue that the order is unconstitutional.", "The Prenatal Nondiscrimination Act (PRENDA) of 2017, H.R. 147, was introduced on 3 January 2017 by Rep. Trent Franks (R-Arizona), with 59 cosponsors, all Republicans. The bill, similar to ones introduced in previous sessions of Congress, would not criminalize abortion per se (contrary to how it has been represented in some sources), but it would make it a crime under certain conditions:", "This bill imposes criminal penalties on anyone who knowingly or knowingly attempts to: (1) perform an abortion knowing that the abortion is sought based on the sex, gender, color or race of the child, or the race of a parent; (2) use force or the threat of force to intentionally injure or intimidate any person for the purpose of coercing a sex-selection or race-selection abortion; (3) solicit or accept funds for the performance of such an abortion; or (4) transport a woman into the United States or across a state line for the purpose of obtaining such an abortion.", "Violations or attempted violations shall result in fines and/or imprisonment for up to five years.", "H.R. 808, introduced on 1 February 2017 by Rep. Peter Roskam (R-Illinois), places \"non-nuclear\" sanctions on Iran to (in cosponsor Lee Zeldin's words) \"assist with efforts to reduce Iran's destabilizing activities, which included a missile test just this week that violated a UN resolution, as well as their continued work to overthrow foreign governments, pledge to wipe Israel off the map, chanting Death to America in their streets, and so much more.\"", "Baucum, Joseph.   \"Obliterating EPA Would Create Chaos, Experts Say.\"\r\n    Pensacola News Journal.   3 February 2017.", "Cahill, Tom.   \"While We Were Distracted by Trump, Republicans Advanced These 9 Terrifying Bills.\"\r\n    Resistance Report.   4 March 2017.", "Cameron, Darla.   \"How Sanctuary Cities Work, and How Trump's Executive Order Might Affect Them.\"\r\n    The Washington Post.   25 January 2017.", "Cowan, Richard and Susan Cornwell.   \"House Votes to Begin Repealing Obamacare.\"\r\n    Reuters.   14 January 2017.", "DeBonis, Mike.   \"House Votes to Defund Planned Parenthood, But Will that Help Avert a Shutdown?\"\r\n    The Washington Post.   18 September 2015.", "Dodge, Garen E. and Anna M Stancu.   \"Congress Considers National Right-to-Work Bill: Beginning of the End for Unions?\"\r\n   The National Law Review.   8 February 2017.", "Goldschmidt, Debra and Ashley Strickland.   \"Planned Parenthood: Fast Facts and Revealing Numbers.\"\r\n    CNN.com.   17 January 2017.", "Lee, Jasmine C. et al.   \"What Are Sanctuary Cities?\"\r\n    The New York Times.   6 February 2017.", "Lee, Michelle Ye Hee.   \"For Planned Parenthood Abortion Stats, '3 Percent' and '94 Percent' Are Both Misleading.\"\r\n    The Washington Post.   12 August 2015.", "Swan, Jonathan.   \"What Betsy DeVos Wishes She Said at Her Confirmation Hearing.\"\r\n    Axios.   17 February 2017.", "Troutfishing.   \"Rep. Steve King Introduces Bill to Begin De-Funding of Public Education.\"\r\n    Daily Kos.   23 February 2017.", "AFLCIO.org.   \"Deceptive Right to Work Laws Hurt Everyone.\"\r\n    Accessed 7 March 2017.", "Congress.gov.   \"Legislation: 115th Congress (Data on Various Bills).\"\r\n    Accessed 7 March 2017.", "NCSL.org.   \"Right-to-Work Resources.\"\r\n    Accessed 7 March 2017.", "Zeldin.House.gov.   \"Congressman Zeldin Statement Supporting New Iran Sanctions.\"\r\n    3 February 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]