["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Are the unemployment numbers being manipulated to make the Obama administration look good?", "That was the contention of Donald Trump Jr., son of the Republican presidential nominee, during the July 24 edition of CNN's State of the Union.", "Trump was making a point frequently made by his father — that the official unemployment rate is lower than it should be because it doesn't take into account the people who would like a job but have stopped looking.", "\"The way we actually measure unemployment is after x number of months if someone can't find a job, congratulations, they're miraculously off,\" he said. \"That doesn't count\" in the calculation.", "\"These are artificial numbers,\" Trump continued. \"These are numbers that are massaged to make the existing economy look good, to make this administration look good when, in fact, it's a total disaster. ... Those are the people we want to put to work\"", "He's correct that the widely-reported unemployment number doesn't capture the full employment picture. But for this check, we'll talk about whether the numbers are massaged to make the economy look better than it is.", "We've looked at the issue before with Donald Trump Sr. when he claimed the \"real\" rate was 18 to 20 percent (False) or may be as high as 42 percent (Pants on Fire).", "The unemployment rate is developed by the U.S. Bureau of Labor Statistics based in part on data from interviews of about 60,000 households conducted by the Census Bureau  As Trump Jr. indicated, it only includes people who have recently looked for a job.", "But that's the way it's consistently been done for decades. Alternative methods have their own limitations.", "Allegations of manipulation", "When we asked for evidence that the numbers are distorted for political reasons, Trump campaign spokesman Dan Kowalski referred us to a 2013 New York Post story alleging that the Census Bureau \"faked\" the sharp drop in the September 2012 unemployment rate just prior to the election that gave Obama a second term.", "The story's only identified source was a Census employee, Julius Buckmon, who told the Post that his superiors had told him to make up interviews that serve as the basis for the statistic.", "Two problems: Buckmon had left the bureau by 2012, and he told the paper he was never told to sway the statistic in favor of Obama.", "As we reported in 2013, even a worker who made up interviews wouldn't be able to pull enough statistical weight to significantly affect the unemployment rate for any month.", "A typical worker handles data from 35 to 55 of the 60,000 or so households surveyed. And the bureau routinely double-checks its findings by having households re-interviewed by a different person in an attempt to look for inconsistencies that might point to manipulation.", "The Office of the Inspector General at the Commerce Department concluded in May 2014 that there was \"no evidence\" that the numbers had been manipulated in the runup to Obama's reelection, especially when other sources confirmed the trend.", "The report said: \"It would have taken 78 Census Bureau Field Representatives working together, in a coordinated way, to report each and every unemployed person included in their sample as 'employed' or 'not in labor force' during September 2012\" to produce that kind of manipulation.", "Since then, unemployment has continued to fall.", "Artificial numbers?", "Other experts joined Baker in dismissing the younger Trump’s allegation about the standard unemployment rate.", "\"The same basic definition of the unemployment rate has been used (with minor changes) going back almost all the way to World War II, under both Republican and Democratic administrations,\" said Gary Burtless, a senior fellow in economic studies at the Brookings Institution.", "\"This measure has been consistently produced following the same basic methodology in the U.S. and copied around the world for over 50 years,\" said Tara Sinclair, an economist at George Washington University.", "And what about Trump's complaint that the numbers are skewed by not including people who have given up looking for work?", "Sinclair said the BLS tries to track that through a variation of the unemployment rate known as U-6, or the \"underutilization\" rate. This version includes people who have stopped looking for work but say they would start if the market improved, people working part-time because they can't get full-time work, along with the people included in the standard unemployment rate.", "By it's nature, the U-6 rate is higher. The June rate was 9.6 percent compared to the conventional unemployment rate of 4.9 percent.", "But that estimate has its limitations as well. It doesn’t count recent graduates who never entered the labor market in the first place because they feared there would be no jobs for them, and it doesn’t count people who chose to take care of their kids full-time, went back to school or retired early to avoid having to compete for a job.", "By that statistic, the economy is not as healthy as the conventional unemployment estimate would indicate.", "Casey Mulligan, professor of economics at the University of Chicago, said it's fair for the younger Trump to dispute the standard unemployment rate as an indicator of economic performance because the labor market has not gained the type of strength you would expect with the current unemployment rate.", "It's a question of which BLS data to use \"rather than the competence of the BLS per se,\" he said.", "But Harvard University government professor Jeffrey Frankel said the important thing \"is to be consistent across time in which measure you use. It wouldn't be right to switch from looking at the conventional rate to a measure that includes discouraged workers just because you don't like the incumbent president and want to make things look bad for him.\"", "Other experts were more blunt.", "Trump’s comment \"is a reprise of the same nonsense his father floated a few months ago. It is yet another conspiracy theory that the Trumps have grabbed onto,\" said Neil Buchanan, a George Washington University law professor.", "The limitations of the unemployment number are well known, he said. \"Everyone who reads an article in a decent newspaper about the employment picture each month reads about discouraged workers, part-time workers, and so on.\"", "\"There are plenty of grounds for us nerd-types to complain about the accuracy of the BLS numbers,\" said Dean Baker, co-director of the left-leaning Center for Economic Policy and Research in Washington. \"No survey is perfect and there will always be issues with how a survey is conducted and questions are posed. But the idea that BLS cooks numbers is beyond ridiculous.\"", "Our ruling", "Trump Jr. said that unemployment numbers \"are artificial numbers. These are numbers that are massaged to make the existing economy look good, to make this administration look good when, in fact, it's a total disaster.\"", "The economists with whom we spoke said Trump is wrong to question the integrity of the federal unemployment data. The method of developing the estimates have been used for decades, their limitations are widely recognized, other economic indicators have confirmed their reliability, and there's no evidence that they have been massaged for political purposes.", "Because his claim is in the realm of the ridiculous, we rate it Pants on Fire!", "https://www.sharethefacts.co/share/5ff3b1f3-79ac-4f4e-bce9-8a10cc1ddcfa", "YouTube, \"Donald Trump Jr. Interview on State of the Union,\" CNN channel, July 24, 2016", "PolitiFact, \"Elisabeth Hasselbeck suggests Census worker admitted to 2012 jobs conspiracy,\" Nov. 20, 2013; \"Rick Perry, in Iowa, says unemployment rate has 'been massaged, it's been doctored,'\" Jan. 26, 2015; \"Donald Trump says 'real' unemployment rate is 18 to 20 percent,\" June 16, 2015; \"Donald Trump says the unemployment rate may be 42 percent,\" Sept. 30, 2015;", "Email, Neil Buchanan, professor of law, George Washington University Law School, July 24, 2016", "Email, Gary Burtless, senior fellow, economic studies, The Brookings Institution, July 24, 2016", "Email, Jeffrey Frankel, James W. Harpel Professor of Capital Formation and Growth, Harvard Kennedy School, July 24, 2016", "Email, Dan Kowalski, spokesman, Donald Trump campaign, July 24, 2016", "Email, Casey Mulligan, University of Chicago, July 24, 2016", "Email, Eric Rauchway, professor of history, University of California at Davis", "Email, Tara Sinclair, associate professor of economics and international affairs, George Washington University, July 24, 2016", "New York Post, \"Census 'faked' 2012 election jobs report,\" Nov. 18, 2013, accessed July 24, 2016", "The Atlantic, \"Did the Census Bureau Really Fake the Jobs Report?\" Nov. 19, 2013", "Business Insider, \"Key Source in New York Post's Story About Unemployment Rate rigging Left Census Bureau in 2011\" and \"Here Are Some Issues With That Report About How The Unemployment Rate Was Faked Before The 2012 Election,\" Nov. 19, 2013", "Bureau of Labor Statistics, \"How the Government Measures Unemployment,\" \"Labor Force Statistics from the Current Population Survey,\" and \"The Employment Situation — June 2016,\" all accessed July 24, 2016", "Office of Inspector General, U.S. Department of Commerce, \"U.S. Census Bureau: Unsubstantiated Allegations that the Philadelphia Regional Office Manipulated the Unemployment Survey Leading up to the 2012 Presidential Election to Cause a Decrease in the National Unemployment Rate,\" May 1, 2014", "House Committee on Oversight and Government Reform, \"U.S. Census Bureau: Addressing Data Collection Vulnerabilities,\" Sept. 18, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]