["On May 12, visuals of masked men, who were seen brandishing guns and heard speaking to a man behind the camera, were relayed by several mainstream media outlets. It was claimed that the visuals of gun-toting men were from Purulia district in West Bengal. Some of the outlets even went a step further by alleging that the men were, “TMC workers”. In the video, people can be heard speaking in Hindi and Bengali. “रघुनाथपुर जा रहे है वोट कराने के लिए। किसकी ओर से ये क्यों बोले। हम लोग इलेक्शन कराने की लिए आया है ये बोलने का कोइए जरुरत नहीं है (We are going to Raghunathpur to make them vote. Why should we disclose from which side [political party] We have come to conduct the elections and we don’t need to speak about it -translated)”, said a man when he was questioned as to where were they headed with arms, and for which party were they doing it.", "At 12:44 PM, ETV Bharat published a report titled, “ভোট করাতে যাচ্ছি”, অত্যাধুনিক আগ্নেয়াস্ত্র হাতে বলল একদল দুষ্কৃতী (“Going to make them [people] vote,” said a group of terrorists who were carrying advanced firearms -translated)”.", "“This is the picture that we are getting. The situation in West Bengal is becoming more grim, with every passing day, with every phase of elections. Voting day terror squad. These are the men who are masked. We don’t know really who these men are but this video is from Purulia. That’s the information we are getting……This is happening on an election day where a Taliban style campaign taking place in West Bengal”, said the Republic TV anchor.", "Zee News, and Aaj Tak too broadcasted the video with a narrative that BJP has alleged that these men are TMC workers wielding guns to threaten voters.", "#VotingRound6: TMC workers frightening people with guns, alleges BJP#AbkiBaarKiskiSarkar pic.twitter.com/p4blsUaogI", "— Zee News (@ZeeNews) May 12, 2019", "The official handle of Bharatiya Janata Party tweeted a clip from the Zee News’ broadcast accusing the “TMC of crushing the democracy”. BJP MP Babul Supriyo also shared the viral video on May 12.", "बंगाल में चरम पर पहुंची ‘निर्ममता’", "लोकतंत्र को कुचल रहा TMC का ‘गणतंत्र’ #BengalPollViolence pic.twitter.com/r933bLZ5IL", "— BJP (@BJP4India) May 12, 2019", "Several other media outlets including News24, News 18 and India TV relayed the visuals claiming that these were from Purulia district, West Bengal.", "We found that the men in the video only said they were going to Raghunathpur, which is a city located in Purulia district, West Bengal. Based on the video, it is difficult to verify if the video is from West Bengal.", "Alt News contacted Purulia police to ascertain whether such gun-totting were spotted in Purulia district. Superintendent of Police Akash Magharia said, “In the video, the men never said where they are from and where did they belong to. This is not related to Purulia district. Anybody can claim that they are going to Purulia. My nakkas [checkpost] were in place. My men are in town. No person of that type carrying such arms had entered Purulia and we had a peaceful election here”. In response to the question whether the police were able to locate the video, he said, “We had earlier thought it to be from Jharkhand but we are investigating it further.”", "Times Now also broadcasted the same visuals while covering the polls but later clarified in the same show that it was “a fake video”. The reporter in the broadcast said that a local journalist had orchestrated the sequence in the video and that the police are investigating the matter.", "FAKE VIDEO ALERT: TIMES NOW has learnt about a ‘Bandook’ video, in which a group of unidentified men brandishing ‘guns’ is being spread on social media. The video is FAKE. Cops claim that video is from Jharkhand & not Bengal. FIR filed. | @Tamal0401 with details. pic.twitter.com/YdTFp9jBbh", "— TIMES NOW (@TimesNow) May 12, 2019", "Alt News couldn’t independently verify the video and establish its origins. Suffice to say, a video sans verification was relayed by sections of mainstream media with an unsubstantiated narrative that TMC workers were threatening the voters in West Bengal. As far as the claims about TMC workers brandishing guns in Purulia is concerned, the men in the video only stated that they are going to Raghunathpur, which is in Purulia district. Neither, there is evidence to claim that they were TMC workers nor that they entered Purulia. Alt News will update the article when there is more information about this incident.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]