["About this rating", "Along with cute kittens, puppies, political rants and Kardashian selfies, virtually anything having to do with armed grandmas taking down bad guys single-handedly is pretty much guaranteed to go viral these days, true or not. One such item appeared on the fake news web site World News Daily Report in October 2015:", "Grandmother with AK-47 Saves Cops Being Attacked by Street Gang", "Los Angeles| Officers of the LAPD received some totally unexpected backup yesterday, during a fire fight with local gang members in the Watts neighbourhood, as an elderly lady with an assault rifle showed up and scared the criminals away.", "Officers Ricardo Cordova and Frank Cho were responding to a call concerning a presumed drug deal in a parking lot, when they came under fire from members of a local street gang. The policemen rapidly found themselves in a perilous situation, being inferior to their attackers in both numbers and firepower.", "Fortunately for them, 79-year old Wendy Robinson was watching the events from her kitchen window and decided to intervene. The elderly woman equipped herself with her personal bulletproof vest and an AK-47 assault rifle, and ran to the officers’ rescue, firing more than 160 rounds in the direction of the assailants, injuring two of them.", "Like nearly all of the \"news\" World News Daily Report publishes, this story is pure fantasy and written for entertainment purposes only. The web site's disclaimer page makes no bones about it:", "All characters appearing in the articles in this website — even those based on real people —  are entirely fictional and any resemblance between them and any persons, living, dead, or undead is purely a miracle.", "Other examples of \"badass granny\" stories circulating online include \"Grandma Beats Up Airport Security Guards,\" \"Gun-Totin' Grambo Eva Estelle,\" \"93-Year-Old Grandma Kills 'Knockout Game' Thug,\" and \"Carry Permit Granny.\"", "None of the above is true.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]