["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Marco Rubio, R-Fla., once compared watching our national debt to waiting for the killer to appear during a horror movie.", "\"You know those movies where the people in the audience are screaming, ‘Don’t go in that door!’ because you know the killer is there? Well, it is the same thing with this debt,\" Rubio said during a Jacksonville radio station interview in 2012. \"We know how this ends.\"", "Scary stuff indeed. Rubio returned to talk about our killer debt during a speech at the conservative American Enterprise Institute Nov. 20.", "\"To lift the sequester we must find a real, lasting solution to the true cause of our growing national debt: the unsustainable path of important programs like Medicare and Social Security,\" he said.", "During the question and answer session, Rubio mentioned the sequester again:", "\"This notion that the sequester is just going to vanish and people are going to wake up, unfortunately, is unrealistic. I did not support the sequester. I do not believe that’s the right way to balance a budget. I just think it's better than tax increases, as bad as the sequester may be.\"", "We decided to turn the clock back and review Rubio’s actions and words that related to the sequester.", "The path to the sequester", "Rubio, a former state legislator, propelled himself into the national spotlight running for U.S. Senate in 2010. During the campaign, he raised alarms about federal spending and \"mountains of debt for our children.\"", "He continued that theme once elected to office. (We have fact-checked multiple claims by Rubio about the debt or sequester.) In March 2011, he made a flurry of national media appearances and penned an op-ed in the Wall Street Journal to announce he would vote against raising the debt limit \"unless it is the last one we ever authorize and is accompanied by a plan for fundamental tax reform, an overhaul of our regulatory structure, a cut to discretionary spending, a balanced-budget amendment, and reforms to save Social Security, Medicare and Medicaid.\"", "Rubio gave props to a plan by Rep. Dave Camp, R-Mich., to lower and simplify tax rates, close loopholes, and make permanent low rates on capital gains and dividends. He also gave a shout out to House Republicans for their budget plan, which he said would lower discretionary spending by $862 billion over 10 years.", "In an interview with Florida reporters, Rubio said lawmakers should consider raising the retirement age for Social Security, but not for people currently near retirement. Rubio has also called for reducing \"non-defense, non-veterans\" spending to 2008 levels.", "But Rubio, a freshman Republican in the minority in the Senate, didn’t have much sway.", "In the summer of 2011, President Barack Obama and Congress entered a high-stakes stand-off over the debt limit. House Republicans insisted on spending cuts before increasing the debt limit.", "Obama and House Speaker John Boehner tried unsuccessfully to reach a \"grand bargain,\" a specific plan to put the federal budget on more stable footing. When that failed, they arrived at the less ambitious Budget Control Act of 2011. The House passed the bill 269-161. In the Senate, it passed 74-26 with Rubio voting ‘’no’’ on Aug. 2, 2011.", "The law included about $1.2 trillion in future budget cuts, but it also directed Congress to find another $1.2 trillion via a bipartisan \"supercommittee.\" As further incentive, the law had a threat: If a supercommittee couldn’t agree on a package, or if Congress voted down the supercommittee proposal, a sequester would automatically go into effect, putting in place nearly across-the-board budget cuts, with half coming from defense.", "Rubio released a statement about his vote against the measure: \"I cannot support this plan because it fails to actually solve our debt problem, fails to diminish the risk of a credit rating downgrade and is not a long-term solution to avert a debt crisis.\"", "Rubio wrote that the plan failed to immediately downsize government and ignored \"the biggest driver of our debt, health care spending.\" Rubio also wrote that he feared the vote would lead to consideration of big tax hikes.", "\"And if Congress rejects new taxes, then up to $850 billion of devastating automatic defense spending cuts would be triggered at a time when the world is as dangerous as it’s ever been,\" he wrote.", "Both Obama and Boehner supported the plan, and despite Rubio’s no vote, it passed Congress with bipartisan majorities. The supercommittee deadlocked, though, so it never proposed new cuts. That’s what led to the sequester.", "After it was clear the supercommittee couldn’t reach agreement, Rubio was among a group of Republican senators who tried to prevent defense from being subject to the sequester.", "\"Defense funding should be driven by our national security needs, not by arbitrary fiscal arithmetic,\" said the senators in a December 2011 statement.", "The sequester officially started in March 2013 and led to multiple claims about the impact on Head Start, airports and wacky spending.", "Lawmakers found plenty of fodder to criticize about the sequester and Rubio was no exception. In July 2013, Rubio wrote an op-ed criticizing the fact that the sequester grounded the Navy’s Blue Angels from an event in Pensacola.", "\"The Blues were grounded this weekend all because of a feckless decision made two years ago more than 900 miles away in Washington, D.C.\" Rubio wrote.", "Rubio repeated that he opposed the sequester and wanted limited to spending in a floor speech in July.", "\"I do not dispute that it (the sequester) will have an impact. In fact, I voted against the deal that actually gave us the sequester, and I voted against it because, while I believe deeply we need to constrain spending because we are spending a lot more money than we are taking in, about $1 trillion a year more than we are taking in, borrowing about 40 cents of every dollar we spend in the federal government -- for the folks visiting here in the gallery, you may be shocked to hear that. Every dollar the federal government spends, 40 cents of it is borrowed.", "In September 2013, Florida federal courts officials held a video conference with aides to Rubio and U.S. Sen. Bill Nelson, D-Fla., to talk about the impact of the sequester on the courts.", "Brooke Sammon, Rubio's deputy press secretary, said then that Rubio \"has always said that the sequester was a bad idea, in part because it does not prioritize core public safety functions. The only way to solve our long-term deficit problems is to grow our economy, which will require entitlement reform and pro-growth tax reform, not tax hikes.\"", "Our ruling", "Rubio said \"I did not support the sequester.\"", "Rubio voted \"no\" on the Budget Control Act in 2011 that paved the path toward the sequester in March 2013. He said at the time that he voted \"no\" because the law \"fails to actually solve our debt problem, fails to diminish the risk of a credit rating downgrade and is not a long-term solution to avert a debt crisis.\"", "We rate this claim True.", "U.S. Sen. Marco Rubio’s op-ed in Wall Street Journal, \"Why I won’t vote to raise the debt limit,\" March 30, 2011", "U.S. Sen. Marco Rubio, Office website page on spending, Accessed Nov. 25, 2013", "U.S. Sen. Marco Rubio, Transcript of WOKV AM 690 Jacksonville interview, Jan. 9, 2012", "U.S. Sen. Marco Rubio, \"Sen. Marco Rubio comments on debt ceiling vote,\" Aug. 2, 2011", "U.S. Sen. Marco Rubio, \"Rubio draws ‘line in the sand’ over debt limit,\" July 11, 2013", "U.S. Sen. John McCain, \"Senators announce effort to replace defense sequester with other federal savings,\" Dec. 14, 2011", "U.S. Senate, S. 365 Budget Control Act of 2011, Aug. 2, 2011", "GovTrack, \"H.R. 8 American Taxpayer Relief Act of 2012,\" Senate vote Jan. 1, 2013", "Pensacola News Journal, \"Political stunts took your blues away,\" July 12, 2013", "Tampa Bay Times, \"Rubio urges raising social security age,\" Accessed in Nexis, March 31, 2011", "Tampa Bay Times, \"Federal courts strain to keep up amid cuts,\" Accessed in Nexis, Sept. 19, 2013", "Tampa Bay Times, \"Nugent stands by ‘no’ vote,\" Jan. 4, 2013", "National Review, \"$860 billion over 10 years,\" March 9, 2011", "PolitiFact, \"Medicare and Social Security -- not defense -- are driving debt, says Marco Rubio,\" Nov. 22, 2013", "PolitiFact, \"Marco Rubio says sequester was Obama’s idea,\" Feb. 12, 2013", "PolitiFact, \"Marco Rubio tweets that GOP didn’t support social security changes,\" Jan. 4, 2013", "PolitiFact, \"Fact-checking more claims about the sequester,\" May 14, 2013", "PolitiFact, \"Marco Rubio says debt ceiling vote not tied to question over default,\" Aug. 2, 2011", "PolitiFact, \"Marco Rubio’s favorite statistic,\" July 16, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]