["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Politicians are known to be frequent targets for conspiracy rumors and scandals.", "Lately, conspiracy theory peddlers have set their sights on U.S. Rep. Adam Schiff, a Democrat who represents California’s 28th Congressional District and recently took over as chair of the House Intelligence Committee.", "A March 21 Facebook post displays a picture of Schiff with wide eyes and says: \"Adam Schiff used taxpayer money to reach sexual harassment settlement with a 19 year old male. Retweet if you are sick of this disgraceful hypocrite trashing our president.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There is no evidence that Schiff paid off anyone over sexual harassment allegations, let alone used taxpayer funds to do it.", "We found the rumor posted all over Twitter, and one December 9, 2018 tweet in particular from a QAnon conspiracy theory account, which simply claimed the information came from \"congressional sources,\" was picked up and retweeted tens of thousands of times. The rumor seems have emerged as Congress worked toward the bipartisan passage of a bill that requires members to pay their own sex misconduct settlements.", "The rumor stretched so far that it was found in a Letter to the Editor in the Washington Times on Dec. 13, 2018. That account also failed to list any sources to back up the allegation.", "A spokesperson for Schiff told PolitiFact the conspiracy theory is completely false: \"This false smear originated four months ago on a QAnon conspiracy account. It is obviously and categorically untrue.\"", "Going back a bit further, we discovered a story about a supposed \"gay lover\" of Schiff’s on the junk news website TheNetSpies from February 2018. The site is filled with questionable content, and its \"About Us\" page states its content comes in \"the form of sizzling OP-ED, hard nosed investigative journalism, and a bit of satire for laughs.\"", "The story claimed to have had an exclusive interview with former Los Angeles Times assistant managing editor Christina Bellantoni (which they misspelled as \"Kristina Bellatori\"). In a supposed Skype interview, Bellantoni allegedly told the site a man named \"Will Bottom\" claimed to be in an abusive relationship with Schiff. The NetSpies posted a picture of the abused man, but the photo is actually of Taj Patterson, a Brooklyn man who was beaten in 2013.", "Bellantoni got wind of the story months later (around the time the rumor was spreading across Twitter) and called it out as fake in a tweet.", "\"Thanks for flagging. This is some very seriously fake news,\" Bellantoni wrote. \"Clue No. 1: A website you’ve never heard of citing an LAT story that doesn’t exist.\"", "Thanks for flagging. This is some very seriously fake news. Clue No. 1: A website you’ve never heard of citing an LAT story that doesn’t exist. https://t.co/FMUsft3ilx", "Viral social media posts claim that Schiff used taxpayer money to settle a sexual harassment allegation with a \"a 19-year-old male.\"", "Despite the rapid spreading of the rumor, not a single credible news source picked up the story. The account could only be found in sporadic, unsourced social media posts and partially in a junk news website that used a fabricated interview and a phony photo.", "This conspiracy theory is full-on Pants on Fire!", "Facebook post, March 21, 2019", "Daily Dot, All the conspiracy theories about incoming House Democratic leadership, Dec. 24, 2018", "MediaMatters.org, Turning Point USA advisory council member pushes QAnon smear, Dec. 20, 2018", "Twitter, Christina Bellantoni tweet, Dec. 18, 2018", "Reuters, Congress passes bill to make members pay sexual misconduct claims, Dec. 13, 2018", "Email interview, Rep. Adam Schiff spokesperson, March 27, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]