["About this rating", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "In May 2020, Minneapolis resident George Floyd died after a police officer identified in news reports as Derek Chauvin pinned Floyd down, kneeled on his neck, and choked him. The incident, which was captured on a bystander's now-viral video, stirred anger; and citizens once again took to the streets to protest police violence and racial injustice. Chavin was fired on May 26 along with three other officers.", "As the outrage swirled, so did online rumors. Along with a video allegedly showing Chauvin onstage at a Trump campaign rally (fact-checked here), social media users shared a photograph supposedly showing Chauvin in a \"Make Whites Great Again\" hat while picking a blackberry out of a fruit bowl:", "But the man in the \"Make Whites Great Again\" hat above is not Chauvin. This photograph actually shows Jonathan Riches, a supporter of U.S. President Donald Trump who is also a former federal inmate and an online troll who has garnered a reputation for filing lawsuits.", "Riches confirmed to us that he's the person in this photograph, but claimed that the \"Make Whites Great Again\" slogan on this hat was photoshopped:", "Hat is fake. Photocopied / photoshopped for sure.. I wear MAGA hats [...] People don't like me because of my Trump political activism. In return they set up fake profiles of me, memes, fake screen shots etc. In return I re-post to my friends what these people do to me. Been doing it for years to me [...] It's my face in the photo. Someone doctored or edited [the hat] and spread it as if I am the cop. Now I'm being harassed.", "We examined the photograph and see no obvious signs of digital editing. Riches also could not produce the original, undoctored photograph.", "Furthermore, a second photograph of Riches in a \"Make Whites Great Again\" was posted to a Facebook page in support of the two men charged in the killing of a black jogger in Georgia. Riches claimed that this image was posted by a \"fake profile.\" However, Riches shared a screenshot of this post to his Facebook page (which he has since deleted) and commented that he couldn’t believe \"people can get so triggered by a red hat.\" At that time, Riches made no mention that the hat was fake.", "Lastly, screenshots show that the image of Riches in a \"Make Whites Great Again\" hat while pulling a blackberry from a bowl of fruit appears to have been originally shared to the Facebook page of Christina Caldwell, who claims to be Riches' grandmother, along with the message: \"The blacker the berry the sweeter the juice.\" That post, too, has been deleted, but Caldwell confirmed in a separate post that it was Riches in the photo. Caldwell made no mention of the hat being fake.", "In sum, the photograph supposedly showing ex-Minneapolis police officer Chauvin in a \"Make Whites Great Again\" hat actually shows Riches. While the evidence appears to show that this hat is genuine, Riches claims that the \"Make Whites Great Again\" slogan was photoshopped.", "Loanes, Ellen.   \"How a Troll Tricked People Into Believing in ‘Jews For Trump.'\"\r\n    Daily Dot.   4 March 2019.", "Michels Scott and Sarah Netter.   \"World's Most Litigious Man Suing Guinness Book of World Records?\"\r\n    ABC News.   12 May 2009.", "Jany, Libor.   \"Minneapolis police, protesters clash almost 24 hours after George Floyd's death in custody.\"\r\n  Minneapolis Star.   27 May 2020.", "Mannix, Andy.   \"What We Know About Derek Chauvin and Tou Thao, Two of The Officers Caught on Tape in the Death of George Floyd.\"\r\n  Minneapolis Star.   26 May 2020.", "Updated [27 May 2020]: Article updated with a statement from Jonathan Riches claiming that the \"Make Whites Great Again\" slogan on this hat was doctored.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]