["Former JNU student leader Umar Khalid was arrested under the Unlawful Activities (Prevention) Act or UAPA for his alleged role in Delhi riots. After 11 hours of questioning, Delhi Police’s Special Cell charged the activist with “sedition and 18 other sections of the Indian Penal Code, including murder and attempt to murder,” reported Scroll. A court in Delhi remanded him to 10 days of police custody. “There was nothing objectionable in his speeches,” said Khalid’s lawyer Trideep Pais. “Being opposed to the Citizenship Amendment Act (CAA) is not a crime.”", "A day after his arrest, Times Now trended the hashtag #UmarLobbySecretTape on the daily show ‘India Upfront’ where the channel claimed, “Chat exposes ‘radicals’ allegedly linked to Umar Khalid.” Anchor Rahul Shivshankar said that the “activist lobby” admitted in a “private chat” that Khalid is aligned with a “dangerous” organisation. The group that he refers to is the Popular Front of India (PFI) which has been accused of allegedly inciting and funding the riots. Shivshankar accused Khalid of “radicalising Muslims”. The channel then played a video of a conference call on Zoom which it claimed was a “leaked private chat” between Left-wing activists. The ticker above the video read, “Damming admission tape.”", "The video “evidence” is played right after Shivshankar’s impassioned monologue on “anti-national” activities driven by the “Left Lutyens lobby” to save Umar Khalid.", "The group call begins with Bengaluru activist Zia Nomani saying, “I would like to bring to your notice the rise of another Right-wing organisation that is working with Muslims here in Bangalore. I am sure you all must be very concerned about what is happening in Bangalore and the narrative that is being set due to the unfortunate incidents. But what we are missing is the Right-wing rise of the SDPI (Social Democratic Party of India) and the PFI…Now we might have differences and we can debate on whether these organisations should be banned or not, but yes they should definitely be prosecuted for the radicalisation of youth…Now Prashant Bhushan is a founder of Swaraj India and he was wrongly punished for contempt. But that doesn’t mean that I talk about torching the Supreme Court. SDPI says if things are not happening [in your way], take matters in your own hands through violent measures…SDPI and PFI need to be countered.” SDPI is the political outfit of the PFI.", "Activist and journalist Teesta Setalvad responds to Nomani saying, “I admire your honesty and integrity but I only want to add two points…Whenever there is such a tendency developing among Muslims, we can’t [counter it] with bitterness…I will only say this much for now that SDPI and PFI remain problematic for people like us – Communalism Combats, CJP, Sabrang India – we have taken a public stand not to share a platform with them. People who consider themselves Left, should also stand against them.”", "The rest of the conversation continues to address the dangers of the said organisations.", "“Viewers, if SDPI and PFI need to be countered then why defend someone who is allegedly linked to SDPI and PFI…Today Umar Khalid is accused of collaborating with PFI to burn Delhi, that’s what the police is saying and Swaraj India and every other activist from the Left is defending Umar Khalid. Can you believe this?” – questioned Shivshankar.", "The chat that Times Now claims was accessed by the channel after it was “leaked” by intelligence agencies is nothing but a webinar held on August 16 by civil rights activists. The Zoom call was uploaded as a Facebook Live video by Pedestrian Pictures and described as, “Reclaiming Freedom of Speech and Liberty in Times of Intensified State Aggression and Repression.”", "Reclaiming Freedom of Speech and Liberty in Times of Intensified State Aggression and Repression", "Reclaiming Freedom of Speech and Liberty in Times of Intensified State Aggression and Repression. We are live.", "Posted by Pedestrian Pictures on Sunday, 16 August 2020", "The webinar was also advertised on August 13 by Countercurrents.org and the next day by Pedestrian Pictures.", "Pedestrian pictures Weekend screening Fabricated directed by K P Sasi from 14th August 2020 Friday , 6 PM onwards- For…", "Posted by Countercurrents.org on Wednesday, 12 August 2020", "Swaraj India also responded to Times Now on Twitter that the “super-exclusive” #UmarLobbySecretTape is actually part of a “public conversation”.", "Sorry to disappoint you @TimesNow, your super exclusive #UmarLobbySecretTape is actually part of a public conversation", "➡️ NOTHNG PRIVATE: The tape you claimed was accessed by ‘Security Agencies’ was public & broadcasted Live on Facebook on 16 Aug", "▶️Link: https://t.co/R8UioE3QT6", "— Swaraj India (@_SwarajIndia) September 14, 2020", "The party further said that Khalid has never been associated with SDPI and PFI.", "NOTHING SCANDALOUS: @UmarKhalidJNU has never been associated with PFI / SDPI.", "Swaraj India’s opposition to all communal organisations of any religion is unflinching.", "— Swaraj India (@_SwarajIndia) September 14, 2020", "The multiple FIRs filed against Khalid accuse him of arranging funds from PFI, an allegation that his lawyer has vehemently denied and claimed is “fabricated” and obtained “illegally through duress”.", "Times Now, therefore, picked up a Facebook Live video and broadcast it on national television as a “secret” chat between Left-wing activists.", "[Update: Times Now took down its broadcast after this report was published. A downloaded copy of the broadcast has been embedded.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]