["The photo was published here on Facebook on January 19, 2020.", "Below is a screenshot of the misleading post:", "The post's Hindi-language caption translates to English as: “Bhakts, your mother Jasodaben has also reached at Shaheen Bagh to collect Rs. 500, but when will your father Modi ji will arrive.\"", "Bhakts refers to very committed followers of Indian Prime Minister Narendra Modi, as described in this article and Jashodaben is the estranged wife of Indian Prime Minister Narendra Modi.", "Shaheen Bagh is an area in India’s capital city where hundreds of women and students have been holding a sit-in protest since December 15, 2019 following the government’s passing of the contentious Citizenship Amendment Act. The law, which grants citizenship to non-Muslim immigrants from Afghanistan, Bangladesh, and Pakistan, has been labelled anti-Muslim by critics and sparked nationwide protests, as reported by AFP here.", "Rs 500 is 500 Indian Rupees, and a reference to comments made by the ruling Bharatiya Janata Party's head of social media Amit Malviya, who claimed in a tweet that protesters at Shaheen Bagh were being paid 500 rupees a day to participate. Protesters later filed a defamation suit against him, as reported by local news outlet Firstpost here.", "The photo was also shared here, here, here and here on Facebook, and here, here and here on Twitter, alongside an identical claim.", "The claim is false; the photo has circulated since 2016, in media reports of Jashodaben’s participation in a hunger strike to protest the government’s decision to demolitions slugs in the city of Mumbai.", "A reverse image search on Google found the photo published in this report by the English-language newspaper Deccan Chronicle dated February 13, 2016.", "Below is a screenshot of the Deccan Chronicle report:", "The photo caption reads: “Jashodaben Modi, wife of Prime Minister Narendra Modi, during the hunger strike against the demolition of slums during monsoon, at Azad Maidan.”", "Azad Maidan is a sports ground in Mumbai, India.", "Below is a screenshot comparison of the photo in the misleading post (L) and the photo in the Deccan Chronicle report (R):", "Her participation in the hunger strike in Mumbai 2016 was also reported in other local media here, here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]