["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Dairy producers in New York fear the worst over a trade dispute with Canada. (Mark Mulville/Buffalo News)", "You’re not supposed to cry over spilt milk -- unless you’re a dairy farmer in upstate New York.", "Rep. Chris Collins says a trade dispute with the Canada has forced New York state farmers to dump their milk \"into ditches\" because they can no longer sell it across the border.", "\"They’ve now taken something they call ultra-filtered milk. They effectively with a pricing move, our dairy farmers are no longer able to get that product into Canada,\" Collins said in an interview with Bloomberg. \"They are now dumping milk into the ditches. The travesty there is beyond belief to see tankers of milk being dumped because there’s no market to sell them in.\"", "The dispute began last year when the Canadian dairy industry created a new pricing class for ultra-filtered milk, a protein-heavy version of the milk you buy at the supermarket. It’s typically used to produce yogurt and certain cheeses.", "The new pricing class lowered the price of ultra-filtered milk from Canadian dairy producers, making it cheaper for companies in Canada to buy the product domestically instead of importing it from New York state. The new pricing class took effect at the beginning of April.", "Both Gov. Andrew M. Cuomo and President Donald Trump have criticized Canada for the action, saying it hurts the state’s dairy industry.", "But is Collins right that the dispute has forced farmers to dump milk into ditches?", "Dairy processors", "A spokesman for Collins’ office could not point to any farms that have dumped milk because of the trade dispute, but did say the congressman was talking about farmers in New York state.", "There are two major processing facilities in New York state that export ultra-filtered milk to Canada: Cayuga Milk Ingredients in Auburn and O-AT-KA Milk Products in Batavia.", "O-AT-KA is mostly supplied by Upstate Niagara Cooperative but also receives milk from Dairy Farmers of America. Cayuga Milk Ingredients, itself a cooperative, receives milk from 30 local dairy farms.", "The cooperatives are responsible for marketing their members’ milk to processors and elsewhere. If a member’s product has to be dumped, the loss is spread across all members of the cooperative instead of an individual farmer.", "Craig S. Alexander, vice president for dairy ingredients and regulatory affairs at O-AT-KA, said no milk from Upstate Niagara Cooperative has been dumped because of the Canada issue.", "\"We haven’t dumped any milk yet,\" Alexander said. \"However, it’s an evolving situation and the milk supply hasn’t peaked seasonally yet so it’s really week to week to see if we can make ends meet.\"", "Alexander says the dispute could lead to a loss of $20 million for the company if it’s not resolved.", "Dairy Farmers of America did not reply to our inquiry.", "The situation is similar in Auburn.", "\"We’ve been close to dumping but we’ve been able to manage it,\" said Kevin Ellis, CEO of Cayuga Milk Ingredients. \"I’m responsible for marketing the milk, and I’ve been able to effectively market it.\"", "Ellis says the trade dispute threatens $30 million of its annual sales to Canadian markets, about 25 percent of total revenue.", "The New York Farm Bureau, the Northeast Dairy Producers Association, the Northeast Dairy Foods Association, the American Dairy Association Northeast, and the state Department of Agriculture did not know of any farmers dumping milk because of the problem.", "Dumping data", "Some milk has been dumped in the Northeast.", "Neither the state nor federal Departments of Agriculture tracks how much milk is dumped by state, but federal data shows the amount of milk dumped in a specific region. In the region that includes part of upstate New York and other states in the Northeast, 44.8 million pounds of milk were dumped in the first three months of this year, about 40 percent of the total milk dumped in the U.S. during that time. That’s more than twice the amount of milk dumped in the first three months of last year, but still less than 1 percent of the milk produced in the region.", "The numbers include more than just milk that was dumped because it couldn’t be sold. It includes milk dumped in all circumstances, like milk used for animal feed.", "Dumping milk is rarely a total loss for farmers. Processors will often take the cream from milk to sell, leaving only the skim part to be dumped. When processors have no demand for any part of the milk, cooperatives will dump the extra product.", "But there are rules for how this is done. State regulations require farmers to dispose of excess milk by either adding it to their manure storage structure or by directly applying it to fields to recycle the nutrients. Any dumping that may lead to a waterway, like a ditch, would be a violation of the state Environmental Conservation Law.", "Our ruling", "Collins said farmers \"are now dumping milk into the ditches\" because of a trade dispute with Canada.", "The Canadian dairy industry's new pricing for ultra-filtered milk affects dairy processors and farmers in upstate New York, but we could not find any who have dumped their milk because of the trade dispute. It has been more difficult for dairy producers to find a market for their product for the last few years because of a persistent milk glut in the United States.", "Collins points out the dispute has made it harder for processors to bring milk to market. Indeed, farmers might begin dumping their milk soon if the trend continues. But we found no evidence, and he has not provided any, that it has happened yet. We rate his claim False.", "Rep. Chris Collins on Nafta, GOP Tax Plan and Health Bill, Bloomberg video interview, April 28, 2017", "Phone conversation with Michael Kracker of  Rep. Chris Collins’ office", "Phone conversation with Craig S. Alexander, vice president for dairy ingredients and regulatory affairs at O-AT-KA Milk Products", "Phone conversation with Kevin Ellis, CEO of Cayuga Milk Ingredients", "Phone conversation with Steve Ammerman of the New York Farm Bureau", "Phone conversation with Tonya Van Slyke of the Northeast Dairy Producers Association", "Phone conversation with Jon Greenwood, chair of the Northeast Dairy Producers Association", "Phone conversation with Bruce Krupke, executive vice president of the Northeast Dairy Foods Association", "Email conversation with Diana Dibble, spokesperson for the American Dairy Association North East", "Phone conversation with Andrew Novakovic, E. V. Baker professor of Agricultural Economics at Cornell University", "Email conversation with Michelle Person from the Public Affairs Office at the U.S. Dept. of Agriculture", "Email and phone conversation with press office staff at the New York state Dept. of Agriculture", "Email conversation with press office staff at the New York state Dept. of Environmental Conservation", "Dairy consumption per capita in the United States (annual), Accessed May 5, 2017", "Milk Production totals in New York from the U.S. Dept. of Agriculture, Accessed May 5, 2017", "Letter from Gov. Andrew M. Cuomo to Canadian Prime Minister Justin Trudeau, October 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]