["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Presumptive Republican presidential candidate Mitt Romney and his running mate, Rep. Paul Ryan, have tried to distance themselves in recent days from comments made by a Missouri congressman about pregnancies being rare in cases of \"legitimate rape.\"\n\nBut the chairman of the New Jersey Democratic Party claimed Tuesday that Ryan, a Wisconsin congressman, and Missouri Republican Todd Akin have both backed a bill limiting federal funding for abortions to victims of \"forcible rape.\"\n\n\"While Mitt Romney and Paul Ryan rushed to throw Congressman Akin under the bus following his repugnant comments, we know that in reality, Republicans share many of Akin’s most offensive views on the issue of choice,\" John Wisniewski, a state assemblyman, said in a news release.\n\n\"Ryan co-sponsored legislation with Akin to limit federal funding for abortion to victims of ‘forcible rape’ - as if there is any other kind of rape?\"\n\nWisniewski is correct that Ryan and Akin co-sponsored legislation in July 2010 and January 2011 that, as originally written, limited federal funding for abortions to pregnancies resulting from \"forcible rape\" and certain other circumstances.", "But the party chairman failed to mention that the term \"forcible\" was later removed from the bill before its passage in the House.", "In a statement, Wisniewski argued that the congressmen became co-sponsors when the legislation still contained the phrase \"forcible rape.\"", "\"While the term was removed after significant public outcry, it is telling that the phrase did not raise any red flags for either Ryan or Akin in July 2010 or January 2011 when they signed on as original co-sponsors,\" Wisniewski said.", "Let’s explain the bill’s history.\n\nThe legislation -- known as the No Taxpayer Funding for Abortion Act -- was first introduced on July 29, 2010 by New Jersey Congressman Chris Smith (R-4th Dist.). Ryan and Akin signed on as co-sponsors at the time of the bill’s introduction.\n\nThat version of the bill prohibited federal funding for abortions, except in certain cases -- including \"forcible rape.\"", "But with Democrats still in control of the House, the bill didn't move forward.", "After the GOP took control of the House, Smith re-introduced the bill on Jan. 20, 2011. Again, at the time of introduction, Ryan and Akin became co-sponsors, and the legislation still contained the phrase \"forcible rape.\"\n\nYet that term ignited an outcry among various critics, who said the phrase would exclude victims of statutory rape or rapes involving drugs.", "By early February 2011, Smith had agreed to remove the term \"forcible\" from the legislation. When the House passed the bill in a 251-175 vote on May 4, 2011, the legislation allowed federal funding for abortions in all cases of rape.\n\nThe final version of the bill said such funding was permissible if \"(1) if the pregnancy is the result of an act of rape or incest; or (2) in the case where a woman suffers from a physical disorder, physical injury, or physical illness that would, as certified by a physician, place the woman in danger of death unless an abortion is performed, including a life-endangering physical condition caused by or arising from the pregnancy itself.\"\n\nRyan and Akin voted for the bill, along with Smith and the other five GOP congressmen from New Jersey. Seven House Democrats from New Jersey voted against the bill.\n\nThe U.S. Senate never voted on the legislation.\n\nOur ruling\n\nIn a news release, Wisniewski claimed Ryan and Akin co-sponsored legislation \"to limit federal funding for abortion to victims of ‘forcible rape.’\"\n\nIt’s accurate that the two congressmen co-sponsored the No Taxpayer Funding for Abortion Act, first in July 2010 and again in January 2011. Both original versions of the bill limited federal funding for abortions to pregnancies resulting from \"forcible rape\" and certain other circumstances.\n\nThe term \"forcible\" was later removed from the bill, allowing federal funding for abortions in all cases of rape. But when Ryan and Akin originally signed on, the legislation included the phrase \"forcible rape.\"", "We rate the statement True.", "To comment on this ruling, go to NJ.com.", "New Jersey Democratic State Committee, Don’t Let Them Fool You: Akin is in the Mainstream of the GOP, Aug. 21, 2012", "THOMAS, No Taxpayer Funding for Abortion Act, accessed Aug. 21, 2012\n\nThe Washington Post, 'Forcible rape' cut from antiabortion bill after backlash from women's groups, Feb. 3, 2011\n\nThe Star-Ledger, Outcry forces House GOP to tone down abortion bill, Feb. 4, 2011\n\nABC News, GOP Senate Candidate Akin Says Pregnancy ‘Rare’ in ‘Legitimate Rape’, Aug. 19, 2012\n\nNew York Times, Rep. Todd Akin: The Statement and the Reaction, Aug. 20, 2012\n\nAssociated Press, Missouri Rep. Todd Akin Pledges to Go Forward With U.S. Senate Bid, Aug. 21, 2012", "National Public Radio, Akin Apologizes For Rape Comments; Will Stay In Race, Aug. 20, 2012", "E-mail interview with Alicia D'Alessandro, communications director for the New Jersey Democratic State Committee, Aug. 21-22, 2012", "New York Times, Akin Controversy Stirs Up Abortion Issue in Campaign, Aug. 21, 2012\n\nThe Boston Globe, Scott Brown calls on Akin to drop out of Missouri Senate race, Aug. 20, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]