["Opponents of Florida’s medical marijuana amendment have fired up a new round of attacks, claiming there will be a dispensary on practically every corner if voters approve the initiative.", "In a three-minute ad released May 16, 2016, the group Vote No On 2 calls Amendment 2 \"a scam to legalize pot.\" Should the measure pass, they say, it’s likely that places to buy medical marijuana will outnumber two well-known retail outlets.", "\"Looks like Amendment 2 will put almost 2,000 pot shops in Florida ... more pot shops than Walmart and Walgreens combined,\" the video says. It goes on to deride California medical marijuana regulations and users, and implies Florida would become like the Golden State if the measure passes.", "While polls say medical marijuana is enjoying about 80 percent support among voters, Vote No On 2’s figures spark an interesting point. Would the number of medical marijuana dispensaries outnumber Walmarts and Walgreens locations in Florida?", "That's possible, according to one state estimate, but the figures are a little hazy.", "Dispensary data", "Amendment 2 was first on the ballot in 2014 but narrowly lost the 60 percent required to pass.", "The current version for the November 2016 ballot has the same name, but United for Care, the group behind the measure, altered the language to address some concerns that hounded the 2014 amendment. The amendment now requires parental consent and doctor certification for minors and more clearly defines the medical conditions it covers: cancer, HIV/AIDS, epilepsy, glaucoma, post-traumatic stress disorder, Crohn’s disease, Parkinson’s disease, multiple sclerosis \"or other debilitating medical conditions of the same kind or class as or comparable to those enumerated,\" with a doctor’s recommendation.", "It works like this: If a patient with one of these conditions gets the okay from a doctor, they (or a certified caregiver) will get a state-issued ID card and be able to go to a state-regulated dispensary to buy their marijuana.", "Doctors technically can’t prescribe marijuana because it is still a Schedule I drug under federal law, meaning it’s considered highly addictive and has no known medical benefits, and is therefore illegal. Doctors would risk losing their ability to practice medicine. Pharmacies also can’t legally distribute cannabis, making dispensaries necessary.", "So how many dispensaries would there be? The proposed amendment leaves the details of medical marijuana regulations up to the Legislature and the Florida Health Department. Legislators would need to pass a bill for medical marijuana and the health department would develop and enforce regulations. In essence, there could be as few or as many dispensaries as the state wants.", "There’s only one estimate for how many patients and dispensaries there would be — a 2015 health department analysis.", "That report used Florida Department of Economic and Demographic Research data to estimate 440,552 patients in Florida would qualify for medical cannabis. The amendment would lead to 1,993 registered treatment centers, the health department said. That’s the figure Vote No On 2 is using in its ad.", "United for Care doesn’t dispute the figures, because the health department’s analysis is the only study that’s been done.", "\"It’s the best educated guess that we have,\" United for Care director Ben Pollara said. \"It’s up to the Department of Health and the Legislature. … It could be 2,000, it could be 20. It could be 5,000.\"", "In any event, 1,993 dispensaries would outnumber all the Walmarts and Walgreens in Florida. Vote No On 2 spokeswoman Christina Johnson said the group chose those businesses to illustrate how ubiquitous dispensaries would be should the amendment pass.", "The video correctly shows 840 Walgreens drug stores in the state, but includes 191 Walmarts, a figure apparently derived from a January 2007 list from Reclaim Democracy, a group seeking limits on corporate influence in government. A more recent list from Walmart shows 223 supercenters and 10 discount stores. (Neighborhood Markets and Sam’s Club stores are not included in either count.)", "While Walmart and Walgreens do have pharmacies, we’re not convinced pitting small medical cannabis dispensaries against big chain retailers is a fair comparison. It may be better to compare so-called \"pot shops\" to the overall number of pharmacies.", "The state health department told us there are 9,725 licensed pharmacies in Florida.", "To provide more context for the dispensary estimate, we will note that the state Department of Business and Professional Regulation says Florida has 2,082 active licensed veterinary clinics — and 1,893 package liquor stores.", "Mile-high estimate", "With so little spelled out in the proposed amendment, we wondered how the health department arrived at its estimate of 1,993 dispensaries.", "The health department told us they used Colorado, with about 5.3 million people, for the analysis because the state has allowed medical cannabis for years and has a broad baseline of data. The report says there are 515 licensed medical marijuana centers as of October 2015 (there are 528 now, according to the Colorado Department of Revenue) serving almost 114,000 patients. Analysts then scaled that up to Florida’s population of 20 million.", "Karen O’Keefe, director of state policies and the pro-legislation Marijuana Policy Project, said of the 24 states and the District of Columbia allowing medical marijuana, it’s misleading to use either Colorado or California as examples for Florida. Not only did Colorado decriminalize recreational marijuana use in 2012 — its 421 retail shops are counted separately from medical dispensaries — but both states lacked the kind of initial regulatory oversight Amendment 2 would require.", "\"California dispensaries still have no state licensing or regulation to speak of, though a regulatory and licensing law should be phased in by 2018,\" O’Keefe said in an email. \"In Colorado, regulations went into effect in 2010-11, but hundreds of dispensaries pre-dated them.\"", "A better state to look to would be New Mexico, O’Keefe said, because it required a licensing program in its law when it passed. New Mexico had 23 dispensaries for its 2 million residents, and expanded that to 35 in 2015.", "Extrapolating Florida’s total based on New Mexico’s regulations would net far fewer dispensaries, O’Keefe said. If it were based on total land area, Florida could limit the number to about 16. If there were the same number of dispensaries per capita as New Mexico, there could be about 340.", "\"I really can’t say how many are likely, since it will depend on many factors, with the primary one being regulations. But I would bet it’s far less than 2,000,\" O’Keefe said.", "Our ruling", "Vote No On 2 said, \"Amendment 2 will put almost 2,000 pot shops in Florida ... more pot shops than Walmart and Walgreens combined.\"", "The state health department did project 1,993 medical marijuana dispensaries would be needed to serve potential patients, based on data from Colorado compared with Florida. That is more than the 840 Walgreens and 233 Walmart supercenters and discount stores in the state, although the comparison seems like a bit of a red herring.", "It’s important to remember that while the health department report is the only real estimate available, this figure isn’t definite. The agency and the Legislature would decide the actual number of stores and how they are regulated after the amendment passes. That total is anyone’s guess.", "The statement is partially accurate but leaves out important details. We rate it Half True.", "Vote No On 2, \"Search,\" May 16, 2016", "PolitiFact Florida, \"Medical marijuana easy to get under proposed Florida law, sheriff says,\" Nov. 25, 2013", "PolitiFact Florida, \"Pam Bondi says amendment would make Florida one of the most lenient medical marijuana states,\" Dec. 17, 2013", "PolitiFact Florida, \"Medical marijuana ballot initiative requires doctors' input but not a prescription for 'debilitating' conditions,\" Feb. 21, 2014", "Tampa Bay Times, \"Gov. Rick Scott signs 'Charlotte's Web' medical marijuana bill,\" June 16, 2014", "PolitiFact Florida, \"Medical marijuana amendment allows patient to 'get it forever,' doctor says,\" Aug. 28, 2014", "Orlando Sentinel, \"Here's where Rick Scott, Charlie Crist stand on issues,\" Oct. 18, 2014", "Tampa Bay Times, \"Florida voters just say no to medical marijuana,\" Nov. 4, 2014", "PolitiFact Florida, \"Medical marijuana amendment was more popular than winning governors, group says,\" Nov. 13, 2014", "Quinnipiac University, \"Florida, Ohio, Pennsylvania voters back marijuana, Quinnipiac University swing state poll finds,\" April 6, 2015", "Florida Department of Health, \"‘Use of Marijuana for Debilitating Medical Conditions’ Constitutional Amendment Analysis,\" Oct. 19, 2015", "Associated Press, \"Attorney General Pam Bondi won't fight medical marijuana amendment,\" Nov. 9, 2015", "Tampa Bay Times, \"Florida legislative committee revives bill to legalize all marijuana strains for terminally ill,\" Feb. 8, 2016", "Florida Today, \"Medical marijuana back as more careful Amendment 2,\" March 26, 2016", "South Florida Sun Sentinel, \"Anti-medical marijuana group releases first ad of 2016,\" May 16, 2016", "Walgreens, \"Store Count by State,\" accessed May 16, 2016", "Walmart, \"Our Locations,\" accessed May 16, 2016", "Reclaim Democracy, \"Walmart Stores by State,\" accessed May 16, 2016", "United for Care, \"Ballot Language,\" accessed May 17, 2016", "Colorado Department of Revenue, \"MED Licensed Facilities,\" accessed May 18, 2016", "U.S. Drug Enforcement Agency, \"Drug Schedules,\" accessed May 18, 2016", "Interview with Christina Johnson, Vote No On 2 spokeswoman, May 16-18, 2016", "Interview with Karen O’Keefe, Marijuana Policy Project director of state policies, May 17-19, 2016", "Interview with Mara Gambineri, Florida Department of Health spokeswoman, May 17-19, 2016", "Interview with Ben Pollara, United For Care director, May 19, 2016", "Interview with Travis Keels, Florida Department of Business and Professional Regulation spokesman, May 19, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]