["By Eugene Kiely", "Posted on January 15, 2020", "Since announcing on Jan. 2 that a U.S. operation had killed Iranian Gen. Qassem Soleimani, the Trump administration has offered various accounts of the intelligence assessments that President Donald Trump relied on to make his decision.", "Initially, Trump administration officials said Soleimani was planning an “imminent attack” against U.S. service members and diplomats without providing any evidence or offering any details. “We don’t know precisely when and we don’t know precisely where — but it was real,” Secretary of State Mike Pompeo said in a Jan. 9 interview.", "Over the course of two days, Jan. 9 and Jan. 10, the president escalated the imminent threats posed by Soleimani with new details — but no evidence — that even members of Congress were not given in their classified briefings.", "On Jan. 9, Trump told reporters Soleimani was threatening to “blow up” the U.S. embassy in Baghdad, and later told his supporters at a political rally that Soleimani “was looking very seriously at our embassies and not just the embassy in Baghdad.” A day later, Trump told Fox News, “I can reveal that I believe it would have been four embassies.”", "But, in the Fox News interview, Trump hedged his revelations with the words “I believe” and “I think.” He went on in that interview to say, “I think it would have been four embassy, could have been military bases, could have been a lot of other things too.”", "Two days later, Defense Secretary Mark Esper said he “didn’t see” any intelligence that indicated the Iranians would attack four embassies. He also said the president was merely expressing his belief that there “could have been attacks against additional embassies.”", "Trump responded on Twitter by saying it “doesn’t really matter” if a “future attack by terrorist Soleimani was ‘imminent’ or not” because of Soleimani’s “horrible past,” which the U.S. has said includes “the deaths of hundreds of American and coalition service members” during the Iraq war.", "Here we provide a timeline of what Trump administration officials said about the reasons for killing Soleimani.", "Jan. 2 — A U.S. drone strike at Baghdad’s airport kills Iranian Gen. Qassem Soleimani and Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. The attack also kills five others.", "In a statement, the Defense Department says Soleimani “was actively developing plans to attack American diplomats and service members in Iraq and throughout the region.” There was no mention of an “imminent attack.”", "Jan. 3 — In an address to the nation, Trump says, “Soleimani was plotting imminent and sinister attacks on American diplomats and military personnel, but we caught him in the act and terminated him.”", "In a background briefing for the media, an unnamed senior State Department official says the airstrike that killed Soleimani “was a defensive strike that was taken and supported by very solid intelligence, and I’ve seen all the intelligence. This was strongly supported by everything that we were seeing that Soleimani was planning imminent attacks against American diplomats and our armed forces members in Iraq, Lebanon, Syria, and in the region.”", "In an on-the-record media call, National Security Adviser Robert O’Brien tells reporters that the airstrikes against Soleimani were authorized under the 2002 Authority for Use of Military Force Against Iraq, or AUMF.", "“The President exercised America’s clear and inherent right of self-defense to counter this threat,” O’Brien says. “It was a fully authorized action under the 2002 AUMF and was consistent with his constitutional authority as Commander-in-Chief to defend our nation and our forces against attacks like those that Soleimani has directed in the past and was plotting now.”", "CNN host John Berman asks Secretary of State Mike Pompeo about the nature of the “imminent threats.” He declines to discuss details — except to say it was based on U.S. intelligence.", "“John, I can’t talk too much about the nature of the threats, but the American people should know that President Trump’s decision to remove Qasem Soleimani from the battlefield saved American lives. There’s no doubt about that,” Pompeo says. “He was actively plotting in the region to take actions, a big action, as he described it, that would have put dozens if not hundreds of American lives at risk. We know it was imminent. This was an intelligence-based assessment that drove our decision-making process.”", "Jan. 5 — On ABC News’ “This Week,” Pompeo denies a report in the New York Times that some administration officials “voiced private skepticism about the rationale for a strike” on Soleimani.", "“George, the senior leaders who had access to all of the intelligence, there was no skepticism,” Pompeo tells host George Stephanopoulos. “I think General Milley used the term, we would have been culpably negligent had we not taken this strike. The intelligence assessment made clear that no action, allowing Soleimani to continue his plotting, his planning, his terror campaign created more risks than taking the action that we took last week. We reduced risks.”", "Jan. 6 — In a joint press conference with Defense Secretary Mark Esper, Army Gen. Mark A. Milley, the chairman of the Joint Chiefs of Staff, says of Soleimani: “We know his history. Importantly we knew his future. I’m not going to go into the details of that, and I know that a lot of people are out there – I’ve seen words like, oh, the intel was razor thin. Very, very few people saw that intelligence. He and I saw that intelligence. And I will be happy, when the appropriate time comes in front of the proper committees and anybody else, through history and every – I’ll stand by the intelligence I saw, that – that was compelling, it was imminent, and it was very, very clear in scale, scope.”", "Jan. 7 — Esper tells reporters in a press briefing that he will share classified information today with the Gang of Eight about the decision to kill Soleimani. The Gang of Eight are the congressional leaders (House Speaker Nancy Pelosi and Minority Leader Kevin McCarthy, and Senate Majority Leader Mitch McConnell and Minority Leader Chuck Schumer) and chairmen and ranking minority party members of the House and Senate intelligence committees (Reps. Adam Schiff and Devin Nunes, and Sens. Richard Burr and Mark Warner).", "“[T]he exquisite intelligence that we’re talking about that led to the decision to — that was, I should say, one of the factors that led to the decision to strike at Soleimani is — is — is only shared with a handful of members, the so-called Gang of Eight.  And so they are getting that briefing this afternoon, and — and — and they will have access to that, but most [congressional] members will not have access to that,” Esper says.", "Jan. 8 — The Trump administration holds additional less detailed briefings for other members of Congress.", "After the briefings, Esper tells reporters, “I got back from the Hill where the national security team and I have briefed members of Congress in both the House and Senate.  Both briefings went long, longer than expected, but that was a very good discussion.  We covered a number of issues in both the House and Senate, everything ranging from authorities and imminence, all the way through force posture, next steps, et cetera.” He acknowledges that some members of Congress — which includes GOP Sen. Mike Lee — may have been dissatisfied with the briefing, but “most members of Congress do not have access to the intelligence that I think was the most compelling.  That’s just simply the nature of the intelligence, and it’s restricted to the Gang of Eight, if you will.”", "In a letter to the United Nations, U.S. Ambassador to the U.N. Kelly Craft says the U.S. decision to kill Soleimani was an act of self-defense “in accordance with Article 51 of Charter of the United Nations.” She writes that in recent months “the United States has been the target of a series of escalating threats and armed attacks by the Islamic Republic of Iran,” including the Dec. 27, 2019, death of a U.S. government contractor.", "Jan. 9 — In an interview on Fox News, Pompeo says (at 3:06 into the interview): “There is no doubt that there were a series of imminent attacks that were being plotted by Qassem Soleimani. We don’t know precisely when — and we don’t know precisely where — but it was real.”", "At an unrelated White House event, Trump says, “We did it because they were looking to blow up our embassy [in Baghdad]. We also did it for other reasons that were very obvious. Somebody died — one of our military people died. People were badly wounded just a week before. And we did it. And we had a shot at him, and I took it, and that shot was pinpoint accurate.” Asked to provide details on the plot to blow up the U.S. embassy in Baghdad, Trump says, “No, I think it was obvious.”", "At a political rally in Ohio, Trump says, “Soleimani was actively planning new attacks and he was looking very seriously at our embassies and not just the embassy in Baghdad.”", "Jan. 10 — At a White House press briefing, a reporter asks Pompeo about Trump’s remarks that Iran was planning an attack against the U.S. embassy in Baghdad and other embassies. “We had specific information on an imminent threat, and those threats included attacks on U.S. embassies. Period. Full stop,” Pompeo says.", "Asked how an Iranian attack could be “imminent” if, as he had said, the U.S. did not know “precisely when” or “precisely where” the attack would take place, Pompeo says: “Those are completely consistent thoughts. I don’t know exactly which minute. We don’t know exactly which day it would’ve been executed. But it was very clear: Qasem Soleimani himself was plotting a broad, large-scale attack against American interests.  And those attacks were imminent.”", "In an interview on Fox News, Trump says he believes four U.S. embassies were at risk of attack. This is the first time that any administration official has mentioned four possible targets, although he did not name which ones or when the attacks would happen.", "“I can reveal that I believe it would have been four embassies. And I think that probably Baghdad already started. … Baghdad certainly would have been the lead. But I think it would have been four embassy, could have been military bases, could have been a lot of other things too. But it was imminent and then all of a sudden, he was gone,” Trump says.", "Jan. 12 – In an appearance on CBS’ “Face the Nation,” Schiff, a member of the Gang of Eight, says: “There was no discussion in the Gang of Eight briefings that these are the four embassies that are being targeted.” He also says he could not recall if the briefing included “a specific discussion about bombing the U.S. embassy in Baghdad.”", "Host Margaret Brennan also asks Esper about Trump’s statement that the Iranians planned to attack four U.S. embassies, and why the Gang of Eight wasn’t given that information in a classified briefing.", "Esper says he “didn’t see” any intelligence that indicated the Iranians would attack four embassies. He also suggests that the president may have been merely expressing his belief that there “could have been attacks against additional embassies.” Here is the Esper’s exchange with Brennan:", "Esper: Well, what the President said was he believed that it probably and could have been attacks against additional embassies. I shared that view. I know other members of National Security Team shared that view. That’s why I deployed thousands of American paratroopers to the Middle East to reinforce our embassy in Baghdad and other sites throughout the region.", "Brennan: Probably, and could have been.", "Esper: Mm-Hm.", "Brennan: That is– that sounds more like an assessment than a specific, tangible threat with a– a decisive piece of intelligence.", "Esper: Well, the President didn’t say there was a tangible– he didn’t cite a specific piece of evidence. What he says probably– he believed, could have been–", "Brennan: Are you saying there wasn’t one?", "Esper: I didn’t see one with regard to four embassies. What I’m saying is I share the President’s view that probably– my expectation was they were going to go after our embassies. The embassies are the most prominent display of American presence in a country.", "Jan. 13 — Trump tweets, “The Fake News Media and their Democrat Partners are working hard to determine whether or not the future attack by terrorist Soleimani was “imminent” or not, & was my team in agreement. The answer to both is a strong YES., but it doesn’t really matter because of his horrible past!”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]