["Republican gubernatorial candidate Eric Greitens said the Missouri tax code is too complicated.", "In a Thursday GOP primary debate in Columbia, Greitens offered figures to back his claim: \"We have 10 different tax brackets, and if you’re making $9,000, you’re already in the top tax bracket.\"", "That sounded a little low for the top bracket, so we asked Greitens’ campaign for evidence.", "His staff referred us to the Missouri Department of Revenue’s 2015 Tax Chart", "Missouri Department of Revenue's 2015 Tax Chart", "The chart actually shows 11 different tax brackets, but that aside, at first glance, it seems to back up Greitens’ claim. The top bracket is $9,000 and higher.", "However, there’s a catch. Greitens said people making $9,000 or more would fall in the top bracket. In fact, this chart applies not to how much a person earns but to that individual’s taxable earnings — after any deductions.", "Taxable income vs. gross income", "Taxable income is gross income less all personal exemptions and deductions.", "The Department of Revenue allows the following standard deductions for Missouri taxpayers.", "Standard deductions for Missouri taxpayers", "The chart shows a single filer can claim a standard deduction of $6,300. Therefore, if that person makes $9,000, as Greitens’ said, then he or she would only have a taxable income of $2,700 — even with no other exemptions. When we refer back to the department’s tax bracket chart, we can see such an individual would fit into the state’s fourth tax bracket instead of the highest tax bracket.", "All things being equal, a single filer would need to make at least $15,300 before he or she would face the highest tax rate.", "Married people filing jointly, heads of household and surviving spouses could make more than $15,300 and still not be in the top bracket.", "Our ruling", "Greitens said, \"We have 10 different tax brackets, and if you’re making $9,000, you’re already in the top tax bracket.\"", "The plain meaning of \"making $9,000\" is that’s how much a person earns. However, the Missouri tax brackets aren’t based on gross income but on income after deductions and exemptions. Those reduce a person’s taxable income, which is the basis of the chart Greitens had in mind.", "A person making $9,000 would fall in the fourth tax bracket, closer to the bottom, and certainly not at the top.", "Most people would understand Greitens to be talking about gross income, and in this case, his statement falls far short of the mark. We rate this claim False.", "Gubernatorial candidates spar about campaign contributions, UM System funding cuts", "FACT CHECK: Rep. Kip Kendrick half right on voter ID statement", "FACT CHECK: Sen. Blunt overstates White House policy's impact on coal jobs", "FACT CHECK: Rowden mostly right about Missouri residents supporting voter ID", "FACT CHECK: McCaskill gets numbers wrong on correlation between prescription drug and heroin abuse", "FACT CHECK: Koster doesn't exaggerate income threshold to qualify for Medicaid", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]