["About this rating", "Spanish-speaking readers might have been led to believe in May 2017 that President Donald Trump offered asylum to white supremacist Russian man living in Cancún who angered locals so much that a mob beat him into a coma.", "On 22 May, the Mexican news web site SDPNoticias published an article in their satire section, Pitorreo -- which translates roughly to \"in jest\" -- saying that Trump had announced at a press conference both that construction had begun on his promised \"border wall\" and that he would grant asylum to 42-year-old Aleksei Makeev, a man living in Cancún whom locals had dubbed \"Lord Nazi Ruso\" or \"Lord Nazi Russian.\"", "According to the story:", "Donald reiterated that he thinks the majority of Latinos \"are criminals,\" saying that you only needed to analyze the recent case of Aleksey [sic] Makeev, the Russian living in Cancún, who was lynched by a group of Mexicans.", "Trump mentioned that \"we don't live in the Medieval era\" when people would try to kill a person just because they committed a bad deed, saying that he thought it \"terrible\" that Mexicans acted in such an instinctive matter without thinking about the consequences.", "No such press conference occurred and construction has not begun on the border wall; the story is satire.", "Makeev, who was born near Moscow, reportedly made a habit of publishing videos online insulting local women and children, including one in which he can be seen making an offensive gesture at a woman behind her back as she holds her infant child. He recorded other videos with a picture of a Nazi swastika in the background, and some with a swastika drawn on the side of his head.", "Despite an order from the Mexican National Migration Institute that he leave on 19 January 2017, Makeev continued to live in Cancún, where he worked as a scuba diving instructor. Four months to the day he was supposed to leave, a mob attacked him at his apartment in Cancún and beat him into a coma, for which he was hospitalized.", "During the incident, Makeev reportedly stabbed an unidentified 19-year-old man, who died at the scene. On 23 May 2017, Quintana Roo State Attorney Miguel Ángel Pech Cen revealed that a warrant had been issued for Makeev's arrest in connection with the younger man's death. At the time of the warrant, Makeev -- who had regained consciousness -- was listed in stable condition at a local hospital.", "Pech Cen also said that he is investigating not only the people responsible for the attack, but why local police did not do more to protect Makeev leading up to it. His announcement came two days after immigration officials said they would seek help from Russian authorities in deporting Makeev.", "It is unclear when Makeev moved to Mexico. But in 2013 he was ordered to seek psychiatric treatment in Russia after the country's Ministry of Internal Affairs discovered online footage he posted of himself shoving a child and an elderly woman.", "\"Así Terminó el Ruso Que Insultó a Mexicanos Durante Meses.\" YouTube. Uploaded by El Dominical de Panamericana. 21 May 2017. https://www.youtube.com/watch?v=BqZ65WbDKbg", "\"Ucraniano vive en Cancún agrediendo y amenazando de muerte a mexicanos desde hace años.\" YouTube. Uploaded by CentralCancun. 19 May 2017. https://www.youtube.com/watch?v=LdtkeN8sGsE", "Notimex. \"Giran Orden de Aprehensión Contra 'Lord Nazi.'\" Accessed via elhorizonte.com.mx. 23 May 2017.", "Noel, Andrea. \"Mexican Mob Nearly Lynches Russian ‘Nazi’ in Cancun.\" The Daily Beast. 21 May 2017.", "Notimex. \"México Solicitará Apoyo de Rusia Para Deportar a Agresor.\" Accessed via elporvenir.mx. 21 May 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]