["About this rating", "On 16 February 2017, an audio recording purportedly featuring Senator John McCain of Arizona speaking with a Russian prankster posing as Volodymyr Groysman, the Prime Minister of Ukraine, was published to YouTube:", "The Russian-language transcript of the video identified one of the pranksters as providing the voice of Groysman, while the voice of John McCain was supposedly a genuine recording of the senator himself, but many viewers expressed skepticism about that latter point.", "The video was created by Vladimir Krasnov and Alexei Stolyarov, better known as Lexus and Vovan. The comedy duo are well-known in Russia for their prank phone calls, and they have previously impersonated a number of high-profile politicians and celebrities. In September 2015, for instance, they made headlines in the United States after they called musician Elton John while pretending to be Russian President Vladimir Putin.", "But if Lexus and Vovan can impersonate one side of the conversation, it is reasonable to assume that they can impersonate the other side, too.", "Here's a clip of McCain speaking on 15 February 2017 for comparison purposes. Some viewers maintain that the real John McCain's voice seems to have a higher tenor than the voice in the prank call video:", "In addition to the apparent differences between the real John McCain's voice and the one on the prank audio, this viral clip also featured a Ukrainian prime minister apparently conversing easily in a language that is foreign to him. But according to a report from Deutsche Welle, Groysman is not fluent in English. Moreover, Senator McCain is likely aware of this fact —  and thus unlikely to be fooled by a fluent English-speaking prankster posing as the Ukrainian Prime Minister — as he previously met with Groysman in June 2016.", "We've reached out to Senator McCain for comment about the alleged phone call but have not yet heard back.", "Lexus and Vovan created a similar video allegedly featuring Rep. Maxine Waters of California speaking to a prankster pretending to be Volodymyr Groysman on 13 February 2017:", "Again, many viewers expressed doubts that this conversation truly featured the voice of Congresswoman Waters (who at one point in the conversation curiously referred to Senator Lindsey Graham as \"Senator Lindsey\"). Here's a clip of Waters speaking for comparison purposes:", "Again, the voices sound noticeably different, but it's difficult to determine how much of that difference might be due to variations in the circumstances, acoustic environment, and recording media involved in capturing the conversation.", "Deutsche Welle.   \"The Rapid Rise of Ukraine's Volodymyr Groysman.\"\r\n    4 December 2016.", "Interfax.   \"Groysman Meets with U.S. Senator McCain.\"\r\n    17 June 2016.", "Plucinska, Joanna.   \"Russian Pranksters Say They're the Ones Behind That Fake Putin Call to Elton John.\"\r\n    Time.   17 September 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]