["About this rating", "In June 2017, an image of a Mad magazine cartoon featuring Donald Trump was circulated on social media along with the claim that it appeared in a 1992 issue of the humor magazine:", "<!--", "My son found this in a Mad Magazine from 1992 that we had kicking around. @MADmagazine pic.twitter.com/C4O4f3PxXZ", "— Allison F.⭐️ (@ablington) June 17, 2017", "-->", "This is a real comic that was published by Mad magazine in 1992.", "Some were skeptical that Mad had really lampooned Donald Trump as far back as the 1990s, but it's not really all that surprising. Although Trump wasn't elected president until 2016, he had already been a public figure for most of his life. In fact, shortly after he became president,Mad released a book of previously published comics \"chronicling his rise from obnoxious businessman to really obnoxious reality show host to uber obnoxious 'Commander-in-Tweet.'” Cartoonist Garry Trudeau put out a similar book chronicling 30 years of Trump's appearances in his \"Doonesbury\" comic strip as well.", "Sam Viviano and Mike Snider created the 1992 Trump cartoon for Mad, which was published on page 26 of issue 315. The Trump cartoon only made up a small portion of the \"When Should We Believe...?\" page, which featured various politicians, musicians, reporters, and other public figures giving contradictory statements.", "Here is how the comic was introduced in 1992:", "Sometimes people lie. Sometimes people tell the truth. But sometimes, people lie and tell the truth on the same subject at different times! (Like, for example, BEFORE and AFTER an election!) So, the question we out to be asking about these people is not the usual \"Why should we believe,\" but rather.... WHEN SHOULD WE BELIEVE...?", "The Trump cartoon appeared in the bottom-left corner of the full version of the comic:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]