["Crystal Quade won an easy re-election campaign to serve two more years representing Missouri House District 132. Two days after the election, she was selected by her peers to serve as minority floor leader.", "Quade spoke with reporters after the selection. She said she \"read an article that we had the largest amount of millennial Democrats running than any other state in the country.\"", "At 33, Quade is a millennial herself.", "Because she has taken over an important leadership role in the Missouri House, we decided to check out her claim to see if Missouri really did have more millennial Democrats run for state legislature positions than any other state.", "When we reached out to Quade, she pointed us to a Facebook post and an article from the progressive PAC Run for Something, whose mission is to support millennial Democrats running for state legislature.", "The article links to a study conducted by Run for Something and the Democratic Legislative Campaign Committee, which looks into the number of millennials running for state offices across the United States.", "The committee’s communications director, Mara Sloan, said millennials were defined as candidates 18-34 years old and based on candidate filing information.", "The start and end points of generations aren’t exact and rather are determined by researchers as tools for analysis.", "The Pew Research Center currently defines millennials as those aged 22 to 37 this year. But it acknowledges that many others \"have offered well-reasoned arguments for drawing that line a few years earlier or later than where we have.\"", "So it looks like the legislative campaign committee’s numbers are in the same ballpark.", "The study presents a state-by-state breakdown of numbers of millennial Democrats who ran for state legislatures in 46 states, excluding Louisiana, Mississippi, New Jersey and Virginia, which don’t hold state legislature elections in general election years.", "According to the data, Missouri had 31 millennial Democrats run for state office, of which 12 would go on to win their elections.", "Missouri barely edged out Pennsylvania, which had 30, while Nevada and Wyoming had the least, with two millennial Democrats running for office in each state.", "We could not find any similar data on number of Republican millennials running for state legislature, either in Missouri or nationwide.", "Morley Winograd, a millennial politics expert and senior fellow at the University of Southern California, said the reason that there was such large variance in the number of Democrat millennials running in some states over others was likely caused \"by the issues being debated in those state legislatures and the organizing motivation it provided for recruiting candidates of this type in those states.\"", "Liberal-leaning issues on the Missouri ballot in November, such as medical marijuana and the minimum wage raise, likely contributed to this.", "Quade said that she \"read an article that we had the largest amount of millennial Democrats running than any other state in the country.\"", "Quade referenced an October study from the Democratic Legislative Campaign Committee and the group Run For Something. While the study excluded four states, it found that Missouri had the most millennial Democrats run for office, and we didn’t find any data or expert opinion to the contrary of their numbers.", "For these reasons, we rate her statement True.", "St. Louis Public Radio Website, \"Two St. Louis lawmakers elected to legislative leadership posts,\"Nov. 8", "Run for Something Website, \"Hot off the press: DLCC and RFS report on Millennials running for state leg,\" Oct. 17", "DLCC Website, \"Empowering Democratic Millennial Candidates in 2018,\" Oct. 17", "2018 State Legislature Democrats Millennial Candidates Data, DLCC", "Ballotpedia, \"Crystal Quade\"", "Run for Something Facebook Post, Oct. 17", "Email exchange with Missouri State Rep. Crystal Quade, Nov. 15", "Email exchange with Mara Sloan, DLCC Communication Director, Nov. 16", "Email exchange with Bridget Johnson, Pew Research Center communications manager, Nov. 23", "Email exchange with Mike Morley, Millennial Politics Expert", "Pew Research Center Website, \"Defining generations: Where Millennials end and post-Millennials begin,\" March 1", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]