["About this rating", "A meme purportedly showing a quote from Bernie Sanders was frequently shared on social media in 2016:", "\"The heritage of Castro will be felt for generations to come, he is an example for his people, for America and for the world. One day, in the future, American will embrace socialism, but we are still far from that day.\"", "While the above-displayed quote is often shared with the claim that it was spoken by Sanders during a 1985 radio interview, the text has also been attached to a television interview from the same year:", "While the video is real, and while Sanders does offer some praise to Fidel Castro in the footage, the quote is fake. Nowhere in this video does Sanders say that the \"heritage of Castro will be felt for generations to come.\"  We were also unable to unearth any radio interview clips or contemporary news reports attributing this quote to Sanders. In fact, the earliest mention of this alleged Bernie Sanders quote was published in the notorious fake news web site World News Daily Report on 29 October 2015:", "Although Bernie Sanders and Fidel Castro have never met, Bernie Sanders has also praised the Cuban regime at various times in his career.", "In a 1985 public access radio interview while he was mayor of Burlington, Vermont, Sanders praised the Cuban leader’s regime, saying “He educated their kids, gave their kids health care and totally transformed society”.", "“The heritage of Castro will be felt for generations to come, he is an example for his people, for America and for the world” he admitted. “One day, in the future, Americans will embrace Socialism, but we are still far from that day” he explained during the radio interview.", "Other World News Daily Report hoaxes have included claims that a Smithsonian employee was caught \"raping\" a mummy, an infant in the Philippines was born with stigmata, a lottery winner died after gold-plating his genitals, a man's genitals were chewed off during the attempted sexual assault of a pit bull, a meth-using babysitter ate a toddler, an overweight man sued Golden Corral after he was kicked out for staying too long, and a Nazi sub surfaced in the Great Lakes.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]