["About this rating", "A March 2014 article reported that due to changes in Connecticut gun laws effective 1 January 2014, some residents received letters about subsequently banned items they were required by law to sell or destroy.", "Connecticut gun owners received \"gun confiscation letters\" in January 2016; the letters pertained to legally-owned weapons; the letters were unexpected or unrelated to changes in law; the letters were part of federal gun control legislation.", "In January 2015, social media users began sharing an article published by Truth and Action, titled \"CONNECTICUT GUN CONFISCATION LETTERS NOW CONFIRMED BY FOX.\" It held:", "Fox News has finally reported that Connecticut has sent out gun confiscation letters.", "The letters tell gun owners of now-illegal assault weapons and large capacity ammunition magazines to relinquish the arms to the police or make them permanently inoperable.", "Hundreds of thousands of residents have yet to comply with the new law, which they were required to do by Jan. 1st of this year – turning them all into felons overnight.", "Concurrent social media interest in a July 2015 rumor about gun confiscation lent the impression to many readers that January 2016 ushered in a new wave of secretive gun grab measures. But the Truth and Action article dated back to March 2014, and was nearly two years old at the time of its recirculation. Between March 2014 and January 2016, no major gun confiscation occurred in Connecticut.", "The article cited Fox News as its source, but deeply misrepresented the material from which its claims were derived. The 15 March 2015 article, attributed to the Associated Press and syndicated by Fox News, was titled: \"Conn. officials tell gun owners to relinquish or destroy banned assault weapons.\"", "In its original context the article reported that under a then-new law, Connecticut officials were \"urging owners of now-illegal assault weapons and large capacity ammunition magazines to relinquish them to the police or make them permanently inoperable.\" It was readily apparent that a specific change in law affected some registered firearms, necessitating notification of individuals who owned registered guns affected by the law of the changes. It continued:", "The Department of Emergency Services and Public Protection announced Friday it had sent a letter to owners who had failed to register the items by a Jan. 1 deadline, part of last year's gun control law. Officials offered advice on what to do now with the weapons and magazines.", "The letter says gun owners are in compliance with the new state law if their items are no longer in Connecticut or were sold to an authorized gun dealer.", "Those who fail to comply face charges of possessing an unregistered assault weapon and/or high capacity magazine.", "The article concluded by noting that a state official \"denied rumors DESPP is confiscating weapons.\"", "It appeared that interest in the Connecticut \"gun confiscation letter\" rumors spiked in January 2016 due to concurrent concerns about potential gun laws in the legislative pipeline:", "Confiscation Is Coming: Obama To Issue Executive Order Targeting 4.2 Million Retirees With... https://t.co/T08SfwPLDW", "— Michelle Lovett (@MichelleLovett6) January 4, 2016", "However, the undated and misleading article led many readers to believe that all Connecticut gun owners began receiving letters confiscating all firearms, and that the report was current in January 2016. That was not the case, and the letters in question pertained solely to a small subset of items affected by gun legislation that went into effect in Connecticut on 1 January 2014.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]