["On February 16, The Economic Times reported that South Africa will be returning 1 million doses of AstraZeneca vaccine bought from the Serum Institute of India. “The South African government has asked Serum Institute of India (SII) to take back the 1 million doses of Covid-19 vaccines that the company had sent in early February, officials aware of the development told ET. This follows South Africa’s decision to halt the use of the AstraZeneca-Oxford vaccine after a trial found that the jab provided only ‘minimal protection’ against mild and moderate cases of Covid-19 caused by the new variant,” stated the Economic Times (ET) report. However, it is noteworthy that the report has now been updated.", "Reuters later quoted ET’s report saying, “South Africa wants to return the one million COVID-19 vaccine doses it has received from Serum Institute of India, The Economic Times reported on Tuesday, a week after the country said it would put on hold use of AstraZeneca’s shot in its vaccination program.”", "Reuters too reported on the development and its copy was republished by several other media outlets including International Business Times, The Hindu, The Wire Science, The Wire, NDTV, Pakistan’s Tribune and ARY News, Japan’s Nikkei Asia, Canada’s Financial Post, USA’s Metro, and Yahoo Money. Forbes also quoted ET and published a report on the same.", "Earlier in January 2021, South Africa’s health ministry informed that it has secured 1.5 million doses of the AstraZeneca vaccine from the Serum Institute of India (SII). The consignment with the first 1 million doses was received by South Africa on February 1, 2021. In the same week of February, a study emerged according to which the vaccine was found to be not as effective against the 501.V2 variant in South Africa. On February 16, several media outlets reported that the South African government has asked the SII to take back 1 million vaccine doses. On the same day, South Africa’s health minister Zweli Mkhize refuted the reports of South Africa returning 1 million doses of AstraZeneca back to SII. He said that the doses that were purchased from SII will be offered to the African Union and that “there will no wasteful or fruitless expenditure.” The country received its first delivery of the Johnson&Johnson vaccine on February 16 and has already vaccinated over 40,000 health workers.", "In this article, we will walk the readers through a detailed timeline of events since the vaccine was procured by South Africa to understand what all has happened.", "On January 7, South Africa secured 1.5 million doses of the AstraZeneca vaccine from SII. According to the press release by South Africa’s health ministry, 1 million doses were supposed to be received in January and the other half-million in February. Regarding the negotiation process, the document importantly said, “We also want to inform the public that the acquisition has been done directly by the Department of Health. This strengthens the credibility of the process as all the negotiations and payment issues are managed directly by the government with the manufacturer.”", "BREAKING: South Africa has secured 1.5 million AstraZeneca #Covid19vaccine doses from the Serum Institute in India. 1 million will arrive in January and 500 000 in February. The country’s 1.25 million health workers will be prioritised. 1/2 pic.twitter.com/x4oyXXn9bv", "— Mia Malan (@miamalan) January 7, 2021", "On February 1, the country received 1 million doses of the AstraZeneca vaccine produced by the Serum Institute of India. The health minister tweeted a video announcing the arrival of the first one million vaccines.", "The arrival of the first one million #COVID19 vaccines from the Serum Institute of India was a historic moment for South Africa. Watch a few highlights here: pic.twitter.com/mbpDtZl2El", "— Dr Zweli Mkhize (@DrZweliMkhize) February 2, 2021", "On February 7, The New York Times reported, “South Africa halted use of the AstraZeneca-Oxford coronavirus vaccine on Sunday after evidence emerged that the vaccine did not protect clinical trial volunteers from mild or moderate illness caused by the more contagious virus variant that was first seen there.”", "It is important to note that the findings, not peer-reviewed at the time, were based on a study of around 2,000 participants with the median age being 31. According to the professor of vaccinology at the University of the Witwatersrand and chief investigator on the study Shabir Madhi, the vaccine showed a 75 per cent efficacy against mild to moderate COVID cases until the B.1.351 strain became dominant in South Africa. After that, the efficacy dropped to just 22 per cent based on 42 symptomatic cases. However, it was also noted that the number of cases involved was too small to draw firm conclusions.", "Geoffrey York, Africa correspondent for The Globe, quoted Madhi saying that the new variant found in South Africa is more resistant to vaccines and that trial couldn’t determine if the vaccine prevents severe illness and that it wasn’t designated to test this.", "On February 7, Madhi also clearly stated that it would be reckless to discard one million doses of vaccines that had already arrived in the country and according to him, they were likely to be useful at some point in time. He said, “vaccines are normally good for 6 months, the AstraZeneca vaccines from India arrived with an April expiry date, but talks are underway with the supplier to resolve the problem.”", "On February 13, South Africa’s City Press reported, “A tense standoff is brewing between SA and India over the refusal by Serum Institute of India to replace the consignment of Covid-19 vaccines that were delivered to South Africa at the beginning of the month with new ones that have an appropriate expiry date”. The same report was cited by the South African news channel Newzroom Afrika on February 14, 2021. However, we couldn’t find other reports that backed up this claim.", "On February 16, The Economic Times reported, “The South African government has asked Serum Institute of India (SII) to take back the 1 million doses of Covid-19 vaccines that the company had sent in early February, officials aware of the development told ET”. Later that day, Reuters published an article, quoting ET’s report (now corrected), which was eventually republished by multiple media outlets. The claim – South Africa has asked SII to take back 1 million vaccine doses – was also tweeted by Canadian MP Don Davies.", "Concerning: South Africa asks Indian Serum Institute to take back 1 million vaccine doses after it paused its rollout following a small clinical trial that showed minimal protection against mild to moderate illness from the 501Y.V2 coronavirus variant dominant in the country 1/2", "— Don Davies MP (@DonDavies) February 16, 2021", "On the same day, Geoffrey York informed that the report was incorrect and that the government has clarified on the same. South African health minister Zweli Mkhize confirmed that the government will be sharing a million doses with the other interested African countries where the new variant of the virus has not been detected. As quoted by the media, speaking in the parliament, Zweli Mkhize, clarified, “The AstraZeneca doses we purchased have been offered to the African Union platform, of which we are part of, and the AU will distribute to those countries who have already expressed interest in acquiring the stock. Therefore, please be assured there will be no wasteful and fruitless expenditure”.", "He also tweeted about the procurement of the Johnson&Johnson vaccine and said, “We have managed to successfully secure 9 million doses of the Johnson & Johnson vaccine, with the delivery of the first batch of 80,000 on course and the vaccination due to begin this week.” South Africa received 80,000 doses of the Johnson&Johnson vaccine on February 16.", "On February 25, Deputy Director-General at the National Department of Health Anban Pillay informed that an ensemble study found that the Johnson&Johnson vaccine is 57 per cent effective against moderate to severe COVID. According to a press release by the Ministry of Health on February 24, a total of 41,809 health workers were vaccinated in South Africa. It may be emphasised here that the AstraZeneca vaccine will be given to the African Union and not returned to SII. Moreover, according to the study on the AstraZeneca vaccine, it was found not effective against the South African variant. Thus, the efficacy of the vaccine against other variants cannot be questioned on the basis of this study.", "According to a BBC report, Ghana has received 6,00,000 doses of Oxford-AstraZeneca vaccine through WHO’s COVAX initiative.", "After the clarification from the South African health minister, The Economic Times has updated its report and now their the reads, “South Africa denies asking Serum to take back 1 million vaccine doses”. While ET updated its report, Reuters article republished by several other prominent media outlets has yet not been updated. It may be noted that these media outlets did publish independent reports about the subsequent developments but have failed to update the first report.", "Donate Now", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]