["Pakistani-Canadian author Tarek Fatah tweeted a video of a group of men, a majority of them wearing skull-caps, and wrote . “In the #DelhiPolls2020, Muslim goons chant a provocative slogan against Hindus to boast Islamic supremacy,” claimed Fatah. The crowd can be heard chanting, “हिंदुस्तान में रहना होगा अल्लाह हू अकबर कहना होगा (If one wishes to reside in India, then one has to chant Allah-o-Akbar -translated)”.", "In the #DelhiPolls2020, Muslim goons chant a provocative slogan against Hindus to boast Islamic supremacy.", "“Hindustan me rehna Hoga, Allah-O-Akbar kehna Hoga”", "(If u wish to live in India, then you’ll hv to chant Allah-O-Akbar) pic.twitter.com/Bx51eF3rdZ", "— Tarek Fatah (@TarekFatah) February 8, 2020", "Fatah has often propagated misinformation on social media. Alt News has compiled a series of such instances.", "UP BJP spokesperson Shalab Mani Tripathi also tweeted the video with the message, “हिंदुस्तान में रहना होगा तो, अल्लाह हूँ अकबर कहना होगा ……. दिल्ली के भाइयों, घर से निकलिए, वोट करके इन नारों का जवाब दीजिए (If one wishes to reside in India, then one has to chant Allah-O-Akbar, Brothers of Delhi, get out of your houses, and cast your vote to give them answers -translated)”.", "Few other people on Twitter posted the video with a similar claim.", "Alt News found that the video is from Udaipur, Rajasthan and was shot in December 2017. According to an India TV report, the said incident took place in Udaipur on December 13, 2017, where slogans against Shiv Sena, Bajrang Dal and PM Modi were also chanted. The video starts with the slogan, “हिंदुस्तान हमारा है (India is ours)”. Later, slogans against PM Narendra Modi, Shiv Sena and Bajrang Dal can be heard. “नरेंद्र मोदी हाय हाय (2 )… शिव सेना हाय हाय(2)…बजरंग दाल हाय हाय (2)…. हिंदुस्तान में रहना होगा अल्लाह-हु-अकबर कहना होगा (Narendra Modi haye haye…Shiv Sena haye haye…Bajrang Dal haye haye…If you want to stay in India, you have to chant Allah-o-Akbar.)”", "The protest took place in the backdrop of the brutal killing of a Muslim labourer by a man named Shambu Lal Regar. It was held at Chetak Circle in Udaipur, Rajasthan.", "A two-year-old video was shared during Delhi elections to claim that Muslims asked people to raise slogans of ‘Allah-o-Akbar’ if people wished to live in India.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]