["By Jessica McDonald", "Posted on April 13, 2020", "In a weekend tweet, President Donald Trump erroneously described a New York Times article, falsely stating that it said the coronavirus originated in Europe and suggesting that it had no named sources.", "The story, which reported on new genomic analyses of some of the first coronavirus cases in the New York area, made no such claim — and quoted no fewer than seven scientists by name.", "“So now the Fake News @nytimes is tracing the CoronaVirus origins back to Europe, NOT China,” Trump said in an April 11 tweet, in an apparent reference to an April 8 story published in the science section of the paper. “This is a first!”", "The president then speculated that the story had been written to curry favor with China, which announced in mid-March that it would expel American journalists with three news outlets, including the Times. “I wonder what the Failing New York Times got for this one?” the president asked. “Are there any NAMED sources? They were recently thrown out of China like dogs, and obviously want back in. Sad!”", "Contrary to Trump’s assertions, the Times’ story never said that the coronavirus originated in Europe. Instead, the article details research findings that suggest a majority of the first cases of the coronavirus disease, or COVID-19, in New York City resulted from travelers from Europe.", "“New research indicates that the coronavirus began to circulate in the New York area by mid-February, weeks before the first confirmed case,” the story begins, “and that travelers brought in the virus mainly from Europe, not Asia.”", "That doesn’t mean the virus started in Europe, only that the primary way the virus appears to have landed in the Big Apple was via Europe.", "The story’s author, science journalist Carl Zimmer, explained as much in an April 11 Twitter thread correcting the president. “Scientists wanted to know how the virus reached the city. Studying the virus’s genes, they found the answer: mostly from Europe,” he wrote. “The virus did not originate in Europe, but it got to New York through Europe.”", "Similarly, the answer to Trump’s insinuating question about whether there are any named sources — which would be apparent to anyone reading the article — is an emphatic yes. More than half a dozen scientists comment on the record, and there are no anonymous sources.", "Or, as Zimmer put it, “Um, they’re ALL named in the article. See for yourself.”", "Zimmer’s article, “Most New York Coronavirus Cases Came From Europe, Genomes Show,” describes preliminary results from two hospital systems in the city that sequenced viral genomes isolated from COVID-19 patients. Because the virus is constantly mutating as it replicates, slight changes in the genomes can be used to infer where and how long those viruses were recently circulating — and help trace the spread of the virus across the globe.", "The Mount Sinai Health System, for example, collected samples from 84 patients over the first few weeks of March, just after the first documented COVID-19 case in New York. The researchers’ analysis, which has yet to be peer reviewed, concluded that while the virus entered the city on multiple occasions from different places, a large proportion of the genomes are most similar to those from Europe. The results were posted on the preprint server medRxiv on April 11.", "Another research group at NYU Grossman School of Medicine came to a similar conclusion, noting in an April 9 press release that “most local viral samples indicate that they originated in Europe.”", "Again, this does not mean the novel coronavirus started in Europe, but that many New York cases stem from viruses that circulated in Europe, after the virus made its way out of China.", "Zimmer interviewed two authors of the Mount Sinai report and the lead researcher of the NYU team; he also consulted four additional scientists.", "The fact that the virus began infecting people in Asia is perhaps most clear from the family tree-type visualizations from Nextstrain, a project tracking the virus’ evolution using sequences scientists around the world — including the two New York hospital systems — uploaded to a database.", "As Zimmer pointed out in his story, “The deepest branches of the tree all belong to lineages from China.”", "For Trump, the New York City results also have implications for his repeated claim that U.S. travel restrictions have been lifesaving.", "The findings indicate that the virus, which goes by the name SARS-CoV-2, was being passed around for weeks prior to the first confirmed case in the city, which was announced on March 1. That suggests that the president’s travel restrictions, which applied to China on Feb. 2, Iran on March 2 and the bulk of Europe on March 13, had little effect on the outbreak in New York City, which has been the largest in the country.", "“Our data provide insight into the limited efficacy of travel restrictions for preventing spread of SARS-CoV2 infections in NYC,” the Mount Sinai preprint reads, “and point to the increased risk of community driven transmission within the larger metropolitan area.”", "We don’t know if Trump misunderstood the Times’ story or even if he read it or read it in full; we did not hear back from the White House when asked for comment. But his remarks about the article are inaccurate.", "Editor’s Note: The author was previously a student in a science writing course taught by Carl Zimmer.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]