["About this rating", "Since at least 2019, online advertisements have used various images to promote a story about a man purportedly finding a gold mine in a \"weird cave\" or a \"lost cave.\" One was titled: \"Man Finds Lost Cave, Enters And Drops To His Knees.\" Another said: \"Man Finds Weird Cave in [Your Town], Enters and Drops to His Knees.\"", "The \"man finds lost cave\" online advertisement sometimes automatically filled in a reader's individual town name, giving the misleading impression that the story was local or familiar.", "A variation of the ad read: \"This Mine Was Found In A Man's Land, Turned Out It Will Change His Life Forever.\" A fourth said: \"A Mine Was Found In A Man's Property, Turned Out It's More Than Just A [Gold] Mine.\" We even found a fifth ad: \"Man Found This Cave In His Property, He Screamed When He Found Out What's Inside.\"", "We found evidence that people were searching for the \"man finds lost cave\" story in Phoenix, Chicago, Jacksonville, Dallas, Rochester, Philadelphia, Omaha, Seattle, Atlanta, Louisville, Coventry, Denver, Houston, and even Singapore, to name a few:", "Readers who clicked on the advertisement were led to a story on the website Interesticle headlined: \"He Thought It Was The House Of His Dreams But It Was Actually A Nightmare.\"", "The \"man finds lost cave\" story told of a man named Christopher Wanliss who finds an old gold mine on his property and, 101 slideshow clicks later, ends with a man named James digging into an \"archaeological site\" where he finds a \"monster.\"", "The story on the viral content website was not true. But we noticed that the fictional article used photographs from at least two real news stories.", "One of those real news stories was published by realestate.com.au in 2018. Anthony Doolin discovered several abandoned mines after he bought a $1.35 million property in Brisbane, Australia:", "A Brisbane man got the shock of his life after discovering a gold mine in his suburban backyard.", "It was certainly not in the fine print that he was sitting on a gold mine when he took over the property located just 20km from the Brisbane CBD, according to Anthony Doolin.", "He was out exploring his 16.5 hectares of land when he literally stumbled upon the mine shaft.", "Mr. Doolin had 16.1 hectares to explore.", "“We weren’t told about it, we just found it there one day,” Mr Doolin said.", "“I nearly fell over, I just pictured Indiana Jones and underground railroads.”", "Unfortunately, Doolin never explored the mines. He and his mother sold the property. In March 2020, the MEAWW blog reported: \"Doolin had published an asking price of $1.65 million, but no one met that number. Eventually, he settled for the same amount he had initially paid for the property.\" There was no indication that he entered the \"lost\" cave and dropped to his knees after making some dramatic discovery, as falsely suggested by the online advertisements.", "As for the \"monster\" that ended the viral Interesticle story, those photographs were taken from an October 2015 History article that documented a Michigan farmer who dug up woolly mammoth bones:", "Last Monday, farmer James Bristle and his neighbor were digging a trench to install a drainage pipe in his wheat field on the outskirts of Chelsea, Michigan, when their backhoe suddenly struck something hard about eight feet underground. At first, the pair thought they had hit a buried piece of wood, perhaps a fence post, but they soon realized they had uncovered something neither had ever seen before—an enormous three-foot-long bone.", "“We didn’t know what it was, but we knew it was certainly a lot bigger than a cow bone,” Bristle said. Believing the strange object may have been a dinosaur bone, the farmer contacted the University of Michigan Museum of Paleontology, located just 10 miles away from his field.", "Daniel Fisher, a professor and director of the University of Michigan Museum of Paleontology, arrived at Bristle’s farm last Thursday with a team of 15 students to investigate the relic. With time of the essence because of a tight harvest schedule, Bristle gave the team of paleontologists only one day to complete their work before he needed to resume his drainage project. So at dawn’s early light, Fisher’s team—with the help of two local excavators—began to dig a 10-foot-deep excavation pit. Working briskly, the paleontologist soon discovered that Bristle’s farm contained the remains of a prehistoric mammoth.", "The \"man finds weird cave\" or \"man finds lost cave\" story about the gold mine bore some similarities to previous headlines that circulated in 2016, when it appeared to some readers that a new \"Star Wars\" movie would be filmed \"soon\" in their towns. Unfortunately, this was also untrue.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]