["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As a world-renowned neurosurgeon who’s considering running for president, Dr. Ben Carson is familiar with, and critical of, the country’s medical system.", "Appearing in Manchester at the beginning of the month, Carson told attendees at a health care forum organized by the National Cultural Diversity Awareness Council that the Affordable Care Act was either poorly thought out, or designed to control \"every aspect\" of people’s lives.", "\"We have atrocious problems with access (and) horrible inefficiency problems,\" he said. Carson, a Republican, argued on behalf of health-savings accounts as a way to make people take responsibility for their own health care spending.", "Carson went on to say that the United States, at No. 1, doubles the health care spending of the No. 2 nation.", "\"We spent twice as much per capita for health care in this country as the next closest nation,\" he said during a 30-minute talk, which ranged from his own biography to entitlement and military spending.", "We thought that was worth looking into. Could the United States really be spending twice as much per person as nations with universal health care, such as those in Europe?", "According to the Organization for Economic Co-operation and Development (OECD) — which monitors economic and social well-being factors in a wide-ranging group of 34 advanced industrialized countries around the world — Americans spend more money on health care than any other nation, without much evidence that they’re getting the best value for their dollar.  On health care, the OECD has found that the United States spends far and away more per capita and as a percentage of gross domestic product than any other country.", "The average spending for OECD nations is less than $3,500 per capita, according to 2013 OECD data. By comparison, the United States, at $8,745, is about 2.5 times the average. But Carson was referring to the \"next closest nation,\" not the average nation.", "Working down from the United States, the \"next closest nation\" is Norway at $6,140 per capita. After that, it’s Switzerland at $6,080 per capita.", "Compared with those figures, the United States’ spending is about 1.4 times that of the \"next closest nation.\" (By examining life expectancy, which is the most common at-a-glance health care metric, the U.S., with its 26th out of 36 ranking, lags significantly behind those other nations. Norway was ranked No. 10; Switzerland was No. 1.)", "Asked for a clarification, a spokesperson for Carson’s exploratory committee cited the OECD data and said he misspoke.", "\"His statement should have been, ‘We spent twice as much per capita for health care in this country as the next closest nations.’ ‘Nations’ should be plural,\" the spokesperson wrote in an email.", "She said when averaging the health care cost of the other nations in the top 10, \"the US more than doubles the average of those countries.\"", "She added: \"The U.S. spends $8,745 per capita while those other 9 countries spend, on average, $3,484,\" and linked to this chart as proof.", "The nine other countries she cited and shown on the chart were Switzerland, Canada, Germany, France, Sweden, Australia, UK, Japan and Italy. However, those are not numbers two through 10 in terms of per-capita spending. Switzerland, Germany and Canada are in the top 10, but the others range up to No. 19, Italy.", "The $3,484 number is the average for all 34 countries surveyed, including the United States. The real figure for average per capita spending in countries two through 10 is about $5,000.", "There are specific instances where Carson’s claim could be dead on. For instance, France, which is considered by the World Health Organization to be one of the best in the world in terms of quality, and spent less than half of what the United States did per capita in the most recent OECD data from 2013. But Carson wasn’t speaking only about France, which officially comes in at No. 11 on the list.", "It’s worth noting, the other top 10 countries — except for the U.S. — all offer universal health care to their citizens. The U.S. has taken steps in that direction, but Carson’s plan would go a different way.", "Our ruling", "Carson said: \"We spent twice as much per capita for health care in this country as the next closest nation.\"", "Carson’s numbers are off. Spending in the United States is about 1.4 times the next-highest nation, and it’s about 1.7 times the average of the nations that rank second through ninth in spending — the group Carson’s spokeswoman said he had been intending to reference in his comment.", "However, Carson has a point that spending in the U.S. is higher, and approaches double its peers, especially when looking at the average spending for the other OECD nations.", "On balance, we rate Carson’s claim Mostly False.", "Organization for Economic Co-operation and Development, \"Total expenditure on health per capita,\" accessed April 29, 2015", "Organization for Economic Co-operation and Development, \"Health Statistics 2014, How does the United States compare?,\" accessed April 29, 2015", "Peter G. Peterson Foundation, Americans spend over twice as much per capita on health care as the average developed country does, accessed April 29, 2015", "Email interview with Ben Carson staff.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]