["About this rating", "Throughout the early months of the COVID-19 pandemic in 2020, countless social media posts, high profile pundits, and even the president attempted to downplay the threat of the virus in the U.S. in various ways, including comparing its death toll to that of the seasonal flu:", "This claim is false and dangerously downplays the severity of the ongoing coronavirus pandemic. In terms of the case fatality rate, which the Centers for Disease Control and Prevention (CDC) describes as the number of people who die from a given condition, medical experts argue that COVID-19 is, in fact, deadlier than the seasonal flu. Though COVID-19 fatality rates vary largely depending on available medical infrastructure within a country, Johns Hopkins University of Medicine reports that in July 2020, the U.S. was among the 20 countries most affected by the virus and had a mortality rate of 3.4%. In early 2022, that rate had decreased to around 1.4%. By comparison, flu infections over the last decade have resulted in a mortality rate hovering around .1%.", "COVID-19 is also deadlier in terms of how many people are estimated to die from it per year. Preliminary estimates from the CDC found that the 2018-19 influenza season resulted in an estimated 34,200 deaths in the U.S. As of July 27, 2020, more than 4.2 million COVID-19 cases had been reported across 50 states, seven territories and Washington, D.C., and more than 146,500 deaths were associated with the respiratory disease -- nearly four times the death toll associated with the 2018-19 flu season.", "Influenza impacts can vary widely from year to year and while the infection places a \"substantial burden on the health of people in the U.S. every year,\" estimated annual deaths caused by the flu over the last decade are significantly lower than COVID-19 deaths reported in the first seven months of 2020:", "Source: CDC", "The last influenza pandemic, caused by influenza A (H1N1), occurred in 2009. Nicknamed the “swine flu,” the global outbreak resulted in approximately 61 million cases, 274,000 hospitalizations, and 12,500 deaths in the U.S. over the following year, according to the National Library of Medicine.", "Comparisons aside, experts warned that the U.S. will now see the impacts of COVID-19 alongside the next flu season, which will compound the difficulties faced by already overburdened hospitals and health care workers in many states.", "“Even in non-pandemic years, influenza and other etiologies of pneumonia represent the eighth leading cause of death in the United States, and respiratory viruses are the most commonly identified pathogens among hospitalized patients with community-acquired pneumonia,” wrote Dr. Benjamin Singer, a Northwestern Medicine pulmonologist who treats COVID-19 patients, in an editorial published in Science Advances.", "Both the flu and COVID-19 can be severe respiratory diseases but they are caused by different types of viruses. The flu is caused by four types of influenza viruses (A, B, C, and D), whereas COVID-19 is caused by the coronavirus dubbed SARS-CoV-2, notes the CDC. The severity of infection by coronavirus or influenza is largely dependent on a number of factors, including underlying medical conditions and age. Both the flu and COVID-19 can have similar symptoms and health officials note that it is important to stay vigilant and practice proper hygiene and social distancing measures.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Horowitz, Daniel.   \"Horowitz: The CDC Confirms Remarkably Low Coronavirus Death Rate. Where Is The Media?\"\r\n    Conservative Review.   22 May 2020.", "CDC COVID Data Tracker.   \"United States COVID-19 Cases and Deaths By State.\"\r\n    27 July 2020.", "Shrestha, Sundar, et al.   \"Estimating the Burden of 2009 Pandemic Influenza A (H1N1) in the United States (April 2009-April 2010).\"\r\n    Clinical Infectious Diseases.   1 Jan 2011.", "Broadfoot, Maria.   \"Coronavirus and the Flu: A Looming Double Threat.\"\r\n    Scientific American.   4 June 2020.", "Singer, Benjamin.   \"COVID-19 and the Next Influenza Season.\"\r\n    Science Advances.   29 May 2020.", "Centers for Disease Control & Prevention. \"Assessing Risk Factors.\"\r\n    Cases, Data & Surveillance.   25 June 2020.", "Faust, Jeremy, del Rio, Carlos.   \"Assessment of Deaths From COVID-19 and From Seasonal Influenza.\"\r\n    JAMA Internal Medicine.   14 May 2020.", "Update [28 July 2020]: Added information about comparative case fatality rates for seasonal flu vs. COVID-19.", "Update [Jan. 10, 2022]: Updated case fatality rate based on newly available information.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]