["The photos were published here on Facebook on September 13, 2020. The post has been shared more than 10,000 times.", "The first photo shows a bleeding man being carried by two others; the second shows police officers in helmets and batons in their hands; the third shows a bloodied woman being restrained by others while uniformed officers look on.", "GRAPHIC CONTENT", "Show", "Hide", "Part of the Hindi caption translates to English as: “Unemployed youth today in Lucknow…Long live Yogi ji, you’re a tiger.”", "Yogi ji is a reference to Yogi Adityanath, the Uttar Pradesh chief minister; Lucknow is the capital of Uttar Pradesh state in northern India.", "The posts circulated online as India experienced nationwide protests over increasing unemployment rates. Local media, including this September 18 report by The Indian Express newspaper, showed police using batons and other riot gear to disperse protesters.", "The photos were also shared here and here on Facebook, and here, here, here, here, here and here on Twitter, alongside similar claims.", "The claim, however, is misleading.", "First Photo", "Closer examination of the first photo in the misleading post revealed a watermark reading Ashutosh Tripathi.", "A subsequent keyword search found that Tripathi, a photojournalist for the Indian news organisation Newstrack, addressed the misleading claim here on Facebook and here on Twitter on September 18, 2020, saying that he took the photos at a protest in 2018.", "GRAPHIC CONTENT", "Show", "Hide", "The Hindi Facebook post reads: “These two photos have been shared recently, being described as the scene of a police charge on people protesting over the issue of unemployment, which is false. I took these two photos in 2018 and they show trainee teachers.", "AFP conducted a separate Google image search and found the same photo was indeed published in this November 2, 2018 report by local newspaper Amarujala, headlined: “Protest vigorous on the assembly for the recruitment of 68500 assistant teachers, police lathi-charged”.", "GRAPHIC CONTENT", "Show", "Hide", "The article reads, in part: “Under the banner of Uttar Pradesh BTC Trainee Teachers Association 68500 Teachers Recruitment, protesters gathered in front of Vidhan Sabha in different groups.", "“Police and protesters clashed several times during the protest over the removal from the road. More than a dozen protesters were injured in lathicharge. Many of the candidates had their heads torn and were admitted to the civil hospital.”", "Below is a screenshot comparison of the first photo in the misleading post (L) and the photo in the Amarujala report (R):", "GRAPHIC CONTENT", "Show", "Hide", "The 2018 trainee teacher protest was also reported by other local media, including the NewsCentral 24x7 news website here and The Free Press Journal newspaper here.", "AFP has previously debunked misuses of this photograph here.", "Second Photo", "A reverse image search on Google found the second photo published here on Twitter on November 3, 2018.", "The Hindi tweet reads: “#Lucknow - 68500 teacher recruitment BTC students performed fiercely on the assembly, the police did not feel the protest in the assembly area, late arrived police fiercely lathi sticks, injured many candidates. Yogi Sarkar Sarm”.", "Third Photo", "Through a reverse image search on Google, AFP found the third photo in the misleading post published in this tweet on the account of local news website UttarPradesh.ORG News, dated November 2, 2018.", "Below is a screenshot comparison between the third photo in the misleading post (L) and the photo in the 2018 UttarPradesh.ORG News tweet (R):", "The misleading claim was also debunked by Indian fact checking organisation Alt News here in September 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]