["About this rating", "On 29 August 2017, houstonchronicle-tv.com (not Houston Chronicle) published an item appearing to report that boxing champion Floyd Mayweather donated $200 million to Hurricane Harvey relief efforts three days after a widely-publicized bout:", "There’s a well known saying that “To whom much is given, much is expected” and by all accounts, it appears Floyd Mayweather Jr. knows what he means on the world stage. He’s living up to that expectation. By way of financial support, the newly retired American boxer, Mayweather has offered an overwhelming sum of money to the Hurricane Harvey victims.", "The World No. 1 undefeated boxer Floyd Mayweather has donated 200 million dollars to help rebuild Houston, after the most populous city in the state of Texas and the fourth-most populous city in the United States was slammed by Hurricane Harvey on Sunday.", "The donation which will be utilized through his foundation was announced today after he travelled to Houston to ascertain the damage caused by the hurricane.", "“It is a humanitarian gesture, an act of solidarity and support for a brotherly affected people,” the American boxing hero said.", "The item was in part identifiable as fake news by its misleading URL; the actual Chronicle's web site is located at Chron.com. Although the story about Floyd Mayweather's Hurricane Harvey donation had no disclaimer, houstonchronicle-tv.com previously published fake news.", "The actual Houston Chronicle carried no such story.", "Variations: On 30 August 2017, readers began asking if Manny Pacquiao had donated a sizeable sum of money to Harvey relief efforts:", "I just came across a post on Facebook saying Manny Pacquiao donated $50 million to the hurricane Harvey victims. After reading the article on Scopes about Mayweather, I suppose this one on Pacquiao is also fake news.", "Manny Pacquiao donates $50 million to Hurricane Harvey victims.\n[link]", "The claim was published by the web site usa360-tv.com, and featured a logo nearly identical to that of the New York Daily News (again, posing as a well-known paper). In addition to structural similarities between the two fake news sites, another veracity-related clue was near-identical verbiage employed by both pages:", "There’s a well known saying that “To whom much is given, much is expected” and by all accounts, it appears Manny Pacquiao knows what he means on the world stage. He’s living up to that expectation. By way of financial support, the Filipino professional boxer and politician, Manny Pacquiao has offered an overwhelming sum of money to the Hurricane Harvey victims.", "One of the World famous boxers Manny Pacquiao has donated 50 million dollars to help rebuild Houston, after the most populous city in the state of Texas and the fourth-most populous city in the United States was slammed by Hurricane Harvey on Sunday.", "The donation which will be utilized through his foundation was announced today after he travelled to Houston to ascertain the damage caused by the hurricane.", "“It is a humanitarian gesture, an act of solidarity and support for a brotherly affected people,” the Filipino boxing hero said.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]