["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Many gun violence victims in the state’s largest city share a common trait -- a criminal history, according to Newark Mayor Cory Booker.\n\nBooker, in a recent radio interview, said statistics showing the extent to which shooting victims are involved in the criminal justice system are \"startling.\"\n\n\"We now sat down with Rutgers and have shown that if you are shot in the city of Newark, as the shooting demonstrates that we just saw, if you are shot in the city of Newark, you have over an 80 percent chance that you've been arrested before an average of 10 times,\" Booker said Oct. 13 on WBGO’s \"Newark Today,\" just days after a daytime shooting spree in a public housing complex in Newark’s Central Ward. \"So we know the players here. If you are getting shot or doing the shooting, overwhelmingly you've been involved in the criminal justice system and the correctional system is not correcting.\"\n\nPolitiFact New Jersey was also startled by the data. So, we researched Booker’s claim.\n\nNewark spokeswoman Anne Torres said Booker’s \"statement should have been shot and killed, instead of shot,\" but beyond that he’s right.\n\nThe statistics come from a study Anthony Braga, a professor with Rutgers-Newark School of Criminal Justice is conducting, as a program called \"Operation Ceasefire\" is implemented in Newark.\n\nDavid Kennedy, director of the Center for Crime Prevention and Control at John Jay College of Criminal Justice in New York, along with Braga and Anne Piehl, a Harvard professor at the time, implemented Ceasefire in Boston in 1996, with the city’s police department. The strategy aims to reduce gun violence through targeted law enforcement efforts, social services outreach and community interaction.\n\nThough Braga’s study is not yet completed or published, Braga said he briefed Booker and his staff on the progress of his research on homicides and nonfatal shootings in the city.\n\n\"The exact numbers are... 85% of 165 murder victims in Newark between 2009 and 2010 were known to the criminal justice system before they were killed (\"known\" meaning that they were arrested at least once before the homicide event),\" Braga wrote in an email. And those \"victims, had, on average, 10 prior arrests on their criminal records.\"\n\nBraga said he determined those figures by running the names and dates of birth of the homicide victims through the state’s database of criminal history files.\n\nKennedy said that pattern of violence is not unique to Newark. \"This is the way the streets work,\" he said. \"The idea that ordinary people kill each other is nearly never true.\"\n\n\"The folks who pick up a gun and kill another human being are the exception, even within an active criminal population and they almost always kill people in their same social networks. So they’re killing each other, in effect. Contrary to what a lot of people think, this stuff is not random. It’s not stranger on stranger,\" said Kennedy. \"It’s people that know each other.\"\n\nOur ruling\n\nBooker said \"if you are shot in the city of Newark, you have over an 80 percent chance that you've been arrested before an average of 10 times.\"\n\nThe mayor should have said shot and killed, but the rest of his statistic is on point -- and backed by the research of a Rutgers-Newark criminal justice professor.\n\nWe rate his statement Mostly True.", "To comment on this ruling, go to NJ.com.", "WBGO, Newark Today, Oct. 13, 2011\n\nPhone and email interview with Anne Torres, spokeswoman for the City of Newark, Oct. 17 &18, 2011\n\nEmail interview with Anthony Braga, professor at Rutgers University’s School of Criminal Justice, Oct. 19 & 20, 2011\n\nInterview with David Kennedy, director of the Center for Crime Prevention and Control and professor of criminal justice at John Jay College of Criminal Justice, Oct. 20, 2011\n\nThe Star-Ledger, Newark officials, leaders to meet with violent groups to offer them jobs in effort to reduce crime, March 11, 2011\n\nThe Star-Ledger, Daytime shooting spree at Newark housing complex rattles residents, Oct. 11, 2011\n\nThe Star-Ledger, Newark gets $2M juvenile crime prevention grant, Sept. 19, 2011\n\nThe Star-Ledger, $20.8M grant allows rehiring of 78 police throughout N.J., Sept. 27, 2011\n\nNew Jersey State Police, Identification & Information Technology Section, accessed Oct. 21, 2011\n\nU.S. Department of Justice, Reducing Gun Violence: The Boston Gun Project’s Operation Ceasefire, September 2001", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]