["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "New Jerseyans living in the northern and southern parts of the state already have plenty to divide them: politics, professional sports teams, and whether it’s called going \"down the shore\" or \"to the beach.\"\n\nNow former state legislator Raymond Bateman has added another point of division: the Mason-Dixon Line, best known for separating free and slave states in the period leading up to the Civil War.\n\nBateman, a Republican who served as a state assemblyman and senator for two decades before his failed gubernatorial bid in 1977, offered that historical claim in an April 9 opinion piece published on DailyRecord.com. The column focused on the split between northern and southern New Jersey in light of the fierce debate over merging Rutgers-Camden with Rowan University.\n\n\"The political and cultural divisions between North and South Jersey are historic and run deep,\" Bateman wrote. \"Early in 1861, on a train route to his first presidential inauguration, Abe Lincoln stopped in Trenton and addressed a joint session of the New Jersey Legislature. He was roundly booed and bombarded with inappropriate catcalls.\n\n\"New Jersey’s North-South political landscape during the Civil War was definitely mixed — remember that Cape May, Cumberland, Salem and part of Atlantic counties are all south of the Mason-Dixon line.\"\n\nBut PolitiFact New Jersey found that the Mason-Dixon Line never entered the Garden State.\n\nAlthough closely associated with the divide between free and slave states, the line was originally meant to settle a border dispute between the colonies of Maryland and Pennsylvania, according to experts and historical records. The line runs north along the border between Delaware and Maryland, and then west along the Maryland-Pennsylvania border.\n\nBateman acknowledged his claim is inaccurate, but said the presence of the Mason-Dixon Line in New Jersey has been a commonly held belief.\n\n\"If I’m wrong, I’m wrong,\" Bateman, a Somerset County native, told us. \"If that’s the authority, I stand corrected.\"\n\nLet’s trace the history behind the Mason-Dixon Line.\n\nThe famous boundary gets its name from English surveyors Charles Mason and Jeremiah Dixon, called upon in the 1760s to establish the boundaries between Maryland and Pennsylvania. The Calvert family of Maryland and the Penn family of Pennsylvania had been engaged in a long-running dispute over their borders.\n\nThe resulting border separated Delaware, which was then part of Pennsylvania, from Maryland and Pennsylvania. The line was later extended westward to form the boundary between Pennsylvania and what is now West Virginia.\n\nMatthew Crocker, a history professor at Keene State College in New Hampshire, said in an e-mail that \"no part of N.J. was ever thought of being south of the Mason-Dixon Line.\"\n\nJoseph Bilby, a member of the New Jersey Civil War Sesquicentennial Committee and the author of several books on the state’s history, told us myth-makers \"have been drawing political conclusions from this make-believe line crossing New Jersey for some time.\"\n\n\"If you insist on drawing the line across from the Maryland/Pennsylvania border to the Atlantic Ocean, then yes, Southern New Jersey would be under that ‘line,’ although the line itself would be, of course, meaningless,\" Bilby said in an e-mail.\n\nThe symbolic importance of the Mason-Dixon Line as dividing free and slave states increased as Pennsylvania’s gradual emancipation act took effect during the 1780s and 1790s, according to Max Grivno, an assistant history professor at the University of Southern Mississippi.\n\n\"Tensions over slavery along the border increased steadily beginning in the 1790s, but they reached a climax in the 1850s when there were several violent skirmishes between runaway slaves and slave catchers in southern Pennsylvania,\" Grivno said in an e-mail.\n\nOur ruling\n\nIn an April 9 opinion piece, Bateman claimed \"Cape May, Cumberland, Salem and part of Atlantic counties are all south of the Mason-Dixon line.\"\n\nBut historical records and experts confirmed that the Mason-Dixon Line never entered New Jersey. The boundary was first established in the 1760s to settle a border dispute between Maryland and Pennsylvania.\n\nWe rate the statement False.", "To comment on this ruling, go to NJ.com.", "DailyRecord.com, State's North-South divide heating up, April 9, 2012\n\nWestJersey.org, The Mason-Dixon line does not involve New Jersey, accessed April 17, 2012\n\nA brief history of the Mason-Dixon survey line, a paper written by University of Delaware associate professor John Mackenzie, 2005\n\nThe Journal of Charles Mason and Jeremiah Dixon, accessed April 20, 2012\n\nThe Pennsylvania Center for the Book, Our Most Famous Border: The Mason-Dixon Line, Fall 2008\n\nThe Work of Charles Mason and Jeremiah Dixon, a paper written by Edwin Danson\n\nStargazers, Ax-men and Milkmaids: The Men who Surveyed Mason and Dixon’s Line, a paper written by Todd Babcock\n\nNew Jersey Department of State, Lincoln and New Jersey: A Bicentennial Tribute By The New Jersey State Archives, accessed April 17, 2012\n\nWebsite for the Chalfonte hotel in Cape May, accessed April 17, 2012\n\nThe Evolution of the Mason and Dixon Line, a 1902 article written by Morgan Poitiaux Robinson\n\nNew Jersey Monthly, 52 Things Every New Jerseyan Must Know, Feb. 1, 2008", "Encyclopedia Americana, Volume 18: Section on Mason-Dixon Line, 1996\n\nE-mail interview with Joseph Bilby, New Jersey Civil War Sesquicentennial Committee, April 17-18, 2012\n\nE-mail interview with Peter Carmichael, director of the Civil War Institute at Gettysburg College, April 17-18, 2012\n\nE-mail interview with Matthew Crocker, a history professor at Keene State College, April 19, 2012\n\nInterview with Raymond Bateman, April 19, 2012\n\nE-mail interview with Max Grivno, an assistant professor at the University of Southern Mississippi, April 19-20, 2012\n\nDelaware Geological Survey, Delaware’s State Boundaries, June 1989", "E-mail interview with Robert Forbes, an assistant history professor at the University of Connecticut, April 19, 2012", "E-mail interview with Daniel Howe, professor emeritus with the Department of History at UCLA, April 19-20, 2012", "Interview with William Schenck, a geologist with the Delaware Geological Survey, April 20, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]