["A photo collage consisting of four photos was posted here on Facebook on February 23, 2021. It has been shared more than 110 times.", "The post's Indonesian-language caption translates to English as: “The plane crashed carrying more than 20 missionaries who were going to preach the gospel and no one died.", "“Miracles and protection of God”.", "The same photo collage was shared more than 320 times on Facebook here, here, here and here alongside a similar claim.", "The claim, however, is misleading.", "A reverse image search on Yandex followed by keyword searches found the same four images posted here on the Facebook page of China’s state-run Xinhua News Agency on May 23, 2018.", "The post reads: “A private jet from U.S. crashes at Honduran capital’s airport and splits in half. All people on board survive, according to local media.”", "Below is a screenshot comparison of the photos in the misleading post (L) and Xinhua’s photos (R):", "The Associated Press published a report on May 24, 2018, about the crash here. The headline reads: “Passengers of Honduras plane crash were from US pawn company”.", "The report's first two paragraphs read: “A Texas-based pawn shop company has confirmed that four of its executives were aboard a private jet that crashed off the end of the runway in Honduras’ capital.", "“Austin-based EZCORP says that the plane was carrying its four employees and two crew members. It says those aboard suffered mostly minor injuries, with one employee and one crew member suffering more serious injuries.”", "AFP published a video report about the crash on YouTube on May 23, 2018. It is headlined: “Plane accident in Honduras injures six Americans”. It shows scenes that directly correspond with Xinhua’s photos.", "The plane was carrying four passengers and two crew, according to US media. The four passengers on the flight were American pawn shop employees, the reports said. CNN and the New York Post reported on the crash on May 23, 2018.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]