["About this rating", "The shark featured in the image is indeed a Greenland shark, a long-lived Arctic species that was the subject of a 2016 study. Throughout their research, scientists at the University of Copenhagen found that such sharks may live upwards of 400 — or even 500 — years.", "Unknown is whether the shark in the picture is one from the study that was estimated to be 392 years old, give or take 120 years, at the time the findings were published in 2016.", "In August 2020, a widely shared image claiming to depict a 392-year-old shark resurfaced on social media, garnering thousands of shares on both Facebook and Twitter.", "This was a variation of a familiar meme, which we identified as \"mostly false\" in December 2018. We are rating the newer variation as \"mixture\" because the image that circulated in 2020 was, indeed, a photograph of a Greenland shark. However, we were unable to determine the exact age of the shark in question, though the age of a given Greenland shark can be estimated by its length (more on that later).", "Both viral memes originated from a study published in the journal Science in August 2016. In the study, researcher Julius Nielsen, who was then a Ph.D. student at the University of Copenhagen, set out to define the life history of the Greenland shark, scientifically known as Somniosus microcephalus. These deep ocean fish have been described as an \"iconic species of the Arctic seas\" and remain one of the most enigmatic creatures on Earth (see National Oceanic and Atmospheric Administration picture below), mainly due to their unique ability to survive at depths of at least 7,200 feet.", "When the research was first announced in 2016, many mainstream media publications picked up the study and declared that the Greenland shark was the longest-lived vertebrate known on the planet. In the years following the publication of the study, various iterations of the photograph's subject and its age have recirculated in different forms. A reverse-image search found 56 results, dating back to as far as 2018. Following another round of social media virality, Nielsen took to Instagram in December 2017 to address misleading claims related to the age of the shark in question:", "Social media are going beserk over old Greenland sharks these days?? All of this is just the same story coming to life from August 2016 and please note that we have not found any sharks to be 600 or 500 yr old.... we have ESTIMATED (meaning that it has not been verified) that one shark was AT LEAST 272 yr old or in more detail that this shark was between 272-512 yr old with 95.5% certainty (the later also being an unverified estimate).", "Over the course of a three-year project to study the biology of the Greenland shark, the team used radiocarbon dating to determine the ages of 28 specimens that had been accidentally caught as by-catch over several years. The findings concluded that the slow-maturing species grows by about .4 inches each year, and can reach lengths stretching to over 16 feet. The largest shark analyzed in the study was measured at nearly 16.5-feet long, and was believed to have been around 392 years old in 2016 — which would make her about 396 in August 2020.", "However, radiocarbon dating studies typically determine age ranges rather than point to a specific age. Based on the analysis of 28 female Greenland sharks — each of which measured between 2.5 and 16.5 feet long — the study authors estimated an average species lifespan of at least 272 years. If the estimates followed the annual growth of .4 inches to a tee, then one might calculate the largest shark to be 502 years old. Range estimates, on the other hand, showed that the largest shark was likely 392 years old, give or take 120 years.", "A University of Copenhagen news release published at the time of the study described Greenland sharks as \"among the largest carnivorous sharks on the planet,\" whose role as an apex predator in the Arctic ecosystem is \"completely overlooked.\" Greenland sharks can reach lengths of up to 24 feet and weigh more than 2,000 pounds.", "What remains unclear is whether the shark featured in the meme was that same large shark mentioned above, or another one photographed as part of the research. So, while the photograph does, in fact, depict an individual, long-lived Greenland shark, the exact age of the specimen is not made readily clear in the research.", "Have you seen other variations of this claim? Let us know.", "Nielsen, Juilius, et al.   \"Eye Lens Radiocarbon Reveals Centuries of Longevity in the Greenland Shark (Somniosus microcephalus).\"\r\n    Science.   12 Aug 2016.", "Morelle, Rebecca.   \"400-Year-Old Greenland Shark ‘Longest-Living Vertebrate.’\"\r\n    BBC.   12 Aug 2016.", "Bates, Mary.   \"272-Year-Old Shark Is Longest-Lived Vertebrate on Earth.\"\r\n    National Geographic.   11 Aug 2016.", "\"Greenland Sharks Live For Hundreds of Years.\"\r\n    University of Copenhagen.   11 Aug 2016.", "Putterman, Samantha.   \"Viral Photo Does Show Longest-Living Shark Species, But Exact Age Is Unclear.\"\r\n    PolitiFact.   28 Jan 2016.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]