["About this rating", "In mid-February 2018, an inflammatory quote attributed to Tariq Ramadan, a prominent and controversial Islamic studies scholar recently arrested on rape charges in France, reappeared on social media:", "The Swiss-born scholar has for years has been a controversial figure in part because of his lineage (he is the grandson of Hassan Al-Banna, founder of the Muslim Brotherhood movement) and in part because of his views on the role of Islam in the Western world.", "We found no evidence that Ramadan ever made the statement attributed to him above.", "In 2004, the George W. Bush administration barred Ramadan from entering the U.S. over allegations he had donated to a charity that gives money to the Palestinian Sunni-Islamic fundamentalist organization Hamas. The restriction on Ramadan's entry was lifted in 2010.", "In February 2018, Ramadan made headlines for a completely different reason: he was arrested in France after two women came forward with rape allegations against him in late 2017, during what has become known as the #MeToo movement. It's unclear whether the rape charges prompted the fake quote's resurgence, but the latter has wended its way across the Internet by way of message boards and web sites with no links back to a source for it.", "The quote appears to have originated on the anti-Muslim site BareNakedIslam.com, where it appeared in a 2015 post alongside a video commentary by Marc Lebuis, the founder of a French-Canadian web site whose mission is to \"explore and expose Islamist activities in our midst.\"", "The quote is a mishmash of Ramadan's words and Lebuis's paraphrases. In the video, Lebuis said that \"Tariq Ramadan is very controversial by the way. He called on — he specifically targeted Muslims not to use Sharia law, the term Sharia, but rather targeted Canada as being one of the easiest legal systems to penetrate in order to advance Sharia principles. And that was published in an Egyptian magazine in 2004.\"", "LeBuis was referring to a 2004 interview with Ramadan in the Cario-based news magazine Egypt Today, in which Ramadan discussed the Islamic code of conduct enshrined in the law of some predominantly Muslim countries known as Sharia law. The idea of a sneaky takeover plot to implement Sharia law in Western countries such as Canada and the United States is popular among anti-Islamic conspiracy theorists, who have developed a veritable cottage industry around that fear.", "But Ramadan never said anything about \"colonizing\" the U.S. and Canada or using violent jihad to do so. Rather, he told Egypt Today that:", "The Muslims in Canada’s battle to set up shariah courts to settle domestic disputes is another example of lack of creativity. Within the normative law in Canada, they have huge latitude for Muslims to propose an Islamic contract. These courts are not necessary; all they do is stress the fact that Muslims have specific laws and for the time being this is not how we want to be perceived. We need to show that our way of thinking is universal, that we can live with the law and there is no contradiction.", "It’s more useful for Muslims to examine the legal framework they have in Canada, which is one of the most open in the world, and come up with something Islamic that at the same time fits the Canadian reality. The term shariah in itself is laden with negative connotations in the Western mind. There is no need to stress that. We can do more and better without creating this sort of fracture and misunderstanding. The very moment Muslims understand there are no contradictions between being Muslim and being European or American, they will enrich their societies.", "Although Lebuis interpreted Ramadan's comments as pushing for a takeover of the Canadian legal system, the academic was in fact advocating for the opposite, saying that Canadian Muslims could use the existing court system rather than settling disputes in separate Sharia courts. But neither man's comments were sensational enough for BareNakedIslam, which apparently made up a quote that fit their purposes.", "As the fake quote and stories about the allegations against Ramadan swept far-right sites such as GellerReport.com and \"Creeping Sharia,\" some observers have raised questions about what it means for Muslim women when misogyny and racism collide. Muslim women have been speaking out in their own version of the MeToo movement using the hashtag #MosqueMeToo, telling their stories of assault and abuse within the religious community.", "Author and activist Mona Eltahawy pointed out in a November 2017 op-ed that the eagerness of Islamophobes to paint Muslim men as predators puts Muslim women in a difficult position when they come forward with accusations of sexual assault. Ayesha Chaudhry, associate professor of Islamic studies and gender studies at the University of British Columbia, discussed that double bind in phone interview with us, saying \"When people are violated and are victims of assault, they can’t be expected solve systemic inequality at the same time.\"", "Chaudhry said the Ramadan case brought to mind a motif common in stories about crimes committed by Muslim men in the Western media, and noted that once the trial starts, various forms of rarely-discussed societal oppression will play out in public:", "[University of California, Los Angeles women's studies professor] Sherene Razack makes the argument of this triangle we find ourselves caught in when we talk about Muslims. There’s the dangerous Muslim man, the imperiled woman and the civilizing European, and you just see this in the Tariq Ramadan case so clearly.", "The context of this is interesting - there is such strong Islamophobia and racism not just in Europe, but in France in particular. We’re going to be seeing Islamophobia and racism pitted against misogyny. The courts are notorious for not prosecuting sexual assault, and for handing down light sentences when they do. They’re also notorious for over-punishing minorities — brown, black and Muslim men. All these things are at play at the same time in this story.", "Kennedy, Dana.   \"France’s ‘Muslim Rose McGowan’ and the Jailing of Tariq Ramadan.\"\r\n    The Daily Beast.   18 February 2018.", "Eltahawy, Mona.   \"#MosqueMeToo: What Happened When I Was Sexually Assaulted During the Hajj.\"\r\n    The Washington Post.   15 February 2018.", "Al Malky, Rania.  \"Tariq Ramadan\" (archived)\r\n    Egypt Today.   October 2004.", "Shariatmadari, David.   \"Tariq Ramadan: ‘Muslims Need to Reform Their Minds’\"\r\n    The Guardian.   28 February 2017.", "Agence France-Presse.   \"Oxford Professor Tariq Ramadan Is Denied Bail After Rape Charges.\"\r\n    6 February 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]