["About this rating", "In June 2017, a quote, purportedly taken from George Orwell's novel 1984, spread widely online, forming the basis for several memes that presented it as a remarkable prediction of the power and ubiquitousness of smartphones.", "Reviewing Robert Icke and Duncan MacMillan's stage adaptation of the novel in June 2017, the Australian news web site News.com called it a \"quote from the production\" and added:", "The line is from one of the characters that works for the Government, otherwise known as Big Brother. He says: “The people will not revolt. They will not look up from their screens long enough to notice what’s happening.”", "And in its review of the play, which came to New York's Broadway in July 2017, the Spectrum News NY1 TV channel also highlighted the quotation:", "Perhaps most terrifying of all is hearing O'Brien seeming to predict our current state of apathy, saying, \"The people will not revolt. They will not look up from their screens long enough to notice what's happening.\" In 2017, \"1984\" resonates louder than ever.", "What neither of these reviews make clear, and what the many memes get wrong, is that these words weren't written by George Orwell in 1949, and do not appear in the novel 1984.", "Despite a thorough search of the 2016 Enrich Spot e-book edition of 1984, we were unable to find these lines in the original novel. However, they resemble a speech from the book, made by O'Brien, a member of \"the Party\" who works at the Ministry of Truth:", "The proletarians will never revolt, not in a thousand years or a million. They cannot. I do not have to tell you the reason: you know it already. If you have ever cherished any dreams of violent insurrection, you must abandon them. There is no way in which the Party can be overthrown. The rule of the Party is for ever. Make that the starting-point of your thoughts.", "At another point in the original novel, the protagonist Winston notes: \"Until they become conscious they will never rebel, and until after they have rebelled they cannot become conscious.\"", "The earliest iteration of the quotation on Twitter dates to July 2014, during the play's second run at the Playhouse Theatre in London. (It was first staged in 2013). During the same run, a second tweet attributes the lines to the stage adaptation. However, soon afterwards, the quote began to be falsely attributed to the 1949 novel, rather than the 2014 theater adaptation.", "The revival of the play in Australia and then New York during the summer of 2017 has led to a resurgence in social media posts and memes falsely attributing the line to George Orwell's 68-year-old novel.", "Habib, Rashell.  \"George Orwell Knew What Our Future Held.\"\r\n    News.com.au.  12 June 2017.", "Torre, Roma.  \"Theater Review: '1984.'\"\r\n    Spectrum News NY1.  22 June 2017.", "Orwell, George.   1984.\r\n    Enrich Culture Group,  1949 (e-book edition, July 2016).", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]