["Recently, Seema Dhaka, a head constable in the Delhi Police, rescued 76 missing children after only having been in the force for two and a half months. She was promoted to the position of an assistant sub-inspector on November 19. She also became the first police personnel of Delhi police to receive an OTP (out-of-turn promotion). Meanwhile, Twitter user @seemadhaka0 tweeted a picture on the same day, writing, “My duty is to serve the public…” The tweet has received 24,900 likes and 1,200 retweets at the time of writing. (archive link)", "Social media users believe this account belongs to Seema Dhaka herself. A Twitter user with the display name ‘SP leader Golu Yadav’ tagged the handle congratulating the officer for her promotion. It was also retweeted by @seemadhaka0. (archive link)", "On November 21, this handle also posted a tweet thanking everyone after reaching 5000 followers. (Archive link)", "Alt News reached out to Seema Dhaka who clarified, “This is a fake Twitter account. I do not have an account on Twitter.” The policewoman added that she had called out the misinformation from her husband Anit Dhaka’s Twitter account. He wrote that @seemadhaka0 is a fake account in his replies to a number of tweets.", "ये एक फर्जी एकाउंट खोला गया है अगर जल्द ही इसे डिलीट ना किया गया तो इस पर कानूनी कार्यवाही की जा सकती है। अब जिस एकाउंट से मैं ट्विट कर रही हूँ ये मेरे हसबैंड का एकाउंट है। मैं अभी तक twitter पे नही हूँ और ये बातें मैं सभी मीडिया चैनलों को भी बता चुकी हूँ। #SeemaDhaka", "— ANIT DHAKA (@anitk1230) November 20, 2020", "Several fake Seema Dhaka Twitter created", "We found several Twitter accounts posing as Seema Dhaka, such as @SeemaDhaka10 (archive link), @RealSeemaDhaka (archive link), @seemadhakalive (archive link), @seemadhaka15 (archive link), and @Seemadhaka13 (archive link). All of these accounts were created in November 2020.", "This slideshow requires JavaScript.", "In fact, some of them also posted tweets insisting they belong to Seema Dhaka.", "This slideshow requires JavaScript.", "Another similar incident occurred in July 2020, when a video of former police officer Sunita Yadav went viral. In the clip, she was seen confronting a Gujarat minister’s son for violating lockdown rules. Following this, there was a proliferation of Twitter handles falsely claiming to be Yadav.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]