["By Angelo Fichera", "Posted on November 12, 2020", "Campaign officials for President Donald Trump and supporters have promoted the faulty claim that Joe Biden received nearly 100,000 votes in Georgia through ballots that only included selections for president, suggesting it’s “suspicious.” But the claim ignores that some voters do not vote a straight-party ballot.", "Social media posts spread by Trump campaign officials suggest that voter fraud may have occurred in Georgia, based on the claim that President-elect Joe Biden secured nearly 100,000 votes through ballots that were “ONLY” cast for Biden — and not for any candidates in other races.", "But that claim rests on a flawed assessment of vote tallies.", "The claim has nevertheless been passed along by thousands through various social media posts in recent days.", "“Nothing suspicious about this at all!” one of President Donald Trump’s sons, Donald Trump Jr., wrote with a retweet of a post spreading the claim. Both tweets have since been deleted.", "“In Georgia, ballots where the voter ONLY voted for President: • Trump: 818 • Biden: 95,801,” the post read. The tweet came from an account using the name “Sarah Hucklebee” that was made to look like an account for former White House Press Secretary Sarah Huckabee Sanders.", "The claim was put forward in a Nov. 10 video by Steve Cortes, a Trump campaign adviser, in which he outlined what he deemed a “statistical case” demanding further “investigation.”", "“Biden, though, a 95,000 vote differential — there were almost 96,000 people in Georgia, allegedly, who voted Biden-only and then did not vote for Senate,” he said in the video. “That seems far too wide to be believable.”", "We don’t know how many voters only voted for Biden, but Cortes’ number doesn’t represent that.", "Instead, the figure refers to the fact that Biden won almost 100,000 more votes in Georgia than Democratic Senate candidate Jon Ossoff. But it’s faulty to assume that all of those votes must have been on ballots for Biden only, ignoring that some voters in the state selected Biden for president but didn’t adhere to a strictly party-line vote for the Senate.", "As of early Nov. 12, there were 4,992,420 votes counted in the presidential race in Georgia. While the total number of votes fluctuates across other races — since, indeed, some people don’t cast a vote for every race — there were 4,945,792 votes counted in the Senate race between Republican Sen. David Perdue and Ossoff.", "That’s a difference of 46,628 total votes — or almost half of what’s being alleged in the viral posts.", "The conservative National Review’s Dan McLaughlin said the difference between the total votes cast for the presidential race and the Perdue-Ossoff contest renders “the 95,000 number … mathematically impossible.”", "McLaughlin also pointed out that one could look to the election in Maine — where Republican Sen. Susan Collins received 55,468 more votes than Trump as of Nov. 12.", "That “means that some voters went for Biden and Collins, as voters have been doing as long as there have been elections,” McLaughlin wrote, later adding: “Split-ticket voting is not fraud, and there is nothing unusual about it.”", "Barry Burden, director of the Elections Research Center at the University of Wisconsin-Madison, told us in an email that it’s “difficult to assess the accuracy of the factual claims being made” about “Biden-only” ballots.", "“How do these folks know how many voters selected Biden or Trump for president but skipped the Senate race?” he said. “Knowing that would require individual-level information from ballots, not aggregation information about ballots cast in each race.”", "Burden also said it’s common that voters “choose a candidate at the top of the ballot and then ‘roll off’ as they move down the ballot. There is nothing suspicious about lower participation in lower level races.”", "And “even in an era of strong partisanship, some voters split their tickets. That is precisely why aggregate totals can be deceptive when trying to reach conclusions about individual voter behavior.”", "Gabriel Sterling, Georgia’s voting system implementation manager, made note of many voters straying from party-line votes during a press conference on Nov. 9.", "“The other thing we’ve discovered is, from our initial assessment, there was a lot of ticket-splitting going on,” he said.", "Biden’s lead in Georgia stood at about 14,000 votes on Nov. 12. Georgia’s secretary of state has announced the state will conduct a hand recount of the presidential race.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Burden, Barry. Director, Elections Research Center, University of Wisconsin-Madison. Email to FactCheck.org. 12 Nov 2020.", "“Georgia Election Results.” New York Times. Accessed 12 Nov 2020.", "“Georgia Secretary of State Update on 2020 Election.” C-SPAN. 11 Nov 2020.", "“Maine Election Results 2020.” Politico. Accessed 12 Nov 2020.", "McLaughlin, Dan. “No, There Were Not 95,000 Biden-Only Ballots in Georgia.” National Review. 11 Nov 2020.", "“News Conference on Georgia Vote Count.” C-SPAN. 9 Nov 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]