["About this rating", "On 14 April 2017, the \"prank\" web site React365 published an article positing that Texas had legalized the recreational use of marijuana:", "Marijuana now legal in state of Texas", "In a 10-2 vote marijuana has now been legalized in the state of Texas. Texas first marijuana dispensaries said to open up in Corpus Christi, TX April 12, 2017. We were out speaking with local residents of Corpus Christi today who were very excited to say the least of the legalization.", "The article was quickly deleted, but not before it fooled many readers as it was circulated on Facebook.", "React365 is one of many web sites that encourage users to create their own fake news stories in order to prank their friends. Users simply invent a fake news title, write a paragraph of two of misinformation, and upload a related image. React365 then turns that collection into a social media post resembling a genuine news item which can be used to \"prank\" people on the Internet:", "Although it is often unseen by readers who only glimpse at headlines in social media posts, a disclaimer on the React365 site identifies its content as fiction:", "This website is an entertainment website, news are created by users. These are humourous news, fantasy, fictional, that should not be seriously taken or as a source of information.", "One reason that this fake news story may have been particularly believable is that Dallas did pass legislation in April 2017 that would prevent persons caught in possession of small amounts of marijuana from going to jail:", "Getting caught with marijuana in Dallas will soon no longer guarantee a trip to jail.", "The Dallas City Council on Wednesday approved a \"cite-and-release\" program to ticket people who have fewer than 4 ounces of pot and who are not alleged to have committed any other crime. The policy will take effect Oct. 1.", "React365 has also been responsible for spreading fake news about great white sharks in the Mississippi River and a law requiring grandchildren to spend time with their grandparents.", "Hallman, Tristan.   \"Got Weed? In Dallas, It Might Not Land You in Jail Anymore.\"\r\n    The Dallas Morning News.   13 April 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]