["A Twitter user Geetika Swami, who is followed by railway minister Piyush Goyal’s office, shared a video where several Muslim children are singing ‘Hindustan Hamara Hai’. Swami tweeted the video claiming that average Kashmiris are celebrating the dilution of Article 370. Her tweet read, “#KashmirWelcomesChange The children in Kashmir singing ‘Hindustan Hamara hai’ While the seculars are sulking the abrogation of Article 370, an average Kashmiri is celebrating the integration with Mighty India! #ThursdayThoughts #ThursdayMotivation.“", "#KashmirWelcomesChange", "The children in Kashmir singing ‘Hindustan Hamara hai’", "While the seculars are sulking the abrogation of Article 370, an average Kashmiri is celebrating the integration with Mighty India! #ThursdayThoughts #ThursdayMotivation pic.twitter.com/QFcPTGJuDi", "— Geetika Swami (@SwamiGeetika) August 8, 2019", "The clip has also been circulated on Facebook with the same caption.", "The video shared by Swami carried a logo that said – ‘Voice of J&K’. Alt News found a Facebook page by the same name that had shared the identical clip on April 15, 2019. Since the video is four months old, it cannot be representative of an event that took place after the government’s decision to deem Article 370 ineffective on August 5.", "यह हिंदुस्तान हमारा है गीत गाते हुए जम्मू कश्मीर के राष्ट्रभक्त बच्चे।", "Posted by Voice of J&K on Monday, 15 April 2019", "A keyword search on YouTube led us to the same video uploaded by BJP Jammu and Kashmir on April 15 described as – “Kids Chanting Song Yeah Hindustan Hamara Hai at Challar, Inderwal in Kishtwar during BJP rally.”", "The video does not represent children in Kashmir celebrating the government’s move on Article 370 but an old BJP rally. This was earlier debunked by Boomlive.", "After the dilution of Article 370, Alt News has debunked several such cases of misinformation.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]