["A video is being shared on social media with claims that it shows Google CEO Sundar Pichai visiting his former math teacher’s house to honour her. It is also claimed that Pichai and his teacher are meeting after 26 years.", "Sundar Pichai the CEO of Google paying tribute to his Math teacher Molly Abraham by visiting her at Mysore. See his humility and the respect for teachers!👌🏻👌🏻", "Posted by Somender Singh on Wednesday, 12 August 2020", "The video has gone viral on Facebook with these claims. At the same time, other users are claiming that the person in the video is Microsoft CEO Satya Nadella.", "People claiming that the person in the video is Sundar Pichai or Satya Nadella are either not paying attention to the text shown at the beginning of the video or are deliberately ignoring it. Right at the start of the clip, the name of the person standing on the stage appears as ‘Ganesh Kohli, IC3 Conference President.’", "When we searched using these keywords, we discovered that the person appearing in the video was Ganesh Kohli, a teacher and counsellor. He has led a number of organisations in the last 20 years which focus on education. He is also the founder of the IC3 Movement, started in 2016. The organization aims to help support and empower about 1,75,000 high schools to create fully-functioning career and college counselling departments over the next 15 years. Kohli began his career by teaching mathematics and helped some families to get a good global education. We found these details about him on the organization’s website, ic3institute.org.", "We also found their YouTube channel, called IC3 Movement. There we discovered the viral video, which had been uploaded in September 2017. In the video, Ganesh Kohli mentions the fact that he met his maths teacher after 26 years.", "Kohli cleared the air about this video himself on August 14 in a tweet writing, “A 3 year old @ic3movement video of me meeting my teacher began to go viral last month. Over time, in many circles, the video was attributed to @sundarpichai or @satyanadella”.", "A 3 year old @ic3movement video of me meeting my teacher began to go viral last month. Over time, in many circles, the video was attributed to @sundarpichai or @satyanadella While the message of the video is most important, how do you address this #misinformation @KarthikOnTheGo", "— Ganesh Kohli (@GaneshKohli) August 14, 2020", "In any case, there is little resemblance between facial features of Ganesh Kohli, Sundar Pichai and Satya Nadella.", "This clip, therefore, is being circulated on social media with the false claim that it features Sundar Pichai or Satya Nadella. The video is, in fact, showing Ganesh Kohli who can be seen giving respects to his teacher.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]