["According to the false story, a young child was abducted from a bathroom at Canada’s Wonderland in Vaughan, Ontario, while the mother was changing her other child. Notified, park security guards locked down the venue, and found the missing child nine minutes later, with a shaved head and different clothes intended to disguise the young victim.", "The hoax was shared on Facebook in the first days of August as a screenshot of an Instagram post, which was itself already a screenshot of a Facebook post. However, the story never took place, Ontario police and representatives for Canada’s Wonderland told AFP.", "“We don’t have any report for any incident like that, so we’re trying to verify where this has come from,” said Constable Laura Nicolle of the York Regional Police, the law enforcement organization in charge of policing Vaughan.", "“There is no truth to the story and there has never been an incident like this at the park. The safety and security of our guests is our number one priority,” Grace Peacock, director of communications for the theme park, told AFP. Peacock added that the theme park had already been the target of a similar fable several years ago.", "Tales of children abducted by strangers in public areas have captivated the public imagination for a long time. According to Snopes, a website that began covering digital disinformation in the 1990s, stories similar to the Canada’s Wonderland abduction used to circulate via email chains before migrating to Facebook.", "Many of the stories follow a similar pattern. They are usually presented as accounts from a friend or relative of the original poster, and go on to recount child abduction attempts in public places, be it an amusement park, a mall, or a supermarket. The resolution is positive, with the child found, but dressed in a distinct attire and with either a shaved head or dyed hair, supposedly a frightening proof of the level of organization and premeditation of the kidnappers.", "“We do see hoaxes like this every once in a while, and frankly it’s quite discouraging for us, because if these are made up, we don’t want to be facing a desensitized media or public in the event that a real abduction does occur,” Robert Lowery, vice-president of the National Center for Missing & Exploited Children’s Missing Children Division, told AFP.", "Though the stories that become viral are usually hoaxes, they can be rooted in true events. “We have heard of that scenario, and we’ve seen that, although I want to emphasize that it’s extremely rare,” Lowery said of the swapped clothes story.", "Lowery added that he has never heard of the scenario described above in an amusement park setting, which he described as “some of the safest places we can take our children to,” due to the training that security guards there go through, cameras, and the capacity to lock down premises.", "The data we have on child abductions further refutes the idea that strangers generally loom in public spaces in the hope of kidnapping children. In Canada and in the United States, the majority of child abductions are carried out by a child’s relative.", "According to data from Canada’s National Centre for Missing Persons and Unidentified Remains, only 27 children were abducted by strangers out of 42,233 reports of missing minors in 2018. The report adds that 92 percent of missing minor reports were removed from the list within a week, and that 73 percent of cases are runaways.", "Abductions by strangers “are so rare that when they do happen, the impact is great and that’s why people are so fearful of stranger abduction,” Karen Chymy, director of operations for MissingKids.ca, a resource center for missing children, told AFP.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]