["Send this *Nirbhaya* number to your wife, daughters, sisters, mothers, friends, and all the ladies you know..ask them to save it.. all the men please share with all the ladies you know…. In case of emergency.Ladies can send blank msg or can give missed call..so that police will find your location and help u 🌹9833312222", "The above message has gone viral on social media. Several users have posted this message on Facebook over the past few days.", "This information has also been sent to the official Alt News app for verification. Alt News found the message had been circulated on Twitter in 2018 as well.", "It may be recalled that in December 2012, 23-year old Jyoti Singh was brutally gang-raped and murdered in Delhi. This was followed by a nationwide uproar.", "The mobile phone number which has been circulated by social media and WhatsApp users- 9833312222, was launched in 2015 by Government Railway Police (GRP). The helpline however was restricted to Mumbai. The number could be used by railway commuters to send messages, pictures or videos related to the issue of women’s safety, via WhatsApp.", "Alt News found that the number is not functional. It is no longer possible to send messages on WhatsApp to this number, as it is not listed on the messaging platform. This was confirmed by Mumbai Railway Police.", "Instead, two WhatsApp helpline numbers have been listed on the website of Mumbai Railway Police.", "Insofar as Mumbai city is concerned, the helpline number is 103. This is applicable to Mumbai, Navi Mumbai and Thane. For the rest of Maharashtra, the helpline number is 1091.", "Readers may note the three-digit toll-free number – 181 which was launched in January 2013, soon after the Nirbhaya case. Initially launched in Delhi, several states have now set up this number (181) as a women’s helpline. Another number exclusively for women in distress is 1091, again adopted by state governments across the country. Moreover, in the latest development, a single emergency helpline number (112) was launched this year, integrating the police (100), fire (101), health (108) and women’s helpline (1091) numbers.", "It may thus be noted that the phone number circulated by social media users as the ‘Nirbhaya helpline’, was launched in 2015 by Railway police and was limited to Mumbai. It is no longer operational. Earlier, an old, inactive helpline number for women was shared on social media as a fresh initiative by PM Narendra Modi.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]