["About this rating", "Big Bird is known to many as the yellow-colored, loveable friend that children have watched on \"Sesame Street\" for decades. In February 2021, a tweet about the colors of Big Bird's extended family was retweeted and shared hundreds of thousands of times.", "The tweet included pictures of Big Bird-like characters in colors including orange, blue, green, and yellow. However, the original source of the story was yugiohnineinthesky on Tumblr.", "It's true that Big Bird's character has been represented in different colors outside of the United States. \"Sesame Street\" co-productions in several countries around the world have tailored the show for local audiences, changing or adding characters. The Big Bird look-alikes are referred to on the show's storyline as being \"cousins.\" In fact, the official @BigBird Twitter account confirmed the viral pictures.", "The Big Bird Twitter account also tweeted photographs showing his cousins' colors, starting with Mexico's Abelardo who appeared on \"Sésamo.\"", "\"This is Abelardo, he’s from Mexico. We reunited in California last summer during my road trip!\"", "In the past, Abelardo had appeared on \"Sesame Street\" with Big Bird:", "https://www.youtube.com/watch?t=137&v=k3XCVOnLKrM", "Next came Pino from \"Sesamstraat.\"", "\"This is Pino, he lives in The Netherlands. He’s a few years younger than me, but we’re the same height!\"", "Big Bird's Turkish cousin appeared in orange colors. The character appeared on \"Susam Sokağı.\"", "\"Meet cousin Minik Kuş! He’s from Turkey, but he's no turkey himself! He's a canary bird just like me.\"", "A dated picture from Portugal showed Poupas on \"Rua Sésamo.\"", "\"This is Poupas from Portugal. I haven’t seen him in a long time. If anyone sees him let him know Big Bird says hi!\"", "https://www.youtube.com/watch?t=571&v=p0zg6BTHGak", "Little Bird was also included in the list.", "\"You may know this cousin – this is Little Bird! He stops by Sesame Street every once in a while.\"", "https://www.youtube.com/watch?t=205&v=0zf947nUgqs&feature=youtu.be", "The last cousin featured by Big Bird was Garibaldo, who appeared to always be ready for Halloween. The character appeared in Brazil on \"Sésamo.\"", "\"This is Garibaldo from Brazil! He may look scary, but he’s one of the nicest birds I know!\"", "The Twitter thread ended with a message of thanks from Big Bird:", "The pictures sparked a humorous discussion about other childhood television characters, including Greenclaws and a supposed \"French-speaking pineapple.\"", "In sum, it was true that Big Bird had cousins that looked different than the classic yellow canary character. The characters were different representations of Big Bird for audiences in countries outside the U.S.", "Feb. 8, 2021: This story was updated to correct the source, which was yugiohnineinthesky on Tumblr.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]