["By Angelo Fichera", "Posted on September 24, 2018", "Q: Did Christine Blasey Ford, who has accused Brett Kavanaugh of sexual assault, make similar allegations against Supreme Court Justice Gorsuch?", "A: No. There’s no evidence for that rumor, which has been spread on conservative websites.", "There is no evidence to substantiate an online rumor that Christine Blasey Ford, who has accused Supreme Court justice nominee Brett Kavanaugh of sexual assault, ever lodged a similar allegation against Justice Neil Gorsuch.", "Nevertheless, that claim has boomeranged across social media platforms and websites — creating an impression that Ford, the California professor whose story has disrupted Kavanaugh’s confirmation process, made repeated allegations in an effort to derail the confirmations of conservative Supreme Court picks.", "Gorsuch was confirmed in 2017 after being nominated by President Donald Trump.", "“BREAKING: According to sources Diane Feinstein’s reluctance to mention the Kavanaugh accuser’s letter during confirmation session is because the accuser sent a similiar letter directed at Judge Gorsuch last year. The whereabouts of the earlier letter remain a mystery.developing,” Josh Cornett, a pro-Trump Twitter user, posted Sept. 18.", "Nearly 9,000 people retweeted the post. Cornett said in a subsequent tweet that he had “no idea” if it was true.", "The baseless assertion made its way onto conservative websites, gaining traction online alongside other falsehoods about Ford. In some cases, the supposed Gorsuch accusation was dropped in the form of a question or with a caveat, but nevertheless spread as if credible.", "“Rape Accuser Allegedly Sent Feinstein SAME Letter Last Year — About Someone Else,” declares the Sept. 19 headline on madworldnews.com.", "The article goes on to name Gorsuch and cites a story from theblacksphere.net, the website of political commentator and Fox News contributor Kevin Jackson.", "Feinstein, a Democratic senator from California, received a July letter from Ford about her allegations against Kavanaugh, which the senator later provided to the FBI. Kavanaugh has said the allegations are “completely false.” Feinstein’s office disputed the idea that she received a previous allegation by Ford against Gorsuch. A spokesman, Tom Mentzer, told us in an email: “That is false.”", "Jackson’s article on theblacksphere.net advanced the rumor with a story headlined (with a noticeably absent question mark): “Did Kavanaugh Accuser Send SAME Letter About Gorsuch.”", "But the post — which describes Ford as a “poster child” who is “part of the plot to bring down men” — suggests the possibility carries weight.", "After citing Cornett’s tweet, Jackson writes: “As Josh Cornett suggests, the mystery is developing. But I wouldn’t be surprised.”", "Other websites carried the claim with caveats. “There are rumblings that Ford also accused Gorsuch of abuse,” a Gateway Pundit article said. “But there is no evidence to support this.”", "Well-known conservative radio host Rush Limbaugh used a similar approach.", "“I want to share some things with you that may be fake news, but if they’re not fake, I want to be on record as having had them for you. There’s a Twitter thread out there. I have no idea the veracity because, as you know, I do not ‘twit,'” a Sept. 18 post on his website reads. “But this particular thread claims that the reason that Dianne Feinstein was reluctant to go public with Christine Blasey Ford’s letter is because she received a similar letter from the woman about Judge Gorsuch.”", "It added: “No idea whether this is fake news or true.”", "It’s the former.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Brown, Emma. “California professor, writer of confidential Brett Kavanaugh letter, speaks out about her allegation of sexual assault.” Washington Post. 16 Sep 2018.", "Diserio, Rebecca. “Rape Accuser Allegedly Sent Feinstein SAME Letter Last Year — About Someone Else.” Madworldnews.com. 19 Sep 2018.", "Hoft, Jim. “Christine Blasey Ford Has Record of Questionable Integrity – Kavanaugh and Gorsuch Went to Same School.” The Gateway Pundit. 18 Sep 2018.", "Jackson, Kevin. “Did Kavanaugh Accuser Send SAME Letter About Gorsuch.” Theblacksphere.net. 18 Sep 2018.", "Mentzer, Tom. Spokesman for Sen. Dianne Feinstein. Email sent to FactCheck.org. 21 Sep 2018.", "“Two Rumors That Could Be Fake News But Ring True.” Rushlimbaugh.com. 18 Sep 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]