["About this rating", "Ohio State University researchers analyzed ice core samples retrieved from ice fields located atop Mount Kilimanjaro in Tanzania. The findings suggested that three “catastrophic droughts” took place over the fields' 11,700-year history, one of which coincided with the biblical story of Joseph 3,600 years ago.", "No “remains” were found at the ice fields, as some media reports claimed. Furthermore, the researchers did not determine that the findings provide evidence to support a “well-known Bible passage in the book of Genesis.”", "The findings of the study neither confirm nor deny the existence of Joseph and his prophetic dreams described in the Bible.", "In 2000, researchers studying the rate of ice melt atop Tanzania’s Mount Kilimanjaro constructed for the first time a climatic record of the African continent. In doing so, they extracted ice core samples that contained critical environmental information that spanned nearly 12,000 years.", "Reddit users and some media publications speculated at the time that “remains” found on Mount Kilimanjaro provided evidence to support the story of Joseph, a well-known Bible passage recorded in the book of Genesis that described a catastrophic drought in what is now Egypt nearly 4,000 years ago.", "The collected ice core samples — not “remains” — were analyzed and described in a study published in the Oct. 18, 2002, journal Science, which characterized three “catastrophic droughts” in the region, one of which coincided with the proposed drought depicted in the story of Joseph. While the findings provide some evidence that events depicted in the Bible occurred, they do not confirm the existence of Joseph or his prophetic dreams. It is also important to note that no human, anthropological, or archaeological remains were recovered at the location of the ice core sampling.", "Ice core samples play a vital role in understanding the history of our planet. Climatic events spanning thousands of years are recorded in layers of ice in much the same way that tree rings paint a picture of the environmental conditions that existed during their growth and development. As ice and snow layers build up over millennia, particulates, oxygen bubbles, and dissolved chemicals captured in the snow become part of the ice to create a record of climate conditions.", "“Layers of ice accumulate over seasons and years, creating a record of the climate conditions at the time of formation, including snow accumulation, local temperature, the chemical composition of the atmosphere including greenhouse gas concentrations, volcanic activity, and solar activity,” explained the National Science Foundation Ice Core Facility, which was not affiliated with the study, on its website.", "In 2000, researchers at Ohio State University extracted six core samples retrieved from three shrinking ice fields atop Mount Kilimanjaro at a drill site located above 19,300 feet in what the researchers described as the “last opportunity to establish an ice core record of the African climate.” In particular, the scientists planned to look for chemical markers in the ice. In this case, that's a spike in the isotope chlorine-36, a radioactive remnant of nuclear bomb testing in the 1950s that scientists use to calibrate historic records in ice. The same spike has been found in South America and China.", "After calibrating the timeframe of the samples, the scientists found that the tropical glaciers from where they were extracted began to form 11,700 years ago. They also found chemical and atmospheric evidence of three catastrophic droughts that were 8,300, 5,200, and 4,000 years ago, the last of which was characterized by a visible layer of dust that marked a 300-year drought in the region described in the book of Genesis.", "That Genesis story tells the tale of Joseph, the son of a rich man named Jacob. Joseph was given a colorful coat by his father that at the time would have held prestige in a world where vivid fabrics were costly to dye. Joseph’s brothers grew envious of their father’s perceived preference for Joseph and ultimately captured and sold Joseph into slavery. After suffering years of servitude and imprisonment, Joseph reportedly gained a reputation for interpreting dreams and told the pharaoh of Egypt that the land would experience seven years of bounty followed by seven years of famine, which ultimately led to his role as a key adviser to the pharaoh.", "Though no archaeological evidence or written record exists to confirm the Biblical account of Joseph, the BBC suggested at the time the study was published that the ice core samples may confirm that the drought did take place roughly four millennia ago — a time that correlates with Joseph’s story projected to take place around 3,600 years ago.", "An 1863 painting by Léon Pierre Urbain Bourgeois shows Joseph being recognized by his brothers after having served the pharaoh of Egypt. Creative Commons", "In short, while the findings do not confirm that Joseph was a real person or that he experienced prophetic dreams that led to his appointment as an adviser to the Egyptian pharaoh, evidence exists to suggest that the droughts and the following centuries of famine described in the Bible may hold some truth.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]