["About this rating", "In October 2018 the Facebook community page for a popular online comedy series brought attention to the horrific treatment LGBTQ Germans received not only during World War II, but afterwards.", "\"An estimated 15,000 gay people were incarcerated in Nazi concentration camps,\" the post on the Lizzy The Lezzy page stated. \"It's unclear on how many died once in the camps.\"", "The post was accompanied by a picture of a pink triangle -- the symbol officials in Nazi Germany used to identify and ostracize gay concentration camp prisoners -- and a quote drawn from the website for The Pink Triangle of San Francisco, an annual event remembering those victimized under Nazi rule:", "At the end of the war, when the concentration camps were finally liberated, virtually all of the prisoners were released except those who wore the pink triangle. Many of those with a pink triangle on their pocket were put back in prison and their nightmare continued.", "Both claims made in the post are accurate, according to the United States Holocaust Memorial Museum:", "Between 1933 and 1945, an estimated 100,000 men were arrested for violating Nazi Germany's law against homosexuality, and of these, approximately 50,000 were sentenced to prison. An estimated 5,000 to 15,000 men were sent to concentration camps on similar charges, where an unknown number of them perished.", "The men arrested for being gay were targeted under a revised version of a 19th century statute, Paragraph 175, which was expanded to categorize homosexuality as a crime of \"indecency.\" But even though the U.S. and their allies defeated the Nazi regime, the law remained in effect after World War II, as the Holocaust Memorial museum's exhibit on the regime's anti-gay persecution states:", "As the Allies swept through Europe to victory over the Nazi regime in early 1945, hundreds of thousands of concentration camp prisoners were liberated. The Allied Military Government of Germany repealed countless laws and decrees. Left unchanged, however, was the 1935 Nazi revision of Paragraph 175. Under the Allied occupation, some homosexuals were forced to serve out their terms of imprisonment regardless of time served in the concentration camps. The Nazi version of Paragraph 175 remained on the books of the Federal Republic of Germany (West Germany) until the law was revised in 1969 to decriminalize homosexual relations between men over the age of 21.", "Paragraph 175 was not repealed in full, however, until 1994. On 22 March 2017, German Chancellor Angela Merkel and her cabinet approved a bill that overturned convictions for gay men which had carried out under Paragraph 175 between 1949 and 1969 and also provided compensation for surviving victims.", "The Nazi symbol for gay concentration camp prisoners has gone through a change of its own, as the Pink Triangle of San Francisco's site states:", "The pink triangle symbol has since evolved into an important reminder for the gay, lesbian, bisexual and transgender community of the continuing homophobia and inhumanity against them and other repressed minorities around the world. We transform the side of the Twin Peaks north hill facing the Castro district and downtown San Francisco, into a memorial by installing a giant pink triangle made up of dozens of pieces of pink canvas that can be seen from miles away during SF Pride weekend each year.", "United States Holocaust Memorial Museum.   \"Persecution of Homosexuals Under the Third Reich.\"\r\n    Accessed 11 October 2018.", "United States Holocaust Memorial Museum.   \"Nazi Prosecution of Homosexuals, 1933-1945.\"\r\n    Accessed 11 October 2018.", "Connolly, Kate.   \"Germany to Overturn Convictions of Gay Men Prosecuted After War.\"\r\n    The Guardian.   22 March 2017.", "The Pink Triangle.    \"History: The Symbol.\"\r\n    Accessed 11 October 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]