["NCRB की रिपोर्ट: महिलाओं के लिये भारत सर्वाधिक असुरक्षित है कारण: भारत में 95% बलात्कार मुल्ले करते हैं 2016 मे कुल 84734 बलात्कार में से 81000 बलात्कार मुल्लों ने किया और इनकी शिकार महिलाओं में से 96% महिलाएं गैर मुस्लिम हैं इनके जनसंख्या बढेगी बलात्कार की संख्या बढते जायेगी (NCRB report: India is most dangerous for women reason: In India, 95% of the rape cases have a Muslim perpetrator. Of the total 84734 rape cases, 81000 rapes had a Muslim rapist and 96% of the victims are non-Muslims and with an increase in their population, number of rapes will also increase -translation). This message is currently circulating on social media platforms. It claims that Muslim men are responsible for an overwhelming number of rapes and that most of the victims are non-Muslim women. This message states that these figures are from the year 2016.", "Among those who have shared, it is Mahesh Vikram Hegde, founder of fake news website PostCard News on July 3, albeit without reference to the NCRB report. At the time of writing, Hegde’s tweet has been retweeted more than 1200 times. Hegde is also followed by PM Modi on Twitter. (UPDATE: The tweet has now been deleted, a screenshot of the original tweet has been reproduced below)", "The provocative claim has also been shared on Twitter and Facebook.", "It is evident from this message that a fear psychosis is sought to be created among members of the majority community by portraying Muslims as sexual predators.", "National Crime Record Bureau(NCRB) is the nodal agency for the compilation of statistics on crime in India. The last report by the NCRB on ‘Crime in India’ which catalogs incidents of crime committed in 2016. According to the methodology section adopted in 2016, it is the ‘population’ segment that defines the demography on the basis of which crimes are recorded in the document. There is no reference to religion as a category for recording crime.", "We have posted below relevant screenshots from the ‘Crime in India’ 2016 report. The data shown below is a tabulation of the incidents of rape across different states in 2016. As can be seen, there are two broad categories under which crimes of rape are tabulated- Age group of the victims, and offenders’ relation to the victims.", "2. Offenders’ relation to the victim is tabulated, with the two broad categories of offenders known to the victims and not known to the victims.", "As can be seen from the data in the ‘Crime In India’ report, there is no column for religion and the data is limited to age and offenders’ relationship with the victim.", "In an official statement given to Alt News regarding the claim, NCRB has clarified, “It is totally wrong data & complete misrepresentation of facts as NCRB does not collect data on the religion of accused & victims. It is malicious propaganda, which needs to be countered by the law-abiding citizens. Concerned officials have been advised to initiate legal action.”.", "Incitement to communal hatred is a recurring theme in the social media ecosystem wherein ingenious ways are devised each day to further suspicion, prejudice, and hate. Such messages exploit the gullibility of social media users who may not be aware of the methodology and function of an institution like the NCRB.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]